{
  "movie_name": "12 Angry Men",
  "movie_id": "1000013_12_angry_men",
  "total_reviews": 51,
  "reviews": [
    {
      "text": "A film like 12 Angry Men comes around once in a lifetime, and it will remain a blueprint for what a masterpiece looks like.",
      "author": "Nadir Samara"
    },
    {
      "text": "This arguably remains Sidney Lumet's most compelling work, a sweaty, sustained drama that milks its claustrophobic setting for all it’s worth.",
      "author": "Matt Brunson"
    },
    {
      "text": "12 Angry Men is one of the best courtroom dramas in cinematic history.",
      "author": "Danielle Solzman"
    },
    {
      "text": "It’s a near perfect mix of theme and setting, personal drama and social commentary, a microcosm that suggests an entire world outside the frame ...",
      "author": "Sean Axmaker"
    },
    {
      "text": "Sidney Lumet's solid success is achieved without even once resorting to flashbacks or other standard procedures of the film trade. The secret rests in spirited dialogue, realistic setting and, of course, the excellent cast of outstanding character actors.",
      "author": "Edward Kosmal"
    },
    {
      "text": "Within its simplicity there is a freshness and ingenuousness about Twelve Angry Men uncommon in a slickly sophisticated film industry.",
      "author": "Jonathan Baumbach"
    },
    {
      "text": "One has to imagine the dramatic imagination that went into creating this fascinating, psychologically realistic motion picture, which, from start to finish, never changes its subject or its location.",
      "author": "André Bazin"
    },
    {
      "text": "A court drama that transcends time or place; a real masterpiece. [Full review in Spanish]",
      "author": "Gisela Savdie"
    },
    {
      "text": "If you have never seen the film I cannot recommend it enough.",
      "author": "Sarah Brinks"
    },
    {
      "text": "Reginald Rose's script is one of deep revelation.",
      "author": "Richard Propes"
    },
    {
      "text": "Thought-provoking, continually riveting, and absolutely unforgettable - and surprisingly designed around a very simple, tightly budgeted, special-effects-free premise.",
      "author": "Mike Massie"
    },
    {
      "text": "\"12 Angry Men\" puts the full range of human good and evil on display. It posits that, ultimately, the universe is benevolent, and our job, regarding each other, is to attempt with our best effort and greatest compassion to elucidate and clarify the truth.",
      "author": "Mark Jackson"
    },
    {
      "text": "One of Hollywood's more notable borrowings from television is this Reginald Rose drama about the soul-searchings of a murder-trial jury...",
      "author": "Clyde Gilmour"
    },
    {
      "text": "This movie is a masterpiece. That term gets thrown around a lot -- it's a very easy thing to say about great films like this -- but this movie is one of the best. This is one of the very few films that I will call perfect.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "In the 60 years since its release, Sidney Lumet's masterpiece has lost none of its impact. In this age of unreason, 12 Angry Men remains sorely and urgently contemporary.",
      "author": "Christopher Machell"
    },
    {
      "text": "With each new viewing I come away feelings as if I have peeled away another layer on the characters and their buried motives.",
      "author": "David Keyes"
    },
    {
      "text": "Lumet in his first film records it as a meticulous laboratory experiment, a clammy orchestra",
      "author": "Fernando F. Croce"
    },
    {
      "text": "...the film has aged surprisingly well in the years since its 1957 release.",
      "author": "David Nusair"
    },
    {
      "text": "There is real value is how it allows each member of the cultural mosaic of a jury to develop into distinct, damaged, and interesting characters",
      "author": "Dan Jardine"
    },
    {
      "text": "Too few films take on the art of arguing as a subject; we could certainly use more of them, but until then, Lumet's window into strained civic duty will continue to serve mightily.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "The film takes a confined, almost completely banal real-world location and makes it completely dynamic, using incredibly nimble camera movements to establish character motivation and theme.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "The cast is incredible, the writing superb, and the film is unparalleled in its sheer excellence.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "This was Sidney Lumet's first movie and it's as riveting as it was back in the late 50s, when everything was changing.",
      "author": "Eric Melin"
    },
    {
      "text": "an incisive and gripping film",
      "author": "James Kendrick"
    },
    {
      "text": "Lumet keeps things tense, sweaty, suspenseful and entertaining despite the contrived story line.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Outstanding Henry Fonda jury classic.",
      "author": "M. Faust"
    },
    {
      "text": "12 Angry Men has some shrewd observations to sell about argumentation and group behavior, but they're not the ones of which the film seems most proud.",
      "author": "Nick Davis"
    },
    {
      "text": "Not much action, lots of words, great cinema.",
      "author": null
    },
    {
      "text": "The film leaves a tremendous impact.",
      "author": "Hy Hollinger"
    },
    {
      "text": "Every bit the classic it's been made out to be for all these years.",
      "author": "Christopher Null"
    },
    {
      "text": "Power house jury room drama w/cast of memorable actors.",
      "author": "Steve Crum"
    },
    {
      "text": "Makes no self-saluting motions to greater importance, which gives the material the much-desired breathing room it needs to reach full potency.",
      "author": "Rob Humanick"
    },
    {
      "text": "Mechanically written, but within its own middlebrow limitations, it delivers the goods.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "A strangely realistic thriller.",
      "author": "Geoff Andrew"
    },
    {
      "text": "Sidney Lumet's Oscar-nominated feature directing debut is a brilliant courtroom drama, featuring a superlative cast that includes Henry Fonda (also producer), Martin Balsam, Ed Begley, Jack Warden, and E.G. Marshall.",
      "author": "Emanuel Levy"
    },
    {
      "text": "A masterful work of debate and dialogue; of shifting momentum and the ideal of sticking to your scruples in the face of antagonistic groupthink.",
      "author": "Phil Villarreal"
    },
    {
      "text": "This film is a great combination of an adult theme and the treatment suitable for younger audience.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Ainda que se passe em um nico ambiente, esta obra-prima possui um alcance emocional imensurvel - e  incrvel que tenha sido o primeiro longa-metragem de Lumet.",
      "author": "Pablo Villaça"
    },
    {
      "text": "One-room dramas don't get much better than this",
      "author": "Jon Niccum"
    },
    {
      "text": "Although it may sound ungallant, these 12 Angry Men, are all right without distaff glamour. Their dramas are powerful and provocative enough to keep a viewer spellbound.",
      "author": "A.H. Weiler"
    },
    {
      "text": "An intense concentration of power, and my all-time favourite film.",
      "author": "Ian Mantgani"
    },
    {
      "text": "Sidney Lumet's debut feels a bit stagy but is never short on tension.",
      "author": "Dan Lybarger"
    },
    {
      "text": "This is a film where tension comes from personality conflict, dialogue and body language, not action.",
      "author": "Roger Ebert"
    },
    {
      "text": "Pure dynamite in movie form.",
      "author": "Scott Weinberg"
    },
    {
      "text": "12 Angry Men (1957) is the gripping, penetrating, and engrossing examination of a diverse group of twelve jurors - all male, mostly middle-aged, white, and",
      "author": "Tim Dirks"
    },
    {
      "text": "12 Angry Men ranks as the tautest courtroom drama you'll ever see, surpassing Lumet's very good 1982 drama, The Verdict.",
      "author": "John A. Nesbit"
    },
    {
      "text": "While the composition of juries might change over time, the issues and attitudes that are explored here are timeless, as is this classic film.",
      "author": "Brian Webster"
    },
    {
      "text": "Thoroughly engaging, there is nothing dated or corny in Reginald Rose's intensely knowing screenplay and Lumet's energetic direction.",
      "author": "Ian Nathan"
    },
    {
      "text": "In a time of bloated when special effects have become the real stars, going back to a classic like this can remind viewers what movie making is supposed to be about -- acting.",
      "author": "Steve Rhodes"
    },
    {
      "text": "Completely deserved its high status of undisputed classic.",
      "author": "Dragan Antulov"
    },
    {
      "text": "A film with texture, humour and relevance at all times. All in 91 minutes.",
      "author": "Urban Cinefile Critics"
    }
  ],
  "release_year": 1957,
  "duration": 95,
  "genres": [
    "Drama"
  ],
  "age_rating": "G",
  "synopsis": "Following the closing arguments in a murder trial, the 12 members of the jury must deliberate, with a guilty verdict meaning death for the accused, an inner-city teen. As the dozen men try to reach a unanimous decision while sequestered in a room, one juror (Henry Fonda) casts considerable doubt on elements of the case. Personal issues soon rise to the surface, and conflict threatens to derail the delicate process that will decide one boy's fate.",
  "popularity": 9.7,
  "poster_url": "https://image.tmdb.org/t/p/original/ow3wq89wM8qd5X7hWKxiRfsFf9C.jpg"
}