{
  "movie_name": "21 Jump Street",
  "movie_id": "21_jump_street_2011",
  "total_reviews": 223,
  "reviews": [
    {
      "text": "Let's face it.  Genitalia jokes and people on drugs are funny.  Cringing over homophobia and stereotypes is funny.",
      "author": "Don Shanahan"
    },
    {
      "text": "Here’s a movie that’s aware of all its clichés, but somehow, with no limit of energy and humor, uses our awareness of these formulas as its strength.",
      "author": "Brian Eggert"
    },
    {
      "text": "While some original films make it through the cracks, almost everything these days is a sequel, reboot, or remake...our wallets are what do the talking and we keep rewarding Hollywood for this behavior.",
      "author": "Danielle Solzman"
    },
    {
      "text": "With little in the way of a compelling story the jokes make up for the lack of plot with a hit rate of roughly 70%. More than enough to achieve a passing grade.",
      "author": "Owen Nicholls"
    },
    {
      "text": "A deluge of action, some noteworthy cameos, and the always-reliable vulgar comedy to contrast with the more intelligent, self-aware mockery.",
      "author": "Mike Massie"
    },
    {
      "text": "Do you want to laugh? Do you find Hill's usual brand of humor funny? If so, you'll likely have a blast.",
      "author": "Richard Propes"
    },
    {
      "text": "In 2012, did anyone expect a \"21 Jump Street\" movie to be good? Because it is.",
      "author": "Brent McKnight"
    },
    {
      "text": "The postmodern posturing speaks less to me of the film's wit, and more as disingenuous apologism for its own laziness and lack of originality.",
      "author": "PJ Nabarro"
    },
    {
      "text": "The Funniest Film of the Year - 21 Jump Street!! Jump on over to Jump Street now.",
      "author": "Debbie Lynn Elias"
    },
    {
      "text": "Despite all the coy formula-flipping and compulsive jokes, what wins us over is the odd-couple chemistry of the two leads.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "To my surprise it turned out to be the big hulking anatomical joke-spewing genuine bromance-building raunchcom that could.",
      "author": "Leslie Combemale"
    },
    {
      "text": "A surprisingly strong film with a solid balance of humor and heart, actually making us feel for and identify with the characters rather than just go through the usual paces of an R-rated comedy.",
      "author": "Mattie Lucas"
    },
    {
      "text": "It knows it is rather silly fluff, so it revels in its own raunchy silliness -- creating a comedy that delivers plenty of laughs.",
      "author": "Micheal Compton"
    },
    {
      "text": "A surprisingly sharp film that mixes several genres together - and then subverts them all.",
      "author": "Ivan Radford"
    },
    {
      "text": "Sure, references to \"Glee\" and Robert Downey Jr.'s drug years may not hold up quite as well in 20 years, but in an era of disposable pop culture, \"21 Jump Street\" is anything but, likely to be namechecked for a lot longer.",
      "author": "Stephen Saito"
    },
    {
      "text": "All in all, this is not the atrocity it could have been and offers plenty of laughs to followers of the original and the uninitiated.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "... 21 Jump Street is consistently funny throughout, with a few really huge laughs peppered in the script.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Not that the original series was high-brow/must-see television, but I figured any remake of it in the 21st century would at least be far more ambitious than this tired bit of recycling.",
      "author": "Tambay Obenson"
    },
    {
      "text": "Fast, funny and smarter than its dunce-cap demeanor lets on.",
      "author": "Sean Burns"
    },
    {
      "text": "A lot smarter and a lot funnier than it has any real right to be.",
      "author": "Will Leitch"
    },
    {
      "text": "Chaotic and far-fetched yet funny enough to have audiences rolling in the aisles.",
      "author": "Tom Glasson"
    },
    {
      "text": "Given the broad drama of the series, their movie should be full of big ideas, and instead settles for redundant gags involving drugs, guns, and high school cliques.",
      "author": "Kirk Baird"
    },
    {
      "text": "The supporting characters add depth to the comedic pairing of Tatum and Hill.",
      "author": "Rebecca Onion"
    },
    {
      "text": "Remake or no, this movie is hysterical.",
      "author": "Cammila Albertson"
    },
    {
      "text": "21 Jump Street gets the remake job done with tongue-in-cheek style & plenty of outrageous moments.",
      "author": "Ben Kendrick"
    },
    {
      "text": "Because of Bacall's skill at writing great comedic material and Lord's and Miller's talent behind the camera, \"21 Jump Street\" became more than what it originally appeared to be, which is a surprise I'm always grateful for.",
      "author": "Jeff Beck"
    },
    {
      "text": "21 Jump Street takes the basic concept of the original series, and uses it to create an action/comedy that is not only palatable to modern audiences, but appealing as well.",
      "author": "Amy Curtis"
    },
    {
      "text": "Co-written, produced by, and stars Jonah Hill, who took exactly the right attitude towards the movie: He and his costar Channing Tatum embraced the stereotypes, laughed at themselves, and came up with a surprisingly funny film.",
      "author": "Eric Melin"
    },
    {
      "text": "21 Jump Street is a smartly stupid buddy comedy that plays with the ridiculousness of its set-up.",
      "author": "Mark Pfeiffer"
    },
    {
      "text": "Interchangeable with dozens of other \"dude\" comedies that have come before it.",
      "author": "Richard Knight"
    },
    {
      "text": "...feels more like a guerrilla stunt than a soulless and cynical cash grab. Hooray for Hollywood, I guess.",
      "author": "Josh Larsen"
    },
    {
      "text": "Slick and funny as hell, 21 Jump Street is one of the best comedies of the year.",
      "author": "R.L. Shaffer"
    },
    {
      "text": "A raucous, entertaining, and incredibly funny film that respects the premise of the original series...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "For an action comedy, \"21 Jump Street\" had less action or comedy than I expected. It felt as if I spent too much time waiting for something to happen-either for a joke to fire, or a pistol.",
      "author": "James Plath"
    },
    {
      "text": "The best thing that can be said for it is that it never coasts on just one type of joke; funny in execution, not just in concept.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "A floppy cross of high-school movie and buddy-cop comedy. Overdoses on flaccid penis and vagina 'jokes,' indulges in the ain't-this-cool?!ness of a cop-action flick, and passes out on the cliché-couch of bromance.",
      "author": "Brian Gibson"
    },
    {
      "text": "The movie is perfectly pleasant, a smidgen too aware of itself but consistently sharp.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "While the film struggles at the start as Tatum and Hill share little chemistry, they improve minute by minute and are one of the shining lights by the end, their journey boasting a surprising emotional pull.",
      "author": "Sam Bathe"
    },
    {
      "text": "Feels like it's doing something new with the teen genre, while still acknowledging its debt to the classics that came before it.",
      "author": "Charlie Lyne"
    },
    {
      "text": "t's less fun when the guns come out in the final act, but there's a moment late in the game that redeems the movie's predictable beats, before the whole thing dissolves into entropy and disorder.",
      "author": "Philip Martin"
    },
    {
      "text": "21 Jump Street is nothing like the original series. Jonah Hill and Channing Tatum have a great chemistry and the strong beginning and ending do a pretty good job disguising the flabby middle. It's crass, self effacing, 'meta', stupidity and it works.",
      "author": "Blake Howard"
    },
    {
      "text": "Clever, profane and action-packed, '21 Jump Street' fairly leaps onto the big screen as one of the most enjoyable movies of the (still-admittedly young) year.",
      "author": "Linda Cook"
    },
    {
      "text": "A high-water mark for recent mainstream comedies. Consistently amusing and frequently uproarious.",
      "author": "Rob Humanick"
    },
    {
      "text": "Raunchy and profane by design, nothing like the 80s TV show, nonetheless hilarious adult comedy - especially the first hour or so.",
      "author": "Bruce Bennett"
    },
    {
      "text": "Yes, some of the movie's funny bits were in the trailer. After all, they were trying to get you to buy a ticket. But, this is one of the rare comedies that delivers even more than promised.",
      "author": "Paul Chambers"
    },
    {
      "text": "The best comedy to be released so far this year.",
      "author": "Dominic Corry"
    },
    {
      "text": "I'm as surprised as you that this film could end up being the funniest of 2012.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Lord and Miller mine the script... for plenty of profane laughs as they set up Hill and Tatum as a hilariously off-kilter comedy duo.",
      "author": "Sean P. Means"
    },
    {
      "text": "...it doesn't help, either, that large chunks of the film have been improvised wholesale by the various actors, which only exacerbates the film's excessively slapdash feel.",
      "author": "David Nusair"
    },
    {
      "text": "The late-eighties TV series is rebooted with jolts of sentiment, personal discovery, and wild comedy.",
      "author": "Richard Brody"
    },
    {
      "text": "... latest in endless slew of painful spoofs based on TV shows takes an OK premise and milks it for an occasional chuckle before devolving into a succession of increasingly lame sketches.",
      "author": "Glenn Lovell"
    },
    {
      "text": "The humor squeezes just about all the giggle juice it can get out of the R rating. If you need a movie map, this 21 Jump Street is on the FAR side of town from Sesame Street.",
      "author": "Neil Pond"
    },
    {
      "text": "by no means a great comedy, but it does demonstrate that playing against the grain can be a good move, especially when the people in charge have run out of ideas",
      "author": "James Kendrick"
    },
    {
      "text": "An unlikely (but funny) return to high school",
      "author": "Robert Denerstein"
    },
    {
      "text": "It doesn't matter if you never saw the original, because this movie is a clever, fast-paced, action comedy...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "A good-natured must-see for fans of broad, silly comedies with a little something under the surface too. Bright, breezy and brilliant.",
      "author": "Catherine Bray"
    },
    {
      "text": "It is funny because it is pointed and smart, and it is also funny because it is unusually crass, but the chief takeaway here should be that it is funny.",
      "author": "Tim Brayton"
    },
    {
      "text": "Rigorous planning likely was involved in taking the dumb concept of \"21 Jump Street\" and turning it into something that seems so effortlessly brilliant.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "While hardly raising the bar in action-comedy, it's still a fun, irreverent, laugh-out-loud take on the beloved, small-screen original.",
      "author": "Ed Gibbs"
    },
    {
      "text": "Halfway through this affable, inspired grab bag of a comedy, it hit me that what I was watching wasn't merely a good movie but the Greatest TV Adaptation Ever Made.",
      "author": "Rick Kisonak"
    },
    {
      "text": "I won't go so far as to say it's good, but 21 Jump Street is certainly better than it has any right to be.",
      "author": "Ken Hanke"
    },
    {
      "text": "The humor may be coarse and crude but it is funny, and with these movies that is what counts.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "It's immature, rude and sometimes quite funny, at least until the same gag makes a fourth or fifth lap around the track.",
      "author": "Corey Hall"
    },
    {
      "text": "It has a tone all its own: drunk enough to lower the inhibitions; not so drunk that it becomes unintelligible.",
      "author": "Donald Clarke"
    },
    {
      "text": "Funny and clever but ultimately dispiriting, with a finale that affirms the queasy wink-wink legalized bullying of its early police-vs.-citizens scenes, and that associates manhood with a willingness to kill with a gun -- all for a cheap laugh.",
      "author": "John Beifuss"
    },
    {
      "text": "21 Jump Street is as fresh and original a comedy you'll ever find that is based on a totally stolen concept. If only all Hollywood rip-offs could be this good.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Strained and crass comedy.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It is entranced by male bonding, appendages and the chance to enact car chases, and but it's still a fairly filthy, funny flick that does nobody any harm.",
      "author": "Siobhan Synnot"
    },
    {
      "text": "It's certainly preferable to any recent Johnny Depp vehicles.",
      "author": "Alistair Harkness"
    },
    {
      "text": "It's also loaded with a series of sidesplitting moments that seem to work on simple brute force.",
      "author": "Dan Lybarger"
    },
    {
      "text": "[Hill and Tatum] are well cast and rather good, as in a knowing way is Ice Cube as their parodically irascible superior.",
      "author": "Philip French"
    },
    {
      "text": "A scattershot hodgepodge of scatological and penile humor, \"21 Jump Street\" owes less to Johnny Depp's 1987 television launch pad series than it does to a mentality of lowest common denominator.",
      "author": "Cole Smithey"
    },
    {
      "text": "A conscious two fingers to the old show's baby po-face.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Maybe I'm just getting too old for this shit.",
      "author": "Scott Nash"
    },
    {
      "text": "The most immature R-rated movie I've ever seen. And I've seen all three Jackasses, but this is a good thing.",
      "author": "Fred Topel"
    },
    {
      "text": "Overall \"21 Jump Street\" is an over the top action film with comedy that is not always perfect, but what is perfect is the blast this undercover adventure is!",
      "author": "Jolene Mendez"
    },
    {
      "text": "The only thing you need to know about this cinematic remake of the 1980's television favorite 21 Jump Street is that it's funny.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "... Shows more imagination than most of today's original productions.",
      "author": "Greg Maki"
    },
    {
      "text": "It earns its laughs and never takes our affection for granted.",
      "author": "Rob Vaux"
    },
    {
      "text": "What's most refreshing about the film is how it acknowledges its own narrative absurdities and retreaded tropes in a manner that's neither forced nor self-congratulatory.",
      "author": "Matt Brunson"
    },
    {
      "text": "\"21 Jump Street\" is the funniest film of the year so far.",
      "author": "Michael A. Smith"
    },
    {
      "text": "It is smart, silly, straightforward, conceptual, satiric, raunchy, and character-based, all at once. I laughed often and I laughed hard.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Hollywood is obsessed with strip-mining old TV shows and movies for remake fodder these days, but 21 Jump Street is an example of how it can be done well.",
      "author": "Tim Martain"
    },
    {
      "text": "tries to be both a comedy and an action film, but only succeeds as a comedy. It's extremely funny, with Hill and Tatum displaying a disturbing amount of chemistry.",
      "author": "Kevin Carr"
    },
    {
      "text": "Rather than a re-hash of the original, though, this is a re-imagining by Hill, who ... set it in the present with appropriate nods to the original and a whole lot of silliness. Nostalgia has rarely been better served",
      "author": "Andrea Chase"
    },
    {
      "text": "Adheres to the rule that every TV show is subject to a cinematic rendering, regardless of the strength of its stories, appeal of its characters, or extent of its following.",
      "author": "Clint O'Connor"
    },
    {
      "text": "21 Jump Street on TV is a drama. The movie no way takes itself seriously. That helps. Lots. So does an R-rating where the characters are free to -- uh -- express themselves.",
      "author": "Gary Wolcott"
    },
    {
      "text": "A rude and raucous action comedy spoof, which turns the high-minded, message-laden original series on its head in order to poke fun at everything from Hollywood's desperate recycling of the past to the tired conventions of buddy-cop movies.",
      "author": "Jason Best"
    },
    {
      "text": "Was it because 'The Dukes of Hazzard' and 'The A-Team' worked out so well for us?",
      "author": "James Verniere"
    },
    {
      "text": "This movie embraces everything that should make it lousy, calling out itself for aping the source's bad ideas then flipping the script with meta precision.",
      "author": "Steve Persall"
    },
    {
      "text": "TV-based buddy comedy is crude but hilarious.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "Tatum shows some range. Hill loses ground.",
      "author": "Kelly Vance"
    },
    {
      "text": "A great cast, a surprisingly fresh and funny script, and the best non-explosion action scenes on film combine to make 21 Jump Street one of 2012's best comedies.",
      "author": "Rebecca Murray"
    },
    {
      "text": "This is a fine screwball comedy in the old tradition...Ice Cube had me laughing out loud as the profane, angry boss of Jonah Hill and Channing Tatum.",
      "author": "Tony Medley"
    },
    {
      "text": "Tatum is absolutely hilarious in the movie and not in the unintentional way his stiff performances in romantic dramas like The Vow turn out to be.",
      "author": "Ethan Alter"
    },
    {
      "text": "One might perceive \"21 Jump Street\" --- this version --- as strictly for adolescent boys. And yet, for once, I find it satisfyingly entertaining.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "It works primarily due to the expert comic timing of its two stars.",
      "author": "David Kaplan"
    },
    {
      "text": "It winds up indulging in some of the same buddy-cop cliches that it tries to lampoon.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The whole crew makes clear its affections for action cinema, trashy television and the YouTube generation alike while having fun at the expense of all three.",
      "author": "William Goss"
    },
    {
      "text": "Other than a few cracks here and there, this particular \"Street\" is one fun ride.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "The idea to play the concept for laughs is an inspired one, and Jonah Hill and Channing Tatum mine the material for all the crass, R-rated comedy that it's worth.",
      "author": "Mike Scott"
    },
    {
      "text": "The twist that makes this somewhat ragged comedy work as well as it does is that the two cops revert to the level of high-school immaturity as they blend in with the genuine teens around them.",
      "author": "Leonard Maltin"
    },
    {
      "text": "This bracing new take on 21 Jump Street has a playful spark all its own. It's a blast.",
      "author": "Peter Travers"
    },
    {
      "text": "It does contain several moments that do not seem to realize this and provide some unexpectedly big laughs at the oddest moments.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Most importantly, it acknowledges how lame reboots are by nature, and how rarely they honor the original.",
      "author": "Grae Drake"
    },
    {
      "text": "I am ashamed at how much I laughed at this movie.",
      "author": "Willie Waffle"
    },
    {
      "text": "Filthy, sweary, sweet and very funny all at the same time.",
      "author": "Alex Zane"
    },
    {
      "text": "A deliciously foul-mouthed buddy movie that rides roughshod over political correctness.",
      "author": null
    },
    {
      "text": "Jonah Hill and Channing Tatum are an inspired duo.",
      "author": "Peter Paras"
    },
    {
      "text": "A try-anything, fitfully amusing muddle that wears its mocking cynicism a bit too proudly.",
      "author": "Liam Lacey"
    },
    {
      "text": "The film is rude, speedy and outrageous, and we mean that in the best way.",
      "author": "Liz Braun"
    },
    {
      "text": "\"21\" makes clear from the beginning it is gobbling up some pop culture refuse in the name of nothing more than making fun of it and having fun with it.",
      "author": "Tom Long"
    },
    {
      "text": "This is the funniest movie I've seen in more than a year.",
      "author": "Kyle Smith"
    },
    {
      "text": "\"21 Jump Street\" might be yet another product of Hollywood's recycling program, but it deserves to be noticed.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Here's a film that's far cleverer than it needs to be, and for that reason alone, we should be grateful.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Perfect blend of action and comedy that doubles as a satire of teen culture and TV to film adaptations. Hill and Tatum are superb leads. Hilarious and fun.",
      "author": "Cameron Williams"
    },
    {
      "text": "As remakes of '80s properties go, you'd be hard pressed to find one so self-deprecating, yet ruthless.",
      "author": "David Medsker"
    },
    {
      "text": "Eventually, the film does run out of comic steam. But I'd say for 90 percent of its running time, the action and the comedy mix hums along at a terrific pace. This is a real surprise. (Full Content Review for Parents also available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "For its first half this movie does a reasonably clever job of reinvention, though the crudeness level is excessive; but the second half jumps the rails.",
      "author": "Frank Swietek"
    },
    {
      "text": "Loose and meandering, but it also knows how and when to entertain.",
      "author": "Dustin Putman"
    },
    {
      "text": "Funny and smarter than it has any right to be.",
      "author": "Charles Koplinski"
    },
    {
      "text": "21 Jump Street is another re-hash of a largely forgotten Eighties television series - but it's surprisingly enjoyable.",
      "author": "Christopher Tookey"
    },
    {
      "text": "A hit-and-miss hodgepodge of plotting and jokes redolent at least as often of desperation as of inspiration.",
      "author": "Shawn Levy"
    },
    {
      "text": "Tatum, best known for syrupy romances and action movies, turns out to have crackerjack comic timing and Brie Larson and Dave Franco are standouts.",
      "author": "Nell Minow"
    },
    {
      "text": "Miller and Lord clearly understand the push-and-pull and hyper-competitiveness that make guy friendships both complex and stupid.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "It's that rare comedy that's funny throughout, with a hilarious story that hinges on the unlikely pairing of Jonah Hill and Channing Tatum.",
      "author": "Claudia Puig"
    },
    {
      "text": "The basic premise -- that these two are supposed to be high school age and siblings -- is funny, but the joke, as is true of many others in this movie, is replayed way too often.",
      "author": "Peter Rainer"
    },
    {
      "text": "Overlong, but against the odds the usually wooden Channing Tatum is the comedy standout.",
      "author": "Mark Adams"
    },
    {
      "text": "21 Jump Street makes a virtue of low expectations, like an underachieving high school burnout coasting on his modest reserves of charm.",
      "author": "Dana Stevens"
    },
    {
      "text": "Against all odds, 21 Jump Street is an immensely enjoyable, frequently hilarious film.",
      "author": "Michael Burgin"
    },
    {
      "text": "Frenetic and loud can be funny on its own. But it requires either the finesse to be smart about playing stupid or sheer, balls-out craziness. Disappointingly, this has a hard time choosing between destinations and takes too long to find its way.",
      "author": "Nick Rogers"
    },
    {
      "text": "This cheerfully chaotic, gleefully vulgar action-comedy retread of the old television series has box-office success written all over it, and where's the harm? It's irresistibly funny until it isn't.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "In its outrageous way, 21 Jump Street has real laughs.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "It was inevitable that one of Hollywood's many recent reboots would eventually attain sentience. Hence the arrival of 21 Jump Street, a film that not only knows it's a remake, but knows how absurd it has to be to succeed as a remake.",
      "author": "Andrew Lapin"
    },
    {
      "text": "Against all odds, \"21 Jump Street\" is actually pretty funny and lifts movie comedy out of its recent creative rut.",
      "author": "Gary Thompson"
    },
    {
      "text": "Neither man has had a better foil. They are literally and figuratively trying to bring something out of each other, and they do.",
      "author": "Wesley Morris"
    },
    {
      "text": "It's no tribute to the original program, but a wink-happy perversion of the concept, raising hell in its own somewhat tedious, frequently hilarious way.",
      "author": "Brian Orndorf"
    },
    {
      "text": "This film is even better if you come in with no spoilers and low expectations, so we will build it up no more.",
      "author": "Peter Hartlaub"
    },
    {
      "text": "...a ridiculous amount of fun when screenwriter Michael Bacall (of the loathsome \"Project X\") isn't confusing crassness with comedy.",
      "author": "Laura Clifford"
    },
    {
      "text": "It's a good thing 21 Jump Street is funny, because in terms of pure filmmaking, it is a near-embarrassment.",
      "author": "Jason McKiernan"
    },
    {
      "text": "Channing Tatum and Jonah Hill play the dimwit cop duo who are sent back to their high school to pose as students in order to root out a drugs ring.",
      "author": "Adam Smith"
    },
    {
      "text": "This potty-mouthed and drug-laced reimagining of the 1980s TV show has one of the highest laughs-per-minute ratios since the Naked Gun films.",
      "author": "Carrie Rickey"
    },
    {
      "text": "It's not just a nostalgia-peddling cash-grab, offering raucous laughs contained in a jubilant male-bonding storyline.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Make no mistake, there is a fresh, focused and undeniably funny comedic sensibility that stays to the fore throughout.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Tatum and Hill steamroller any misgivings right from the start. They take a comedy connection that seemed doomed to fail - pairing Tatum's hunky command with Hill's nerdy neediness - and make it look like the most natural thing in the world.",
      "author": "Peter Howell"
    },
    {
      "text": "Tatum in particular is a huge surprise. He's always been a pretty face, but here (as in his recent SNL outing) he displays comedic chops we never saw coming.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "A raucous, obscene comedy that sustains its single strong joke for an extraordinarily long time.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Much of the humor involves trotting out cliches from cop movies and teen movies, then commenting on how dumb they are.",
      "author": "Ben Sachs"
    },
    {
      "text": "For all the personal growth that our two boys in blue are supposed to experience during the course of their mission, you might think that lessons about callous expressions of misogyny and homophobia might fit into the mix.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "21 Jump Street earns my genial nod because of its limber, 120-IQ take on the whole notion of movie revivals.",
      "author": "Richard Corliss"
    },
    {
      "text": "Writers Hill and Michael Bacall cleverly mix pop culture references, wit, and vulgarity to transform what might have been a one-joke knock-off into a comic original.",
      "author": "Monica Castillo"
    },
    {
      "text": "The comedy revels in putting dumb and/or inept spins on cinematic formulas. It results in a shoddy movie, but one that is bad in rather interesting ways.",
      "author": "Jon Niccum"
    },
    {
      "text": "The makers of 21 Jump Street clearly understood that almost nobody really wanted a 21 Jump Street movie, and they've cleverly used a familiar property as a way to get a wildly entertaining new comedy made.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Big surprise: The sometimes chaotic \"Jump Street\" is a lot of ridic fun, as the kids say, turning predictability on its head.",
      "author": "Joe Neumaier"
    },
    {
      "text": "The saving grace of \"21 Jump Street,\" co-written and produced by Hill, is its obvious affection for teen genres, and for teenagers.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Unlike its semi-serious inspiration, the new \"Jump Street\" is a rowdy mix of comedy, satire and sass.",
      "author": "Sue Pierman"
    },
    {
      "text": "Provided you approach this laff-a-minute, slapstick adventure as a franchise overhaul rather than as an homage, you won't be shocked by its relentlessly-irreverent brand of humor. Think Superbad meets Revenge of the Nerds!",
      "author": "Kam Williams"
    },
    {
      "text": "Shoulda, coulda, woulda been fun. But it ain't.",
      "author": "David Noh"
    },
    {
      "text": "Of the horde of big-screen redo's of one-time TV hits, who'd have thought 21 JUMP STREET would be the one to get it right?",
      "author": "Chris Bumbray"
    },
    {
      "text": "Apart from the general premise, it's completely different from the television show; although it does pay a few well-timed homages.",
      "author": "Julian Roman"
    },
    {
      "text": "Luckily, the temptation to be become truly gross is resisted.",
      "author": "Graham Young"
    },
    {
      "text": "\"21 Jump Street\" is the address for movie fun this week.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Even if you think you've graduated from genital jokes and violent slapstick, the laughing gas around \"21 Jump Street\" may get you hooked.",
      "author": "Joe Williams"
    },
    {
      "text": "Together Hill and Tatum are so much fun to watch that it's disappointing when the story around them becomes overly cluttered and convoluted.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "One of the freshest mainstream comedies in years.",
      "author": "Adam Woodward"
    },
    {
      "text": "The film makes high school comedy feel young again: considering its stars are in their late 20s and early 30s, that's no mean feat.",
      "author": "Robbie Collin"
    },
    {
      "text": "Remake whatever you want if it's this funny.",
      "author": "Matt Pais"
    },
    {
      "text": "Completely abandoning earnest teenagers-in-crisis melodrama in favor of crude, aggressive comedy, this \"21 Jump Street\" is an example of how formula-driven entertainment can succeed.",
      "author": "A.O. Scott"
    },
    {
      "text": "It manages to achieve a balance between the action and spoofery due to sure-handed direction and a cast that really dives into the mayhem.",
      "author": "Rich Cline"
    },
    {
      "text": "It's a rowdy, massively entertaining ride done with wild wit and creative abandon. Now, bring on the sequel!",
      "author": "Randy Myers"
    },
    {
      "text": "It's mostly another raunchy buddy comedy - albeit one with welcome comic discipline, more focused on maintaining pitch than continually lowering the bar on gross-out jokes.",
      "author": "Tom Keogh"
    },
    {
      "text": "Less an adaptation than an \"adaptation\" that delights in highlighting the ridiculous clichés and tropes it lampoons.",
      "author": "Nathan Rabin"
    },
    {
      "text": "Here's the last movie I was expecting with this title. In other words, \"21 Jump Street\" is pretty good.",
      "author": "Roger Ebert"
    },
    {
      "text": "If you're a fan of the original 21 Jump Street, prepare to have your memories desecrated. Everyone else, strap yourself in for some dumb explosive fun.",
      "author": "Matt Neal"
    },
    {
      "text": "Mediocre jokes built around recycled ideas.",
      "author": "Josh Bell"
    },
    {
      "text": "There's some good comedy as their expectations of school life are turned on their head (everyone's caring and politically correct) and Tatum's hunk finds himself bonding with the science nerds, while Hill's fatty is cast as Peter Pan.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "What makes 21 Jump Street so funny and exciting and lovable is all the stuff you don't see coming.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "What was the last stupid Hollywood comedy -- good-stupid, not stupid-stupid -- to offer actual, audible, verifiable big laughs?",
      "author": "Michael Phillips"
    },
    {
      "text": "You'd expect at 21 Jump Street remake to suck, and this film, for all its obviousness in delivery, doesn't.",
      "author": "Alyx Gorman"
    },
    {
      "text": "It's lazily content to raise laughs through 4-letter words and penis jokes. In other words, it has absolutely no ambition, so that eventually even the efforts of its lead actors amount to very little.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "21 Jump Street proves that you can reinvent the wheel and pay homage to its past in one very funny package.",
      "author": "Adam Bub"
    },
    {
      "text": "Its two leads possess amusing chemistry but this smug and ultimately disappointing revamp never manages to strike the right note between action and comedy.",
      "author": "Erin Free"
    },
    {
      "text": "It's part homage and part wink at the past. It jokes about high school but is also a sensitive sociological study of those crucial years. It bridges slapstick and action. It's quick-witted with its pop references.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "If Hill keeps signing on for half-hearted romps into the realm of idiocy like The Sitter and 21 Jump Street, he's going to get shoved aside by whatever chubby comic wunderkind is lurking behind him.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Directors Phil Lord and Chris Miller get nearly everything -- the tone, the self-referential nods to the show and the dead-solid-perfect surprises -- just right.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Yes, there are laughs to be had here, but I wonder whether it might be more amusing to watch episodes of the old TV show.",
      "author": "James Berardinelli"
    },
    {
      "text": "With all due disrespect to its source, 21st century Jump Street is both dope and dopier.",
      "author": "Elliott Noble"
    },
    {
      "text": "Sharply written, frequently hilarious high school-slash-cop comedy with terrific comic performances from Jonah Hill and Channing Tatum, though it could have done with a slight trim in the running time department.",
      "author": "Matthew Turner"
    },
    {
      "text": "Silly slapstick, spoofing the series by playing it for laughs.",
      "author": "Susan Granger"
    },
    {
      "text": "This is a picture that's far better than it probably had to be.",
      "author": "Jason Bailey"
    },
    {
      "text": "Thanks to charming leads and a smattering of laughs, this is still worth a punt for fans of light buddy comedies.",
      "author": "Anna Smith"
    },
    {
      "text": "Rather than treat the late-'80s source material as holy kitsch, the filmmakers have reconceived this tale of illegal narcotics and arrested adolescence as a viciously satirical, unapologetically crude buddy comedy.",
      "author": "Keith Uhlich"
    },
    {
      "text": "This is not a property requiring respect and devotion to the source material to satisfy longtime fans, so the filmmakers wisely make a \"21 Jump Street\" all their own.",
      "author": "David Germain"
    },
    {
      "text": "Clocks in at an hour and 20 minutes and could use a 15 minute trimming, but there's enough fun to be had that you don't mind wading in a brief lull to get to the next laugh.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Though these mismatched cops bounce well off each other, Tatum, in his first comedic lead role, is the better performer, both more riotous and affecting.",
      "author": "Melissa Anderson"
    },
    {
      "text": "Not everything... works, and if you're actually looking for a consequential night at the movies you might want to stay away, but for a goofy fun Friday night this gets the job done.",
      "author": "Glenn Kenny"
    },
    {
      "text": "For a film rehashing a long-forgotten TV series and starring the sentient muscle Channing Tatum, 21 Jump Street is surprisingly good.",
      "author": "Anders Wotzke"
    },
    {
      "text": "Only mildly amusing, a film that was probably a lot funnier in the writers' room than it is on the screen.",
      "author": "Marshall Fine"
    },
    {
      "text": "Like many almost-great comedies, 21 Jump Street is frontloaded with the best go-for-broke gags and lines.",
      "author": "Jaime N. Christley"
    },
    {
      "text": "An often hilarious comedy filled with vulgar dialogue, slapstick antics, and great chemistry between the principals.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "It would have been impressive if the 21 Jump Street movie was any good. The fact that it's flat-out great feels like showboating by directors Phil Lord and Chris Miller.",
      "author": "Devin Faraci"
    },
    {
      "text": "[F]ueled almost entirely by an appreciation of its own ridiculousness, yet one that balances the absurdity with some smart truths... It's tough to be sensitive about the silly, but directors Phil Lord and Chris Miller... pull it off.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Pleasant, unexpected surprise, this feature remake of the TV series that had starred Johnny Depp is entertaining as comedy-actioner, due to Jonah Hill's acting and chemistry with Channing Tatum.",
      "author": "Emanuel Levy"
    },
    {
      "text": "It's completely lunatic and sort of a mess. It's also the funniest high-school comedy to come out of Hollywood in ages.",
      "author": "Olly Richards"
    },
    {
      "text": "There is a frantic highway chase, a high-voltage gunfight and the obligatory chaotic party; those elements plus the pimple squeezing fun of high school clashes make 21 Jump Street the movie we had to have when the TV series should have been enough",
      "author": "Andrew L. Urban"
    },
    {
      "text": "The humour is pretty lame, so leave your brain at the door, but there are some funny juxtapositions",
      "author": "Louise Keller"
    },
    {
      "text": "21 Jump Street is that rarest of comedies, a classic in the making that manages to become both more outrageous and hilarious as it bounds along.",
      "author": "Shaun Munro"
    },
    {
      "text": "Canny enough to know how to laugh with its subject, not at it, 21 Jump Street is a lot of fun thanks to a fast-flying, clever script and affectionate regard for its 1980s television roots.",
      "author": "Diva Velez"
    },
    {
      "text": "Tatum and Hill make for a fun duo, the former seemingly have the time of his life playing up the dumb hottie his succession of histrionic, corny roles have ultimately typecast him as.",
      "author": "Caffeinated Clint"
    },
    {
      "text": "Pickles and ice cream. Bacon and cupcakes. Chocolate and potato chips. Channing Tatum and Jonah Hill. Some pairings shouldn't work, yet somehow the result is delicious.",
      "author": "Kelsea Stahler"
    },
    {
      "text": "Jonah Hill is masterful at delivering an absurd story with so much sweetness, the nonsense ceases to get in the way.",
      "author": "Sara Maria Vizcarrondo"
    },
    {
      "text": "This is one of those movies that is much better than expected, but is still for a specific audience.",
      "author": "David Poland"
    },
    {
      "text": "An irreverent reboot that only half-heartedly scratches the surface of the more intriguing comedy of young male anxiety at which it hints, but still sails on the strength of some of its joke writing, and the chemistry and use of its stars.",
      "author": "Brent Simon"
    },
    {
      "text": "[Jonah Hill] is, despite early expectations, the emotional anchor in all of his movies. Fear not though: Phil Lord and Chris Miller's 21 Jump Street proves he can still bring the funny.",
      "author": "Simon Miraudo"
    },
    {
      "text": "A smart and immensely entertaining comedy that announces the somewhat surprising arrival of a serious comic talent in the shape of Channing Tatum.",
      "author": "Chris Tilly"
    },
    {
      "text": "... it both overtly acknowledges how frequently awful it is for Hollywood to trade on shameless pre-packaged nostalgia while turning the original into something new with a voice all its own.",
      "author": "Drew McWeeny"
    },
    {
      "text": "The helmers make slick use of their new live-action collaborators. Considering that hardly anyone was asking for a 21 Jump Street reboot, they've put their own playful stamp on it.",
      "author": "Peter Debruge"
    },
    {
      "text": "Co-directors Lord and Miller keep the comic pace humming along agreeably with the same sort of animated energy they provided for those raining meatballs.",
      "author": "Michael Rechtshaffen"
    },
    {
      "text": "Lord and Miller have created an instant classic - an action movie that's as sweet as it is smart, and undeniably funny on top.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "Unpredictable and very silly but with real emotional stakes, 21 Jump Street makes up for a shaggy script with a wily, endearing energy that feels like anything but a tired retread.",
      "author": "Katey Rich"
    },
    {
      "text": "Holding its middle finger up to '80s retro-hounds, this remake gets it largely right. Fast, filthy, fresh and funny, Jump is worth a punt.",
      "author": "James Mottram"
    },
    {
      "text": "It has a bad, slapstick first act but by midpoint becomes strangely compelling, tapping into the fantasy of reliving one's high-school years (which did a number on us all) and getting it right.",
      "author": "David Edelstein"
    },
    {
      "text": "Vibrant and fresh due to the brilliant pairing of Hill and Tatum, the type of classic comedy duo that works so well it makes every moment fun and entertaining.",
      "author": "Edward Douglas"
    }
  ],
  "release_year": 2012,
  "duration": 110,
  "genres": [
    "Comedy",
    "Action"
  ],
  "synopsis": "When cops Schmidt (Jonah Hill) and Jenko (Channing Tatum) join the secret Jump Street unit, they use their youthful appearances to go under cover as high-school students. They trade in their guns and badges for backpacks, and set out to shut down a dangerous drug ring. But, as time goes on, Schmidt and Jenko discover that high school is nothing like it was just a few years earlier -- and, what's more, they must again confront the teenage terror and anxiety they thought they had left behind.",
  "popularity": 8.3,
  "poster_url": "https://image.tmdb.org/t/p/original/8v3Sqv9UcIUC4ebmpKWROqPBINZ.jpg"
}