{
  "movie_name": "A Beautiful Mind",
  "movie_id": "beautiful_mind",
  "total_reviews": 213,
  "reviews": [
    {
      "text": "Director Ron Howard has loosened up enough to imbue the project with a jangled-nerve approach that paradoxically allows us to feel like both observers and participants in Nash’s never-ending struggles with his own mind.",
      "author": "Matt Brunson"
    },
    {
      "text": "When I think of the phrase “Oscar bait,” an expression I’m honestly not fond of, Ron Howard’s A Beautiful Mind is the first movie I always think of.",
      "author": "Mark Johnson"
    },
    {
      "text": "Nash's character is perfectly suited to Crowe's ability to charm and confuse at the same moment.",
      "author": "Catherine Springer"
    },
    {
      "text": "Its inspirational qualities to read more about the real John Nash (and all the things omitted from this biopic) might be the only lasting effect.",
      "author": "Mike Massie"
    },
    {
      "text": "Howard's A Beautiful Mind works because it is not a film about mental illness, but a film about John Nash.",
      "author": "Richard Propes"
    },
    {
      "text": "Profoundly, exhaustingly mediocre, a fussily overdone bit of mindless prestige filmmaking.",
      "author": "Tim Brayton"
    },
    {
      "text": "Granted, it's uplifting to see mental illness portrayed on the screen in a humane fashion and world-class intellectuals elevated to heroic status. But A Beautiful Mind feels contrived from beginning to end, a paint-by-the-numbers biography.",
      "author": "Catherine Graham"
    },
    {
      "text": "This is stirring and absorbing stuff.",
      "author": "Dominic Bloch"
    },
    {
      "text": "As competent, affecting biopics go, Mind won't win any prizes, but you've earned yourself the right for more awards consideration, mate.",
      "author": "Brian Miller"
    },
    {
      "text": "A Beautiful Mind isn't really interested in Nash's thoughts, let alone anyone else's.",
      "author": "Christopher Borrelli"
    },
    {
      "text": "Ultimately the message is banal and rather repellent: brainwork wrecks your health.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Jennifer Connelly [works]. [Full Review in Spanish]",
      "author": "Bibi Ramos"
    },
    {
      "text": "You've gotta hand it to Howard. He and A Beautiful Mind got me (and I bet will get you) interested in this subject for the first time since \"new math\" ruined it for most of us in high school.",
      "author": "Barry Paris"
    },
    {
      "text": "Crowe is called upon to do not much more than stare solicitously at the heavens, from where inspiration duly arrives, to the accompaniment of some predictably celestial music.",
      "author": "Philip Kerr"
    },
    {
      "text": "You're well into the story before you can sift the facts from the hallucinations, a process that's made compelling by Russell Crowe's performance in the lead.",
      "author": "Stuart Klawans"
    },
    {
      "text": "The second, idealised, sentimentalised half of the film is torture, as we plod through the routine I'm-here-to-help psychiatrist, the walls plastered with cut-up newspapers and the what-happens-when-he-stops-taking-the-medicine stuff.",
      "author": "Matthew Bond"
    },
    {
      "text": "The story also comes up with a clever way for Nash to fight his problem: He uses his mind. His illness is a puzzle, after all, and he's good at figuring out puzzles. You'll root for him.",
      "author": "Matt Soergel"
    },
    {
      "text": "Despite problems of structure and tone, and some crucial omissions from Nash's actual life, A Beautiful Mind has emerged as one of the season's most enjoyable and popular films.",
      "author": "Emanuel Levy"
    },
    {
      "text": "A Beautiful Mind is Howard's best movie, and easily one of the best movies of the year.",
      "author": "Christy Lemire"
    },
    {
      "text": "A Beautiful Mind is the best film yet from director Howard.",
      "author": "Chris Kaltenbach"
    },
    {
      "text": "It's not a crime for the script to gloss over the thornier aspects of Nash's story, but the film seems totally unconvincing, squeezing a real life into a formula that's simultaneously more palatable and less interesting.",
      "author": "Scott Tobias"
    },
    {
      "text": "Kudos to Crowe, who can go over the edge without going over the top.",
      "author": "Leah Rozen"
    },
    {
      "text": "Crowe is convincingly skittish and bounces enjoyably off Paul Bettany, while Jennifer Connelly earns her Oscar in the would-be thankless role of suffering wife. But this is as dishonest as Hollywood biography gets.",
      "author": "Emma Dibdin"
    },
    {
      "text": "A Beautiful Mind reveals only glimpses of the dark story beneath its sunny imagery, but the performances carry enough weight for it to stand for something.",
      "author": "Serena Donadoni"
    },
    {
      "text": "Tthe film's overweening desire to be taken seriously gets in the way of the story.",
      "author": "Andrew Collins"
    },
    {
      "text": "The film's strength is certainly the towering performance of Crowe as Nash; he inhabits the man from the internal organs out and Jennifer Connelly's performance as Alicia is also outstanding.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "Rich and stimulating, occasionally frustrating yet equally rewarding, and definitely one of the best films of the year.",
      "author": "Scott B."
    },
    {
      "text": "A Beautiful Mind is not an insult to the intelligence, not quite. But it makes every effort to celebrate that uncommon faculty and at the same time play it down to the lowest common level.",
      "author": "Alexander Walker"
    },
    {
      "text": "The result is one of the most successful attempts to make math look sexy, even if the movie strays - gallops, really - from the details of the actual life of Nobel Prize-winner John Forbes Nash Jr.",
      "author": "Jami Bernard"
    },
    {
      "text": "Screenwriter Akiva Goldsman's clever solution is to turn the story of a troubled academic into a Hollywood thriller. How? He makes things up.",
      "author": "David Ansen"
    },
    {
      "text": "Russell Crowe is a sensational actor who can apparently do anything he sets his own beautiful mind to, and he brilliantly portrays Nash from college days to retirement age.",
      "author": "David Sterritt"
    },
    {
      "text": "It isn't the device that's so crude, but the execution, which turns Nash's persecutory demons into nuisances that won't leave us alone.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Crowe pulls out the stops, but he looks too bullish and controlled for such a pitiable victim.",
      "author": "Anthony Lane"
    },
    {
      "text": "The result is mainstream moviemaking at its highest, most satisfying level.",
      "author": "Richard Schickel"
    },
    {
      "text": "Oscar-winning biopic is too intense for tweens.",
      "author": "Nell Minow"
    },
    {
      "text": "Crowe, Goldsman and Howard aren't trying to solicit love or tears for John Nash, as detractors bitterly claimed. \"A Beautiful Mind\" sought only acknowledgement of the silent, invisible and brave struggle that so many with mental illnesses endure each day.",
      "author": "Nick Rogers"
    },
    {
      "text": "A masterpiece.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "A typical Oscars movie. Solid, middle-brow and worthy.",
      "author": "Film4 Staff"
    },
    {
      "text": "Consistently engrossing as an unusual character study and as a trip to the mysterious border-crossing between rarified brilliance and madness.",
      "author": "Todd McCarthy"
    },
    {
      "text": "I can't deny how solidly it's crafted, how well-acted, and, wonder of wonders, how intelligently written and directed.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "I particularly enjoyed the fact that Nash comes across as quite fallible in the film despite his attempts at perfection. His character in the film is as unpredictable as I would expect the real Nash to be.",
      "author": "Joe Lozito"
    },
    {
      "text": "Unfortunately, as the picture goes on, the haunting of Nash by figments of his troubled mind becomes a trifle simplistic.",
      "author": "Philip French"
    },
    {
      "text": "Director Ron Howard's deftness in suggesting the subjective experience of Crowe's character, who's later diagnosed with schizophrenia, makes for inspirational narrative, but certain plot points are so reductive.",
      "author": "Lisa Alspector"
    },
    {
      "text": "If this were fiction, it would be an example of superior storytelling, and it's certainly gripping.",
      "author": "Adam Smith"
    },
    {
      "text": "A pedestrian film with a rudimentary script that forces the actors to create believability where there might otherwise be none.",
      "author": "Wesley Lovell"
    },
    {
      "text": "At its most effective when it seems to lose the plot in a scrambled second act that posits the Cold War as a collective paranoid delusion, the film reverts to type (and to fact) for a sentimental anti-climax.",
      "author": "Tom Charity"
    },
    {
      "text": "It presents itself as a biography of the flesh-and-blood John Nash. And in fact, it is really only a flashy, sentimental Hollywood movie, inspired by a few particular details of the John Nash story.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "In every facet, it should have an automatic date with Oscar.",
      "author": "Mark Sells"
    },
    {
      "text": "Crowe...disappears into the character just as he did when he played tobacco whistleblower Jeffrey Wigand in The Insider.",
      "author": "Judith Egerton"
    },
    {
      "text": "A tedious exercise in manipulation that once again proves Hollywood is short of vision.",
      "author": "Charlie Brown"
    },
    {
      "text": "... Crowe disappears into the role of John Nash and proves again that he is one of today's most versatile actors.",
      "author": "Greg Maki"
    },
    {
      "text": "Exceptionally acted, smartly scripted, superbly directed -- a beautiful thing.",
      "author": "Brent Simon"
    },
    {
      "text": "This film is a puzzlement in its inconsistency, especially coming from Ron Howard...Still, good performances abound.",
      "author": "John R. McEwen"
    },
    {
      "text": "'As straightforward fiction, this is solid feelgood fare, but the fact that it's based on a real person, real success and failure opens it up to far greater scrutiny.'",
      "author": "Harry Guerin"
    },
    {
      "text": "A different film might have been made about a wider sampling of Nash's experiences, but it wouldn't necessarily be a better film, and it certainly wouldn't be this film.",
      "author": "Nick Davis"
    },
    {
      "text": "Director Ron Howard has created a moving masterpiece, elegantly guiding the audience through John Forbes Nash Jr.'s life.",
      "author": "Rebecca Murray"
    },
    {
      "text": "The film shows the triumph and tragedy of life, as well as the beauty of the human spirit to overcome and survive.",
      "author": "Gareth J. Von Kallenbach"
    },
    {
      "text": "Both Nash and the audience deserve better.",
      "author": "Ron Wells"
    },
    {
      "text": "Well-made film with some deservedly Oscar-nominated performances -- it takes some shocking liberties with its subject matter but remains engaging and enjoyable throughout.",
      "author": "Matthew Turner"
    },
    {
      "text": "Clear the Academy Award decks. Here comes this year's winner.",
      "author": "Jean Lowerison"
    },
    {
      "text": "Howard smashes through the conventions of the damaged-hero tale to recount the struggle of one man to stand upright on quaking ground.",
      "author": "Margaret A. McGurk"
    },
    {
      "text": "Howard's sappy movie covers some of the material, but is far more concerned with box office and Oscar glory.",
      "author": "John A. Nesbit"
    },
    {
      "text": "Until the unbearably sappy final minutes, the film moves at an absorbing pace and -- in the rarest of qualities - allows the bulk of its sentimentality to emerge honestly.",
      "author": "Mark Palermo"
    },
    {
      "text": "A Beautiful Mind is at its best when its subject is at his worst.",
      "author": "Jon Niccum"
    },
    {
      "text": "An inspiring story of courage and triumph.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "Love story, or math problem, A Beautiful Mind is without a doubt one of the finest, most genuine films of 2001.",
      "author": "Joshua Tyler"
    },
    {
      "text": "... Howard's duty is not journalistic, yet it seems a much more interesting movie could have been made about this Nash fellow ...",
      "author": "Philip Martin"
    },
    {
      "text": "Formula Hollywood at the top of its form.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "It is truly sad how the masses will seem to fall for any movie that wraps serious, probing subject matter around a conventional love story.",
      "author": "Jason Clark"
    },
    {
      "text": "This is a lovely film, crafted with attention to detail and assembled with real skill.",
      "author": "Rich Cline"
    },
    {
      "text": "As John Nash, Russell Crowe projects the 'warts-and-all' persona of a genius trying to conquer mental illness. But I can't help reacting negatively to most biopics. I never know what's real and what's made-up -- kinda like Nash himself.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "The acting is what truly shines here.",
      "author": "Garth Franklin"
    },
    {
      "text": "Emotiva, personal y entrañable, es un triunfo en todos sentidos.",
      "author": "Jorge Avila Andrade"
    },
    {
      "text": "A rare film when the random elements of filmmaking align in a formula equaling near-greatness.",
      "author": "Jimmy O"
    },
    {
      "text": "A beautiful mind, a beautiful heart - a beautiful movie.",
      "author": "Cherryl Dawson and Leigh Ann Palone"
    },
    {
      "text": "Nash and Alicia are played by Russell Crowe and Jennifer Connelly, both of whom give performances that border on the spectacular. Neither has ever been better or created a richer, more multi-layered characterization.",
      "author": "James Sanford"
    },
    {
      "text": "It's sad to see a beautiful mind whittled down by such a plain one.",
      "author": "John Powers"
    },
    {
      "text": "Ron Howard consegue transformar até mesmo a matemática em algo emocionante.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Russell Crowe, el Gladiador de la pantalla ofrece sin lugar a dudas, la mejor actuación de su carrera.",
      "author": "Luis Martinez"
    },
    {
      "text": "A Beautiful Mind is not about ideas per se, but about the experience of living in a world defined by ideas.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "It's a performance that's not just great; it's amazing.",
      "author": "David Cornelius"
    },
    {
      "text": "The best action film of the year.",
      "author": "Larry Carroll"
    },
    {
      "text": "It may be a film which salutes intelligence and the power of love, but it's also a symbol of cinematic cowardice and fear.",
      "author": "Mark Freeman"
    },
    {
      "text": "Schizophrenics, notes a psychiatrist in the movie, are pathologically incapable of recognizing the truth. If so, A Beautiful Mind is schizophrenic.",
      "author": "Peter Keough"
    },
    {
      "text": "If you watch it with your heart instead of your head you'll be privy to a profoundly moving experience.",
      "author": "Andrew Howe"
    },
    {
      "text": "I really wish the last third had been less sketchy, because before it the movie had seemed to be building to greatness",
      "author": "Ian Mantgani"
    },
    {
      "text": "Pedantic and sophistic.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "Here's hoping that the Academy Awards recognize this articulate, intensely entertaining gem. A Beautiful Mind would indeed be a terrible thing to waste.",
      "author": "Frank Ochieng"
    },
    {
      "text": "[A] plodding, pedestrian hagiography.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Quite possibly could be the best thing Ron Howard has ever directed.",
      "author": "Kit Bowen"
    },
    {
      "text": "The strength of the film arises in the second half.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "A grand Hollywood drama.",
      "author": "Mark Dujsik"
    },
    {
      "text": "... one beautifully made film.",
      "author": "David Forsmark"
    },
    {
      "text": "Neither aesthetically pleasing ... nor intelligent.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Ron Howard trashes the true story of the mentally troubled Nobel Prize-winning mathematician genius John Forbes Nash Jr. ...",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Howard softens the hard edge of real schizophrenia with movie gloss as cotton candy, shaping the troubled history of mathematical genius John Forbes Nash, Jr. into feel good escapism.",
      "author": "Jeremiah Kipp"
    },
    {
      "text": "An absorbing movie from start to finish.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Who'd have thought algebra could be so exciting?",
      "author": "Nev Pierce"
    },
    {
      "text": "I've never seen an actor try so hard to look like he was a disturbed character.",
      "author": "BeatBoxBetty Staff"
    },
    {
      "text": "A light veneer of condescension hangs over A Beautiful Mind.",
      "author": "Peter Rainer"
    },
    {
      "text": "There's no mathematical equation that can produce the number of stars this film deserves; it's infinite.",
      "author": "Emily Blunt"
    },
    {
      "text": "It's the kind of project that should have been awarded to a writer-director team of true vision, and not to Akiva Goldsman and Ron Howard.",
      "author": "Shay Casey"
    },
    {
      "text": "The first two acts of the film are strong enough to merit a recommendation, as is the consistently impressive work of Connelly.",
      "author": "Michael Dequina"
    },
    {
      "text": "Howard makes it much more bearable by keeping the tension to a maximum and the potential for nausea to a minimum.",
      "author": "Matt Easterbrook"
    },
    {
      "text": "The kind of movie that makes you wish they'd just do away with the Oscars altogether, A Beautiful Mind is as tasteful as a dentist's office, and about as exciting.",
      "author": "Sam Adams"
    },
    {
      "text": "The most interesting thing about this film is figuring out where all the Oscar buzz is coming from.",
      "author": "Andrew Manning"
    },
    {
      "text": "Opie may know how to spin a good fable, but he's no match for this brilliant, complicated couple.",
      "author": "Kim Linekin"
    },
    {
      "text": "It makes you understand what it feels like to have a serious breakdown in powerful, empathetic ways that no movie has ever done before.",
      "author": "Stephen Hunter"
    },
    {
      "text": "This might have been a great film, if director Ron Howard had been more daring both in terms of the film's perspective and its style.",
      "author": "Brian Webster"
    },
    {
      "text": "A triumph of the cinematic spirit.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "Nash's subterranean nightmare takes on the gripping elements of a psychological thriller.",
      "author": "Rex Reed"
    },
    {
      "text": "Director Ron Howard uses interesting visual techniques to show how Nash makes his amazing mathematical connections.",
      "author": "Robert Roten"
    },
    {
      "text": "It's crisp and well-organized and thoughtful.",
      "author": "Eric D. Snider"
    },
    {
      "text": "A significant film, one that is at various times uplifting, thought-provoking, and emotionally devastating.",
      "author": "Jim Chastain"
    },
    {
      "text": "Where the film attempts to visualize Nash's thought, it is not perfect but does a very interesting job.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Russell Crowe steals the show as John Nash, the 1994 Nobel Prize winner for economics",
      "author": "Marty Mapes"
    },
    {
      "text": "A must-see for film junkies.",
      "author": "Gary Brown"
    },
    {
      "text": "Whatever the final verdict is on A Beautiful Mind's faithfulness to the story which inspired it, Crowe's performance will weather the storm. It's the real deal.",
      "author": "KJ Doughton"
    },
    {
      "text": "In a good cast, Jennifer Connelly earns your complete admiration.",
      "author": "Jules Brenner"
    },
    {
      "text": "The preview is misleading, but as a drama of a man's pretty interesting life, it is somewhat pleasing.",
      "author": "Karina Montgomery"
    },
    {
      "text": "As strong a performance as Russell Crowe has ever delivered.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "an engaging, rousing, well-made film about a brilliant man whose life was almost completely devastated by mental illness",
      "author": "James Kendrick"
    },
    {
      "text": "I really don't know who I would recommend this film to. It's worth seeing for Crowe's performance, I guess, but for pity's sake don't pay anything for it.",
      "author": "Widgett Walls"
    },
    {
      "text": "In this case at least, mathematical genius has inspired moviemaking genius.",
      "author": "Shirley Sealy"
    },
    {
      "text": "Harrowing, heartbreaking and deeply human.",
      "author": "Robert W. Butler"
    },
    {
      "text": "For all his Capraesque aspirations, Howard's movies never really leave the ground because he never really takes any risks.",
      "author": "Lesley M. Smith"
    },
    {
      "text": "All the pieces are there and Ron Howard fits them all together as if playing the perfect game of Go.",
      "author": "Erik Childress"
    },
    {
      "text": "This is a precision story as told by filmmakers who are shooting at the side of a barn with water balloons filled with syrup.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "You can't believe Russell Crowe is the same actor who won an Oscar one year ago for Gladiator. The film has a reveal so startling I almost got whiplash, shaking my head in amazement.",
      "author": "Joel Siegel"
    },
    {
      "text": "Crowe proves he's the pre-eminent actor of the moment, discarding his gladiatorial macho to inhabit the gawky, tormented Nash with harrowing conviction.",
      "author": "Jonathan Taylor"
    },
    {
      "text": "As bold and searingly imaginative as it is substantive.",
      "author": "Susan Stark"
    },
    {
      "text": "[Howard's] most accomplished, most mature and least-compromised movie, 'Oscar-worthy' in every way.",
      "author": "Joe Baltake"
    },
    {
      "text": "The complexity of the brain -- and its effect on human behavior -- has seldom been explored with as much lyrical passion and engrossing intensity.",
      "author": "Jack Garner"
    },
    {
      "text": "Crowe and Connelly's work rises above the mush.",
      "author": "Steven Rea"
    },
    {
      "text": "A film that gives only the tiniest insights into its main character.",
      "author": "Jeff Vice"
    },
    {
      "text": "Like a good college education itself, A Beautiful Mind broadens your perspective on life.",
      "author": "Steven Rosen"
    },
    {
      "text": "Director Ron Howard and screenwriter Akiva Goldsman play fast and loose with Nash's illness to spice up the story.",
      "author": "Sean P. Means"
    },
    {
      "text": "Darned if Howard doesn't make [Nash] as neat and warm as a tea cozy.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Howard directed this moving tale without caving in to the temptation to over-sentimentalize.",
      "author": "Todd Anthony"
    },
    {
      "text": "You can practically feel director Ron Howard standing over your tear ducts, straining to extract every last salty drop.",
      "author": "Bruce Newman"
    },
    {
      "text": "An affecting motion picture that confronts its subject head-on yet doesn't lay its life-affirming message on too thick.",
      "author": "Steve Schneider"
    },
    {
      "text": "Howard gives Crowe the space he needs to build a memorable character.",
      "author": "Jay Boyar"
    },
    {
      "text": "It is moviemaking at its finest because it plays as powerfully and effectively to the heart as it does the mind.",
      "author": "Louis B. Hobson"
    },
    {
      "text": "Good, old-fashioned storytelling, with both a twist and a heart.",
      "author": "Duane Dudek"
    },
    {
      "text": "Despite a shaky West Virginia accent, Crowe does exemplary work here, his best since The Insider.",
      "author": "Eric Harrison"
    },
    {
      "text": "Tells us little about paranoid schizophrenia, less about genius, and next to nothing about Nash.",
      "author": "Terry Lawson"
    },
    {
      "text": "It too neatly pigeonholes the complexities of the dramatic situation, but the performances carry the show.",
      "author": "Philip Wuntch"
    },
    {
      "text": "Thanks to stirring performances from Crowe and Connelly, Beautiful Mind might rest on a foundation of theoretical mathematics, but its real lessons come straight from the human heart.",
      "author": "Donald Munro"
    },
    {
      "text": "A deeply eloquent film with sparkling performances by both Crowe and Connelly.",
      "author": "Tony Toscano"
    },
    {
      "text": "Crowe's performance is miraculous, absolutely Oscar-worthy.",
      "author": "Mark Ramsey"
    },
    {
      "text": "Successfully lures the viewer into the mind of a character who is portrayed as defining everything in his world in mathematical terms.",
      "author": "Yazmin Ghonaim"
    },
    {
      "text": "A Beautiful Mind is one hell of a movie.",
      "author": "David Keyes"
    },
    {
      "text": "A brilliant performance by Russell Crowe, who takes his audience on a terrifying journey inside a man tormented by self-created mental demons, propels A Beautiful Mind.",
      "author": "Bob Bloom"
    },
    {
      "text": "It is a thought provoking study of mental illness and the struggle to overcome it.",
      "author": "Robin Clifford"
    },
    {
      "text": "A play for the fickle attentions of middlebrow moviegoers looking for an easy cause they can champion.",
      "author": "Walter Chaw"
    },
    {
      "text": "Best film of 2001.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "A cinematic puzzle with missing pieces, a state of being that would drive any mathematician crazy.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "Since love conquers all, you know everything will turn out okay. It's practically a mathematical formula.",
      "author": "Geoff Pevere"
    },
    {
      "text": "Roger Deakins' handsome cinematography gives the film the look of a leather-bound classic. What keeps Mind from greatness, though, is some awkwardness in the screenplay, and the film's odd relationship with the true story of John Nash.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Nicely filmed by Roger Deakins and magnificently performed by Crowe, who never fails to surprise.",
      "author": "Edward Guthmann"
    },
    {
      "text": "A compelling tale with some terrific and touching individual moments, just the right directorial touch, and what's arguably the best performance of the year.",
      "author": "Jim Judy"
    },
    {
      "text": "Sadly, Howard blands out in the final third, using old-age makeup and tear-jerking to turn a tough true story into something easily digestible. Until then, you'll be riveted.",
      "author": "Peter Travers"
    },
    {
      "text": "Humanistic and engaging piece of popular entertainment.",
      "author": "John Anderson"
    },
    {
      "text": "Terrific, surprisingly gripping true-life tale of a math genius battling madness.",
      "author": "Jonathan Foreman"
    },
    {
      "text": "Russell Crowe's sweating and facial tics are always entertaining, but Ron Howard never lets you enjoy them, so busy is he directing everyone into a state of uplifting bliss.",
      "author": "Dave White"
    },
    {
      "text": "In the hands of a better director than Ron Howard, such a protean mix of reason and madness could have made for a tale of Shakespearean complexity. Instead, all we get is a feel-good flick.",
      "author": "Rick Groen"
    },
    {
      "text": "[Crowe's] work here is indeed a thing of beauty.",
      "author": "Glenn Whipp"
    },
    {
      "text": "Director Ron Howard and writer Akiva Goldsman have reached the apex of their careers with Mind.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Throughout this movie we not only see this man go through hell, we feel it, thanks to Crowe's complete immersion in the part.",
      "author": "Mary F. Pols"
    },
    {
      "text": "Despite the 'Hollywoodization' of Nash's personal life, A Beautiful Mind is a thoughtful, provocative film about human frailties and human strength.",
      "author": "Paul Clinton (CNN.com)"
    },
    {
      "text": "The movie fascinated me about the life of this man.",
      "author": "Roger Ebert"
    },
    {
      "text": "Mind's inarguably greatest strength is a beautiful performance by Russell Crowe, whose depiction of schizophrenic genius John Forbes Nash Jr. is continuously compelling.",
      "author": "Francesca Dinglasan"
    },
    {
      "text": "One of Hollywood's very few really classy or ambitious offerings this year.",
      "author": "Jay Carr"
    },
    {
      "text": "Crowe...defines and builds a characterization which centers the film and, indeed, enables it to transcend its weaknesses.",
      "author": "Arthur Lazere"
    },
    {
      "text": "Ron Howard as director has fashioned a drama about the slow hatching of Nash's heart.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Fascinating, clever and surprisingly heartfelt, A Beautiful Mind is easily one of this year's best films.",
      "author": "Scott Weinberg"
    },
    {
      "text": "The script gets us so inside Nash's head that it makes us a party to his illness and the paranoia that it spawns... but Howard doesn't know how to show us this without, ultimately, making us feel cheated and jerked around.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Goldsman's script fictionalizes the bare framework of Nash's life in a way that sneaks us into the mind of a madman.",
      "author": "Jim Lane"
    },
    {
      "text": "Fascinating, inspiring, Oscar-worthy.",
      "author": "Susan Granger"
    },
    {
      "text": "Inspirational to be sure, tightly-wound and secure with outstanding performances, this film is likely to please audiences all over the place.",
      "author": "JoBlo"
    },
    {
      "text": "Among the most affecting ever made about co-existing with mental demons.",
      "author": "Mike Clark"
    },
    {
      "text": "Crowe and crew deliver top-flight performances to keep the madness gripping.",
      "author": "E! Staff"
    },
    {
      "text": "The biggest load of hooey to stink up the screen this year.",
      "author": "Charles Taylor"
    },
    {
      "text": "There is more to admire in A Beautiful Mind than you might suspect, but less than its creators believe.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Much as I admired the performance and the intelligent script, I couldn't help thinking of how much money a schizophrenic can save on movies!",
      "author": "Harvey S. Karten"
    },
    {
      "text": "The success of this effect, which helps elevate the movie above a classy disease-of-the-week saga, rests firmly on Russell Crowe's performance, and it's a strikingly good and moving one.",
      "author": "Maitland McDonagh"
    },
    {
      "text": "The movie can -- indeed, should -- be intellectually rejected, but you can't quite banish it from your mind.",
      "author": "A.O. Scott"
    },
    {
      "text": "The pieces fall into place with the precision of one of Nash's confounding mathematical theories.",
      "author": "Sean O'Connell"
    },
    {
      "text": "One of those formulaically rendered Important Subject movies.",
      "author": "Desson Thomson"
    },
    {
      "text": "A pretty good tear-jerker.",
      "author": "David Edelstein"
    },
    {
      "text": "As Nash, Crowe could hardly be more convincing.",
      "author": "William Arnold"
    },
    {
      "text": "Though director Ron Howard's populist style makes its first third feel simplistic and forced, the film deepens in the final two acts, and proves worthy of its unique and difficult material as the credits roll.",
      "author": "Rod Armstrong"
    },
    {
      "text": "It's everything most movies this year have not been: deeply felt, genuine, gracious.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "Russell Crowe sometimes summons up one of the most powerful depictions of mental illness I have ever seen with barely an eyelid flicker separating manifestations of sickness from utterly sane displays of creative concentration.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "Shows us the joys and terrors of seeing things that others can't.",
      "author": "Michael Wilmington"
    },
    {
      "text": "A beautiful movie.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "It's not only intelligently conceived and smoothly crafted, but also manages be be emotionally resonant without degenerating into mawkishness.",
      "author": "Frank Swietek"
    },
    {
      "text": "This is blatant histrionic mugging directed squarely at Oscar voters.",
      "author": "Jeffrey Huston"
    },
    {
      "text": "The humor of his rough-edged socializing and courting make a much more interesting film than that which \"Beautiful Mind\" actually becomes ... a psychological thriller.",
      "author": "Ross Anthony"
    },
    {
      "text": "How ironic that Russell Crowe won his Oscar last year for \"Gladiator\"",
      "author": "Laura Clifford"
    },
    {
      "text": "What it lacks in ingenuity, \"A Beautiful Mind\" makes up for in superb performances, potent emotions and graceful, emblematic (if safe and conventional) filmmaking.",
      "author": "Rob Blackwelder"
    },
    {
      "text": "The movie illustrates with poignant (if reductive) clarity the awful no-exit paradox of a paranoid delusion -- that its most incapacitating aspect is its terrifying realness.",
      "author": "Dennis Lim"
    },
    {
      "text": "Ron Howard's relentlessly sunny direction is an unusual fit for this often fascinating portrayal of one of our century's great math minds.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "Screenwriter Akiva Goldsman has fashioned a powerful narrative that's brought to life by the outstanding cast and Howard's assured direction.",
      "author": "Richard Roeper"
    },
    {
      "text": "A beautifully written, effectively acted, and meticulously crafted effort.",
      "author": "James Berardinelli"
    },
    {
      "text": "Through enormously convincing performances, a masterful screenplay, and aggressive direction, this movie takes us on an extraordinary journey into the mind of a fascinating character.",
      "author": "Blake French"
    },
    {
      "text": "In a performance that wavers between deserving an Oscar nomination and one that's overacted in the hopes of getting one, Russell Crowe delivers an intense performance as Nash.",
      "author": "Steve Rhodes"
    },
    {
      "text": "A frequently disappointing cut-and-paste job...it fails to find any sort of smooth rhythm or dramatic arc.",
      "author": "Dustin Putman"
    },
    {
      "text": "Practically a one-man show, but Russell Crowe makes it an entertaining one.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "An excellent film with an interesting and surprising twist.",
      "author": "Scott Chitwood"
    },
    {
      "text": "[Crowe's performance is] still one of the better roles you'll see all year and seems a shoo-in for a Hanks-like third nomination in a row.",
      "author": "Jon Popick"
    },
    {
      "text": "Crowe reaches within and recreates himself once again, as he did in The Insider.",
      "author": "Alex Keen"
    },
    {
      "text": "A Beautiful Mind is like a brick to the head to anyone who ever winced at the utterance of \"infinity plus one.\"",
      "author": "Ed Gonzalez"
    }
  ],
  "release_year": 2002,
  "duration": 135,
  "genres": [
    "Biography",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "From the heights of notoriety to the depths of depravity, John Forbes Nash Jr. experiences it all; as a mathematical expert, he made a discovery early in his career and stands on the brink of international acclaim; but Nash soon finds himself on a painful and harrowing journey of self-discovery.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/rEIg5yJdNOt9fmX4P8gU9LeNoTQ.jpg"
}