{
  "movie_name": "A Quiet Place Part II",
  "movie_id": "a_quiet_place_part_ii",
  "total_reviews": 366,
  "reviews": [
    {
      "text": "It’s a roar of a sequel from Krasinski, who shows a preference for restraint that is rare in franchises.",
      "author": "Francesca Steele"
    },
    {
      "text": "Silence continues to be golden with this horror franchise. The sequel is filled with all the breath-holding tension that made the original so intensely scary.",
      "author": "Rick Bentley"
    },
    {
      "text": "Quiet Place Part II depicts quietness as a strength, and the film’s release shows that the quietness of the past year can be resolved through the mutable, powerful sensibilities of cinema.",
      "author": "Mo Muzammal"
    },
    {
      "text": "One of the best sequels ever created. Fascinating world building, amazing performances, & truthfully one of the best first acts I’ve experienced in awhile. It starts & never stops for a moment building on each & every scene",
      "author": "Zach Pope"
    },
    {
      "text": "A Quiet Place Part II feels less than its predecessor in almost every element, but it's still one of the best sequels of the genre. Cillian Murphy and Emily Blunt are remarkable, but Noah Jupe and Millicent Simmonds are astonishing,",
      "author": "Manuel São Bento"
    },
    {
      "text": "A Quiet Place II has some of the most beautiful stories to tell. It’s a love letter to the next generation. A love letter to understanding people and families and especially children.",
      "author": "Gissane Sophia"
    },
    {
      "text": "A Quiet Place Part II retains the formula's delicacy intact in mining primal fears and focusing on its characters. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "A Quiet Place Part II isn’t always as quiet as the title or the first film might suggest, but the more silent moments are the most impactful.",
      "author": "Brett Doze"
    },
    {
      "text": "John Krasinski crafts a masterclass in suspense with Hitchcockian anxiety that would make the master proud.",
      "author": "David Gonzalez"
    },
    {
      "text": "A Quiet Place Part II doubles down on what made its predecessor so popular, delivering another ridiculously riveting feat of horror filmmaking from John Krasinski.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "The impeccable mix of camerawork, sound design, and editing create the kind of nail-biting tension that will run throughout the film’s taut 97-minute runtime.",
      "author": "Keith Garlington"
    },
    {
      "text": "The first film in the series was so fresh, standing out in that year's box office. This film isn't better or cleverer, it's just a continuation of the things we loved in the first film, which isn't bad at all.",
      "author": "Cris Kennedy"
    },
    {
      "text": "What makes it a worthy follow-up is the same precise use and disuse of sound. The boundary between the screen and the audience disappears in the silence.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "An older and wiser sequel with thematic restraint.",
      "author": "Rahul Desai"
    },
    {
      "text": "A Quiet Place Part 2 proves that there's still enough thrills in this concept to yell about.",
      "author": "Jessie Gender"
    },
    {
      "text": "A Quiet Place Part II, like all sequels, battles to convince you that it was made for a reason other than the first one making a lot of money. It mostly succeeds, bringing the thrills and tension expected with the name, even if some depth is sacrificed.",
      "author": "Victoria Luxford"
    },
    {
      "text": "A QUIET PLACE PART II is a good and consistent sequel, but I would have hoped for a bit more innovation and brutality. It is exciting and emotional again, but its trick is already well known by now.",
      "author": "Jimmy Cage"
    },
    {
      "text": "This is a great horror movie that focuses on building dread through a sheer feeling of terror and suspense over grisly violence, blood, and gore.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "It's an entertaining follow-up to the 2018 original.",
      "author": "Brian Eggert"
    },
    {
      "text": "A Quiet Place Part II takes all the pieces needed to be a truly great horror sequel and ties them together with a flimsy and disappointing execution, that does the entire project a disservice.",
      "author": "Carson Timar"
    },
    {
      "text": "One of the miracles of the Quiet Place franchise is how Krasinski gets audiences to sit silent for 97 minutes. A Quiet Place Part II is an intense, hair-raising edge-of-your-seat thriller that wonderfully lures filmgoers back to the theaters.",
      "author": "Mark Johnson"
    },
    {
      "text": "It doesn't lose what made the original fresh and surprising-that's all we can ask any sequel to do, right?",
      "author": "Jared Mobarak"
    },
    {
      "text": "Simmonds elicits a performance that is as compelling as it is emotionally raw, and her scenes with the well-cast Murphy give the movie the gravity it needed to hold our attention the second time around.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The follow-up to Krasinski's brilliant first film finds him doing the near impossible. It's a successful prequel and sequel which ends with the all-but-promise of a third outing without caving into any kind of commercial demands or narrative check-lists.",
      "author": "Michael Clark"
    },
    {
      "text": "Quite the nail-biting, twisted and terrific thriller that will keep you on the edge of the seat as much as the first one.",
      "author": "Ronak Kotecha"
    },
    {
      "text": "A Quiet Place Part II is an exceptionally entertaining sequel with quality performances and a primary focus on monster mayhem which, as horror and suspense fans, we should all get behind.",
      "author": "Chris Sawin"
    },
    {
      "text": "John Krasinski takes all the juice out of his visual storytelling, connecting with all the characters even with them not being in the same space. An incredible sequel that shocks more because of its genre. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Despite it still being a very respectable and effective sequel, it does raise the question of how much fuel is left in the tank?",
      "author": "Matt Hudson"
    },
    {
      "text": "The premise begins to strain some already thinly spread credulity, but Millicent Simmonds is a complete star.",
      "author": "Witney Seibold"
    },
    {
      "text": "As you get wrapped up in the frenetic action inside the film's compact, 97-minute structure, you'll admire the thrill ride that The Quiet Place Part II is taking you on.\"",
      "author": "Elias Savada"
    },
    {
      "text": "A Quiet Place: Part II brilliantly teases out the first film's premise, Murphy is very good as the dead-eyed survivor, Emmett, and Simmonds once again steals the show as the endlessly resourceful Regan.",
      "author": "Paul Whitington"
    },
    {
      "text": "A Quiet Place Part II is excruciatingly tense at times and pushes a series of devilish little buttons along the way just to make extra sure we're paying attention.",
      "author": "Hilary A White"
    },
    {
      "text": "I enjoyed the movie, but it does play more so... like a really good episode of a television show than a full-on movie.",
      "author": "Kristian Harloff"
    },
    {
      "text": "Emily Blunt does an exceptional job in a movie that ends a bit too soon - before it can get started in answering my unaddressed questions or do enough exploring",
      "author": "Vincent Schilling"
    },
    {
      "text": "Lives up to its predecessor. Successfully expands on this world introducing new characters that add to the complexity of this environment. Superb sound design and stellar performances by the children make it worthwhile.",
      "author": "Rosa Parra"
    },
    {
      "text": "There's plenty to admire about this intelligent and engrossing follow-up.",
      "author": "Matt Brunson"
    },
    {
      "text": "It's grim and stressful and relentless, but comes off even more hollow than the first film.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "A solid continuation of the first film that allows Millicent Simmonds and Noah Jupe to step into expanded roles. Cillian Murphy is an excellent surrogate father figure and the more playful, experimental sound design delivers new scares.",
      "author": "Joe Lipsett"
    },
    {
      "text": "While this sequel sacrifices some of its full-blooded fear factor for spectacle, the movie knows exactly how to go bump in the night -- and, crucially, in the light of day.",
      "author": "Tom Beasley"
    },
    {
      "text": "Although sometimes the trip is somewhat predictable, as a sequel I find it stimulating and very shocking. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Squanders much of the originality that made the first one so memorable.",
      "author": "Evan Dossey"
    },
    {
      "text": "These movies just eff with you, and we're here for it.",
      "author": "John Serba"
    },
    {
      "text": "John Krasinski ratchets up the tension to almost unbearable levels in A Quiet Place Part II, a sequel that doesn't disappoint thanks to its stellar cast, more big scares, and a story that feels earned after that excellent first movie.",
      "author": "Josh Wilding"
    },
    {
      "text": "Tense and surprising, John Krasinski delivers a sequel that more than lives up to the standards set by its predecessor.",
      "author": "Trace Thurman"
    },
    {
      "text": "You're reminded of all this family lost and how resilient they always were during a pulse-pounding action sequence. He's really quite a good action/thriller director.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "... Part II is more than just a continuation of the story, it's an exploration of a family in transition.",
      "author": "Douglas Davidson"
    },
    {
      "text": "An honorable failure.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "John Krasinski returns to the director's chair and again maintains the suspense and tension as these creatures begin to emerge. [Full review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "Writer/director John Krasinski's sequel to his 2018 horror hit delivers more scares, near-misses and last-minute rescues. It's fine.",
      "author": "Norman Wilner"
    },
    {
      "text": "This thriller is filled with precision-tooled suspense even if it doesn't expand on the 2018 original as much as it could.",
      "author": "Richard Trenholm"
    },
    {
      "text": "The perfect example of a film which was made to be seen in a movie theatre is A Quiet Place Part II.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "A Quiet Place Part II does everything a proper sequel is supposed to do: continue the original arc, expand its universe and broaden the character's boundaries. A third installment seems almost inevitable at this point... and something to wait for indeed.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "'A Quiet Place II' is a horror sci-fi movie to shout about.",
      "author": "Linda Cook"
    },
    {
      "text": "A Quiet Place II successfully carries the baton even if it doesn't outmatch the previous movie.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "...delivers the requisite action, even with a similarly terse running time...",
      "author": "Eddie Harrison"
    },
    {
      "text": "This sequel continues the distressing viewing experience from the first film where anticipatory noise in itself is unsettling. It's still just as brilliant and clever, making for a satisfying thriller.",
      "author": "Louisa Moore"
    },
    {
      "text": "The real treat of \"Part II,\" however, is in watching Millicent Simmonds as Regan.",
      "author": "Hosea Rupprecht"
    },
    {
      "text": "While it doesn't hit the levels of the first for me, A Quiet Place Part II still has so much to love as we watch these characters overcome their grief in a world that doesn't allow the luxury to wallow in it",
      "author": "Amanda the Jedi"
    },
    {
      "text": "There's nothing like the big screen for a fun ride like this, and the Abbots won't be the only ones holding their breath.",
      "author": "Filipe Freitas"
    },
    {
      "text": "A Quiet Place Part II is a rollicking good time... it's all part of an exceedingly well-constructed mild horror film... with thrills galore. If this doesn't get people back to the movies, I'm not sure what will.",
      "author": "Catherine Springer"
    },
    {
      "text": "For all of its big and brilliant sequences of suspense and monster scares, the film feels a little less emotionally investing and interesting than its predecessor.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Unlike many other horror films, where people are ultimately only a means to an end, here you really get the feeling that you're dealing with real people... the film doesn't shy away from showing the ugly sides of human nature. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "It's the most overtly Spielberg-ian exercise to hit the big screen since Super 8. ... Krasinksi proves he's learned a lot from the master of adventure and suspense.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "A great companion to the original film. It has all the thrills and emotions of the original while exploring the world more and introducing more characters.",
      "author": "Sean Chandler"
    },
    {
      "text": "Krasinski doesn't mess too much with the formula that made the first \"A Quiet Place\" so chillingly effective.",
      "author": "Sean P. Means"
    },
    {
      "text": "Krasinski's instincts are very good, and once you've placed the primary action there...then it allows the story to move forward, maintain and even build on the tension of the original.",
      "author": "Mark Kermode"
    },
    {
      "text": "A bigger, more ambitious and spectacular than the original... but it never betrays the elements that made it a terrifying experience with heart. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "Krasinski has given us characters we feel like we know and care about. He doesn't just rely on shock value to entertain audiences, he's created an effective horror with a compelling premise that pushes the story forward.",
      "author": "Susan Kamyab"
    },
    {
      "text": "Ultimately, it's the younger players who make all the difference here.",
      "author": "Rubén Rosario"
    },
    {
      "text": "While the first one was about the unease of bringing children into this dangerous and unpredictable world, \"Part II\" is about the even greater unease of trusting those children to navigate that world on their own.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "The sequel to John Krasinski and Emily Blunt's horror-thriller A Quiet Place can't deliver the same surprises as the original. But it still works.",
      "author": "Eileen Jones"
    },
    {
      "text": "Krasinski has on his side a gifted actress, Blunt (his wife in real life), whose job in the sequel is to convey terror and vulnerability. She excels in this regard.",
      "author": "John Lui"
    },
    {
      "text": "Suffers from sequel-itis. What was new in the first is old in the second.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Tense and action-packed. It could be the end - but it leaves plenty of space to expand.",
      "author": "Dan Murrell"
    },
    {
      "text": "This sequel can never feel as fresh or as groundbreaking as the original, but it lives up to the high bar set by its predecessor.",
      "author": "Matt Neal"
    },
    {
      "text": "The brilliant resolution via the parallel montage works. [Full review in Spanish]",
      "author": "Rubén Romero Santos"
    },
    {
      "text": "Having been raised by a dad who modeled self-sacrificial love and courage, Regan [and Marcus] both demonstrate these characteristics in the film.",
      "author": "Brett McCracken"
    },
    {
      "text": "Taking out the fact that it's in the horror genre, it's just a good, well-made movie.",
      "author": "Jaby Koay"
    },
    {
      "text": "The biggest asset of this second chapter is Simmonds -- the young actress telegraphs a striking combination of determination and fear like nobody else, carrying a movie at the ripe age of 18 alongside heavyweights such as Murphy and Blunt.",
      "author": "Ella Kemp"
    },
    {
      "text": "A Quiet Place Part II is still an effectively tense, scary sci-fi/horror mash-up, and, as theaters are reopening, a great film to experience with a crowd.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Krasinski succeeds not in expanding the mythology of the monsters, but in continuing to focus entirely on family dynamics. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "A Quiet Place 2 is perfect for terrifying escapism. [Full Review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "This is what a director hitting a long home run with a vicious bat flip looks like on film. A sequel with monstrous expectations is just as sharp as the brilliant original.",
      "author": "Dan Buffa"
    },
    {
      "text": "Trusting the audience enough to spend more time on showing rather than telling, A Quiet Place Part II truly is a masterclass of visual story telling, made possible by its talented and committed cast.",
      "author": "Burt Peterson"
    },
    {
      "text": "Featuring some stupendous parallel editing and killer jolts, A Quiet Place Part II is a fine film to herald the full-scale return to cinemas.",
      "author": "Christopher Schobert"
    },
    {
      "text": "[A Quiet Place Part II] ends up treading a very familiar and formulaic path. It is still a nerve-shredding thrill ride of course.",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "I didn't appreciate viewing a child in agony then actual torture by dosing vodka on a wound. Poor and irresponsible choices were made here in writing.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "A remarkable sequel that rightly expands John Krasinski's terrifying universe. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "In a cast of heavyweights, Millicent Simmonds delivers another standout performance as her arc fuels the action.",
      "author": "Gemma Creagh"
    },
    {
      "text": "A Quiet Place Part 2 is finally here, and it was well worth the wait. It's a powerful continuation of the original story that retains all the aspects that worked in its predecessor while exploring new themes and character development.",
      "author": "Jennifer Ouellette"
    },
    {
      "text": "A Quiet Place Part II feels more like an expansion pack than a full sequel, reusing assets to tell a brief epilogue that doesn't move the story forward very far.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "This is a film that begins with the motherly advice to \"just breathe\" - and then does its damnedest to make sure you do the opposite for 90 minutes.",
      "author": "Harry Guerin"
    },
    {
      "text": "Totally stupid but still fun.",
      "author": "Bob Grimm"
    },
    {
      "text": "We get a taste of what we loved in A Quiet Place, and we also get a compelling new hook to hang the franchise on. That's a good way to make a sequel.",
      "author": "Scott Weinberg"
    },
    {
      "text": "\"More of the same\" has rarely been carried off with such elan.",
      "author": "Donald Clarke"
    },
    {
      "text": "Krasinski not only ups the tension but also continues to build a world that slowly reveals itself to the audience, surprise after surprise. {Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Top-notch film making; moves faster than its predecessor--a genre film so there's not a lot of meat on the bone, but the barbecue sauce is tangy.",
      "author": "Peter Canavese"
    },
    {
      "text": "Sound is used very carefully and precisely, and the range of high action and quiet tension play off one another very well indeed.",
      "author": "Keri O'Shea"
    },
    {
      "text": "Director and co-writer John Krasinski certainly keeps tension levels and visual-effects standards high, but one plot revelation is borderline laughable.",
      "author": "Matthew Bond"
    },
    {
      "text": "It is terrific, and really should be seen on the biggest screen possible.",
      "author": "Brian Viner"
    },
    {
      "text": "You get the sense that Krasinski faintly disapproves of the genre that has given him his biggest success, but the best bits are really genre thrills, their screws tightened.",
      "author": "Tom Shone"
    },
    {
      "text": "The characters ooze slowly and lethargically away from each other, and without that farmhouse location, and the symbolic power of the family it implies, the horror movie tension simply evaporates.",
      "author": "Kevin Maher"
    },
    {
      "text": "You daren't look away from a film that passes in a flash, ending at the poiint A Quiet Place Part III begins.",
      "author": "Graham Fuller"
    },
    {
      "text": "It's not much of a secret that these films aren't great, but given the state of the art, they're setting a relatively, welcomingly high standard.",
      "author": "Matt Lynch"
    },
    {
      "text": "Krasinski's slick, skilful follow-up to his 2018 post-apocalyptic thriller works well as a genre exercise...",
      "author": "Simran Hans"
    },
    {
      "text": "This film is a respectable sequel that knows how to settle in the pocket. Where it lacks in suspense, it makes up in writing and performances.",
      "author": "Stephanie Chapman"
    },
    {
      "text": "Suspenseful sequel A Quiet Place: Part II advances the family survival tale on a greater scale, but with less intensity.",
      "author": "André Hereford"
    },
    {
      "text": "A Quiet Place Part II will satisfy horror fans that are looking for the scares, while also giving us a heartfelt story about the lengths people will go to protect others from the unimaginable.",
      "author": "Shannon McGrew"
    },
    {
      "text": "The sequel is fine ditching a few logic points to raise the spectacle. It's not the ideal trade-off since the first showed it is capable to be smart and suspenseful.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "[T]he film's depiction of survivors dealing with the everyday drudgery and dread of an ongoing threat resonates in ways the filmmakers couldn't have anticipated.",
      "author": "Alistair Harkness"
    },
    {
      "text": "While it's not as fresh or surprising as the original, A Quiet Place Part II adeptly balances the demands of both the genre movie and the emotional impact of the family drama.",
      "author": "Wenlei Ma"
    },
    {
      "text": "I really like John K's structuring & jump scares, BUT (big BUT) the humans have all the conveniences, which makes the conclusion a bit foregone. If you liked the FIRST ONE ...",
      "author": "Patrick McDonald"
    },
    {
      "text": "With only two directing credits under his belt, actor-turned-filmmaker John Krasinski has proven himself one of the brightest up-and-comers in cinema.",
      "author": "Robert W. Butler"
    },
    {
      "text": "It's more of the same but it's still very effective. The only problem is an abrupt ending that doesn't wrap things up or set it up well for more.",
      "author": "Paul Salfen"
    },
    {
      "text": "I still care about the family, it's still well done, it's well executed, the tension is still there.",
      "author": "Tony Baker"
    },
    {
      "text": "Now, it doesn't clear the high bar set by the first movie, whose surprising and innovative craftsmanship made it one of the best horror movies of recent years. But it does have plenty to offer.",
      "author": "Allen Adams"
    },
    {
      "text": "With Blunt, Jupe and, above all, Simmonds all doing sterling acting work, A Quiet Place Part II remains a superior horror movie. Do go. Just don't bring any popcorn.",
      "author": "Jason Best"
    },
    {
      "text": "Krasinski manages to coax out more tension and thrills from his new sequel, even through the curtain was fully pulled back on the lurking evil in the first film. It's not as fresh, but still entertaining.",
      "author": "Bill Watters"
    },
    {
      "text": "The perfect summer popcorn movie, not in the sense that you need to check your brain at the door, but this is a movie about sensation, not inner contemplation, and it's a bracing, entertaining example of the form",
      "author": "Catherine Bray"
    },
    {
      "text": "QP2 is not the kind of sequel that lingers in the mind afterward, but it's good enough to make getting back to the movie theaters seem worth getting off the couch for.",
      "author": "Dennis Harvey"
    },
    {
      "text": "It's a testament to the quality of actors like Blunt and a new survivor played by Cillian Murphy that anyone would care, what with their emotional range trapped somewhere between determined and very determined.",
      "author": "Chance Solem-Pfeifer"
    },
    {
      "text": "Krasinski's direction is assured and inventive, avoiding cheap scares while cleverly using depth of focus and a vivid sound mix to put the audience into the characters' shoes.",
      "author": "Rich Cline"
    },
    {
      "text": "Part II is just as taut and lean as its predecessor.",
      "author": "Tom Meek"
    },
    {
      "text": "If you liked A Quiet Place, you should expect to enjoy more of the same in its sequel, given how closely it hews to the original formula.",
      "author": "Nick Johnston"
    },
    {
      "text": "Maybe nothing could have possibly matched the original for me. [But] everyone is very good in it. The kids, Noah Jupe and Millicent Simmonds, really are the stars here.",
      "author": "Christy Lemire"
    },
    {
      "text": "Like in the first film, Krasinski has a greatly assured sense of direction. He brings terrific performances out of his cast.",
      "author": "Lael Loewenstein"
    },
    {
      "text": "The new film has inevitably lost the concision of the last, in the same way the minimalist frights of Alien were swapped for the wham-bam action of Aliens... In other instances, though, the stakes have been raised.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "When A Quiet Place Part II works, it really works. But, overall, it fails to live up to the expectations and high standards that the first movie has established.",
      "author": "Reyzando Nawara"
    },
    {
      "text": "Not nearly as enthralling as the original, the director lazily copies and pastes...",
      "author": "Shawn Edwards"
    },
    {
      "text": "If you haven't been unsettled enough in the past year, A Quiet Place Part II is just the thing.",
      "author": "Raphael Abraham"
    },
    {
      "text": "Going from world building to world exploring, Part II experiments less with genre to bring about a noticeably different experience - one with a lot more sound and a lot less story...[but] there's a good apocalypse story here.",
      "author": "Luke Parker"
    },
    {
      "text": "Who says we need Christopher Nolan and his twisty turny theatrics to save cinema when John Krasinski barely requires dialogue to get the job done.",
      "author": "Zehra Phelan"
    },
    {
      "text": "It's hard to begrudge A Quiet Place Part II much... Clocking in at a brisk 97 minutes, it's a lean-and-mean thriller with a lot of heart, even though it's a bit thin.",
      "author": "Joshua Rivera"
    },
    {
      "text": "It's a decently mounted, handsome-looking effort that squanders the considerable potential it arrives with.",
      "author": "Dominic Corry"
    },
    {
      "text": "Blunt makes messy braids and dirty bare feet look apocalyptic chic.",
      "author": "Dana Barbuto"
    },
    {
      "text": "It's an interesting thread for A Quiet Place to pull on, but also in many ways a necessary one: You can watch the heroes quietly evade hypersensitive aliens only so many times before the \"don't make a sound\" novelty wears thin.",
      "author": "Sean Fennessey"
    },
    {
      "text": "There's a great benefit to seeing a movie that depends for much of its impact on a brilliant soundtrack with long passages of silence and an appreciative audience.",
      "author": "David Stratton"
    },
    {
      "text": "The Abbotts venture into the unknown in a meticulously crafted monster movie that leaves us wanting more.",
      "author": "Richard Roeper"
    },
    {
      "text": "A Quiet Place Part II is not without its problems, but John Krasinski has crafted a genuinely scary, emotionally satisfying follow-up to one of the best horror films of the past few years.",
      "author": "Mark Cassidy"
    },
    {
      "text": "I felt some of the more suspenseful moments but I wish I could tell you that in its fleet 97 minutes, Part II approached the surprise level of the original...feels more like an encore than a great sequel.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Krasinski's sequel chills as a suspense-filled survival drama...",
      "author": "Dann Gire"
    },
    {
      "text": "The world of the original is expanded, there's a bit more noise and the jump scares are just as effective... This chapter manages to still keep interest peaked.",
      "author": "Alci Rengifo"
    },
    {
      "text": "While it is certainly thrilling for its duration, what you see - or hear - is what you get. For here, as in A Quiet Place, viewers will find little subtext to keep ringing and resonating in their ears afterwards.",
      "author": "Anton Bitel"
    },
    {
      "text": "As he did the first time around, Krasinski shows a gift for directing this type of fare, producing several scenes that pull you in and almost refuse to let you breathe.",
      "author": "Mark Meszoros"
    },
    {
      "text": "Millicent Simmonds delivers a pivotal performance in this subtly suspenseful sequel, opening the door for yet another installment.",
      "author": "Susan Granger"
    },
    {
      "text": "It is very rare that a sequel is better than the first movie, but Part II pulls it off with intense moments, perfectly placed jump scares, and a stellar cast.",
      "author": "Tessa Smith"
    },
    {
      "text": "This is a precision-tooled exercise in suspense, as lean and taut at 97 minutes as the sinewy limbs of its monster menagerie, and it marks a welcome return of the big-screen blockbuster.",
      "author": "Jonathon Wilson"
    },
    {
      "text": "The true talent of A Quiet Place Part II belongs to editor Michael P. Shawver, who manages to turn two relatively straightforward storylines into competing narratives tied to a singular outcome.",
      "author": "Matthew Monagle"
    },
    {
      "text": "Apart from such cliches, there doesn't seem to be much going on in A Quiet Place Part II - or if there is, nobody's talking.",
      "author": "Jake Wilson"
    },
    {
      "text": "\"A Quiet Place: Part II\" sounds like a winner to me.",
      "author": "Russ Simmons"
    },
    {
      "text": "A film that's as stirring as it is scary.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Any omniscient truth is still rightfully guarded and methodically uncloaked at its own speed.",
      "author": "Don Shanahan"
    },
    {
      "text": "Even with some notable improvements, A Quiet Place Part II suffers from the same breathlessness as its predecessor.",
      "author": "Matt Conway"
    },
    {
      "text": "It may do more of the same, but it does it bigger and better, with greater jolts and jumps, extended time with the extraterrestrial foes and a writer-director who has honed in his voice, style and message. There is nothing to be quiet about with this one.",
      "author": "Candice McMillan"
    },
    {
      "text": "There is not a millimeter of extraneous footage. This is lean and mean filmmaking at its very best that will leave you breathless. And hoping for A QUIET PLACE 3.",
      "author": "Andrea Chase"
    },
    {
      "text": "\"Part II\" manages that rare feat of being equally as impressive as the original. Watching these actors perform such intense and emotional scenes with no dialogue, in extreme close up, reminds you of how brilliant the setup is.",
      "author": "Dustin Chase"
    },
    {
      "text": "I never lost track of what was occurring where or to whom, tension rising incrementally with such violent intensity it almost became unbearable.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "(Writer/director John) Krasinski's sense of control over the tempo and atmosphere of his film is masterful.",
      "author": "Michael Ward"
    },
    {
      "text": "While the feature's potency and skill doesn't come as a surprise this time around, and neither does the unsettling unease that comes with all that waiting and those pervasive hushed tones, every second of this stellar sequel is no less thrilling.",
      "author": "Sarah Ward"
    },
    {
      "text": "Back for a second, horrific spin, the most potent weapon in director John Krasinski's tensile nightmare is still its silences.",
      "author": "Andiee Paviour"
    },
    {
      "text": "AQP2 is more of a balanced meal. Plenty of creature action, genuine emotion thanks to Murphy, and Krasinski's direction shines even more this time around.",
      "author": "Lee McCoy"
    },
    {
      "text": "A good sequel to a GREAT movie.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "You're going to be sitting there, holding your breath time and time again!",
      "author": "Marianna Neal"
    },
    {
      "text": "I could pick at the little things that bother me about \"A Quiet Place II,\" but in the end, I got a pretty good monster story that was a load of fun, in a scary way.",
      "author": "Robin Clifford"
    },
    {
      "text": "Smart, tense, lean and mean; knows it can't have the same surprise impact of the first movie so it doesn't try.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "The perfect summer movie with plenty of thrills and chills!",
      "author": "Joe Friar"
    },
    {
      "text": "John Krasinski doesn't quite match the smart pacing from his 2018 thriller and those memorable sounds of silence that spoke volumes. Instead, we get many more entanglements with invading aliens we hardly saw at all in that less monster-happy original.",
      "author": "John Urbancich"
    },
    {
      "text": "A Quiet Place II is Millicent Simmonds' motion picture as it should be.",
      "author": "Richard Propes"
    },
    {
      "text": "Krasinski has trained his audience to be on edge teeing us up at certain moments, only to pivot, and then pulls the rug out from under us when we least expect it. Get ready to quietly eat your popcorn and muffle your screams.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Blunt continues to perfect her look of frozen fear throughout, and Lupe is given moments of far greater depth here that he handles with aplomb. But allowing young Simmonds to take the lead was perhaps one of the filmmaker's best choices.",
      "author": "Rob Rector"
    },
    {
      "text": "Writer/director John Krasinski crafts not just a strong mother figure in Evelyn, but an equally strong character in Regan, centering on her journey using wit and determination.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "To be honest, a few story holes regarding the alien monsters emerge in the film, and the more you think about them, the bigger they get. These chiefly regard the aliens' attitude to water and their vulnerability to guns...All in all, a worthy follow-up.",
      "author": "Jim Schembri"
    },
    {
      "text": "Sequels are a difficult trick to pull off, as many rarely manage to exceed their predecessor. But A Quiet Place Part II comes closer than most.",
      "author": "Andrew Gaudion"
    },
    {
      "text": "Slick but endearing sequel.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "When the film works, it works very well: there are multiple airtight setpieces in the first half.",
      "author": "Tim Brayton"
    },
    {
      "text": "Overall, A Quiet Place Part II might just be about the most sequel-ish sequel to ever sequel, in that it's basically a repeat of the original, only a little bit bigger and showier.",
      "author": "Ciara Wardlow"
    },
    {
      "text": "Krasinski presents these and other such details with lucidity. His direction is so efficient and assured that the three or four rather ridiculous plot elements go unnoticed until well after the movie's over. That's how absorbing \"Part II\" can be.",
      "author": "Mark Feeney"
    },
    {
      "text": "There are nitpicks - some small, some a little bigger - but mostly, \"A Quiet Place Part II\" does its job by giving viewers more and leaving them wanting even more. That's the modern franchise way.",
      "author": "Adam Graham"
    },
    {
      "text": "The superior sound design enormously helps to intensify the beautifully calibrated perils, adding further impressive frills to the high concept action of this agonisingly tense, wonderfully immersive movie.",
      "author": "Alan Jones"
    },
    {
      "text": "... more than just a compilation of surface frights, finding fresh and satisfying new avenues to explore its characters, both of the human and extraterrestrial variety.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "John Kransinski proves he is not a one-hit wonder.",
      "author": "Kevin Carr"
    },
    {
      "text": "The film creates tension while holding onto that dread throughout, even amping up the suspense this time around.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "Was I disappointed by the movie? Certainly not. Despite its flaws, it's still an engrossing piece of entertainment. Do I think they honestly needed to make a sequel? That will remain for time to tell.",
      "author": "Damond Fudge"
    },
    {
      "text": "All I could think about was Marc Maron's go-to jab on WTF when talking about comics he doesn't appreciate: \"It's like math\" ... It's so tightly crafted that the filmmaking is almost oppressive.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "I'd recommend it to horror fans even if the COVID-19 pandemic had never happened, but I can't think of a more fitting way to return to movie theaters.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "The film oscillates between several storylines and it is just as thrilling as the first. But it is also a blatant foray into franchise territory.",
      "author": "Alice Kemp-Habib"
    },
    {
      "text": "A Quiet Place II is a great movie and shows that show, not tell, is always the best option for making a compelling film.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "A marvel of a sequel that smartly avoids any attempt to recapture the original, instead expanding its world in every way possible. Brisk, crisp, efficient, and full of masterful sequences of suspense.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "The first movie had a novelty to it that's impossible to recapture, but much to director John Krasinski's credit, that's not what he's striving for with the sequel.",
      "author": "Matthew Passantino"
    },
    {
      "text": "If you loved the first movie and want more of the same, see it. But if you sat this one out and waited for 'Part III' instead, it feels like you wouldn't miss a thing.",
      "author": "Larry Carroll"
    },
    {
      "text": "What better film to encourage we sequestered humans to peer outside and venture cautiously into a post-pandemic cinema era than one which features characters burrowing from beneath their hidey-holes and into a post-alien invasion world?",
      "author": "Frank Wilkins"
    },
    {
      "text": "By no means is A Quiet Place Part II a perfect film, but as a piece of popular entertainment constructed as a purely cinematic thrill, a more perfect Welcome Back to Theaters movie hasn't yet presented itself.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "A Quiet Place Part IIdeserves to succeed because it's so good-not just because it's coasting on an earlier hit. Like any sequel it can't offer a fresh core concept...but it can extend the thrills and chills without seeming forced or contrived",
      "author": "Leonard Maltin"
    },
    {
      "text": "A lopsided film, one whose returns ever diminish toward another sudden ending.",
      "author": "Richard Lawson"
    },
    {
      "text": "Beyond the many jump scares... and the terrifically terrified-out-of-their-wits performances, what makes A Quiet Place Part II special is the sheer joy we get from feeling like we're in the hands of a confident filmmaker.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "It aptly fills the large shoes of its predecessor, expands upon the story without feeling like filler, and takes on new, unexpected resonance in a world recovering from a pandemic.",
      "author": "Dan Scully"
    },
    {
      "text": "To be clear, as far as \"oh sh*t, lookout!\" goes, A Quiet Place Part II puts the capital F from \"F that\" in fun. Things only collapse if you think logically at any point for any reason, even briefly.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Like the first film, this one has dubious elements... But Krasinski's taut yet passionate direction carries us past such objections while we're watching the movie.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "Krasinski, who co-writes with Scott Beck and Bryan Woods, neatly expands the \"Quiet Place\" universe without straying too far from the personal story that audiences found originally endearing.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Okay, I will say it: These \"A Quiet Place\" films are idiotic, M. Night Shyamalan movies made by John Krasinski, starring his wife as a post-apocalyptic Mary Poppins.",
      "author": "James Verniere"
    },
    {
      "text": "... parallel action ramping up the drama in a feat of precise editing. Adding prologue context with a bit of world building helps the sequel improve the original while excelling on its own.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "It may be sitting in the shadow of the original but, as a more straightforward horror blockbuster with phenomenal lead performances and confident craftsmanship, it absolutely delivers.",
      "author": "Laura Potier"
    },
    {
      "text": "A Quiet Place Part II is the perfect cinematic experience to welcome us back to movie theaters. See it on the biggest, loudest screen you can find!",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "'Part II' roars with heart and intensity. It's one of the better sequels out there, and there's more room for the film series to grow (if in the right hands).",
      "author": "Preston Barta"
    },
    {
      "text": "I was glued from start to finish and think you probably will be as well, especially if you enjoyed the suspense and horror that the first film offered.",
      "author": "Jim Judy"
    },
    {
      "text": "It's the simple focus on the main characters' reactions to everything that gives it a similar power as its predecessor.",
      "author": "Jeff York"
    },
    {
      "text": "A Quiet Place Part II is a different beast from the original film and that's OK.",
      "author": "Matthew Razak"
    },
    {
      "text": "It has considerable merits, more than enough to warrant a cool recommendation.",
      "author": "Sean Collier"
    },
    {
      "text": "It's rare for a sequel to be on the same level as the original, and even rarer for horror sequels, but A Quiet Place Part II delivers on all fronts.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "Tight, taut, and terrifying.",
      "author": "Sonny Bunch"
    },
    {
      "text": "We all need a cathartic release, and no film is currently better suited to scream with your neighbor than John Krasinski's worthy follow-up. A film which demands to be seen on the biggest of screens.",
      "author": "Aaron Peterson"
    },
    {
      "text": "The 2018 A Quiet Place was a movie about family values-chief among them, don't die a painful and horrifying death.",
      "author": "Kurt Loder"
    },
    {
      "text": "Finally, a movie worth coming back to theaters for! John Krasinski has masterfully crafted a classic tension-filled horror film- my favorite one since 2018's Hereditary.",
      "author": "Jason Escamilla"
    },
    {
      "text": "By doubling down on world-building while backing off on aesthetic choices, it begins to resemble just another monster movie.",
      "author": "Oscar Goff"
    },
    {
      "text": "A Quiet Place II entertains and provides a movie-making lesson on how to handle a thriller. It may not parallel the original but what a way to launch a return to movie theaters.",
      "author": "Wendy Shreve"
    },
    {
      "text": "But what should've been an engaging, thorough exploration of an established world, the sequel doesn't go further beyond the confines of its own story.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "A sequel always loses the advantage of surprise, but Krasinski has crafted the perfect thriller to get summer audiences back into movie theaters where everything is dark and everyone can hear you scream.",
      "author": "Peter Travers"
    },
    {
      "text": "If the original film's secret sauce was its ingeniousness, the sequel's lack of it becomes all the more glaring.",
      "author": "Piers Marchant"
    },
    {
      "text": "\"A Quiet Place Part II\" manages to be perfectly fine, and unsurprisingly, a more generic affair...",
      "author": "Brian Lowry"
    },
    {
      "text": "\"A Quiet Place Part II\" takes the intimacy of the original and expands it in a way that is fresh and full of thrills - a cinematic rollercoaster that will leave audiences gripping their seats from all the tension.",
      "author": "Micheal Compton"
    },
    {
      "text": "\"Part II\" is every bit as good and scary as its predecessor, and the characters, especially the kids, go to deeper and braver places.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "This follow-up offers the solid satisfactions of suspense and intensity without the delight of discovery.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "A rollicking summer blockbuster, executed with skill and calculated with maximum return in mind.",
      "author": "Norman Gidney"
    },
    {
      "text": "Thrilling and Suspenseful",
      "author": "Kathia Woods"
    },
    {
      "text": "Not nearly as tantalizing as the amazing original, the only relevant question for this movie is not whether it is good, but whether it will bring some noise back to movie theaters",
      "author": "J. Don Birnam"
    },
    {
      "text": "Even though this film has more bare feet than a Tarantino production, it is sure-footed and intentional with its approach.",
      "author": "Jon Espino"
    },
    {
      "text": "A Quiet Place II lives up to everything its predecessor provided -- subtle, yet intense performances, terrifying creatures and genuine jolts that induce goosebumps and seat jumping.",
      "author": "George M. Thomas"
    },
    {
      "text": "I love a sequel which delivers on its most excellent predecessor and A Quiet Place 2 is just as thrilling, just as cleverly simple and full of the perfect kind of peril and frights to engage the brain as well as the heart.",
      "author": "Kate Rodger"
    },
    {
      "text": "There is a sequence in \"A Quiet Place Part II\" that, in its own way, recalls Hitchcock's respect for storytelling and use of technique as a way to unsettle, even destroy an audience's equilibrium.",
      "author": "Michael Calleri"
    },
    {
      "text": "Louder, gnarlier, more conventional and worth a couple of minor eyerolls. But at least writer-director John Krasinski isn't copying over every stinger from the first go-round, and Marco Beltrami's mournful score regularly counters the cranked volume.",
      "author": "Nick Rogers"
    },
    {
      "text": "A Quiet Place Part II lends itself perfectly to the big screen experience. On the other hand, the movie - which was shot and initially set for release before COVID-19 hit - almost seems to parallel the situation we're living in at times.",
      "author": "Patricia Puentes"
    },
    {
      "text": "Krasinski avoids a lot of the troublesome tropes these types of horror sequels tend to get tripped up in, specifically the Jurassic Park problem where every sequel feels the need to top the previous one with bigger, badder creatures",
      "author": "Jon Negroni"
    },
    {
      "text": "Returning writer/director John Krasinski has omitted any reason to care why these characters move from ... suspense sequence to suspense sequence.",
      "author": "Mark Dujsik"
    },
    {
      "text": "John Krasinski's command of suspense has grown sharper yet. This is a worthy successor to the horror hit.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "I really liked the first \"Quiet Place\" and was skeptical Krasinski could top it but I'm here to shout loudly that he has.",
      "author": "Chris Hewitt"
    },
    {
      "text": "It's not perfect, but this admirable horror sequel -- impeccably, skillfully directed by John Krasinski -- operates with meticulous use of sound and editing.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A Quiet Place Part II is a taut, visceral thriller that will keep you on the edge of your seat. The tension flows seamlessly from the first film, a must-see in theaters.",
      "author": "Julian Roman"
    },
    {
      "text": "A Quiet Place: Part II reminded me how much I missed going to the movies",
      "author": "Hannah Lodge"
    },
    {
      "text": "A Quiet Place Part II rocks. It's everything you want it to be and more, and it's Exhibit A as to why you should consider returning to the movies.",
      "author": "Tom Santilli"
    },
    {
      "text": "Writer director John Krasinski builds on the kudos of his sleeper hit A Quiet Place, with an expansive sequel of equal calibre.",
      "author": "Martin Carr"
    },
    {
      "text": "A Quiet Place Part II will have audiences stuck to the edge of their seats.",
      "author": "Ben Rolph"
    },
    {
      "text": "Standard sequel stuff.",
      "author": "Michael J. Casey"
    },
    {
      "text": "A Quiet Place Part II had my attention, now my appreciation for this series is loud and clear.",
      "author": "Leo Brady"
    },
    {
      "text": "Though it has some fairly good sequences, a couple of strong performances, serviceable imagery and a pretty pat story, it's that total level of mediocrity that essentially dooms the film.",
      "author": "Rob Dean"
    },
    {
      "text": "A fantastic and worthy follow-up to the 2018 original film. Not only is it a nerve-racking ride, but it also expands the world and gives us more monster action. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "While it has its weak moments, A Quiet Place Part II is more often than not the dramatically taut sci-fi/horror hybrid that fans want and need.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Faster, coarser and far noisier, \"Part II\" sacrifices emotional depth for thriller setups that do less to advance the plot than grow the younger characters.",
      "author": "Jeannette Catsoulis"
    },
    {
      "text": "The problem isn't that Krasinski is insensitive so much as that he's unperceptive. He doesn't see the world that he's creating, only the story that he's telling-or, worse, the script that he's illustrating.",
      "author": "Richard Brody"
    },
    {
      "text": "Krasinski, once again, teases out an overarching vibe of near-despair that's effective for sure: Even more than the first film, this is a vision of neighborly Americana, shattered.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "While the filmmaker is dazzling you with one horrific sight after another, you're not supposed to notice the script's inconsistencies and its characters' bonehead decisions.",
      "author": "Charles Koplinski"
    },
    {
      "text": "...Krasinski's taut direction here is the true star, as time and time again he shuffles the elements and delivers new, clever set pieces.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Doesn't reinvent the horror movie wheel-even the first film didn't do that-but like its predecessor it cunningly employs silence to generate a pervasively unsettling atmosphere and sudden bursts of sound to amplify the jolts.",
      "author": "Frank Swietek"
    },
    {
      "text": "Remember the sticky-uppy nail from the first movie? Krasinski does, and with more closeups of bare feet than a Tarantino movie, expect that kind of thing in spades.",
      "author": "Katie Parker"
    },
    {
      "text": "Simmonds is the main attraction here. She gives a kick-ass performance, not allowing her deafness to deter her from her task. She is smart and resourceful, but also allows us to see the fear she holds inside.",
      "author": "Bob Bloom"
    },
    {
      "text": "The great performances and brilliant sound design of A Quiet Place Part II are all in service to Krasinski's vision, the same one he had when approaching the first film.",
      "author": "Charlie Ridgely"
    },
    {
      "text": "A Quiet Place was sneakier, while the sequel no longer hides the threat and plops monsters in every possible scene.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Performances couldn't be more committed, communicating vein-bulging horror with superb body language. Dramatically, the movie isn't a bold leap forward.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Fans will be pleased to learn this second installment is every bit as good, if not better, as its predecessor.",
      "author": "Allison Rose"
    },
    {
      "text": "Writer/director John Krasinski and his team don't try to reinvent the wheel, taking everything that worked in the first film and just amping it up a little more.",
      "author": "Alex Bentley"
    },
    {
      "text": "A louder, worthy sequel, but it sacrifices the original's brilliant beats.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "The thrills are even more intense than the first, and the story arcs are more compelling. This is easily one of the best movies of the year.",
      "author": "Austin Burke"
    },
    {
      "text": "While Krasinski is obviously giving us a rehash of his previous success, I have to admit that he does it in a technically skilled manner.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "The only real annoyances in \"A Quiet Place Part II\" can be found in plenty of other thrillers.",
      "author": "Sabrina LeBoeuf"
    },
    {
      "text": "By the middle of its running time, \"A Quiet Place Part II\" requires a conscious effort to stay awake.",
      "author": "Mick LaSalle"
    },
    {
      "text": "While Krasinski the screenwriter may have found himself in a bind determining how to move forward, Krasinski the director makes the most out of the meager material.",
      "author": "James Berardinelli"
    },
    {
      "text": "This sequel may not be as inventive as its predecessor, but it delivers plenty of white-knuckle tension and satisfying scares.",
      "author": "Rafer Guzman"
    },
    {
      "text": "\"A Quiet Place II\" might just restore your faith, not only in sequels, or in movies, but in humanity.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "This is a hugely entertaining slice of suspense-based horror, and does exactly what you want a good sequel to do.",
      "author": "Grant Watson"
    },
    {
      "text": "For a movie brought into existence by market forces more than artistic vision, it maintains its narrative integrity.",
      "author": "Josh Bell"
    },
    {
      "text": "An exhilarating and rousing spectacle that must be seen on the big screen. Millicent Simmonds gives a radiant and charismatic performance.",
      "author": "Avi Offer"
    },
    {
      "text": "The children (Noah Jupe and the award winning Millicent Simmonds) have grown both in stature and character, and truly carry the film. Simmonds is especially mesmerizing.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "A Quiet Place Part II is a sequel that entertains just enough to get us to the next movie, and it's disappointing to have to think of it that way",
      "author": "Travis Hopson"
    },
    {
      "text": "Krasinski really surprised with his directing prowess his third time behind the camera and he continues to do the same with his technically assured sequel, even if, this time, the narrative is a little spottier.",
      "author": "Laura Clifford"
    },
    {
      "text": "A horror film without many scares, a thriller without much tension; this just doesn't work on that level. But the acting and technical abilities keep it afloat.",
      "author": "EJ Moreno"
    },
    {
      "text": "What once felt clever now feels like the sort of exercise in corporate-entertainment brand-building that's cynical enough to leave you speechless.",
      "author": "David Fear"
    },
    {
      "text": "A Quiet Place Part II is a stupendous sequel. Krasinski and company masterfully built on the world, story, and themes of the first film, doing right by its characters and their fans.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Writer-director John Krasinski remains a filmmaker to watch and his anxiety-inducing, pulse pounding \"A Quiet Place Part II,\" proves the lightning-in-a-bottle sensation of 2018's \"A Quiet Place\" was no fluke.",
      "author": "Nate Adams"
    },
    {
      "text": "Krasinski takes great delight in tormenting his audience. Audiences who see this movie will be appreciative of that.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Bring on Part III, quietly.",
      "author": "Moira MacDonald"
    },
    {
      "text": "It may not be as solid as its predecessor, but it's an impressively designed, nicely matched, thoroughly entertaining follow-up that deserves to be seen on the big screen.",
      "author": "Mike Massie"
    },
    {
      "text": "Visually and tonally, A Quiet Place Part II has more frantic intensity than A Quiet Place ... The creature rampages are a big attraction of A Quiet Place movies, but what will keep viewers hooked the most is the believable humanity in this survival saga.",
      "author": "Carla Hay"
    },
    {
      "text": "A heart pounding, alien infused, thoroughly absorbing coming of age story.",
      "author": "Mark Keizer"
    },
    {
      "text": "While A Quiet Place Part II is still quite good, it does not quite live up to the original, but that's perfectly fine.",
      "author": "Alan Cerny"
    },
    {
      "text": "The sequel seems to have drawn various plotlines from \"The Walking Dead,\" \"Dawn of the Dead\" and \"Aliens.\" It works for the most part, although it also feels comparatively derivative and tangential.",
      "author": "Martin Tsai"
    },
    {
      "text": "A Quiet Place Part II is a completely immersive, edge-of-your-seat thriller which manages to build upon the world introduced in the first instalment.",
      "author": "Nicola Austin"
    },
    {
      "text": "Again and again he falls back on more of the same old tricks from \"A Quiet Place,\" which was a bore to begin with.",
      "author": "Katie Walsh"
    },
    {
      "text": "If you liked – or loved – the original, I reckon you'll be satisfied with this second chapter.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "A damn fine sequel that continues the predecessor's strongest aspects while going bolder than your typical studio horror.",
      "author": "Rendy Jones"
    },
    {
      "text": "While it can't be the revelation its predecessor was, Part II very successfully expands on the 2018 hit, enriches its central characters and fully delivers the scares.",
      "author": "Michael Gingold"
    },
    {
      "text": "A well-executed thrill ride that leads to just one destination: \"A Quiet Place Part III\" due next year.",
      "author": "Cary Darling"
    },
    {
      "text": "A Quiet Place Part II offers engaging performers a chance to unpeel new layers of pain and perseverance.",
      "author": "Anna McKibbin"
    },
    {
      "text": "The claustrophobic horror might have been mostly replaced by bigger set pieces, yet A Quiet Place Part II is still horribly tense and just as terrifying as the first movie.",
      "author": "Ian Sandwell"
    },
    {
      "text": "An intense, anxiety inducing nightmare, A Quiet Place Part II will shred your nerves to pieces",
      "author": "Kat Hughes"
    },
    {
      "text": "...the fact that it's so expertly put together makes it a seriously refreshing way to emerge from the pandemic.",
      "author": "Wade Major"
    },
    {
      "text": "This sequel is anything BUT quiet and you have you jumping oout of your sking! Millicnet Simmonds and Noah Jupe are slaying while takng care of themselves and the adults! Stressed me all the way out, but I loved it!",
      "author": "Carla Renata"
    },
    {
      "text": "One of the best horror movies I've ever seen",
      "author": "Rachel Wagner"
    },
    {
      "text": "A Quiet Place Part II is the perfect reason to return to the cinema.",
      "author": "Kate Sánchez"
    },
    {
      "text": "The rare sequel that's just as good as the original. Part II also showcases Millicent Simmonds like never before, taking her from being a very important part of an incredible ensemble to being a significant force driving the whole thing forward.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "One of the better horror sequels I've ever seen... Exactly the kind of movie I wanted it to be.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "The film depends on harrowing moments of unpredictable close calls punctuated at the kind of hair-raising special effects Mr. Krasinski stages very well.",
      "author": "Rex Reed"
    },
    {
      "text": "The strong, natural momentum of a family trying to survive will satiate horror fanatics, but possibly not mesmerize them.",
      "author": "Dwight Brown"
    },
    {
      "text": "Solid thrills, a solid sequel, and a great time.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Like its predecessor, the kind of horror film in which the ordinariness of normal human life is highlighted rather than subverted by extremely abnormal circumstances.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "The thrills and spills of A Quiet Place Part II are elevated by its strong performances and a director with a keen eye for this intelligent genre piece whose broad appeal makes for another sure-fire hit.",
      "author": "Matthew Anderson"
    },
    {
      "text": "Whisper it: Krasinski's done it again, this is going to be huge.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Equally as unnerving, tense, and riveting as its predecessor.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Krasinski weaves the stories together, increases the tempo, and gives us a fast-paced, edge-of-your-seat thriller that will take your breath away.",
      "author": "Matthew Toomey"
    },
    {
      "text": "That sequel rarity that both continues the original's fine standing and creates its own personality in the process.",
      "author": "Peter Gray"
    },
    {
      "text": "A Quiet Place Part II is brasher, more action-driven, and louder. It's still thrilling to watch, even if the ideas ultimately dilute the terror of what came before.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "...mostly about its homegrown characters learning to 'man up.'",
      "author": "Josh Larsen"
    },
    {
      "text": "A stellar piece of filmmaking from Krasinski, who proves himself a master of storytelling, again delivering an intense, gripping and truly frightening film, with a wonderfully heartfelt story... Lives up to the original in almost every way possible.",
      "author": "Dave Lee"
    },
    {
      "text": "An intense and entertaining thrill ride that will have you jumping in your seat as it surpasses the original at nearly every turn.",
      "author": "Rob Hunter"
    },
    {
      "text": "A Quiet Place Part II is an incredibly successful follow-up that does a great job of expanding upon the foundation of the first film in some rather clever and compelling ways.",
      "author": "Heather Wixson"
    },
    {
      "text": "Touching, hopeful and effectively nerve wracking, A Quiet Place II is also a wonderful showcase for Millicent Simmonds.",
      "author": "Nicholas Bell"
    },
    {
      "text": "It's basically one long creep through a haunted house waiting for a sudden sound to break the tension - only here, the sudden sound makes things worse",
      "author": "Anthony Morris"
    },
    {
      "text": "Krasinski has another taut thriller, edited beautifully and within an inch of its life by Michael Shawver.",
      "author": "Roger Friedman"
    },
    {
      "text": "\"'A Quiet Place Part II' proves to be an even fiercer and more emotional experience than the first installment.\"",
      "author": "Tim Grierson"
    },
    {
      "text": "Blunt remains a steely joy, and there can be no argument with her signature shotgun-plus-tea-dress look, suggestive of Ellen Ripley on the school run.",
      "author": "Robbie Collin"
    },
    {
      "text": "The story works almost literally like a Halloween haunted house. For much of the movie, a given audience surrogate walks slowly and carefully through a creepy environment, periodically triggering sudden loud noises and pop-out monsters.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Krasinski, who has lost none of his talent for suspense, once again conjures a lean, mean thriller.",
      "author": "James Mottram"
    },
    {
      "text": "While A Quiet Place Part II can't quite top its predecessor, and never quite nails the multi-narrative cross-cutting it employs, it's still a highly exciting and well-acted follow-up.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "Shockingly, this is even better than the first film. John Krasinski proves he's a talented writer/director as well as actor. Very slick thriller with Spielberg elements.",
      "author": "Grace Randolph"
    },
    {
      "text": "I especially like writer/director John Krasinski's attention to detail.",
      "author": "David Kaplan"
    },
    {
      "text": "Highly entertaining -- even though for me it was almost too scary.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Millicent Simmonds delivers an award-worthy performance serving as the heart and soul of this film.",
      "author": "Scott Menzel"
    },
    {
      "text": "One leaves A Quiet Place Part II with the feeling that the movie has been an extremely well-made and often gripping time-filler instead of a genuine expansion of the tale set-up by the first film.",
      "author": "Don Kaye"
    },
    {
      "text": "A Quiet Place Part II is a bold, emotional, and terrifying sequel. And forgive the hyperbole, but it's one of the best horror sequels I've had the pleasure of seeing.",
      "author": "JimmyO"
    },
    {
      "text": "There always are diminishing returns with movies that exist because of the box office success of their predecessors, but A Quiet Place Part II works on its own terms in delivering the thrills audiences are going to expect.",
      "author": "Pete Hammond"
    },
    {
      "text": "It's almost immediately immersive to be here again... even if it ultimately feels like three quarters of a very good movie chopped off from a whole.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "John Krasinski is most in his comfort zone when the importance of family and legacy drives the film's tension.",
      "author": "Richard Larson"
    },
    {
      "text": "Well worth waiting for - this is a superior horror sequel which builds on a carefully crafted world and continues the story in compelling fashion. Cinema is back, and this is the perfect film to see with an audience.",
      "author": "Rich Phippen"
    },
    {
      "text": "On a technical level, A Quiet Place Part II is excellently made with creativity driving every scenario, but lacking in the places that matter most. The third act is especially sloppy",
      "author": "Robert Kojder"
    },
    {
      "text": "\"A sequel that both expands the world and digs deeper into the personal heart at its center. Doubters, like me, are quieted.\"",
      "author": "Vinnie Mancuso"
    },
    {
      "text": "A Quiet Place Part II wisely focuses on what made its predecessor so great: uncompromising suspense and the performance of the series' shining star, Millicent Simmonds.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "A Quiet Place Part II is a sequel that lives up to, though doesn't quite surpass, the original.",
      "author": "Germain Lussier"
    },
    {
      "text": "A Quiet Place Part II makes for an excellent continuation that offers the thrills and feels audiences fell for previously. Krasinski doesn't break the mold here. This is above all Simmonds' show, and she nails it.",
      "author": "Meagan Navarro"
    },
    {
      "text": "Though Part II never quite lives up to the heart-rending highs or disquieting thrills of the original, it's an undeniably well-constructed coda that passes the baton of responsibility in sneakily emotional ways.",
      "author": "Matt Oakes"
    },
    {
      "text": "A pure 90 minute anxiety attack, but at least the anxiety is all on the screen.",
      "author": "Fred Topel"
    },
    {
      "text": "Let down by some laughably contrived screenwriting.",
      "author": "David Jenkins"
    },
    {
      "text": "Manages to create something even more terrifying and unforgettable.",
      "author": "Edward Douglas"
    },
    {
      "text": "A Quiet Place Part II is lacking in the novelty department, and that by itself makes it a less exciting chapter.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "While well-made and worth seeing in theaters, it plays more like a generic horror movie while also feeling like set-up for spin-offs and further sequels.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Even if this sequel remains firmly in the shadows of the original, I wanted part three as soon as it was over.",
      "author": "Nick Allen"
    },
    {
      "text": "Overall [A Quiet Place Part II] is a solid film. There are tension and creepiness.",
      "author": "John Nguyen"
    },
    {
      "text": "'A Quiet Place Part II' opts for the bigger, badder, nastier route, and while it's never as emotionally compelling or stealthily suspenseful as the first, Krasinski's sequel is a wild creature feature ride worth taking.",
      "author": "Matt Donato"
    },
    {
      "text": "If nothing else, I'm primarily impressed with how these films seem like a cinematic franchise built out of the \"raptors in the kitchen\" sequence from Jurassic Park.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "A Quiet Place II is a string of well-placed, smartly created scenarios leveraged for maximum tension that only swings us to the next film. Rather than allowing us to enjoy this one.",
      "author": "Robert Daniels"
    },
    {
      "text": "Immersive sound design is again the superstar, but Krasinski provides the playground for the incredibly intense, moving, and gripping dramatics that power the picture.",
      "author": "Courtney Howard"
    },
    {
      "text": "Krasinski has grown in confidence and skill, creating a sequel that's at least as riveting if not more so than its predecessor.",
      "author": "Alonso Duralde"
    },
    {
      "text": "By the end of A Quiet Place Part II my stomach literally hurt. There's no way I could have done another 20 minutes because it is too intense. That's one of the best compliments I can give it.",
      "author": "Mike Ryan"
    },
    {
      "text": "Considering the resources at Krasinski's disposal to do something genuinely exciting, it's disappointing to see the lessons that went unlearned as the same tricks get duplicated.",
      "author": "Jordan Raup"
    },
    {
      "text": "It might sound cliché, but it's hard to imagine seeing it anywhere but on the big screen. It's the kind of movie that demands it.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "More crucially, Part II earns the promise of a sequel by doing what the best sequels do, striking out in search of new stories instead of settling for retracing its steps. Part II isn't A Quiet Place, but it's an addition worth applauding all the same.",
      "author": "Angie Han"
    },
    {
      "text": "In a way, the sequel feels even more M. Night Shyamalan-esque, drawing out seemingly mundane sequences for maximum suspense as it does.",
      "author": "Peter Debruge"
    },
    {
      "text": "The sci-fi survival horror sequel \"A Quiet Place Part II\" doesn't quite live up to the refreshing feel or innovative novelty of the original 2018 hit... but the creatures are still freaky, the soundscapes are still interesting...",
      "author": "Brian Truitt"
    },
    {
      "text": "Part II stands as a careful consolidation and continuation of its parent film rather than a departure, with the heart and hope needed to keep us invested.",
      "author": "Kevin Harley"
    },
    {
      "text": "Whisper it. A Quiet Place Part II might lack the smarts and novelty of its predecessor but it serves up strong set- pieces, Millicent Simmonds shines and Krasinski remains a director to watch.",
      "author": "Ian Freer"
    },
    {
      "text": "A Quiet Place Part II is finely prepared leftovers, still tasty but with a faint staleness cutting into the flavor.",
      "author": "A.A. Dowd"
    },
    {
      "text": "What Krasinski has done is direct a solid post-apocalyptic adventure with some horror flair, which is totally fine, but it's a clear step down from the first film.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "[Simmonds] mesmerizing presence sustains you through the unresolved final moments of \"A Quiet Place Part II,\" a viscerally effective endgame that nonetheless seems content to reiterate rather than build on its predecessor's revelations.",
      "author": "Justin Chang"
    },
    {
      "text": "You might have to wait for another sequel for some true thematic and emotional closure, but still, it'll be hard to argue Part 2 won't be an escapist thrill for most audiences in theaters.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "A Quiet Place Part II's technical merits mostly drown out the franchise's increasingly noisy flaws.",
      "author": "Jacob Oller"
    },
    {
      "text": "The intimacy of the storytelling tugs relentlessly at our anxieties for the duration.",
      "author": "David Rooney"
    },
    {
      "text": "What a pleasure to see a big, brash picture like this on the big screen.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "A Quiet Place Part II manages to take a really fantastic film and craft a worthy follow-up. Honestly, it's the rare genre sequel that you can't have any complaints about.",
      "author": "Joey Magidson"
    },
    {
      "text": "As his chops as an action and horror director have only increased, care of those natty set pieces and plenty of real ingenuity, Krasinski hasn't lost sight of the human drama that makes it all work.",
      "author": "Kate Erbland"
    }
  ],
  "release_year": 2021,
  "duration": 97,
  "genres": [
    "Horror",
    "Sci-Fi",
    "Mystery & Thriller"
  ],
  "age_rating": "PG-13",
  "synopsis": "Following the deadly events at home, the Abbott family must now face the terrors of the outside world as they continue their fight for survival in silence. Forced to venture into the unknown, they quickly realize that the creatures that hunt by sound are not the only threats that lurk beyond the sand path.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/4q2hz2m8hubgvijz8Ez0T2Os2Yv.jpg"
}