{
  "movie_name": "A Star Is Born",
  "movie_id": "a_star_is_born_2018",
  "total_reviews": 500,
  "reviews": [
    {
      "text": "Despite terrific performances by Lady Gaga and Bradley Cooper, as well as sublime original music by its stars, A Star is Born simply didn't resonate with me like its contemporaries...",
      "author": "Bianca Garner"
    },
    {
      "text": "A Star is Born is not a perfect film. Very few are. But it walks the line of authenticity and truth beautifully, and I'd encourage anyone to go experience it for themselves.",
      "author": "Aaron Charles"
    },
    {
      "text": "You can hear the ghost of Kim Novak whispering: \"Here I was born and here he died, twas only a Diane Warren Ballad to you; you took no notice.\"",
      "author": "Jason Adams"
    },
    {
      "text": "In his confident directorial debut, Cooper is equally revelatory. Doing his own gruff singing and playing, he’s entirely credible...",
      "author": "Melinda Newman"
    },
    {
      "text": "a film about love, pain, loss and courage, which shows us that music can hurt and heal.",
      "author": "Serena Seghedoni"
    },
    {
      "text": "A Star Is Born has been remade three times prior to Bradley Cooper's latest version, and yet no one has thought to change the tragic ending.",
      "author": "Patricia Karounos"
    },
    {
      "text": "A Star Is Born's fourth remake continues the successful tendency of reincarnating the original's essence.",
      "author": "Manuel São Bento"
    },
    {
      "text": "There are moments where the pace can stop dead in its tracks. Other than that, this film is amazing and filled with an emotional story, fantastic performances, and wonderful music.",
      "author": "Ash Jefferson"
    },
    {
      "text": "“Gaga’s mere presence in ‘A Star Is Born’ allows Cooper a wide berth to go big with scenes and moments that play with and embrace camp.”",
      "author": "Greg Carlson"
    },
    {
      "text": "Gaga’s performances always sizzle. Her bond with the audience is palpable and her joy in entertaining is apparent in every note.",
      "author": "Brian T. Carney"
    },
    {
      "text": "While the story of “A Star is Born” may be familiar, there are enough good choices from Bradley Cooper to make his version of this ‘oft told tale’ feel fresh.",
      "author": "Keith Garlington"
    },
    {
      "text": "A Star Is Born is an example of top-flight romantic escapism",
      "author": "M.N. Miller"
    },
    {
      "text": "It's not easy to capture performances this raw, nor to write and perform songs as good as \"The Shallow,\" as mournful as \"Maybe It's Time,\" or as badass as \"Black Eyes.\" Cooper does it all to an impressive degree.",
      "author": "Brian Eggert"
    },
    {
      "text": "For moments there, you're reminded what the power of this medium can be; the beautiful meshing of what we see and what we hear into a cataclysm of what we feel.",
      "author": "Cory Woodroof"
    },
    {
      "text": "I am incredibly impressed with [Bradley Cooper's] directing skills.",
      "author": "Lonita Cook"
    },
    {
      "text": "A thoughtful remake with odes to each rendition that preceded it...",
      "author": "Taylor Baker"
    },
    {
      "text": "Filled with great performances and great music that will be talked about a lot come award season.",
      "author": "Nicholas Oon"
    },
    {
      "text": "The apex of their collaboration occurs in the breathtaking first performance of \"Shallow,\" during which Cooper wisely decides to stay on the edges of the frame, giving the literal and metaphorical spotlight to Gaga...",
      "author": "Jim Rohner"
    },
    {
      "text": "Could have been product, a glitzy film with a heartthrob and a pop star in the leads but instead resonates with real feelings and heartfelt emotion.",
      "author": "Richard Crouse"
    },
    {
      "text": "This A Star Is Born, unlike the more successful of its predecessors, never becomes a commentary on the destructive nature of stardom and success and the cruel, unforgiving character of the film or entertainment business.",
      "author": "Joanne Laurier"
    },
    {
      "text": "As a director, Cooper's bag of tricks isn't exactly filled to bursting, but he cuts his scenes more concisely than any previous version and introduces his characters with naturalistic bits of dialogue.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "At its most sentimental or manipulative, Gaga remains believable, and her crooning is utterly heartfelt.",
      "author": "Mike Massie"
    },
    {
      "text": "Beautiful, loving and intimate.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "As Ally, Gaga is electric...",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Despite A Star Is Born treading familiar ground in terms of its storytelling and having some underutilized talent, it still proves to be effective.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "A Star is Born was just about everything I want my movie experience to be.",
      "author": "Richard Propes"
    },
    {
      "text": "Exceptional music, it's incredible that Bradley Cooper's best role yet comes from his directorial debut. Touching human story. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Bring the tissues - you're gonna need 'em. Cooper may need them to polish his awards after proving this story is evergreen.",
      "author": "Jason Fraley"
    },
    {
      "text": "The trajectory of a doubting girl made famous by the love of a damaged man is beginning to feel a bit hoary in 2018",
      "author": "Stephen A. Russell"
    },
    {
      "text": "Cooper extends his career into a new field with his dramatic work and Gaga, who rivals him in both presence and raw talent, is a joy to watch.",
      "author": "Matt Cipolla"
    },
    {
      "text": "The story may appear a bit thin in places but it's an epic love story of award-winning proportions that will have you in awe from the raw talent and ugly crying at its heartbreaking conclusion",
      "author": "Zehra Phelan"
    },
    {
      "text": "My favorite film of 2018.",
      "author": "Scott Phillips"
    },
    {
      "text": "An endearing film with two impeccable performances from Lady Gaga and Bradley Cooper. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "It's not the notes themselves, it's how you play them that make a song great.\"",
      "author": "Brent McKnight"
    },
    {
      "text": "Cooper proves to be just as talented behind the camera as he is in front ... He also brings out a performance from Lady Gaga that you might not think was possible if you simply judged her from her music and/or public persona",
      "author": "Damond Fudge"
    },
    {
      "text": "This new remake of A Star Is Born is somewhat predictable, because, in effect, the back story is the same, but the plot moves with the great chemistry exhibited by Lady Gaga and Cooper himself. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Star is Born is a tour de force directorial debut that channels Cooper's off-screen struggles with addiction and sobriety that vibes deeply personal and painfully honest.",
      "author": "Dan Tabor"
    },
    {
      "text": "It's a really good movie. I was impressed.",
      "author": "Andrew Galdi"
    },
    {
      "text": "It's a solid movie. It's really good. I thought Lady Gaga is fantastic.",
      "author": "Avaryl Halley"
    },
    {
      "text": "Pop singer Lady Gaga is quite good as the wife... she subtly and convincingly manages the character's transformation from vulnerable ingenue to self-confident celebrity.",
      "author": "Ben Sachs"
    },
    {
      "text": "More like A Star Is Bored. Am I right? No? I'm the only one who isn't gaga for Gaga? Fine, then.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "This is high melodrama of a kind rarely seen these days, or executed this well at any time.",
      "author": "Chris McCoy"
    },
    {
      "text": "A fantastic first film from a great actor turned director with a stellar performance by a Queen of Pop who might become a star in a totally different medium.",
      "author": "Julian Lytle"
    },
    {
      "text": "Like all the best love stories their relationship reaches out beyond the screen, and asks the audience to experience the highs and lows, as if they were these characters.",
      "author": "Willow Maclay"
    },
    {
      "text": "A Star Is Born is a beautiful, powerful, and tragic depiction of not simply the life, glamor, fun and fame of music super stardom, but also of a life riddled with addictions and self-destructive behaviors.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "[Bradley Cooper] didn't disappoint. Delivering probably the most lived-in, carefully layered performance of his career, his Jackson is both a creature of charisma and self-pity.",
      "author": "Zhuo-Ning Su"
    },
    {
      "text": "Both leads do incredibly nuanced work, and while [Lady] Gaga's performance is incredible, so is [Bradley] Cooper's.",
      "author": "Jeff York"
    },
    {
      "text": "It's a splendid Hollywood Romance, sure, but the little textural details - the licks of sweaty hair plastered to shiny, crinkled foreheads - tell of frailty and authenticity.",
      "author": "Rhys Tarling"
    },
    {
      "text": "A Star Is Born is layered, fulfilling, and moving to the point where only singing can properly capture the emotional complexity of some of the film's heavier moments.",
      "author": "Steven Prokopy"
    },
    {
      "text": "A Star is Born is best when it forgets what it's trying to be about and is just about the relationship at its core. Nothing more.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Even in its fourth rendition, A Star is Born hits the right emotional highs.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "You should see A Star is Born... no questions asked.",
      "author": "Allison Rose"
    },
    {
      "text": "It is wonderful to see how such a story can still be alive and be so universal. [Full Review in Spanish]",
      "author": "Álex Manzano"
    },
    {
      "text": "Director [Bradley] Cooper knows what he needs to get out of Gaga and what power she has when she is near a microphone. Gaga also surprises by matching Cooper pound for a pound as they share the frame.",
      "author": "Rucha Sharma"
    },
    {
      "text": "Having wowed the cognoscenti at the Venice International Film Festival, Bradley Cooper's directorial first has touched down in cinemas amid a blaze of rapturous publicity.",
      "author": "Andiee Paviour"
    },
    {
      "text": "This film has it all, and the performances are beyond expectations. Cooper was already an excellent actor, but he has set a high bar for himself now as a director. And this will not be the last time you will see Lady Gaga acting in a lead role.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "The moment when she first steps up to that mic is one of the most breathtaking things we've seen on screen in recent memory, a moment of iconic weight that feels as if we're seeing Lady Gaga for the first time.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Cooper creates an atmosphere of intimacy that makes us feel that we are part of this adventure of success and tragedy [Full Review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "Overall, A Star is Born soars on the chemistry of its lead performances, as we genuinely believe and appreciate Jackson and Ally's love for one another.",
      "author": "Michael Ward"
    },
    {
      "text": "Bradley Cooper's directorial debut and Lady Gaga's cinematic debut hits a lot of great notes, but it's far from polished or perfect.",
      "author": "Dustin Chase"
    },
    {
      "text": "A... love story?",
      "author": "Richard Bonaduce"
    },
    {
      "text": "Despite slow pacing and an unsatisfying conclusion, \"A Star is Born\" is great due to the soundtrack and performances of Lady Gaga and Bradley Cooper.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Despite the way the middle of the film sags as it observes but never really engages with the industry, it knows the wisdom in returning to the small-scale humanity of Ally and Jackson for the end.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Cooper's impressive directorial efforts give the film an effortless air that recalls the direction of Clint Eastwood and David O. Russell, and perhaps it's no coincidence that his best performances are their films...",
      "author": "Pat Mullen"
    },
    {
      "text": "There are plenty of bright spots in A Star is Born but it's Gaga who really shines as Ally.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Heart-breaking but hopeful, this is the new definitive Hollywood story.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "Working with the familiar and skewing it in a manner that makes the final product feel fresh, not to mention the emotion evoked throughout, lends A Star Is Born an air of undeniable elation",
      "author": "Peter Gray"
    },
    {
      "text": "In an age where a star is supposedly born with every few thousand clicks of a mouse, it's refreshing to watch people do it - and do it well - the old-fashioned way.",
      "author": "Julie Crawford"
    },
    {
      "text": "I'd like to see Director Cooper take a \"road less traveled\" in the future. Still, I admire his effort.",
      "author": "Wendy Shreve"
    },
    {
      "text": "In \"A Star is Born, two stars and love songs shine.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "What really works about this version is the fact that Bradley Cooper co-wrote it, he produced it and stars in it, and put it together but he incorporates little elements of Lady Gaga's Story.",
      "author": "tt stern-enzi"
    },
    {
      "text": "A worthwhile drama with impressive acting and musical performances, A Star Is Born proves this frequently revisited tale still has relevance and room for reinterpretation.",
      "author": "Abby Olcese"
    },
    {
      "text": "\"A Star Is Born\" proves to be a satisfying, if cliched, version of the classic story.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Cooper leaps from one All Caps Scene to another. It's like we're watching a lengthy, spoiler-packed trailer of a longer movie's major moments.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "A Star Is Born is a fantastic film (...) [b]ut it's contempt for pop music is disappointing.",
      "author": "Cate Young"
    },
    {
      "text": "Cooper saw that A Star is Born was long in the tooth but had good bones -- so he turned a worn-out TCM staple into a hot-blooded, vitally relevant picture. Everything old is new again. You could even say it's been re-born.",
      "author": "Stephen Garrett"
    },
    {
      "text": "This is a love story for the ages... that's actually more than just epic romance. A sublime motion picture that defies the theory that all remakes are automatically bad.",
      "author": "Ruth Maramis"
    },
    {
      "text": "A Star Is Born is a movie about what happens at an awards show, designed to collect awards at other awards shows.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Still it is proof a formula story isn't necessarily a bad thing if it is executed well and this is.",
      "author": "Rachel Wagner"
    },
    {
      "text": "An admirable film. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "Bradley Cooper and Lady Gaga put their charisma, personalities, and talent into this film to give it the uniqueness and appeal required by the canonical Hollywood tale they've revived for the fourth time.",
      "author": "Pablo Fernandez"
    },
    {
      "text": "A Star is Born will tug at the heartstrings of even those who have seen this story play out time and time again.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "With Gaga, everyone who feels the call of the polymorphous can see themselves in the endlessly malleable contours of her face and hear their emotions throb in her omni-generic singing.",
      "author": "Stuart Klawans"
    },
    {
      "text": "Ambitious in scope and intimate in execution, it's a film from which two stars are in fact born - Gaga the dramatic actor and Cooper the director.",
      "author": "Paula Fleri-Soler"
    },
    {
      "text": "Absolutely deserves to be put up as one of the year's best films.",
      "author": "Jack Blackwell"
    },
    {
      "text": "It may be a little less powerful if you know where the story is heading, but it's undeniably a triumph for Cooper.",
      "author": "Hannah Brown"
    },
    {
      "text": "Nothing about A STAR IS BORN feels earned. The movie plods along to the inevitable conclusion and features unexplained time jumps that we are just supposed to accept.",
      "author": "Alex Maidy"
    },
    {
      "text": "A Star Is Born is perfection. Bradley Cooper, in his directorial debut does this franchise right sprinkling bits and pieces of various versions, yet maintaining its own identity.",
      "author": "Carla Renata"
    },
    {
      "text": "Note to the other filmmakers behind the latest \"A Star Is Born\" remake: you probably shouldn't let the actor playing the fading singer also direct the movie. And help write it.",
      "author": "Andrea Thompson"
    },
    {
      "text": "The film didn't touch me in the heart, presenting more inept than satisfactory moments, both drama and music-wise.",
      "author": "Filipe Freitas"
    },
    {
      "text": "This is the rare, timeless reboot that people will want to watch again and again. That is, until it's remade.",
      "author": "Ani Bundel"
    },
    {
      "text": "In the end, A Star is Born becomes a touching film hampered by its own legacy.",
      "author": "Jourdain Searles"
    },
    {
      "text": "As a film, A Star is Born is done well on so many levels, from its cinematography to its production design.",
      "author": "Amanda Greever"
    },
    {
      "text": "With Gaga leading the charge this time around, it's easy to see why A Star Is Born keeps glowing.",
      "author": "Sarah Ward"
    },
    {
      "text": "A Star is Born proves Bradley Cooper has a future as a director, Lady Gaga can act, and that for a film that has been made over and over, the 4th time's a charm.",
      "author": "Leslie Combemale"
    },
    {
      "text": "A Star Is Born will have you leaving the theatre clenching your tissues, kissing your partner, and blasting that radio to an uncomfortable decibel.",
      "author": "Amanda Sink"
    },
    {
      "text": "Filled with great music, a captivating romance, and fine performances, A Star Is Born is ... an enthralling meditation on how the entertainment industry makes casualties of so many of its stars",
      "author": "Victoria Luxford"
    },
    {
      "text": "A Star Is Born demonstrates that good stories never die; they just patiently rest as filmmakers figure out how to bring back their sparkle.",
      "author": "Matt Brunson"
    },
    {
      "text": "The third remake of this decades-old Hollywood tale has a lot on its mind about art and fame in the modern age. Yet it also crafts an old-fashioned, touchingly tragic love story.",
      "author": "Valerie Kalfrin"
    },
    {
      "text": "Another remake of one of my favorite films. Bradley Cooper doesn't quite pull it off, but everyone around him shines, especially Lady Gaga. The script faltered as did all of the songs -- except The Shallows, which will stick in your head for weeks.",
      "author": "Julia Swift"
    },
    {
      "text": "A melodramatic, overstuffed, cornball of a movie.",
      "author": "Louisa Moore"
    },
    {
      "text": "The story may have begun as a cautionary tale about Hollywood fame, but even set in the music industry, the ending has a kind of emotional potency only film can achieve.",
      "author": "Marisa Carpico"
    },
    {
      "text": "A beautiful movie with amazing performances. A must watch for anyone.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "One cannot help but be swept up both by the romance and the amount of talent on display.",
      "author": "Courtney Small"
    },
    {
      "text": "offers proof that remakes are not always evidence of artistic bankruptcy and a dearth of new ideas, but can be invigorating updates to time-honored stories that approach the edge of myth",
      "author": "James Kendrick"
    },
    {
      "text": "El consagratorio trabajo actoral de Lady Gaga - y algunos buenos duetos como \"Shallow\" - hacen que las más de dos horas de Nace una estrella sean tolerables aun cuando sentimos que ya hemos visto esta misma película muchas otras veces.",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "A Star Is Born might not be a total home run for Cooper, but a triple is pretty solid for your first career at-bat in the majors.",
      "author": "Nick Johnston"
    },
    {
      "text": "Although [Bradley] Cooper has emerged as a premiere director, there's a bit of disappointment in the air, because the film never hits the emotional falsetto.",
      "author": "James Clay"
    },
    {
      "text": "An incredibly strong film with minimal flaws capturing this heart-wrenching story in a special way.",
      "author": "Ben Rolph"
    },
    {
      "text": "The performances are raw and heartfelt. The aesthetic is honest and the music is spectacular. It uplifts and undercuts with equal abandon. It is a fantastic movie experience.",
      "author": "Allen Adams"
    },
    {
      "text": "The rare Oscar favorite that's deserves all the praise and is more than just the hype.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "With this film, Bradley Cooper... [makes it clear] that, like other colleagues, he can act and also deliver a convincing film as a director. [Full review in Spanish]",
      "author": "Lucero Calderón"
    },
    {
      "text": "The musical numbers is where this movie shines. You feel every heartache in every note played, every lyric sung, there's a gravitas and a sense of love and care that went into the staging of every frame of this movie.",
      "author": "Michelle Alexandria"
    },
    {
      "text": "This film takes its well-known story and its well-known actors and shows us something completely fresh and surprising",
      "author": "John Hanlon"
    },
    {
      "text": "Cooper and Gaga's stars are reborn.",
      "author": "Phil Villarreal"
    },
    {
      "text": "The film runs out of steam a long time before it runs out of plot, but when it's all working, this is a perfectly worthy addition to the Star Is Born canon.",
      "author": "Tim Brayton"
    },
    {
      "text": "A Star is Born is well-intentioned, but wants to play it far too safe for any of the good objectives to resonate.",
      "author": "David Keyes"
    },
    {
      "text": "The dramatic structure is identical: we are witnesses of the birth of a star and the tragic decline of another. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "I really enjoyed this otherwise standard musical for the most part because of the fine performances by Lady Gaga, Cooper, Elliot, Gavron and Dave Chappelle. It is enjoyable despite the fact that the story is painfully clichéd.",
      "author": "Robert Roten"
    },
    {
      "text": "The chemistry between Bradley Cooper and Lady Gaga is striking; throughout he is mesmerising, she is a joy. Though this is a story told very much from Jackson Maine's point of view.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Gaga and Cooper really click with the emotional elements of the material and bring a lot of energy to the very simple and familiar story.",
      "author": "Aaron Leggo"
    },
    {
      "text": "The soundtrack is thoughtful, emotional, and difficult to imagine being brought to life by anybody other than Gaga and her diverse vocal talent, which feels right at home on the big screen.",
      "author": "Joe Passmore"
    },
    {
      "text": "It does what every good remake should do: it tells the same story as before, but narrated from a different and fresher perspective. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "I wanted to see her side, internally, where that relationship was going as she was getting catapulted to fame...I would definitely tell you to go download this soundtrack.",
      "author": "Sharronda Williams"
    },
    {
      "text": "Transposed into the era of sudden fame and instant shame, the film glistens as a cautionary tale about self-respect, self-delusion and self-destruction...what is especially admirable is the film's fidelity to the original's heart-breaking final reel.",
      "author": "Jim Schembri"
    },
    {
      "text": "Lady Gaga gets her screen cred and Bradley Cooper chalks up his first directorial achievement. Otherwise, it's a wasteland out there.",
      "author": "Ron Wilkinson"
    },
    {
      "text": "A Star is Born is a musical but without the hokiness. Each performance moves the story forward, with Cooper focused on capturing authentic moments.",
      "author": "Eli Glasner"
    },
    {
      "text": "Lady Gaga's singing talents are majestically showcased in this familiar but nevertheless moving film, an amazing directorial debut for Bradley Cooper",
      "author": "J. Don Birnam"
    },
    {
      "text": "No matter what goes on in the film dramatically, everything always comes together because the soundtrack is happening, it's just happening, as I heard someone say in the Magic Johnson Harlem theater.",
      "author": "Darryl Pinckney"
    },
    {
      "text": "A Star is Born howls in its first half.",
      "author": "Matt Oakes"
    },
    {
      "text": "Bradley Cooper makes a stunning directorial debut with A Star Is Born, an emotionally devastating rollercoaster of a journey that exhilarates as much as it devastates.",
      "author": "Rob Carnevale"
    },
    {
      "text": "Cooper has created the definitive version of A Star Is Born, a visually dynamic spectacle that surpasses the limitations of the musical genre.",
      "author": "Matt Ward"
    },
    {
      "text": "[The ending] will weigh on you the same way it weighs on the characters. That's a powerful testament to both Cooper's treatment of the material as it is the performances ...",
      "author": "Douglas Davidson"
    },
    {
      "text": "A Star is Born highlights the absolute best of what cinema and music can offer - an uplifting and sometimes heartbreaking experience that will not soon be forgotten.",
      "author": "Kent Garrison"
    },
    {
      "text": "Cooper has landed a masterpiece on his first go. You could say, a star is born.",
      "author": "Cameron Frew"
    },
    {
      "text": "It's almost as though the film itself has gone self-aware and wants to jump ahead into its own meta-readings about how Bradley Cooper turned Lady Gaga into a movie star",
      "author": "Bob Chipman"
    },
    {
      "text": "All Cooper and Gaga do is repeat a self-congratulatory Hollywood motto about artists \"having something to say.\" Now is the wrong time for that.",
      "author": "Armond White"
    },
    {
      "text": "Excellent acting and direction enables A Star is Born to rise above its somewhat prosaic dramatic structure to fashion surely one of the better Hollywood films of the year.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Cooper managed to make Gaga's star shine even brighter. She's basically her own solar system now. Sign me up for the sequel: A Universe Is Born.",
      "author": "Kerensa Cadenas"
    },
    {
      "text": "In its new incarnation, A Star Is Born presents a beautifully told and hugely affecting love story.",
      "author": "Linda Marric"
    },
    {
      "text": "With the power of its music and its two leads (plus some nice support), A Star Is Born is a worthy retread of a well-worn path.",
      "author": "Matt Neal"
    },
    {
      "text": "A Star is Born has been retold so many times because it's a great story, and this updated version is surefire hit with its iconic pop star in the lead and a whirlwind romance undone by fame and addiction.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "...this new iteration on a classic theme is akin to the pop music it both celebrates and critiques: it's insanely likable....",
      "author": "Joel Mayward"
    },
    {
      "text": "If I have any nits to pick it's that there is too much music and it's too long. But so what? It's really good. Go see it.",
      "author": "Diane Pershing"
    },
    {
      "text": "As much as we might like to poke fun at the idea of \"visionary director Bradley Cooper,\" it's important to recognize when we, the cynics, have been proven wrong.",
      "author": "Clint Worthington"
    },
    {
      "text": "A Star is Born foregrounds all of the ways Jackson and Ally are enamored with each other, the intimacy that enhanced their bond and the affection that inspired their songs.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Starring Lady Gaga like you've never seen her before, A Star is Born is a wonderful remake of the 1937 classic of a timeless love story but with a 2018 modern twist.",
      "author": "Morgan Rojas"
    },
    {
      "text": "Gaga's performance is outstanding and is deserving of all the praise she's been receiving. That being said, I do wish that Allie was given as much depth and attention as Jackson.",
      "author": "Ferdosa Abdi"
    },
    {
      "text": "The chemistry between Cooper and Gaga's characters is almost supernatural. [Full review in Spanish]",
      "author": "Xavi Sánchez Pons"
    },
    {
      "text": "Hollywood has been churning out remakes and reboots at breakneck speed, but A Star Is Born is in a class of its own.",
      "author": "Yolanda Machado"
    },
    {
      "text": "It offers what it offers: romance and good music. [Full review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "A thoroughly entertaining redo, with excellent work by Lady Gaga and Bradley Cooper (behind the camera as well as in front of it).",
      "author": "David N. Butterworth"
    },
    {
      "text": "It's perfectly comfortable cranking up its emotions and firing them directly into your face.",
      "author": "Tim Brennan"
    },
    {
      "text": "Every man here with a story is cloaked in some kind of misery.",
      "author": "Chris Barsanti"
    },
    {
      "text": "Bradley Cooper's modern reworking is passable enough to keep you entertained.",
      "author": "Amelia Navascues"
    },
    {
      "text": "The marriage becomes a battle between artifice and authenticity, an allegory for the popular music industry.",
      "author": "John McDonald"
    },
    {
      "text": "A familiar story with enough new twists and turns to keep it fresh, \"A Star Is Born\" is a triumph.",
      "author": "Michael A. Smith"
    },
    {
      "text": "A stripped-down version that is raw and intimate, with a pair of knockout performances from Cooper and Lady Gaga.",
      "author": "Micheal Compton"
    },
    {
      "text": "In one scene, in which Ally (Gaga) is dragged on stage to sing at a stadium concert, the churn of emotions crossing her face is simply astonishing and so very, very real.",
      "author": "Tim Martain"
    },
    {
      "text": "Cooper's debut behind the camera is impressive in his mastery of space. [Full review in Spanish]",
      "author": "Daniel de Partearroyo"
    },
    {
      "text": "The film is as good as a modern retelling can get--better, even, given that Cooper brings out the big guns with his intimate and purposeful directorial style.",
      "author": "Damian Levy"
    },
    {
      "text": "An overlong, weirdly old-fashioned and somewhat toothless epic saved from silliness by, of course, Lady Gaga, who belts out songs co-written and usually co-performed by Cooper with all the drama and fire that the surrounding story rather lacks.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "If Star is drawing the curtain on the self-destructive cowboy figure and is a love letter to a new generation of starlets, it's almost there but not quite at the drop of a hat.",
      "author": "Damien Straker"
    },
    {
      "text": "From top to bottom A Star is Born is a success, the rare remake that proves not only that it has more to say about its subject but that there is more to say.",
      "author": "Joshua Starnes"
    },
    {
      "text": "The new version of A Star Is Born proves that even the most familiar material can be great when done right.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Lady Gaga long ago out-Madonna'd Madonna; always had more talent as a singer-dancer, with just as much biz chops. However, notoriously, Madonna could never act. Gaga blows Madonna's doors off acting-wise.",
      "author": "Mark Jackson"
    },
    {
      "text": "A drama with credible songs in it that elevates an outré personality into a legitimate actress, a vanity project with none of the vanity.",
      "author": "Alex Doenau"
    },
    {
      "text": "Prefers to focus on what great music should be - and how a music career should be run - rather than getting to the heart of what leads to someone to bare their soul through music",
      "author": "Cameron Williams"
    },
    {
      "text": "Cooper and Gaga are both fantastic in roles that ask a lot of both of them.",
      "author": "Jack Pooley"
    },
    {
      "text": "Cooper manages to conjure up a version of A Star is Born with its own personality. [Full Review in Spanish]",
      "author": "Manu Yáñez"
    },
    {
      "text": "Cooper captures those personal demons with confidence without ever leaving aside the charming external facet of the character. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A Star is Born defines Lady Gaga as a film actress, and Cooper as a filmmaker.",
      "author": "Kirk Baird"
    },
    {
      "text": "Bradley Cooper wants to make you cry. And if you give him a chance by going to see \"A Star Is Born,\" he's gonna do it.",
      "author": "Charles Ealy"
    },
    {
      "text": "Not everything works in Cooper's version of \"A Star Is Born\" But enough does to ensure that this film is, indeed, one of the best releases of 2018. Maybe, even, of this decade.",
      "author": "Dan Webster"
    },
    {
      "text": "Somehow, though, the bloat is almost appropriate in a story about excesses, and the devastating pitfalls of fame. \"A Star is Born\" portrays both poignantly, movingly, well.",
      "author": "Randy Myers"
    },
    {
      "text": "Cooper has given us a vision of this story to cherish.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "The A Star Is Born story construction has worked, again and again, because it's archetypal tragedy - nobody believes there's a happy ending in sight. But Cooper still earned every one of my tears.",
      "author": "April Wolfe"
    },
    {
      "text": "It's heartfelt, well-paced, and gut-wrenchingly tragic, with the gorgeous music and two main characters taking centre stage by grabbing hold of the audience's emotion until the very last second.",
      "author": "Heather Gunn"
    },
    {
      "text": "This is the first version of A Star is Born in the digital age and in order for this story to work for modern audiences, there had to be plausible dimensions between the fame and the relationship between the leads. [Full Review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "But are we still supposed to celebrate a film that posits the male ego as too fragile to accept a woman who equals or surpasses him? Or that a woman's \"authenticity\" will only truly flower in response to a man's sacrifice?",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Crucially, the film never feels inauthentic and the songs remain both organically integrated and highly memorable. Rarely has a film's story benefited so much from its musical elements.",
      "author": "Dominic Corry"
    },
    {
      "text": "Lady Gaga has created a delicate, likeable character who serves as the film's emotional barometer in that as her feelings change, so too will those of the audience.",
      "author": "Matthew Toomey"
    },
    {
      "text": "While imperfect, A Star Is Born is a satisfying and emotionally evocative epic. If only it had managed to maintain the intoxicating allure of its first hour.",
      "author": "Wenlei Ma"
    },
    {
      "text": "It may not be a daringly original piece. But when the end result is this engaging, entertaining, and heartbreaking, it demands to be called one of the year's finest films.",
      "author": "Doug Jamieson"
    },
    {
      "text": "The movie's gender dynamics remain fully intact from its 1937 origins. Ally is controlled and manipulated by powerful men from start to finish, and some of the more emotionally abusive scenes can be disturbing to watch.",
      "author": "Li Lai"
    },
    {
      "text": "The chemistry shared by Gaga and Cooper - whether on stage during the movie's dynamic live music sequences, or casually swapping lines walking along a street - is at once appealing, involving and concerning.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The vital music scenes are convincing and enjoyably infectious, the romance is beautifully played, and [Cooper] doesn't hold back when the story takes its long-expected turn for the worse.",
      "author": "Matthew Bond"
    },
    {
      "text": "This is a movie to gush over, to see again, to buy the soundtrack to, to urge others to see, to dream about ... Watch it sweep the Oscars, too. I'll be fine with that.",
      "author": "CJ Johnson"
    },
    {
      "text": "The very story of A Star is Born is itself a cautionary tale. Interestingly, Hollywood loves this story. The Cooper and Gaga version is the fourth time the tale is told.",
      "author": "Diana Cheng"
    },
    {
      "text": "A Star Is Born is a remake that is good enough to stand on its own without the fear of comparison.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "Bradley Cooper delivers a stunning and heartbreaking rendition of the Hollywood musical.",
      "author": "Soumya Srivastava"
    },
    {
      "text": "A Star is Born doesn't push any cinematic boundaries. It isn't edgy or provocative. But it's emotionally rich and hugely satisfying.",
      "author": "Anupama Chopra"
    },
    {
      "text": "Cooper, who has turned director with the film, extracts commendable performances from everybody in the cast. The life of a musician is caught perfectly.",
      "author": "Devesh Sharma"
    },
    {
      "text": "Overall, A Star Is Born is melodrama at its best, an emotional manipulation that works even if you're not normally a sucker for that type of thing.",
      "author": "Jordan Calhoun"
    },
    {
      "text": "It's been recited plenty of times before and, even if it hadn't, follows the predictable beats of so many true stories of waning celebrity. That's not a criticism; it's actually what gives the story emotional heft.",
      "author": "Simon Miraudo"
    },
    {
      "text": "If [Cooper] was going for middlebrow musical melodrama in the vein of \"The Rose\" and \"The Bodyguard,\" bullseye.",
      "author": "J. Olson"
    },
    {
      "text": "What kept me from appreciating this movie as a whole beyond some very good parts was its inability to practice what it preached and actually say something.",
      "author": "Rich Juzwiak"
    },
    {
      "text": "A breath of fresh air. [Full Review in Spanish]",
      "author": "Rafael Rosales Santos"
    },
    {
      "text": "But there's undeniable passion, talent and naked humanity onscreen, and for much of its run-time, A Star Is Born is impressively rapturous and romantic.",
      "author": "Roe McDermott"
    },
    {
      "text": "Is it worth seeing? Absolutely. They don't make 'em like this anymore.",
      "author": "Sean Collier"
    },
    {
      "text": "So much better than the Streisand version.",
      "author": "Bob Grimm"
    },
    {
      "text": "I will add to the chorus of praise for Gaga. She's the film's real MVP-a natural actor of surprising depth and soul.",
      "author": "Aaron Yap"
    },
    {
      "text": "Lady Gaga, in her first big-screen performance, acquits herself well in a role that mirrors her real-life self. There's a definite on-screen frisson between her and co-star Bradley Cooper.",
      "author": "Richard James Havis"
    },
    {
      "text": "[The ending] was a very romanticized view of what a toxic relationship is, and I wasn't here for it.",
      "author": "Lauren Humphries-Brooks"
    },
    {
      "text": "Classic Musical With Magnificent Performances",
      "author": "Diana Saenger"
    },
    {
      "text": "The performances are sound. [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Some of the best performances of the year...Cooper is going to be a great director if he can continue this kind of filmmaking momentum.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "If you're able to forget the stars that have gone before, A Star is Born is a very professional tear-jerker with some very loud music, and for many that will be enough.",
      "author": "David Stratton"
    },
    {
      "text": "The star who is being born through this film is its actor-director.",
      "author": "Nandini Ramnath"
    },
    {
      "text": "[Director Bradley Cooper] intelligently allows music to exist almost as a character and dedicates whole sequences to musical acts. [Full review in Spanish]",
      "author": "Jorge Iván Morales"
    },
    {
      "text": "A Star Is Born is something that's easy to fall in love with but not all too deeply. Not perfect cinema, but maybe that's enough for now.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "This is a not-to-be-missed film and shows that Cooper is a certifiable director, while Gaga shows that acting is not just a fling and solidifies her as a true triple threat.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "However, after some songs, A Star is Born not only begins to repeat the formula of other films such as La La Land but to repeat itself. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "Watch as these two great artists dive in. Oh, the treasures they dig up together. Once the movie lifts off (with this very song) it never meets the ground again.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "The performances from Gaga, Elliott, and Cooper are amazing. This feature shows a lot of promise for a first-time director like Cooper.",
      "author": "Alan French"
    },
    {
      "text": "Lady Gaga is a natural; Ally is talented and cursed with the insecurity that is talent's twin. Her face glows with natural beauty, not manufactured and not afraid of the camera's intrusions. There is chemistry there ...",
      "author": "Andrew L. Urban"
    },
    {
      "text": "Electric, compelling and tender, the film is a knockout creatively and emotionally, offering a raw glimpse into today's world of celebrity.",
      "author": "Louise Keller"
    },
    {
      "text": "Cooper's latest remake of A Star is Born has its high points but, in the end, it's disappointing and unnecessary. Let's hope it is the last version.",
      "author": "Loren King"
    },
    {
      "text": "What Cooper gets about A Star Is Born is the degree to which it is about the physics of love and work. This may be the only mythic narrative about a two-career marriage. It's a melodrama where every action has an equal and opposite reaction.",
      "author": "Carrie Rickey"
    },
    {
      "text": "We don't get genuine character development or insight into the industry or kitschy fun.",
      "author": "Beth Accomando"
    },
    {
      "text": "Fused with laugh-out-loud humour, even at the most uncomfortable moments, A Star is Born is driven by a searing authenticity that makes it feel like a biopic.",
      "author": "Marwa Hamad"
    },
    {
      "text": "Nearly every moment of A Star Is Born feels real and specific. Often painfully so.",
      "author": "Megan Basham"
    },
    {
      "text": "For its first hour-plus, A Star Is Born captures the exhilaration of new love and new creation better than any movie in years.",
      "author": "Margot Harrison"
    },
    {
      "text": "While Lady Gaga shines, the problematic narrative makes it clear that it is the unlikable Jackson Maine with whom audiences are supposed to identify.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "Well, ladies and gentlemen, this duo makes A Star Is Born a new version that will be considered a classic. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "What could have been a series of vain decisions... ends up being a deeply moving love story. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Bradley Cooper has something new to say in this version, and Lady Gaga belts it out loud and clear to make this a definite contender in numerous categories during awards season.",
      "author": "Neil Soans"
    },
    {
      "text": "You can't be a one-named artist if your name is not something like Beyonce, Rihanna, Prince or Adele. You just can't.",
      "author": "Matt Pais"
    },
    {
      "text": "Love story about two musicians finding it difficult to believe in themselves and their unique voices.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "One of the best things that this contemporary version of A Star Born does is taking the conventions of the previous incarnations and transforming them into a truly profound experience. [Full Review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "Both leads are fine, albeit one-note, and cinematographer Matthew Libatique supplies some sharp images, but the movie is pervasively musty and false, with some brutally bad songs to boot.",
      "author": "Daniel Barnes"
    },
    {
      "text": "... the distraction-free bubble focuses the story on the key players and their emotional motivations to achieve maximum impact... (but) the real villain of this story is human fragility.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "It may be that every generation gets the \"A Star Is Born\" it deserves, though what we did to deserve this one is anyone's guess.",
      "author": "John Anderson"
    },
    {
      "text": "The obvious question to ask is 'Why go and see A Star Is Born for the fourth time?' Because, essentially, this film steers the same narrative path from previous installments (almost too closely). The answer is easy: her name is Lady Gaga.",
      "author": "Nate Adams"
    },
    {
      "text": "[It's] a crowd-pleaser and many may not even notice the film cheats them of a more fulfilling ending since it already runs 135 minutes and the soundtrack is a rewarding distraction.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "A Star Is Born invites inside the rarest of bubbles and helps us grasp the intense pressure that comes with having to perform. The biggest names often hide the most vulnerable souls.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Cooper's best decision was casting Lady Gaga and himself as the leads.",
      "author": "Greg Maki"
    },
    {
      "text": "Cooper conveys the love between both with craft in his directorial debut. But also the fears and miseries that accompany success: Absences, lies and ridicule shift the focus of its predecessors. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "Fuelled by scintillating performances and a stellar soundtrack, A Star Is Born is a magnificent achievement that will capture the hearts of almost everyone that it touches.",
      "author": "Matt Hudson"
    },
    {
      "text": "This is the best film of the year.",
      "author": "Joey Magidson"
    },
    {
      "text": "Lady Gaga shines brightly, while Bradley Cooper is phenomenal. Superior to all previous versions. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Cooper simmers with swagger before Gaga's vocal force boils the cauldron over, taking everything to another level.",
      "author": "Don Shanahan"
    },
    {
      "text": "Bradly Cooper and Lady Gaga electrify the screen. Backed by a first-rate supporting cast and well-written songs, this is by far the best version of the timeless classic.",
      "author": "Joe Friar"
    },
    {
      "text": "Bradley Cooper and Lady Gaga sing loud in one of the year's best films.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "It may be a fourth version of this time honored showbiz saga but Bradley Cooper and Lady Gaga make 'A Star Is Born' all their own- and that's a very good thing.",
      "author": "Pete Hammond"
    },
    {
      "text": "Co-written by Cooper, who also helped write some of the film's music, the script doesn't exactly bubble with wit but it doesn't have to. What matters is that it gives both leads the chance to charm one another - and us.",
      "author": "Sandra Hall"
    },
    {
      "text": "As Ally Campana, a gem in the rough, Lady Gaga is dynamite.",
      "author": "Diane Carson"
    },
    {
      "text": "It's well worth seeing and marks Gaga and Cooper as two people who have the talent to overcome fame and endure for the long haul.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "At its huge, pulsating heart this is a story about lovers desperately trying to save one another - from the loss of integrity in an industry that disdains it and from self-destructive impulses with roots too old and deep to be touched.",
      "author": "Matthew Norman"
    },
    {
      "text": "This update is less anguished, has better songs and, even at 135 minutes, is actually shorter than the last two.",
      "author": "Ken Eisner"
    },
    {
      "text": "When [Lady Gaga] starts singing, grab your tissues and hold onto your seat.",
      "author": "Martin Thomas"
    },
    {
      "text": "I heard that it was [Cooper] singing but I didn't want to believe it... ain't no way God gave everybody all that.",
      "author": "Korey Coleman"
    },
    {
      "text": "Not only has [Cooper] made something old new again, he's reinvented it and improved upon it. It's a passion project that shoots for the stars and is likely to strike Oscar gold.",
      "author": "Tom Meek"
    },
    {
      "text": "It's like settling into the cinematic equivalent of a Lexus 450. The picture is big and lush and smooth.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "...the juggling act that all remakes strive for, but few manage to capture. Encore!",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "This is a relationship that I cared about, and that's rare.",
      "author": "Tony Baker"
    },
    {
      "text": "An exhilarating, bittersweet romance...",
      "author": "Susan Granger"
    },
    {
      "text": "[Cooper's] talent for writing and directing has been hiding in plain sight. After this five-star treat of a picture, consider the secret out.",
      "author": "Alison Rowat"
    },
    {
      "text": "A Star Is Born may not reinvent the wheel in terms of cinematic art, but it's a knockout in just about every other way that matters: it has heart and soul, great chemistry between its leads and some killer musical numbers.",
      "author": "Tom Shone"
    },
    {
      "text": "Cooper's directorial debut [proves] that he has what it takes to write, act, direct, and even sing, but even more important, he knows how to assemble the right cast of characters to create a beautiful story worth re-telling for the 4th (or 5th) time.",
      "author": "Pamela Powell"
    },
    {
      "text": "Bradley Cooper crushes it... He's a great comedic actor, a great dramatic actor. And he's great in this movie -- also a great director.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Sturdy, old-fashioned... Gaga's powerhouse voice is one of the film's key assets... Packs an emotional wallop by focusing on these two faces and voices.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The problem is whenever Cooper turns the film away from his best asset (Gaga) and into a vanity production.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "It's a film that simply works with a simple plot and entertains with action scenes and effects. [Full review in Spanish]",
      "author": "Abigail Camarillo"
    },
    {
      "text": "A Star is Born, perhaps, is a less \"rosy\" version of La La Land. [Full review in Spanish]",
      "author": "Mauricio Nava"
    },
    {
      "text": "Bradley Cooper's 2018 rendition of A Star Is Born manages the impossible: bringing this seemingly old-fashioned story about fame into the present while retaining its classical, timeless appeal.",
      "author": "Alison Herman"
    },
    {
      "text": "What Cooper persuasively depicts is the fear factor of stardom-the sense of vulnerability, of a position that's both powerful and fragile.",
      "author": "Richard Brody"
    },
    {
      "text": "A Star Is Born is entertaining, gut-wrenching, and exceptional; with spectacular performances and a top-notch soundtrack, this rock-musical becomes an instant classic.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "Expect nominations all around, with actor/writer/director/producer and songwriter Cooper on the verge of a boatload, maybe even for contributing to an eclectic, sure-to-be-soaring soundtrack.",
      "author": "John Urbancich"
    },
    {
      "text": "Cooper finds a new voice too, as a director. The actor understands how to stage a scene (as well as stage a literal stage-the concert scenes are stunning) in ways that, like the acting, feel instinctive.",
      "author": "Adam Epstein"
    },
    {
      "text": "I'm usually the first to ask, \"Do we really need another reboot?\" But in the case of this spectacular cinematic event, the answer is a passionate \"Yes! Yes! Oh YES!\"",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "If you're entering the theatre simply desiring a couple solid musical numbers, then your $15 will not have been spent in vain. Unfortunately, outside of its music, the movie falls flat as only a two-dimensional vignette of common misogyny can.",
      "author": "Kim Selling"
    },
    {
      "text": "As deep and resonant as Bradley Cooper's drawl, and as bright as Lady Gaga's screen future.",
      "author": "Mark Kermode"
    },
    {
      "text": "It has weight and depth, and that, as Cooper seems to intuitively understand, adds heft to the story's melodramatic complications.",
      "author": "Ed Whitfield"
    },
    {
      "text": "The directing debut for the actor Bradley Cooper is a good one.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Gaga is good but Bradley Cooper is definitely the star of \"A Star Is Born\". Also worthy of strong praise are Sam Elliott and Andrew Dice Clay.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Cooper obviously overlooks a potential jackpot in a co-star eager to prove she's not just another poker face. Despite those restraints, she's ultimately his savior, displaying enough moxie and heart to engage, even when the movie fails to match the hype .",
      "author": "Al Alexander"
    },
    {
      "text": "The best compliment I can give the new version of A Star is Born is that I didn't mind it. The harshest word is \"forgettable.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Can a contrived and shallow love story remain afloat on charisma alone? Not in this case.",
      "author": "Avi Offer"
    },
    {
      "text": "A Star Is Born... delivers a sprawling relationship drama that fully captures a realistic picture of love.",
      "author": "Mike Reyes"
    },
    {
      "text": "Cooper has borrowed [from the 1976 Barbra Streisand verson] the rock 'n' roll backdrop and pedestrian dialogue and, in some ways, its 1970s setting.",
      "author": "Kent Turner"
    },
    {
      "text": "Undeniably, \"A Star is Born\" shines due to the realistic chemistry between Bradley Cooper and Lady Gaga. This Oscar worthy film delivers on all fronts!",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "The actors' performances are often raw and improvisatory, like something out of a 1970s movie.",
      "author": "Noel Murray"
    },
    {
      "text": "This movie has everything: a swept-off-your-feet romantic fantasy, an underdog-makes-good journey, a wrenching substance abuse drama, and an industry cautionary tale combined.",
      "author": "Alison Willmore"
    },
    {
      "text": "A sometimes exhilarating, occasionally frustrating, and always cunning Hollywood product that can feel like a battle of wills between two deliberately self-deprecating artists.",
      "author": "Michael Koresky"
    },
    {
      "text": "\"A Star is Born\" never sacrifices the conviction of its earliest moments, which so smartly connect these characters as artists and humans while also upholding the sanctity of their individual journeys.",
      "author": "Robert Levin"
    },
    {
      "text": "Melodrama gets a bad rap sometimes.",
      "author": "Linda Holmes"
    },
    {
      "text": "Despite its long history and many incarnations, Cooper manages to bring something that feels authentic and new to the table with his iteration of this classic film story.",
      "author": "Kt Schaefer"
    },
    {
      "text": "it's not a particularly great or profound movie, but it's a hugely enjoyable one, with so many amazing scenes that it hardly matters whether they add up to anything.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A Star Is Born is one journey with so many emotions working in perfect harmony that should not be missed.",
      "author": "Liam Hanlon"
    },
    {
      "text": "It could win Best Picture, and I wouldn't complain if it did.",
      "author": "Mark Ellis"
    },
    {
      "text": "Everything that it does, it does really well...a slow burn, the length really didn't bother me...",
      "author": "Steph Cozza"
    },
    {
      "text": "Bradley Cooper directs this movie like he's doing just what he is, conducting and playing first chair at the same time, Gaga is a force of nature. She's a revelation in this movie of course, but [Cooper] also knows how to play directly into her strengths.",
      "author": "Roth Cornet"
    },
    {
      "text": "A Star Is Born tells a story many of us already know. The magic comes from the fact that we utterly forget we know it and become absorbed all over again.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Mark A Star is Born as the film that crowns Lady Gaga as a powerful and winning screen presence, and Bradley Cooper as a first-rate director and born-again movie star.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Germanotta is not Falconetti, but oh, that face in close-up, it is canvas, flesh, odalisque: Matthew Libatique's nimble camera rightfully worships Lady Gaga. She is nothing less than a marvel.",
      "author": "Ray Pride"
    },
    {
      "text": "Powerful and moving and thought-provoking stuff in an old-fashioned Hollywood romance with a sensational soundtrack featuring two of the year's breakout performances.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "The duo have decent chemistry together, it must be said, but it becomes less believable as the film progresses.",
      "author": "Piers Marchant"
    },
    {
      "text": "Cooper delivers a weightless version of the story. [Full review in Spanish]",
      "author": "Miguel Muñoz Garnica"
    },
    {
      "text": "One can't help being impressed by Cooper's achievement here, making this chestnut of a story feel fresh and vital.",
      "author": "Randall King"
    },
    {
      "text": "Soulful, honest and heart-breaking.",
      "author": "Ross Miller"
    },
    {
      "text": "A big crowd pleaser with genuine thrills, even if second half flags.",
      "author": "James Verniere"
    },
    {
      "text": "Bradley Cooper's A Star is Born is a transcendent feast for the eyes and ears.",
      "author": "Millicent Thomas"
    },
    {
      "text": "Gaga's role might not seem like much of a stretch. But the best parts of her performance are during the first half of the movie when she's playing against type, convincing the spellbound audience that she is not an internationally recognizable pop idol...",
      "author": "Lindsay Zoladz"
    },
    {
      "text": "A Star Is Born is the living embodiment of going for it, one of the least humble, least self-conscious, least self-aware movies in recent memory-and maybe one of the best.",
      "author": "Sean Fennessey"
    },
    {
      "text": "My impeccable taste and preferences aside, you should check it out for yourself.",
      "author": "Barry Paris"
    },
    {
      "text": "It's essentially multiplex-friendly porn, where you discover that you desperately need two pretty celebrities you never considered falling in love to fall in love.",
      "author": "Vincent Mancini"
    },
    {
      "text": "A Star Is Born has little insight into where stars come from and even less into how they disappear.",
      "author": "Kyle Smith"
    },
    {
      "text": "This oft-told tale (this is the fourth telling of the story) falls into an all-too-predictable rhythm in the middle of the movie, which becomes a slog in the third and final act.",
      "author": "Michael Heaton"
    },
    {
      "text": "The first half of this new take on the story is incredible.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "There's real vitality in Cooper's direction in the early passages, and, in the performances of the costars, an understanding of the ravages of romance that justifies putting ourselves through the paces of this sad story yet again.",
      "author": "Peter Rainer"
    },
    {
      "text": "I believed Bradley Cooper was a man who writes Soundgarden songs but dresses like Sturgill Simpson. I believed Lady Gaga was Joe Biden's daughter. I never wanted it to end.",
      "author": "Katie McDonough"
    },
    {
      "text": "It's all a bit overamped, an entertainment that's a little too in love with itself to bring down the curtain -- even as its two-hour and 15-minute length begins to wear.",
      "author": "Robert Denerstein"
    },
    {
      "text": "This fourth rendition better be the last because you can't really step it up from here. If you aren't a \"Little Monster\" by now, \"A Star is Born\" will convert you.",
      "author": "Rendy Jones"
    },
    {
      "text": "Here we have a film that is as accomplished as they come; a muscular, note-perfect, old-fashioned, cinematic event that longs to be experienced on the big screen - preferably, one with a stellar sound system.",
      "author": "Chris Wasser"
    },
    {
      "text": "Gaga is so good in A Star Is Born and on so many levels that she single-handedly justifies its existence.",
      "author": "Paul Whitington"
    },
    {
      "text": "It's the love story for our time. It's an instant cult classic. It's everything a tasteful move should not be, and yet it's an undeniable success.",
      "author": "Jo Livingstone"
    },
    {
      "text": "The high-voltage ghost of Judy Garland haunts every frame and illuminates every shadow in the film, and Lady Gaga seems to know it.",
      "author": "Rex Reed"
    },
    {
      "text": "The film's musical scene are truly sensational. [Full review in Spanish]",
      "author": "Laura Hiros"
    },
    {
      "text": "A Star is Re-Born? This is the 4th time this one has been made and it's still more a star is boring than A Star is Born.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Cooper's gamble - both in stepping in behind the camera and giving Lady Gaga her first starring film role - has paid off handsomely.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Cooper, Lady Gaga shine in tragic story of love, addiction.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "The elegance with which Bradley Cooper solves the tragic end of the protagonist in his directorial debut seems to anticipate that after this debut there is not only trade, but a truly talent. [Full Review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "If 2011's The Artist was an homage, this is more of a burlesque, a hot mess of a movie that takes its dramatic cues from the camp excesses of the drag queens among whom our hammered hero finds the lucky Lady.",
      "author": "Matthew Lickona"
    },
    {
      "text": "And whatever tears you may shed at the end feel entirely earned, as is one's respect for a movie far better than one might have imagined: a film director is born.",
      "author": "Matt Wolf"
    },
    {
      "text": "If you've been hearing good things about \"A Star is Born,\" believe them all.",
      "author": "Tom Santilli"
    },
    {
      "text": "It's a film that's wise to what it means to be famous in 2018 as well as old-fashioned movie entertainment, with gangbusters musical numbers and an effective and appealing love story between its two leads. And it will make Lady Gaga a movie star.",
      "author": "Rob Thomas"
    },
    {
      "text": "The 2018 version of \"A Star Is Born\" is notable because it contains some impressive \"firsts\" for two of our galaxy's brightest performers.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Though this may not be much of a shock to longtime fans, for those of us who associate Lady Gaga with outlandish public appearances in meat dresses, her soulful down-to-earth performance in this film is borderline revelatory.",
      "author": "Josh Terry"
    },
    {
      "text": "Little jabs of pleasure give way to something less tingly, safer: nods of admiration. Torquing Susan Sontag's definition of camp as \"seriousness that fails,\" I think of Cooper's movie as seriousness that succeeds, but perhaps too well or too cleanly.",
      "author": "Melissa Anderson"
    },
    {
      "text": "Songs age, too, into eulogies for euphoria or suicide notes for security. They die. They're reborn. Over and over. That sense of decay and renewal boldly rests deep in the bones, performances and storytelling of one of the year's best films.",
      "author": "Nick Rogers"
    },
    {
      "text": "Lady Gaga is a radiant, natural actor, and she knocks her first lead movie performance way-far out of the park.",
      "author": "Kurt Loder"
    },
    {
      "text": "[Their love] shines through the performances and music with relevant lyrics proving crucial to their characters' mindsets and our emotional reaction to what occurs.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Believe some, not all, of the hype.",
      "author": "Christian Toto"
    },
    {
      "text": "Cooper takes us along for an engaging ride. And one filled with solid direction, even better performances from the leads, and a killer soundtrack featuring some incredible new songs. (Full Content Review - Profanity, Nudity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Bradley Cooper outshines Lady Gaga in competent retread.",
      "author": "Sonny Bunch"
    },
    {
      "text": "I will go out on a short limb to predict Academy Award nods to Cooper, Gaga and Elliott. Lady Gaga's days of wearing a meat dress are history. A born movie star is she.",
      "author": "Steve Crum"
    },
    {
      "text": "I can't recommend this film enough and can't imagine anyone not being bowled over by it.",
      "author": "Jamie East"
    },
    {
      "text": "This is a dazzlingly original silver-screen debut.",
      "author": "Brian Viner"
    },
    {
      "text": "Unabashed melodrama...the film's strongest moments are acoustic, not plugged-in...intimate, truth-telling exchanges between lovers who want the best for each other.",
      "author": "Peter Canavese"
    },
    {
      "text": "\"A Star is Born\" dazzles.",
      "author": "Linda Cook"
    },
    {
      "text": "When this movie really hums, it's about Cooper the actor and director supporting those who are supporting him.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "In spite of a momentous directorial debut and performance from Bradley Cooper, Lady Gaga leaves the lasting impression in A Star Is Born, a beautiful production perfectly suited to re-release the superstar as a top-tier performer.",
      "author": "Luke Parker"
    },
    {
      "text": "There's a reason they keep making A Star Is Born. As long as you tell this story, you're going to have a good movie. This is not my favorite A Star is Born (that would belong to Barbra) but it's definitely in my top three Star is Borns.",
      "author": "Fred Topel"
    },
    {
      "text": "\"A Star is Born\" isn't perfect, but what Cooper and Gaga are able to do with the tale make it a delicate love story and triumphant tribute to the artistic spirit.",
      "author": "Adam Graham"
    },
    {
      "text": "It's so alive with raw heartache and intoxicating performances it feels like a story no one's ever told before.",
      "author": "Alistair Harkness"
    },
    {
      "text": "[A] creaking, ego driven and tone deaf musical drama.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "We're not watching. We're diving in with her - and ascending to an insta-stardom that feels real, not contrived.",
      "author": "Tim Appelo"
    },
    {
      "text": "A perfectly acceptable drama with some great songs and performances but little more.",
      "author": "Steve Katz"
    },
    {
      "text": "Cooper has managed to do the impossible. He's put together an instant movie classic that will have audiences falling in love with his brand new creation.",
      "author": "Mark Daniell"
    },
    {
      "text": "This movie is an effulgent treat. The songs are terrific and the concert scenes alone are worth the price of admission. Cooper shows Oscar(r) quality as director, actor and co-writer of songs.",
      "author": "Tony Medley"
    },
    {
      "text": "The good news is that this generation gets a pretty good version of the story.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Cooper's leisurely approach builds no momentum, and the non-musical scenes meander as the actors (apparently) improvise in close-up. This isn't storytelling as much as it is a work-shopped series of behaviors.",
      "author": "Robert Horton"
    },
    {
      "text": "It is maudlin, earnest and unfashionably melodramatic. It is too long. It is self-serious. And it is really, truly great.",
      "author": "Calum Marsh"
    },
    {
      "text": "Perhaps this is one of those songs that's been sung once or twice too often.",
      "author": "Frank Swietek"
    },
    {
      "text": "Were the actor Bradley Cooper not so tender and hard-working in his performance as the jaded rocker Jackson Maine, it would be possible to regard the whole thing as a vanity project, since he co-wrote and directed it also.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "It's Cooper's first time as director and Gaga's first major movie role, but you'd never guess it from the skill and passion they bring to the project.",
      "author": "Peter Howell"
    },
    {
      "text": "In A Star Is Born, love hurts. But it's labor that breaks your heart.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "This A Star Is Born is like movie night at the rehab clinic: all the shame of drunkenness and none of the elation.",
      "author": "Richard von Busack"
    },
    {
      "text": "With A Star Is Born, Lady Gaga nails those 12 notes. And she takes it up a key, too.",
      "author": "Kevin Fallon"
    },
    {
      "text": "When you go into seeing A Star Is Born, one thing is always clear: You're in for great music and a broken heart.",
      "author": "Rachel Leishman"
    },
    {
      "text": "Lady Gaga delivers a movie musical performance that's fresh, funny, and at times powerful.",
      "author": "André Hereford"
    },
    {
      "text": "Everything feels comfortably familiar, yet halfway through this plate of pleasing nostalgia and orchestrated pathos, you realize there's not much substance between the focaccia. We may love our two leads but their characters never feel entirely developed.",
      "author": "Katherine Monk"
    },
    {
      "text": "A Star is Born is American mainstream cinema at its very finest.",
      "author": "Tom Fitzgerald and Lorenzo Marquez"
    },
    {
      "text": "Lady Gaga supplies an astonishing work of transparent, transporting joy, a frayed electrical wire of emotion with the voice of an earthy angel. She complements Cooper's sexy, sensitive, pugnacious and powerful Star is Born.",
      "author": "Dann Gire"
    },
    {
      "text": "For Cooper, it's a polished directorial debut. For Gaga, it's as comfortable a bridge from pop stardom into the movie world as one could imagine. As duets go, that's the sort of combined star power that's difficult to beat.",
      "author": "Brian Lowry"
    },
    {
      "text": "But, but, but... I did cry, and Lady Gaga is truly sensational, fabulous, a revelation. I had no idea.",
      "author": "Deborah Ross"
    },
    {
      "text": "A Star is Born isn't a perfect movie, but it is a darned entertaining one.",
      "author": "Michael Smith"
    },
    {
      "text": "The result is a richly layered, laugh-and-cry love story that understands that audiences must love the characters before they buy their love affair.",
      "author": "John Lui"
    },
    {
      "text": "This is the best work Cooper has done as an actor since The Silver Linings Playbook, and his directorial debut suggests the brightest of futures behind the lens. As for Gaga, well, she steals the show.",
      "author": "Harry Guerin"
    },
    {
      "text": "The glory of this version of A Star Is Born is in how this movie star is born through the deconstruction of the pop star playing her.",
      "author": "Sean P. Means"
    },
    {
      "text": "[Gag's] enchanting to watch, while the chemistry between her and Cooper is mesmerising. You'll fall in love with them falling in love and that goes a long way in carrying you through the movie's slightly sketchier second half.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Having already established himself as one of the best actors of his day, Cooper outdoes himself here, performing additional roles behind the scenes. None of his tasks are given short shrift, and his casting of Lady Gaga leads to an inspired performance.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Cooper has produced a film worthy of the moniker A STAR IS BORN, both for him as first-time director and Lady Gaga for her first starring role. They are marvelous --- and a whole new generation will get to appreciate this classic tale.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Beautifully acted and intelligently written, A STAR IS BORN is an ambitious, even monumental achievement in filmmaking.",
      "author": "David Kaplan"
    },
    {
      "text": "What prevails is a commitment to the material that goes well beyond vanity-project interests, as well as a dogged affection for these two flickering flames that burned more brightly as one.",
      "author": "Rubén Rosario"
    },
    {
      "text": "Lady Gaga, remarkable in her first leading movie role, charms as the pre-fame Ally and deftly portrays her transformation. Her mighty pipes leave no question regarding Ally's talent.",
      "author": "Anita Katz"
    },
    {
      "text": "Whatever my feelings about the overall plot, at least I found this new iteration well-directed and -acted ... Count this qualified appreciated as a semi-endorsement, then.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "He's [Cooper] left all of that passion on the screen and once the credits roll, you know exactly why it was worth touching this material again.",
      "author": "Matthew Passantino"
    },
    {
      "text": "This is the kind of movie everybody says they don't make anymore.",
      "author": "Sean Burns"
    },
    {
      "text": "The role of Ally is so meta as to cast doubt on whether Lady Gaga can play other kinds of parts; the performance is so galvanizing that you don't remotely care.",
      "author": "Ty Burr"
    },
    {
      "text": "It feels somehow compact despite its sprawling two-hour-and-15-minute size, with nary a scene or frame wasted as it builds to its inexorable yet heart-shattering finale.",
      "author": "Dana Stevens"
    },
    {
      "text": "(Cooper) continually - and wisely - puts her in the spotlight, allowing the camera to caress Gaga. Many times Cooper tracks his camera in on Gaga's face, emphasizing her eyes, which - in this case - are windows to her soul.",
      "author": "Bob Bloom"
    },
    {
      "text": "Achingly honest.",
      "author": "Nell Minow"
    },
    {
      "text": "An impressive debut from Cooper, not only for his direction but also how he elevates himself as an actor to keep up with his perfectly cast co-star.",
      "author": "Edward Douglas"
    },
    {
      "text": "It's no surprise that Gaga shines brightest when she's performing, but that's not just because she's got a generational voice.",
      "author": "Brad Keefe"
    },
    {
      "text": "This is a walking, talking, singing, and a note for note cliché. I enjoyed it, yes, but the beats, the aching melodrama, cornball lines, passages and action are past their prime. They missed a great opportunity to show some originality.",
      "author": "Anne Brodie"
    },
    {
      "text": "As well as turning Gaga into the next hot big screen commodity, Cooper crafts a film that shines brightest when it needs to, ending on a stirring, emotionally-captivating and indescribably powerful note.",
      "author": "Nathan Osborne"
    },
    {
      "text": "Like its finest antecedents, it wrings tears from its romance and thrills from a steadfast belief in old-fashioned, big-feeling cinema. That it's also a perverse fantasy about men, women, love and sacrifice makes it all the better.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Just TV-commercial pathos and huggy redemption.",
      "author": "Kelly Vance"
    },
    {
      "text": "A Star Is Born is a good show. But it's not blazingly original or truly transcendent. We hear the echoes of what came before.",
      "author": "Tim Grierson"
    },
    {
      "text": "For all the predictions I've heard about this latest version being either great or terrible, I have to say it lands in between, though thankfully much closer to the former than the latter.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "A Star is Born is a series of cliches that work well together. When the music is playing and Cooper and Gaga sing, it's magic.",
      "author": "Kristen Lopez"
    },
    {
      "text": "A remarkable, addictive piece of Hollywood myth-making that deserves to be seen on the biggest screen and in the loudest theater possible.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "This is the best Star Is Born yet, and one of the best movies of the year.",
      "author": "Richard Roeper"
    },
    {
      "text": "A Star Is Born is perfectly fine, escapist entertainment. Just don't expect any encores.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "An astonishingly confident directorial debut from Cooper. The concert scenes are alternatively soulful and boot-stomping, but never anything less than arresting, and the snippets of backstage life crackle with authenticity.",
      "author": "Max Weiss"
    },
    {
      "text": "Cooper and Gaga both infuse an energy and authenticity within [their characters] that gives their blossoming relationship organic growth.",
      "author": "Robert Daniels"
    },
    {
      "text": "In the next A Star Is Born we surely need a story reborn. This one is getting past its reincarnate-by date.",
      "author": "Nigel Andrews"
    },
    {
      "text": "A Star Is Born, is simply terrific -- a big-scale cinematic delight that will have the masses singing, swooning and sobbing along with it.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "...an all-out weepie, and something of a false one.",
      "author": "Josh Larsen"
    },
    {
      "text": "Cooper and Gaga have voices worth listening to, especially when they're harmonizing in front of a crowd of thousands. We just wish the narrative mixed in a few more sharps and flats to ensure a clearly distinct sound and experience.",
      "author": "Kiko Martinez"
    },
    {
      "text": "What ultimately makes \"A Star Is Born\" such a pleasure is that it works on every level - the direction, the acting, the music, the casting.",
      "author": "Ross Raihala"
    },
    {
      "text": "First-time director Cooper and co-star Gaga make beautiful music together in this glossy update of a Hollywood classic.",
      "author": "Rafer Guzman"
    },
    {
      "text": "For the movie to work, the music has to be believable as commercially viable entity, and for the most part it does.",
      "author": "Gary Thompson"
    },
    {
      "text": "Every generation needs its Star, and the latest version - starring Bradley Cooper and Lady Gaga - is a worthwhile addition to the series.",
      "author": "Cameron Meier"
    },
    {
      "text": "Bradley Cooper has a lot to say in this effective, beautifully made movie.",
      "author": "Joanna Langfield"
    },
    {
      "text": "No acting is required from Cooper and the accompanying band when [Lady Gaga] takes the stage. Like them, you will be in awe.",
      "author": "Joanne Soh"
    },
    {
      "text": "Even the most hard-hearted and cynical viewer is likely to have an emotional reaction, and this is as much a testimony to the way Cooper tells the tale as to the story itself.",
      "author": "James Berardinelli"
    },
    {
      "text": "Cooper deserves the accolades, but it's Gaga people will be talking about as they leave the theater.",
      "author": "Clint O'Connor"
    },
    {
      "text": "Cooper's version of Star is like a perfect white t-shirt or a nice bowl spaghetti.",
      "author": "Hannah Lynn"
    },
    {
      "text": "A blockbuster romance that looks and feels like an indie film, all in service of an expression of pure love.",
      "author": "Katie Walsh"
    },
    {
      "text": "Gaga is a real surprise in a demanding role. She never feels like she's acting, and brings the character right into the songs.",
      "author": "Rich Cline"
    },
    {
      "text": "It's a story of rock stars and A-list fame told in small moments and claustrophobic shouting matches, an epic made small to moving effect.",
      "author": "Dominick Suzanne-Mayer"
    },
    {
      "text": "Bradley Cooper's A Star Is Born is brazen widescreen craft that goes for the throat and makes no bones about wanting to leave you a sopping wet mass of tears by the time its credits roll.",
      "author": "Jacob Knight"
    },
    {
      "text": "The fact that Bradley Cooper and Lady Gaga have such a good contrast, is worth every second on film. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "The actors' support for each other translates on screen as real communion and their musical performances together are the film's highlight.",
      "author": "Laura Clifford"
    },
    {
      "text": "The meandering narrative lays a near flawless foundation for a love story centered around finding one's artistic soul.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "A Star is Born is aptly titled--Lady Gaga has arrived. A movie star is born.",
      "author": "Neil Pond"
    },
    {
      "text": "Like Barbra Streisand and Whitney Houston before her, Gaga is on her way to becoming more than just a singer who occasionally acts.",
      "author": "Travis Hopson"
    },
    {
      "text": "The result is a product formatted for fans of the Grammys and the Oscars, but it also lets us see the annoying narcissistic drive of its director and protagonist. [Full review in Spanish]",
      "author": "Carlos F. Heredero"
    },
    {
      "text": "Passionate, emotional and fearless, the gangbusters \"A Star Is Born\" is poised to become the movie of the moment - the one everyone has to see right now.",
      "author": "Kenneth Turan"
    },
    {
      "text": "By dumping the usual Hollywood bull for something that feels raw, scrappy and lived in, Cooper and Gaga knock it out of the park. Their movie, one of the year's very best, is a modern musical classic. The Oscar race is officially on.",
      "author": "Peter Travers"
    },
    {
      "text": "The film feels fresh from thunderous start to exquisite finish.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Cooper and his cast and crew aim high and almost hits the mark but, to me, falls short of its aspiration to be the best \"A Star Is Born.\"",
      "author": "Robin Clifford"
    },
    {
      "text": "Cooper's debut outing at the helm is a thoroughly convincing one in almost every respect. In terms of chemistry, a rich natural register is struck between the duo that makes them transfixing to behold.",
      "author": "Hilary A White"
    },
    {
      "text": "I was blown away by the stellar performances and the original takes on the story",
      "author": "Raquel Stecher"
    },
    {
      "text": "Like a classic love song, the film is meant to tug your heart strings. [Full Review in Spanish]",
      "author": "María Fernanda Mugica"
    },
    {
      "text": "[A] magnificent, emotional, beautiful production that entertains and thrills you while it makes you laugh and cheer, but also while it makes you cry and breaks your heart.",
      "author": "Mark Hughes"
    },
    {
      "text": "The story may be more than a little hoary but at its best moments, it reminds you that just because something is old and predictable does not mean that it cannot also be entertaining and ultimately satisfying as well.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Lady Gaga has traveled by egg, donned skirt steak and taken part in a TV blood orgy. But her biggest transformation occurs in the new film \"A Star Is Born.\" In it, she becomes an Oscar-worthy actress.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "I just loved it. It's a film that combines an overall feeling of modernity and relevance with the glow of old-time glamour.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Instantly sweeps us up in its passion, its electricity, its music, and characters to fall in love with. Lady Gaga is a revelation. It's impossible to believe Bradley Cooper has never directed before. I adore this movie.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Somehow, Cooper has made a Hollywood fairy tale seem utterly believable and magical at the same time.",
      "author": "Randy Cordova"
    },
    {
      "text": "Cooper, in his directing debut, puts us inside the music and the drama and lets it swirl around us.",
      "author": "Moira MacDonald"
    },
    {
      "text": "It is made for a big screen, big sound and the comforting sorrow of the communal sob.Maybe we really do need another version of A Star is Born.",
      "author": "Donald Clarke"
    },
    {
      "text": "With their phenomenal \"A Star Is Born,\" Lady Gaga and Bradley Cooper upend expectations and spectacularly freshen up a stock Hollywood story.",
      "author": "Brian Truitt"
    },
    {
      "text": "... this update of the classic love story is crafted with a palpable affection and passion. Cooper's take is personal, ingenious, and raw.",
      "author": "Chris Feil"
    },
    {
      "text": "The result is pure Saturday-night moviegoing: it gives you one hell of a wallop, then you wake up on Sunday morning without a scratch.",
      "author": "Anthony Lane"
    },
    {
      "text": "Lady Gaga excels as a diluted version of herself in a moving a promising directorial debut from powerhouse Bradley Cooper. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Bradley Cooper updates \"A Star Is Born\" on the wings of a luminous talent. Pop diva Lady Gaga is electric on screen.",
      "author": "Julian Roman"
    },
    {
      "text": "Sit back, fall in love, and let it wash over you. Watch a star being born",
      "author": "Frank Wilkins"
    },
    {
      "text": "This version stands on its own. It is enjoyable romp and there are some emotional moments that deliver a jolt but that is it. I wish Hollywood studios would stop with the remakes.",
      "author": "Rosalynn Try-Hane"
    },
    {
      "text": "A Star Is Born is a resounding success. The concert scenes are particularly impressive... It's intimate, and sweaty, and loud.",
      "author": "Anne Cohen"
    },
    {
      "text": "Fueled by strong performances and Cooper's precise direction, A Star is Born is a moving (and tear-jerking) love story by way of showbiz melodrama.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Absolutely LOVED this. Bradley Cooper is just sensational. A juggernaut assault on the emotions. Pack tissues.",
      "author": "Kat Hughes"
    },
    {
      "text": "An enormously satisfying and well-tuned blockbuster gala musical; a vibrant, up-to-date Supertrouper crackling with happiness and heartbreak, sprinkled with stardust and star-maker gumption.",
      "author": "Alan Jones"
    },
    {
      "text": "This film grapples with fame, family, integrity, love and sacrifice. It succeeed emphatically in conveying the overwhelming love its two central characters feel.",
      "author": "Stefan Kyriazis"
    },
    {
      "text": "What makes Cooper so good is that he directs in a way that encourages you not to see what he is doing, but what is happening. Character above all.",
      "author": "Olly Richards"
    },
    {
      "text": "\"Joanne\" demonstrated [Gaga's] range as a vocalist and musician, yet received largely middling reviews. But it did hint at her potential legacy-evolving into an artist as skilled as Prince. A STAR IS BORN cements that legacy.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Handsomely mounted and profoundly felt at times, becoming an \"Actors Studio: The Movie\" take on music world misery.",
      "author": "Brian Orndorf"
    },
    {
      "text": "It's full of old-fashioned movie magic, with Bradley Cooper knocking it out of the park in his directorial debut, and Lady Gaga bringing it, and not just with her singing.",
      "author": "Stephen Silver"
    },
    {
      "text": "The first half is much better than the second half, but it still works as a compelling romantic tragedy.",
      "author": "Scott Mendelson"
    },
    {
      "text": "\"A Star is Born\" offers a suitably jaundiced glimpse of starmaking machinery at its most cynical, but also its most thrilling and gratifying.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Not unlike Boogie Nights, the highs in A Star Is Born (ie: the first half) are very high, while the lows (the latter half) include drawn-out and repetitive elements that are so telegraphed and predictable they simply feel sad.",
      "author": "Joe Lipsett"
    },
    {
      "text": "This soul-baring, emotionally propulsive work proves that Cooper is just as much of a dynamo behind the camera as he is in front of it.",
      "author": "Courtney Howard"
    },
    {
      "text": "Lady Gaga can act, very well, and actor Bradley Cooper can direct -- even better.",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "An uneven work of startling sincerity and disarming beauty.",
      "author": "Kelley Dong"
    },
    {
      "text": "The excitement of the film's first hour is sacrificed for a more cliched permanent stay in its second. Gaga takes over and Bradley takes a backseat; gone is the dynamic that made the first half so electrifying and enticing",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Somewhere inside this good 135-minute film is an even better 120-minute movie.",
      "author": "Dwight Brown"
    },
    {
      "text": "Cooper and Gaga are irresistibly charming together consistently bringing out the best in each other, eliciting palpable trust both as on-screen characters and world-class stars comfortable in one another's shoes. Nothing is faked, everything is remarkable",
      "author": "Robert Kojder"
    },
    {
      "text": "Bradley Cooper's feature directorial debut, A Star Is Born, knocks it out of the park thanks to a stellar performance from Lady Gaga.",
      "author": "Danielle Solzman"
    },
    {
      "text": "The kind of film that no one is going to stop talking about for months, because very few people will have anything bad to say about it.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Maybe we've seen it before, heard the music and felt how love burns, how inescapable self-destruction hurts. But there's no taking away from what the marriage of these moments has created, the importance of all these new stars shining so bright.",
      "author": "Ella Kemp"
    },
    {
      "text": "While it's not a perfect film - though the first hour just may be - A Star Is Born boasts more than enough passion to make up for some of its narrative hiccups.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "\"All you gotta do is trust me,\" he tells her, and when he brings her out on stage, and then brings her up to the front microphone, it raises the same kind of gooseflesh as the \"When Your Mind's Made Up\" scene in Once.",
      "author": "Jason Bailey"
    },
    {
      "text": "Cooper's feat of filmmaking puts him on a par with great American actors turned auteurs like Clint Eastwood and Warren Beatty.",
      "author": "Allan Hunter"
    },
    {
      "text": "Proves there is still plenty of life left in this tale of fame, addiction, and sacrifice. \"A Star Is Born\" is an emotionally intimate journey that makes itself feel like an event. An astonishing Lady Gaga positively soars.",
      "author": "Dustin Putman"
    },
    {
      "text": "Lady Gaga will get the attention, but Bradley Cooper steals the show.",
      "author": "Max Covill"
    },
    {
      "text": "Gaga keeps the film's heart pumping. She's down-to-Earth and radiant-in other words, every bit as good as everyone has been saying.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Bradley Cooper and Lady Gaga are this year's Ryan Gosling and Emma Stone.",
      "author": "Scott Menzel"
    },
    {
      "text": "Cooper gives his heroes highly personal issues: his sanity and his music for Jack, and her sense of self-worth for Ally.",
      "author": "Manuela Lazic"
    },
    {
      "text": "The supporting roles in A Star Is Born are equally wonderful, and some in surprising ways. Sam Elliott remains a genius.",
      "author": "Andy Howell"
    },
    {
      "text": "Lady Gaga triumphs as a young woman averse to artifice and fame-hounding. The movie is a hell of a magic act.",
      "author": "David Edelstein"
    },
    {
      "text": "Overall, this movie is a testament to the talent of Cooper, but the glory belongs to Gaga.",
      "author": "Patrik Sandberg"
    },
    {
      "text": "A Star Is Born is a refreshing take of this classic showbiz rise and fall tale, with updated character work, fantastic performances by Bradley Cooper and Lady Gaga, and a soundtrack that will be stuck in your head for days.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "A Star is Born doesn't deviate too wildly from the frequently remade storyline, but everything else about Cooper's film feels refreshed and new.",
      "author": "Andrew Parker"
    },
    {
      "text": "Gaga is truly immense throughout, delivering a wonderfully grounded and subtle performance with bursts of that electricity that has so invigoratingly defined her pop career.",
      "author": "Caitlin Quinlan"
    },
    {
      "text": "It's valid to ask whether a movie needs to be made a fourth time, but Cooper's fantastic, emotional film demonstrates how execution, style, and a modern point of view can make even the most familiar story fresh again.",
      "author": "Bryan Bishop"
    },
    {
      "text": "A turn that has a semblance of Nicolas Cage in \"Leaving Las Vegas\" and Joaquin Phoenix in \"Walk the Line,\" Cooper constructs his own creation, echoing and respecting the role that has been crafted by March, Mason, and Kristofferson.",
      "author": "Clayton Davis"
    },
    {
      "text": "It's not adding anything new to the Star is Born canon, but it is a solid retelling for a new generation.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Their chemistry is undeniable, their duets infectious and moving the action into the contemporary music scene, where Ally is rapidly reconfigured as a sequin-studded red head flanked by unnecessary dancers, strikes a long line of emotional notes.",
      "author": "Kate Taylor"
    },
    {
      "text": "You can see where all of it is headed from two miles away. But that doesn't matter, not when Bradley Cooper is executing the formula so well.",
      "author": "Angie Han"
    },
    {
      "text": "Cooper and Lady Gaga pull off a remarkable feat-they not only make you believe the characters are actually falling in love.",
      "author": "John Powers"
    },
    {
      "text": "An invigorating paean to the joys of making art, the momentum that comes with sudden inspiration, and how swooningly romantic it can all feel.",
      "author": "David Sims"
    },
    {
      "text": "A film that dares to go big, bold and sincere, classical, modern and haphazard in equal measures. It may not go down as one of the greats but like many a song over the decades, when the right note in the film swings big, it soars.",
      "author": "Allyson Johnson"
    },
    {
      "text": "Great music, great performances, a doomed love story with plenty of heart on display, A Star Is Born really is a triumph, a reminder that sometimes playing the hits can really bring the house down.",
      "author": "Jason Gorber"
    },
    {
      "text": "Bradley Cooper makes an outstanding directorial debut and Lady Gaga proves herself a movie star in this electrifying remake of an oft-told show-business tale.",
      "author": "Kevin Lally"
    },
    {
      "text": "Superb. Gaga and Cooper deliver Oscar-worthy turns in a remake that hits the high notes.",
      "author": "James Mottram"
    },
    {
      "text": "Cooper's film proves that a love story this timeless still works when done right.",
      "author": "Oliver Whitney"
    },
    {
      "text": "It's remarkable... just how many fresh reserves of emotion Cooper teases out of a well-worn formula.",
      "author": "Justin Chang"
    },
    {
      "text": "Cooper uses Hollywood's favorite creation myth to recreate how audiences will forever perceive him and Gaga.",
      "author": "David Crow"
    },
    {
      "text": "Cooper seems at once fired up by the meet-cute potential of the premise, which he nails, and stuck at a creative crossroads with the more melancholy, sepia-toned stuff that probably first drew the previously-attached Clint Eastwood's attention.",
      "author": "Angelo Muredda"
    },
    {
      "text": "The film is a proper double hander, divided between Gaga and Cooper, but it also provides an excellent platform for Cooper to show off all the directorial tricks he's picked up from his long acting career.",
      "author": "Kayleigh Donaldson"
    },
    {
      "text": "Bradley Cooper makes an impressive directing debut with A Star Is Born, turning one of Hollywood's most re-made movies into something fresh and soulful, even though it's hampered by some of the story's clichés.",
      "author": "Karen Gordon"
    },
    {
      "text": "Believe the hype. Cooper is a born director and Lady Gaga is superb.",
      "author": "Chris Bumbray"
    },
    {
      "text": "This story has been told several times before-and influenced other similar romances-but Cooper and Gaga find a way to make this feel fresh and new.",
      "author": "Brian Tallerico"
    },
    {
      "text": "The familiar story of an aging performer discovering a rising star gets a fresh coat of paint, and excels primarily due to the performance (and musical talents) of Lady Gaga.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Cooper has made a remarkably self-assured feature debut anchored by an outstanding lead performance from Lady Gaga.",
      "author": "Matt Goldberg"
    },
    {
      "text": "The occasional bum note aside, this is broad-strokes filmmaking of the highest calibre.",
      "author": "Paul O'Callaghan"
    }
  ],
  "release_year": 2018,
  "duration": 136,
  "genres": [
    "Romance",
    "Drama",
    "Music"
  ],
  "age_rating": "R",
  "synopsis": "Seasoned musician Jackson Maine discovers -- and falls in love with -- struggling artist Ally. She has just about given up on her dream to make it big as a singer until Jackson coaxes her into the spotlight. But even as Ally's career takes off, the personal side of their relationship is breaking down, as Jackson fights an ongoing battle with his own internal demons.",
  "popularity": 8.0,
  "poster_url": "https://image.tmdb.org/t/p/original/wrFpXMNBRj2PBiN4Z5kix51XaIZ.jpg"
}