{
  "movie_name": "After",
  "movie_id": "after_2019",
  "total_reviews": 38,
  "reviews": [
    {
      "text": "This really is a dumpster fire of a movie, so please save your money for something more worthwhile.",
      "author": "Natasha Alvar"
    },
    {
      "text": "After is also one of those teen dramas where every emotion has to be underscored by a pop-song and a hair is never out of place.",
      "author": "James Croot"
    },
    {
      "text": "Adapted from young adult fan fiction, not much happens in this adolescent love story, yet it becomes weirdly interesting.",
      "author": "Adrian Martin"
    },
    {
      "text": "Of such deficient quality that it's unfathomable people will actually pay for a ticket to see this.",
      "author": "Nicholas Bell"
    },
    {
      "text": "The music is fun and the scenery is beautifully cinematic, in a way, but the story itself is neither.",
      "author": "Brigid Presecky"
    },
    {
      "text": "Jenny Gage's sudsy After offers run-of-the-mill college romance targeted to the PG-13 demographic. The result, a far cry from the lustier stories upon which it is based, misses the mark despite an appealing performance from Josephine Langford.",
      "author": "Greg Carlson"
    },
    {
      "text": "The leads give it all they've got, and Australian actress Josephine Langford is impressive given the limited range of her role. The film looks pretty and director Jenny Gage, to her credit, knows the rhythms of teen melodrama well.",
      "author": "Jim Schembri"
    },
    {
      "text": "It's a movie well made for its target audience.",
      "author": "Stephen Romei"
    },
    {
      "text": "After makes 50 Shades Of Grey look like Anna Karenina.",
      "author": "Vicky Roach"
    },
    {
      "text": "The film's illogical choices and standard teen romance mentality mean nothing that transpires on screen feels remotely fresh.",
      "author": "Peter Gray"
    },
    {
      "text": "The first movie adaptation, and it looks fairly safe to say there won't be any more Afters after this After.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The key to the book's success lies in its artful amateurism. It replicates the tone of one teen confiding in another and in this anodyne screen translation, its intimacy is lost.",
      "author": "Sandra Hall"
    },
    {
      "text": "Where are the real teen romances? This gives us a hint, but the script is so flawed that it's hard to buy anything the characters do.",
      "author": "Julia Swift"
    },
    {
      "text": "...an often aggressively generic scenario...",
      "author": "David Nusair"
    },
    {
      "text": "A lost opportunity. [Full review in Spanish]",
      "author": "Lara Ben-Ameur"
    },
    {
      "text": "Full of light, pastel colors, enormous curtains, [a] bubble bath, and loud breathing while Taylor Swift plays. [Full review in Spanish]",
      "author": "Santiago Alverú"
    },
    {
      "text": "The performances are spotty and half-hearted, even the most serious of lines are laughable.",
      "author": "Jasmine Lim"
    },
    {
      "text": "Anna Todd's novel adaptation is this generation's Cruel Intentions. The PG-13 rating holds back the story some, but stars Josephine Langford and Hero Fiennes Tiffin have impeccable chemistry.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "As assumed, After is remarkably horny and corny to the point of embarrassment.",
      "author": "Maria Sherman"
    },
    {
      "text": "I endured [the film until the end only because of professional duty. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "Films like After aren't necessarily the best kinds of films to talk to teenagers about sex. [Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "It just...lingers, futilely praying that the leads can wring something out of this material.",
      "author": "Michael Fairbanks"
    },
    {
      "text": "Because the cast is good and the movie is directed with a certain level of energy, we're never necessarily bored, just wondering when it will stop behaving.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Gage's tepid teen romancer After plays it safe and never elevates this youth-oriented, pseudo-steamy sudser beyond its pedestrian pauses of passion. One has seen this slushy session of teen sexual angst numerous times before, folks.",
      "author": "Frank Ochieng"
    },
    {
      "text": "When the back-story of how a movie came to be ends up being more interesting than the finished product, that isn't going to help matters. (Full Content Review for Parents - Sex, Profanity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "The real problem with After is that it's a lifeless slog of thinly written clichés, one that's missing the charismatic spark of the actual One Direction boys.",
      "author": "Caroline Siede"
    },
    {
      "text": "A film for fans of the literary saga, but even they might wind up disappointed. [Full Review in Spanish]",
      "author": "Amanda Adame"
    },
    {
      "text": "Come back, Twilight, all is forgiven.",
      "author": "Frank Scheck"
    },
    {
      "text": "Think Romeo and Juliet sans the poor outcome.",
      "author": "Anne Brodie"
    },
    {
      "text": "After is an intimate look at the ups and downs of first love that takes some nonsensical narrative turns, but is nevertheless a captivating romance.",
      "author": "Molly Freeman"
    },
    {
      "text": "The kind of dispiriting effort that thinks it's scratching an itch for masochistic young girls, but primarily suggests that romance, desire and sexuality aren't worth genuinely exploring.",
      "author": "Robert Abele"
    },
    {
      "text": "The soundtrack rounds up the accumulation of clichés that characterizes the entire film. [Full review in Spanish]",
      "author": "Ignacio Navarro"
    },
    {
      "text": "The problems may lie in Todd's novel, but regardless, characters act illogically, as though written by someone who napped through most of Intro to Psych and skipped English 101 altogether.",
      "author": "Kimber Myers"
    },
    {
      "text": "After opens with some narration about how certain moments in life seem to define a person, and from there, the clichés pretty much don't stop.",
      "author": "Mark Dujsik"
    },
    {
      "text": "An uninspired picture that lives at the intersection of E.L. James, Nicholas Sparks, and the Freeform network.",
      "author": "John Fink"
    },
    {
      "text": "An innocuous teen pulp soap opera that flirts with \"danger\" but, in fact, keeps surprising you with how mild and safe and predictable it turns out to be.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "A patina of high literature... is not enough to counteract the banality and insubstantiality of After. [Full review in Spanish]",
      "author": "Gaspar Zimerman"
    },
    {
      "text": "This film is closer to Twilight that the perfect comedy of manners from Austen or the romantic tragedy from Brontë. [Full Review in Spanish]",
      "author": "Natalia Trzenko"
    }
  ],
  "release_year": 2019,
  "duration": 106,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Tessa Young is a dedicated student, dutiful daughter and loyal girlfriend to her high school sweetheart. Entering her first semester of college, Tessa's guarded world opens up when she meets Hardin Scott, a mysterious and brooding rebel who makes her question all she thought she knew about herself -- and what she wants out of life.",
  "popularity": 6.4,
  "poster_url": "https://image.tmdb.org/t/p/original/u3B2YKUjWABcxXZ6Nm9h10hLUbh.jpg"
}