{
  "movie_name": "Anchorman",
  "movie_id": "anchorman",
  "total_reviews": 198,
  "reviews": [
    {
      "text": "You could argue that Anchorman: The Legend of Ron Burgundy is one of the Mt. Rushmore comedies, a pitch-perfect character study combined with some incredible set pieces, unforgettable jokes and scathing commentary.",
      "author": "Cory Woodroof"
    },
    {
      "text": "“Anchorman” has a number of great scenes and I found myself laughing out loud numerous times. Unfortunately I found myself rolling my eyes just as much.",
      "author": "Keith Garlington"
    },
    {
      "text": "The men are crude, the weatherman (Steve Carell) has the intellectual depth of a dust bunny, and the news teams swagger around town like overdressed street gangs who rumble when they collide.",
      "author": "Sean Axmaker"
    },
    {
      "text": "One of the greatest comedies of all time. Pure genius. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "The blooper reel at the end credits proves that this group must have had a grand time making the film - perhaps more than viewers will have watching the finished product.",
      "author": "Mike Massie"
    },
    {
      "text": "Absolutely riotous!! Ron Burgundy, the man with a nose for news and one fine looking head of helmet hair. Anchorman - it brings you comedy so you don't have to go find it.",
      "author": "Debbie Lynn Elias"
    },
    {
      "text": "Anchorman: The Legend of Ron Burgundy is one of the best comedies of this century.",
      "author": "Danielle Solzman"
    },
    {
      "text": "He's sure to offend viewers who don't see the humor in such stuff. [But Ron Burgundy] highlights the truth about television news. It's entertainment disguised as information.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "Will Ferrell is superb as Ron Burgundy, an egocentric legend of TV's nightly news who could only have existed in the 1970s.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The uneven comedy is sometimes amusing but too often it's a bad joke prolonged.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Incredibly silly yet often hilarious...",
      "author": "David Nusair"
    },
    {
      "text": "[A] very funny, silly, and well acted comedy that must be watched for the great laugh out loud performances, and gut busting gags.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Silly comedy that's definitely not for kids",
      "author": "Nell Minow"
    },
    {
      "text": "It's nearly perfect.",
      "author": "Rob Humanick"
    },
    {
      "text": "By no means ... a great movie. But I not only understand why some people love it, I think I'm even beginning to love it a little myself.",
      "author": "Philip Martin"
    },
    {
      "text": "Laughs galore follow the well-paced humor as cameo performances by Jack Black, Tim Robbins, and Luke Wilson spice up the buffoonery ingeniously smacked at by the rest of movie's talented ensemble.",
      "author": "Cole Smithey"
    },
    {
      "text": "Relentlessly silly but not quite funny parody of 70s network news never quite lives up to its promise.",
      "author": "Joe Lozito"
    },
    {
      "text": "Some of the material works, some doesn't.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "This goofy, energetic comedy flattens out at times but milks its 1970s setting and characters for numerous huge laughs.",
      "author": "Mark Halverson"
    },
    {
      "text": "...like a 'Saturday Night Live' skit that got out of hand, a good idea that kept going and going but never quite jelled into a story.",
      "author": "John J. Puccio"
    },
    {
      "text": "A crude, funny satire that tackles local television anchors and their newscasts. Those are easy targets to skewer, but the movie mines more truth from its subject than some in the biz will want to admit.",
      "author": "Christopher Smith"
    },
    {
      "text": "Some of \"Anchorman\" is the kind of giddy, nonsensical stuff that can only emerge from a genuinely deranged comic brain.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Ostensibly modeled on the egomaniacal Ted Baxter of the old Mary Tyler Moore TV series, this adventure's protagonist is less comical, less endearing, and generally grates on the nerves.",
      "author": "Kam Williams"
    },
    {
      "text": "Takes a joke and runs with it -- sometimes too far, but usually long enough to wear you down and force you to submit to its craziness.",
      "author": "Anna Smith"
    },
    {
      "text": "Word is Ferrell got the idea for the film one night while watching a documentary on the male dominated world of 70s television news. His fans should thank their lucky stars the comedian happened to catch it.",
      "author": "Rick Kisonak"
    },
    {
      "text": "There hasn't been a movie this silly or funny since Austin Powers.",
      "author": "Scott Nash"
    },
    {
      "text": "...somehow Will Farrell manages to hold the whole mess together.",
      "author": "Uri Lessing"
    },
    {
      "text": "Anchorman: The Legend of Ron Burgundy shows that the past has bright future in Hollywood comedies.",
      "author": "Dragan Antulov"
    },
    {
      "text": "Ferrell's manic energy takes it beyond parody and into a brilliant dance of buffoonery.",
      "author": "Jason Zingale"
    },
    {
      "text": "So funny that you won't care that it has no real plot but boasts more bad wigs than The Lord of the Rings...",
      "author": "Brian Juergens"
    },
    {
      "text": "Fans of the Todd Phillips school of comedy are going to be divided on this one -- there's real potential here and a great premise but had it been a little cleverer it could've been so much more.",
      "author": "Garth Franklin"
    },
    {
      "text": "Overall, I put Anchorman on about the same level as Dodgeball. Both movies are pretty stupid and don't generate as many laughs as you wish they would.",
      "author": "Ethan Alter"
    },
    {
      "text": "Nothing in Anchorman will be mistaken for the work of Preston Sturges, but the occasional chuckle and even a loud guffaw is unavoidable.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Misses a golden opportunity by crossing the line that separates parody from stupidity.",
      "author": "Tony Medley"
    },
    {
      "text": "A straight shot of that good stuff.",
      "author": "Alan Dale"
    },
    {
      "text": "If we want to judge Anchorman by its own standards, we can observe that nothing in the movie lives up to, say, Toonces the driving cat.",
      "author": "Thomas Peyser"
    },
    {
      "text": "Avoid Anchorman like the plague, you'll thank me later.",
      "author": "Joe Utichi"
    },
    {
      "text": "Ferrell wrenches every drop of ingenuity from a lackluster screenplay and amplifies it through his face, his voice, his gut - even his underwear.",
      "author": "Mark Collette"
    },
    {
      "text": "Certainly the silliest comedy of the year, but mainly in a good way.",
      "author": null
    },
    {
      "text": "Doesn't quite live up to the promise of its admittedly funny trailer, though it does have several good laugh-out-loud gags.",
      "author": "Matthew Turner"
    },
    {
      "text": "This is ideal Friday night fodder if you're in the right mood.",
      "author": "Nev Pierce"
    },
    {
      "text": "Generally, the film makes good on its humorous potential.",
      "author": "Michael Drakulich"
    },
    {
      "text": "The period vibe is basically the whole point to this charming and often very funny film.",
      "author": "Rich Cline"
    },
    {
      "text": "The good news is - the film is fresh, imaginative and full of laughs.",
      "author": "Tony Toscano"
    },
    {
      "text": "balances its social satire with some outlandish visual gags and moments of surreal hilarity",
      "author": "James Kendrick"
    },
    {
      "text": "Ferrell is at the top of his game, giving us a character who is utterly shallow, silly, and vainglorious, yet completely likable.",
      "author": "Brian Mckay"
    },
    {
      "text": "If you don't like Will Ferrell, I don't understand you. I mean, this movie might just change your mind.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "Rent it if you must, but don't say I didn't warn you.",
      "author": "Karina Montgomery"
    },
    {
      "text": "Surprise surprise, the movie outplays its trailer. Picks up big well-deserved laughs in between ever decreasing non-funny moments.",
      "author": "Ross Anthony"
    },
    {
      "text": "All those comedy smarts boils down to one indisputable fact: Anchorman is the single funniest thing Will Ferrell has done yet.",
      "author": "David Cornelius"
    },
    {
      "text": "Anchorman has a good-natured attitude to go along with its hit-or-miss jokes, and Ferrell's willingness to humiliate himself for a laugh should count for something.",
      "author": "Daniel Eagan"
    },
    {
      "text": "Resembling Bill Murray's early career, Ron Burgundy is a Peter Venkman/Carl Spackler type performance which will be remember fondly during Will Ferrell's 2020 Oscar run.",
      "author": "Stephen Himes"
    },
    {
      "text": "Half of Anchorman had me laughing on cue; the other half made me want to switch channels.",
      "author": "Thomas Delapa"
    },
    {
      "text": "Generally funny, but for the first half hour it's hilarious.",
      "author": "Mark Palermo"
    },
    {
      "text": "But it isn't, and instead all we get is a tiredly over-the-top, overly improvised farce that relies more on the popularity of its star than it does on little things like character, story or continuity.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "To praise Anchorman for perceptive social commentary would be giving the movie more credit than it deserves, but it isn't just pratfalls and sexual humour.",
      "author": "Brian Webster"
    },
    {
      "text": "A strange, funny movie about a strange, funny guy.",
      "author": "Linda Cook"
    },
    {
      "text": "O diretor já revelou que um segundo filme, produzido apenas com as cenas deletadas deste, será incluído no DVD. Será que a pré-venda já começou?",
      "author": "Pablo Villaça"
    },
    {
      "text": "The period detail is hilarious, abetted fantastically by Alex Wurman's score. But there's so much talent on hand that you couldn't blame anyone for wanting more.",
      "author": "Jake Euker"
    },
    {
      "text": "Watching Ferrell and crew put the uproar in uproarious makes you forget, if only for a while, today's worst news.",
      "author": "Randy Shulman"
    },
    {
      "text": "...about as entertaining as a TV test pattern.",
      "author": "Lori Hoffman"
    },
    {
      "text": "Consistently funny, more often than not of the cheap variety.",
      "author": "Jim Chastain"
    },
    {
      "text": "Slaps a goofy smile on your face.",
      "author": "Peter Travers"
    },
    {
      "text": "The weirder Anchorman gets, the stronger its comedy.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "At best fitfully amusing for all but hardcore Ferrell fans.",
      "author": "Ken Hanke"
    },
    {
      "text": "I could have used more smarm and crisply delineated battle-of-sexes confrontation, but Ferrell's overwrought mania and wholesale comedic devotion again sell the laffs.",
      "author": "Brent Simon"
    },
    {
      "text": "Although Anchorman is packed with genuine laughs and a plethora of pleasant-surprise cameos, the film's cardboard characters and lifeless storyline is a step backward for Ferrell in his otherwise escalating big-screen career.",
      "author": "Tyler Hanley"
    },
    {
      "text": "Will said on a recent talk show that he got the idea from watching a documentary on news and was captivated by the 70's anchors.",
      "author": "Vince Koehler"
    },
    {
      "text": "Ron Burgundy is a boob on the boob tune whose antics get stale before the movie ends.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Perfectly captures the hilarious desperation of the local news personality.",
      "author": "Jimmy O"
    },
    {
      "text": "...consistently ridiculous and hysterical, despite its messy mid-movie abandonment of the subject it sets out to parody.",
      "author": "Aaron Hillis"
    },
    {
      "text": "There are a ton of jokes launched, and most of them work.",
      "author": "Danny Minton"
    },
    {
      "text": "It sinks like an anchor, man.",
      "author": "Phil Villarreal"
    },
    {
      "text": "What we get is more of the same from Ferrell -- funny faces, goofy accents, pratfalls aplenty -- and that ain't bad. It just could have been a lot better.",
      "author": "Kimberley Jones"
    },
    {
      "text": "In the end, it really hinges on Ferrell's burgeoning star power and the contributions of his scene-stealing supporting cast.",
      "author": "Wade Major"
    },
    {
      "text": "...we all get one of the funniest movies of the year...",
      "author": "Eric Campos"
    },
    {
      "text": "Not since last year's Old School have I actually laughed afterward at a film's gags, remembering each one as if seeing it for the first time.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "This one's crazy, silly, funny and whole lotta loony, but as a cohesive movie movie...it's also kind of a mess.",
      "author": "Scott Weinberg"
    },
    {
      "text": "A hoot that comes to an unfortunate halt every time the newsteams go over the top.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Even if many of the film's individual characters aren't worth remembering an hour after you see the movie, Anchorman is almost always hilarious.",
      "author": "Mark Bazer"
    },
    {
      "text": "It has a pleasing, noodly elasticity about it -- the picture knows what its limits are and proceeds to boogie unself-consciously far outside them.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Screenwriters Will Ferrell and Adam McKay have brought us a twisted tribute to sexual harassment...",
      "author": "Eric Lurio"
    },
    {
      "text": "All hail Will Ferrell, King of the man-children!",
      "author": "Martin Scribbs"
    },
    {
      "text": "This wildly uneven comedy goes from the heights of zaniness to the depths of bad-sketch humor, sometimes in the same scene.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "You go ... hoping for good, dumb fun. Well, one out of three ain't bad. But that doesn't exactly make Anchorman good, either.",
      "author": "Carol Cling"
    },
    {
      "text": "It's not a comedy.",
      "author": "Victoria Alexander"
    },
    {
      "text": "Ron Burgundy takes his place among the multitude of amusing characters portrayed by one of today's most talented comics.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "A surreally dopey comedy that is refreshingly ribald without resorting to gross-out humor, and its '70s-savvy soundtrack may be worth the price of admission.",
      "author": "James Verniere"
    },
    {
      "text": "At its best it plays like modern-day Marx Brothers in which every single thing that happens makes no sense and serves no purpose and nothing happens for any reason at all.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "Wonderfully silly all the time.",
      "author": "Desson Thomson"
    },
    {
      "text": "You will laugh. Then you will laugh some more. Then you will laugh still again.",
      "author": "Stephen Hunter"
    },
    {
      "text": "May cause hysterical fits of laughter -- stay tuned for further details.",
      "author": "Angel Cohn"
    },
    {
      "text": "Like most of these sofa-spud comedies, Anchorman bears its attention-deficit disorder proudly, as it shifts tone and abruptly sidetracks.",
      "author": "Geoff Pevere"
    },
    {
      "text": "Occasionally, it entertains us for three minutes or so, but it lurches from one skitlike scene to another, charting out like this: funny, not funny, not funny, funny, not, not, not, funny, not, funny, not, not.",
      "author": "Chris Hewitt"
    },
    {
      "text": "While the film is sporadically funny, it was done much better on the small screen, decades ago.",
      "author": "Moira MacDonald"
    },
    {
      "text": "A comic idea that never finds the comic wellspring or anything resembling a sure source for laughs.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The laughs arrive on stale crackers of the easy, breezy and familiar.",
      "author": "David Elliott"
    },
    {
      "text": "There isn't a second that goes by without Ferrell filling it with some form of comic shtick - a well-turned punch line, a goofy facial expression, a pratfall or some other kind of physical comedy business.",
      "author": "Joe Baltake"
    },
    {
      "text": "A mighty silly send-up of a mighty silly era.",
      "author": "Jack Garner"
    },
    {
      "text": "The SNL veteran's willingness to do anything for a laugh, no matter how humiliating or juvenile, keeps the laughs flowing pretty steadily in this fast paced send up of seventies era news anchors in all their blown dry, polyester glory.",
      "author": "Timothy Knight"
    },
    {
      "text": "Add it all up, and you get something that often meets the standard of being funny. Whether it meets the standard of being a movie is another question.",
      "author": "Gary Thompson"
    },
    {
      "text": "Most of it isn't even as funny as those supposedly humorous features that local news broadcasts sometimes end with.",
      "author": "Jay Boyar"
    },
    {
      "text": "Nothing more than an extended skit, and a lame one at that.",
      "author": "Karen Karbo"
    },
    {
      "text": "The celluloid equivalent of a throwaway summer pop anthem, the sort of catchy-yet-agitating tune that has you humming in spite of yourself.",
      "author": "Lisa Rose"
    },
    {
      "text": "Ferrell is funny spouting his weird stream-of-consciousness rants, but too often the plot leaves him hanging and he resorts to just Yelling Really Loud.",
      "author": "Megan Lehmann"
    },
    {
      "text": "As much credit as Ferrell deserves for keeping this nonsense from slipping off the screen, Applegate deserves as well.",
      "author": "Jack Mathews"
    },
    {
      "text": "The desperate and frantic slapstick of Anchorman: The Legend of Ron Burgundy is closer to hysteria than hysterical.",
      "author": "Duane Dudek"
    },
    {
      "text": "What takes the whole thing pleasurably over the top, turning a goof into a total gas, is the film's pitch-perfect absurdist comedy and warmth.",
      "author": "Manohla Dargis"
    },
    {
      "text": "You're just left wishing that Tina Fey had lent a helping hand -- or that they'd wheeled in some old hands from the real '70s newsroom gender comedy, The Mary Tyler Moore Show.",
      "author": "Bob Strauss"
    },
    {
      "text": "Ferrell makes this a movie worth your money, and you'll leave the theater laughing.",
      "author": "Sam Sessa"
    },
    {
      "text": "It's one of those movies where every good joke is in the trailer, which was a hilarious two-minute spot that promised so much more than this sloppy, lazy effort manages to deliver.",
      "author": "Derek Tse"
    },
    {
      "text": "With the ability to throw all caution -- and sometimes all clothes -- to the wind, Ferrell has that unique ability to be both funny and vulnerable at the same time, a quality that makes him hard not to like.",
      "author": "Drew McAnulty"
    },
    {
      "text": "Anchorman would qualify as great popcorn entertainment, except that the popcorn will become a choking hazard because you'll be guffawing so much.",
      "author": "Louis B. Hobson"
    },
    {
      "text": "Overly broad humor with little on its mind.",
      "author": "Bruce Westbrook"
    },
    {
      "text": "Ferrell has an absolutely magical way of making complete morons lovable.",
      "author": "Tom Long"
    },
    {
      "text": "There are more misfires and dead spots than we'd prefer, but they're outweighed by many more moments that are riotously laugh-out-loud funny.",
      "author": "Jeff Vice"
    },
    {
      "text": "No need to make room for Anchorman in any cultural time capsule, but there are enough laughs to keep the movie from being canceled.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Always affectionate toward its people, especially when they are at their most ridiculous, Anchorman meticulously builds America's dimmest news team. And we root for them.",
      "author": "Michael Booth"
    },
    {
      "text": "It's 'Jane, you ignorant slut' all over again, but with less bite, a backstory, a romance and a host of celebrity cameos that promise more than they deliver.",
      "author": "Mary F. Pols"
    },
    {
      "text": "A lot of the time it's very funny.",
      "author": "Roger Ebert"
    },
    {
      "text": "Sloppy, crude, pursuing the most far-flung tangents in hopes of a laugh, Anchorman still gave me more stupid giggles than I'd care to admit if I weren't paid to.",
      "author": "Ty Burr"
    },
    {
      "text": "Although it has even less depth than its proudly one-dimensional hero, 'Anchorman' is frequently hilarious and full of delightful cameos by some familiar faces.",
      "author": "James Sanford"
    },
    {
      "text": "You finally got me, Will Ferrell. I surrender.",
      "author": "Rob Vaux"
    },
    {
      "text": "Half inspired and half a moronic exercise in brain stagnation.",
      "author": "Donald Munro"
    },
    {
      "text": "Nearly as offensive as it is funny.",
      "author": "Audrey Rock-Richardson"
    },
    {
      "text": "News Flash - it's not that funny!",
      "author": "Cherryl Dawson and Leigh Ann Palone"
    },
    {
      "text": "Anchorman works so well because Ferrell's persona fits flawlessly into this world of overgrown boys working men's jobs.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "No plot, no so-called redeeming social value and no desire to pluck the hearstrings, which is why it's superior to 'Elf.'",
      "author": "John Beifuss"
    },
    {
      "text": "Ferrell at the top of his craft...",
      "author": "JoBlo"
    },
    {
      "text": "Knights of Columbus! Wouldn't it be great if TV-based comedians weren't afraid of making movies that were funnier than they are?",
      "author": "Stephen Cole"
    },
    {
      "text": "These are obviously just stitched-together bits that these improv masters worked through until they got funny. Their dedication pays off more often than not, especially when the cast strives for outrageousness.",
      "author": "E! Staff"
    },
    {
      "text": "Anchorman is an absurd, stupid comedy that's a lot of fun and well worth checking out at the theater with friends.",
      "author": "Scott Chitwood"
    },
    {
      "text": "We really can't call this a sophomore slump. Does sophomoric slump work?",
      "author": "Sean O'Connell"
    },
    {
      "text": "You'll be more likely to scratch your head in puzzlement than to pull your mouth into a smile",
      "author": "Marty Mapes"
    },
    {
      "text": "Although great in small doses, Anchorman struggles to sustain its concept through feature length.",
      "author": "Jon Niccum"
    },
    {
      "text": "I hoped for far more laughs, a sharper edge to the humor and a comedy that would attain the rank of other SNL alum works such as Caddyshack.",
      "author": "Judith Egerton"
    },
    {
      "text": "Anchorman may be uneven, but Will Ferrell's Ron Burgundy is a character worth revisiting",
      "author": "Christian Toto"
    },
    {
      "text": "An enthusiastic, harmlessly silly celebration of the empancipation of the TV newsroom.",
      "author": "Susan Granger"
    },
    {
      "text": "This is a masterpiece of comedy, ready to be watched, re-watched, quoted and imitated for years to come.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Ferrell totally gets the anchorman of the 70s vibe and pulls off even the lamest lines without breaking a sweat",
      "author": "Rebecca Murray"
    },
    {
      "text": "[N]inety endless minutes of some of the most stunningly incompetent filmmaking I've ever seen...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Will Ferrell headlines a great comedy cast in a story that is as ridiculous as it is hysterical.",
      "author": "Jeff Otto"
    },
    {
      "text": "It's hardly breaking news to tell you Will Ferrell's funny, but Anchorman's flights of lunacy need a little more story to keep us engaged.",
      "author": "James Rocchi"
    },
    {
      "text": "Gags aren't allowed to develop; the characters are shuffled from location to location and from conflict to conflict without building momentum.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Captures the mood of a group of friends riffing, trying to make each other laugh with the most ridiculous nonsense they can think of",
      "author": "Fred Topel"
    },
    {
      "text": "Isn't as strong as Dodgeball or Starsky and Hutch primarily because the satire inherent in these flicks isn't paid as much attention to this time around.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "The humor of Anchorman is planted deep within a surreal 70s landscape where the jokes zing by so fast, you have zero time to ponder how out there they really are.",
      "author": "Erik Childress"
    },
    {
      "text": "While malapropisms and anachronisms do have their places in cinematic comedy, it's very tough to make them the foundation for a story.",
      "author": "Edward Havens"
    },
    {
      "text": "A 'Stupid Comedy' that gleefully celebrates the absurd and actually trusts its audience to be smart.",
      "author": "Collin Souter"
    },
    {
      "text": "The whole exercise has the smug feeling of a Kevin Smith film-- a cameo dumpster that doesn't even have the wit to kill Danny Trejo.",
      "author": "Walter Chaw"
    },
    {
      "text": "This is a wobbly comedy rooted too deeply in three- or four-minute TV-style set pieces, which misfire more often than not.",
      "author": "Larry Ratliff"
    },
    {
      "text": "It is not as maniacally uninhibited as Old School or as dementedly lovable as Elf, but its cheerful dumbness is hard to resist.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's a flat, dull picture marked by sporadic flashes of ridiculous brilliance.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Little more than an extended Saturday Night Live skit with better wigs, real locations and a script that sputters as soon as its one-joke premise is exhausted.",
      "author": "Terry Lawson"
    },
    {
      "text": "Hammers away at the same comedic notes like an 8-year-old pounding out 'Chopsticks' on a parlor piano.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Keeps re-establishing Ron's egomania with diminishing returns of cleverness. The film goes nowhere.",
      "author": "Philip Wuntch"
    },
    {
      "text": "For every gag that works, there's one that doesn't, and the story is too thin to keep us engaged otherwise.",
      "author": "Bill Muller"
    },
    {
      "text": "Partway through the uneven string of skits that comprises Anchorman: The Legend of Ron Burgundy, the film loses its mind completely.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "There is enough goofy humor to satisfy the guy in me but \"Anchorman\" has too many problems to propel it to the heights of Ferrell's recent vehicles.",
      "author": "Robin Clifford"
    },
    {
      "text": "That he can make his anchorman chauvinistic, deluded and ridiculous but still manage to give him some humanity is testimony to Ferrell's comic talents.",
      "author": "Claudia Puig"
    },
    {
      "text": "Even if it's not exactly dripping with substance, it's still one of the most distinct comedies to come out this year -- distinctly stupid at times, yes, but also with a fresh and funny voice of its own.",
      "author": "Phoebe Flowers"
    },
    {
      "text": "You're not laughing at anchormen. You're laughing at formula movie rituals blown sky-high.",
      "author": "David Edelstein"
    },
    {
      "text": "It's essentially a one-joke situation carried to a tedious length and Ferrell hardly runs away with his cliched part.",
      "author": "William Arnold"
    },
    {
      "text": "Burgundy is dim, vain and unrepentantly horny, but there is something so limited about him that he seems more pitiable than funny.",
      "author": "Bruce Newman"
    },
    {
      "text": "The barrage of very funny jokes makes up for any missteps, and by the end of the film you'll likely only remember the good parts.",
      "author": "Josh Bell"
    },
    {
      "text": "An engagingly knuckleheaded comic vehicle for former Saturday Night Live trouper Will Ferrell.",
      "author": "Steven Rea"
    },
    {
      "text": "essentially ninety minutes of name-calling and surprise cameos masquerading as comedy",
      "author": "Laura Clifford"
    },
    {
      "text": "I think Anchorman has the potential to achieve Austin Powers-like status as a highly quotable movie.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Ron may be an idiot, but Anchorman is no dope.",
      "author": "John Anderson"
    },
    {
      "text": "It's a long string of heavy-footed sight and sound gags that must have seemed a stitch at the drawing board, but made me squirm in my seat.",
      "author": "Ella Taylor"
    },
    {
      "text": "Dumb, dumber, dumberest!",
      "author": "David Sterritt"
    },
    {
      "text": "It's a cute, silly, likable movie without much weight or intensity, but it's also pretty funny.",
      "author": "Michael Wilmington"
    },
    {
      "text": "It solidifies Ferrell's place alongside Jim Carrey, Jack Black and, when called on, Johnny Depp, as our best comic actors.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "it seems like Ferrell can take just about any idea, however threadbare, and make it funny.",
      "author": "Austin O'Connor"
    },
    {
      "text": "Even though it feels the need to lapse into juvenile clowning around every once in awhile, Anchorman is still gonna make you laugh--hard.",
      "author": "Kit Bowen"
    },
    {
      "text": "Instantly quotable and destined for classic comedic status.",
      "author": "Nick Rogers"
    },
    {
      "text": "...Burgundy barely qualifies as a character. Better to think of him as a living one-liner, albeit a very funny one.",
      "author": "Josh Larsen"
    },
    {
      "text": "so many ways to go with something witty, sharp, or just plain fun . . .the filmmakers instead went with pointless, dull, obvious, and sophomoric",
      "author": "Andrea Chase"
    },
    {
      "text": "It's the kind of movie that makes you laugh despite yourself, its inconsistent dummheit redeemed by a try-anything approach that somewhat transcends the usual aura of a TV sketch stretched to feature length.",
      "author": "Steve Schneider"
    },
    {
      "text": "Good dumb fun can be lowbrow without being lazy, but bite-sized episodes of creative lunacy are not enough to qualify Anchorman as the kind of dumb worth paying to see.",
      "author": "Rob Blackwelder"
    },
    {
      "text": "The results may not be coherent, or even consistent, but they are often hilarious.",
      "author": "David Thomas"
    },
    {
      "text": "\"Anchorman\" is so deft and suave at selling us on its preposterousness that we give in, and laugh at the sheer gall of it all.",
      "author": "Steven Snyder"
    },
    {
      "text": "the movie succeeds because there are so many goofy little moments that rise up out of nowhere and catch you off guard.",
      "author": "Sean McBride"
    },
    {
      "text": "Will Ferrell shows that even he is not immune to looking bad when faced with bad material, even if it's his own. Possibly one of the worst directed films of the year.",
      "author": "Boo Allen"
    },
    {
      "text": "For a comedy set during the formative era of happy-talk news, Anchorman doesn't do enough to tweak the on-camera phoniness of dum-dum local journalism.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "This is one of the funniest movies of the year...",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Whether he's fighting Kodiak bears or throwing burritos at bikers, Ron Burgundy is the perfect outlet for Will's unique brand of sincere witticism.",
      "author": "Joshua Tyler"
    },
    {
      "text": "Anchorman is equally hilarious, appalling and intelligent, but couldn't the movie have a little more of the intelligent and hilarious?",
      "author": "Willie Waffle"
    },
    {
      "text": "Most of the comic sequences and satirical barbs in this comedy seem to have been recycled from the long ago past.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "A marginal entertainment with some greatly funny scenes definitely worth seeing, but is the rest of the movie worth wading through to get to them? Probably not.",
      "author": "Dustin Putman"
    },
    {
      "text": "Will Ferrell's commitment to sophomoric comedy is encroaching on religious zeal: \"Anchorman\" is Ferrell at his best.",
      "author": "David Foucher"
    },
    {
      "text": "A coarse, one-joke affair; Ron Burgundy might not have actually been an SNL skit, but 'Anchorman' sure feels like a movie based on one.",
      "author": "Frank Swietek"
    },
    {
      "text": "As parody, it's toothless and often smug, but as random Ferrellspeak generator, it has its delights.",
      "author": "Ed Park"
    },
    {
      "text": "Farrell carries the movie on his broad shoulders, nailing the character perfectly.",
      "author": "James Berardinelli"
    },
    {
      "text": "Ferrell has seized on a clever concept rife with possibilities -- namely, women breaking the glass ceiling in male-dominated TV news during the '70s -- and smartly surrounded himself with a topnotch cast.",
      "author": "Brian Lowry"
    },
    {
      "text": "Proving that even infantile humor can be funny, Anchorman: The Legend of Ron Burgundy does make you laugh even if you hate yourself for doing so.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "... the laugh ratio is about 50 percent, but that's still pretty good.",
      "author": "Richard Roeper"
    },
    {
      "text": "It's difficult to resist a hero who believes that the name San Diego, derived from German, means \"whale's vagina.\"",
      "author": "Nick Schager"
    }
  ],
  "release_year": 2004,
  "duration": 95,
  "genres": [
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "Hotshot television anchorman Ron Burgundy welcomes upstart reporter Veronica Corningstone into the male-dominated world of 1970s broadcast news -- that is, until the talented female journalist begins to outshine Burgundy on air. Soon he grows jealous, begins a bitter feud with Veronica and eventually makes a vulgar slip on live TV that ruins his career. However, when an outrageous story breaks at the San Diego Zoo, Ron may get a chance to redeem himself.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/mhZIcRePT7U8viFQVjt1ZjYIsR4.jpg"
}