{
  "movie_name": "Annihilation",
  "movie_id": "annihilation",
  "total_reviews": 333,
  "reviews": [
    {
      "text": "The brilliance of Annihilation is that it encourages conversation, it makes your brain itch whether you’re on your first, second, or third viewing.",
      "author": "Isabella Liistro"
    },
    {
      "text": "Masterfully mind-bending, Annihilation will draw you back in again and again, even when you might not understand exactly what happened.",
      "author": "Justin Kim"
    },
    {
      "text": "Annihilation does everything it can to side-step mainstream expectations. Distributed by Paramount Pictures and streamed by Netflix, this hybrid tentpole sci-fi adapted and directed by Alex Garland reflects the changing face of cinema.",
      "author": "Martin Carr"
    },
    {
      "text": "Great sci-fi is very rewatchable, and Annihilation qualifies; it may not be quite as strong as Ex Machina, but who cares?",
      "author": "Brendan Cassidy"
    },
    {
      "text": "Even with some high-concept brilliance, the confusing story and narration fail to hold the film together.",
      "author": "Kevin Carr"
    },
    {
      "text": "Like any great masterpiece, dismissal is inherent, but for those who enter The Shimmer, its effect is both numinous and real.",
      "author": "Justin Micallef"
    },
    {
      "text": "Alex Garland's trippy little cosmic horror film manages to awe, horrify and perplex all at the same time. A modern classic.",
      "author": "Trace Thurman"
    },
    {
      "text": "A cerebral mix of philosophy and science fiction, Annihilation features stunning production design, enigmatic and complex performances from its female cast, and a divisive (albeit perfectly in keeping with the narrative) ending. Sublime and surreal.",
      "author": "Joe Lipsett"
    },
    {
      "text": "With five female leads including Natalie Portman, this intelligent story featuring a bear scene as memorable as The Revenant's is unique in more ways than one.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "“We’re all damaged goods here.” This seemingly inconsequential line of dialogue is one of several keys to unlocking the secrets of Alex Garland’s trippy science-fiction mindbender.",
      "author": "Keith Garlington"
    },
    {
      "text": "What might be a smearing hindrance for some is a emblem of brilliancy to others, because the film could land either way,",
      "author": "Don Shanahan"
    },
    {
      "text": "For every moment of visceral horror, there are several more whose sublimity both haunts and astounds.",
      "author": "Brian Eggert"
    },
    {
      "text": "[Annihilation] balances being cerebral sci-fi with effective horror, compelling characters, and jaw-dropping visuals that will brand themselves into your brain.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Annihilation proves writer/director Alex Garland's exhilarating filmmaking style is a breath of fresh air to the science-fiction genre and Hollywood altogether.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "Comparisons to H.P. Lovecraft's seminal The Color Out of Space are very valid, but Annihilation has its own story to tell.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Garland's film is a taut, terse, and macabre ecological horror thriller.",
      "author": "Toussaint Egan"
    },
    {
      "text": "Just science fiction at its best. It's got great performances, great color, good music, and more than a few mind-blowing reveals.",
      "author": "Nicholas Oon"
    },
    {
      "text": "There are moments where its reach outdoes its grasp but I'll take that any day over a Transformers movie that just gobbles up everything like a maelstrom of mindless metal shards.",
      "author": "Jason Adams"
    },
    {
      "text": "I truly enjoyed every single moment of this film... once you understand what the story's about and the deeper meaning behind Natalie Portman's character. the story is just a beautiful package, beautifully sold.",
      "author": "Emma Wolfe"
    },
    {
      "text": "From annihilation comes absolution. You can hardly have one without the other.",
      "author": "Michael J. Casey"
    },
    {
      "text": "A visually gorgeous movie following a group of women on a quest. A nuanced looked at women in the sci-fi genre.",
      "author": "Rosa Parra"
    },
    {
      "text": "Starts off slowly but becomes more scary and suspenseful as it goes along.",
      "author": "Jason Best"
    },
    {
      "text": "This triumphant, devastating, unknowable sci-fi defies the explanation it cries out for, even as it invites you to suggest more.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "The cast is exceptional, portraying relatable, sympathetic souls marching through biological wonders and terrors, which feature stunning set designs and decorations.",
      "author": "Mike Massie"
    },
    {
      "text": "A polarizing film that may leave you with more questions than answers, but boy did I love it.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "A sci-fi gem that is destined to become a modern-day classic.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "With ultimate faith toward his audience, Garland asks the questions and empowers the audience to discover the answers.",
      "author": "Richard Propes"
    },
    {
      "text": "A pure hit of hard sci-fi which provides one hell of a trip.",
      "author": "Andrew Gaudion"
    },
    {
      "text": "\"Annihilation\" boasts an intriguing premise and plenty of creative existential ideas, but ultimately gives into blockbuster impulses that pale in comparison to the indie gold of \"Ex Machina.\"",
      "author": "Jason Fraley"
    },
    {
      "text": "Yes, it's weird, but in a soul-searchingly haunting way that shares DNA with Arrival, particularly its non-linear structure revealing Lena's love life, spliced with alien first contact.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "Seeing five women dominate the screen initially felt like a victory.",
      "author": "Mimi Wong"
    },
    {
      "text": "The majority of the movie is told in flashbacks with Natalie Portman's character as the sole POV, and her blandness gives the audience no emotional investment in the outcome of her tale.",
      "author": "Scott Phillips"
    },
    {
      "text": "[A]bsoultely overwhelming.",
      "author": "Matt Cipolla"
    },
    {
      "text": "More strange, cryptic, cerebral science fiction that takes multiple encounters to fully unwrap, please.",
      "author": "Brent McKnight"
    },
    {
      "text": "Annihilation, Alex Garland's sophomore effort, is every bit as astounding as his freshman one, Ex Machina.",
      "author": "CJ Sheu"
    },
    {
      "text": "Annihilation is an intelligent and frightening cinematic experience. It's also bound to be polarizing in that way that only smart science fiction can.",
      "author": "Damond Fudge"
    },
    {
      "text": "Annihilation works as much for the few moments of genuine terror as it does for the fascinating conversations that occur as these women use their skill sets to deduce what is going on around them.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Annihilation shares the ambiguous dream logic found in David Lynch's best work, but mixes it with the type of horrific imagery seen in Alien and The Thing.",
      "author": "Victor Stiff"
    },
    {
      "text": "A seriously intelligent, and visually stunning, picture that benefits from its bold structure and dedicated female cast.",
      "author": "Peter Gray"
    },
    {
      "text": "Annihilation is a smart and intelligent movie. It's super ambitious and maybe a bit tedious. The movie requires patience and at times gets a bit too showy.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Even as it relies on horror tropes for shape Annihilation's mission is to plumb the depths of Lovecraftian existential fear.",
      "author": "Chris McCoy"
    },
    {
      "text": "Annihilation is a shining example of what scifi can be when the narrative hinges on one woman and the world-altering decision she must make: Do I save my world, or not?",
      "author": "Aly Caviness"
    },
    {
      "text": "Annihilation is a puff from one of the year's most cataclysmically up-tempo strains of synthetic sci-fi devastation.",
      "author": "Matt Donato"
    },
    {
      "text": "A strange, gloriously ambiguous visual wonder.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Annihilation is now permanently intertwined with my cinematic DNA and I suspect I'll be pondering aspects of this story until the end of recorded time.",
      "author": "Kate Rodger"
    },
    {
      "text": "The story reverberates, echoing through the characters' skin and voice and very sense of being.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Annihilation is complex, terrifying, engrossing, and beautiful, but above all, it feels completely unique.",
      "author": "Karl Delossantos"
    },
    {
      "text": "It is a great science fiction film in which the author takes a step forward regarding what he had already offered us in Ex Machina. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "The best piece of the decade among its contemporaries, and one of the bests in the history of this eternal genre. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Garland is trying to make a serious, intelligent, complex science fiction movie, but his characters end up being puppets that fall into the traps that the filmmaker creates. [Full Review in Spanish]",
      "author": "Juan Luis Caviaro"
    },
    {
      "text": "A metaphoric mind-bender that will find favor with select moviegoers while absolutely alienating everyone else.",
      "author": "Matt Brunson"
    },
    {
      "text": "Annihilation is strange in the most complimentary form of that descriptor. It is borderline profound, a singular experience and the kind of escapist fiction that truly liberates audiences from the oppressive weight of mundane reality.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Takes us into a whole new world and abandons us to our own devices, making for a cinematic experience that is as compelling as it is frustrating.",
      "author": "Mattie Lucas"
    },
    {
      "text": "A strong second half and climax make it a worthwhile experience for any science fiction enthusiast.",
      "author": "Grant Watson"
    },
    {
      "text": "Annihilation is the best kind of smart science fiction with stunning cinematography, creepy-as-hell visuals, and great performances by the lead cast.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Despite being suspenseful, the journey to uncover the mysteries is slow and disconnecting primarily due to not giving depth to the minor characters.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Through its ambience, which meticulously blends dread and wonder, Annihilation skillfully builds up to a super trippy, creepy, existentialist crescendo.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "Garland creates a wildly surreal and frighteningly real space, where everything's caught in the cyclical flow of nature between creation and destruction, life and death.",
      "author": "C.H. Newell"
    },
    {
      "text": "A sci-fi horror film with a lot more emphasis on the sci-fi rather than the horror, and it's very good!",
      "author": "Marianna Neal"
    },
    {
      "text": "There is a sequence that is as creepy and terrifying as any sequence I've seen in the last four or five years.",
      "author": "Dan Murrell"
    },
    {
      "text": "Alex Garland's Annihilation is an excepcional and surreal science fiction film that reflects deeply about life, death and facing otherness with paranoid dread. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "Annihilation is filled with terror, massive filmmaking on a grand scale, and it doesn't look down its nose at its genre. You'll be in awe of its wonder.",
      "author": "Preston Barta"
    },
    {
      "text": "It's all a metaphor involving a small group of suicidal women who are sent to on the most a critical planet saving mission. The movie like the mission was never going to succeed.",
      "author": "Alachia Queen"
    },
    {
      "text": "It was pretty but kind of a grueling experience and for what?",
      "author": "Rachel Wagner"
    },
    {
      "text": "Annihilation is an ambitious and intellectual film that matches its rich themes of environmentalism, memory, and self-destruction with visceral horror and an emotional sucker punch of an ending.",
      "author": "Katie Goh"
    },
    {
      "text": "It's excellent, a moviegoing experience unlike anything we're likely to see again anytime soon.",
      "author": "Allen Adams"
    },
    {
      "text": "Fusing elements of Alien, Predator and Arrival, Annihilator is a dark-tinged equation whose resolution whets our appetite for the upcoming sequels.",
      "author": "Filipe Freitas"
    },
    {
      "text": "It's worth a watch in theaters, but I would just caution to expect for a very heavy, and thought-provoking film.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Portman's trek might as well be across the landscape of genre history: It begins with a pulp-magazine-worthy attack by a monster alligator and ends with a trippy '2001'-like alien encounter.",
      "author": "John Beifuss"
    },
    {
      "text": "Concept aside, it's Mark Digby's production design and Rob Hardy's cinematography that really make the film, along with an atmospheric score...",
      "author": "Jennie Kermode"
    },
    {
      "text": "No film this year burrowed deeper into my consciousness this year than ANNIHILATION. Top that truly mindbender of a plot with excellent acting, beautiful visuals, and an awesome score and you have film at the height of its power.",
      "author": "Tim Stevens"
    },
    {
      "text": "Allusions to the ritual of spirituality and the doctrine of science, from sinners to global warming to feminism to gender roles. The aspirations are grand, but what does it all mean?",
      "author": "Louisa Moore"
    },
    {
      "text": "It's an odd, intoxicating film with a score that will invade your bloodstream, a breathtaking third act, and a puzzle-box ending that rewards multiple viewings.",
      "author": "Sean Fennessey"
    },
    {
      "text": "Annihilation is a darn fine work of science-fiction cinema, one that steadily improves as its plot gets increasingly weird, unhurried, and abstract.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "The visuals are stunning, the performances strong, but I found the final act underwhelming and a bit less interesting than I would have liked. Annihilation is good but I'm not sold on its greatness.",
      "author": "Brian Gill"
    },
    {
      "text": "The ending is so exhilarating that it made me forget about every flaw that came before it.",
      "author": "Kent Garrison"
    },
    {
      "text": "This film is ambitious, messy, moving, horrifying, and often times incomprehensible. Each layer is slowly revealed until it gets to the glowing center and there is nothing you can do but shield your eyes from the light of its revelations.",
      "author": "Michelle Kisner"
    },
    {
      "text": "A horticultural dream and a zoological nightmare, Garland's terrifying film gets under your skin, leaving lots of unanswered questions. The performances, even up against its grand and unknowable ideas, lift it even higher.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Annihilation is a fascinating exploration of vibrant and captivating ideas that will challenge filmgoers in the best ways possible.",
      "author": "Kt Schaefer"
    },
    {
      "text": "Garland creates an atmosphere which feels deliberately distorted and diaphanous, as if we are viewing the world through a soap bubble...",
      "author": "Joel Mayward"
    },
    {
      "text": "Alex Garland's Annihilation is a mind-bending, visually transfixing, and narratively compelling film that will leave you unsure of what you just watched.",
      "author": "Katie Awad"
    },
    {
      "text": "Annihilation is a visionary film that pushes the boundaries of the human imagination. Garland has yet again proven that he is not only a talented screenwriter, but an even more talented director.",
      "author": "Molly Henery"
    },
    {
      "text": "Marries elements of smart science fiction and toe-curling stabs of horror to tell a heady, intellectual creation myth.",
      "author": "Matt Oakes"
    },
    {
      "text": "Generally speaking, Garland manages his genre/arthouse balancing act smoothly without undervaluing either aesthetic.",
      "author": "PJ Nabarro"
    },
    {
      "text": "It's smart, it's gorgeous looking, full of great actors and well directed with a uniquely-elusive tone between Andrei Tarkovsky, Ken Russell and Alan Moore's Swamp Thing",
      "author": "Bob Chipman"
    },
    {
      "text": "Between the creatures and the bizarre landscapes within the Shimmer, Annihilation is filled with striking and horrific visuals unlike any science fiction film of recent memory",
      "author": "Sean Mulvihill"
    },
    {
      "text": "It will either encapsulate you or bore you to tears, luckily I found it to be pretty damn good.",
      "author": "Matt Hudson"
    },
    {
      "text": "I admire its sophistication and ability to tell such a human story with so much intelligence, taking on issues of the Anthropocene with a dexterous and effulgent vision.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Annihilation may be the scariest horror film of 2018, or is it too intellectual for audiences?",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "Garland displays an ability to mix big ideas, stunning sci-fi, incredible images, and gruesome violence in a way that few can.",
      "author": "Joey Magidson"
    },
    {
      "text": "The ambitious nature of the film is present early, and the structure's unconventional nature gives him the ability to inform the audience of backstory at his own pace.",
      "author": "Alan French"
    },
    {
      "text": "A weirdly brainy and scary film.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "I appreciated how Garland tried to shoot higher, but I don't think he stuck the landing at all.",
      "author": "Brandon Collins"
    },
    {
      "text": "It's beautifully shot, and the score really adds something to it...the ominous tone throughout this film adds something to it, though it is a little too long.",
      "author": "Justin Brown"
    },
    {
      "text": "Annihilation won't be for everyone, but those willing to give it a chance will be treated with sci-fi they can sink their teeth into a la Arrival or Under the Skin.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Annihilation is part of that rare sci-fi breed, like Blade Runner 2049 and Arrival before it, the film uses an improbable and far-fetched future to explore humanity from a new perspective...",
      "author": "Akhil Arora"
    },
    {
      "text": "It's a thrilling, original, relentlessly disquieting existential nightmare of a movie.",
      "author": "Adam Epstein"
    },
    {
      "text": "It's an exploration of the weight of our own mistakes. How the choices we make, and the things we can't change, fundamentally change us.",
      "author": "Robert Daniels"
    },
    {
      "text": "Unfortunately for me, it was more bad than good.",
      "author": "Terence Johnson"
    },
    {
      "text": "This is a movie that is more about thinking than twists, about its ideas rather than its special effects (although they are beautiful). It is directed with patience and a command of tone.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Has enough star power who all give great performances along with a visual splendor from beginning to end.",
      "author": "Rendy Jones"
    },
    {
      "text": "Annihilation is a visceral sensory experience that chills the blood and makes the skin crawl (literally), leading to a bravura conclusion that would make Tarkovsky proud and any jaw drop.",
      "author": "Kambole Campbell"
    },
    {
      "text": "At best, it revels in a sense of creeping dread, loss of ownership over yourself, and the fear of experiencing without understanding.",
      "author": "Molly Templeton"
    },
    {
      "text": "Due to a mercifully sane run length, I think it would actually benefit from multiple viewings. \"Annihilation\" is cerebral, but even more, it is fleshy and makes your skin crawl, and those moments are even more effective than the mind-bending ones.",
      "author": "Asia Frey"
    },
    {
      "text": "Through most of the film, you spend your time wondering, \"why don't they just...?\" and \"Who would really do that?\"",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "There are many questions raised in this enthralling psychological drama that begins with a meteor strike, a shimmer and a secret mission to a terrifying but wondrous world where astonishing possibilities are on display. Don't miss it!",
      "author": "Louise Keller"
    },
    {
      "text": "... it's a film so unexpectedly unique that it deserves to be seen by everyone at least once.",
      "author": "Bea Gutierrez"
    },
    {
      "text": "Natalie Portman and her team at least escape the mommy-ism of Gravity and Arrival, in which sci-fi heroines had to fret over their children. What they don't escape is the rampant backstory-mongering of genre movies starring women.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "\"Annihilation\" is the real deal, doing what science fiction and horror are supposed to do, speaking dark truths about our condition while planting seeds of dread in fertile imaginative soil.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Definitely fills the void for fans of vague universal doom and evolutionary paranoia.",
      "author": "Jon-Carlos Evans"
    },
    {
      "text": "Here is a movie so thoroughly realized, so utterly entrenched in the harrowing ordeals of its characters, that their struggles touch on the very nervous system of our need to endure.",
      "author": "David Keyes"
    },
    {
      "text": "The visuals are astounding, and the when the story dives headlong into examinations of self and self-destruction, the movie really takes a leap.",
      "author": "Joe Reid"
    },
    {
      "text": "This train wreck substitutes incoherence for cosmic mystery. My advice is to read Jeff VanderMeer's novel, watch Alex Garland's first movie Ex Machina, and pretend that the movie version of Annihilation never happened.",
      "author": "Annalee Newitz"
    },
    {
      "text": "[Garland] has made a film that lingers in the mind, despite its flaws. I'll happily make a repeat visit to the Shimmer, looking for more answers.",
      "author": "Adrian Hennigan"
    },
    {
      "text": "an absorbing, frequently powerful, and at times insightful film that smartly deploys its sci-fi trappings to keep us engaged while leaving us with just the right touch of ambiguity to chew on afterwards",
      "author": "James Kendrick"
    },
    {
      "text": "Alex Garland beautifully subverts cliches of both fantasy and horror genres, making a film that gets under the skin to properly freak us out",
      "author": "Rich Cline"
    },
    {
      "text": "A gripping sci-fi spectacular that's richly designed and filled with modest philosophical questions.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Garland has built a perturbing allegory to process the anxieties of living in a world where the technological links appear to prefer totality over the individual. [Full Review in Spanish]",
      "author": "Mauricio González Lara"
    },
    {
      "text": "A potent and suspenseful trek into heady sci-fi.",
      "author": "John Serba"
    },
    {
      "text": "The ending, cryptic, meaningless and with the worst CGI of the entire film, buries it all and confirms any doubts; the film is a robbery that looks more interesting than it is. [Full Review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Garland, well supported by the imaginative production design Mark Digby and the work of five special effects companies, has directed a worthy film of adventure, horror and existential reflection. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "Wildly ambitious, occasionally alienating, and consummately perplexing; an irritant to the mind and spirit that demands self-reflection.",
      "author": "Haleigh Foutch"
    },
    {
      "text": "Absorbing and hypnotic, Annihilation is the best kind of sci-fi film - the kind that challenges and subverts the genre, all the while introducing new ideas that you'll see in films to come.",
      "author": "Wenlei Ma"
    },
    {
      "text": "It's certain that the astonishing special effects would have worked better on a larger cinema screen, and it's a shame to lose their impact. But the dialogue is clunky and the plot disjointed.",
      "author": "Lucy Hunter Johnston"
    },
    {
      "text": "Annihilation is almost certainly a film which will demand and reward repeated viewings.",
      "author": "Paul Mount"
    },
    {
      "text": "Intelligent, original and exactly what Hollywood really needs right now.",
      "author": "Amelia Navascues"
    },
    {
      "text": "It's a film that makes people think, meditate. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "...the most Carpenterian film in recent years. [Full Review in Spanish]",
      "author": "Roger Salvans"
    },
    {
      "text": "The film intelligently plays between the past and the present, in both cases with exceptional art direction. [Full Review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "Annihilation is a great movie; complex, polyhedral and open to new readings in subsequent viewings. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "The more familiar aspects of Annihilation are enlivened by the entirely female dynamic, who seldom conform to simplistic group archetypes.",
      "author": "Tara Brady"
    },
    {
      "text": "Rich and intriguing, with many memorable tableaus and at least one outstanding sequence, destined to be known henceforth as \"the chair and the bear\".",
      "author": "Ed Whitfield"
    },
    {
      "text": "An exciting, imperfect genre success.",
      "author": "Simran Hans"
    },
    {
      "text": "A challenging sci-fi masterpiece that demands multiple viewings.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Gina Rodriguez steals the show with a standout performance.",
      "author": "Kayla Kumari Upadhyaya"
    },
    {
      "text": "Annihilation is science fiction that is unashamed to be weird and disturbing. There's a market for that, though it may not be a mass one.",
      "author": "Alex Doenau"
    },
    {
      "text": "Tantalizing \"Annihilation\" fails to come together.",
      "author": "Charles Koplinski"
    },
    {
      "text": "A science fiction that combines aliens and monsters to discuss depression, suicide and self-transformation. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "It's audacious stuff, topped by a lovely twist ending, and deserving of more than a casual skim through on an iPad.",
      "author": "Kevin Maher"
    },
    {
      "text": "[It] may feel familiar but in ways that are intentionally unsettling.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Well-done science fiction, artful and glimmering special effects, a script that unfolds its secrets carefully so that you are constantly surprised at each new revelation and, finally, a delicious sense of creepiness throughout, I highly recommend this.",
      "author": "Diane Pershing"
    },
    {
      "text": "An ambitious film with a fabulous feminine ensemble, solid ideas, diluted in the imperious need to be condescending with the audience. [Full review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "You're left feeling that somewhere there's a killer punch that never gets unleashed. Still, if you're a Netflix subscriber, this is an agreeable little bonus package.",
      "author": "Adam Sweeting"
    },
    {
      "text": "An extraordinary work of science fiction that owes a great debt to Tarkovsky. [Full review in Spanish]",
      "author": "Jorge Iván Morales"
    },
    {
      "text": "The film might lose a certain humanism in its devotion to such formalism, and the very underhanded, un-Tarkovskian way it doesn't explicitly ask the questions it is asking, but Annihilation isn't defiantly anti-humanist, either.",
      "author": "William R Clark"
    },
    {
      "text": "Writer-director Alex Garland is certainly carving out a niche for himself, with movies in which people literally carve into themselves (or others) to check if they're still human.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Highly recommended viewing, a patient puzzler that invites comparisons to Solaris and Arrival in how it sees the deeply personal collide with the incomprehensible.",
      "author": "Steve Newall"
    },
    {
      "text": "Once again, Garland offers a provocative and reflective take on the apocalypse, with better-than-blockbuster special effects realized on a relatively low budget.",
      "author": "Daniel Barnes"
    },
    {
      "text": "Garland's vision extols each theme with a detailed staging in which it seems that very few things are left to chance. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Drawing on mythology and body horror, Annihilation is an intelligent film that asks big questions and refuses to provide easy answers. Sci-fi at its best.",
      "author": "Jonathan Pile"
    },
    {
      "text": "It's one of the most stunning displays of directorial vision in recent memory, sure to be a classic of the genre in the years to come.",
      "author": "Rohan Naahar"
    },
    {
      "text": "A spectacular work of science fiction that not only gets under your skin but it becomes part of it.",
      "author": "Cameron Williams"
    },
    {
      "text": "The movie's tug-of-war between thrills and fuzzy philosophical waxing results in something much too close to a zero-sum game.",
      "author": "J. Olson"
    },
    {
      "text": "Paramount executives were concerned Garland's movie was \"too intellectual\" and \"too complicated\" to appeal to wider audiences. What rubbish - Annihilation is the thrilling, smart science-fiction movie you need in your life.",
      "author": "James Croot"
    },
    {
      "text": "Quietly, pervasively uncomfortable.",
      "author": "Tim Brayton"
    },
    {
      "text": "Portman's high-tension acting, her inability to relax, suits the material down to the ground. It's one of her best performances ...",
      "author": "Tim Robey"
    },
    {
      "text": "A provocative, brainy sci-fi/horror spectacle, that lingers for quite some time. Can't wait to see it again. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "This sci-fi/horror hybrid is brainy, challenging, and experimental. Those shouldn't be dirty words.",
      "author": "Jason Bailey"
    },
    {
      "text": "This movie is crazy...I like horror movies, and this movie scared me so, so much.",
      "author": "Steph Cozza"
    },
    {
      "text": "A film this meticulous and poignant will have a life of its own, because it is about life itself.",
      "author": "Jonathan Dean"
    },
    {
      "text": "This is a film that, while gorgeous on a surface level, becomes something far more impressive as the layers are peeled away.",
      "author": "Garry McConnachie"
    },
    {
      "text": "Annihilation does offer enough surreal horror within its visual spectacle to make it worth recommending to sci-fi fans, but I can't help but feel that it is fairly empty thematically.",
      "author": "Alistair Ryder"
    },
    {
      "text": "...like all the best horror, Annihilation is steeped in character, mood, and ideas.",
      "author": "Travis Johnson"
    },
    {
      "text": "That verdant blend of Giger and Carpenter is fantastic, but what will really stay with you is the effect all this has on the characters.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "Though the film veers away greatly from the original text, the dreamy ambience of the book is very much intact.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "Top-notch sci-fi and a chilling allegory for humanity's capacity for self-destruction.",
      "author": "Adam Woodward"
    },
    {
      "text": "Garland's ambition occasionally outstrips his execution but Annihilation is nonetheless proper, intelligent sci-fi.",
      "author": "Christopher Machell"
    },
    {
      "text": "'Annihilation' draws you in, teasing you with hints, but - like many recent science fiction offerings - frustrates audiences by obscuring its answers and cloaking them in ambiguity.",
      "author": "Bob Bloom"
    },
    {
      "text": "2018's first masterpiece.",
      "author": "Bob Grimm"
    },
    {
      "text": "What this movie does have are some solid characters. These are soldiers in a war against an unknown enemy. Like a band of brothers in a war movie, the team forms its own identity, based on the personality of its leader and its members.",
      "author": "Robert Roten"
    },
    {
      "text": "Annihilation is sad, upsetting, scary, mystifying, and destined for debate.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Sinister, shimmering sci-fi thriller that challenges audiences with cosmic molecular science....",
      "author": "Susan Granger"
    },
    {
      "text": "A strangely intoxicating mind-trip of an adventure that relies more on sound, feel, and sight than it does on providing answers to the perplexing questions at its heart",
      "author": "Frank Wilkins"
    },
    {
      "text": "Here as in Ex Machina (2015), Garland's creative élan comes from his merging of sleek conceptual art and messy, juicy drama.",
      "author": "Michael Sragow"
    },
    {
      "text": "Garland's version is a worthy mutation.",
      "author": "J. R. Jones"
    },
    {
      "text": "Garland, one of the smartest directors making speculative fiction films today, fills his screen with terrible beauty.",
      "author": "Richard von Busack"
    },
    {
      "text": "You might like this misguided mess of a fantasy if you like movies that keep their secrets so well, for so long, that the stakes lessen and you stop caring.",
      "author": "Michael Smith"
    },
    {
      "text": "Unlike most simplistic, tidy, instantly disposable Hollywood sci-fi fare, this one doesn't spoon-feed. It Kubricks us.",
      "author": "Stephen Rebello"
    },
    {
      "text": "[Alex Garland has] perfected an atmospheric cocktail of foreboding music, the threatening half-dark of twilight, and mysterious characters who bury secrets.",
      "author": "Janet Smith"
    },
    {
      "text": "What's impressive is Annihilation's willingness and ability to evoke the soul-sickness that leads to great moments of art, great moments of self-destruction, and an equation of the two.",
      "author": "Walter Chaw"
    },
    {
      "text": "\"You don't get it\" is a more strategic posture than \"Nothing to see here.\" But the latter is where I ended up, exhausted by the journey and bored by its conclusions.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Writer/director Alex Garland delivers a striking and impressively captivating opening stretch that instantly captures the viewer's attention and interest...",
      "author": "David Nusair"
    },
    {
      "text": "The movie may be cerebral, but it also packs a gut punch.",
      "author": "M. Faust"
    },
    {
      "text": "There's some grisly predation-metastasized nature's red in fang and claw-but the clearest message here concerns the constancy of change.",
      "author": "Brian Gibson"
    },
    {
      "text": "It's heady sci-fi horror, with plenty of analogies to ponder, and some truly gorgeous imagery.",
      "author": "Al Hoff"
    },
    {
      "text": "Despite The Shimmer, this movie certainly doesn't shine.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Making movies steeped in vagueness these days is proving to be an excellent way to earn critical praise, but being artfully ambiguous strikes me as a way to cover for not being able to finish the job.",
      "author": "Kyle Smith"
    },
    {
      "text": "It's a mind-bending film, and one that also plays with warping the medium as well, especially during its final act.",
      "author": "Gary Dowell"
    },
    {
      "text": "It's a must-see for anyone who loves the truly speculative side of science fiction.",
      "author": "Margot Harrison"
    },
    {
      "text": "This is a film that is both disturbing and provocative, leaving viewers to draw their own conclusions.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "When Lena ventures into that hole in the floor of the lighthouse, the worlds she opens up are truly astounding. We might even say they're worth the trip.",
      "author": "Kelly Vance"
    },
    {
      "text": "This is one of those films that will require six or so viewings before it starts to make sense.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "I'm not exactly sure what to make of this movie but I can't seem to shake it.",
      "author": "Sean Burns"
    },
    {
      "text": "Annihilation's commitment to older psychoanalytic (and deconstructionist) models for the self and its inexpressible shadows makes this a readily accessible drama of emotion.",
      "author": "Jo Livingstone"
    },
    {
      "text": "...boldly marches into formidable territory, where it might be out of its depth.",
      "author": "Josh Larsen"
    },
    {
      "text": "It is scary, thrilling, fascinating and beautiful - all at the same time.",
      "author": "Danny Minton"
    },
    {
      "text": "'Annihilation' is an art-house science-fiction story.",
      "author": "Linda Cook"
    },
    {
      "text": "Annihilation is some heady nightmare fuel, but its most striking quality may be how little it has in common with the current trends in mainstream science fiction.",
      "author": "Alison Willmore"
    },
    {
      "text": "The kind of film that made me stand around outside the theater as it closed for thirty minutes with my friends talking about it.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Annihilation is a thing of immense beauty and intoxicating complexity.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Annihilation is a remarkable achievement. It lingers, burned into your thoughts, branded on the brain. It is nothing short of a masterpiece, and the fact that it exists at all is something worth celebrating.",
      "author": "Chris Evangelista"
    },
    {
      "text": "In this numbingly ludicrous science-fiction drama, written and directed by Alex Garland, a talented cast of actors play undeveloped characters delivering leaden dialogue in a haphazard story that's filmed with a bland slickness.",
      "author": "Richard Brody"
    },
    {
      "text": "...an inscrutable sci-fi excursion that is filled with tension and outstanding special effects and production design without making a bit of sense...like going to a whodunit and when the movie ends not having a clue whodunit.",
      "author": "Tony Medley"
    },
    {
      "text": "It's always grand to hear Crosby, Stills and Nash in any movie, and their \"Helplessly Hoping\" here brings a meaningful and calming beauty to it all.",
      "author": "John Urbancich"
    },
    {
      "text": "Portman is painfully restrained in the lead role, looking upon biological impossibilities and mutilated corpses with the same distant curiosity.",
      "author": "Kristy Puchko"
    },
    {
      "text": "A challenging, rich science fiction film that rewards patient audiences, although many will find the film tough to follow.",
      "author": "Alan Cerny"
    },
    {
      "text": "This movie, unlike something produced for mass audiences, is about what happens in the calm moments between the loud, splashy sequences.",
      "author": "James Berardinelli"
    },
    {
      "text": "Annihilation is a demented science-fiction comic book of a movie that makes less sense than a butterfly mating with a buffalo.",
      "author": "Rex Reed"
    },
    {
      "text": "Very much about trust within a marriage between equals as outside forces of alienation weigh on them. It's two pictures, but best big and loud, strange and now.",
      "author": "Ray Pride"
    },
    {
      "text": "Alex Garland's second directorial outing after the excellent Ex Machina, this brainy, metaphysical sci-fi is even more ambitious and more amazing. But its challenging conclusion could be a hard sell.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Annihilation titillates the eyes of adrenaline junkies while also appealing to the flawed hearts of lovers.",
      "author": "tt stern-enzi"
    },
    {
      "text": "When it comes to real comic inspiration, it never passes Go and does not collect $200.",
      "author": "Randall King"
    },
    {
      "text": "This is a world one wants to crawl inside and live in for hours, maybe even days, at a time, the dangers of doing so almost secondary to the naturalistic discoveries and environmental truths that could potentially be revealed.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Garland's Annihilation is disturbing. Not the whole way through, maybe, but there's at least one scene that qualifies as high-octane nightmare fuel...Annihilation is well-made and absorbing, and yet still not quite its own thing in the end.",
      "author": "Adam Nayman"
    },
    {
      "text": "A wild and bizarre singular vision from Garland ... and exhilarating if you're here for it. Confounding if you're not.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "Annihilation is the kind of film that will endure the test of time, even as it no doubt fades away quickly at the multiplex, and confirms Alex Garland as one of the most exciting new filmmakers working today.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Garland has a gift for locating the horror inside that silliness, and this is what gives the film such a kicky, off-center quality. You laugh at it and gasp at it simultaneously.",
      "author": "Peter Rainer"
    },
    {
      "text": "The result is a film that has the feel of brainy, high-end science fiction, but ultimately neither the underlying structure nor content. It's a shame, given that we are in the midst of a modest heyday for the subgenre.",
      "author": "Christopher Orr"
    },
    {
      "text": "Annihilation feels wholly unexpected and raw. It is a disturbing film for reasons that are almost metaphysical.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Annihilation maintains a persistent sense of tension that keeps things compelling and will leave you wondering if you need to see it again (or just go read the source material) to make sure you understood what you just saw.",
      "author": "Josh Terry"
    },
    {
      "text": "Basic elements shatter and recombine in ways that, like the movie, startle and intrigue without ultimately cohering.",
      "author": "Robert Denerstein"
    },
    {
      "text": "On a purely visual, and visceral, level, Annihilation is haunting and memorable.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Garland would have done well sticking with either fantasy or sci-fi, but half-assed both.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Heavy on atmosphere, light on content. Derivative sci fi murk and chronological mush.",
      "author": "James Verniere"
    },
    {
      "text": "Annihilation is a portentous movie, and a cerebral one. It's gorgeous and immersive, but distancing. It's exciting more in its sheer ambition and its distinctiveness than in its actual action.",
      "author": "Tasha Robinson"
    },
    {
      "text": "The problem with Annihilation isn't that it's too heady; it's that it's not heady enough.",
      "author": "Rain Jokinen"
    },
    {
      "text": "While brilliant at times it feels like a hodgepodge collection of scenes and elements from past sci-fi films that starts off promisingly but loses steam as it unfolds. (Full Content Review for Parents also available - Violence, Profanity, Sex, etc.)",
      "author": "Jim Judy"
    },
    {
      "text": "Annihilation is the best kind of cinematic experience, one that floods the senses without battering them into submission, and one that moves the mind and heart without manipulating them. It's a staggering thing to witness.",
      "author": "Ned Lannamann"
    },
    {
      "text": "Writer-director Alex Garland continues his assault on human specialness (and humanity in general), this time going so far as to loop in the self among the parts of us subject to genetic malleability.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Portman smoothly conveys both delicate intellect and physical strength, a tough combination to pull off, while Jason Leigh is terrifyingly serene. Rodriguez, in stark contrast to her Jane the Virgin roots, was born to play an action heroine.",
      "author": "Anne Cohen"
    },
    {
      "text": "The movie plays like a dream, at times verging upon a nightmare as layers of the unknown peel back to reveal something both completely alien and horrifyingly familiar.",
      "author": "Karen Han"
    },
    {
      "text": "Alex Garland has now made two of the finest science fiction films of the 2010s, and cements himself as one of the most exciting filmmakers in the genre.",
      "author": "Ross Bonaime"
    },
    {
      "text": "Ex Machina director Alex Garland adapts Jeff VanderMeer's terrifying best-seller in Annihilation and offers a terrifying expedition into the unknown with a cast led by Natalie Portman.",
      "author": "Rick Marshall"
    },
    {
      "text": "Everything a modern science fiction film should be ...",
      "author": "Christian Toto"
    },
    {
      "text": "In this recent wave of sci-fi films, it's one of the best.",
      "author": "Brian Tallerico"
    },
    {
      "text": "\"Annihilation\" may not leave you satisfied, but if you're not afraid to get a little weird, it's a movie you won't forget.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "There's a lot of Tarkovsky in Annihilation, too much to be screened on the local multiplex. And that's just one of the virtues of Garland's fascinating sci-fi/horror hybrid. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "There's one scene that is so hair-raisingly horrific, it's still creeping me out days after I saw the movie.",
      "author": "Kurt Loder"
    },
    {
      "text": "Annihilation is a riveting mix of the fantastically beautiful with the horrific and terrifying.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Consistently tantalizing but also deliberately obscure...You might come out of 'Annihilation' wondering about what you just saw, but the sense of wonderment will stay with you.",
      "author": "Frank Swietek"
    },
    {
      "text": "If Garland must play by some of modern Hollywood's rules, he abandons them in just about every other way.",
      "author": "Barry Hertz"
    },
    {
      "text": "A beautiful, riveting sci-fi mystery that annihilates any notion of what a big-budget studio thriller can be.",
      "author": "Adam Graham"
    },
    {
      "text": "\"Annihilation\" really isn't worth seeing. Still, if you meet someone who has seen it, have them tell you the good parts.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Can a flower be scary? Yes, a flower can be scary.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Garland's creeping pace lulls you on an almost molecular level; he's made something akin to an end-of-the-world film, but one in which the changes afoot might not be wholly bad, title be damned.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Garland uses luscious, even seductive visuals in the verdant Florida swamp setting to beguile and horrify us, sometimes both at once.",
      "author": "Nell Minow"
    },
    {
      "text": "Bold, metaphysical and just plain weird",
      "author": "Katie Walsh"
    },
    {
      "text": "An intoxicating and unnerving sci-fi offering, one whose images tease and stimulate, more than confuse and create distance.",
      "author": "Mark Keizer"
    },
    {
      "text": "Alex Garland's Annihilation is a bracing blend of cerebral sci-fi and grindhouse terror, a genre movie that's more, maybe too much for some viewers.",
      "author": "Steve Persall"
    },
    {
      "text": "Astonishing work is at play here, and it is refreshing to see five women spearheading the story.",
      "author": "Allyson Johnson"
    },
    {
      "text": "Annihilation is a movie that's impossible to shake.",
      "author": "Will Leitch"
    },
    {
      "text": "Moviegoers attracted to this film's sci-fi/horror billing should be warned: It's not particularly scary, the characters aren't deeply developed and the plot is at best uninspired.",
      "author": "Tim Appelo"
    },
    {
      "text": "But I spent more time in the theater debating whether I wanted to know more or less about Area X than being invested in what happens to the protagonist. In both the Earthlings and the aliens, there's just too much blankness.",
      "author": "Inkoo Kang"
    },
    {
      "text": "A '50s-shlock, forbidden-planet monster movie in the key of Solaris.",
      "author": "A.A. Dowd"
    },
    {
      "text": "If one goes to the movies to have one's mind blown open by the new and the challenging, this is something to see.",
      "author": "Sean P. Means"
    },
    {
      "text": "Writer-director Alex Garland has made an atom bomb of a movie, fiery and all-consuming and quite unnatural. It fills every inch of our heads with its beautiful terrors.",
      "author": "Andrew Lapin"
    },
    {
      "text": "Annihilation is high-minded science fiction where only those who actively enjoy thinking about and dissecting multiple themes need apply",
      "author": "Robert Kojder"
    },
    {
      "text": "Without a baseline assumption of canned male toughness and bravado, the characters in Annihilation are freer to have more a more interesting dynamic-their steeliness and sorrow, their fear and flintiness, intriguingly commingle and inform one another.",
      "author": "Richard Lawson"
    },
    {
      "text": "It succeeds in making the audience experience that same level of mystery and confusion that those on screen are experiencing.",
      "author": "Russ Frushtick"
    },
    {
      "text": "Gina Rodriguez and Tessa Thompson especially stand out, and though they get a decent amount of screentime, I wanted even more.",
      "author": "Erika W. Smith"
    },
    {
      "text": "\"Annihilation\" holds you on the edge of your seat from start to finish.",
      "author": "Tom Meek"
    },
    {
      "text": "The result is daringly original and frequently beautiful, a shimmering treat from a singular intelligence.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Here is a film that wholly embraces the concepts of the unknown and the uncertain.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Gorgeous, unnerving, and utterly brilliant, Annihilation will scare the crap out of you just as much as it will make you think.",
      "author": "Travis Hopson"
    },
    {
      "text": "Garland has a David Cronenberg-like flair for metastasized biology, unnatural mutations, and human nature in extremis. But in \"Annihilation\" he doesn't seem to have figured out what any of it means.",
      "author": "Peter Keough"
    },
    {
      "text": "It's storytelling that feels like a stalking.",
      "author": "Peter Howell"
    },
    {
      "text": "Ambitious and messy, \"Annhilation\" will likely leave you with more questions than answers. Mine is: \"When can I see it again?\"",
      "author": "Sara Stewart"
    },
    {
      "text": "Equal parts spectacle and mindf*ck, Annihilation embraces visual storytelling and non-literal storytelling in a lean, sci-fi classic.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Annihilation is about four-fifths of a tremendous science-fiction movie: it starts well, creates a compelling alternate reality, builds a fascinating narrative and then just sort of walks into a wall.",
      "author": "Norman Wilner"
    },
    {
      "text": "Annihilation asks some big, essential questions, and the biggest thrill comes from watching a film astute enough to know it doesn't have all the answers, leaving its audience to emerge changed by the experience, but not yet knowing quite how.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "I can say without hesitation that Annihilation is one of my favorite sci-fi/horror movies of the past decade. A mix of cerebral science and visceral horror.",
      "author": "Norman Gidney"
    },
    {
      "text": "Like virtually every science fiction before it, once \"Annihilation\" - which deviates greatly from the book in its third act - starts solving its enigmas, the spell begins to break. But Garland's film is seldom not something to behold.",
      "author": "Jake Coyle"
    },
    {
      "text": "From the reprocessed story to the uninspired visual palette, Garland's Annihilation never fails to disappoint.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Despite the beautiful aesthetics and the gloomy, visionary ambitions, \"Annihilation\" feels empty inside",
      "author": "Jordan Ruimy"
    },
    {
      "text": "While providing food for its ravenous creatures, it also provides food for thought.",
      "author": "Pete Hammond"
    },
    {
      "text": "The visuals are gorgeous. The mood is unsettling from start to finish. \"Annihilation\" is a strong sophomore effort from a very talented filmmaker.",
      "author": "Soren Andersen"
    },
    {
      "text": "In this movie's attempt to be a modern art thinking pieces, the cohesive film element got left behind.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "It's something different that I haven't seen a lot of.",
      "author": "Mark Ellis"
    },
    {
      "text": "The visuals in this film--it will kick your face in it's so gorgeous.",
      "author": "Kristian Harloff"
    },
    {
      "text": "Several months from now, you'll still be thinking about that unsettling closing image. Wow.",
      "author": "Mara Reinstein"
    },
    {
      "text": "As far as great science fiction cinema goes, Garland's latest ranks up there as one of the most ambitious and audacious offerings we've seen grace the big screen in the last few years.",
      "author": "Heather Wixson"
    },
    {
      "text": "Even with all the CGI toys in the world, [Garland] commits to asking big questions without spoon-feeding the answers.",
      "author": "Clint Worthington"
    },
    {
      "text": "A science-fiction flick that's at once intellectually ambitious and extremely frightening.",
      "author": "Calvin Wilson"
    },
    {
      "text": "Mr. Garland has a talent for unnerving you with quietly dissonant notes and an occasional grotesque flourish.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Intelligent sci-fi done right.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Mesmerizing and thoroughly unshakeable. In spite of its title, \"Annihilation\" isn't just about the end of things, but also about the beginning of something else—an insinuation of profound and portentous consequence.",
      "author": "Dustin Putman"
    },
    {
      "text": "Annihilation is a slow crawl creep show with jolts good enough to send your popcorn airborne.",
      "author": "Julian Roman"
    },
    {
      "text": "Annihilation is a visceral cinematic experience that, while plagued with structural problems, delivers plenty of thrills and eye-popping spectacle.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "The film is a masterful journey into strange new territory that is equal parts beautiful, frightening, mysterious and wholly captivating.",
      "author": "Rob Dean"
    },
    {
      "text": "Broken down to the basics, Garland has delivered another movie that's worth seeing. Like the Olympics, though, even when you put together a beautiful routine, points get deducted when you slip on the landing.",
      "author": "Brian Lowry"
    },
    {
      "text": "The kaleidoscopic Annihilation is bound to dazzle and frustrate, spark debate and dismissal.",
      "author": "Jason Wilson"
    },
    {
      "text": "The film is a death knell for fans of the books looking for a tenth of what they love about them reflected on the screen but, I even think, thin as the adaptation's mysteries are, the bulk of neophytes will equally find themselves bored or confused.",
      "author": "Leonardo Faierman"
    },
    {
      "text": "The director of EX MACHINA returns, delivering a thrilling, gorgeous bit of big studio pulp filmmaking.",
      "author": "Jacob Knight"
    },
    {
      "text": "Beautiful, intensely (and unabashedly) weird and, unusual for sci-fi, propelled by a female cast.",
      "author": "Kim Hughes"
    },
    {
      "text": "The movie is as gorgeous as it is disturbing, and that's a powerful combination.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Garland attempts a bigger canvas for his idiosyncratic ways, coming up with a humdinger of a horror show that's sure to be polarizing, but difficult to shake.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Annihilation might be a trippy ride but it's a ride that needs to be experienced for oneself.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Annihilation is a bold, gorgeous, and stunning melting pot of horror, sci-fi, and drama, culminating in one of the most fascinating films I've seen this decade.",
      "author": "Jonathan Barkan"
    },
    {
      "text": "A color-blasted head trip laden with gasp-worthy sights that also carries out the essential sci-fi mission of making us consider what it means to be human in a modern world.",
      "author": "Chris Vognar"
    },
    {
      "text": "Garland's alien biodome is a trippy mixture of tactile old school hardware and computer-generated images.",
      "author": "Gary Thompson"
    },
    {
      "text": "It gives itself, and the audience, an awful lot to see.",
      "author": "Justin Chang"
    },
    {
      "text": "Annihilation will be an acquired taste and should start some conversations.",
      "author": "Kit Bowen"
    },
    {
      "text": "The novel and the movie exist as separate and equally enjoyable entities.",
      "author": "Chris Knight"
    },
    {
      "text": "Annihilation gets momentum from the deeper it pushes into the uncertainties of ecology and the self.",
      "author": "Ryan Stewart"
    },
    {
      "text": "This is smart, troubling science fiction, with a cast of supremely talented actresses, and [Natalie] Portman showing us a character full of turmoil bubbling under the surface.",
      "author": "Kyle Anderson"
    },
    {
      "text": "Annihilation won't be for everyone. But those of you that get caught up its majesty and are left haunted, challenged, moved and beguiled by its sumptuous concoction of horror and sci-fi will quickly return to it again and again.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "Garland's riveting interpretation of the novel is a consciousness-altering trip that will alter audiences on a cellular and molecular level.",
      "author": "Courtney Howard"
    },
    {
      "text": "Alex Garland's bracing brainteaser has the courage of its own ambiguity. You work out the answers in your own head, in your own time, in your own dreams, where the best sci-fi puzzles leave things. Get ready to be rocked.",
      "author": "Peter Travers"
    },
    {
      "text": "Subtle and thoughtful.",
      "author": "Frank Lovece"
    },
    {
      "text": "Director Alex Garland blends high concept sci-fi with stunning visuals and a dash of horror for an exciting female-led film in Annihilation.",
      "author": "Molly Freeman"
    },
    {
      "text": "Annihilation is a terrific piece of big-studio sci-fi. It's superbly acted by its refreshingly female-ensemble cast, it's well-written and its staged as both a deeply introspective journey and an unapologetic horror show.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Annihilation is sublimely strange...This is one of those movies that will anger literal minded fanboys, and enthrall the rest of us. I can't wait to see it again.",
      "author": "Taylor Antrim"
    },
    {
      "text": "Garland makes a valiant go of its concerns, but \"Annihilation\" feels like a short-story amount of story pulled and twisted into feature length.",
      "author": "Michael Phillips"
    },
    {
      "text": "A lavish, magnificently unnerving visual feast threaded through with well-earned jump scares and real metaphysical force.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "\"Be weirder!\" I occasionally grunted at the screen. At the same time, studio horror films starring Oscar winners are rarely this weird.",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "\"Annihilation\" sputters.",
      "author": "Joe Dziemianowicz"
    },
    {
      "text": "The film as a whole didn't seem to have much of a point of view. It told me a story, but it didn't tell me why.",
      "author": "Teresa Jusino"
    },
    {
      "text": "\"Annihilation\" becomes ever more trippy and challenging - and thus ever more interesting.",
      "author": "Richard Roeper"
    },
    {
      "text": "\"Annihilation\" is here to shake up your night at the movies in the most mind-bendy way possible, but without foregoing the pleasures of an ambitious sci-fi entertainment.",
      "author": "Robert Abele"
    },
    {
      "text": "Big-budget sci-fi doesn't come much more incisive, exhilarating and mind-blowing than this.",
      "author": "Nick Schager"
    },
    {
      "text": "Overall it's a bold undertaking that doesn't play it safe and features some strong performances.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "A shimmering example of what Hollywood sci-fi can achieve when the aim is high, Annihilation is a gripping, mystifying adventure and proof that a transportive experience is more rewarding than a story with clean-cut resolutions.",
      "author": "Jordan Raup"
    },
    {
      "text": "A timely ecological thriller that wouldn't look out of place in Larry Fessenden's oeuvre, the movie probes the interplay of beauty and terror inherent to all natural processes beyond humanity's control with a measured gaze.",
      "author": "Eric Kohn"
    },
    {
      "text": "On one hand, it's a brainy take on horror tropes, and on the other an empowering female-led mystery with an underlying roller coaster of weird leaving nightmares in its wake.",
      "author": "Brian Truitt"
    },
    {
      "text": "Annihilation is a ferocious, feral, female-centric update of fearsome monster classics like The Thing and Alien.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Annihilation is more than mere visuals and it will shock, fascinate and haunt whatever screen it's watched on.",
      "author": "Benjamin Lee"
    },
    {
      "text": "For those willing to put in the effort, \"Annihilation\" achieves that rare feat of great genre cinema, where we are not merely thrilled ... but also feel as if our minds have been expanded ...",
      "author": "Peter Debruge"
    },
    {
      "text": "Garland is telling the story through visuals, and through a cell biology thread most producers would not have faith in an audience to follow.",
      "author": "Emily Yoshida"
    },
    {
      "text": "\"Annihilation\" is mesmerizing and its awe-inspiring conclusion will leave your mind blown and splattered against the wall.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "[Its] dazzling and intentionally difficult third act may prove too high a point of entry for some audiences. But for everyone else, there is a beauty and melancholy to the shimmering sci-fi art installation created here.",
      "author": "David Crow"
    },
    {
      "text": "Able to generate dread and awe with equal skill, \"Annihilation\" is an absorbing amalgam of genres and influences. This is a film of ambition and ideas, and part of the exhilaration comes from watching Garland and his cast risk so boldly.",
      "author": "Tim Grierson"
    },
    {
      "text": "A phenomenal work. And even though it is coming out in the early months of the year, it's a candidate to ultimately be considered one of the best of 2018.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "When people say a movie \"made their skin crawl,\" they don't usually mean it literally. In this case, I do: This movie made me physically uncomfortable in my own skin.",
      "author": "Matt Singer"
    }
  ],
  "release_year": 2018,
  "duration": 115,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "Lena, a biologist and former soldier, joins a mission to uncover what happened to her husband inside Area X -- a sinister and mysterious phenomenon that is expanding across the American coastline. Once inside, the expedition discovers a world of mutated landscapes and creatures, as dangerous as it is beautiful, that threatens both their lives and their sanity.",
  "popularity": 6.7,
  "poster_url": "https://image.tmdb.org/t/p/original/z19tTNd8YxJnaDwQiNC7yCUkgbr.jpg"
}