{
  "movie_name": "Aquaman",
  "movie_id": "aquaman_and_the_lost_kingdom",
  "total_reviews": 212,
  "reviews": [
    {
      "text": "It’s been a long time since I’ve seen a new film, let alone a new superhero film, that offers so agonizingly little in terms of story, soul, charm, dedication, or even basic technical merit.",
      "author": "Joseph Tomastik"
    },
    {
      "text": "This confusing sequel drowns in the sea of baffling plotlines.",
      "author": "Christina Newland"
    },
    {
      "text": "Aquaman and the Lost Kingdom is a movie so desperate to be liked that it appeals to no one. It’s a tornado of mismanagement, tonal shifts, a story that doesn’t make a lick of sense, and a complete lack of identity.",
      "author": "James Preston Poole"
    },
    {
      "text": "The film offers another eye-popping adventure, and shows Wan will do everything he can to cram things into his movie but as an end to the DCEU it's neither really good, nor really bad, it's just a bit of a wet fish.",
      "author": "Paul Klein"
    },
    {
      "text": "Aquaman and the Lost Kingdom feels like a random filler episode than the finale of the DCEU. It’s still fun, but eminently forgettable.",
      "author": "Shakyl Lambert"
    },
    {
      "text": "For this one very silly adventure, Patrick Wilson makes it a good time.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Any movie teeming with fantastical ocean creatures, neon-streaked underwater metropolises and Nicole Kidman riding a cybernetic shark should be a blast of escapism, but the Lost Kingdom never transcends the tedium of its weightless green screen action.",
      "author": "Luke Goodsell"
    },
    {
      "text": "Where Aquaman felt original, Lost Kingdom is stale, void of all originality.",
      "author": "Jenny Nulf"
    },
    {
      "text": "It opens with one character getting blasted in the face by a stream of baby urine and ends with another cheerfully munching on a live cockroach. I can’t recall, but did, say, Captain America or Doctor Strange ever have to suffer such indignities?",
      "author": "Matt Brunson"
    },
    {
      "text": "It appears to suffer from multiple forms of meddling and overdone CGI, failing to capture the charm of its predecessor.",
      "author": "Kevin Carr"
    },
    {
      "text": "The sets are imaginative, the characters feel lived-in, and the use of practical suits helps reduce the faceless CG enemy-trope of a lot of superhero films while also making the combat feel more tangible and weighted dramatically.",
      "author": "Douglas Davidson"
    },
    {
      "text": "A functional rather than spectacular slice of comic-book nonsense, then, but considering it is the final instalment of the DCEU franchise, a more rousing swansong would have been welcome.",
      "author": "Jeremy Aspinall"
    },
    {
      "text": "It’s a definite step down from the insane heights of the first film, but it’s still so much fun and so much more engaging than most of the superhero films made these days.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Sadly, a flaccid, final DCEU film that tries to coast on the chemistry of Momoa and Patrick Wilson that ends up crashing on the rocks with some terrible humor, ridiculous scenarios, nonsensical story beats, and a villain that is supremely wasted. RIP DCEU",
      "author": "John Rocha"
    },
    {
      "text": "Aquaman and the Lost Kingdom almost has its moments. So let’s crunch the comparison sum: It’s a lesser experience than the first Aquaman, which was mediocre-plus. And what do you get with straight-down-the-middle mediocrity?",
      "author": "John Serba"
    },
    {
      "text": "[Black Manta is a] cardboard cutout angry villain.",
      "author": "Tony Baker"
    },
    {
      "text": "While the first Aquaman was a tsunami of dumb fun spectacle, this dizzy sequel sinks into abysmal depths due to an unbearable weight of massive silliness. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Wan leaves things open enough to perhaps get the gang back together, but unless someone can find a way to do the character and Atlantis justice, it might be best for Aquaman to hang up his suit and trident.",
      "author": "Maria Lattila"
    },
    {
      "text": "The Lost Kingdom struggles to provide much substance with its style. The highlight is the chemistry between our two former foes. There are opportunities to lean more into the emotional stakes, but the script never commits.",
      "author": "Austin Burke"
    },
    {
      "text": "Not funny enough, not dramatic enough, not well acted enough - but I wasn't bored.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "For a moment, however brief, it’s almost enough to applaud Wan’s Sisyphean efforts to turn Aquaman’s second go-around into a coherent, compelling superhero entry.",
      "author": "Mel Valentin"
    },
    {
      "text": "But visually, the film is a spectacular explosion of ideas that might feel like a lot to take in but faithfully reference the Aquaman comic books of the 1960s and '70s.",
      "author": "Cris Kennedy"
    },
    {
      "text": "Not all of the comedy and emotional beats land, but this film is good enough to turn on and watch. It isn’t one of the stronger DCEU entries, but you won’t have a bad time watching this sequel.",
      "author": "Jonathan Sim"
    },
    {
      "text": "Kids may have fun with Aquaman and the Lost Kingdom’s crude humor, bright visuals, and cutaways from Momoa shouting profanity. Everyone else though will likely shrug it off as the cloying cartoon it is.",
      "author": "David Reddish"
    },
    {
      "text": "A film so risk-averse, it's afraid to step out of its own shadow.",
      "author": "Courtney Small"
    },
    {
      "text": "As a review, this film is simplistic, with much of it riding on quirkiness and Momoa's personality. Nowhere as good as the original, this one has to add extra comic relief to move boring scenes along. So for me, this film gets a C.",
      "author": "Derek Sante"
    },
    {
      "text": "AQUAMAN AND THE LOST KINGDOM isn't great, but it's still a better offering than most DCEU films lately.",
      "author": "JD Duran"
    },
    {
      "text": "As jumbled as the universe it exists in, and a reminder of why there’s a need (for DC) to start afresh.",
      "author": "Victoria Luxford"
    },
    {
      "text": "More like “Awkwardman and the Lost Opportunity.”",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Like John Carter and Green Lantern before it this is a DC film that might be pummelled by the some critics but is going to be classed as an under-rated gem by true fans of the DC universe.",
      "author": "David Griffiths"
    },
    {
      "text": "The Aquaman sequel feels like it was mostly constructed in post-production, with CGI working hand-in-hand with editing to fashion something borderline-coherent.",
      "author": "James Berardinelli"
    },
    {
      "text": "Odd couple Aquaman and Orm are a more satisfying pairing than Aquaman and Mera were in “Aquaman” (2018). Wilson makes a perfect straight man to Momoa’s himbo vibe, and his redemption arc drives the narrative forward",
      "author": "Sarah Vincent"
    },
    {
      "text": "Jason Mamoa’s charisma and amiability are thoroughly squandered here, which is probably the biggest of the film’s many disappointments.",
      "author": "Louisa Moore"
    },
    {
      "text": "Much as Arthur has learnt the novelty of being king wears off, a degree of creative weariness is visible in Aquaman and the Lost Kingdom.",
      "author": "Jake Wilson"
    },
    {
      "text": "I wasn’t expecting much from Aquaman and The Lost Kingdom. I got even less.",
      "author": "Robert Denerstein"
    },
    {
      "text": "The movie is filled with eye candy, with digital effects in almost every scene, and there is plenty of action, leavened by the aforementioned humor. This movie is a bit of enjoyable escapism.",
      "author": "Robert Roten"
    },
    {
      "text": "A perfectly fine, thick serving of superhero cinematic chowder.",
      "author": "Jim Schembri"
    },
    {
      "text": "In many ways, The Lost Kingdom is emblematic of all the issues that plagued the DCEU in its 10 year-run; no plan or foresight of direction, countless studio interferences, and a failure to understand how to do a shared universe in the first place.",
      "author": "Shah Shahid"
    },
    {
      "text": "It’s a brightly colored, clumsily rendered ending of an era, a mediocre whimper that desperately wanted to be a bang.",
      "author": "TK Burton"
    },
    {
      "text": "This Aquaman is never going to be anybody's idea of a good film, but its heart is in the right place and it never left me feeling actually irritated or bored.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Above all, it is most frustrating to see Jason Momoa on auto-pilot in the role that transformed him into a movie star. [Full review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "A farewell without affliction and clearly without glory. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "…a big, fun, knowingly silly slab of studio superhero madness that anchors itself with enough emotion and characterisation to keep things on course …",
      "author": "Erin Free"
    },
    {
      "text": "This is going to end up on my worst of 2023 list for sure.",
      "author": "Christy Lemire"
    },
    {
      "text": "[Yahya Abdul-Mateen II] plays the most sober character who doesn't force a smile... he's the only one who comes out unscathed. [Full review in Spanish]",
      "author": "Adrián Monserrat"
    },
    {
      "text": "It must be watched knowing what kind of movie it is and accept that it doesn't contribute much to the superhero genre. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "A simple excuse to elaborate on a film that is shameless Hollywood entertainment, depending on fun moments, spectacular action scenes and fantastic locations. [Full review in Spanish]",
      "author": "Sergio Burstein"
    },
    {
      "text": "This sequel is not a total loss nor win for the troubled DC Extended Universe. While its commitment to diversity is applaudable, the chemistry between Jason Momoa and Amber Heard is weak and director James Wan doesn't handle comedic timing well.",
      "author": "Jana Monji"
    },
    {
      "text": "The script and plot are mere pretexts for what the director seems to be interested in: putting together action scenes full of CGI and many of them even underwater. [Full review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Put a fork in the DCEU, it’s done after 15 films. And, sadly, despite Jason Momoa’s efforts, the DCEU’s going out with a splat rather than a bang! pow! KABOOM!",
      "author": "Rebecca Murray"
    },
    {
      "text": "The movie’s silly screenplay simply cannot play to Momoa’s strengths, as either a cracker of quality gags, or a kicker of bad-guy butts.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Aquaman and The Lost Kingdom refreshingly gives zero F’s and just is what it is, making it a perfect send-off for the DCEU.",
      "author": "Jack Bottomley"
    },
    {
      "text": "This 'Aquaman' flounders.",
      "author": "Linda Cook"
    },
    {
      "text": "The Lost Kingdom is a worthy return to Atlantis. It doubles the sense of wonder and self-awareness of the first film. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "This isn’t the worst movie in the franchise by a longshot. It’s not even the worst DCEU movie to come out this calendar year. It’s simply the last one.",
      "author": "Kyle Anderson"
    },
    {
      "text": "Aquaman 2 will appeal to a younger crowd and those just looking for a fun action flick. No one should be going into this with the assumption it's high-art.",
      "author": "Adam Olinger"
    },
    {
      "text": "It may not quite be the end, but The Lost Kingdom confirms the format is lost at sea and needs to find new shores.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Despite a worthwhile final act, the scenic, CG-heavy film’s attempts at silly humor and serious themes make for a tonally inconsistent finale to the DCEU.",
      "author": "Jonathan Garcia"
    },
    {
      "text": "Picks up exactly where the first film left off. If you didn't like the first film, it's unlikely this film will win you over. I enjoyed the first film, and I had a good time with this one. The relationship between Aquaman and Orm was the stand out.",
      "author": "Sean Chandler"
    },
    {
      "text": "Jason Momoa‘s enthusiasm for the character is evident, and the charming actor does his best to keep things afloat, but this lost voyage never finds its way, despite peppered possibilities.",
      "author": "Peter Gray"
    },
    {
      "text": "With a forgettable plot and some charisma coming from its main cast, Aquaman and the Lost Kingdom fails to live up to its predecessor and the DCEU it has the privilege of bringing to a close.",
      "author": "Diego Peralta"
    },
    {
      "text": "This final dive into the undersea world of the DCEU implodes under the pressure likely generated by all the behind-the-scenes tinkering. As last hurrahs go, this one’s lost at sea.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Yet more evidence that the superhero movie industry is foundering comes from this shoddy, scraped-from-the-bottom-of-an-ocean-trench sequel.",
      "author": "Wendy Ide"
    },
    {
      "text": "Aquaman and the Lost Kingdom is straight up cartoonish. The team up with Jason Momoa (Aquaman) and Patrick Wilson (King Orm) is what really works.",
      "author": "Korey Coleman"
    },
    {
      "text": "... covering presumably thousands of miles of ocean at the speed of plot... All the fun from the first film feels forced this go around, making it hard to ignore the infinite cycle of pretty new location, talks go sour, fight, repeat.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "[Aquaman and the] Lost Kingdom plays all of the “greatest hits” from the first film, if the selections were made based on what’s loudest and easiest for the audience to sing along.",
      "author": "Mark Hughes"
    },
    {
      "text": "Aquaman and the Lost Kingdom is not a good movie, but as a standalone encapsulation of so much that was both wrong and sometimes right about the DC Extended Universe, it could hardly be a more fitting end to the whole enterprise.",
      "author": "Ilan Preskovsky"
    },
    {
      "text": "The ennui is crushing.",
      "author": "Andrea Chase"
    },
    {
      "text": "There's a weird charm to its utter stupidity, but not enough to transcend this thankfully dying genre.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Aquaman and the Lost Kingdom finds itself weighed down by a clunky script with no idea what it wants to be.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "It’s not as much of a coffin nail as it could be. In fact, it's actually sort of fun.",
      "author": "Matt Lynch"
    },
    {
      "text": "I’m not going to pretend this movie is anything new or great, but it does occasionally manage to be fun and subversive enough to act as a solid sequel and a fitting sendoff to an extended superhero universe that never really found its footing.",
      "author": "Steven Prokopy"
    },
    {
      "text": "I’ll go even further than simply stating Aquaman and the Last Kingdom is one of the worst superhero films – it’s one of the worst films ever, period.",
      "author": "Alex Saveliev"
    },
    {
      "text": "Parts of the two-hour film feel a little bogged down, but it does well to keep a lively pace and wrap everything up the best way possible, even if it’s a tad abrupt.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "The DCU sets up Jason Momoa's Aquaman to be rowdy and drunk, and then makes him a Daddy...go figure. Momoa is the highlight, along with the Lobster who keeps losing limps, but the film can't overcome the same old, same old superhero storyline and battles.",
      "author": "Patrick McDonald"
    },
    {
      "text": "The DC Extended Universe arrives at its apparent endpoint with “Aquaman and the Lost Kingdom” — and at least we’re going out with a laugh.",
      "author": "Sean P. Means"
    },
    {
      "text": "Just like toxic seaweed, it's a tangled and rotten mess of a superhero film with uneven visual effects, cringeworthy dialogue, and a sloppy plot. The filmmakers mistakenly think that Aquaman's charisma is defined by 'surf dude' whooping and hollering.",
      "author": "Carla Hay"
    },
    {
      "text": "Aquaman and the Lost Kingdom is a prime example of why an overhaul of DC Films is desperately needed.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Any good plot moments are tarnished by jokes aimed at the playground crowd.",
      "author": "Rick Bentley"
    },
    {
      "text": "I will say this for Aquaman and the Lost Kingdom, the long-in-the-works sequel to 2018’s Aquaman starring Jason Momoa in the title role: I laughed quite a bit. Does it matter that the funniest parts weren’t supposed to be humorous? Not really.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "Aquaman And The Lost Kingdom is a soggy mess -- unfunny, over-long and a damp squib when compared to the original and that, let’s face it, was no classic. But at least it has some energy and a sense of fun. It’s not just the kingdom that’s been lost.",
      "author": "Freda Cooper"
    },
    {
      "text": "Despite being left at sea by Warner Bros, the Aquaman sequel is strong enough to stay afloat.",
      "author": "Hannah Rose"
    },
    {
      "text": "The areas where it comes up lacking notwithstanding, I had fun with this brother-buddy action-comedy. I was even given a giant sea horse, a cocky octopus, and an evil volcano lair to appreciate in the process.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "In the name of stupidity, you’ll witness Momoa and friends riding on giant seahorses, a hammerhead submarine, and a baby peeing in Aquaman’s mouth. It's wild but admittedly entertaining.",
      "author": "Preston Barta"
    },
    {
      "text": "Feels like everyone just stopped trying a while ago and left this last whimper from the DCEU to float into theatres.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "It’s a comic-fantasy that gets a passing grade, but not a high one. What’s weird is that is actually a high score for the Warner Brothers brand of comic book movies.",
      "author": "John Kirk"
    },
    {
      "text": "“How bad could it be?” Answer: Extremely bad.",
      "author": "Peter Howell"
    },
    {
      "text": "“Aquaman and the Lost Kingdom” may not be consequential in the long run, but it’s a mostly diverting, upbeat closer, one that could hint at the tone of things to come.",
      "author": "Michael Ordoña"
    },
    {
      "text": "What we have is 124 minutes of fish vomit. Fish vomiting is rare, so when it happens, it’s an indication of a fatal condition and time for little Chips to visit SeaWorld by way of the nearest commode.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "It is less a DCEU wake than it is hasty studio obligation. They say a few platitudes, hoist up the body while it's still warm, and toss it into the drink. The audience then has to sit there and watch the carcass float around the boat for 124 minutes.",
      "author": "David Crow"
    },
    {
      "text": "Regardless of its merits or shortcomings, there are some references to Star Wars and Lord of the Rings. Even with its messiness, Wan's full imagination is at its finest when unleashed, and his capacity to bring Aquaman's world to life can be spectacular.",
      "author": "Elliott Collins"
    },
    {
      "text": "Despite being reasonably entertaining, it doesn't negate that Aquaman and the Lost Kingdom is such a significant nothing burger of a blockbuster.",
      "author": "Rendy Jones"
    },
    {
      "text": "The film hits its plot milestones as fast as humanly possible, cohesion or depth be damned.",
      "author": "Justin Clark"
    },
    {
      "text": "It’s such a bonkers mix and I get that mileage may vary depending on your tastes. But Wan has mostly delivered beyond what I expected. And even with some noticeable flaws, “Aquaman 2” is a satisfying swan song for the late and sometimes great DCEU.",
      "author": "Keith Garlington"
    },
    {
      "text": "“The Lost Kingdom” is exactly what you’d expect: the script is pure nonsense, there’s several unfunny gags, and it possesses the visual effect prowess of something you’d play on the Playstation 2 in 2004.",
      "author": "Nate Adams"
    },
    {
      "text": "\"A superhero sequel without a soul, or any kind of self-belief, 'Aquaman 2' gives into the worst instincts of the DCEU just as it bows out for good.\"",
      "author": "Christian Bone"
    },
    {
      "text": "Without the need for a star-studded final act or a tantalizing mid-credit scene to bait audiences into watching the next film, James Wan was allowed to give Arthur Curry a true and satisfying conclusion.",
      "author": "Maggie Lovitt"
    },
    {
      "text": "A notch down from the original, about par for the Warner-DC universe.",
      "author": "Rafer Guzman"
    },
    {
      "text": "‘…low-energy camp shenanigans…the sooner Aquaman and his tiresome fish-man pals drink up their product-placed pints of Guinness and vacate the premises the better…",
      "author": "Eddie Harrison"
    },
    {
      "text": "Words I would use to describe Aquaman and the Lost Kingdom: random, scattered, busy, pointless, corny, loquacious, and tedious.",
      "author": "Joseph Robinson"
    },
    {
      "text": "An overproduced, asinine, anemic and underwhelming spectacle that's just disappointing as Rebel Moon: Part One - A Child of Fire. Perhaps it would work better as a video game rather than a movie.",
      "author": "Avi Offer"
    },
    {
      "text": "It’s another three-star DC Films sequel to a four-star DC Films \"part one,\" but 'Aquaman 2' is an entertaining, visually spectacular and wildly inventive stand-alone action fantasy. If this is the DECU's time to go, James Wan gave us a hell of a show.",
      "author": "Scott Mendelson"
    },
    {
      "text": "There’s over $200 million worth of eye candy in the story of our hero’s attempt to save the world from Black Manta and global warming….and about $5 worth of originality in the screenplay. I",
      "author": "Russ Simmons"
    },
    {
      "text": "Frankly, even referring to Lost Kingdom as “finished” is generous. Someone once said a book is never finished, only abandoned. That rather adequately describes this one...",
      "author": "Evan Dossey"
    },
    {
      "text": "The movie, from the first long expositional voice over sequence, feels like a construction project started without a blueprint that they then try to piece back together to make some sense.",
      "author": "David Poland"
    },
    {
      "text": "The first Aquaman film maintains a balance of seriousness and fantasy, The Lost Kingdom veers into cartoonish territory.",
      "author": "Valerie Complex"
    },
    {
      "text": "Ripping off popular movies and other famous tropes from action/fantasy film franchises, this movie sequel takes a nose dive into deep, deep waters.",
      "author": "Christie Cronan"
    },
    {
      "text": "[The Lost Kingdom] is waterlogged with boring villains and underwhelming visuals.",
      "author": "Richard Roeper"
    },
    {
      "text": "Pretty captivating from a visual standpoint—the addition of 3-D is unobjectionable even if it adds little of consequence—but is weighed down by a prosaic narrative and a strained sense of fun.",
      "author": "Frank Swietek"
    },
    {
      "text": "A fun, action-packed sequel that lets both Jason Momoa and Patrick Wilson enjoy the ride and make you enjoy it with them. Nothing to write home about, but does the job. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "This movie suffered from trying to do too much, leaving the ending feeling incomplete and an underused villain. Jason Momoa and Patrick Wilson are a ton to watch together, though.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "Superhero sequel has comic-book violence, creepy monsters.",
      "author": "Tara McNamara"
    },
    {
      "text": "Wheels out old tropes in a way that borders on the contemptible.",
      "author": "David Jenkins"
    },
    {
      "text": "All that remains, as you walk out of the theatre, is a deluge of rocks uncomfortably drubbing at your aesthetic convictions, with none of the emotional heft seeping its way in.",
      "author": "J. Shruti"
    },
    {
      "text": "Aquaman and the Lost Kingdom dives into the deep end and fails to make a splash with a whimpering finale.",
      "author": "Leo Brady"
    },
    {
      "text": "This sequel has an excuse -- nay, a financial imperative! -- to get even wetter and weirder. Yet, plot-wise, we're given much of the same.",
      "author": "Amy Nicholson"
    },
    {
      "text": "In this final entry in the DCEU director James Wan has given us a laborious, reverential, self-serious slog.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Aquaman and the Lost Kingdom feels like a throwback, reminiscent of Buck Rogers, Flash Gordon and even Star Wars. It’s weird, cheesy and fun. Unfortunately, audience tastes have changed in the five years...and the sequel feels stuck in the past.",
      "author": "Ron Seoul-Oh"
    },
    {
      "text": "Aquaman and the Lost Kingdom continues the trend of filmmakers not taking advantage of either the weird possibilities of this character and his world or the easy charm Momoa brings to the part.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The first Aquaman was not very good, but I have to admit, this one is an improvement... With Patrick Wilson, the ever likeable Mamoa forms a surprisingly effective comic double act.",
      "author": "Paul Whitington"
    },
    {
      "text": "James Gunn may be scrapping the DCEU and starting again from scratch, but it's strange to see a film that's already accepted this fate, devoid of any signs of life that would make the powers that be reconsider their decision.",
      "author": "Alistair Ryder"
    },
    {
      "text": "Momoa’s performance, like Chris Hemsworth’s as Thor, provides diminishing returns (has muscles, makes jokes, flicks hair), while the overuse of CGI would put a charging rhino to sleep.",
      "author": "Kevin Maher"
    },
    {
      "text": "After a year of lacklustre box office disappointments for comic book movies, 2023 ends with the most pointless of them all.",
      "author": "George Simpson"
    },
    {
      "text": "Continues the tradition of DCEU heroes that do nothing but bellyache about being super powered Gods that can actually help people.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Aquaman and the Lost Kingdom doesn’t take itself seriously and is committed to being weird and wacky above all else, with a plethora of mildly exciting fight scenes that evoke the sensation of a comic book come to life",
      "author": "Robert Kojder"
    },
    {
      "text": "Despite a charismatic turn from Momoa and some fun frenemy banter, this is a disappointing send-off that sees the DCEU go out with a squelch rather than a splash. Fin.",
      "author": "James Dyer"
    },
    {
      "text": "Time will tell whether Momoa's take on Aquaman will survive Gunn and Safran's reinvention. If it does, hopefully they'll take what works (the wild production design of Atlantis) and ditch what doesn't (about everything else).",
      "author": "Clint Worthington"
    },
    {
      "text": "Aquaman and the Lost Kingdom has its moments (stick around for the amusing mid-credit scene), but the script’s choppy waters, and a low stakes storyline offer a low reward.",
      "author": "Richard Crouse"
    },
    {
      "text": "A tonal mess, dogged by VFX that range from “video-game cut scene” to “last-minute rush job,” complicated yet curiously thin storytelling, and endlessly aggressive rib-nudging.",
      "author": "David Fear"
    },
    {
      "text": "Lacking the sense of discovery and world-building that powered the original, director James Wan settles for a sort-of misguided buddy comedy. Whatever the intent, this doesn’t feel like the answer to lift superhero movies out of their slump.",
      "author": "Brian Lowry"
    },
    {
      "text": "Overall, it’s another dead weight to add to the drowning world of superhero movies.",
      "author": "Saskia Kemsley"
    },
    {
      "text": "The movie is clever enough, and plenty scary, and there is a sufficient number of jokes to keep the whole thing from getting too self-important.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "It keeps its trident high even as the sea reclaims its hero.",
      "author": "Mark Kennedy"
    },
    {
      "text": "It’s fine. It’s fun. It’s boring sometimes. It’s bright, colorful, and kind of clumsy. If you’re looking for somewhere to spend two hours of a chilly winter day, then Atlantis might be as good a place as any.",
      "author": "Julia Glassman"
    },
    {
      "text": "The Lost Kingdom is not exactly a good film. But it isn’t a bad one, either.",
      "author": "Barry Hertz"
    },
    {
      "text": "While affable star Jason Momoa still gives his all as the bro dude king of Atlantis, the sequel to the 2018 original suggests a creative team that checked out long ago.",
      "author": "Danny Leigh"
    },
    {
      "text": "The characters are a bunch of nothingburgers. They have no development; they're just kind of there.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "The sequel is more of the same. Much more, in terms of the pile-on of all the bells and whistles.",
      "author": "Soren Andersen"
    },
    {
      "text": "I get the feeling everyone was just calling it in on this one....a wait-for-streaming for all but the most devoted fans.",
      "author": "Nell Minow"
    },
    {
      "text": "The entire affair is so painfully formulaic, predictable, and unoriginal that it feels as if a “Fast and Furious” film staged underwater.",
      "author": "Mike Massie"
    },
    {
      "text": "'Aquaman and the Lost Kingdom' is slightly predictable, but still entertaining.",
      "author": "Catalina Combs"
    },
    {
      "text": "If Aquaman and the Lost Kingdom is truly the end of this current incarnation of the extended DC Comics cinematic universe, at least things are going out on a lighthearted and fun note.",
      "author": "Andrew Parker"
    },
    {
      "text": "Did anyone involved with the making of Aquaman and the Lost Kingdom even want to make an Aquaman movie? Even Jason Momoa — a guy who whose entire vibe is “I’m happy to be here” — visibly struggles to wring any sense of enjoyment out of a scene,",
      "author": "Liz Shannon Miller"
    },
    {
      "text": "It’s disposable entertainment that feels at times like the world’s coolest screensaver or weirdest aquarium. Dive in, but don’t expect to get too deep.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Not one part of this movie--the effects, the storyline, the emotional core--works. Everything is recycled from other superhero movies. It's time to give the genre an at sea burial.",
      "author": "J. Don Birnam"
    },
    {
      "text": "A Bonkers Adventure Film All About Family.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Momoa is channeling his Fast X villain flamboyance into this heroic character. Yet, the film arrives at sincere places after all the sarcasm.",
      "author": "Fred Topel"
    },
    {
      "text": "Aquaman 2 embodies the charm of a Saturday morning cartoon, with more positive aspects than negative. However, it's burdened by serving as the conclusion for The DCEU, despite its intention to be nothing more than a lighthearted and fun sequel.",
      "author": "Cris Parker"
    },
    {
      "text": "It’s the kind of film that wants to leave everything it has out on the field, and that produces a kinetic, often scattered, but nonetheless entertaining popcorn movie that truly gives us everything it has, and then some.",
      "author": "Matthew Jackson"
    },
    {
      "text": "It’s a rather long two-hours. That seems especially true for Nicole Kidman, who looks truly, truly pained to be involved with this project.",
      "author": "Matt Oakes"
    },
    {
      "text": "Aquaman and the Lost Kingdom is a mess of a film in every way that counts: in the story, in special effects, and in the end, none of it amounts to anything because we all know this is a chapter ending with nothing to actually say about said ending.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Aquaman and the Lost Kingdon is a movie that tries to be everything at the expense of being anything.  It’s not altogether terrible but more often than not, it feels like a slog.",
      "author": "Germain Lussier"
    },
    {
      "text": "A hacked up mess, and that’s not just the editing, but boy is it also the editing.",
      "author": "William Bibbiani"
    },
    {
      "text": "Aquaman and the Lost Kingdom is a 'fine' farewell to the DCEU. While far from a mind-blowing send-off, it encapsulates the essence of the cinematic universe - a journey filled with few triumphs, many missed opportunities, and incomprehensible disasters.",
      "author": "Manuel São Bento"
    },
    {
      "text": "[It] feels extremely sad to report that Aquaman and the Lost Kingdom isn’t a good movie. The script is derivative. The storytelling is boring (...) The action is all right, but after a point, even that ends up feeling repetitive.",
      "author": "Pramit Chatterjee"
    },
    {
      "text": "Aquaman and the Lost Kingdom spectacularly misfires. The madcap adventure juggles strange terms in a bewildering narrative that looks like rainbow skittles exploded on the screen.",
      "author": "Julian Roman"
    },
    {
      "text": "Some interesting ideas ... and its message is well-worth sharing. But the film's commitment to over-explaining every aspect of its world, narrative, and message turns it into a slog despite the sometimes eye-popping production design and battles.",
      "author": "Kyle Logan"
    },
    {
      "text": "\"Aquaman and the Lost Kingdom\" brings the DC Extended Universe project to a close. At least, until James Gunn puts the next piece on the board and brings the publisher's next generation of superhero stories to life. [Full Review in Spanish]",
      "author": "Aglaia Berlutti"
    },
    {
      "text": "While this is a solid family adventure movie, it doesn't feel anything like a DC movie - y'know, the franchise it's a part of - and it lacks dignity.  A very sad way for the DCEU era to end. Randall Park is great though in a surprisingly large role.",
      "author": "Grace Randolph"
    },
    {
      "text": "There’s plenty of action and adventure with Jason Momoa having a blast as Arthur Curry. Seeing Momoa and Patrick Wilson teaming up was something I didn’t know I needed, but I want more of their adventures.",
      "author": "John Nguyen"
    },
    {
      "text": "You can tell from every second of the sequel just how disinterested DC Studios is in this film and in the future of this character.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "All that's passable or fun gets drowned by frenetic pacing, silly humor & weak villain. It also wants to be too many things at the same time. And one does feel the cuts, reshoots & the \"too many cooks in the kitchen.\" [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Aquaman and the Lost Kingdom still stands as a well-oiled blockbuster that delivers something unique when compared to other recent DC movies.",
      "author": "Ben Rolph"
    },
    {
      "text": "Rife with lazy one-liners that wouldn’t pass muster in a sitcom’s writers’ room, with gags like baby Arthur Jr. urinating in his dad’s face during a diaper change, a bit the movie loves so much it happens twice.",
      "author": "Alonso Duralde"
    },
    {
      "text": "It's sad that the DC Extended Universe has culminated with such a tampered product, which has clearly been modified a thousand times in post. I hope that James Wan can now return to what he really likes (maybe a horror movie?). Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A depressingly dull follow-up to one of the better DC movies.",
      "author": "Chris Bumbray"
    },
    {
      "text": "A Jules Verne pulp adventure juiced up on a cocktail of testosterone, adrenaline, and Guinness beer.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "It’s just disappointing that Momoa’s final time as King of the Seas didn’t make a bigger splash.",
      "author": "Travis Hopson"
    },
    {
      "text": "“Aquaman and the Lost Kingdom” proves Hollywood hasn’t forgotten how to have fun with its franchise tentpoles. In fact, the film’s whole-hearted embrace of comic book ridiculousness may be just the shot in the arm the genre needs right now.",
      "author": "Dan Bayer"
    },
    {
      "text": "A pleasant, largely-entertaining time with a character whose big-screen portrayal was one of the DCEU's rare successes. Thanks to its free-wheeling attitude and committed ensemble cast, it closes a cinematic chapter in a silly, but satisfying-enough way.",
      "author": "Jenna Anderson"
    },
    {
      "text": "As the old way sinks into oblivion, at least Wan leaves us a little damp with excitement.",
      "author": "Bob Strauss"
    },
    {
      "text": "The movie doesn’t sink nor swim: It’s aggressively fine, floating along as a breezy-enough outing – and a brotherly one, at that – without any particularly spectacular strokes.",
      "author": "Brian Truitt"
    },
    {
      "text": "The good thing is that it’s not trying to be anything different, and the focus is on thrills rather than taking itself too seriously, even when it dips its toes into the pool of deep and meaningful.",
      "author": "Simon Thompson"
    },
    {
      "text": "It felt like entire clumps of grey matter were giving up the gig in disgust and abseiling out of my ears.",
      "author": "Robbie Collin"
    },
    {
      "text": "Say what you will about what this now-concluded chapter in DC cinematic history deserves... Arthur Curry going out on his own terms with a complete disinterest in wHaT iT aLl MeAnS fOr ThE fRaNcHiSe is both incredibly on-brand and objectively funny.",
      "author": "Amelia Emberwing"
    },
    {
      "text": "As the DCEU braces for a reboot, this underwater escapade serves as a reminder that even Atlantis can't escape the undertow of creative fatigue.",
      "author": "Samarth Goyal"
    },
    {
      "text": "The trouble is that Momoa's selling point as an actor is how natural and physical he is, whereas nothing in Aquaman and the Lost Kingdom seems real.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Aquaman and the Lost Kingdom is visual noise. Beautiful and incredible action can't help a surface level story with no substance. The film feels hurt in the editing and writing. I wanted more...",
      "author": "Zach Pope"
    },
    {
      "text": "James Wan and company handle the proceedings with gleeful gusto and ebullient attitude, managing to rise above some inconsistent visual effects and a few bad wigs to give us a decent send-off. All isn’t lost.",
      "author": "Courtney Howard"
    },
    {
      "text": "Suffers from a lot of issues such as a weak and underused villain, wonky visuals, cringey dialogue, and an anticlimactic ending. Momoa and Wilson's interactions as brothers, complete with banter and bickering, are the best part.",
      "author": "Tessa Smith"
    },
    {
      "text": "Discards most of what made the first Aquaman enjoyable and replaces it with dead air, tonal dissonance, and a complete lack of filmmaking energy, making it a fitting closing chapter to the decade-long failed experiment that was the DCEU.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Like the third act of a Pixar movie that’s in gotta-get-back mode, everything about \"Aquaman and the Lost Kingdom\" is in a massive hurry. This movie would have been better served stopping once in a while to soak in a little wonder or terror",
      "author": "Don Shanahan"
    },
    {
      "text": "Aquaman & The Lost Kingdom is as goofy and adventurous as the first movie, but tries too hard for a seriousness it can never achieve with Jason Momoa.",
      "author": "Molly Freeman"
    },
    {
      "text": "“The Lost Kingdom” becomes more and more formulaic as it digs into its mythos, as if the movie were caught between being its own thing and being nothing at all.",
      "author": "David Ehrlich"
    },
    {
      "text": "Yet another reminder that cinema is locked in a corporate chokehold, robbing artists of the ability even to flail about in style anymore.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "At a moment when DC Films is pivoting to a new era, which will involve rethinking its iconic characters, this vestige of the previous regime cannot help but feel like an underwhelming afterthought.",
      "author": "Tim Grierson"
    },
    {
      "text": "Aquaman and the Lost Kingdom isn’t the wet fart of an ending that it seemed like the DCEU might be going out on, but it also shows that a decade in, the DCEU never quite learned the lessons it needed to. The DCEU is dead, long live the DCU.",
      "author": "Ross Bonaime"
    },
    {
      "text": "In another timeline where Aquaman and the Lost Kingdom had a better marketing campaign, and its main star wasn’t already talking about playing a different character you can easily imagine this being a big hit...",
      "author": "Andrew J. Salazar"
    },
    {
      "text": "Aquaman and the Lost Kingdom struggles with a juvenile tone, a pendulous script and a cast who can't mount the shifting sands of those challenges. Another low point for the DCEU.",
      "author": "Linda Marric"
    },
    {
      "text": "This is a fun movie, but not anywhere near a great one.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Aqua #2 has to be considered a disappointment – one that, in endeavouring to emulate what made Wan’s original the highest-grossing DC film of all time, merely serves up more of the same to increasingly bathetic effect.",
      "author": "Neil Smith"
    },
    {
      "text": "Aquaman and the Lost Kingdom ends the DCEU on an overstuffed note.",
      "author": "Joey Magidson"
    },
    {
      "text": "It’s hard to stay mad, or even flummoxed, at such a thoroughly daffy enterprise.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "This is the way the DC Extended Universe ends. Not with a bang but with an Aquaman.",
      "author": "Matt Singer"
    },
    {
      "text": "At the end of 124 long minutes, both film and audience are deeply immersed in something – but it isn’t seawater.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The follow-up plays sloppier and sillier, and while it’s a colorful, vividly imagined picture at times, it doesn’t sustain the wild adventure that began in 2018.",
      "author": "Brian Orndorf"
    },
    {
      "text": "The final chapter in the canceled Snyderverse series is brined in B-movie buoyancy",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Aquaman and the Lost Kingdom closes the book on the DCEU as a microcosm and parody of the franchise as a whole. A far cry from its predecessor, the film suffers from multiple visions and an unfocused execution. Ultimately a shell of what it could've been:",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "The movie, with all that combat, is staged on an impressively grand scale by the returning director, James Wan, but at the same time there’s something glumly standard about it.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Even the actors seem worn out by the ridiculousness of this sequel.",
      "author": "Lovia Gyarkye"
    },
    {
      "text": "It's a fittingly messy way to end the entire DCEU.",
      "author": "Ian Sandwell"
    },
    {
      "text": "A franchise farewell so underwhelming, nary a tear will be shed over its passing.",
      "author": "Nick Schager"
    },
    {
      "text": "The DCEU is officially over. Aquaman and the Lost Kingdom is the final entry in a decade of messy, hit or miss DC films.",
      "author": "Anthony Gagliardi"
    },
    {
      "text": "So, for me, this movie, which is essentially mid, was also a very entertaining film because of the actors’ performances and the bright and colorful world they are acting in.",
      "author": "Julian Lytle"
    },
    {
      "text": "[A] mostly generic sequel straight out of the assembly line.",
      "author": "Casey Chong"
    },
    {
      "text": "Aquaman 2  is a pale reflection of what was so pleasant in the first film. [Full review in Spanish]",
      "author": "Alberto Corona"
    },
    {
      "text": "I can't (don't want to) turn my back on Aquaman and the Lost Kingdom, which is as adorably silly as the TV cartoons... [Full review in Spanish]",
      "author": "Fausto Fernandez"
    },
    {
      "text": "This neon-coloured addition to the DC superhero world fills the need for stories that are uncomplicated and packed with action instead of backstory.",
      "author": "John Lui"
    },
    {
      "text": "Wan's expertise and the genuine class B spirit that some scenes possess are enough to make the closing of this cycle quite dignified and not hit rock bottom. [Full review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "Since James Wan comes from horror, the suspense scenes should be the best. But they're not.",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "James Wan knows how to make a blockbuster, but in this sequel all his good ideas, and there are many, and every effort to get the audience to have a good time are hindered by cuts, retouches and reshoots. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "Is it a good movie? Not at all, but it can be entertaining enough to not make you regret spending two hours of your time on it. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    }
  ],
  "release_year": 2023,
  "duration": 124,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "age_rating": "PG-13",
  "synopsis": "After failing to defeat Aquaman the first time, Black Manta wields the power of the mythic Black Trident to unleash an ancient and malevolent force. Hoping to end his reign of terror, Aquaman forges an unlikely alliance with his brother, Orm, the former king of Atlantis. Setting aside their differences, they join forces to protect their kingdom and save the world from irreversible destruction.",
  "popularity": 7.9,
  "poster_url": "https://image.tmdb.org/t/p/original/oEyIhY1WzoFHUDE7U3p1AWwyoSN.jpg"
}