{
  "movie_name": "Army of the Dead",
  "movie_id": "army_of_the_dead_2021",
  "total_reviews": 291,
  "reviews": [
    {
      "text": "From the vision of  filmmaker Zack Snyder (300, Zack Snyder’s Justice League) comes ARMY OF THE DEAD: a venturous and captivating new spin on the zombie genre with a splash of Oceans Eleven. Gore, comedy, guts, mayhem …& a Zombie Tiger ?!",
      "author": "Nadya Martinez"
    },
    {
      "text": "Zack Snyder's ridiculously entertaining latest is a zombie heist movie with gore at its core.",
      "author": "Christina Newland"
    },
    {
      "text": "The result is a juvenile, two-and-a-half-hour, overwrought mess that wastes a talented cast in an ugly, CGI-drenched video game pastiche you want to end within a half-hour.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Aside from the incredible zombie tiger that is highlighted in the trailer, it was disappointing how lacking the creativity was within the design of the film.",
      "author": "Amy Smith"
    },
    {
      "text": "Army of the Dead is an algorithmic cleansing exhale in the wake of a whirlwind period in Snyder’s career. As a zombie movie, it’s a shallow, scattershot effort with interesting mythology ideas that don’t really go anywhere.",
      "author": "Anya Stanley"
    },
    {
      "text": "It has equal amounts of emotion and bloodshed, the cast are on point, the humour is hilarious and both the setting and the plot are undoubtedly unique.",
      "author": "Rebecca Johnson"
    },
    {
      "text": "Mixing my two favorite genres,Heist & Zombie horror!!! Snyder infuses his passion and weaves in a touching but badass time. It’s mean, it’s brutal, but it has heart. It’s one of my favorite zombie films in awhile",
      "author": "Zach Pope"
    },
    {
      "text": "With his distinct, divisive filmmaking style completely unrestrained, for better or worst, the standout Dave Bautista and his team fight through the cliches, lack of character development, and excessive runtime to still offer plenty of excitement.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Army of the Dead is precisely the kind of cringe-worthy, dull, and uninspired mess Snyder tends to make when there's no one to control him.",
      "author": "Akos Peterbencze"
    },
    {
      "text": "Army of the Dead is a touch too long, but thanks to aggressive action and a surprisingly touching father-daughter-focused story, Snyder’s zombie epic entertains.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "While Snyder’s obvious creative freedom adds some bloat to the story, you have to love his vision and his commitment to it. And as far as big blockbustery popcorn entertainment goes, Snyder delivers exactly what he promises.",
      "author": "Keith Garlington"
    },
    {
      "text": "Turning the volume up on everything you expect from a Zack Snyder film, it would have looked better in a cinema but will become a cult hit for those who cant get enough survival horror.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Army of the Dead manages to provide ample escapism for a two-and-a-half-hour zombie movie.",
      "author": "Brian Eggert"
    },
    {
      "text": "Zack Snyder delivers his zombie heist flick but it falls into predictable pitfalls despite a promising plot.",
      "author": "Therese Lacson"
    },
    {
      "text": "Overblown, dumb, ugly to look at, and doesn't take advantage of the mayhem offered by its setting.",
      "author": "Witney Seibold"
    },
    {
      "text": "Considering how rewarding the Snyder Cut of Justice League was when unleashed ages ago (actually, in March), I expected more than this.",
      "author": "Jason Shawhan"
    },
    {
      "text": "Enjoyed the group dynamic, violence, world-building, and even the complexity given to the zombies. But I had some issues with the writing including some failed attempts to get me emotionally invested. An okay movie overall.",
      "author": "Rosa Parra"
    },
    {
      "text": "Never one for restraint, Snyder gives his trademark maximalism full rein, delivering a bloated 148-minute movie that favours empty spectacle over humanity.",
      "author": "Matt Glasby"
    },
    {
      "text": "Snyder is an aggregator of inspirations, unabashedly spring-boarding from the giant canonical zombie and action texts. Snyder is a 'Bro' Poet (\"Bro-et\"), and I, for one, enjoy his predictable rhymes.",
      "author": "Blake Howard"
    },
    {
      "text": "Even if there's far too much dimly lit zombie massacring, the film's raw materials are solid.",
      "author": "Alex Hudson"
    },
    {
      "text": "A script that, in addition to relying on numerous clichés, wastes every opportunity it has to differentiate itself from other similar films. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "Army of the Dead hit my must-see radar. Though it fails to rank as either the top zombie or best Nevada movie ever, Army of the Dead provides enough servings of each to warrant a viewing.",
      "author": "Robin Holabird"
    },
    {
      "text": "After an entertaining first act, Army of the Dead quickly devolves into a mess of predictable moments, forgettable characters, and wasted potential.",
      "author": "Rick Marshall"
    },
    {
      "text": "... visually dazzling but also rambling and self-indulgent. Lacking the narrative dexterity to navigate its multilayered concept, it settles for action-hero tropes instead.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Snyder does it again with 'Army of the Dead.'",
      "author": "Linda Cook"
    },
    {
      "text": "A great addition to the zombie genre including a balanced blend of action, thrills, and humor.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "It's an immersive video game experience of action, various levels of zombies -- including boss fights -- and a mixture of weaponry all without picking up a controller.",
      "author": "DarkSkyLady"
    },
    {
      "text": "There's an old-school sense of fun to Army of the Dead that recalls the overblown, unapologetically ridiculous action movies of the 1990s.",
      "author": "Mike Scott"
    },
    {
      "text": "Army of the Dead is easily [Snyder's] most purely enjoyable flick since, oh, at least 300 and arguably his remake of Dawn of the Dead.",
      "author": "Travis Johnson"
    },
    {
      "text": "Overloaded, gross, playful and elongated to the limit (it is clear that with Netflix Snyder was able to impose his cut full of unnecessary or too extended scenes), The Army of the Dead is a song of the obvious. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Army of the Dead may not be a genre game-changer, but it delivers the goods with panache and a genial sense of camaraderie and goodwill.",
      "author": "Rubén Rosario"
    },
    {
      "text": "It's fun, gory, and predictably self-indulgent. Who knows, maybe if enough of you see this, we won't be subjected to more Angry Superman movies.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Yes, there are going to be prequels. And an animated series. Here's hoping they make more sense.",
      "author": "Sameen Amer"
    },
    {
      "text": "A step above Snyder's DCEU films, but never comes close to matching the zombie highs of his \"Dawn of the Dead.\"",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "The visuals are awesome but Snyder didn't do enough with the great concepts that he introduced. It was shot beautifully but that's the only positive about this film.",
      "author": "Justin Brown"
    },
    {
      "text": "It's a half hour too long and some of the decisions made by both the characters and their creator were terrible. Some of the effects were cool but that's not enough to justify watching this two and a half hour film...",
      "author": "Brandon Collins"
    },
    {
      "text": "Tig Notaro steals the scene as a crusty helicopter pilot. But even her sharp, snarky scenes can't solve the movie's central problem - that director Zack Snyder really thinks a gory walking-dead flick needs to run 2.5 hours.",
      "author": "Steve Murray"
    },
    {
      "text": "The most exciting thing is the action and the disaster with the great sequences of terror and action with the unleashed zombies. [Full Review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "The shackles of old studio systems are gone, and the Godfather of zombie action-horror fandom has returned to his favorite playground with colorful aplomb.",
      "author": "Dan Buffa"
    },
    {
      "text": "Army of the Dead may not be a good movie in the typical sense, but is it entertaining? Absolutely. It's a film that would benefit from being seen on the big screen with a ton of amped-up zombie lovers.",
      "author": "Mary Beth McAndrews"
    },
    {
      "text": "It may be very, very dumb (and bloated as all get-out), but I'd be lying if I said I didn't have a blast watching it.",
      "author": "Trace Thurman"
    },
    {
      "text": "While Zack Snyder's distinctive directorial style is plainly evident, he has reined in his worst impulses to give us a clever, entertaining twist on the zombie apocalypse, featuring all the flesh-eating carnage one expects from the genre.",
      "author": "Jennifer Ouellette"
    },
    {
      "text": "It's a zombie movie laid out with a certain style, but lacking a substance to justify the unnecessarily long length. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Absurdly grim, splatter-soaked escapism.",
      "author": "Susan Granger"
    },
    {
      "text": "It's so absurdly obvious that to call it a ripoff might be too charitable.",
      "author": "Matt Lynch"
    },
    {
      "text": "If nothing else, Zack Snyder knows how to craft a stimulating visual tableau and he knows how to put on an extravagant show.",
      "author": "Wenlei Ma"
    },
    {
      "text": "The eclectic ensemble helps a whole lot, and the film offers a barrage of set pieces that are tough to resist.",
      "author": "Scott Weinberg"
    },
    {
      "text": "Snyder and Co. seem to have had a blast designing the crumbling Vegas landscape and zombies in widely varying costumes and states of decay.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Army of the Dead is good mindless fun, but it's far too derivative to ever be truly great-even as a zombie flick.",
      "author": "Erik Kain"
    },
    {
      "text": "Army of the Dead might be an explosive and silly spectacle, but that doesn't make it brainless. If anything, Snyder has proved that there's still plenty of life behind his particular brand of mayhem.",
      "author": "Miles Surrey"
    },
    {
      "text": "Parts of Army Of The Dead are suitably horrific. But, unless you are an inveterate zombie movie fan, its parts do not exactly add up to a movie that will blow your mind.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "There is, despite the twin threats of zombie masses and an imminent nuclear explosion, a strange lack of urgency and tension throughout and what could have easily been a lean and mean 90-minute B movie has been stretched out to 2.5 hours.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "While [director Zack Snyder's] cut of Justice League was positively groaning under the weight of all its themes and ideas, Army of the Dead has absolutely no substance beneath all of its opulence.",
      "author": "Phil W. Bayles"
    },
    {
      "text": "For an all-around mediocre movie, Army of the Dead fares surprisingly well with representation.",
      "author": "Alicja Johnson"
    },
    {
      "text": "Crappy movies can be semi-entertaining, and this is one of those.",
      "author": "Bob Grimm"
    },
    {
      "text": "While it may sound like a hoot - and it occasionally is - the audience never quite shakes the origin story that wasn't and the wanting character development that might have lent the story more resonance.",
      "author": "Neil Morris"
    },
    {
      "text": "The mismatch of tones is intriguing but the more Army of the Dead shifts to accommodate additional changes of focus and tone, the more effortful and lethargic it becomes.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Zack Snyder brings a few innovations to the zombie genre with Army of the Dead, but the film isn't one that sticks with you long after you've viewed it. It's fun, not groundbreaking.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "Army of the Dead does its most to highlight [Zack Snyder's] strengths rather than weaknesses.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "A dumb, post-apocalyptic Las Vegas zombie heist genre movie that's tackled with verve.",
      "author": "Peter Canavese"
    },
    {
      "text": "Army of the Dead delivers great zombie carnage, funny comedic moments, and an unexpected, winding set of potential theories.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "Only Zack Snyder could make a movie about a Vegas casino heist during a zombie apocalypse not an ounce of fun. It's actually impressive how bad of a director he is at this point.",
      "author": "Kent Garrison"
    },
    {
      "text": "The reason Army of the Dead rings hollow despite all these things is that we aren't given enough to get behind when it comes to the characters, and without that, we don't come to feel that the mission is necessary, or the characters' lives are precious.",
      "author": "Hilary A White"
    },
    {
      "text": "...bogged down with useless subplots, pretentious allegories, and failed attempts at character building. But the zombie tiger is great!",
      "author": "Steve Biodrowski"
    },
    {
      "text": "The movie may look cool on the surface and lure you in with potentially new twists in the zombie genre but it quickly devolves into just another undead shoot 'em up with disposable, forgettable stories and characters.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "Zack Snyder is most alive as a director when he is working with the undead.",
      "author": "Matthew Passantino"
    },
    {
      "text": "... interesting ideas constantly getting dropped... the script doesn't matter as long as all the money shots deliver coolness. Even the denouement feels like a cheat...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The story is bloated and amorphous, and whatever targets it might have are murky.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The movie does not have enough interesting things going for it to uphold this run time.",
      "author": "Terence Johnson"
    },
    {
      "text": "Just seeing Las Vegas turned into a walled-off city of shuffling ghouls is kind of an irresistible premise.",
      "author": "Stephen Garrett"
    },
    {
      "text": "Zombies, zombies everywhere! Watch them carefully if you dare. Audacious filming is non-stop. Scenes of horror cause eyes to pop!",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Time flies when you are killing zombies. At least it does in this two hour+ Zack Snyder epic battle movie.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "I think you'll have a good time with it.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "While it's always watchable, the structure is too familiar and contrived to allow for any real suspense. Still, there's still plenty of grisly, nasty fun along the way.",
      "author": "Rich Cline"
    },
    {
      "text": "Zack Snyder's Army of the Dead is a stylish zombie movie and a heist thriller, and a sentimental father-daughter reconciliation story. But more to the point, it's a lot of fun and it's set in Las Vegas. What's not to like?",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "20 minutes in you'll be able to tell if you're with 'Army of the Dead' or not.",
      "author": "Damian Levy"
    },
    {
      "text": "...a mostly watchable (albeit thoroughly erratic) endeavor that fares best in its briskly-paced first and third acts...",
      "author": "David Nusair"
    },
    {
      "text": "For the most part it works in relative proportion to when the material best aligns with Snyder's strengths: BIG shootouts and brawls, messy violent zombie dismemberment, hyper-literal mythic and pop-culture allusions? GOOD... human drama, not so much.",
      "author": "Bob Chipman"
    },
    {
      "text": "Step forward, then, Zack Snyder, with Army of the Dead, a film which has neatly filled the void in the listings which was crying out for something bloody silly. From a personal perspective, it did not disappoint.",
      "author": "Keri O'Shea"
    },
    {
      "text": "A lousy film from top to bottom...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Violent, action-packed, funny, and surprisingly moving, it delivers on everything it should.",
      "author": "Dan Scully"
    },
    {
      "text": "A penniless heist film and a brainless zombie flick.",
      "author": "Luke Parker"
    },
    {
      "text": "Gluttons for mindless, ugly mayhem will enjoy 'Army of the Dead,' but ...it's a pretty overstuffed, bombastic brew.",
      "author": "Frank Swietek"
    },
    {
      "text": "Whether it's the undead or fanboys who bully film studios, you gotta hand it to Snyder. He knows a thing or two about harnessing a horde to realize a vision.",
      "author": "Eric Webb"
    },
    {
      "text": "Still, for all of Army of the Dead's occasionally stitched-together, clumsy feel, individual scenes and sequences deliver Snyder's trademark spectacle with metronymic regularity.",
      "author": "Mel Valentin"
    },
    {
      "text": "Army of the Dead doesn't claim to be anything deep... It's certainly a movie where you can turn your brain off and enjoy the carnage, but it has so many intriguing concepts that you don't necessarily have to. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Army of the Dead is ambitious and gory - a perfect combo for a zombie movie. It takes advantage of Snyder's strengths to an extent that we've only seen a few times...a welcome addition to the ever-expanding zombie oeuvre.",
      "author": "Allen Adams"
    },
    {
      "text": "The way [Snyder] milks every scene, slowing down the pacing and the passage of time, is both a wondrous sight to witness and a terror to sit through.",
      "author": "Jon Espino"
    },
    {
      "text": "Not great. Not terrible, but it really could have just been 90 minutes and done the same thing.",
      "author": "Mark Kermode"
    },
    {
      "text": "Army of the Dead is the kind of movie that requires less thinking and more experiencing. Whether that's a positive or negative will depend on the viewer.",
      "author": "Allen Almachar"
    },
    {
      "text": "Flat as western Kansas.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Although Zack Snyder takes risks, the film is ultimately a crowd-pleaser, which is a genre unto itself...",
      "author": "Noah Gittell"
    },
    {
      "text": "Please, refrain from giving these films your money, or filmmakers will be encouraged to keep making lame and ultimately boringly bland movies.",
      "author": "Beth Accomando"
    },
    {
      "text": "Zack Snyder is at his best when zombies are involved.",
      "author": "Joey Magidson"
    },
    {
      "text": "An audacious two-and-a-half-hour heist movie that feels like the unholy offspring of Michael Bay and Steven Soderbergh, with just a few of Snyder's signature flourishes.",
      "author": "James Croot"
    },
    {
      "text": "A great show, noisy and frenetic... best enjoyed on a screen as large as possible. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "At 150 minutes in length, it pummels you to submission.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "The best way to enjoy The Army of the Dead is not to take anything too seriously, like the director himself. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Batista proves that he really is much more than an imposing figure. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Snyder's sci-fi / horror / heist thriller sweet shop pick-and-mix is brazenly funny and disgustingly gory.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Has too many characters and fails to wring the maximum tension from the set-up, but it's great fun, works in WTF surprises and more than justifies the two prequels... that Snyder has in the postmortem pipeline.",
      "author": "Harry Guerin"
    },
    {
      "text": "Army of the Dead is a delightful action movie that's hurt by an overly serious subplot and an overlong third act.",
      "author": "Kyle Logan"
    },
    {
      "text": "Honestly, Army of the Dead is often a hell of a lot of fun.",
      "author": "TK Burton"
    },
    {
      "text": "While it may be a little overstuffed in terms of cast members and just a tad too long for its relatively bare-bones premise, there's still enough enjoyment to be had in Army of the Dead for any action-seeker, Snyder fan or not.",
      "author": "Lauren Coates"
    },
    {
      "text": "Bloated, bleak, and bleary, \"Army of the Dead\" takes an entertaining action zombie film premise and sucks the life right out of it.",
      "author": "Joel Mayward"
    },
    {
      "text": "Zack Snyder's Army of the Dead provides zero improvements to the zombie genre. Instead it delivers a half-baked heist plot that keeps challenging our suspension of disbelief, hoping that colorful graphics and slow-mo sequences will keep things afloat.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "Army of the Dead can easily be picked apart...not going to lie. But the strong characters, refreshing zombie heist premise, and popcorn fun unabashedly make it one of the most fun movies of the year.",
      "author": "Lee McCoy"
    },
    {
      "text": "Zack Snyder lives for excessive storytelling by stuffing as many insignificant details into his stories as possible.",
      "author": "Valerie Complex"
    },
    {
      "text": "You'd be hard-pressed to find a more mixed-bag effort than Zack Snyder's latest.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "The biggest problem is definitely the script. It's mostly garbage, and mostly not in the enjoyable kind of way.",
      "author": "Daniel Rutledge"
    },
    {
      "text": "The director presents an interesting story that is not able to take advantage of in all the time he has to do it, with too many comings and goings and scenes without much sense. [Full review in spanish]",
      "author": "Alvaro Corujo"
    },
    {
      "text": "Death comes for us all, and if we're fortunate, it's a very slow walker. Enjoying \"Army of the Dead\" doesn't require much more than appreciating that. Our collective starvation for thrills and wonder probably sauces its appeal even more.",
      "author": "Melanie McFarland"
    },
    {
      "text": "A great slice of escapist, zombie-filled, nonsensical fun.",
      "author": "Laura Potier"
    },
    {
      "text": "Army Of The Dead is a strangely pedestrian affair considering that Zack Snyder was given $70 million and carte blanche to make it. It's ultimately just another zombie movie with little originality and and an exorbitant running-time to pad things out.",
      "author": "Niall Browne"
    },
    {
      "text": "I'm not gonna sit here and tell you that this is the smartest movie you'll ever see but it's one hell of an action-horror hybrid featuring some of the most impressive gore Netflix has ever gifted us.",
      "author": "Jonathan DeHaan"
    },
    {
      "text": "Holds nothing back, trying to sock it to us non-stop for 148 minutes.",
      "author": "Tim Brayton"
    },
    {
      "text": "Snyder creates an exciting opening sequence that previews the carnage at hand and there's no shortage of blood involved. This is a zombie movie after all that Snyder pairs with a traditional Las Vegas heist - an Ocean's 11 meets The Walking Dead.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "All I really needed to hear about Army of the Dead was the words 'zombie tiger' and I was ready to cash all my chips in.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "This is a surprisingly light and lean film that sees Snyder at his most creative...It might not ever reach its full potential, but it's never not interesting.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "...a big, multi-layered production, which plays out reasonably engrossingly as times, and has enough wit and imagination to keep the audience semi-rapt...",
      "author": "Eddie Harrison"
    },
    {
      "text": "Enjoyable only as escapism.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "If every zombie movie could be seen as a feature-length commercial for cremation, Army of the Dead is, first and foremost, a vehicular fellatio PSA...What (the film ultimately) proves is giving zombies personalities will not reanimate a dying genre.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "The whole affair is silly, illogical and lacks obligatory humor.",
      "author": "Russ Simmons"
    },
    {
      "text": "Army of the Dead doesn't seem to care much about all that-or for people. It's only lifeless when the living are onscreen.",
      "author": "Melissa Leon"
    },
    {
      "text": "The DC auteur returns to the zombie genre after almost two decades, but it's Dave Bautista's performance that really pulls this movie together...",
      "author": "Norman Wilner"
    },
    {
      "text": "If you want to see a run-and-gun zombie movie, this is your bag.",
      "author": "Kevin Carr"
    },
    {
      "text": "Army of the Dead is designed to be part of a franchise. I don't know how I feel about the prospect of more of these movies but this one allows Snyder to assemble an overflow of genre ingredients and give them a swift, often amusing kick...",
      "author": "Robert Denerstein"
    },
    {
      "text": "If you manage to get past its first third, Army of the Dead will reward you with gory entertainment and a couple of memorable moments of action.[Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "Will appease a hungry section of zombie fans who want excessive, gory violence from the undead, but it's hard to imagine everyone else wanting to come back for seconds.",
      "author": "Jon Negroni"
    },
    {
      "text": "Snyder brings this world to life in a visually mesmerizing way, and this crew of wild characters is so much fun to watch.",
      "author": "Austin Burke"
    },
    {
      "text": "While the film's atmosphere is terrifically structured, it's too robust for a story as thin as this, and as a result, the movie falls flat during moments where it should be soaring.",
      "author": "Owen Butler"
    },
    {
      "text": "Army of the Dead is more interested in playing with fun concepts than in actually being a fun movie.",
      "author": "Emma Stefansky"
    },
    {
      "text": "Working with the Netflix charge card, Snyder has a ball proving that trash can triumph on the largest stage if played with elan and enthusiasm.",
      "author": "Donald Clarke"
    },
    {
      "text": "Instead of lean, nasty genre entertainment, it's a weighty, overly complicated two-and-a-half hour slog with occasional bright spots that serve as a reminder of the movie's squandered promise.",
      "author": "Abby Olcese"
    },
    {
      "text": "In its own bizarre way it works like gangbusters, partly because Snyder doesn't care whether you take any of it seriously or just hoot throughout.",
      "author": "Jake Wilson"
    },
    {
      "text": "Snyder understands the tonality of a modern zombie film. Like Dawn of the Dead, it's where his trademark snark shines best.",
      "author": "Robert Daniels"
    },
    {
      "text": "Daft fun with a touch of heart and a bucket of gore.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "While they attempt to provide reasons to become emotionally attached to characters, it's a big ask.",
      "author": "George M. Thomas"
    },
    {
      "text": "All in all, this is an unapologetically fun watch that will hopefully serve as a springboard for Snyder off the back of his DC endeavours.",
      "author": "Nick Drew"
    },
    {
      "text": "Army of the Dead is a fine addition to the zombie movie pantheon, and a decent heist flick too.",
      "author": "Chris Knight"
    },
    {
      "text": "There are enough bits of social commentary to meaningfully tether it to the lineage of Romero's shrewd and thought provoking work in the genre but not so much to distract from the pure video game glee of grisly headshots and memorable world building.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The Army of the Dead is too scattershot, perhaps too derivative and definitely too long. But it's definitely a movie, as well as a perfectly acceptable turn-your-brain-off entertainment.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "The wisecracks the crew trade during their extended killing spree are not funny, Snyder fails to restrain his slo-mo tic, and one emerges from the wreckage of Las Vegas none the wiser, and slightly stupider.",
      "author": "Paul Whitington"
    },
    {
      "text": "A riotous ride... well worth waiting for. Even at two and half hours long.",
      "author": "Adam Sweeting"
    },
    {
      "text": "Army of the Dead is sadly just not that special.",
      "author": "Matthew Razak"
    },
    {
      "text": "The gore is pleasantly gloopy, the action well-handled, and the slow motion kept to a minimum and is more effective as a result.",
      "author": "John Bleasdale"
    },
    {
      "text": "A completely serviceable zombie and heist film.",
      "author": "Doug Walker"
    },
    {
      "text": "It's bloated and silly and puerile and absurdly grisly, but nevertheless resembles that elusive thing known as Actual Fun.",
      "author": "John Serba"
    },
    {
      "text": "While there are some inspired moments that will make you chuckle and/or look away from the screen in repulsion, the flick is predominantly braindead.",
      "author": "Larry Carroll"
    },
    {
      "text": "Netflix and Zack Snyder's Army of the Dead is a big, bad bonkers and incredibly violent delight of a zombie movie.",
      "author": "Scott Campbell"
    },
    {
      "text": "I had a blast watching it.",
      "author": "Jim Judy"
    },
    {
      "text": "Individual set-pieces are spectacular, but this meandering, sometimes mournful affair is more interested in world-building and backstory than the task at hand.",
      "author": "Sean Burns"
    },
    {
      "text": "Army of the Dead ( ... ) doesn't take itself too seriously, and wants to entertain the audience with action, zombies, and gore. It may not be flawless, but it's fun and memorable.",
      "author": "Marianna Neal"
    },
    {
      "text": "The lowliest one-legged ghoul in this bloodbath possesses more grace than the script.",
      "author": "Sean Collier"
    },
    {
      "text": "As zombie movies go, I really liked this one... It was quite cleverly done.",
      "author": "Andy Klein"
    },
    {
      "text": "[Zack Snyder] has made a light-footed zombie epic. I guess you'd have to call it an epic when it's that long -- two-and-a-half hours.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Army of the Dead has no real pretentions about being something deeper, and cashes in all its chips on \"fun\" and \"cool\".",
      "author": "Jennifer Heaton"
    },
    {
      "text": "The best aspects of \"Army of the Dead\" are hindered by undue excess.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Not bad -- and not four hours long...",
      "author": "Kurt Loder"
    },
    {
      "text": "The film's biggest problem - the whopping 148-minute running time feels too long for its own good.",
      "author": "Casey Chong"
    },
    {
      "text": "Fresh by the barest of margins. A bloated action film that disproportionately focuses on the wrong people at the wrong time. However. Zombie Tigers do cure what ails me. A 90 minute action film stretched over two and half hours.",
      "author": "Andrew Mack"
    },
    {
      "text": "You can't help but appreciate Snyder for the vision he brings to his projects, even if you disagree with so many decisions that go along with them.",
      "author": "Mark Meszoros"
    },
    {
      "text": "All of Snyder's worst tendencies are on display... Style often comes over substance, and you really feel it.",
      "author": "Kevin Brackett"
    },
    {
      "text": "Army of the Dead grills its cheese to a crisp, but Bautista adds some healthy flavor. His headshots never miss your heart.",
      "author": "Darren Franich"
    },
    {
      "text": "Writer-director Zack Snyder, never known for his restraint, pulls out the stops even more extravagantly than usual...",
      "author": "Brian Viner"
    },
    {
      "text": "Netflix's Army of the Dead is a failed genre homecoming for [Zack] Snyder after 17 years.",
      "author": "Akhil Arora"
    },
    {
      "text": "[F]unny, exciting, blockbuster-size entertainment from a filmmaker firing on all creative cylinders.",
      "author": "Mark Hughes"
    },
    {
      "text": "Snyder builds up the Alpha Zombies to ride horses and hold hostages like an elevated species, suggesting there's more than meets the eye. Then he settles for a finale we've seen a million times. At 2 1/2 hours, the film eats itself.",
      "author": "Jason Fraley"
    },
    {
      "text": "A remorseless, brazen rip-off of Aliens, down to outfitting a monster-killing badass exactly like Jenette Goldstein's \"Vasquez\" and to cribbing a few lines from James Cameron's script wholesale.",
      "author": "Walter Chaw"
    },
    {
      "text": "Bizarre and occasionally brilliant...the characterizations are far better and far deeper than you would ever expect from a zombie apocalypse film.",
      "author": "Michael Medved"
    },
    {
      "text": "Something really interesting could have been made out of the relationship between the humans and the evolved zombies but, in the end, there's nothing that those zombie's heightened awareness brings to the film.",
      "author": "Robert Martin"
    },
    {
      "text": "It's mindless fun - no more, and no less.",
      "author": "Angie Han"
    },
    {
      "text": "On the whole, the film is sharply cast with a group of actors we haven't seen in a zillion things and who distinguish themselves well.",
      "author": "Richard Lawson"
    },
    {
      "text": "Army of the Dead provides exhilarating blockbuster entertainment.",
      "author": "Matt Conway"
    },
    {
      "text": "It's a really fun escape that captures the magic of the summer blockbuster with great action set pieces and a badass ensemble, it's so hard not to recommend.",
      "author": "Rendy Jones"
    },
    {
      "text": "Expertly paced and with top-notch special effects, \"Army of the Dead\" is a popcorn zombie movie for our time. Long live the undead.",
      "author": "Mark Kennedy"
    },
    {
      "text": "While it does some fascinating things with the zombie genre that we haven't seen since George A. Romero, Army of the Dead ends up bogged down by its own self-importance and forgets how fun it's supposed to be.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Army of the Dead is a fine action-horror movie that has some standout moments ... but the winning performances and cool spectacle are often undermined due to its by-the-numbers story.",
      "author": "Rob Dean"
    },
    {
      "text": "There's enough fake blood here to fill the Dead Sea but as stylish as the slo-motion CGI plasma sprays are, the movie, at 148 minutes it feels overlong and is a bit too deliberately paced.",
      "author": "Richard Crouse"
    },
    {
      "text": "Its grim images of quarantined refugees and rotting hordes summon a bleakness at odds with its most fun creation: An elite zombie power couple with functioning brains. Snyder should probably have given them final cut.",
      "author": "Jeannette Catsoulis"
    },
    {
      "text": "\"Army of the Dead\" is more than the sum of its basted-together parts - barely.",
      "author": "Ty Burr"
    },
    {
      "text": "Although trapped surfing a wave of predictability, Snyder delivers enough gore to keep zombie movie fans happy and enough adrenaline-driven action to maintain a high level of suspense.",
      "author": "James Berardinelli"
    },
    {
      "text": "The writing in director Zack Snyder's films, especially when he insists on doing it himself, is more lifeless than any zombie that he has ever put on screen. His heart remains, as always, is in the right place. But his storytelling gets in the way.",
      "author": "Rohan Naahar"
    },
    {
      "text": "In fairness, there is plenty that Snyder didn't lift directly from James Cameron, and that material sticks out for an entirely different reason: uniform stupidity.",
      "author": "Ian Simmons"
    },
    {
      "text": "\"Army of the Dead\" grows tiresome before it finally settles on a conclusion, but Snyder has always been better with introductions than payoffs.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Army of the Dead injects some much needed vitality into modern zombie films and Zack Snyder's career as a filmmaker. Gory as hell and entertaining through and through, Army of the Dead is a must-watch for action and horror film fans alike.",
      "author": "Chris Sawin"
    },
    {
      "text": "An energetic romp unafraid to feel grisly without wholly depending on comedy, it plays like a reprieve for Snyder, shrugging off the weight of expectation for something purely entertaining.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Snyder shoots with a blockbuster strut and plots like a 14-year-old raiding their parents' drinks cabinet.",
      "author": "Danny Leigh"
    },
    {
      "text": "The most surprising thing about Army of the Dead is how little of Snyder's signature style comes through.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "Army of the Dead sadly reveals a director with a personal brand and opulent filmmaking style that has undermined whatever vitality existed in this premise.",
      "author": "Jim Vorel"
    },
    {
      "text": "If you're a Snyder fan, you'll be right at home in the visionary's go-for-broke, testosterone-fueled mindscape.",
      "author": "Phil Villarreal"
    },
    {
      "text": "With zombie tigers, zombie queens, zombie kings and zombie Elvis rearing their ugly heads throughout, watching Snyder's latest is like hitting the zombie jackpot.",
      "author": "Asher Luberto"
    },
    {
      "text": "The narrative would've been better served by a bit more humanity, and a bit less of the splattered heads, but Army of the Dead is still a ton of fun, showcasing a playfulness that was sorely missing from Snyder's grim approach to superhero films.",
      "author": "Brent Hankins"
    },
    {
      "text": "Vegas ain't the same anymore in Army of the Dead",
      "author": "Kathia Woods"
    },
    {
      "text": "Army of the Dead is exactly the kind of uber-stylish, ridiculously muscular, exceptionally juvenile storytelling that he's made his bones on.",
      "author": "Barry Hertz"
    },
    {
      "text": "Taking a typically maximalist approach to the genre, it's essentially a zombie apocalypse Ocean's Eleven...",
      "author": "Alistair Harkness"
    },
    {
      "text": "[I]nstead of engaging with anything new and interesting it puts its heavy focus on the well-worn material and paper thin characters.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "Who would have thought combining a zombie movie with a heist movie could be so fun? Zack Snyder did, and thank goodness because this movie is a blast!",
      "author": "Tessa Smith"
    },
    {
      "text": "Snyder's souped-up Abercrombie zombies might not carry the same threat as Romero's undead or Boyle's infected, but Army of the Dead remains a ton of gory fun, which never takes itself too seriously, and neither should we.",
      "author": "Matt Rodgers"
    },
    {
      "text": "It's the opposite of Snyder's DC Comic movies for Warner Bros which always feel constricted. Here the ebullience is organic.",
      "author": "Roger Friedman"
    },
    {
      "text": "Army of the Dead is a truly fun blockbuster, something we haven't often seen since the start of the pandemic. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "This movie was an absolute blast. I had such a good time with this movie.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Zack Snyder and his co-writers, Shay Hatten and Joby Harold, offer up plenty of zombies and graphic violence, but the one thing they forget is developing any kind of sense of suspense.",
      "author": "Alex Bentley"
    },
    {
      "text": "If some of the emotional notes feel a bit tacked on and it doesn't quite work on the deeper level it aspires to, then it is at least outrageously entertaining.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Snyder's first zombie film since his debut feature, the 2004 remake of \"Dawn of the Dead,\" is his most enjoyable in 17 years as well.",
      "author": "Bob Strauss"
    },
    {
      "text": "A savage zombie spectacular that sees Netflix bring the best out of Zack Snyder. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "The result is so vivid, operatic and giddily entertaining that it's positively crying out for the communal joys of the multiplex experience.",
      "author": "Kevin Maher"
    },
    {
      "text": "Zack Snyder delivers another wicked zombie prologue but then takes his foot off the gas and allows too much talking and not enough tension to drain the energy out of its lengthy running time.",
      "author": "Erik Childress"
    },
    {
      "text": "It's bombastic with copious amounts of gore while also containing heartrending philosophical notions regarding survival amidst nihilistic horror; however, it's also a lot of flash with little meaning, relying on intertextuality to convey significance ...",
      "author": "Douglas Davidson"
    },
    {
      "text": "What fans most want from a big-budget zombie movie is that it not pull any punches. Without spoiling, we can safely say this resembles that remark.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Zack Snyder's zombie heist movie is hardly original, and yet, because of its cast and hardy sense of humor, it marginally succeeds as an action/horror roller coaster ride.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Army of the Dead and Snyder's remake of Dawn of the Dead constitute two of the better modern zombie films that have been made.",
      "author": "Dan Murrell"
    },
    {
      "text": "Here's an idea: cut the fat and bring it in at 90 minutes. That would be a Snyder Cut worth the fuss.",
      "author": "Adam Graham"
    },
    {
      "text": "An overwhelming, violent and wildly fun zombie orgy. Pure Zack Snyder. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "The ending part still seems to be something that Snyder can't get right, building a cool, big scale concept, and forgetting how to flesh out the adventure. Army of the Dead is fun when it's not thinking too much.",
      "author": "Leo Brady"
    },
    {
      "text": "An old-school gorefest from Zack Snyder that harkens back to his fast-paced take on Dawn of the Dead -- hiss-able villains, disposable side characters and oodles of blood.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Netflix and Snyder knocked it out of the park with Army of the Dead. It's a fantastic summer blockbuster that delivers big action, entertaining characters and breathes new life into the zombie genre. Mixing zombies and a heist film was brilliant.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Zack Snyder's new zombie movie works differently than his grand comic-book myths. It's a grim vision of modern dystopia, outrageous and not very funny.",
      "author": "Armond White"
    },
    {
      "text": "Kinda like a video game, and likewise solid if predictable genre fun.",
      "author": "Tom Meek"
    },
    {
      "text": "Like all Snyder movies, there's a dark, mordant humor to the picture; the safecracker Dieter (Matthias Schweighöfer) is one of my favorite supporting characters in some time.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Army of the Dead takes two and a half hours to tell about 60 or 70 minutes of story, which wouldn't be as great an issue if so much of it wasn't familiar.",
      "author": "Michael Gingold"
    },
    {
      "text": "A talented cast. But a big bowl of zombie leftovers.",
      "author": "James Verniere"
    },
    {
      "text": "... hair-raising, heart-stopping and hilarious throughout its indulgent 2-hour-and-28-minute runtime ...",
      "author": "Dana Barbuto"
    },
    {
      "text": "Not enough chills and spills to keep this belabored adventure engaging.",
      "author": "Evan Dossey"
    },
    {
      "text": "The highs Snyder reaches in his cinematography and choreography don't quite solve the problems he creates within his narrative. Still, Netflix viewers can do a lot worse.",
      "author": "Callum Crumlish"
    },
    {
      "text": "[The] potentially divisive ending doesn't take away from Army of the Dead delivering plenty of thrills and chills that make it a better-than-average zombie movie.",
      "author": "Carla Hay"
    },
    {
      "text": "While it could fare a little better with a shorter run time, 'Army of the Dead' gives a lot of fun, firepower, zombies, and likable characters.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Snyder has overloaded the movie with too many characters to keep track of, too many soft-focus views of the crumbling Vegas skyline, and too much wasted effort to make a grandiose epic out of what should be a sleek, speedy action movie.",
      "author": "Sean P. Means"
    },
    {
      "text": "Army of the Dead is just enough about people dealing with the aftermath of crisis -- even if the film really is just about zombies.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Zack Snyder clearly felt little pressure to cut in assembling this two-and-a-half-hour zombie/heist hybrid. The result is a Netflix movie that yields plenty of striking shots -- a Snyder specialty -- without giving enough life to its non-zombie cast.",
      "author": "Brian Lowry"
    },
    {
      "text": "It's the frustrating part about watching a Snyder movie: he serves steak and makes the garnish pass for a side. This movie should have been dessert for all three courses.",
      "author": "Jake Kring-Schreifels"
    },
    {
      "text": "The film's masterful prologue writes a check that the remainder of this very long, very indulgent film labors mightily to cash.",
      "author": "Chuck Bowen"
    },
    {
      "text": "Army of the Dead is a decent movie in the action / horror categories, with the emphasis on the former.",
      "author": "Allison Rose"
    },
    {
      "text": "\"Army of the Dead\" is overstuffed and ridiculous but that is partly why it's irresistible.",
      "author": "Randy Myers"
    },
    {
      "text": "There's a better and significantly shorter film in there somewhere, hidden in plain sight, but the movie just drags along its exhausting running time, diluting any sort of fun that might be had. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "Zack Snyder continues his glorious comeback with a brain-splattering, action-packed new take on the zombie genre.",
      "author": "Julian Roman"
    },
    {
      "text": "What Snyder clearly is showing with this near-two-and-a-half-hour epic of the undead is that he is capable of once again having fun making this stuff, and by extension making sure we have a blast too.",
      "author": "Pete Hammond"
    },
    {
      "text": "If this film were tightened up, it would've been absolutely great. As it stands, Army of the Dead is merely good.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "A rare case of giving people exactly what is advertised but also how much better a filmmaker Snyder is now than when he made Dawn of the Dead.",
      "author": "Edward Douglas"
    },
    {
      "text": "An amalgamation of all things Zack Snyder; it might not fully come together, but damn, is it ambitious and easy to admire",
      "author": "Robert Kojder"
    },
    {
      "text": "An engrossing and a truly unexpected thrill ride that dares to mix things up with the tried-and-true zombie formula we're all too familiar with these days.",
      "author": "Heather Wixson"
    },
    {
      "text": "Aliens meets Oceans 11 - lots of fun & very current. Female characters are particularly good & Tig Notaro was a brilliant last minute addition. And that Zombie Queen & Tiger!",
      "author": "Grace Randolph"
    },
    {
      "text": "We won't need a Snyder Cut of Army of the Dead. This is a Zack Snyder movie through and through.",
      "author": "Matt Singer"
    },
    {
      "text": "A good father-daughter reconciliation story gets consumed by genre tropes in Zack Snyder's exhausting new movie.",
      "author": "Matt Goldberg"
    },
    {
      "text": "Everyone here has been cast for their faces, not their names - and Snyder's camera examines the toll taken by the heist on each one of them closely, most of all Bautista's, which remains one of the most soulful in modern Hollywood.",
      "author": "Robbie Collin"
    },
    {
      "text": "I like zombie movies as much as the next guy, but let's be honest: There's filler here.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "Zack Snyder makes zombies cool again in Army of the Dead, but falls into bad habits along the way. Dave Bautista, however, steals the show, and the movie is fun, dumb, and wacky enough to make this a franchise we hope to sink our teeth into again.",
      "author": "Josh Wilding"
    },
    {
      "text": "Essentially a standard-issue zombie movie, albeit an extremely well-executed entry in the genre...",
      "author": "Richard Roeper"
    },
    {
      "text": "In the end, Army of the Dead just feels a bit pointless. It's a shame because there was some great potential here. It seems to be another case of Zack Snyder taking himself a bit too seriously.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "Army of the Dead is a thoroughly entertaining shoot 'em up.",
      "author": "James Mottram"
    },
    {
      "text": "\"Army\" is a compelling twist on the genre and a gamble by Netflix, which, if it pays off, will give the streaming service a huge original zombie universe.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Hits the beats you expect from both heist films and zombie flicks while still managing to deliver some fresh mythology of its own.",
      "author": "Rob Hunter"
    },
    {
      "text": "An evolution of and homage to his first feature, with direct references and a return to its snarky and cynical tone. Much like \"Dawn,\" \"Army of the Dead\" is sarcastic, funny, shockingly bloody and almost unbearably bleak.",
      "author": "Katie Walsh"
    },
    {
      "text": "Zombie Elvis, undead showgirls, a mutated tiger Joe Exotic would kill for, and an impossible heist mission. What the f**k is there not to love about Army of the Dead??",
      "author": "Travis Hopson"
    },
    {
      "text": "Army of the Dead resembles nothing so much as a watered-down Aliens with slot machines.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "A Baroque tapestry of blood, bullets and bones - one that's never short of memorable imagery, even if its symbolism is so obvious that it feels like it's been screamed through a megaphone.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Zack Snyder has skillfully understood the assignment, and George A. Romero would be proud that the filmmaking visualist hasn't forgotten the political and social edge of his zombie classics.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Army of the Dead is an absolute blast from beginning to end. Snyder continues to elevate the zombie genre while pulling off a heist movie infused with comedy and lots of heart.",
      "author": "Sharronda Williams"
    },
    {
      "text": "It's fun and unpretentious, driven more by its action set pieces than anything else.",
      "author": "Brian Tallerico"
    },
    {
      "text": "No, it didn't have to be two and a half hours long, but it's still bloody fun and absurdly intense. It's not art, but it's not trying to be. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "'Army Of The Dead' bluffs its way through a bonkers narrative written too frustratingly thin to support otherwise explosive action that splatters zombie heads like Jackson Pollock paintings.",
      "author": "Matt Donato"
    },
    {
      "text": "The director's return to the zombie genre has resulted in an entertaining and personal movie. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "It's a good enough formula, with the makings of a solid piece of pop confection -- and that's basically what Snyder delivers.",
      "author": "K. Austin Collins"
    },
    {
      "text": "Army of the Dead is a lot, and while it's about 30-minutes too long just when you look at your watch to check the time, the last act pulls you back in with a balls to the wall action ending that really seals the deal.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Army of the Dead packs in more plotlines than the typical monster flick, and most of them are surprisingly successful, despite keeping the film busier than it needs to be.",
      "author": "Cynthia Vinney"
    },
    {
      "text": "It's very much a Zack Snyder production: unwieldy but absorbing, awash in bone-crunching violence, stilted dialogue, ridiculous-verging-on-sublime needle drops (hello, Cranberries) and have-it-both-ways political subtext.",
      "author": "Justin Chang"
    },
    {
      "text": "Imagine the most glorious, goriest orgy of zombie excess. Now imagine that's not nearly enough and you'll have a pretty good idea of what's going on in \"Army of the Dead.\"",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "I guess I'm just instantly down for Snyder's 'of the Dead' movies.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Tonally, the film is all over the place. The film doesn't achieve a balance between the two, feeling odd and out of place for this genre.",
      "author": "Dewey Singleton"
    },
    {
      "text": "Possibly the most ambitious zombie movie ever made. A blast from start to finish.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Army of the Dead is bloody fun! Zack Snyder's style and vision match perfectly with the zombie genre. Full of great zombie action, character banter and killer music. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "It's often quite funny, it's got terrific action, and (sorry) some very welcome brains. It's a blast.",
      "author": "Justin Harrison"
    },
    {
      "text": "This is action-horror perfection! Snyder may have the best American zombie movie in quite some time.",
      "author": "EJ Moreno"
    },
    {
      "text": "It starts off great. But then it goes on. And on. And on. And takes itself ever more seriously at each turn.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Will Army of the Dead change the minds of Snyder critics? Probably not. But for Snyder fans and anybody in the mood for bloodthirsty zombie action, the movie hits the jackpot.",
      "author": "Ian Sandwell"
    },
    {
      "text": "While it's the best film Snyder has made since his last of the Dead, it's also one that continually hints at the more satisfying work it might have been.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Snyder's Army of the Dead isn't on par with his killer remake Dawn of The Dead, but it's entertaining, featuring satisfying kills and a solid performance from Dave Bautista.",
      "author": "Courtney Howard"
    },
    {
      "text": "It's refreshing to see Snyder reignite his first love with this romp of a genre mash-up that lets Snyder loose with his most gleeful indulgences, almost as much as his worst excesses.",
      "author": "John Nugent"
    },
    {
      "text": "It's a shame that Army of Dead falls so flat, because the concept of a zombie heist movie is undeniably intriguing, particularly at a time when we all need a little escapism.",
      "author": "Hannah Strong"
    },
    {
      "text": "The movie felt ambitious and entertaining at first, but its biggest sin is that it ended up being so boring. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "Mostly... Zack Snyder just seems to be having genuine fun.",
      "author": "A.A. Dowd"
    },
    {
      "text": "There's a certain fun to be had in Army of the Dead, but it's the mindless, ugly fun that you wake up the next day regretting. Come to think of it, it's kind of like a trip to Las Vegas.",
      "author": "Chris Evangelista"
    },
    {
      "text": "It's overlong and laboured in places, but worth a bite for the money-shot set-pieces.",
      "author": "Jamie Graham"
    },
    {
      "text": "Snyder's a true believer in go-for-broke escapism and at its best, the mayhem in \"Army of the Dead\" is an infectious zombie bite of its own.",
      "author": "Eric Kohn"
    },
    {
      "text": "The combination of a zombie outbreak, the Vegas setting and Zack Snyder's eye results in a downright stunning display of zombie mayhem and carnage.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "The energy and inventiveness on display at all levels here - not to mention the sly humor - make Army of the Dead an ass-kicking epic franchise debut.",
      "author": "David Rooney"
    },
    {
      "text": "Snyder's Army of the Dead delivers some compelling action and shocking visuals, but isn't clever or fun enough to be more than a shallow zombie flick.",
      "author": "Molly Freeman"
    },
    {
      "text": "Zack Snyder's overlong and imbalanced \"Army of the Dead\" bites off more than it can chew.",
      "author": "Nate Adams"
    },
    {
      "text": "A stylishly grandiose, muscular but conventional popcorn pageant that's got something for just about everyone.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Army of the Dead is a Zack Snyder movie through and through. It's an imaginative and absolutely thrilling ride that is hard not to enjoy.",
      "author": "Charlie Ridgely"
    },
    {
      "text": "It's all just one monumental splatterfest, where the zombies' army of the dead face off against people who aren't very alive, and all basically without jokes.",
      "author": "Peter Bradshaw"
    }
  ],
  "release_year": 2021,
  "duration": 148,
  "genres": [
    "Horror",
    "Action",
    "Adventure",
    "Crime"
  ],
  "age_rating": "R",
  "synopsis": "From filmmaker Zack Snyder (300, Zack Snyder's Justice League), ARMY OF THE DEAD takes place following a zombie outbreak that has left Las Vegas in ruins and walled off from the rest of the world. When Scott Ward (Dave Bautista), a displaced Vegas local, former zombie war hero who's now flipping burgers on the outskirts of the town he now calls home, is approached by casino boss Bly Tanaka (Hiroyuki Sanada), it's with the ultimate proposition: Break into the zombie-infested quarantine zone to retrieve $200 million sitting in a vault beneath the strip before the city is nuked by the government in 32 hours. Driven by the hope that the payoff could help pave the way to a reconciliation with his estranged daughter Kate (Ella Purnell), Ward takes on the challenge, assembling a ragtag team of experts for the heist. They include Maria Cruz (Ana de la Reguera), an ace mechanic and Ward's old friend; Vanderohe (Omari Hardwick), a zombie killing machine; Marianne Peters (Tig Notaro), a cynical helicopter pilot; Mikey Guzman (Raúl Castillo), a go-for-broke influencer and Chambers (Samantha Win), his ride-or-die; Martin (Garret Dillahunt), the casino's head of security; a badass warrior known as the Coyote (Nora Arnezeder) who recruits Burt Cummings (Theo Rossi), a slimy security guard; and a brilliant German safe cracker named Dieter (Matthias Schweighöfer). Scott finds an unexpected emotional hurdle when Kate joins the expedition to search for Geeta (Huma S. Qureshi), a mother who's gone missing inside the city. With a ticking clock, a notoriously impenetrable vault, and a smarter, faster horde of Alpha zombies closing in, only one thing's for certain in the greatest heist ever attempted: survivors take all.",
  "popularity": 7.4,
  "poster_url": "https://image.tmdb.org/t/p/original/z8CExJekGrEThbpMXAmCFvvgoJR.jpg"
}