{
  "movie_name": "Avatar",
  "movie_id": "avatar_the_way_of_water",
  "total_reviews": 454,
  "reviews": [
    {
      "text": "Nothing more quickly hollows out a society than hatred of immigrants, whether practiced by blue aliens on Pandora or red hats in Trump’s America.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "It is admirable as a viewing experience, but it has none of the emotional conviction that makes a true movie classic.",
      "author": "Christina Newland"
    },
    {
      "text": "James Cameron’s long-awaited blockbuster sequel, Avatar: The Way of Water, is a big, boisterous, beautiful return to Pandora.",
      "author": "William Stottor"
    },
    {
      "text": "Avatar: The Way of Water, the long awaited sequel to Cameron’s Avatar - the highest grossing film of all time - was ultimately mesmerizing and a mind-blowing immersive visual experience taking audiences on a epic adventure unlike anything seen before.",
      "author": "Nadya Martinez"
    },
    {
      "text": "Overall, Avatar: The Way of Water is a colossal disappointment on a story and character level, saved only by its stunning visuals (at least when they’re not too garish).",
      "author": "Swara Salih"
    },
    {
      "text": "The first Avatar was a spectacular display of technical prowess. It utilized Cameron’s brilliant populist instincts to capture the imagination of the planet. By comparison, The Way of Water feels like a pale imitation.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Did I think this movie would be made? No. Did I think it would crack my Top 10? Also no. But here we are.",
      "author": "Dave Giannini"
    },
    {
      "text": "'Avatar: The Way of Water' pops with well-rendered images and vibrant colors. It's like you’re witnessing Cameron film a National Geographic documentary on an alien planet. It evokes all the senses.",
      "author": "Preston Barta"
    },
    {
      "text": "James Cameron's Avatar sequel has stunning visuals that get elevated on a big IMAX screen. However, the plot is less than engaging, the dialogues are clunky, and you wish it was shorter.",
      "author": "Mini Anthikad-Chhibber"
    },
    {
      "text": "The preservation of our woods is the central topic of the first Avatar film and the topic of Avatar: The Way Of Water is ocean preservation. To summarize, don’t doubt James Cameron.",
      "author": "Christian Eulinberg"
    },
    {
      "text": "The special effects are breathtaking...Like all sequels, the original was a bit better.",
      "author": "Michael Cook"
    },
    {
      "text": "Technology used to make the film is so compelling and masterful that everything else is an afterthought.",
      "author": "Rick Bentley"
    },
    {
      "text": "Whatever may be wrong with it, Avatar: The Way of Water is pure, unabashed cinema, with some of the most glorious visuals ever put to screen and an endlessly absorbing soundtrack.",
      "author": "Ilan Preskovsky"
    },
    {
      "text": "The Way of Water is somehow even better than its already masterful antecedent.",
      "author": "David Bax"
    },
    {
      "text": "The Way of Water clearly sets itself apart from other blockbusters, building on 13 years of preparation to deliver a memorable cinema experience. A visually, technically breathtaking adventure, particularly in the truly stunning underwater sequences.",
      "author": "Manuel São Bento"
    },
    {
      "text": "The Way Of Water  is not just one of the best sequels ever created… it’s a god damn masterpiece. Breathtaking, visually stunning, & epic in every single way. I’m truly speechless by what James Cameron has crafted",
      "author": "Zach Pope"
    },
    {
      "text": "Would you like to go on venture number three in the world of Pandora? After the first one, I would have said, “no, thanks”, but now, bring it on.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "As with the first film, it’s impossible to deny that audiences will be treated to a visual feast in The Way of Water, but those looking for a more character-driven movie will be left adrift in the open water.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "Unlike every CGI-heavy theme park ride, the fact that the spectacle and the action sequences never undermine the narrative or emotionally stirring moments is mind-boggling.",
      "author": "Pramit Chatterjee"
    },
    {
      "text": "We’re nowhere close to Cameron at his best, but I feel we’re approaching something worth experiencing.",
      "author": "Grant Watson"
    },
    {
      "text": "We can accept a barebones revenger because it lets us reacquaint ourselves with Pandora. Cameron is easing us back in with a conflict we don't need to expend too much energy on so we can absorb everything else in the background.",
      "author": "Jared Mobarak"
    },
    {
      "text": "I’ll say this for James Cameron: At this point, he can slap his name on an old print of Plan 9 From Outer Space, re-release it as Avatar 3: The Way of Outer Space, and incessantly hype it until it crosses the billion-dollar mark and racks up the awards.",
      "author": "Matt Brunson"
    },
    {
      "text": "This is a blatant example where the visual spectacle (it can dazzle but also fatigue) swallows up an unexceptional story.",
      "author": "Filipe Freitas"
    },
    {
      "text": "It might be tiresome in a world less lovingly, painstakingly rendered than Pandora, which has no shortage of eye-boggling backdrops to distract us from the humdrum interpersonal conflicts and the cheeseball dialogue, a Cameron staple.",
      "author": "John Serba"
    },
    {
      "text": "By the time Cameron finishes these things he’ll be a form of consciousness uploaded to the Cloud, married to a hologram of Mia Goth.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "A lot of audiovisual marvels offer a sensible mark upon a film that does not reach greater depths.  [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Why not strip it down to the sincere basics? Get the family out of the forest faster, and for a more respectable reason. In fact, the subplot of the forest family living among the water people is way better than the main plot. Gorgeous though.",
      "author": "Ross Anthony"
    },
    {
      "text": "It’s a shame that female characters have devolved since the first film, which came out over a decade ago.",
      "author": "Carolyn Hinds"
    },
    {
      "text": "But the film, for all its scale and excess, for all its lovingly detailed environments, feels bloated and less than the sum of its parts.",
      "author": "Travis Johnson"
    },
    {
      "text": "Avatar: The Way of Water is nothing short of a cinematic marvel, outweighing its predecessor on many fronts.",
      "author": "Marriska Fernandes"
    },
    {
      "text": "Avatar: The Way of Water is more of an attraction than the movie itself - magnificent technology is swapped for dialogue deprived of meaning.",
      "author": "Annie Banks"
    },
    {
      "text": "You can't deny: Experience matters.",
      "author": "Bob Chipman"
    },
    {
      "text": "The visual experience is impressive and immersive, but it's no longer novel, which makes the hokeyness of the story — about the battle between the Indigenous inhabitants of the planet Pandora and would-be Earth colonizers — more noticeable.",
      "author": "Alison Gillmor"
    },
    {
      "text": "Avatar is like some rare mineral, produced by one man's ill-conceived aesthetic taste placed under the immense heat and pressure of the blockbuster industry. The product is scintillating, beautiful, and feels fairly useless.",
      "author": "Erin Schwartz"
    },
    {
      "text": "Cameron ... has been fortunate to have emerged—and could only have emerged—in a culture that demanded so little: efficiency, productivity, special effects innovation, sustained bursts of mechanical spectacle, a minimum level of dramatic believability.",
      "author": "David Walsh"
    },
    {
      "text": "[M]oviegoers have waited 12 years for Cameron’s sequel to finally arrive. Luckily its time has come, and Avatar: The Way of Water does not disappoint.",
      "author": "Corey Chichizola"
    },
    {
      "text": "James Cameron has done it again.",
      "author": "Marie Asner"
    },
    {
      "text": "...a thoroughly needless followup that easily stands as Cameron’s least effective endeavor to date.",
      "author": "David Nusair"
    },
    {
      "text": "In The Way of Water Cameron seems to be joyously beckoning for us to step into his mind and into a new world, so that even in the elegiac tone of the ending there is level of sweet kindness that feels new even for him.",
      "author": "Andrew Kendall"
    },
    {
      "text": "The Way of Water is surprisingly conservative in its celebration of family and especially fatherhood.",
      "author": "Brett McCracken"
    },
    {
      "text": "In the midst of all the techno-wizardry, using mo-cap to empower Sigourney Weaver to play her own teenage daughter turns out to be Cameron’s greatest stroke of genius.",
      "author": "Chris McCoy"
    },
    {
      "text": "James Cameron once again crafts a beautiful visual world, but the script sags with repetitive story beats and an endless final battle. I'm thrilled the Oscars are nominating blockbusters again, but this is the weakest of the 10 Best Picture nominees.",
      "author": "Jason Fraley"
    },
    {
      "text": "It’s about what you would expect from writer-director James Cameron, a.k.a. Cecil B. DeMotionCapture. Like DeMille’s later films (not his early, edgier fare) and the original \"Avatar,\" the sequel is big, spectacular and dumb.",
      "author": "Cameron Meier"
    },
    {
      "text": "Sans water, that annoying motion-smoothing soap-opera look bubbles up, gimmickry sets in, and Pandora and the Na'vi appear far, far less visually spectacular.",
      "author": "Sarah Ward"
    },
    {
      "text": "A cinematic feast that shows the future of filmmaking is here.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Luckily for Cameron, it's hard to check your watch while wearing 3D glasses.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "If you’re already a fan of the first Avatar, you will welcome a return to the realm of Pandora. Those who were lukewarm or hostile to the original won’t find anything new enough to merit consideration.",
      "author": "Wesley Lovell"
    },
    {
      "text": "For three whole hours, Avatar: The Way of Water evokes Important Issues — imperialism, colonialism, racism, sexism, ransacking the environment for commodifiable resources — in the silliest, shallowest way possible.",
      "author": "Eileen Jones"
    },
    {
      "text": "Cameron remains nearly unparalleled when it comes to crafting an action sequences, but it's the moments of sheer beauty in The Way of Water that really linger",
      "author": "Mattie Lucas"
    },
    {
      "text": "Appropriation and privilege run rampant throughout the development of this entire franchise.",
      "author": "Frantz Jerome"
    },
    {
      "text": "Second time around, it feels as though Cameron was way too happy to simply rehash a number of story points ripped straight from the first Avatar, with minor cosmetic changes slapping on a fresh coat of paint that quickly turns stagnant",
      "author": "Scott Campbell"
    },
    {
      "text": "A magnificent audiovisual cathedral in which technology, creativity and hart row in the same direction, justifying by itself the existence of the big screen.",
      "author": "Víctor López G."
    },
    {
      "text": "...one of cinema’s great blockbuster artists is back, and he’s delivered a film so packed with spectacle that even the original “Avatar” pales in comparison.",
      "author": "Matthew Jackson"
    },
    {
      "text": "I'm not sure anyone cares about Jake Sully and his family as much as James Cameron thinks they do.",
      "author": "Brian Gill"
    },
    {
      "text": "Cameron did what he did in 2009 and he did it better. He once again is redefining what cinema’s future can be in the digital and technological age.",
      "author": "Soham Gadre"
    },
    {
      "text": "Watch the film for its wonderfully crafted images that make you feel like you’re actually on an alien planet. The film’s message of loving your family and facing upheavals together as one will resonate with the Indian audience for sure.",
      "author": "Devesh Sharma"
    },
    {
      "text": "Everything feels authentic, yet it’s also technically marvelous. There’s something masterful about what Cameron can do and it's refreshing to have this story take place outside of a long-lived IP where every plotline is on its third or fourth recycling.",
      "author": "Aaron White"
    },
    {
      "text": "The Way of Water is predicated on an escapist mindset that prevents moviegoers from thinking (or expressing dissatisfaction). When a film like this is sold for its 3D, 48-frames-per-second High Dynamic Range teachnology, protect your credit card.",
      "author": "Armond White"
    },
    {
      "text": "What you make of Avatar: The Way of Water depends largely on whether you’re inclined to give Cameron the benefit of doubt. In that, the film proves that there are some things that Cameron gets right, he does so with faultless precision.",
      "author": "Poulomi Das"
    },
    {
      "text": "I loved this movie. The first Avatar is emotionally hollow, but The Way of Water is this film about family, and trying to save your family, and it's done with such vigorous sincerity that the emotion is really strong.",
      "author": "JD Duran"
    },
    {
      "text": "[A] substantial offering that fixes most of the mistakes from its first entry. And, of course, it's beautiful to observe. Cameron spent years of his life creating a fictional world worthy of its own National Geographic documentaries.",
      "author": "Courtney Lanning"
    },
    {
      "text": "#AvatarTheWayOfWater is epic, grand, and simply a masterpiece from both a filmmaking and technological viewpoint. \n\nJames Cameron creates a cinematic experience with a level of craft that seldom exists in the blockbuster space.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Gorgeous imagery aside, The Way of Water feels less like a sequel than it does a refamiliarisation of the world and ideas of the 2009 blockbuster. There are simply too many ideas with not enough focus to justify its gigantic runtime.",
      "author": "Andrew Murray"
    },
    {
      "text": "Three hours breeze into deep relationships, action-packed sequences, and a tale that deserves to be repeatedly seen in cinema. #diandrareviews",
      "author": "Diandra Reviews"
    },
    {
      "text": "The Bottom-line: \"Avatar: The Way of Water is Epic, Exhilarating, and Entertaining",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "A fortune has been spent to return the movies to where they were a century ago.",
      "author": "Ed Whitfield"
    },
    {
      "text": "I suspect Cameron suffers from Bono Syndrome: namely, an unshakable belief in one’s own messianic genius, combined with a compulsive need to save the planet, or rather be seen to be saving the planet.",
      "author": "John McDonald"
    },
    {
      "text": "Clocking in at three hours and 12 minutes, \"Avatar 2\" takes too long to get a story going. When it does, we realize it’s basically the same story, just with new treasure and another group of blue creatures who also are leery of the “sky people.”",
      "author": "Bruce R. Miller"
    },
    {
      "text": "I just wish all of the technical achievements made it a more interesting story.",
      "author": "Kent Garrison"
    },
    {
      "text": "I was blown away by the effects and the world building and will happily return for the third film. It’s safe to say I’m on board with the ‘Avatar’ franchise.",
      "author": "Megan Williams"
    },
    {
      "text": "Avatar: The Way of Water is much, much more of an action film that its predecessor, and James Cameron still has the stones when it comes to creating outrageous sci-fi spectacle that looks like a Frank Frazetta poster on acid.",
      "author": "Eddie Harrison"
    },
    {
      "text": "Told mostly from the kids point of view,  as beautiful as this film can be, it is not without its issues.  Yet, it is still great family friendly fun",
      "author": "Carla Renata"
    },
    {
      "text": "This is better than the original. Action in the 2nd act is top notch, the voice acting/motion capture is vibrant, characters new & old have more weight/emotion, and the visuals are so good it took my eyes time to truly grasp IMAX 3D High FPS. IT’S SO EPIC",
      "author": "Samuel Leggett Jr."
    },
    {
      "text": "It’s a great spectacle that fails to give audiences a reason to re-visit it for actually substantial reasons like interesting characters or relatable conflicts...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Cameron’s early films mirrored John Carpenter in their sleekly shark-like, ruthless momentum. Now he is Cecil B. DeMille, hawking herculean, hollow spectacles to hold off cinemagoing’s decline.",
      "author": "Nick Hasted"
    },
    {
      "text": "There are definite problems of logic and lechery despite gorgeous visuals. That's without addressing the problems of the White Savior narrative.",
      "author": "Jana Monji"
    },
    {
      "text": "Pure cinematic visual magic...  The way to wonder.  [capsule review]",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Cameron is blurring the lines between over-earnest after-school special and bombastic action flick distinctly unsuited to the former's target audience.",
      "author": "Andrea Chase"
    },
    {
      "text": "Be that as it may, there’s no getting around the fact that “Way of Water’s” dramatic foundation is leaky.  Then again, you’re not supposed to notice that. Cameron provides distractions aplenty.",
      "author": "Charles Koplinski"
    },
    {
      "text": "You have to hand it to a filmmaker who is willing to devote an entire subplot to a computer-generated whale-like creature that communicates more with its eyes than any human in both Ant-Man movies combined.",
      "author": "Rohan Naahar"
    },
    {
      "text": "The film comes with a glossy sheen to it; essentially a shinier version of what Cameron delivered 13 years ago with Avatar.",
      "author": "Thomas Stoneham-Judge"
    },
    {
      "text": "After more than a decade of waiting, Avatar: The Way of Water makes a statement as the most spectacular blockbuster of the year, providing a thrilling ride through the mesmerizing world.",
      "author": "Diego Peralta"
    },
    {
      "text": "Hyperbole is maybe the worst thing in the world, but Avatar: The Way of Water utterly redefines visual awe and wonder. It resets the bar so ridiculously high with entire sequences that leave you unsure where physical reality stops and CG begins.",
      "author": "Rob Hunter"
    },
    {
      "text": "Cameron leans into all the qualities that made him such a successful director.",
      "author": "Jas Keimig"
    },
    {
      "text": "Cameron, like he did with sequels to \"Alien\" and \"Terminator,\" once again proves he is the master of upping the ante in terms of both storytelling and spectacle.",
      "author": "Josh Davis"
    },
    {
      "text": "The filmmaking craft may be (mostly) astonishing. But the craft must always — <i>always</i> — be in aid of a compelling story populated by compelling characters... and that’s not so much the case here.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Cameron has crafted nothing more than a 3+ hour revenge tale with none of the motivations of the original that is nothing more than a dulling $400 million screensaver and a rehashing of better moments from his career. A waste of our time and his effort.",
      "author": "Erik Childress"
    },
    {
      "text": "Cameron’s always one to push the boundaries, and you’re reminded of that early on if you see it in 3D IMAX. I was quickly in awe of Cameron’s visual storytelling as we return to the lush world of Pandora",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The movie’s roaring achievement: There’s cinematic genius in every overdetermined frame, every animated motion in shifting frame rates, the relentless photorealistic detail. The sensation is like being trapped in a bathysphere in an aquarium.",
      "author": "Ray Pride"
    },
    {
      "text": "If it hasn’t already been advised by Disney, Avatar’s captain just really needs to either learn to let go or be locked out of the editing room on the next one. Even the most jaw-dropping of action sequences seem stretched or recur unnecessarily..",
      "author": "Caffeinated Clint"
    },
    {
      "text": "The Way of Water explodes with brilliant colors and fast-moving otherworldly images that, thanks to the 3-D, reside between you and the screen and rarely fail to dazzle the eyes for any lengthy stretch of this more-than-three-hour epic.",
      "author": "Mark Meszoros"
    },
    {
      "text": "Like the first movie, the technical wizardry won me over and (again, having just rewatched the first movie) the story is deeper and richer.",
      "author": "Mike Ryan"
    },
    {
      "text": "It’s not that this is a bad movie, it really isn’t, it just felt soulless. Its attempt to create something profound thematically and narratively falls short and the band of characters sadly just aren’t that interesting - but, hey, at least it looks good.",
      "author": "Matt Hudson"
    },
    {
      "text": "Cameron's Avatar sequel is a visual feast, and that's what saves it from the otherwise mediocre characters and arduous runtime.",
      "author": "Lee McCoy"
    },
    {
      "text": "The hard core fans will revel in the new “Avatar” and will embrace the new water world like I do. Hopefully, the next one will have an original story, but I do not expect that from Cameron.",
      "author": "Robin Clifford"
    },
    {
      "text": "If for nothing else, see it to enjoy the stunning smorgasbord of visual marine delights bequeathed by the director who dove 2.3 miles down in the pitch black ocean, all by himself, to the Mariana Trench. Who does that? Talk about your thorough research.",
      "author": "Mark Jackson"
    },
    {
      "text": "[Cameron] is once again unparalleled at presenting us with an ecological and ethnographic survey of a fictional world that is, like the whole concept, familiar and yet novel.",
      "author": "Nick Johnston"
    },
    {
      "text": "A thundering bore of a film.​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​​",
      "author": "Chris Wasser"
    },
    {
      "text": "Avatar: The Way of Water rewards the long wait with an extravaganza of special effects cinematic spectacle.",
      "author": "Diane Carson"
    },
    {
      "text": "he case for film as an experience (Cameron’s first priority) depends almost always on its form. On that front, he delivers -- and while it may not always feel revelatory, it’s fine to do an old thing one’s own way, and better still to do it well.",
      "author": "George Elkind"
    },
    {
      "text": "This film looks fantastic, with state of the art visuals, which are extremely imaginative and arresting. The acting is solid, and the action moves right along, despite the long running time.",
      "author": "Robert Roten"
    },
    {
      "text": "The luminous and tactile CGI that breathes life into the film’s flora and fauna proves that Pandora, not Jake, is the hero of Avatar. Every blade of grass, every drop of water, is a gift not to be wasted.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "It would be missing the point to call the proceedings indulgent to the point of self-infatuation: Cameron has built a new world from the remixed bits of this one, and he seems determined that we should not simply visit Pandora, we should live in it.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Yes, the three-hour-plus runtime is long, but it's easy to get lost in the movie's memorable world-building. The motion-capture performances are fascinating to behold, and Winslet and Curtis are welcome additions to the cast.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "It’s more than you can possibly imagine. A fantasy world so vivid and real it commands your full attention for 3h 12m.  And when it’s done, you’ll still want to linger in this heightened state of make believe.",
      "author": "Dwight Brown"
    },
    {
      "text": "Visually gorgeous, James Cameron's film repeats the original's mistakes.",
      "author": "Kshitij Rawat"
    },
    {
      "text": "While it is absolutely beautiful and an achievement in effects, it has striking similarities to the first film - but that last hour of action is absolutely why we go to the movies. See it on the biggest screen possible with the best presentation.",
      "author": "Paul Salfen"
    },
    {
      "text": "The innovative technology trumps the elementary storytelling.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Going into this movie, I thought that I’d at least be wowed by the effects and the action. I never expected to be moved close to tears by blue alien children.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "We get a story this time... that part of it was great, but at 3 hours and 15 minutes, it's just too long.",
      "author": "tt stern-enzi"
    },
    {
      "text": "State-of-the-art special effects and revolutionary underwater cameras can’t hide the fact that Avatar: The Way of Water is basically the same movie as the original with more blue people (some are slightly green now!) that get on your last nerve.",
      "author": "Chris Sawin"
    },
    {
      "text": "One of the great films of 2022, Avatar: The Way of Water, is not only a triumph for Cameron, but it’s what we need to continue to demand as audiences.",
      "author": "Alan French"
    },
    {
      "text": "If you go just for the escape and spectacle, you will be in awe.",
      "author": "Christy Lemire"
    },
    {
      "text": "Shamelessly corny and blunt and earnest and wildly exciting.",
      "author": "Tim Brayton"
    },
    {
      "text": "Cameron creates a hypnotic experience, holding us by the hand as the camera glides through whirls of ethereal sights, phantasmagoric action sequences and, fan or not, another Cameron monument upon which the box office can hang until at least the new year.",
      "author": "Candice McMillan"
    },
    {
      "text": "A thrilling adventure of colossal proportions that dazzles the senses, while packing an emotional punch. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "A towering achievement that offers a visual spectacle like no other, while exploring new themes around family and parenthood. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Cameron is finally back on Pandora and while we're all for messages of environmentalism that doesn't mean we love a recycled story. It stays surface level the entire (long) time but still manages to move along. It still eeks out a fresh status.",
      "author": "Dana Han-Klein"
    },
    {
      "text": "There are microscopic moments with humans, but it looks like a computer game for the majority of the film.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "It’s predictable, shallow and bombastic. This is a low-brow action movie dressed in the glitzy trappings of a high-brow sci-fi flick. Once you take off the 3D glasses, or the rose-tinted ones, the illusion is shattered.",
      "author": "Erik Kain"
    },
    {
      "text": "We have officially lost the great James Cameron to the creatively barren, visually whatever land of Pandora. It was nice knowing him.",
      "author": "Bob Grimm"
    },
    {
      "text": "It’s often just damn fun. Yet the missteps are inescapable, and so many of them are due to Cameron’s ego that no matter how much you may enjoy its beauty in the present, it’s hard to look back on it without remembering the flaws.",
      "author": "TK Burton"
    },
    {
      "text": "The film’s focus is split in so many directions that none of its characters feel whole, even after three full hours.",
      "author": "Dylan Roth"
    },
    {
      "text": "This bombastic cinematic event was worth the wait.  [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Even amid its action scenes, the Avatar sequel is about the family drama and their struggles to stay together.",
      "author": "Linda Codega"
    },
    {
      "text": "It has a terrific sense of colour, texture and weight. And some emotional plot threads make what's essentially a blunt-edged battle movie into something surprisingly engaging.",
      "author": "Rich Cline"
    },
    {
      "text": "[James Cameron] remains very much at the center of his obsession. He may not be a great artist, or a visionary, but in its look, and its feeling for family, this behemoth enterprise still has an ardent, cornball grandeur to it.",
      "author": "Peter Rainer"
    },
    {
      "text": "The long-awaited sequel to the 2009 film continues its breathtaking saga of Pandora, reuniting audiences with Jake Sully and Neytiri as they protect their young family and ageless traditions.",
      "author": "Sonal Pandya"
    },
    {
      "text": "Avatar: The Way of Water deserves be watched in IMAX 3D. It is the greatest immersive cinema experience of the year — world building at its finest.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "At times, it feels like Cameron is wildly in love with the ecosystem and inhabitants of Pandora, and considerably less in love with the actual story being told. I wish that the narrative could have been as revolutionary and breathtaking as the filmmaking.",
      "author": "Tim Brennan"
    },
    {
      "text": "It's one of those movies that needs to be seen on a big screen--please, please, please, don't wait for this to stream on Disney plus--and it needs to be experienced with a crowd of strangers who cheer on every fight...and gasp at every little detail.",
      "author": "Asher Luberto"
    },
    {
      "text": "The Way of Water feels special in how it’s an astonishing spectacle made with the meticulous care of a serious craftsman.",
      "author": "Alci Rengifo"
    },
    {
      "text": "It’s a marriage of commercial aspiration and artistic achievement that is not often seen.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "'Avatar' was about a clash of civilizations. 'The Way Of The Water' is a revenge story that wears thin after a while. The whales were cool though.",
      "author": "Vincent Mancini"
    },
    {
      "text": "The story may stumble in a few spots, but it’s still an exciting step up from the first movie. And as an experience, visiting Pandora has never felt so exciting and full of life.",
      "author": "Keith Garlington"
    },
    {
      "text": "Cameron’s world-building is obsessively rich — focal storytelling not as much.",
      "author": "Matt Donato"
    },
    {
      "text": "Delivers on its promise of expanding the scope of Pandora.",
      "author": "Sara Stewart"
    },
    {
      "text": "“Avatar: The Way of Water” is fully engrossing, always eye-popping and occasionally touching. Like its predecessor, it’s a movie to admire and enjoy, if not quite love.",
      "author": "Rafer Guzman"
    },
    {
      "text": "[James Cameron] has taken a story that is easy to understand, characters that are easy to root for, and places them in set pieces that are nothing short of spectacular.",
      "author": "Allen Almachar"
    },
    {
      "text": "Visually even more glorious than the first Avatar movie, but not much improvement narratively. The underwater scenes are so amazing it’s worth putting up with those pesky 3D glasses once again.",
      "author": "Ruth Maramis"
    },
    {
      "text": "The Special Effects are terrific; the best 3D ever filmed; the story is so ridiculous it's laughable and far too long.",
      "author": "Tony Medley"
    },
    {
      "text": "Avatar: The Way of Water’s epic visuals are impossible to find fault with, but with a paper-thin, painfully boring story and little in the way of character development, this three-hour snoozefest is all style, no substance.",
      "author": "Josh Wilding"
    },
    {
      "text": "Astonishing! Enthralling! Exciting! Immersive! None of these words could sensibly be applied to the three-and-a-quarter-hour Wet Smurfahontas stodgeathon that is Avatar: The Way of Water.",
      "author": "Mark Kermode"
    },
    {
      "text": "It’s a high-stakes film that’s truly epic in scope and scale, set in a well-developed world, but it also has a big heart.",
      "author": "Marianna Neal"
    },
    {
      "text": "Working with director James Cameron. screenwriters Amanda Silver & Rick Jaffa develop an emotional arc for each motion-captured character. The result is compelling & wondrous, highlighted by dazzling visual effects, particularly the deep-sea sequences.",
      "author": "Susan Granger"
    },
    {
      "text": "Though a technical spectacle, Cameron has evolved his storytelling from 'Save the Rainforest' to 'Save the Whales.'",
      "author": "Doug Walker"
    },
    {
      "text": "Avatar: The Way of Water is the one film you truly must see in theaters this year.",
      "author": "Tyler Treese"
    },
    {
      "text": "A soporific and unnecessarily long sequel that beneath the expensive CGI visual effects hides an ocean of recycled formulas in which blue aliens swim on the surface like disposable plastic bottles. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "In this opening salvo of four sequels, [Cameron] expands digitally rendered horizons from bioluminescent forests to the moon's teeming oceans and resplendent atolls, providing audiences with a compelling reason to immerse fully in eye-popping 3D and IMAX.",
      "author": "Damon Smith"
    },
    {
      "text": "Wide eyes become the only tools anyone really needs to enjoy the epic entertainment offered here.",
      "author": "John Urbancich"
    },
    {
      "text": "Cameron is one of the few directors who can hold an audience for over three hours. The world he’s created is lovelier, livelier and more vivid every minute. The plot has enough twists, turns, themes and action to keep you captivated throughout.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "It’s an amazing cinematic experience that invites the viewer to let go of everything else – including the expectation of a dramatic narrative with intriguing plot and subtle characterization – and immerse in the wonder of its world.",
      "author": "Ayelet Dekel"
    },
    {
      "text": "Immerse yourself.",
      "author": "Linda Cook"
    },
    {
      "text": "Director James Cameron delivers another visual spectacle and adds emotional weight that creates higher stakes for everyone",
      "author": "Kiko Martinez"
    },
    {
      "text": "Avatar The Way Of Water is a jaw-dropping, visually immersive experience that demands to be seen on the biggest screen possible.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "The movie’s bland aesthetics and banal emotions turn it into the Club Med of effects-driven extravaganzas.",
      "author": "Richard Brody"
    },
    {
      "text": "Pure, distilled, 3-D cinematic rapture.",
      "author": "Dann Gire"
    },
    {
      "text": "A visual triumph full of impressive filmmaking, Avatar: The Way of Water is hindered by an interesting plot that it can't ever truly elevate.",
      "author": "Brandon Zachary"
    },
    {
      "text": "...numbing, leisurely slowness...",
      "author": "Nicholas Barber"
    },
    {
      "text": "There is a feeling, as this long entertainment that looks great but doesn’t have much to say slowly draws to a close, that part of its job is to set the scene for the Avatars to come.",
      "author": "Stephen Romei"
    },
    {
      "text": "Avatar: The Way of Water ups the ante visually but still puts spectacle over story.",
      "author": "Rick Marshall"
    },
    {
      "text": "As a spectacle it’s astonishing. But is this even a film? It’s more like a three-hour theme park ride. Or a superior version of those show-reel display loops they use in shops like Currys to show off how good the tellies are.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "There's a lot to pull out of any cultural artifact this immense; you can't make a thing that consumes this many resources and sucks up this much air without being emblematic of the times and circumstances surrounding its creation.",
      "author": "Walter Chaw"
    },
    {
      "text": "I'm not kidding when I say this may be the best-looking movie I've ever seen.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "If Cameron truly believes in anything, it’s the power of big-screen spectacle, and more than ever he’s determined to give us the works.",
      "author": "Jake Wilson"
    },
    {
      "text": "With dynamic characters working in tandem with astonishing technical wizardry, James Cameron’s latest opus is also his most personal.",
      "author": "Miles Surrey"
    },
    {
      "text": "Cameron redeems himself and the film in the final act...",
      "author": "Deepanjana Pal"
    },
    {
      "text": "Basically, like the original, this is worth a viewing or two. Still, not Cameron’s best, nor will it stand the test of time the way his pre-Titanic work does.",
      "author": "Damond Fudge"
    },
    {
      "text": "Perhaps in subsequent films there might also be greater attention to the script. While the new film is a successful and sometimes wondrous visual experiment, as a story, it treads in shallow waters.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Visually mind-blowing but with a fractured and over-crowded story, this sequel still manages to provide a great spectacle.",
      "author": "Kevin Carr"
    },
    {
      "text": "Avatar 2 is just stunning in the parts it skims along the water, dives deep, rolls around joyously, keeping up with the incredible creatures who live in the deep.",
      "author": "Shubhra Gupta"
    },
    {
      "text": "An epic action-adventure film that rides on the most stunning visual effects - the 'magic' on the screen looks 'real' for the most part.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "Like the original, it is a big screen spectacle that excels in craftsmanship, so breathtaking that it is easy to forgive the film’s shortcomings (and there are plenty in the rather hefty 192 minute run time).",
      "author": "Micheal Compton"
    },
    {
      "text": "In my idyllic world, it wouldn't be an event movie that's poised to break records for popcorn sales. But in the real world, we probably should be grateful that [it] gives audiences what they pay for — richly realized journeys to other worlds.",
      "author": "Robert Denerstein"
    },
    {
      "text": "ho doesn’t love iridescent sea creatures, fiery cinders and weapons poking into the theater through the magic of 3D? If there’s only one movie you put on pants and leave the house for, this one is it for the visuals alone.",
      "author": "Thelma Adams"
    },
    {
      "text": "Avatar: The Way of Water is -- no surprise here -- a world-class display of high-end cinema technology. Not to mention a down-to-the-molecular-level example of imaginative world-building from writer/director James Cameron.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Avatar: The Way of Water is pretty to look at and the 3D technology is impressive. And that’s about the only nice thing I have to say about James Cameron’s film.",
      "author": "Beth Accomando"
    },
    {
      "text": "A gorgeous template for a virtual tourist experience, 'Avatar: The Way of Water' is less compelling as a sci-fi adventure.",
      "author": "André Hereford"
    },
    {
      "text": "James Cameron may not actually be the king of the world, but he is unquestionably the king of the sequel, and Avatar: The Way of Water proves it.",
      "author": "Frank Wilkins"
    },
    {
      "text": "I was very hyped for Avatar 2. James Cameron has never let me down when it comes to his movies. \nI guess there's a first time for everything.",
      "author": "Adam Olinger"
    },
    {
      "text": "As for those visuals, Cameron has been dazzling us for years and the innumerable artists and technicians have created an alien world that seems as real as the view out your window.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "The movie is visually exhilarating, but it suffers from the same problems as the original. The movie is punishingly long, and its thin storyline and cast of imminently forgettable characters don’t provide much payoff.",
      "author": "Collin Garbarino"
    },
    {
      "text": "The long-awaited sequel reaches new heights in special effects, 3D, and visual immersion. It's a thrill ride that is a must-have theatrical experience. Unfortunately, the characters and story still feel a bit underwhelming and underdeveloped.",
      "author": "Cody Leach"
    },
    {
      "text": "Using whatever alchemy of motion-capture performance, computer-generated animated animals, and the occasional flesh-and-blood actor, Cameron conjures a world with such beauty and majesty that it’s impossible not to get drawn into it.",
      "author": "Sean P. Means"
    },
    {
      "text": "The technical achievements of the Avatar franchise are so often celebrated, as if cinema can (or should) be stripped down for parts. A proof of concept for computer animation isn’t a quality film any more than a Twitter bot is a viable political candidate",
      "author": "Ryan Syrek"
    },
    {
      "text": "Avatar: The Way of Water finds Cameron challenging himself as a storyteller all while setting the new bar of visual storytelling. Once you dive into Pandora’s oceans, you can’t go back.",
      "author": "Cory Woodroof"
    },
    {
      "text": "With the same villain, plot and themes, the new “Avatar” follows the same recipe as the old “Avatar.” Just add water.",
      "author": "Dana Barbuto"
    },
    {
      "text": "This new Avatar filled an awe-shaped void in my heart, and for that, I thank James Cameron.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Ultimately a very simple, longwinded cat-and-mouse game that, whether intentionally or not, evokes so much of what came before it while managing to break new visual ground.",
      "author": "Rich Juzwiak"
    },
    {
      "text": "The Way of Water is an all-ages theme park ride with no height restriction. A film that’s simultaneously pushed and redefined high frame rate and 3D filmmaking.",
      "author": "Taylor Baker"
    },
    {
      "text": "The rare sequel that exceeds the original, a full-blown example of old-fashioned spectacle filmmaking married to stunning CGI visuals that seem like a giant leap forward. You can pick it apart afterward, but while you're in sitting there, it works.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "This is a pure cinema experience, not to be missed, and Cameron never resists the urge to throw absolutely everything he has into this clear work of passion.",
      "author": "Jack Bottomley"
    },
    {
      "text": "The Way of Water is a stunning work of art that deserves to be seen on the biggest screen possible. It's also a film whose visual effects upstage and overshadow everything else as it recycles many of the same ideas and themes of its predecessor.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "You can appreciate the impressive fantasy world-building, meticulous detail in its visual concepts, and sense of wonder in exploring them.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The grandeur is the whole point ... what a remarkable experience it is. Go now. And pick the biggest screen you can find.",
      "author": "Sean Collier"
    },
    {
      "text": "The special effects are dazzling. That's a given. But I'm unsure whether or not the story will reach the audience's heart, or if they'll enjoy it with fascination. I didn't. [Full review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "Cameron often seems conflicted with the idea that his fun on Pandora might need to function as something resembling a narrative you would find in a movie, a notion that might be a problem if not for the film’s breathtaking beauty.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "... It was the time to take a narrative step forward, but that didn't happen. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A pandemic didn't help, but the cold hard truth is that Top Gun aside, blockbusters this year have been underwhelming and anemic. The Way of Water delivers excitement audiences have been starved for, and then some.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "You feel Cameron's passion for this natural world - I say natural fully aware that this is an artificial creation that feels like it has more blood and metal than what we usually get from studio franchise fare.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "I was completely taken in by Avatar: The Way of Water and overwhelmed by its fluid, kinetic action scenes, eye-popping production design and propulsive storytelling. This is a movie filled with wonder, which has become a rare commodity in the age of CGI.",
      "author": "Leonard Maltin"
    },
    {
      "text": "The Avatar movies continue to be groundbreaking, world-class exercises in cinematic digital artistry, and The Way of Water is a much-needed improvement on the first film.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Similar to the first movie, even if I have issues with the story, even if there are flaws in the narrative, I can still be completely immersed and swept away by the experience of watching The Way of Water on a gigantic IMAX screen...",
      "author": "Alex Billington"
    },
    {
      "text": "Brilliantly designed and produced, but narratively muddled, James Cameron’s <i>Avatar: The Way of Water</i> creates a world on screen that lives and breathes on its own separate from anything its audience or characters experience.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Like its predecessor, The Way of Water isn’t a movie — it’s a technology showcase.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "(Cameron) is far more interested in showing you his sandbox than doing anything interesting with it... a dull mix of the original story with even duller right-of-passage subplots. This sequel serves as a grim portent for the films to come.",
      "author": "Victoria Luxford"
    },
    {
      "text": "The moral combat could not be more simplistic, yet all the Cameron trademarks are in play...",
      "author": "Anthony Lane"
    },
    {
      "text": "Yes, it looks different—and I understand folks who are frightened by things that are new and different; I am frequently one of them—but the difference is in service of attempting to bring people fully within the proscenium of the screen.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Despite all of the \"James Cameron-isms\" in the story, this is a breakthrough in visual magnificence, another frame by frame evolution in what a movie means. Cameron's in-depth imagination creates a world that is to be seen, experienced and dreamt about.",
      "author": "Patrick McDonald"
    },
    {
      "text": "Weigh the flimsy story against eye-popping, shoot-the-works visuals that fill the screen to bursting and the choice is clear: Cameron’s 3D sequel to his biggest hit is the ultimate in-theater thrill ride.  You’ve never seen anything like it in your life.",
      "author": "Peter Travers"
    },
    {
      "text": "A towering cinematic achievement of visceral emotion, slam-bang action and jaw-dropping special effects that show just how far a budget of some $350 million can stretch.",
      "author": "Neil Pond"
    },
    {
      "text": "Is this one of the things we want from movies right now — pictures that take long-famous, Oscar-winning actors and bury them so deeply in digital gelatin that passing fantasy fish and phosphorescent flora outshine them at every turn?",
      "author": "Kurt Loder"
    },
    {
      "text": "An incredible structure. When you settle in and start poking around though, all the visual effects in the world cannot truly erase the underwhelming realities Cameron has placed on screen.",
      "author": "Michael Ward"
    },
    {
      "text": "Cynicism has been done to death — leave that at the door. A little wide-eyed wonder isn’t a bad thing. The best films reach not only for awe, but the full gamut of emotions. Open your eyes and open your heart.",
      "author": "David Harris"
    },
    {
      "text": "The last act is a combination of James Cameron's greatest hits: Aliens, Terminator, True Lies, and Titanic. He took all his experiences of the years and applied them to this one movie in the best possible way.",
      "author": "Korey Coleman"
    },
    {
      "text": "If this is less fully satisfying than the first film, that’s mostly due to it being just one part of a larger whole: once the action finally arrives, Cameron delivers in thrilling style",
      "author": "Anthony Morris"
    },
    {
      "text": "James Cameron knows how to elevate simple story structure into an intense action spectacle... (in) the superior CGI... viewers can see the emotion whether it’s spoken or not... an experience unavailable at home unless you live in a multiplex.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "A pretty and empty sequel, James Cameron's \"Avatar: The Way of Water\" relies too heavily on visual effects to compensate for a bad story.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Simply put, this is an offering that must be seen in the biggest format possible.  And if experienced that way and you simply go along for the ride, oh, what a ride it will be for you. One of the best sheer entertainment offerings of the year.",
      "author": "Jim Judy"
    },
    {
      "text": "A satisfying action spectacle.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Members of the audience will feel immersed in a whole new world... Cameron, to his credit, succeeds in transporting the audience there. Avatar falters, however, in making them care about many of the inhabitants of this visual paradise.",
      "author": "George M. Thomas"
    },
    {
      "text": "What good are the medium's most elaborate, awe-inspiring special effects if a film can't tell a story that's new, or alter the way an audience experiences narrative cinema?",
      "author": "Luke Goodsell"
    },
    {
      "text": "Avatar: The Way of Water was a quite simply a magnificent way to wind up the cinematic year and celebrate the singular joy of the big screen experience with an Avatar as good if not better than its predecessor.",
      "author": "Kate Rodger"
    },
    {
      "text": "The scenes of Jake and Neytiri’s forest-dwelling family learning to adapt to marine life are full of a kind of joy that it seems Hollywood blockbusters have all but forgotten: that of seeing something unprecedented and wondrous.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Cameron uses his skills as action director to great effect, particularly in a balls-out third act. Sure, he takes a full hour to set the stage, but there are a couple of emotional payoffs later in the film that justify the initial slog.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "Fantasy is most powerful when creators engage thoughtfully with their chosen allegory, checking all the minute components of their fictional world’s machine. But The Way of Water is a blunt tool, expanding the world of Avatar via copy and paste.",
      "author": "Izzy Ampil"
    },
    {
      "text": "It's a shame because the spectacle truly is brilliant, as tremendous as Avatar and then some. But there is such thing, as it turns out, as a little too much.",
      "author": "Jack King"
    },
    {
      "text": "You'd expect the visuals to be a strength of the movie, but they're not that good. Disney's current Strange World has more imaginative cryptofauna than this movie. The animation... is reminiscent of a top-end video game.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Story elements aside, the film is movie-going experience that is worth all of the effort and money spent to watch it.",
      "author": "Theolin Tembo"
    },
    {
      "text": "Visually, the film is stunning, more so than the last, though you can’t escape the fact that it still looks like a video game running on the greatest graphics card of all time. I saw it in 3D Imax and... it’s worth your greenback.",
      "author": "Tom Meek"
    },
    {
      "text": "For those looking for a fully immersive theater experience, Avatar: The Way of Water delivers a sea of blue. But do the breathtaking visuals outweigh the predictable plot?",
      "author": "Christie Cronan"
    },
    {
      "text": "James Cameron has once again proved that he really is the king of blockbuster filmmaking.",
      "author": "Steve Katz"
    },
    {
      "text": "All eye candy all the time. \"Avatar: The Way of Water\" is spectacular to look at, but too long and lacking in meat.",
      "author": "James Verniere"
    },
    {
      "text": "Here, anyway, a mere 13 years later, is Avatar 2, and what do we get? Tedium, and lots of it.",
      "author": "Paul Whitington"
    },
    {
      "text": "Even if you don’t like the movie, you will be blown away by the experience.",
      "author": "Dan Scully"
    },
    {
      "text": "Way of Water is an excursion in paradise. Would you criticize your week in the Caribbean for not having much narrative drive, or for being populated by thinly realized and interchangeable characters?",
      "author": "Kyle Smith"
    },
    {
      "text": "The vibrant variety of colours makes every single frame feel like a photorealistic art piece. A marvellous blend of wonder and terror grows as we go deeper into the cavernous underwater world of Pandora.",
      "author": "Robert Butler III"
    },
    {
      "text": "\"The Way of Water\" fails to deliver an epic narrative that matches the brilliant visuals. But for most viewers, those visuals will be more than enough.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Everything here is retread, restate, regurgitate.",
      "author": "Kevin Maher"
    },
    {
      "text": "The Way of Water is a bloated, often boring mess of a movie that's nestled inside some of the most amazing visual effects work ever put on the screen.",
      "author": "Don Kaye"
    },
    {
      "text": "By waiting 13 years, James Cameron really does have a new story to tell us, new characters to work with -- and whole box of new film-making wizardry to unpack, out there in Miramar and beyond.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "If I had seen “Avatar: The Way of Water” at home on my television, I would have regarded it as simply a slightly above-average sci-fi/action flick and gone on my way. But on the big screen in 3D, it is the most visually spectacular film I’ve ever seen.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Everything is tantalizing and made to immerse the viewer in the film experience, but for a film to be successful, it must have a strong story to back up the effects. After all, it's not a video game.",
      "author": "Kathia Woods"
    },
    {
      "text": "The bald, button-pushing beats are undermined alternately by Cameron’s unapologetic gun fetishization and overlong “wonder” sequences, turning this into a numbing, three-hour slog instead of an easily achievable two-hour experience.",
      "author": "John Wenzel"
    },
    {
      "text": "Avatar should keep audiences pinned to their seats throughout its marathon length because Cameron offers spectacle -- overwhelming amounts of it.",
      "author": "John Lui"
    },
    {
      "text": "In that immersive respect, Avatar: The Way of Water predictably delivers a similar, if not identical, sense of awe and wonder its predecessor did more than a decade ago.",
      "author": "Mel Valentin"
    },
    {
      "text": "It’s loud, eye-watering, and very uncomfortable. Avatar: The Way of Water wallows in intense navel-gazing to show off its  CGI – yes James, we see the pretty fishies - but all of that is a distraction, and you and your bladder deserved better.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "[A]n embodiment of the power of film to transport us to entirely new worlds, transcendent and astonishing in its ambition and its ability to make us believe. Cameron has accomplished what many deemed impossible. Again.",
      "author": "Mark Hughes"
    },
    {
      "text": "The surprisingly swift, 192-minute film stands on its own, and I suspect you could have a good time watching it even if you haven't seen the first \"Avatar.\"",
      "author": "Chris Hewitt"
    },
    {
      "text": "Cameron’s staging of action sequences remains unparalleled, and that buys some goodwill, but by the end of the movie, I was left with Peggy’s Lee’s immortal question: “Is that all there is?”",
      "author": "Odie Henderson"
    },
    {
      "text": "Although the sequel is overlong and light on complex characters, it’s 2022’s most impressive-looking blockbuster.",
      "author": "Brian Eggert"
    },
    {
      "text": "Impactful and triply enjoyable. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "The beauty of the world... evoked in lush detail by cinematographer Russell Carpenter, is enough, most of the time, to make you forgive the hokiness of the screenplay by Cameron, Rick Jaffa and Amanda Silver.",
      "author": "Dana Stevens"
    },
    {
      "text": "This return to Pan-bore-ra is more interested in technological experimentation than a focused and engaging storyline.",
      "author": "George Simpson"
    },
    {
      "text": "The spectacle of it all IS the point. Everything else is secondary. You will either be wowed by it or you will not. [Full review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "If there was ever a film that could win over those who were agnostic or even antagonistic about the original Avatar, Avatar: The Way of Water would be it.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "Groundbreaking.",
      "author": "Josie Meléndez"
    },
    {
      "text": "Still feels more theme park than movie.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Avatar: The Way of Water is a visually dazzling experience that needs to be seen on the largest screen possible, and in 3-D if it’s available.",
      "author": "Rebecca Murray"
    },
    {
      "text": "It’s visually and technically magnificent, but woefully deficient in plot, characterization and dialogue.",
      "author": "Frank Swietek"
    },
    {
      "text": "No film will ever be this beautiful in my lifetime, at least until the next Avatar.",
      "author": "Dom Sinacola"
    },
    {
      "text": "The thing about this film is that visual effects are not enough to make up for the weak script.",
      "author": "Danielle Solzman"
    },
    {
      "text": "For portions of that concluding stretch, Cameron's embrace of technology meets his Terminator 2 heyday, washing over you in ways that are almost enough to make you look past the film's flaws.",
      "author": "Akhil Arora"
    },
    {
      "text": "The Way of Water is the kind of tremendously entertaining, spectacularly ambitious, not-a-little-bit-silly epic that only James Cameron can, and should, make.",
      "author": "Barry Hertz"
    },
    {
      "text": "Loud and proud, Avatar: The Way of Water can be, by times, overwhelming, but it’s also the kind of grand scale movie that demands to be seen on the biggest, most immersive screen possible.",
      "author": "Richard Crouse"
    },
    {
      "text": "An improvement on the original, Avatar: The Way of Water is a visually stunning film that entertains despite its flaws.",
      "author": "Courtney Small"
    },
    {
      "text": "It’s dazzling but verging on stillness. But have patience. Because it’s all part of Cameron’s masterful orchestration. The high frame-rate 3D, is so stunning that it will take you a few minutes to adjust to your reality, when you exit the theatre.",
      "author": "Anupama Chopra"
    },
    {
      "text": "The unrelenting kinetic ferocity of this last act is undeniable, and while nothing that happened came as a surprise, my eyes still remained glued to the screen.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "The story is familiar with many similar themes recycled but the change of setting on Pandora, the focus on new characters, and the stunning visuals make it worth the watch on the big screen in 3D for a more immersive experience.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "James Cameron delivers on the spectacle we expect and gives us an engaging story to boot. This is even worth the kidney damage and possible bladder infection I got because I didn’t want to miss a single second of the visual treasure.",
      "author": "Chris Joyce"
    },
    {
      "text": "[T]he cosmetic change from a vast forest to the beaches and seas of Pandora doesn't cover up how much of this narrative has been recycled from its predecessor...",
      "author": "Mark Dujsik"
    },
    {
      "text": "Never bet against James Cameron, because no one else builds a circus quite like he does, even if, like all circuses, it loses its glamor when you hold it up to the light.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Avatar: The Way of Water is a spectacular, immersive, jaw-dropping Hollywood experience that only Cameron can bring to movie theatres.",
      "author": "M.N. Miller"
    },
    {
      "text": "Those in search of a rich emotional experience or complex storyline won’t find either here, but those things have never been the director’s bread-and-butter.",
      "author": "James Berardinelli"
    },
    {
      "text": "The story is just a scaffolding for the world-building. That may make it more of an experience than a movie, but the experience is a fun place to visit.",
      "author": "Nell Minow"
    },
    {
      "text": "There isn't one single frame that isn't a work of art or a single moment where the entertainment and dramatic pulse doesn't hook the audience. [Full review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "Clearly elevated by its technical elements, the film accepts some roughness in plot and pacing to carve out a pathway for its future sequels. With some intriguing setups and personable characters, this could equal a fantastic new cinematic franchise.",
      "author": "Carson Timar"
    },
    {
      "text": "Cameron is clearly trying to send important messages about wildlife conservation and environmental protection, and that’s all for the good, but it’s wrapped in trite conversations and simplistic setup.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "If only James Cameron had loosened his technician’s labcoat and rediscovered the joys of storytelling with the same crisply etched clarity of his images.",
      "author": "Simon Foster"
    },
    {
      "text": "An astounding, sense-defying, wonder-inspiring spectacle that takes your breath away. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "The action always satisfies expectations. But one thing Cameron and his co-writers can't brag about is the dialogue. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "... All the tech advances in the world can’t hide the narrative tedium of watching Cameron’s yoked-together eco-fable unfurl over 190 minutes.",
      "author": "Alastair McKay"
    },
    {
      "text": "That's the essence of \"The Way of Water\": It's sheer experience above all else, with a solid, easy-to-follow story underneath it.",
      "author": "Adam Graham"
    },
    {
      "text": "Self-referential to the end, unnecessarily self-explanatory, and self-indulgent; therein lies its sins and virtues... [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "In an era of visual slop from blockbusters, James Cameron’s Avatar: The Way of Water is a breathtaking technical marvel that reminds you that CGI can be a visual feast.",
      "author": "Rendy Jones"
    },
    {
      "text": "Despite bordering on corn, Avatar: The Way of Water is fury, blood, blind vengeance and a Western akin to Solider Blue.",
      "author": "Fausto Fernandez"
    },
    {
      "text": "Sea-obsessed maverick James Cameron breaks more cinematic ground providing moviegoers with a mesmerizing 3-hr, 10-min behemoth of a film that argues for love and compassion which is exactly what the world needs right now…gobsmackingly arresting filmmaking",
      "author": "Frank J. Avella"
    },
    {
      "text": "Cameron was right to wait so long to release this second Avatar film, until the technology had time to advance enough to properly portray his vision.",
      "author": "Allison Rose"
    },
    {
      "text": "Cameron’s embrace of the idealism of adolescence, of the capacity for moral outrage as well as wonder, is the emotional heart of the movie.",
      "author": "A.O. Scott"
    },
    {
      "text": "When Avatar 2 avoids being amazed with itself and preaching its well-intentioned ecologist and anti-imperialist propaganda by focusing on the action, it becomes pure cinema. [Full review in Spanish]",
      "author": "Hernán Ferreirós"
    },
    {
      "text": "Dazzling, epic, and yet surprisingly intimate, Cameron's Avatar sequel expands on this exquisite world in ways both passionate and futuristic.",
      "author": "Tomris Laffly"
    },
    {
      "text": "It’s the combination between thrills and profound beauty that Cameron brilliantly knows how to execute, which sets Avatar: The Way of Water apart from the competition.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "A stock blockbuster filled with impressive action sequences, albeit familiar and not as definitive as was expected after 13 years, but justifiably necessary in the landscape of mimetic superheroes... [Full review in Spanish]",
      "author": "Jorge Loser"
    },
    {
      "text": "It is hyper-realistic, which is to say The Way of Water represents a significant advancement in the possibilities of special effects and immersive storytelling. It is not always a complete success, but then again, maybe we have not adjusted to it.",
      "author": "Alan Zilberman"
    },
    {
      "text": "It’s a stunning, visual feast, with every shot beautifully crafted via painstakingly perfect CGI. Big emotions are just as apparent throughout too, with Cameron’s storytelling pulling on our heartstrings unabashedly from beginning to end.",
      "author": "Jeff York"
    },
    {
      "text": "James Cameron’s second Avatar movie is a visually stunning but narratively uninspired return to Pandora that drowns some of its best ideas in military morass.",
      "author": "Charles Pulliam-Moore"
    },
    {
      "text": "If you want to go in with arms crossed and get caught up with what’s wrong with the movie, you could easily do that, but you’d have to try really hard not to have a good time in the action scenes.",
      "author": "Daniel Rutledge"
    },
    {
      "text": "I was not only on the edge of my seat, but I'm not sure if I remembered to even draw a breath. Simply. Outstanding.",
      "author": "Tom Santilli"
    },
    {
      "text": "There’s a certain look that most fiction films have, providing an invisible “barrier” between the world of the film and the audience. Cameron thinks he’s doing a service for filmgoers in removing that barrier, when in reality it undercuts the film.",
      "author": "Alex Bentley"
    },
    {
      "text": "The thing that I think they did a really fantastic job with was introducing these new characters ansd making us care about them.",
      "author": "Achara Kirk"
    },
    {
      "text": "This film won me over… because of the action because of how breathtaking it is, because I connect with the characters this had so much going for it.",
      "author": "Jaby Koay"
    },
    {
      "text": "The film version of that beautiful person with no personality: Avatar 2 tries to say and do a lot but comes off as a striking shell for a lackluster core.",
      "author": "EJ Moreno"
    },
    {
      "text": "Its message of family and the portrayal of a strong father and mother protecting their children is refreshing.",
      "author": "Alan Ng"
    },
    {
      "text": "Avatar: The Way of Water is destined to be a classic of modern science fiction. With solid story development and characters; showing off unprecedented visual effects, and revolutionizing the cinematic experience once again. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "Cover your eyes if you long ago tired of work that prides itself on “world building”. Flee the building if you longer ago wearied of worlds built to the aesthetics of Roger Dean covers for 1970s Yes albums.",
      "author": "Donald Clarke"
    },
    {
      "text": "The Way of Water doesn’t necessarily check all those boxes, but what it does right will offer spectators moments of awe, full-body immersion and genuine beauty.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Looks 10, story 3. Regardless of its visual splendor from state-of-the-art effects, “Avatar: The Way of Water” is a bloated, confusing mess of a story.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "Cameron's stunning sequel matches eco-warnings with parental empowerment.",
      "author": "Christian Toto"
    },
    {
      "text": "Stunningly beautiful and numbingly long. Always much better with visuals than stories, there is a haunting beauty to Cameron’s second effort.",
      "author": "Jim Slotek"
    },
    {
      "text": "If the larger story had felt more substantial than a \"rehash of previous conflicts, plus wet,\" then the thinly written characters might not have mattered.",
      "author": "Matt Oakes"
    },
    {
      "text": "The story may be simplistic on a narrative level, but it is on an emotional (and visual) level that \"Avatar: The Way of Water\" shines. This is a film about the importance of family, and how fighting together can solve problems. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "It's a three-hour nature documentary with some action sequences thrown in. It's beautiful but shallow.",
      "author": "Brian Lloyd"
    },
    {
      "text": "It truly was an astonishing cinematic experience I won't soon forget.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Like the first film, Avatar 2 is a flourish of A++ production values and stunning state-of-the-art VFX wrapped around a B-movie action melodrama. It’s the epitome of post-content cinema where story comes second to spectacle and appeal to basic emotions.",
      "author": "Jim Schembri"
    },
    {
      "text": "Avatar: The Way of Water will make waves for the plot, but visually, it's outstanding. Avatar 2 is mostly family friendly with some asterisks.",
      "author": "Tania Lamb"
    },
    {
      "text": "Features some of the most incredible spectacle ever created by the absolute master of precise parallel action... The only thing more astonishing than anything in The Way of Water is that Cameron will probably, somehow, top it.",
      "author": "Matt Lynch"
    },
    {
      "text": "The film can jar when oscillating between the CG-realised worlds and sequences with actors playing non-Na’vi characters, but for the most part The Way of Water is a sumptuous visual tapestry.",
      "author": "James Mottram"
    },
    {
      "text": "Watching this on IMAX 3D is truly a spectacular big-screen experience.",
      "author": "Casey Chong"
    },
    {
      "text": "a sprawling, indulgent trawl through an invented ecosphere that may mirror concerns of our own planet, but also both explores and exposes the limits of wonder.",
      "author": "Anton Bitel"
    },
    {
      "text": "The majority of the characters are cartoonish in nature and the dialogue leaves much to be desired, but, again, Cameron’s eye for visual sumptuousness is unmatched; and yes, this will be a necessary 3D viewing experience.",
      "author": "Peter Gray"
    },
    {
      "text": "Avatar: The Way of Water is a cinematic spectacle that should be seen on the big screen at least once.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "The watery world Cameron takes us to is astounding and magnificently conceptualized, but the story is missing the emotional draw that would have made this film an unqualified masterpiece.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "A spectacular must-see in 3D, Avatar: The Way of Water is more like a three-hour amusement park ride than a movie. But what a ride!",
      "author": "Peter Martin"
    },
    {
      "text": "What I really hate is that there are moments in Avatar: The Way of Water when you get a glimpse at the special film it could have become.",
      "author": "Richard Propes"
    },
    {
      "text": "If \"The Way of Water\" was the last film Cameron ever made, it’d be appropriate, as all of his cinematic obsessions coalesce within this gargantuan slice of mind-boggling spectacle presented with classical action-adventure storytelling.",
      "author": "Katie Walsh"
    },
    {
      "text": "\"The Way of Water” is immersive and has moments of threat that hold attention, improving on the original feature, but Cameron isn’t taking the saga to new dramatic places in the sequel.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Those who loved the original will see their years-long patience rewarded plentifully, while those who were underwhelmed or maybe even hated the original will be in for one hell of a surprise.",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "The 3D visuals are undoubtedly cool but it shouldn’t be the only reason to see this film - and yet it is.",
      "author": "Wenlei Ma"
    },
    {
      "text": "What sinks The Way of Water isn’t the dazzling filmmaking craft on display... It’s the story they choose to tell with it.",
      "author": "Clint Worthington"
    },
    {
      "text": "James Cameron does it again giving you a visual masterpiece that surpasses the first film, while also telling a more personal story with characters you love. Can't wait for part 3.",
      "author": "Brandon Avery"
    },
    {
      "text": "It's messy at times, and some may argue that its 192-minute running time is egregious, but I'm not one of them. Returning to Pandora may have felt like a dubious proposition mere weeks ago, but after The Way of Water, I can't wait to go back again.",
      "author": "Brent Hankins"
    },
    {
      "text": "Avatar: The Way of Water is a visual marvel that proves mesmeric when it deviates away from what came before and embraces all that comes with its new terrain.",
      "author": "Jeff Nelson"
    },
    {
      "text": "On more than one occasion we’re told that “the way of water has no beginning and no end.” No kidding.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Get out of the house and commit to the 3D glasses, because Avatar: The Way of the Water is a theatrical experience you won’t forget.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Plot-wise, this movie is treading water. But that’s fine, because the water’s lovely.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "James Cameron does it again with an amazing, spectacular visual experience. Pandora's more alive than ever in a movie with all of Cameron's strengths as filmmaker, & an emotional story of community, survival and family. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "An assault on your senses. Visually dazzling and action-packed, but overproduced, exhausting and vapid. It's more of a long and loud video game than an actual movie.",
      "author": "Avi Offer"
    },
    {
      "text": "Its wild spectacle, unbelievable detail, and technical wizardry will blast the eyeballs out of your sockets, but its honest and sincere undercurrents just might be its secret weapon.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "Every image of Avatar: The Way of Water oozes personality and is bursting with life; that’s the way of masterful filmmaking from a living legend",
      "author": "Robert Kojder"
    },
    {
      "text": "Though the graphics are still astounding, it’s difficult this time around not to realize the repetition of the story and the limited character arcs.",
      "author": "Mike Massie"
    },
    {
      "text": "This sequel is as revolutionary as the first film was in 2009. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "James Cameron has done it again! A staggering audiovisual spectacle and technical achievement that leaves its mark as a memorable cinematic experience. It outdoes the original in every way, including story and heart. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "It demands the biggest screen you can find so that its most potent elements — from its impossible scale and skillful spectacle, to its more complete range of emotions and thematic romanticism — can be completely absorbed.",
      "author": "Eric Francisco"
    },
    {
      "text": "Avatar: The Way of Water is the most classic movie-movie you will see this year (or most others) and it is the most remarkable, newfangled, nothing-else-like it, how the hell did they do that? game-changing entertainment at the same time. (Spoiler-Free)",
      "author": "David Poland"
    },
    {
      "text": "James Cameron has done it again with Avatar: The Way of Water, a state-of-the-art exercise that rekindles that sense of wonder and demands to be seen by anyone with lingering interest in watching movies in theaters.",
      "author": "Brian Lowry"
    },
    {
      "text": "Like the original, it’s “Dances with Wolves” in outer space. Only dumber.",
      "author": "Soren Andersen"
    },
    {
      "text": "Cameron and his cronies just expect us to marvel at his technological acumen and forget that filmmakers are supposed to entertain audiences, not expend energy to impress them with their moviemaking expertise.",
      "author": "Bob Bloom"
    },
    {
      "text": "The Na’vi aren’t just “fighting the good fight” this time around. Avatar: The Way of Water is about perseverance, loyalty, and the lengths they go to keep their family safe.",
      "author": "Steph Cozza"
    },
    {
      "text": "The Way of Water has a way of pulling you in, surrounding you with gorgeous, violent chaos and finishing with a quick rinse to get the remnants of its teeny-tiny plot out of your eyes by the final credits.",
      "author": "Michael Phillips"
    },
    {
      "text": "As a genuinely epic cinematic spectacle, Avatar: The Way of Water makes one big, impressive splash.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The film is endearing... [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "It’s fairly obvious that James Cameron is trying to make a movie that will appeal to a fairly broad audience, and while flawed, it certainly seems to do that job.",
      "author": "Edward Douglas"
    },
    {
      "text": "Yes, the film looks spectacular, but... so now do David Attenborough’s wildlife documentaries... the sight of a great white shark launching itself out of the water in Blue Planet II is far more awesome and sublime than a CGI fantasy creature... here.",
      "author": "Jason Best"
    },
    {
      "text": "If you love intricately rendered spectacle, director James Cameron’s Avatar: The Way of Water has plenty of it -- and the story almost manages to catch up with the visuals.",
      "author": "Julia Glassman"
    },
    {
      "text": "A visual masterpiece. The first half felt slow due to exposition and set up but the final act is emotionally intense and filled with great action. Love the performances and the new cast. Must see it in 3D!",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "When Cameron’s 3D cauldron of spells is at a high boil, the end result is nothing less than an upgrade on reality. At its best, you find yourself resenting the edges of the screen, for keeping you from feeling fully immersed in this world.",
      "author": "Liz Shannon Miller"
    },
    {
      "text": "Cameron is a master filmmaker who creates cinematic experiences unlike any other, so don’t waste the chance to experience this one.",
      "author": "Travis Hopson"
    },
    {
      "text": "Cameron loses track of his characters, snarls his story, squanders his star power, and then dizzies 3D audiences with so much whiz-bang that they might feel attacked in lieu of awed.",
      "author": "Kristy Puchko"
    },
    {
      "text": "A gorgeous, technically advanced, visually breathtaking film that is nothing short of spectacular. It's the perfect example of James Cameron doing what he does best, and is a rare sequel that improves upon the original.",
      "author": "Louisa Moore"
    },
    {
      "text": "Avatar: The Way of Water is proof that you should never bet against James Cameron.",
      "author": "Joey Magidson"
    },
    {
      "text": "Say what you will about the filmmaker, but he excels at world building. The aquatic life forms in this new movie look and feel like they could actually exist, although I did find the idea of living scuba tanks a little convenient.",
      "author": "Chris Knight"
    },
    {
      "text": "A stunning VFX achievement which could very well change the movie business yet again. More like a theme park experience, Avatar The Way of Water demands to be seen in premium 3D. And focusing on Lang's character gives this sequel some much needed edge.",
      "author": "Grace Randolph"
    },
    {
      "text": "Avatar: The Way of Water is equally impressive in its technical merits and in its storytelling merits. It’s one of the best films of 2022, easy.",
      "author": "Julian Lytle"
    },
    {
      "text": "James Cameron knows precisely how to slow the roller coaster down, loosen the perilous seat belts, and exit its riders with wobbly legs of emotional exertion.",
      "author": "Don Shanahan"
    },
    {
      "text": "James Cameron returns triumphantly to Pandora with an unparalleled cinematic epic. Avatar: The Way of Water submerses you in an alien ocean of adventure, retribution, and tragic violence. Nothing you've previously seen touches its visionary scope.",
      "author": "Julian Roman"
    },
    {
      "text": "It can be said that Cameron has invented a film within a film that converges Abyss, Terminator 1 & 2, Aliens and Titantic all in the same deafening prodigy. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A staggering behemoth of big screen wizardry to behold",
      "author": "Jason Adams"
    },
    {
      "text": "Avatar: The Way of Water is unfaltering in its high-octane action but it is infused with a steady emotional pulse. That is what keeps it centered; every character arc and plotline pays off.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Offers amazing visuals, magnificent world-building, and much better-executed storytelling and character work than was the case in the first film.",
      "author": "Stephen Silver"
    },
    {
      "text": "An enthralling, exhilarating, emotional story of a family in peril, with the most advanced digital effects in history. Is it a little bit overindulgent? Sure. But the scope, ambition, and heart of the film more than make up for any of its flaws.",
      "author": "Germain Lussier"
    },
    {
      "text": "This is not just content you ingest. “Avatar: The Way of Water” is a movie you bodily inhabit for three stunning hours. We come to this place for magic, indeed.",
      "author": "Marshall Shaffer"
    },
    {
      "text": "[A] simple but engaging story in an imaginative, beautiful environment.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "AVATAR: THE WAY OF WATER is a Lush Action Spectacle that Only James Cameron can Deliver!",
      "author": "Dan Tabor"
    },
    {
      "text": "Avatar: The Way of Water is such a screen-popping visual feast it earns the 3-hour, 12-minute running time, though the primarily aquatic setting might contribute to some viewers dashing out for a bathroom break.",
      "author": "Richard Roeper"
    },
    {
      "text": "Cameron, somewhat contra this initiative, also loves weapons, vehicles, vehicles as weapons, and what it looks like when those things destroy a body. On which front Way of Water delivers far above its predecessor, or for that matter any animated movie.",
      "author": "Nick Newman"
    },
    {
      "text": "The 3-D special effects remain exceptional, but the screenplay is better this time, with a storyline more emotionally engaging than in the original. When people and critters die, we feel it this time.",
      "author": "Randy Myers"
    },
    {
      "text": "While The Way of Water can feel a bit like a preachy David Attenborough programme and is easily half an hour too long, the 3D is absolutely breathtaking.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "A sometimes surreal, always spectacular sensory hit with an undertow of gentle emotion, an overflow of ambition, and a pleasingly earnest thematic thrust.",
      "author": "Kevin Harley"
    },
    {
      "text": "An extraordinary visual spectacle that can’t compare on the narrative side — although, to be fair, that’s a mighty high bar.",
      "author": "Tim Grierson"
    },
    {
      "text": "The most mesmeric experience I’ve had in a theater this year, perhaps in a few years.",
      "author": "Kyle Pinion"
    },
    {
      "text": "It’s a leap beyond even what he pulled off with the first film, a phantasmagorical, fully immersive waking dream of a movie in which something impossible is happening on-screen at almost every moment.",
      "author": "Nick De Semlyen"
    },
    {
      "text": "‘The most dangerous thing about Pandora,’ someone muses sagely at one point, ‘is that you grow to love it too much.’ Jim Cameron disagrees. He can’t love this place enough – and it’s infectious.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "It’s still more of a spectacle than a movie. But as spectacles go, it’s a big one.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Never doubt Big Jim! Avatar: The Way of Water is an indescribable visual spectacle. It's not just a blockbuster done to perfection but an experience that captures the magic of going to the movies.",
      "author": "David Gonzalez"
    },
    {
      "text": "Whoever thought that a 10-foot-tall blue alien would be such a sight for sore eyes?",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Cameron pulls you down so deep, and sets you so gently adrift, that at times you don’t feel like you’re watching a movie so much as floating in one.",
      "author": "Justin Chang"
    },
    {
      "text": "It’s time well spent for a movie set in deep space that turns out to be a free-flowing whale of a tale.",
      "author": "Peter Howell"
    },
    {
      "text": "As a story, The Way of Water disappoints, even as its visuals overwhelm.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "... A classic piece of franchise-elongation, in which nothing meaningful happens or important changes, and all the pieces are returned to their original positions, ready for the next instalment.",
      "author": "Robbie Collin"
    },
    {
      "text": "It sets the bar even higher for sci-fi epics. The movie's technical achievements and story surpass the first Avatar film. Expect to be immersed in a visually stunning world that has a lot to say about protection of families and the environment.",
      "author": "Carla Hay"
    },
    {
      "text": "If Cameron’s worldbuilding is exhausting, it also has an epic sincerity far from the lazy cash grab of most sequels. Lazy Cameron is not.",
      "author": "Danny Leigh"
    },
    {
      "text": "The Way of Water is the wave of the future, rolling in whether you like it or not.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "At 192 minutes, The Way of Water is less of a narrative film and more an endless tech demo one might expect to endure in purgatory.",
      "author": "Christopher Machell"
    },
    {
      "text": "This sequel is tremendous fun, even bigger and better than the original, but by golly it will test your bladder.",
      "author": "Brian Viner"
    },
    {
      "text": "Cameron’s all-encompassing style has a way of making other blockbusters feel small, vague. The Way of Water, in line with his best work, is more affecting for knowing its audience, for digging into primal feelings about being misunderstood.",
      "author": "K. Austin Collins"
    },
    {
      "text": "Overwritten, when it isn’t underwritten. Overwrought. Overblown. I’m over it.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "Avatar: The Way of Water transforms from simple wonder to something truly jaw-dropping.",
      "author": "Richard Whittaker"
    },
    {
      "text": "True movie magic. The Way of Water is a visual marvel loaded with groundbreaking technical feats that always feel in service of character and world-building.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Creatively speaking, [it's] of a piece with its predecessor, a would-be epic of boundary-pushing digi-grandeur in service of Pocahontas-style us-vs-them mush.",
      "author": "Nick Schager"
    },
    {
      "text": "A meticulous world-building as astonishing and enveloping as anything we've ever seen on screen — until that crown is passed, inevitably, in December 2024, the projected release date for Avatar 3.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "It's a gorgeous visual treat, a testament to the artistry and attention to detail of Cameron and his effects crew, but if you're looking for anything else from it, you'll be left sorely disappointed.",
      "author": "Kyle Anderson"
    },
    {
      "text": "For The Way of Water, the decadence is more than enough -- for cinemas that have been starved of authentic spectacle, finally, here’s a gorgeous three-course meal of it.",
      "author": "David Sims"
    },
    {
      "text": "Not for nothing do the combatants in this epic about planetary warfare feel like they stand a little straighter, swing a little harder, cheer a little louder because they take after the filmmaker’s passion, and not just how deep corporate pocketbooks go.",
      "author": "David Lynch"
    },
    {
      "text": "The Way of Water insists that times haven’t changed; it is heedless of contemporary industry undulations. That swaggering energy is, in large part, what makes the film such a pleasure to watch.",
      "author": "Richard Lawson"
    },
    {
      "text": "For now, the only thing that matters is that after 13 years of being a punchline, “going back to Pandora” just became the best deal on Earth for the price of a movie ticket.",
      "author": "David Ehrlich"
    },
    {
      "text": "There is beauty everywhere you look, from the spectacle provided by nature’s creations, the tactile sense you get from the skin and hair of humans and other natural life, and the emotional expressions of strength and sensitivity.",
      "author": "Todd McCarthy"
    },
    {
      "text": "It's like a travelogue for a place James Cameron clearly wants to live in and that he helps sell you on wanting to live in... It's an experience this year that I have not had in a movie theater and that I'm very eager to get back to.",
      "author": "Eric Goldman"
    },
    {
      "text": "Cameron's limitations as storyteller remain as crystal clear as the water. But one does not look to Avatar for narrative sophistication.",
      "author": "A.A. Dowd"
    },
    {
      "text": "James Cameron has more than equaled the visual spectacle bar he set for himself, once again creating a world you might feel sad you can’t actually visit.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "If the first Avatar is remarkable because it shows us wondrous lands nothing like our own, The Way of Water is remarkable because it shows us that this world is, in fact, very much like our own.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "When Cameron’s film calms down, and the stunning imagery that cinematographer Russell Carpenter has created with the film’s enormous visual-effects team can linger for a while, its imagination and scope can occasionally feel quite magical.",
      "author": "William Bibbiani"
    },
    {
      "text": "Even with its flaws, The Way of Water is an immersive, gorgeous cinematic journey through Pandora.",
      "author": "Maria Lattila"
    },
    {
      "text": "This wildly entertaining film isn't a retread of Avatar, but a film in which fans can pick out thematic and even visual elements of Titanic, Aliens, The Abyss, and The Terminator films.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Does exactly what is expected from it even if it eventually fails to move the narrative beyond the obvious \"good guys Vs stereotypical villains\" narrative.",
      "author": "Linda Marric"
    },
    {
      "text": "Avatar The Way of Water is a prime example of style over substance. It astonishing piece of filmmaking with immense visuals and action but the plot is weak and overstuffed.",
      "author": "Sarah Cook"
    },
    {
      "text": "The Way of Water is a stunning and somewhat mind-blowing visual experience. Story-wise, it is about what you expect, but the world-building is monumental. Cameron has truly delivered an epic blockbuster.",
      "author": "Austin Burke"
    },
    {
      "text": "I can’t say that I cared all that much about its story, its themes, or its characters, but its unimpeachable effects work made it feel like I’d locked eyes with the future.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Proves more frustrating than waiting 13 years for the sequel to Avatar. The new film introduces way too many new characters and doesn't serve any of them.",
      "author": "Fred Topel"
    },
    {
      "text": "The post-Pandora blues are back, and they can only be cured with the cause: Avatar The Way of Water is ultra big-screen escapism.",
      "author": "Cameron Frew"
    },
    {
      "text": "James Cameron's epic sequel builds out his sci-fi world, but with a more 3D story than before",
      "author": "Ali Shutler"
    },
    {
      "text": "An emotionally charged outing that again dips into themes of colonization while adding environmental issues and relatable family drama.",
      "author": "Brian Truitt"
    },
    {
      "text": "The only part of me that was moved was my eyeballs.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "“Avatar: The Way of Water” is a cinematic roller coaster that’s so breathtaking, awe-inspiring, and innovative beyond comprehension, you forget that you’re witnessing history.",
      "author": "Nate Adams"
    },
    {
      "text": "Cameron has, once again, knocked it so far out of the park that it’s going to take years to retrieve the ball. It is, quite simply, one the best-looking, most deeply felt Hollywood blockbusters we’re likely to experience for some time.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Avatar: The Way of Water is a clear improvement on its predecessor and, though its story isn’t breaking new ground, its jaw-dropping visuals make this an irresistible return to Pandora.",
      "author": "Tom Jorgensen"
    },
    {
      "text": "Ultimately, it’s the sincerity of Cameron’s belief in this fantastical world he’s created that makes it memorable.",
      "author": "David Rooney"
    },
    {
      "text": "Avatar 2, even with its faults, manages to showcase exactly why James Cameron...understands how to create wonder and magic and respects special effects as a medium in the same way he respects pushing the bounds of underwater filming.",
      "author": "Kate Sánchez"
    },
    {
      "text": "The Way of Water is still that rarest of things: a transportive blockbuster that voyages across new frontiers, all of which are fully realised in resplendent detail.",
      "author": "Yasmin Omar"
    },
    {
      "text": "While other movies might feel empty by relying on their visuals, The Way of Water emotes through them. Did I care for any of the characters (or know their names)? Nope. But it's an entertaining epic visual magnum opus that has to be seen in theaters.",
      "author": "Karl Delossantos"
    },
    {
      "text": "The floatingly bland plot is like a children’s story without the humour; a YA story without the emotional wound; an action thriller without the hard edge of real excitement.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Perhaps the most immersive moviegoing experience ever, I could get lost in the world of Pandora all day... or at least for 3 hours and 12 minutes.",
      "author": "Joey Morona"
    },
    {
      "text": "James Cameron’s high-tech spectacle succumbs to simplistic storytelling, shallow characterization, and a complete lack of engagement past its arduous artifice. It’s a disappointingly subpar sequel.",
      "author": "Eric Marchen"
    },
    {
      "text": "It favours style over substance. But when that style is so impeccably crafted, it's hardly an issue. You came here to be dazzled and dazzled you shall be. A masterclass in spectacle filmmaking.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Avatar: The Way of Water feels like a fresh start for this series, as Cameron address the weaknesses of the first film, improve the script and characters, while also creating one of the most extraordinary experiences one can have at the theaters.",
      "author": "Ross Bonaime"
    },
    {
      "text": "James Cameron’s sequel is a truly dazzling cinematic experience that will have you floating on a blockbuster high.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "The Way of Water is yet another leap forward in big screen spectacle, this time with even more feeling.",
      "author": "Jon Negroni"
    },
    {
      "text": "That The Way of Water is engaging nevertheless is a grand testament to Cameron’s abilities — as an immersive spectacle that no other medium could hope to replicate, it’s unlike anything we’ve seen since, well, probably the first Avatar.",
      "author": "Michael Nordine"
    },
    {
      "text": "Avatar: The Way of Water struggles under the weight of thirteen years of expectations and fails to be anything other than mediocre when it comes to anything other than the visuals.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "A feat of coldly-precise engineering, but not a good movie.",
      "author": "David Jenkins"
    },
    {
      "text": "The Way of Water is overlong and stretched thin on story, but the Avatar sequel is beautiful, with lush world-building and characters that add depth.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "James Cameron's Mega-Sequel Is An Overstuffed And Exciting Adventure.",
      "author": "Chris Evangelista"
    },
    {
      "text": "A technical marvel unlike anything I have ever seen before. Fortunately, Cameron also manages to bind us to the characters a little bit better in his return to Pandora. As far as blockbuster spectacle goes, this is simply incomparable.",
      "author": "Jimmy Cage"
    },
    {
      "text": "Watching \"The Way of Water\" is seeing the future of big blockbuster movies where the CGI is so crisp and beautiful (especially with 3D) that it's impossible for the eye to not think it's real.",
      "author": "Jason Guerrasio"
    },
    {
      "text": "James Cameron always pushes the envelope. This time, he has sealed himself inside. Frankly, if the \"Avatar\" films continue in this vein, Cameron’s intent to go out making as many as three more of them represents a truly depressing directorial epitaph.",
      "author": "Nick Rogers"
    },
    {
      "text": "Those who weren’t on the “Avatar” train the first time around should give Cameron a second chance.  “The Way of Water” is a glorious spectacle.",
      "author": "Laura Clifford"
    },
    {
      "text": "Words don't do Avatar: The Way of Water justice. While this film has all the makings of a once-in-a-lifetime theatrical experience, audiences should relish in the fact that there is much more to come.",
      "author": "Liam Crowley"
    },
    {
      "text": "It's a technical marvel, but that only goes so far if it didn't have more to offer. Fortunately, the time spent developing the first of several sequels has paid off, as this is a supremely entertaining adventure that is bigger and better than the first.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "It's certainly a visual masterpiece that's often beautiful to behold, but one that doesn't always have the substance to go with its considerable style.",
      "author": "Ian Sandwell"
    },
    {
      "text": "A visually stunning, cinematic adventure, that welcomes fans back to Pandora with open arms delivering both action and heart -- in a way too long package. Similar plot to Avatar, but dives deeper into the story and characters. Avatar fans will eat it up!",
      "author": "Tessa Smith"
    },
    {
      "text": "Director James Cameron's epic sequel has a lot to pack in: it's a decent sci-fi blockbuster, a visual effects masterclass, and the best nature documentary you'll ever see.",
      "author": "Richard Trenholm"
    },
    {
      "text": "Very much feels like a decade’s worth of accumulated ideas crammed into a single film.",
      "author": "Matt Singer"
    },
    {
      "text": "It is no exaggeration to say that this is one of the most technically impressive films ever made...a spectacular achievement, an epic homecoming in the most affectionate way.",
      "author": "Kevin L. Lee"
    },
    {
      "text": "\"The Way of Water\" is the magic of movies made manifest, a three-hour-plus epic that brings us to a new world and makes it thrillingly tactile in ways that no other film has done before. In other words: James Cameron has done it again.",
      "author": "Dan Bayer"
    },
    {
      "text": "For all the genuine thrills provided by its pioneering pageantry, Way of Water ultimately leaves you with a soul-nagging query: What price entertainment?",
      "author": "Keith Uhlich"
    }
  ],
  "release_year": 2022,
  "duration": 192,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "age_rating": "PG-13",
  "synopsis": "Set more than a decade after the events of the first film, \"Avatar: The Way of Water\" begins to tell the story of the Sully family (Jake, Neytiri, and their kids), the trouble that follows them, the lengths they go to keep each other safe, the battles they fight to stay alive, and the tragedies they endure.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/kyeqWdyUXW608qlYkRqosgbbJyK.jpg"
}