{
  "movie_name": "Bird Box",
  "movie_id": "bird_box",
  "total_reviews": 173,
  "reviews": [
    {
      "text": "It seems more occupied with delivering short term anxieties via separate sequences, like driving a car blind or two births occurring side by side, than refining the overall product to leave a lasting impact.",
      "author": "Calum Cooper"
    },
    {
      "text": "Bullock is the one that really shines here, she does an outstanding job and her performance made me realize how much I miss seeing her on-screen. She has a certain kind of charisma and presence...",
      "author": "Nyle Coleman"
    },
    {
      "text": "Bird Box toes the line. It holds your attention. It lets your imagination run wild, and sparks a ticker of running questions while you're engrossed with what's happening on screen.",
      "author": "Swetha Ramakrishnan"
    },
    {
      "text": "There's a lot to like about Bier's direction, though some of screenwriter Heisserer's adaptation choices don't always work. Thankfully Bullock and the mass death sequence are great, even if the film essentially has to do a soft reboot afterwards.",
      "author": "Joe Lipsett"
    },
    {
      "text": "“Bird Box” runs the gambit from riveting to predictable to kinda silly. At the same time it’s never boring and the performances are always worth watching.",
      "author": "Keith Garlington"
    },
    {
      "text": "...it's perennial Every-gal Bullock who ultimately is the VIP...",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "To survive, they live in a world without sight of the outside world. That premise inevitably invites comparison to A Quiet Place. In Bird Box, the concept does not work nearly as well.",
      "author": "Cate Marquis"
    },
    {
      "text": "I love Susanne Bier's movies for their conscious humanity, and that's the quality that separates this from many similar movies about the end of the world and the collapse of civilization.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "...the denouement of Bird Box has a particularly intriguing twist.",
      "author": "Jennifer Merin"
    },
    {
      "text": "The taut pacing and overall tension keep you invested.",
      "author": "Betsy Bozdech"
    },
    {
      "text": "Susanne Bier is a filmmaker with an innate ability to mine the painful truths of the human experience.",
      "author": "Nikki Baughan"
    },
    {
      "text": "Silly un-scary mash-up of ten things better things before it",
      "author": "Jason Adams"
    },
    {
      "text": "More than anything, this is a display of what movie stars can do. Bullock's time bomb performance, always tamping down the scream she clearly wants to let out, is riveting. The film she gifts it to is not much to see.",
      "author": "Olly Richards"
    },
    {
      "text": "I'm not gonna lie this film actually left me in tears, it was beautiful, it was strong, and it was direct and that ending. Wow.",
      "author": "Emma Wolfe"
    },
    {
      "text": "The acting really sells the premise, chiefly from Bullock, imparting a striking sincerity that prevents the sci-fi/horror elements from being frivolous.",
      "author": "Mike Massie"
    },
    {
      "text": "With an extremely interesting premise, Bird Box becomes a meaningless film filled with disappointing moments. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "...Bird Box does give visual and dramatic life to a fairly widespread conviction at present in certain upper middle class circles, in Hollywood and elsewhere...",
      "author": "Joanne Laurier"
    },
    {
      "text": "While it's no 4-star instant classic like \"A Quiet Place,\" which did it first and did it better, far be it from me to nitpick a viral hit.",
      "author": "Jason Fraley"
    },
    {
      "text": "Bird Box is as horrific as it is captivating...",
      "author": "Nabila Hatimy"
    },
    {
      "text": "Should have been called \"Bird-brained.\"",
      "author": "Peter Rainer"
    },
    {
      "text": "I saw Bird Box in previews before the hype and thought it was an entertaining, small-scale Sandra Bullock film with a nifty concept and few pretensions.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "[Susanne] Bier does a great job of adding tension to set pieces, however, some of the choices she makes take away from that tension.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Bird Box's greatest strength undeniably lies in the perfect casting of Sandra Bullock in the lead role.",
      "author": "Sarah El-Mahmoud"
    },
    {
      "text": "By the end of the film, I started to wish I'd blindfolded myself. In fact, I started to root for the monsters.",
      "author": "Bonnie Burton"
    },
    {
      "text": "It has a good approach, but its genius fades as it advances. The creatures' essence is not very clear and the characters' motivations are not enough explored [Full Review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "Bier's insistence on constantly explaining the characters' circumstances leaves very little room for real mystery.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Bird Box is a mostly decent representation of a book that proves difficult to film...even though the characters veer away from those in the book, the ensemble cast is surprisingly good.",
      "author": "Carolyn Mauricette"
    },
    {
      "text": "The perfect mix of A Quiet Place and The Happening, Bird Box is sure to have you on the edge of your seat.",
      "author": "Tessa Smith"
    },
    {
      "text": "Based on a (far superior) book by Josh Malerman...",
      "author": "David Nusair"
    },
    {
      "text": "Netflix's latest original film Bird Box, directed by Susanne Bier, falls short of being the next A Quiet Place with its drawn-out narrative and a timeline that causes the film to lose its impact.",
      "author": "Sara Clements"
    },
    {
      "text": "Over-long and over-clichéd, Bird Box feels like familiar territory and not in a good way",
      "author": "Becky Kukla"
    },
    {
      "text": "An immense disappointment. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "To put it simply,Bird Box is a heart attack. I mean that in a good way.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Sandra Bullock is terrific in Bird Box, commanding the screen and our attention in this mostly gripping, occasionally scattershot sci-fi thriller.",
      "author": "Loren King"
    },
    {
      "text": "Bird Box isn't going to be everyone's favorite movie. It's certainly not mine. But considering I'm still thinking about this film well after I initially watched it, I have to admit it did make an impact.",
      "author": "Karen Rought"
    },
    {
      "text": "The great ensemble cast, kudos to Netflix for doing this thing... Sandra Bullock And Trevante Rhodes really do a good job carrying most of the movie.",
      "author": "Sharronda Williams"
    },
    {
      "text": "Finale aside, Bird Box is a taut thriller that keeps you hooked.",
      "author": "Kristen Lopez"
    },
    {
      "text": "The pressing question is which sense can be utilised next in the Hollywood horror factory. Touch? Where everyone has to go round wrapped in teflon or as human-sized condoms?",
      "author": "PJ Nabarro"
    },
    {
      "text": "It survives its ill-fate because of a feisty performance by Bullock.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Bird Box, led by a strong Sandra Bullock, does a solid job of telling a story that compares the desire to destroy oneself with the constantly challenging nature of being a parent.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Following impossible, far-fetched routes, Bird Box is a lumbering and quite incongruous mess.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Birdbox entertained me, but stressed me the hell out all at the same time. I spent half the film peeping through my fingers and jumping...just saying.",
      "author": "Carla Renata"
    },
    {
      "text": "The infamous Boogeyman... is always going to be far more terrifying when intangible and fleeting and in this endeavour, director Susanne Bier has ably succeeded.",
      "author": "June Butler"
    },
    {
      "text": "A terrible knockoff of A Quiet Place...",
      "author": "Justin Brown"
    },
    {
      "text": "I'm never seeing this movie again. It's a bad hybrid of thriller and end-of-the-world movies I've seen.",
      "author": "Brandon Collins"
    },
    {
      "text": "It squanders an opportunity for thoughtful commentary on trauma and survival.",
      "author": "Cody Corrall"
    },
    {
      "text": "Bullock tries her best, but she outpaces her surrounding cast and can't rise above the movie's dopiness.",
      "author": "Bob Grimm"
    },
    {
      "text": "The survival tactics in these horrific worlds may be original, but the themes of these films certainly aren't.",
      "author": "Kirk Baird"
    },
    {
      "text": "Overall, Bird Box is a solid new entry into sensory deprivation horror, and perhaps a greater sign that Netflix just might know what it's doing.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "Though Bird Box is not a religious film per se, Malorie leads by faith and not by sight. This film prompts a deep conversation exploring the meaning of interior, spiritual, and physical freedom.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "Bird Box is an astute marketing phenomenon and is a good entertainment product, which does not make sense to demonize. [Full Review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "All in all, Bird Box is a solid film. It offers strong characterizations, plenty of chills and a lot of bloody endings. Sure, there are things the book does better, which is to be expected.",
      "author": "Amanda Greever"
    },
    {
      "text": "Violent sci-fi thriller has chaos, gory deaths, swearing.",
      "author": "Renee Schonfeld"
    },
    {
      "text": "The characters are basically delivery systems for the film's metaphors, and the actors can't access much beyond the basics -- fear, love -- in the moment.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Sandra Bullock is great in this entertaining, yet underwhelming horror thriller. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "On its own merits, Bird Box offers serviceable sci-fi scares...",
      "author": "Jamie Healy"
    },
    {
      "text": "The production is skilfully assembled, shot in ways that keep the suspense levels high and the characters at the centre.",
      "author": "Rich Cline"
    },
    {
      "text": "Susanne Bier's direction is great and the performances elevate this film. [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "Sandra Bullock is always likable and effective, but she's surrounded by several one-dimensional fellow survivors, none of whom act or think like real human beings.",
      "author": "Tom Santilli"
    },
    {
      "text": "A clunky, middling rehash of tired apocalyptic-fiction tropes.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "This post-apocalyptic thriller with supernatural overtones has a clever premise - as in the legend of Medusa, death visits anyone who looks upon the source of evil. But the potential is squandered.",
      "author": "John Lui"
    },
    {
      "text": "Sandra Bullock stars in this intense, enigmatic thriller - about the psychological struggles of parenthood.",
      "author": "Susan Granger"
    },
    {
      "text": "A movie that builds tension and emotional stakes, while turning apocalyptic horror tropes on their heads.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "This is a big f--- you to the horror movies out there especially movies that are depending on a lot of CG and a lot of jump scares.",
      "author": "Korey Coleman"
    },
    {
      "text": "Along with Sandra Bullock's charisma as a leading lady, the movie boasts a riveting premise that feels like a cross between \"Lost\" and M. Night Shyamalan's better efforts.",
      "author": "Megan Basham"
    },
    {
      "text": "You could support a tight 80-minute film with that river journey. As it turns out, though, you cannot support half of a two-hour movie.",
      "author": "Tim Brayton"
    },
    {
      "text": "Is it good? Not really, but it doesn't need to be.",
      "author": "Melanie McFarland"
    },
    {
      "text": "I just feel like it's \"A Quiet Place\" but let's take out the vision.",
      "author": "Tony Baker"
    },
    {
      "text": "Unfortunately, Bird Box puts these performers through familiar paces, in roles of such tight typecasting that they seem like recurring characters in an extended TV series...",
      "author": "Richard Brody"
    },
    {
      "text": "Sandra Bullock delievers a powerhouse performance.",
      "author": "Ben Rolph"
    },
    {
      "text": "As it stands, it is a film with a cast better than it deserves, a schmaltzy ending it hasn't earned, and very little to say about the nature of fear and survival.",
      "author": "Christina Tucker"
    },
    {
      "text": "Bird Box is a tense, emotional, and even frightening film with a unique plot and deeply emotional core.",
      "author": "Molly Henery"
    },
    {
      "text": "A pretty good, if not occasionally frustrating thriller a few missteps away from being truly special.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "For as effective as Bullock's portrayal comes across, Bier leaves too much on the table in terms of mythology, and aside from brief drawings and shadows in the corridors, the monsters remain unseen (a tactic that works, until it doesn't).",
      "author": "Nate Adams"
    },
    {
      "text": "A Quiet Place was a pleasant surprise. In front of Bird Box, it looks like a masterpiece. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "For the birds? Or something more. In other words, the mass helpless perception through those very senses. Counting deep state digital surveillance, and the powerlessness of all of us against these doomsday scenarios for real - protective blindfold or not.",
      "author": "Prairie Miller"
    },
    {
      "text": "A challenging depiction of motherhood ... It's a compelling idea that stays with the viewer long after the genre trappings.",
      "author": "Tara Brady"
    },
    {
      "text": "With unintentionally funny scenes featuring its characters hurtling themselves head-first through windows to commit suicide, Bird Box sadly has more in common with the M. Night Shyamalan disasterpiece The Happening than anything else.",
      "author": "Eric Melin"
    },
    {
      "text": "Some portions feel familiar, ranging from The Mist to The Happening, but the overall creepiness, suspense and entertainment value still makes it worth a look.",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "Bier is a director who has managed to reveal and detail the human condition... The issue is that everything is stretched unnecessarily with, rather than twists, flimsy subplots. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "The cross-cutting narrative device doesn't add much to the movie, and as it wears on, it starts to feel like it isn't totally sure what it's trying to do.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "After such an amazing, awe-inspiring start, it's disappointing this thriller couldn't have thought a little more outside the box.",
      "author": "James Croot"
    },
    {
      "text": "About a mother and an allegory for motherhood, as we stagger blindfolded after our children in a world that looks the same but has changed beyond our understanding. Bullock is brilliant in an often derivative film that still had me willing their survival.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Even with a great Sandra Bullock performance, Bird Box ultimately leaves you with an impression you're unlikely to remember but won't be offended if you do.",
      "author": "Jonathan Christian"
    },
    {
      "text": "Too many questions go unanswered in 'Bird Box.' Perhaps the novel explains things, but the movie leaves us being unsure of why the horrific events are happening.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Bird Box's pieces feel forcibly screwed together, a movie marionetted by strings of data code. There's good scenes and smart ideas, but overall, the movie mostly clomps.",
      "author": "Amy Nicholson"
    },
    {
      "text": "There's a lot that grabs you, and then there's the ending, which is unfortunately so farcical that everything that came before it immediately sucks out the air in Bird Box's metaphorical balloon.",
      "author": "Karen Han"
    },
    {
      "text": "Great, shudder-inducing stuff.",
      "author": "Richard Roeper"
    },
    {
      "text": "If you need a burst of apocalyptic horror over the holidays, this might be a decent fit. Otherwise, it's forgettable next to other horror offerings of the year.",
      "author": "Kate Gardner"
    },
    {
      "text": "Bird Box won't set the world alight with its ultimately lacklustre tension building, but its interesting concept and strong central performance from Sandra Bullock guide the audience through this world of trepidation with power and heart.",
      "author": "James Perkins"
    },
    {
      "text": "Bird Box is Netflix's most industrial response as a film producer, with a conventional product that is sure to continue to take hold in a field that until recently was only explored by major studios. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "A character and cast-driven end of the world film that delivers with a slow-burn intensity that never pushes as far as it's inspired premise could have, but it's still a fun Christmas surprise from Netflix.",
      "author": "Bill Watters"
    },
    {
      "text": "Packing an intense emotional wallop and a truly nail-grinding sense of suspense, Bird Box is a surprise stunner.",
      "author": "Erin Free"
    },
    {
      "text": "Sandra Bullock shines in this effective and thrilling post-apocalyptic story about motherhood, survival and sacrifice. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Bird Box is a tidy but in the end underwhelming sci-fi thriller, perfectly average in every way aside from its delicious central concept.",
      "author": "Ed Power"
    },
    {
      "text": "For all its taut thrills and ambitious ideas, Bird Box traps itself into the same cage that ensnared other high-concept sci-fi thrillers such as the forgotten Nicolas Cage movie, Knowing, and even the recent Alex Garland film, Annihilation.",
      "author": "Rohan Naahar"
    },
    {
      "text": "A pretty fantastic horror drama with a meaningful message...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Bird Box succeeds in being a solid thriller, but, really (and frustratingly) could have been much more.",
      "author": "Matt Hudson"
    },
    {
      "text": "Bullock delivers an incredible performance of strength and emotion. She never gives up, and her need for survival is only outweighed by the survival of her children.",
      "author": "Alan French"
    },
    {
      "text": "Some things are best left unsaid. Some are best left unseen. And some are best left being books.",
      "author": "Randall Colburn"
    },
    {
      "text": "...a film has thrills to spare, even if it borrows from a lot of familiar sources to make them happen.",
      "author": "Travis Hopson"
    },
    {
      "text": "Overall, Bird Box is a strong thriller for Netflix from The Night Manager director Susanne Bier. It's not groundbreaking or the best of its kind, but it's a tense and entertaining watch for genre fans and casual viewers alike.",
      "author": "Lewis Knight"
    },
    {
      "text": "All that said, given that it's on Netflix and won't cost subscribers any more than they've already paid for the service, I can't really say that Bird Box isn't worth a look.",
      "author": "Richard Lawson"
    },
    {
      "text": "It's like Jaws without the shark or Jurassic Park without the dinosaurs: it simply doesn't work.",
      "author": "Kevin Maher"
    },
    {
      "text": "While Bird Box is wrapped up in a postapocalyptic-thriller guise, it's more a cautious character study...",
      "author": "Barry Hertz"
    },
    {
      "text": "I care as much about the people who ran around in its fiction now as I did before I watched them for two hours, which is to say, not at all.",
      "author": "Emily Yoshida"
    },
    {
      "text": "Bullock gives a strong, fiercely determined performance; the rest of the cast is in equally good form. But in trying to surpass generic horror, Bird Box achieves only limited success.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Bullock's in no-way-dimmed movie-star chops ably carry the film -- she's front and centre of pretty much every scene. There's a lot of talent in the supporting cast as well.",
      "author": "Dominic Corry"
    },
    {
      "text": "\"Bird Box\" winds up resembling M. Night Shyamalan's disastrous \"The Happening,\" so maybe Malorie has it right: It's better not to look.",
      "author": "Adam Graham"
    },
    {
      "text": "Frequently takes breaks for levity... I didn't mind. I appreciated the throwback quality. Directed by Susanne Bier, Bird Box is shameless entertainment, so hurrah for that.",
      "author": "Kyle Smith"
    },
    {
      "text": "None of Bird Box makes a lick of sense.",
      "author": "Rich Juzwiak"
    },
    {
      "text": "Brutal and tense, but we've seen it all before.",
      "author": "Hannah Strong"
    },
    {
      "text": "Director Susanne Bier keeps a novel-based screenplay from Eric Heisserer absorbing, under control, and routinely bordering on the brink of outrageous thrills.",
      "author": "John Urbancich"
    },
    {
      "text": "Refreshingly, Bird Box gives a much more complex depiction of pregnancy and motherhood in a post-apocalyptic setting.",
      "author": "Kayti Burt"
    },
    {
      "text": "Dare to take off your blindfold and watch Bird Box . The thrill and Bullock's performance are well worth the ride.",
      "author": "Jazz Tangcay"
    },
    {
      "text": "Bird Box offers a humdrum (and kind of hinky) hook but a solid cast, and it's Sandra Bullock and the ensemble that heap some heft into this standard scorched Earth story.",
      "author": "Matt Fowler"
    },
    {
      "text": "With the one true horror element unseen and mostly unheard, we are left with a ton of gore and little of the suspense that the film's trailer promised.",
      "author": "Aramide Tinubu"
    },
    {
      "text": "A qualified Stream It for general audiences. A raving, enthusiastic Stream It for Sandra Bullock fans.",
      "author": "Joe Reid"
    },
    {
      "text": "It's an often-effective thriller, though marred by increasingly expositional dialogue and questionable character decisions.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "It wants to be A Disquieting Place - but fails.",
      "author": "Adrian Hennigan"
    },
    {
      "text": "Here ... is a gimmicky thriller that transcends its gimmick.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Director Susanne Bier's perilous post-apocalyptic film, Bird Box, straddles the line between rudimentary and riveting.",
      "author": "Robert Daniels"
    },
    {
      "text": "I really enjoyed it for all its tense, gory, eerie, if not entirely original tropes.",
      "author": "Jamie East"
    },
    {
      "text": "Cinema often makes the mistake of showing too much because it can. Bird Box is the ultimate exercise in using visual storytelling to convey as much as possible by hiding it out of the character's view.",
      "author": "Fred Topel"
    },
    {
      "text": "Contrivances and clichés abound, but Bird Box still manages to be a compelling, high-concept idea thanks to Bier's faultless direction and impressive cast.",
      "author": "Linda Marric"
    },
    {
      "text": "BIRD BOX is an oftentimes haunting and provocative thriller, with a surprisingly heavy dose of horror.",
      "author": "JimmyO"
    },
    {
      "text": "There are so many characters in Bird Box that it feels cluttered, and yet, we can't care about a damn one of them other than Malorie because their fates are all but sealed from the second we lay eyes on them.",
      "author": "Andrew Parker"
    },
    {
      "text": "Bullock's perf is the most interesting part of this familiar film.",
      "author": "Anne Brodie"
    },
    {
      "text": "Save a reasonably suspenseful scene at the midpoint, \"Bird Box\" is a jacuzzi-fart indulgence of the same mealy-mouthed, meat-headed morality debates about the world's end that you'd find in any given \"The Walking Dead\" moment. At least it's shorter.",
      "author": "Nick Rogers"
    },
    {
      "text": "Bird Box would have functioned as far more intense and less formulaic to the apocalyptic genre by pushing the five-years-into-the-pandemic aspect, which forces the filmmakers to creatively play around with the plague that they have unleashed",
      "author": "Robert Kojder"
    },
    {
      "text": "Bird Box blends smart sci-fi with grindhouse goofiness. The former eventually wins the day.",
      "author": "Christian Toto"
    },
    {
      "text": "Bier manages to keep it on task and quite tense at times, providing a human touch to best prop up the scares.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Bird Box doesn't allow viewers to invest much in its cast. In this case, an ominous atmosphere just isn't enough.",
      "author": "Kiko Martinez"
    },
    {
      "text": "I found myself liking this as much or more than A Quiet Place, mainly due to the cast.",
      "author": "Edward Douglas"
    },
    {
      "text": "There is nothing wrong with Bullock's performance but the storytelling here becomes increasingly incoherent.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Bird Box is effective, we feel the tension and desperation of the narrative, but [it's] not supported by a complacent ending. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Not a bad frightener when it works. When it doesn't work, it's largely for the birds.",
      "author": "Nigel Andrews"
    },
    {
      "text": "The film essentially begins at its climax, and then backtracks, via flashback, to the onset of the crisis, hopping forward and back repeatedly over a five-year gap. This has the effect of destroying momentum.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "Bird Box is scary, but it also feels very human.",
      "author": "Randy Cordova"
    },
    {
      "text": "Every frame of Bird Box has a unique foreboding terror about it. It's not scary per se, but it's grueling in the best possible way.",
      "author": "Germain Lussier"
    },
    {
      "text": "Bird Box sells the atmospheric chills. It's creepy as hell and well acted, but takes a tremendous suspension of disbelief.",
      "author": "Julian Roman"
    },
    {
      "text": "A smart, nail-biting psychological horror film that works, thanks to a tight script, a talented cast and stunning cinematography.",
      "author": "Pamela Powell"
    },
    {
      "text": "Bullock gives her worried looks a workout and, in doing so, manages to steer this well clear of the car crash it might have been.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Many sections of Bird Box don't hold up to a second's scrutiny; the conceit's silliness and convenient scare tactics make Shyamalan's take on infectious-suicide horror seem downright subtle by comparison.",
      "author": "Chris Barsanti"
    },
    {
      "text": "Bird Box keeps you on the edge-of-your-seat, and often times you, too, want to look away.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "You've seen this all many times before, which doesn't mean you'll mind seeing it again.",
      "author": "Justin Chang"
    },
    {
      "text": "The only real shock in this one is that it stars Sandra Bullock, who should know better.",
      "author": "Rex Reed"
    },
    {
      "text": "Bird Box will creep under your skin without you noticing.",
      "author": "Elena Lazic"
    },
    {
      "text": "This horror-thriller is rarely scary and only fitfully suspenseful...",
      "author": "Brian Viner"
    },
    {
      "text": "Sandra Bullock leads a strong cast in the end of the world thriller that remains faithful to Josh Malerman's novel.",
      "author": "Joe Friar"
    },
    {
      "text": "Sandra Bullock commands the screen in this only fitfully scary, post-apocalyptic sci-fi/horrorshow in which invading aliens can only kill you if you look at them. So keep your eyes wide shut.",
      "author": "Peter Travers"
    },
    {
      "text": "Bullock delivers a convincing portrait of a woman in danger of losing her humanity...",
      "author": "Glenn Sumi"
    },
    {
      "text": "Eric Heisserer's script works better when it sticks to the basics, locking us in what could be the last safe place on Earth and allowing us to ask how we'd behave in such a nightmarish predicament.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Despite many elements in Bird Box working effectively, the movie never quite comes together.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Much of the characterization found in this movie from the Danish filmmaker Susanne Bier... is severely undercooked.",
      "author": "Aisha Harris"
    },
    {
      "text": "Screenwriter Eric Heisserer and director Susanne Bier deliver a tension-building thriller that bodes not only one of the most exquisite cinematic payoffs but one of the most powerful emotional journeys of a single character to come along in many a day.",
      "author": "Debbie Lynn Elias"
    },
    {
      "text": "it is that 'conceptual' part that eventually undoes the film, screenwriter Eric Heisserer's (\"Arrival\") adaptation of Josh Malerman's novel reading too much like a parody of Trump resistors and supporters.",
      "author": "Laura Clifford"
    },
    {
      "text": "Bird Box paints a bleak dystopian future but there's something about Sandra Bullock's performance that makes us care about what's happening.",
      "author": "Danielle Solzman"
    },
    {
      "text": "In the end, Bird Box's most significant shortcoming is that it's just too inert and unfocused to work as sci-fi horror.",
      "author": "Katie Rife"
    },
    {
      "text": "The combination of good acting, by Sandra Bullock, and plausible plot lines - be kind, it is a suspense/horror/monster movie - and good background characters (not stick figures) makes \"Bird Box\" better than it ought to be.",
      "author": "Robin Clifford"
    },
    {
      "text": "Films like this work to the extent their characters represent decision-making that stretches the sharpness of the audience (without overdoing it with Macgyver-esque antics) or suffer the opposite problem of insulting them with idiots.",
      "author": "Jordan Calhoun"
    },
    {
      "text": "The actors are fine, but the problem is that it's hard to care about the interaction of the people inside, because nothing they do matters.",
      "author": "Mick LaSalle"
    },
    {
      "text": "A key sequence at the end of the second act is so unusual, improbable and physically awkward (you'll know it when you see it) that it inspires laughter...this is the point of the story when tension should be the tautest, and it is deflated.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "Bier keeps the mood taut and defiantly in the moment.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Susanne Bier provides an atmospheric horror film that blends in drama and doesn't give up all the answers, making this a good choice for a night in.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "It's a solid three-star post-apocalyptic drama that is elevated by its stacked cast.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Bier has crafted a horror thriller sturdy enough to keep from being a failure but not one distinct or courageous enough to stand out from the pack.",
      "author": "David Bax"
    },
    {
      "text": "Bier's direction is coolly efficient, which fits the material to a t - anything more ostentatious would just feel wasteful.",
      "author": "Michael Nordine"
    },
    {
      "text": "This tension-fueled, exhilarating, highly emotional experience cuts to the bone, delivering a heartrending tale of survival and a mother's journey towards acceptance.",
      "author": "Courtney Howard"
    },
    {
      "text": "With hints of \"The Road,\" \"A Quiet Place\" and any number of zombie movies, this Netflix horror-thriller is appreciably bleak but also sluggish, never fully fleshing out the themes at the story's core.",
      "author": "Tim Grierson"
    },
    {
      "text": "We all hope that we're raising smart, strong kids while also allowing them to experience the joys of childhood; it's that innate understanding of parenthood that makes Bullock's performance feel real. It's equally fascinating and terrifying to watch.",
      "author": "Yolanda Machado"
    },
    {
      "text": "A wannabe shocker with a clever premise that doesn't really get down and dirty or betray the base instincts of a born horror filmmaker.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Malerman and screenwriter Eric Heisserer... have served up an inexplicably bland ensemble that even a talented cast can't render interesting.",
      "author": "Peter Debruge"
    }
  ],
  "release_year": 2018,
  "duration": 124,
  "genres": [
    "Horror",
    "Mystery & Thriller",
    "Sci-Fi",
    "Adventure"
  ],
  "age_rating": "R",
  "synopsis": "When a mysterious force decimates the population, only one thing is certain -- if you see it, you die. The survivors must now avoid coming face to face with an entity that takes the form of their worst fears. Searching for hope and a new beginning, a woman and her children embark on a dangerous journey through the woods and down a river to find the one place that may offer sanctuary. To make it, they'll have to cover their eyes from the evil that chases them -- and complete the trip blindfolded.",
  "popularity": 5.8,
  "poster_url": "https://image.tmdb.org/t/p/original/rGfGfgL2pEPCfhIvqHXieXFn7gp.jpg"
}