{
  "movie_name": "Black Widow",
  "movie_id": "black_widow_2021",
  "total_reviews": 460,
  "reviews": [
    {
      "text": "The result is a film that is fun to watch, but very little else.",
      "author": "Christina Newland"
    },
    {
      "text": "It took too long to get here, but now that it’s done, Widow couldn’t have asked for a better send-off.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Black Widow” may be the most mumblecore entry in the franchise. Romanoff (how do they get assigned last names?) is the equivalent of the adult who just lost her job or got divorced then must return home to deal with some unresolved trauma",
      "author": "Sarah Vincent"
    },
    {
      "text": "What director Cate Shortland does so well with Black Widow is the balance of tones within the story, something that Marvel has struggled a little bit with their latest TV projects.",
      "author": "Amy Smith"
    },
    {
      "text": "We liked the cast, but it didn’t live up to the potential of telling Natasha Romanoff’s backstory.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Black Widow proves that the MCU can scale down when it needs to, which is a card trick more valuable than one might think. Natasha may be dead, but Black Widow shows how powerfully her legacy lives on.",
      "author": "Lindsey Romain"
    },
    {
      "text": "Black Widow is the story audiences deserve, arriving much later than audiences hoped, and in a time frame that’s not quite big enough to suffice the story.",
      "author": "Jeffrey Peterson"
    },
    {
      "text": "Black Widow provides a fitting send-off for Natasha by giving her the space to put herself completely on the line for what she believes in.",
      "author": "Nadine Whitney"
    },
    {
      "text": "It’s a near perfect prequel & in everyway dives deep into a character that has been the heart of the avengers for awhile. \nIt might be a little too late & this film should of come right after Civil War…. But still with its heart",
      "author": "Zach Pope"
    },
    {
      "text": "Black Widow beautifully honors the iconic Natasha Romanoff, who finally receives the respectful, worthy solo film that her unforgettable legacy always deserved. Scarlett Johansson shines one last time.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Black Widow is both complex and engaging as its focus on familial relationships leads to some of the most memorable moments thanks to its ensemble and, in turn, creates new characters for Marvel’s team to play with in their billion-dollar sandbox.",
      "author": "David Gonzalez"
    },
    {
      "text": "Natasha and Yelena are... kicking *ss, getting dirty, and ribbing on each other for posing while fighting. But [they're] also compassionate enough to share a hug and cry. To me, this is the best female-led film in the superhero genre.",
      "author": "Joseph Garcia"
    },
    {
      "text": "Pugh is fabulous, by a long mile the best thing in the film, and for a few brief scenes it flares into life as that rare Marvel movie with no aspirations above street level.",
      "author": "Tom Shone"
    },
    {
      "text": "Harbour’s Alexi stands out among this talented group",
      "author": "M.N. Miller"
    },
    {
      "text": "Black Widow is a fitting finale for star Scarlett Johansson that simultaneously sets up captivating new characters to carry on her legacy.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "The mostly self-contained story packs a surprising amount of heart and finally gives this long-running MCU character a proper send off.",
      "author": "Keith Garlington"
    },
    {
      "text": "Black Widow smashes the Bechdel test, keeping Nat and Yelena at the center of the action. ... This enables the pair to both poke fun at the character and her signature pose and revisit some of her low moments.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "There isn't a real opportunity for these big name stars to interact in an interesting way. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "I tend to judge each new MCU installment by one simple criteria: was it entertaining? When it comes to Black Widow, my answer is Yes.",
      "author": "Scott Phillips"
    },
    {
      "text": "Marvel Studios’ Black Widow was too little, too late for the MCU’s most popular female character...",
      "author": "Michael Curley"
    },
    {
      "text": "A lukewarm farewell to a character who never got to take center stage when she deserved to, and this film feels too-little, too late as a result.",
      "author": "Jessie Gender"
    },
    {
      "text": "BLACK WIDOW is Marvels take on a somewhat silly, over-the-top retro Bond movie. Certainly not great cinematic art, but really entertaining and with a wonderful cast.",
      "author": "Jimmy Cage"
    },
    {
      "text": "While far from being one of the best installments of the MCU, Black Widow is still a fairly decent outing, propelled by spirited performances by Scarlett Johansson and Florence Pughs characters.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "A Marvel film that is happy to be its own self-contained adventure. If this came in the build-up to Infinity War, it might have got lost in the shuffle. However, after two years away from the big screen, Johansson brings the universe back with style.",
      "author": "Victoria Luxford"
    },
    {
      "text": "For fans who simply want to see this character one more time on the big screen getting her long-deserved moment, the film delivers perfectly adequately.",
      "author": "Carson Timar"
    },
    {
      "text": "Marvel fans have longed for the release of Black Widow, the latest installment in the Avengers franchise, since at least 2015. Though its not perfect, many fans will consider this feminine superhero movie worth the wait.",
      "author": "Collin Garbarino"
    },
    {
      "text": "That said, if any film had to reinvigorate the box office for audiences, Im glad its this one, which proves once again to the risk-averse Disney that having a female protagonist can actually succeed.",
      "author": "Wesley Lovell"
    },
    {
      "text": "After fans have been waiting so long for Black Widow to get a solo film, it feels like a bit of a letdown for her to get overshadowed by a new character in her own film.",
      "author": "Jeff Nelson"
    },
    {
      "text": "Not only do we continue to see Natasha's physical prowess, but we also get to witness a more emotional side to the character. This was as much Pugh's movie as Johansson's.",
      "author": "Karen Rought"
    },
    {
      "text": "But the bigger problem with the film is that it suffers from the girlboss-ification of female characters that has seeped into media over the few years.",
      "author": "Cate Young"
    },
    {
      "text": "A fabulous director and two awesome stars battle their way through a wonky script.",
      "author": "Julia Swift"
    },
    {
      "text": "While it improves in the second half, Black Widow is too uneven and generic to recommend. Telling a story about freewill and liberation is ironically littered with too many artistic compromises.",
      "author": "Damien Straker"
    },
    {
      "text": "Fun, funny, and frenetic without being overwhelming. [Full Review in Spanish]",
      "author": "Luis Martinez"
    },
    {
      "text": "Johansson is good, better than she's been given the opportunity to be before with this role, but she - like Black Widow is still stunted in many ways by the vision the MCU has for Natasha which makes this feel more elegiac than energetic.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Marvel finally releases the Black Widow origin story, but how many more years before we see another one?",
      "author": "Therese Lacson"
    },
    {
      "text": "Natasha deserved a better memorial.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "Bland spy hooey. Although Pugh is a standout.",
      "author": "Witney Seibold"
    },
    {
      "text": "Black Widow is worth seeing for Florence Pugh, the free-fall action sequence, and anything involving Taskmaster before it's revealed who is under the mask. The film mostly feels like it was done better by the films it was supposedly influenced by.",
      "author": "Chris Sawin"
    },
    {
      "text": "It would've been amazing to receive this movie 4 years ago, now it's just too late. That doesn't mean it's not a worthy closure for a much beloved character. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "The positives do outweigh the negatives but it does frustratingly end up feeling middle-of-the-road in terms of the MCU output.",
      "author": "Matt Hudson"
    },
    {
      "text": "Black Widow is not as tedious and self-serious an entry as some of them. But that is setting the bar low.",
      "author": "David Walsh"
    },
    {
      "text": "What ensues is a film that isn't interested in planting seeds for future Marvel movies -- which is actually a refreshing change of pace.",
      "author": "Mark Daniell"
    },
    {
      "text": "Pugh is the only victory for this vanilla Marvel movie. [...] Fans are left wondering what could have been. And Johansson is left fighting a lawsuit against the world's biggest entertainment behemoth - a mission that seems too much even for Natasha.",
      "author": "Akhil Arora"
    },
    {
      "text": "Black Widow achieves the unthinkable and dethrones Thor: The Dark World as the worst film in the Marvel Cinematic Universe.",
      "author": "Rohan Naahar"
    },
    {
      "text": "The spotlight should firmly be on her, or so you would have thought, but for all its acrobatic female kick-ass baddery poor old Natasha Romanoff has to share that limelight with her highly skilled \"family\" to bring down the patriarchy.",
      "author": "Zehra Phelan"
    },
    {
      "text": "Almost completely lacking in Black Widow is any sense of outrage over the grotesque violations of human rights and human dignity at the root of the whole premise of the film.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "The problem with Black Widow is that the whole ordeal feels like an obligatory afterthought, simply going through the motions with only a perfunctory sense of charm.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Black Widow has everything going on: dysfunctional families, sibling rivalry, a fatuous Russian superhero, a cackling Bond villain and an army of female assassins. What more do you want?",
      "author": "Paul Whitington"
    },
    {
      "text": "Cate Shortland did a great job.",
      "author": "Mark Ellis"
    },
    {
      "text": "A good day at the office for Marvel Studios.",
      "author": "Hilary A White"
    },
    {
      "text": "What's best about Black Widow is the relationship between Johansson and Pugh.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "As it stands, Black Widow is still an enjoyable popcorn flick built around an intriguing character and powered by some solid acting performances...",
      "author": "Sameen Amer"
    },
    {
      "text": "While humour is an important part of the film, it's used to serve the tragic story rather than undercut it.",
      "author": "Damian Levy"
    },
    {
      "text": "...a relatively watchable endeavor that benefits from its agreeable, entertaining performances...",
      "author": "David Nusair"
    },
    {
      "text": "Diehard fans will likely find Easter eggs and winking references to Marvel Comics and MCU content to pore over, but other moviegoers should be able to call this stultifying slog what it is: a terrible film and a waste of a good cast.",
      "author": "Rubén Rosario"
    },
    {
      "text": "Too bad that, unlike DCs Wonder Woman, they did not give Black Widow a good story when away from the boys.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "Black Widow represents the MCU looking back when it should be moving forward. Everything about the movie seems small, even the big action set-pieces",
      "author": "James Berardinelli"
    },
    {
      "text": "An inert show, excessively generic, and that leaves an unpleasant sensation of \"more of the same\" on the palate.",
      "author": "Víctor López G."
    },
    {
      "text": "Marvel was still able to work their magic to make this a movie to get people invested.",
      "author": "Tiffie Starchild"
    },
    {
      "text": "Black Widow still is a refreshing spy thriller that delivers action that doesn't depend on superpowers, and MCU exploring tangential stories less tied to a big arc creates opportunity.",
      "author": "Brad Keefe"
    },
    {
      "text": "Romanoff's positioning against a flagrant misogynist, combined again with the delayed timing of her long-awaited solo film, may feel dangerously close to tokenism.",
      "author": "Luke Parker"
    },
    {
      "text": "This celebration of the nuclear family - a completely phoney nuclear family - is relentless. They're killers but also big softies, who look back nostalgically on those happy days spent undercover in Ohio.",
      "author": "John McDonald"
    },
    {
      "text": "In some ways, this feels like a good version of the 2018 Jennifer Lawrence vehicle Red Sparrow, as it's far more intriguing and far less rapey.",
      "author": "Matt Brunson"
    },
    {
      "text": "\"Black Widow\" spins an awfully good web.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Black Widow is a dumb movie that recycles the same Russophobic Cold War narrative Hollywood has been using for years. But it's just dopey enough and supplies just enough laughs that I couldn't be mad at it.",
      "author": "Eileen Jones"
    },
    {
      "text": "An origin story without totally playing out like one, but also a hard-punching spy thriller with a strong central theme.",
      "author": "Matt Neal"
    },
    {
      "text": "At least it seems the baton is being passed to Pugh, who not only effortlessly holds her own opposite Johansson, but breathes life and emotion to her every role.",
      "author": "Andrea Thompson"
    },
    {
      "text": "More women is its only decent idea. Otherwise, it's business as usual. Otherwise, it's all formulaic bish-bosh, smash-crash action scenes broken up by lame jokes and lame philosophising along the lines of: \"Your pain only makes you stronger.\"",
      "author": "Deborah Ross"
    },
    {
      "text": "Cate Shortland's biggest feat here is taking a larger-than-life world and grounding it in high-stakes thriller fashion. It also gives Johansson the deserving spotlight.",
      "author": "Dan Buffa"
    },
    {
      "text": "Not only is it a thrilling couple of hours at the cinema, it well and truly anoints Pugh as Marvel's next bona fide megastar.",
      "author": "Tom Beasley"
    },
    {
      "text": "The best part of the film is, without a doubt, the chemistry between Johansson and Pugh, who fight and make up with the intensity of real siblings.",
      "author": "Brett White"
    },
    {
      "text": "I wasn't initially excited to see this but I really enjoyed watching this movie. I was surprised by the humor and serious undertones, which flowed well with the action scenes.",
      "author": "Justin Brown"
    },
    {
      "text": "This was a very effective action thriller that provided some closure to this character in an endearing way. Also Florence Pugh killed this!",
      "author": "Brandon Collins"
    },
    {
      "text": "What makes this movie stand out from the majority of action movies is that it is more character-driven than most. It is about family relationships as much as it is about the mission.",
      "author": "Robert Roten"
    },
    {
      "text": "Black Widow unintentionally feels of a simpler time for this expansive universe. It should have been made five years ago.",
      "author": "Tony Black"
    },
    {
      "text": "Shortland does a solid job with the material, but even she isn't able to entirely gloss over how Natasha randomly keeps disappearing in her own movie or how what is supposed to be her story frequently focuses on other characters.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Brings a much-needed complexity to Natasha Romanoff giving her a well-deserved farewell. Pugh stands out as Yelena & provides a promising future for this franchise.",
      "author": "Rosa Parra"
    },
    {
      "text": "In a film that is mostly colourless, David Harbour stands out with an undeniable shade of red.",
      "author": "Mahmoud Mahdy"
    },
    {
      "text": "A nice sendoff.",
      "author": "Bob Grimm"
    },
    {
      "text": "Overall, I enjoyed this movie. It is a good mid-level Marvel movie.",
      "author": "Andre Meadows"
    },
    {
      "text": "I appreciate the way that Cate Shortland adapts herself well to an action film... This is one of the individual [Marvel Cinematic Universe] films that I would keep.",
      "author": "Amy Nicholson"
    },
    {
      "text": "It suggests to me that there was never a real grasp on what this film was supposed to be.",
      "author": "Tim Cogshell"
    },
    {
      "text": "As a standalone action caper full of big booms and beautiful brawls, Black Widow has bite.",
      "author": "Alex Hudson"
    },
    {
      "text": "Although Black Widow's story is not as gripping as it could have been, it deserves a place in the pantheon of female superhero movies, much like it's DC counterpart, Wonder Woman.",
      "author": "Hosea Rupprecht"
    },
    {
      "text": "Full of satisfying Avengers elements but also functions as its own compelling spy movie.",
      "author": "Asia Frey"
    },
    {
      "text": "The film has a perfect balance between the possible seriousness of the subject and the natural humor of its characters. [Full review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "An absolute surprise and an excellent day out at the cinema, beating out any low expectations some may have for such a solo project.",
      "author": "Bill Arceneaux"
    },
    {
      "text": "It's vibrant, spectacular... and it's quite fun. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "Despite Eric Pearson's unexceptional screenplay, she [Shortland] directs with hectic energy, mixing espionage conspiracy, family drama and combat sequences with passion.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Great casting, a sluggish plot for a Marvel movie--a super hero riff on 'Red Sparrow.'",
      "author": "Peter Canavese"
    },
    {
      "text": "A trio of strong female characters, a hint of real human drama and some action with true grit don't do this superhero spectacle any harm at all",
      "author": "Jane Freebury"
    },
    {
      "text": "Director Cate Shortland has a sharp eye for directing action sequences, but the script is flawed.",
      "author": "Valerie Complex"
    },
    {
      "text": "Feels like part two for the movie we should have gotten years ago, but still a fun watch with great chemistry between Johansson and Pugh. Yelena is a prized addition to the MCU",
      "author": "Amanda the Jedi"
    },
    {
      "text": "Packed with hollow action scenes that don't hurt to watch, nor do they offer surprises or delights.",
      "author": "Tim Brayton"
    },
    {
      "text": "Action packed! Great to see an espionage film in the MCU style. Florence Pugh shines in this film. Definitely deserves to be seen on the big screen.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "It's a fun espionage thriller and Florence Pugh is a marvel. But didn't it also feel extremely phoned in?",
      "author": "Laura Bradley"
    },
    {
      "text": "Natasha Romanoff finally got her own movie, but while it served as a proper send-off for the first female Avenger, it also had one eye on what's next.",
      "author": "Daniel Chin"
    },
    {
      "text": "Johansson packs some butt-kicking abilities, but also carries some emotional weight.",
      "author": "Kiko Martinez"
    },
    {
      "text": "There's little wit in the writing or cleverness in the storytelling, which features a dull conflict as well as a vacuous, ill-considered villain.",
      "author": "Nick Johnston"
    },
    {
      "text": "While it may not be the crème de la crème of the MCU, Black Widow is more than worthy of being Marvel's first feature film to hit theaters during a time when people can actually watch it in that form.",
      "author": "Joshua Axelrod"
    },
    {
      "text": "This muddled but well-intentioned action movie feels every bit like a project that has gone through permutations.",
      "author": "John Lui"
    },
    {
      "text": "Pugh, in a humorous and well-written role, steals all her scenes from her fellow performers, though none of them seem to mind.",
      "author": "Robin Holabird"
    },
    {
      "text": "Scarlett and company prove they were worth the wait.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "\"Black Widow,\" dials it back from the galactic scale of mad titans and space gods fighting it out to a more manageable superhuman scale of Super-soldiers, assassins, and secret agents. It easily stands alongside the MCU's other solo outings.",
      "author": "Bill Watters"
    },
    {
      "text": "The film may not be one of Marvel's very best, but it shows that the studio still has the ability to wow audiences on the big screen.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Black Widow may be an enjoyable romp on the surface, but as a triumphant send-off for Natasha Romanoff, it feels hollow: too little, too late.",
      "author": "Aviva Dove-Viebahn"
    },
    {
      "text": "Thankfully, director Cate Shortland infuses rich dynamics in the relationships and a more character-based approach to the action.",
      "author": "Rich Cline"
    },
    {
      "text": "It should come as no surprise that a film churned out by the biggest entertainment conglomerate on earth, is in fact a de facto apologia for American exceptionalism.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The film's direction and performances give it a solid foundation and entertainment value that make it a flawed, by worthy, entry into not just the MCU, but the cinematic universe at large.\"",
      "author": "Germain Lussier"
    },
    {
      "text": "While Black Widow was an entertaining and enjoyable spy thriller, it felt less about Natasha and her story, and more about her sister, Yelena Belova (Florence Pugh).",
      "author": "Shauna Fox"
    },
    {
      "text": "Shortland isn't afraid to set the camera in the middle of a fight and make the audience feel the punches being thrown, rather than keeping them as spectators on the sidelines.",
      "author": "Matthew Passantino"
    },
    {
      "text": "... feels too much like a back door pilot... (otherwise) a solid thriller in the James Bond vein featuring good actors doing a great job with the material given... making it look as good as modern technology can safely allow.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "You don't have to be a Marvel uber-nerd to enjoy the latest \"origin story\" based movie starring Scarlett Johansson. In fact, it's so well done, you kinda don't even need to know anything about Marvel to be entertained on a face-value level.",
      "author": "Lina Lecaro"
    },
    {
      "text": "Smart, sexy and perfectly cast, Black Widow barely has a story to speak of but still manages to be a huge amount of fun.",
      "author": "Richard Trenholm"
    },
    {
      "text": "There is a welcome new emphasis on nuanced character development and a narkier, darker sense of humour that makes Black Widow a very welcome addition to the Marvel fold.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It is one of the worst MCU films I have ever seen. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Black Widow absolutely adheres to the spirit of Stan Lee's original vision for Marvel Comics, wherein relatable characters use incredible abilities to grapple with the human condition and issues of the day.",
      "author": "Ian Simmons"
    },
    {
      "text": "It's as if someone ripped out the movie's uterus.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Martial arts-heavy \"Widow\" leans more towards \"Jason Bourne\" than Ironman palm-zapping, so you get a real-feeling fantasy flick instead of (as in the case of \"F9\") a fake-feeling \"real\" flick, which makes for a much more satisfying summer actioner.",
      "author": "Mark Jackson"
    },
    {
      "text": "There is surprisingly little girl-power rhetoric here, as if the film itself was weary of years of female superheroes discourse.",
      "author": "Gabrielle Marceau"
    },
    {
      "text": "All the action set pieces and explosions happen on cue and [Shortland] handles character development better than most MCU directors.",
      "author": "Peter Howell"
    },
    {
      "text": "While Black Widow doesn't represent the pinnacle of the MCU, it's still a worthy installment.",
      "author": "Tim Brennan"
    },
    {
      "text": "'Black Widow' spins a tale of action, espionage ... and family.",
      "author": "Linda Cook"
    },
    {
      "text": "To ensure that all of our behemoth pop culture franchises become one indistinguishable mass of content, the MCU is now faster and furious-er...",
      "author": "Adam Kempenaar"
    },
    {
      "text": "This Black Widow is supposed to be the opening chapter of a new phase for the MCU. It's a rocky start...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Black Widow exceeds expectations with a fast-moving adventure that finally gives Scarlett Johansson's Avenger the solo chapter she deserves.",
      "author": "Rick Marshall"
    },
    {
      "text": "Johansson and Pugh are dynamite together in the MCU spy thriller that plays like Mission Impossible with exhilarating action sequences",
      "author": "Joe Friar"
    },
    {
      "text": "It gives a great female character a stronger treatment than in previous titles, while at the same time guiding her to the exit.",
      "author": "Alci Rengifo"
    },
    {
      "text": "There's no denying that \"Black Widow\" would have fared better if it was released 4 years ago. But it should still be able to satisfy most Marvel fans. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "One of the best standalone MCU films.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Black Widow is a well intentioned standalone film that does more to highlight Florence Pugh's star quality than serve as a fitting farewell to Marvel's first female Avenger.",
      "author": "Hannah Rachel Abraham"
    },
    {
      "text": "There are still plenty of knives, guns, high-kicks and jumping-off-tall-buildings, but what Black Widow aims to do and, ultimately succeeds at doing, is showing fans the soft, sweet, misunderstood side to the hardened former-Soviet spy.",
      "author": "Candice McMillan"
    },
    {
      "text": "Natasha has long been one of the Avengers' most interesting members -- a human amongst superheroes, a woman amongst a horde of ego-driven men -- and this film gives her, if not her due, then space to breathe.",
      "author": "Anahit Behrooz"
    },
    {
      "text": "With director Cate Shortland at the helm, Black Widow is the best superhero picture since Black Panther. It's not just an acceptably entertaining Marvel product, but an actual good film in its own right",
      "author": "Chris McCoy"
    },
    {
      "text": "Black Widow isn't the best MCU movie. It's not really in the top tier, really. And it doesn't offer as many broader connections as we might like. But as far as popcorn-munching action-packed cinematic adventures go, you could do a lot worse.",
      "author": "Allen Adams"
    },
    {
      "text": "In all the ways that matter to an MCU fan, Black Widow the film meets or exceeds all expectations. It is a killer action flick, and a unique viewing experience... in that I loved it, and the fact that I loved it also makes me livid.",
      "author": "Melanie McFarland"
    },
    {
      "text": "Director Cate Shortland and screenwriter Eric Pearson elevate the character... although they can't avoid the typical hackneyed marvel action it takes to make her feel like part of a great superhero story. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "There simply isn't enough that can be said about Pugh, who is the movie's secret weapon. An absolute delight from beginning to end, she delivers all the best one-liners.",
      "author": "Ani Bundel"
    },
    {
      "text": "An entertaining romp for a character that waited too long to get the spotlight.",
      "author": "Allen Almachar"
    },
    {
      "text": "Black Widow's triumphant return to the big screen parallels the dark storyline with the real-life horrors of human trafficking, domestic violence, and historical female oppression.",
      "author": "Amanda Sink"
    },
    {
      "text": "The main thing to take away from the film is \"fun action sequences\", if you're looking for something deeper or more impactful on the MCU timeline then you won't find it here...",
      "author": "David Hogan"
    },
    {
      "text": "A much more grounded, street-level kind of affair than the high-flying, universe-shaking antics we've grown accustomed to, and Shortland's character-first approach is a good fit for the material.",
      "author": "Travis Johnson"
    },
    {
      "text": "Finally Natasha R. can have her own movie. But it's a few years too late and chock full of superficial characters, eye rolling suspension of disbelief (rest easy F9), and forced humor.",
      "author": "Lee McCoy"
    },
    {
      "text": "Delivers on every front as a comic book movie, MCU entry, and Summer blockbuster.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "While Black Widow featured a brilliant opening credits and strong character moments, the film ultimately felt uneven and a bit late to Phase 4. Florence Pugh was an absolute standout.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Although darker in tone than most other Marvel movies, the action begins right away and it hardly lets up throughout the film and despite some grim themes, there's also a lot of laughs - a very fun superspy romp.",
      "author": "Paul Salfen"
    },
    {
      "text": "The character-focused direction and storytelling grounded in...reality sets this apart from the super-serious, fantastical stories told by Iron Men, Captain Americas, and all the rest.",
      "author": "Michael Ward"
    },
    {
      "text": "\"Black Widow\" has bite.",
      "author": "Russ Simmons"
    },
    {
      "text": "you wait six years for one James Bond movie to arrive and now two are coming along at once",
      "author": "Chris Hunneysett"
    },
    {
      "text": "Although it's been far too long in the making, Scarlett Johansson finally has her time to shine in the solo action-packed spy thriller Black Widow",
      "author": "Nicola Austin"
    },
    {
      "text": "Black Widow has Mission Impossible's escapes and Bourne's hand-to-hand combat wrapped in a Bond's sleek style. The character finally has a backstory and a closure, and a potential for her legacy to continue on.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Action sequences come thick and fast, with an aerial rescue that is both heart-stopping and that obeys (most) of the laws of physics, but this is a film that focuses on sentiment while somehow eschewing the trappings of sentimentality.",
      "author": "Andrea Chase"
    },
    {
      "text": "If anything Black Widow feels like the movie Marvel should have been made years ago. However what saves the day isn't the action, but Natasha's family.",
      "author": "Eli Glasner"
    },
    {
      "text": "An entertaining and action-packed superhero adventure about one of MCU's most beloved characters that carries an important message thanks to the work of its solid cast. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "The familial interactions are the best part of the movie ... and a welcome distraction from the fact that there isn't anything approaching an interesting action sequence.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Natasha Romanoff's solo feature may be five or ten years overdue, but what director Cate Shortland has given us in Black Widow is better late than never.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "The best scene in the movie, obviously designed to peek into Marvel's cinematic future, comes at the very end of the ever-lengthy, final-credits process. Surely diehard Avengers fanatics likely already know everything about it.",
      "author": "John Urbancich"
    },
    {
      "text": "Black Widow doesn't beat you over the head with female empowerment themes, but these concepts are just as integral to the story as its blistering action sequences.",
      "author": "Victor Stiff"
    },
    {
      "text": "Driven by slick, inventive action sequences and standout performances from an all-new supporting cast, Black Widow rises above the various prequel movie pitfalls to deliver an emotionally satisfying, forward-looking Marvel story...",
      "author": "Matthew Jackson"
    },
    {
      "text": "...delivers the goods as a summer blockbuster; as a curtain-call for Johansson, this kicks the requisite ass...",
      "author": "Eddie Harrison"
    },
    {
      "text": "...a tough-minded, intelligent, big hearted action belter, and another crackling entry into the storied world of the ever expanding #Marvel Cinematic Universe.",
      "author": "Erin Free"
    },
    {
      "text": "[Cate] Shortland took the cues from the popular spy-movie genre seen in the likes of James Bond, Mission: Impossible and Bourne franchise and filled her film with some of the best action scenes ever seen in MCU.",
      "author": "Casey Chong"
    },
    {
      "text": "Combining \"The Americans\" with \"Salt,\" the otherwise erratic plot boils down to if Paige Jennings grew up to become Evelyn Salt.",
      "author": "Neil Morris"
    },
    {
      "text": "Pursuit of the nameless something just out of reach is the motor that keeps Black Widow whirring. If nothing else, it puts the self-serious quest for a dumb jeweled glove in perspective.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "This has everything you want from a Marvel movie. It's got the action, it's got the scope, it's got the humor, it's got the irreverence, it has a good villain.",
      "author": "Kevin Carr"
    },
    {
      "text": "\"Black Widow\" never feels more than just a footnote in the story, a detour that holds no weight in the larger M.C.U. narrative, except to set up Yelena for a larger role in the future.",
      "author": "Maya Phillips"
    },
    {
      "text": "Easily one of the better solo MCU Films! Fantastic Action, Heart, Emotion, and Story-arc! Can watch over and over again!",
      "author": "Brandon Avery"
    },
    {
      "text": "If you don't want to have a good time at the movies, don't see Black Widow.",
      "author": "David Poland"
    },
    {
      "text": "The film put flesh on the bones of the character in a way that hadn't been done before. I enjoyed it and I wasn't bored, though I was baffled by the accents.",
      "author": "Mark Kermode"
    },
    {
      "text": "Loud, clumsy and cinematically desolate.",
      "author": "Shawn Edwards"
    },
    {
      "text": "It's a strange movie: front-loaded with its best action, its zippiest writing, its canniest pleasures, then derailed by exposition that only serves to let the air out of the room for being so obvious rather than deepening what's there.",
      "author": "K. Austin Collins"
    },
    {
      "text": "As Yelena, Florence Pugh will be your next fan-favorite Marvel character.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The film ceases to be about Natasha wrestling with her heroism; by pitting her against a raging misogynist, Black Widow tries to simplistically cast Natasha as a pop-feminist icon.",
      "author": "Shirley Li"
    },
    {
      "text": "A solid film all around, Black Widow should appeal to anyone looking to spend a few hours enjoying some empowering, female-driven action, with a darker emotional slant.",
      "author": "Louisa Moore"
    },
    {
      "text": "Black Widow gives Marvel's superspy the callback-filled swan song that she and the loyal audience deserve.",
      "author": "Richard Whittaker"
    },
    {
      "text": "Coming out more than a year after it was supposed to, it feels like an awkward reminder of what Marvel failed to do early on in its run, but occasionally, mostly whenever Pugh is in control, it's a thrilling preview of what's to come.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "A solid nod to the director Cate Shortland (Somersault), who establishes a mood from the first couple of frames.",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "While this sounds like your standard Marvel solo outing (the hero must reckon with the past to defeat a villain they had a hand in creating), Black Widow benefits from the family dynamics.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "It suggests a bright future for Pugh's Yelena, but, ironically, does the bare minimum in finally giving Natasha Romanoff her due.",
      "author": "Abby Olcese"
    },
    {
      "text": "...the issues with Black Widow go beyond the past and its ill-timed release. Marvel waited too long to tell Natasha's story, but it's also proved unfit to do so.",
      "author": "Miles Surrey"
    },
    {
      "text": "It suffers from a bad case of \"Tell don't show\" and what it shows is often shaky and hard to see. When it \"tells\" though, it is well written and nicely acted. Just enough to say the film is okay.",
      "author": "Doug Walker"
    },
    {
      "text": "We waited two years for this. And it's so worth it. Yeah, it's good.",
      "author": "tt stern-enzi"
    },
    {
      "text": "It all adds up to a film that feels like a fittingly emotional final hurrah for a much-loved heroine.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Johansson and co-star Florence Pugh are terrific, but the lightweight story relies on implausible plot turns and cheap soap opera antics.",
      "author": "Richard Roeper"
    },
    {
      "text": "Finally the hero of her own story, Scarlett Johansson knits together a decade of Natasha Romanoff's inconsistent characterization in a satisfying action thriller.",
      "author": "Norman Wilner"
    },
    {
      "text": "If you want people to think you're good at something, don't have Florence Pugh do the same thing right next to you.",
      "author": "Ryan Syrek"
    },
    {
      "text": "The approach largely works, in more small-boned fashion, thanks in part to the crispness of the action, whose fight sequences have as much in common with the kinetic aspect of the Bourne saga as superhero-style pyrotechnics.",
      "author": "Brian Lowry"
    },
    {
      "text": "I wish the story felt like it had more traction, more sense of purpose, rather than being a side-story shoehorned in between more powerful tales.",
      "author": "Chris Knight"
    },
    {
      "text": "Natasha Romanoff is given the backstory and send-off she deserves, while introducing fans to terrific new characters that can now play in the sandbox of the MCU.",
      "author": "Kyle Wilson"
    },
    {
      "text": "After the head-trip that marked the early episodes of \"WandaVision\" and the longing, somewhat clumsy angst that permeated \"The Falcon and the Winter Soldier,\" it is refreshing to experience an entire character arc in just over two hours.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Impressively acted and directed, Black Widow delivers action, humour and emotion in the mighty Marvel manner.",
      "author": "Matthew Turner"
    },
    {
      "text": "Though the writing leaves something to be desired, between Pugh's charisma, the sense of closure it gives the character, and the compelling (if not properly explored) story at its core makes it a fitting farewell for a beloved hero.",
      "author": "Lauren Coates"
    },
    {
      "text": "Directed by Cate Shortland from a script by Eric Pearson, Black Widow is everything that Marvel movies usually are: well-made, absorbing, overlong, uneven.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "Black Widow isn't going to go down in the history books as top-tier Marvel Cinematic Universe content, but it's not too bad at all.",
      "author": "Scott Campbell"
    },
    {
      "text": "A bigger reason for the film coming up so short in quality is that the title character ends up being the least interesting of all the players.",
      "author": "Rick Bentley"
    },
    {
      "text": "Though her selflessness goes against what life has continually taught her - that relationships are a weakness that will always let you down - it's also the skeleton key to her legacy. What a thrill to finally be able to understand it.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "Black Widow is sharp-witted female butt-kicking excellence in its strongest form and the superhero blockbuster at its most restrained.",
      "author": "Alicia Gilstorf"
    },
    {
      "text": "While Black Widow makes for a great stand-alone spy thriller that packs in plenty of entertainment value, fans who have been waiting for a film that explores the character in great depth will simply have to keep waiting.",
      "author": "Janice Rodrigues"
    },
    {
      "text": "Director Cate Shortland adopts a strategy not unlike that of Captain America: The Winter Soldier... mostly eschewing the massive stakes of other Marvel Cinematic Universe entries, at least until the gratuitous goofiness of the third act.",
      "author": "Brent Hankins"
    },
    {
      "text": "A great feminist James Bond film. Johansson, Pugh, Weisz, Harbour and Winstone are great. Aussie director Cate Shortland is a find.",
      "author": "James Verniere"
    },
    {
      "text": "Black Widow serves up an uneven but fun ride with the action keeping the pace mostly breathless. Florence Pugh, however, steals the show.",
      "author": "Beth Accomando"
    },
    {
      "text": "[Black Widow is] not the worst Marvel Cinematic Universe movie, but it is easily one of the blandest.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Black Widow feels like a different sort of Marvel movie. But still, with explosions.",
      "author": "Stephen Garrett"
    },
    {
      "text": "There's little denying where the film excels -- in concept and message -- as we're given a fully realized backstory for Natasha Romanoff that's smart and compelling",
      "author": "George M. Thomas"
    },
    {
      "text": "Packed with lively set pieces, amusing performances and the occasional heavier theme, it's an action thriller that also manages to be an ode to sisterhood and the chaos of atypical families.",
      "author": "Luke Goodsell"
    },
    {
      "text": "In time, I hope we get more stand-alone entries in the MCU focused on its other great female characters, and maybe without so much support from others. Until then, Black Widow will do nicely in filling that void.",
      "author": "Damond Fudge"
    },
    {
      "text": "Although this may be the swan song for Natasha Romonoff, if Black Widow is any indication of what Marvel has up its sleeve for Phase 4 of the cinematic universe, we are in for a real treat.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "Dishearteningly less concerned with giving Natasha Romanoff her own story than with setting up her MCU replacement. Superfluous, backward-looking, its bit of feminism belabored. She deserved better.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Black Widow was worth the wait and actually does this character and her shadowy world justice, while taking care to finally give her the narrative arc she desperately deserved.",
      "author": "Dan Tabor"
    },
    {
      "text": "Even when bloated Marvel action robs the film of intimacy, Johansson digs deep into how her Russian assassin once felt outside the Avengers bubble. And Pugh deserves Oscar love as her pretend sister in this surprising salute to female empowerment.",
      "author": "Peter Travers"
    },
    {
      "text": "Pugh is on hand to take up the Avengers torch from Johansson and inaugurate a new phase of the franchise. With her anti-glam looks and no-nonsense presence, she's an excellent choice for this assignment.",
      "author": "Kurt Loder"
    },
    {
      "text": "Exciting and well-crafted action, a nice tribute to the character audiences have loved over the past decade.",
      "author": "Kevin Brackett"
    },
    {
      "text": "Black Widow ensnares, bites, but doesn't devour its audience.",
      "author": "Wendy Shreve"
    },
    {
      "text": "Black Widow wants to give MCU fans the reward of understanding a reference without asking them to do the work. This is diluted fandom.",
      "author": "Alan Zilberman"
    },
    {
      "text": "We get the lowdown on Budapest, albeit without a hearty bowl of goulash. Anyway, this cloak-and-dagger story somewhat satisfies.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Gives its namesake a thrilling big-screen outing - in no small part because it needn't waste time setting up an obvious sequel.",
      "author": "Sarah Ward"
    },
    {
      "text": "This plot is preserved in amber, so you know it's not going to affect the grand scheme of things. [But] there's enough here to justify it as a movie over a TV series.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Black Widow earns its title by deepening and celebrating the titular heroine with a story that feels genuinely personal.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "As talented as Scarlett Johansson and Florence Pugh are, nothing they do or say feels honest or character-driven.",
      "author": "Michael Calleri"
    },
    {
      "text": "If this were truly Scarlett Johansson's last outing as Black Widow, she'd have ended on a high note. A fun mix of spy thriller + superhero genre that's essentially about family, featuring a scene stealing performance from Florence Pugh.",
      "author": "Ruth Maramis"
    },
    {
      "text": "It's Scarlett Johansson's movie, but Florence Pugh steals the show. Adequate but the film never takes cinematic risks.",
      "author": "Dustin Chase"
    },
    {
      "text": "The property that was supposed to be the first movie installment of \"Phase Four\" by now just feels phased out.",
      "author": "Ty Burr"
    },
    {
      "text": "And yes, the climax, like all Marvel movie climaxes, is splattered with far too much physics-defying CGI work, but for once, and thanks to the meticulous character work from all concerned, you will really care.",
      "author": "Kevin Maher"
    },
    {
      "text": "Like most of her peers' first solo outings, this is a good-not-great genre stand: Think of the wartime adventure of \"Captain America: The First Avenger\" and the interdimensional space myth of \"Thor.\"",
      "author": "Eric Webb"
    },
    {
      "text": "It's worth seeing on a big screen, not just once but twice.",
      "author": "Randy Myers"
    },
    {
      "text": "Black Widow, much like the family at its core, is a messy affair. Although the action sequences are entertaining, the awkward dramatic beats hinder the overall flow of the film.",
      "author": "Courtney Small"
    },
    {
      "text": "The movie is the best blockbuster so far this summer, and it's a proudly female one. That's not nothing.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Harbour, so good in the recent Steven Soderbergh noir No Sudden Move, brings the comic relief in spades.",
      "author": "Tom Meek"
    },
    {
      "text": "Black Widow isn't much of an action movie -- it exists mostly to fill the narrative gap between Captain America: Civil War and Avengers: Infinity War.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "It's all very big and impressive, but considering that Marvel delivers so consistently, action-wise, I found myself much more appreciative of Aussie director Cate Shortland's emphasis on character, which helps this resonate.",
      "author": "Dominic Corry"
    },
    {
      "text": "A roller coaster ride of surprising reveals, feminist philosophy and the wam-bam-pow action that has become beloved in our current entertainment universe. Black Magic Widow!",
      "author": "Patrick McDonald"
    },
    {
      "text": "These are superb and perfectly complementary performances in a story that is, in its essence, about sisterly love.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Without needing to be the \"first\" of anything this time around, Black Widow became something else: the first superhero movie I've loved in years -- no \"female\" qualifier needed.",
      "author": "Jeva Lange"
    },
    {
      "text": "Johansson, Pugh, and Weisz create the perfect trio of complicated heroines and David Harbour offers great comic relief. Can we put the \"women can't direct action\" thing to rest?",
      "author": "Leslie Combemale"
    },
    {
      "text": "Johansson does wonders revealing her hardened character's human side, peeling away at Romanoff's backstory and motivations.",
      "author": "Dana Barbuto"
    },
    {
      "text": "Before now, the story of Black Widow may not have been essential to the larger story, but after Black Widow, I cannot imagine the Infinity Saga without it.",
      "author": "Alan Cerny"
    },
    {
      "text": "The fight scenes do eventually take a backseat to the unlikely family drama that slowly unfolds among the four stubborn, vicious, and sometimes hilarious family members.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A throwback to the beginnings of the MCU when Marvel movies were a little simpler, a little more stripped down, and focused a wee bit more on character interactions than shoving 900 units of plot in our faces.",
      "author": "Sarah Marrs"
    },
    {
      "text": "[I]t's ultimately disappointing how much of Black Widow is, in its comparatively limited way, just more of the same.",
      "author": "Mark Dujsik"
    },
    {
      "text": "A sidebar to the overall Marvel project rather than an essential part of it, a mixture of spy story and superhero movie that, despite the charisma and chemistry of both Johansson and Pugh, comes across as less than the sum of its parts.",
      "author": "Frank Swietek"
    },
    {
      "text": "Like pretty much every Marvel film, Black Widow is a polished and easy-to-watch blockbuster, but that's all it is, and it's tough to remember anything even remotely notable after the credits roll.",
      "author": "Steve Katz"
    },
    {
      "text": "Half good, half fine.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Surprisingly fun until it remembers that it's supposed to be a Marvel tie-in.",
      "author": "Vincent Mancini"
    },
    {
      "text": "The genius of Black Widow is that while it satisfies Marvel aficionados, it also accommodates, and even thrills, those who are not experts on the franchise.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "\"Black Widow\" -- like its namesake arachnid -- packs a potent punch that you might not see coming. And that's a good thing in this case.",
      "author": "Jim Judy"
    },
    {
      "text": "Take out all the mindless bickering, pointless fight scenes, cutesy-poo Avengers references and tie-ins to future Disney+ TV series, and you're left with maybe 75 to 80 minutes of actual movie.",
      "author": "Daniel Barnes"
    },
    {
      "text": "Black Widow is not a \"girl power\" story, but about fighting for those unable to fight for themselves or see their own value in the world.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "Black Widow is an unstable mix of twisted family drama and big superhero action, with the latter closer in tone to The Falcon and the Winter Soldier, or even Mission: Impossible.",
      "author": "Travis Hopson"
    },
    {
      "text": "Though the blammo action stuff is a little stale, Scarlett Johansson finally gets a chance to shoulder her way past the \"big Avenger\" boys and show subtler shadings for her superspy.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Despite the wild CGI action and Jason Bourne style one-on-one combat, Black Widow feels more grounded than most other Marvel movies.",
      "author": "Richard Crouse"
    },
    {
      "text": "For the most part Black Widow is a satisfying blend of comedy, drama and of course action.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "As a farewell to Natasha, Black Widow is a workmanlike effort; as an introduction to the new Black Widow, it's a thrilling success.",
      "author": "Anthony Morris"
    },
    {
      "text": "The highlight is Pugh who steals the film from Johansson, supplying a sense of barbed humor as well as humanity to her character that's welcomed. A star is born amidst all this chaos.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Black Widow will be a refreshing change of pace for audiences tired of the relentless CGI and constant continuity wrangling of recent MCU outings.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "This is Florence Pugh's film, and we're very lucky she's in it. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "If the film delivered better action thrills or emotional oomph I wouldn't care to nit-pick about such things, but the mind starts to wander when it's underwhelmed.",
      "author": "Daniel Rutledge"
    },
    {
      "text": "Black Widow is a dramatic spy thriller that does its character justice. The downside is that this justice was far too late.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Black Widow may not be the grand send-off to Natasha Romanoff, for it borrows far too many elements from that other MCU spy flick, but it's still a fun summer blockbuster.",
      "author": "Rendy Jones"
    },
    {
      "text": "The pieces are great, but the execution leaves plenty to be desired.",
      "author": "Dan Scully"
    },
    {
      "text": "The film isn't likely to go down in Marvel history as much more than a footnote, nor does it tell us much about the studio's envisaged next phase.",
      "author": "Jake Wilson"
    },
    {
      "text": "It's no small thing to bring together actors who have carried two of the most audacious films of the past decade (Johansson in Under the Skin, Pugh in Midsommar) but they deserve better than this material.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "It's so easygoing and effortless that it's easy to forget how hard it really is to craft something this entertaining.",
      "author": "Micheal Compton"
    },
    {
      "text": "Just as the comedy scenes aren't funny, the action scenes aren't thrilling. Natasha never seems as if she's in any danger. She never seems like she's having fun, either.",
      "author": "Kyle Smith"
    },
    {
      "text": "If this does turn out to be Johansson's farewell to the role that helped make her one of the most popular actresses in the world, it is a film that does ultimately honor both her and the character.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Black Widow is still a taut and entertaining action thriller. And the compelling nature of the mystery around the character herself, keeps you engaged throughout",
      "author": "Shah Shahid"
    },
    {
      "text": "The initial fight between the two sisters is more than worth the price of admission on its own.",
      "author": "Sean Collier"
    },
    {
      "text": "The world's biggest franchise should makes these kinds of side trips more often.",
      "author": "Adam Graham"
    },
    {
      "text": "There is genuine comic firepower here, and a script that keeps on serving up great moments for the cast to chew on.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Black Widow is its own personal adventure, and it stands on its own, [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Despite its retroactive placement in the timeline, Black Widow offers enough thrills, new characters and a spotlight on Natasha to rank near the top of standalone MCU films.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Director Cate Shortland's film was worth the wait.",
      "author": "Mike Scott"
    },
    {
      "text": "It's got a unique vibe that sets it apart from the other MCU films and makes it feel, strangely, more intimate.",
      "author": "Rebecca Murray"
    },
    {
      "text": "While it took far too long for Black Widow to get her own solo film, she puts her moment to good use, blowing up the patriarchy in epic style.",
      "author": "Tara McNamara"
    },
    {
      "text": "Black Widow is a solid enough movie on its own, but it would've worked even better if it had come when the character still had more to offer.",
      "author": "Alex Bentley"
    },
    {
      "text": "Pugh and Harbour are a delight in the midst of a film that is nothing more than ordinary in yet another typical super hero film.",
      "author": "Pamela Powell"
    },
    {
      "text": "Before it hits those final act problems, Black Widow is an impressive balance between family drama and spy thriller - and one of the emotionally stronger entries in the Marvel pantheon.",
      "author": "Wenlei Ma"
    },
    {
      "text": "Is it really conceivable that nobody at Marvel has dared knock out a memo raising the issue of how almost all of their big action sequences look so much alike? Even the fight scenes here look as though they've been copied from previous Marvel films.",
      "author": "Jim Schembri"
    },
    {
      "text": "Black Widow offers a far deeper portrait of family than the Fast and Furious saga does with all its empty platitudes.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "It's fun, highly amusing -- I'm talking laugh out loud -- and wildly entertaining.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "BLACK WIDOW is a very good distraction from the everyday woes people might have.",
      "author": "David Kaplan"
    },
    {
      "text": "Black Widow can best be described as The Americans meets 007 in a highly entertaining adventure. Florence Pugh steals the show with her magnetic screen presence.",
      "author": "Julian Roman"
    },
    {
      "text": "\"Black Widow\" has the look and feel of a globe-trotting spy thriller, and it isn't afraid to puncture some of the \"Avengers\" mythology, including grappling with what it means to be a \"hero.\"",
      "author": "Katie Walsh"
    },
    {
      "text": "A strong-enough final ride for Black Widow and Johansson, with a well-earned emotional core, and a stellar supporting performance from Florence Pugh. And comfortable pants.",
      "author": "Brent McKnight"
    },
    {
      "text": "Sadly quickly degenerates into a maddening mess of unnecessary scenes, mildly well-choreographed action, and a comic book megalomania that... is actually completely out of place here. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Though \"Black Widow\" may not be as action packed as the usual MCU movies, the fight scenes we're given are clean, quick, and well-choreographed. The editing by Leigh Folsom Boyd is flawless and makes the over 2 hour runtime fly by.",
      "author": "Susan Kamyab"
    },
    {
      "text": "Marvel's latest origin story owes as much to Bourne and Bond as it does to the MCU, and ultimately reveals Natasha Romanov's soulful humanity.",
      "author": "Karen Gordon"
    },
    {
      "text": "There's a lot to enjoy about Marvel's latest... And yet, while Black Widow is a valiant attempt to do right by the ex-spy and Avenger, it's ultimately too little, too late.",
      "author": "Laura Potier"
    },
    {
      "text": "An origin story for the character - aka Natasha Romanoff, a spy-turned-Avenger - it is slightly above average for a Marvel movie. That also makes it above average in terms of Hollywood blockbusters.",
      "author": "Mark Meszoros"
    },
    {
      "text": "Shortland has made a credible action film that also functions as a twisted family portrait as well as a story of a woman coming to terms with her past.",
      "author": "Cary Darling"
    },
    {
      "text": "In short, Black Widow is a star vehicle for all involved, even if that means its ostensible main star therefore burns less brightly as a result",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Rachel Weisz has a little farm with several adorable Kunekune Pigs - Film of The Year thus far.",
      "author": "Bob Chipman"
    },
    {
      "text": "A type-of Bourne Identity actioner that eventually escalates to typical explosive MCU fare, peppering welcome humour, family drama, and the topical notion of women's autonomy over their own bodies and minds throughout.",
      "author": "Peter Gray"
    },
    {
      "text": "Compared to the clunking, overblown efforts in some previous Avengers films, Black Widow has shape, coherence and emotional heft, thanks to Australian director Cate Shortland.",
      "author": "Kate Muir"
    },
    {
      "text": "Especially as relates to its genre-specific weaknesses, Black Widow is all too familiar.",
      "author": "Michael Burgin"
    },
    {
      "text": "The action scenes those scenes are fine, especially the prison break, but they will likely leave you waiting a little impatiently for the next moments with the family.",
      "author": "Nell Minow"
    },
    {
      "text": "Black Widow is worth a view. However, it would've been better had the movie come out after Civil War or even after Avengers: Infinity War.",
      "author": "DarkSkyLady"
    },
    {
      "text": "Black Widow is not a bad film, nevertheless it feels like a wasted opportunity.",
      "author": "Yasmin Omar"
    },
    {
      "text": "A lethargic, clunky and overlong bore that's low on thrills, suspense and excitement.",
      "author": "Avi Offer"
    },
    {
      "text": "Surprising exactly no one, Florence Pugh steals the show.",
      "author": "Rob Hunter"
    },
    {
      "text": "Florence Pugh delivers a terrific performance ... in a fun if inconsequential entry into Hollywood's most successful franchise.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "The film's truer purpose seems to serve as a set-up for the next Black Widow character - Pugh's Yelena Bolava - who'll be taking over the franchise, but that could've been done in many ways other than this approach.",
      "author": "Jeff York"
    },
    {
      "text": "A not your average Marvel comic book action movie.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Black Widow doesn't even feel like any kind of final sendoff. Or a way to complete her story arc.",
      "author": "Mike Ryan"
    },
    {
      "text": "Fans of Natasha getting her own movie will be satisfied with Black Widow. The film does more than enough on exploring the character and domestic drama while serving up the typical car chases and explosive third acts that we've come to expect from Marvel.",
      "author": "Kevin L. Lee"
    },
    {
      "text": "It's not easy to take a character with no future and give them a past that makes them even more interesting.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "Black Widow isn't exactly the kind of movie that redefines a genre or challenges you with unexpected depth...but the movie uses its Avengers heritage to good effect and, damn, if it doesn't include some agreeable humor...",
      "author": "Robert Denerstein"
    },
    {
      "text": "Black Widow finds clever ways to play with Natasha's long MCU history, while also reckoning with the past we've only heard about. Anyone who has followed the character's film journey closely will be rewarded.",
      "author": "Meagan Damore"
    },
    {
      "text": "The first Marvel film in years that feels like a pure action-adventure movie",
      "author": "Stephen Silver"
    },
    {
      "text": "Black Widow's name may be on the title, but the true heroes of the 24th entry in the MCU mega-franchise are her supporting characters -- a pack of gonzo Russkie faux relatives.",
      "author": "Megan Basham"
    },
    {
      "text": "Black Widow mixes great action with a tedious script, predictable plot and overly long runtime. The results are mixed.",
      "author": "Erik Kain"
    },
    {
      "text": "Love Florence Pugh. Love David Harbour. But Captain America: The Winter Soldier is a better Black Widow movie than the actual Black Widow movie.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Those of you signing up for the Marvel superhero experience should not leave disappointed as this is action-packed with plentiful twists and turns and doesn't skimp on the super soldier fight sequences.",
      "author": "Kate Rodger"
    },
    {
      "text": "It's the Marvel movie we've been waiting for, and though it's an excellent film, I just couldn't shake the fact that I was watching a movie of a hero that has died. - @VinceSchilling",
      "author": "Vincent Schilling"
    },
    {
      "text": "It's the cynicism that's depressing. After all, \"Black Widow\" is not an attempt at a good movie that failed. That would've been respectable. Rather, it's an attempt to make a piece of garbage commerce that succeeded completely.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Functions less as a showcase for the title character and more as a sneaky introduction for Pugh.",
      "author": "Matt Singer"
    },
    {
      "text": "\"Black Widow\" aims to put a superhero stamp on the female spy thriller niche and cannot help but look like a pretender.",
      "author": "Don Shanahan"
    },
    {
      "text": "Black Widow combines kick-butt action with the best family in the MCU to make for a fun ride!",
      "author": "Rachel Wagner"
    },
    {
      "text": "In trying to be a statement, rather than a film, it's managed to be very little of either.",
      "author": "Allyson Johnson"
    },
    {
      "text": "What separates the excellent character-driven \"Black Widow\" from the rest of the Marvel movies is the dynamic of the false undercover family experience and its lasting effects on the siblings' younger emotional development.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "MCU newbies Florence Pugh and David Harbour steal a surprisingly adventurous spin-off.",
      "author": "Alex Flood"
    },
    {
      "text": "If by \"good\" you mean, \"I sat in the dark for two hours and barely thought about my upcoming doctor's appointment or my car payments,\" then sure, it's good.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "At the risk of being stoned as a heretic, I'd best describe this action-packed 'origin' saga as too many stunts in search of a cohesive story.",
      "author": "Susan Granger"
    },
    {
      "text": "...suffers from MCU bloat, yet a strong cast and emphasis on character ultimately overcomes much of that.",
      "author": "Josh Larsen"
    },
    {
      "text": "Black Widow sees Scarlett Johansson's Natasha Romanoff get her much-needed swan song in this thrilling but imperfect Marvel outing that also boasts a wonderful arrival to the MCU with Florence Pugh.",
      "author": "Lewis Knight"
    },
    {
      "text": "High on action, great insight into Natasha's family backstory and great message on female empowerment. Florence Pugh steals the show while bieng the perfect compliment to Scarlett Johansson's Natasha. Loved it!!!!",
      "author": "Carla Renata"
    },
    {
      "text": "This film could have been great. It could have been so much better than it is, but they just kind of made a contractual movie that feels like a placeholder for other things in the future.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "It begins as an intriguing prequel of of Natasha Romanoff's (Scarlett Johansson) backstory as the Russian spy who became one of the Avengers. But this film turns messy in the last act.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "If Black Widow is truly the final goodbye for Johansson as Natasha (well, you never know), this is a decent exit.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "Cate Shortland's directorial perspective and prowess are evident in every frame of Black Widow... a beautifully crafted and technically impressive flick, she's planted seeds for serious thought and discourse that make Black Widow meaningful and memorable.",
      "author": "Jennifer Merin"
    },
    {
      "text": "More a Marvel deep cut than an obvious play for the masses, Black Widow delivers action and acting that still rock.",
      "author": "André Hereford"
    },
    {
      "text": "This tight but not particularly integral story seems rather perfect for the small screen, even as it just survives the big screen treatment.",
      "author": "Matt Lynch"
    },
    {
      "text": "A weak script and low ambition make the movie crumble under the weight.",
      "author": "Phil Villarreal"
    },
    {
      "text": "There may not be much in the way of superpowers in Black Widow, but there's plenty of whoop-ass, mano-a-mano (actually, there's more womano-a-womano) combat to keep you entertained over the film's 2 1/4-hour length.",
      "author": "Elias Savada"
    },
    {
      "text": "Black Widow is a thoroughly entertaining flick that is likely to please audiences with its action, wittiness, and great characters.",
      "author": "Britany Murphy"
    },
    {
      "text": "Black Widow is the manifestation of the \"sunk cost fallacy\"--there oughta be support groups. Same as it ever was. Same as it ever was.",
      "author": "Walter Chaw"
    },
    {
      "text": "Technically, Black Widow is a retreat into Marvel's past. By delivering a story that satisfies on its own terms, however, it makes a compelling case for moving ahead with this franchise into the future.",
      "author": "Angie Han"
    },
    {
      "text": "Its bottom-line spectacle seldom strays from the Marvel path, but still manages to explore some invigorating new ground.",
      "author": "John Wenzel"
    },
    {
      "text": "Florence Pugh shines in this MCU spy thriller with a weak story and disappointing villains. An entry that's definitely hurt by it's late arrival. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "\"Black Widow\" is essentially Marvel's version of a \"Bourne\" movie, complete with car chases, exotic locales and fistfights in tiny European apartments.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Johansson brings a wistfulness to her character, looking backward and inward at the mistakes she has made and the consequences she now faces because of them.",
      "author": "Bob Bloom"
    },
    {
      "text": "Watching Black Widow play out, you feel a bit like a schoolteacher watching an underperforming student: Marvel, you're so much better than this.",
      "author": "Larry Carroll"
    },
    {
      "text": "It's absorbing in its own right. Less occupied with driving a universe of movies forward, the almost-standalone film instead digs into slightly darker, deeper realms of the typically bright and shiny Marvel world.",
      "author": "Jake Coyle"
    },
    {
      "text": "It's absolutely mid-tier Marvel, alternatively harmed and aided by its late position in the slate. But as a reintroduction to the cinematic universe after a year off due to the COVID-19 pandemic, it's definitely worth a look.",
      "author": "Clint Worthington"
    },
    {
      "text": "Natasha remains the paper-thin sketch of character she always was, relegated to a posthumous backdoor pilot of a sendoff, leaving us hoping they can get it right the next time.",
      "author": "Hannah Lodge"
    },
    {
      "text": "[Black Widow] seems less like an essential text and more like a standalone adventure plucked straight from the MCU's Phase Two.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "The fight choreography is impressively acrobatic, if mildly numbing, and the brisk globe-trotting (Norway, Morocco, a snowy Russian penal colony) can't be faulted.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Thrills are intermittently present when the story isn't in explanation mode, giving Johansson something to work with as her co-stars get a little hammy to make their presence known.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Black Widow really feels like the movie not only Natasha deserved, but also Scarlett. It opens up her character greatly while daring to delve into the darker side of her origins.",
      "author": "Callum Crumlish"
    },
    {
      "text": "\"Black Widow\" manages to deliver the goods, mainly by sticking to Marvel convention (explosive action, amusing quips).",
      "author": "Rafer Guzman"
    },
    {
      "text": "You remember why this recipe has worked for so long. But after a break, its shortcomings are that bit more conspicuous.",
      "author": "Robbie Collin"
    },
    {
      "text": "Black Widow remains a tried and true hero, the first female superhero that wins with skills and sheer will. She's a ferocious and fierce Avenger. This Black Widow packs a wicked and awesome punch.",
      "author": "Leo Brady"
    },
    {
      "text": "If this is the only Black Widow movie, it's fine, but I have to wonder what could've been.",
      "author": "Max Covill"
    },
    {
      "text": "Out Bonding Bond, this solo superhero flick is no Wonder Woman.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Scarlett Johansson can't muscle past generic storytelling in disappointing spinoff.",
      "author": "Christian Toto"
    },
    {
      "text": "Black Widow brings Natasha's life full circle, filling in the gaps, and giving us more of a look at the real Natasha. Given the storyline and themes, what I like most about Black Widow is that it doesn't take itself too seriously.",
      "author": "Catalina Combs"
    },
    {
      "text": "Director Cate Shortland creates a solid, albeit sleight, rendition for Natasha Romanoff's swan song.",
      "author": "Matt Conway"
    },
    {
      "text": "Black Widow ticks all the boxes as an enjoyable standalone MCU outing ... but it misses the target as a fitting final farewell to the title character.",
      "author": "Mark Cassidy"
    },
    {
      "text": "Ultimately the strength of the movie is not in the plot or the script but the actors.",
      "author": "Allison Rose"
    },
    {
      "text": "If this really is the last time Scarlett Johansson suits up in one of her most memorable roles, she's sending the Marvel character out with a bang.",
      "author": "Terry Terrones"
    },
    {
      "text": "The action sequences are dynamic, exciting, and brilliantly choreographed, making for one of the best and most satisfying female-lead superhero movies ever.",
      "author": "Joe Passmore"
    },
    {
      "text": "Black Widow delivers in thrills, wit and action.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "For those who are fans of standard Marvel fare, there's plenty to be pleased by: extended action scenes and classic Marvel tie-ins.",
      "author": "Gabriella Geisinger"
    },
    {
      "text": "If you're not familiar with the Marvel Cinematic Universe (MCU), then Black Widow might be too confusing for long stretches of the movie. For everyone else, Black Widow offers a satisfactory but not particularly outstanding chapter to the MCU.",
      "author": "Carla Hay"
    },
    {
      "text": "Black Widow is trying to be a proper send-off to the first woman of the Avengers, but ultimately it falls flat due to how it was released and how it feels less like a send-off for Natasha and more like a setup for Yelena.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Full of non-stop action and some self-depreciating humor, \"Black Widow\" is an origin story that attempts to inform viewers where Natasha (Johansson) came from and why she defected to the Avengers.",
      "author": "Michael A. Smith"
    },
    {
      "text": "Black Widow may not be the swan song for Natasha Romanoff that audiences expected, but the film is a dazzling debut for Florence Pugh's Yelena, who will undoubtedly prove to be a worthy successor to the title in future entries.",
      "author": "Joe Lipsett"
    },
    {
      "text": "This is big screen popular entertainment par excellence.",
      "author": "Grant Watson"
    },
    {
      "text": "It makes sense that a no-nonsense killing machine like Black Widow should have a no-nonsense installment, but it's nice to see it actually happened.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Black Widow succeeds for the most part, but its placement in the timeline has this film feeling a bit off.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "After a strong first half, the movie gets derailed by its real villain: a poor, tonally off script. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Whether you feel this solo outing is too little too late or right on time, there's no denying that this is an adventure worthy of the heroine who gave her all to bring us back. Whatever it took.",
      "author": "Douglas Davidson"
    },
    {
      "text": "A fitting and often fabulous sign-off for one of the Avengers' most memorable heroes.",
      "author": "James Mottram"
    },
    {
      "text": "A stellar cast just barely saves this movie - too heavy on nostalgia for its predecessors and too light on cohesive plot and originality - from itself",
      "author": "J. Don Birnam"
    },
    {
      "text": "Black Widow doesn't find the right way to tell one of [the MCU's] most serious stories to date",
      "author": "Emily Wheeler"
    },
    {
      "text": "If you like Black Widow, and you like Black Widow kicking ass, the movie delivers. But most fans will not watch it anywhere near as often as Endgame.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "If this is Johansson's final bow as Black Widow - and it would take some serious retcon work to avoid that - she gets to go out on top, showing Natasha's battered, resilient heart as she finally earns some redemption for her past sins.",
      "author": "Sean P. Means"
    },
    {
      "text": "As an action movie it's solid, with lots of fun set pieces to gawk at and a particularly menacing villain in Taskmaster... It also works surprisingly well as a standalone story.",
      "author": "Andrew Webster"
    },
    {
      "text": "I think I can say for the first time in years about a Marvel property that the next chapter can't come soon enough.",
      "author": "Dana Stevens"
    },
    {
      "text": "After an entire year of no Marvel movies on the big screen, it's difficult not to recommend this as worthy escapist popcorn fun. But that's it",
      "author": "Robert Kojder"
    },
    {
      "text": "One of the regrets that the MCU may have is that 'Black Widow' didn't come out sooner in the timeline. Early MCU pitfalls aside, it provides action, character development for Natasha, and spy thriller feel.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Black Widow does not achieve greatness like so many other Marvel films. It achieves acceptability.",
      "author": "Dan Murrell"
    },
    {
      "text": "the third [2021 action film] where family is an overarching theme...Australian director Cate Shortland's unique blend of goofy humor and exemplary action scenes both leading to world defining, impressively femme-charged change.",
      "author": "Laura Clifford"
    },
    {
      "text": "While there are humorous moments aplenty between Natasha and Yelena, Alexei provides more comedic relief. Rachel Weisz plays the icy Melina Vostokoff to perfection.",
      "author": "Melody McCune"
    },
    {
      "text": "A better-than-decent action flick with a great cast, trying to differentiate itself from other Marvel Studios films with a espionage-driven plot, eventually succumbing to the same (both good and bad) Marvel habits. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "It's not my favorite Marvel movie... but I definitely enjoyed myself.",
      "author": "Jaby Koay"
    },
    {
      "text": "I was honestly surprised at how moved I was by the story.",
      "author": "Achara Kirk"
    },
    {
      "text": "Black Widow gives Nat a legacy that could reach wide into the MCU and might just change it for the better.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "It often reminds viewers that all of this could have been so much more powerful and riveting without the over-the-top tech or superheroes of any kind.",
      "author": "Mike Massie"
    },
    {
      "text": "While I'm still not quite sure why the movie needed to exist in theory, I do think that Cate Shortland crafted a really fascinating and entertaining film.",
      "author": "Terence Johnson"
    },
    {
      "text": "So focused on using disability and trauma as plot devices, the filmmakers never plumb the depths of what it is to lack agency.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Although eleven years late, Natasha Romanoff has had a movie that does justice to her status as a legendary spy. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "The years-too-late solo flick for Scarlett Johansson's MCU superhero is both too much of a glorified backdoor pilot for its co-star and not up to par with the spy films and espionage thrillers it wishes to emulate.",
      "author": "Scott Mendelson"
    },
    {
      "text": "An excellent return to theaters for Marvel, showing that the initial casting of Johannson and the weight put on Shortland's shoulders to deliver a worthy Marvel action movie were both fully warranted.",
      "author": "Edward Douglas"
    },
    {
      "text": "These superheroes weren't born gods, didn't get powers by being exposed to radiation or finding magical objects. They're just women---who were once little girls, now vowing to change things. Now that's a superhero.",
      "author": "Neil Pond"
    },
    {
      "text": "Black Widow meets the immense challenge of enhancing the past and future of the character, while also functioning as a full experience in and of itself.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "A satisfying mix of muscle and emotion.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "\"Black Widow\" seems like a missed opportunity - an energetic placeholder in the Marvel Cinematic Universe meant to tide audiences over until a bigger, richer adventure comes along.",
      "author": "Tim Grierson"
    },
    {
      "text": "If you can get over its imperfections (an abrupt ending, a weak villain), Black Widow is a fantastic ride - about 5 years too late.",
      "author": "Tania Lamb"
    },
    {
      "text": "By this point, Johansson feels so comfortable in Romanoff's skin that it lends the film a strangely naturalistic feel. Pugh, on the other hand, seems to be pushing plenty of effort into her work, which adds a nice layer of meta to their scenes together.",
      "author": "Tim Stevens"
    },
    {
      "text": "[Black Widow's] story never reaches its full potential, especially with the lackluster villains.",
      "author": "John Nguyen"
    },
    {
      "text": "Third act is horrible, & Scarlett Johansson deserves better after waiting so long for a solo movie. But Florence Pugh is amazing & the first 2/3rds are interesting enough.",
      "author": "Grace Randolph"
    },
    {
      "text": "A movie about Black Widow may not make as much sense now as it did a few years ago, but it handles its ingredients well and features a shining performance from Florence Pugh. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "There's an art to delaying the inevitable. By the god of thunder, director Cate Shortland demonstrates that art in this Marvel spin-off, which basically functions as a wondrous, two-hour-long goodbye.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Maybe it's no surprise that the film is entertaining and full of action. It is unexpected, though, that Black Widow may be the least Avenger-like movie in the series so far.",
      "author": "Caryn James"
    },
    {
      "text": "Johansson once again embodies a character driven by her pain; now we know where it comes from. Pugh is outstanding, tapping into some of that same pain but making it her own.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "The movie's vibe isn't like your average MCU entry at all, really. What it reminded me of are the many James Bond films where 007 goes rogue and cavorts around world cities seeking his revenge du jour.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "\"Black Widow\" simultaneously feels like too much and too little.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Expository bottle episodes are as crucial to comics as crossovers. Not every detour is a waste of time.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Like the young Natasha herself, \"Black Widow\" feels as though it's been programmed into submission - and scarcely allowed to live and breathe before it's suddenly over.",
      "author": "Justin Chang"
    },
    {
      "text": "The stakes are nonexistent. No matter how many times a bad guy (or girl) aims a gun at our beloved heroine, we know she has a specific Endgame.",
      "author": "Mara Reinstein"
    },
    {
      "text": "\"Black Widow\" is a strong solo superhero effort that feels both timely and also way too late.",
      "author": "Brian Truitt"
    },
    {
      "text": "At its best... \"Black Widow\" is a welcome break from the overwrought transmedia machine that dictates Disney's biggest franchise bets, and almost invites you to forget what's at stake.",
      "author": "Eric Kohn"
    },
    {
      "text": "Shortland and her writing team have given us a film that is more ingrained in the spy movie genre than the usual superhero fodder.",
      "author": "Linda Marric"
    },
    {
      "text": "Casting is maybe the primary strength of this mega-franchise, and the film's familiar bantering dynamic gets a strong assist from new hires.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Marvel returns to cinemas, and its first film back is a bit lackluster. This feels ten years too late, not just for the character but for this type of bland action film.",
      "author": "EJ Moreno"
    },
    {
      "text": "\"Black Widow\" is a decent action vehicle and spy thriller, even if it feels a bit paint-by-numbers and years late to the screen.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "While it's hard not to dwell on the fact that Black Widow should have been made a decade ago, the new movie still manages to be a well-placed addition to the franchise and the perfect send-off for Scarlett Johansson and Natasha Romanoff.",
      "author": "Jamie Jirak"
    },
    {
      "text": "Florence Pugh and Scarlet Johansson's relationship is the heart of the story. David Harbour is thoroughly enjoyable. While not a perfect film, it's a bittersweet feeling watching Scarlett's run as Natasha Romanoff coming to a final end in the MCU.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "Shortland works in unvarnished closeup and establishes a mood of lurching, desultory anxiety that's closer to Russian neorealism than the Russo brothers.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "This action-packed film coupled with some serious emotional family plot points will give Natasha fans what they have been waiting for -- but Florence Pugh steals the show.",
      "author": "Tessa Smith"
    },
    {
      "text": "For fans of Black Widow and everyone else, this episode is great fun and Harbour could well ascend to spinoff greatness of his own.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Both a solid spy thriller and an engaging familial drama, it brings the action but wisely offers plenty of heart and humour and leaves you completely satisfied.",
      "author": "Doug Jamieson"
    },
    {
      "text": "I laughed more than a few times, in the right places, and you will, too. It helps that the four main actors are among the best you can hire.",
      "author": "Roger Friedman"
    },
    {
      "text": "Well-worth the longer than expected wait.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Black Widow might be better late than never but Marvel Studios does it again and delivers the goods.",
      "author": "Danielle Solzman"
    },
    {
      "text": "BLACK WIDOW will provide some closure for fans, but the film is not without its flaws.",
      "author": "Sarah Musnicky"
    },
    {
      "text": "This standalone proves a stellar vehicle for Scarlett Johansson's Natasha Romanoff, given first-rate support by Florence Pugh, Rachel Weisz and David Harbour.",
      "author": "David Rooney"
    },
    {
      "text": "If ever proof were needed that Natasha could easily carry her own movie, here it arrives fully formed. Better late than never.",
      "author": "Matt Maytum"
    },
    {
      "text": "Its lazy script reduces elements of trauma to empty dialogue ad awkward comedy. A disappointing Marvel movie that fails its fans and casting alike. [Full Review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "Boiled down to its essence, this narrative isn't terribly hard to follow, but in execution the film moves so haphazardly as to be bewildering.",
      "author": "Jake Cole"
    },
    {
      "text": "It shouldn't really have taken 11 years for the Widow to get her own standalone adventure. But thanks to some zesty new character dynamics and smart twists, Marvel have finally done her right.",
      "author": "Nick De Semlyen"
    },
    {
      "text": "It's just a shame that Natasha never had this from the very start.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Black Widow falls victim to the big bombast characteristic of the studio. The result is a disappointing solo movie that ends up burying Natasha Romanoff once again.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "Some will immediately sniff out \"Black Widow\" for the glorified side mission, meant to set up an inevitable Disney+ series, that it is but \"Black Widow\" manages to get the job done, giving the beloved Natasha Romanoff the spotlight she always deserved.",
      "author": "Nate Adams"
    },
    {
      "text": "Black Widow embraces the history of the character-the good and the bad...This core element of the film is what makes it perfect for comic book readers, while the spectacle will satisfy MCU fans who have only ever watched the films.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Johansson is again a great presence in the role, showing expert action and acting chops throughout, while Pugh is clearly ready to lead her own franchise after this MCU debut.",
      "author": "Pete Hammond"
    },
    {
      "text": "The film does offer additional insight into the character's tortured past, but the overwhelming effect is that of a baton being passed.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Black Widow is filled with fantastic action-packed sequences, fun comedic beats, and themes of family, even while it shortchanges Natasha herself.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "An engaging, action-packed spy thriller that combines the high energy of a Jason Bourne movie with the campy intrigue of a Roger Moore-era James Bond film.",
      "author": "Joey Morona"
    },
    {
      "text": "It's more a true end for Phase 3 than a start for Phase 4, but Natasha deserved this movie. (...) It gives her a reason to be, to live and to die. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "While the film is plied with eye-catching action sequences, it struggles to strike a balance between action and family drama, and reinforces some of Marvel's tired tropes of women superheroes.",
      "author": "Nicole Clark"
    },
    {
      "text": "An ambitious, honest, and messy entry in the Marvel Cinematic Universe that succeeds at setting itself apart from the franchise in surprising ways.",
      "author": "Evan Dossey"
    },
    {
      "text": "An action-packed and emotional look at Black Widow's past delivers on its premise, but struggles with being so late in Natasha Romanoff's story.",
      "author": "Amelia Emberwing"
    },
    {
      "text": "It's almost a shame that Florence Pugh is so vibrant here, since it takes away from appreciating Scarlett Johansson in likely her last turn as Black Widow.",
      "author": "Joey Magidson"
    },
    {
      "text": "Divorced of its duties to superhero lore, Black Widow would still be a sufficiently deft spy caper, confidently crafted and worthy on its own terms.",
      "author": "Richard Lawson"
    },
    {
      "text": "While it's certainly an odd time to choose to tell this story, that doesn't stop it from being another solid entry in the MCU. The story is smaller, darker, and more personal, and features several standout new characters.",
      "author": "Sean Chandler"
    },
    {
      "text": "'Black Widow' is Marvel's very own spy blockbuster.",
      "author": "Brian Lloyd"
    },
    {
      "text": "Black Widow is full of action and car chases, but they're balanced by moments of humor, genuine emotion and accompanied by plot twists you won't see coming.",
      "author": "Nicole Ackman"
    },
    {
      "text": "Despite your standard Marvel action set piece and a colorful cast of characters, Black Widow feels of little consequence, delivering a story that has written itself into a corner with nowhere to go.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "Thrilling, clever twists and turns combined with capably constructed and propulsive set pieces make this a film with stamina and staying power.",
      "author": "Courtney Howard"
    },
    {
      "text": "Black Widow is Bourne meets Bond meets Terminator...with two outstanding, badass female leads. Action-packed, funny, and at times surprisingly gut-wrenching, Cate Shortland's vision for the MCU is bold, empowering, and utterly unmissable.",
      "author": "Josh Wilding"
    },
    {
      "text": "Black Widow is full of action and heart. To my surprise, the movie is at its best during the quiet moments. The theme here is family, and that holds true throughout.",
      "author": "Austin Burke"
    },
    {
      "text": "The chemistry between these two fantastic actors [Scarlett Johansson and Florence Pugh] is stunning, and Pugh is a perfect addition to the MCU.",
      "author": "Jenna Busch"
    },
    {
      "text": "Marvel is more invested in weaving a web of explosions, stunts & violence than our investment in Black Widow's character. Not my favorite solo film.",
      "author": "Christie Cronan"
    },
    {
      "text": "A far more impressive and enjoyable solo outing than the MCU has produced in recent memory, but it's still mind boggling we didn't get this movie ten years ago.",
      "author": "Dominic Griffin"
    },
    {
      "text": "A solid action picture that does its best not to buckle under the weight of the Marvel Cinematic Universe.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "This new Marvel movie launches into the espionage and assassin genres with the unblinking verve of a Bourne or a Wick. It's an unexpected form for an Avengers offshoot to take. But that's what makes it work.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Black Widow is just what a world waking up from a coma needs: a female-centered action extravaganza with exceptional performances, lots of laughs, and just a touch of that Marvel magic that just may be the antidote we've all been waiting for.",
      "author": "Catherine Springer"
    },
    {
      "text": "\"Black Widow\" is mostly an entertaining and adequate tribute to Natasha Romanoff, Black Widow, and Scarlett Johannson's time in the Marvel Cinematic Universe, but it's not very consequential.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "An explosive return to cinematic Marvel! Filled with exhilarating action sequences and enormously touching franchise defining moments, it's the Marvel movie we all need right now! Johansson shines, finally getting the spotlight she's always deserved.",
      "author": "Dave Lee"
    }
  ],
  "release_year": 2021,
  "duration": 133,
  "genres": [
    "Action",
    "Adventure"
  ],
  "synopsis": "In Marvel Studios' action-packed spy thriller \"Black Widow,\" Natasha Romanoff aka Black Widow confronts the darker parts of her ledger when a dangerous conspiracy with ties to her past arises. Pursued by a force that will stop at nothing to bring her down, Natasha must deal with her history as a spy and the broken relationships left in her wake long before she became an Avenger.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/kwB7d51AIcyzPOBOHLCEZJkmPhQ.jpg"
}