{
  "movie_name": "Booksmart",
  "movie_id": "booksmart",
  "total_reviews": 383,
  "reviews": [
    {
      "text": "Wilde's direction and script oozes with the confidence and mastery of someone that has been directing for ten-plus years.",
      "author": "Ryan McQuade"
    },
    {
      "text": "Something just clicks about Booksmart. It’s startlingly funny, maybe a tad over the top, but I struggle to find something that’s a genuine issue.",
      "author": "Ethan Gordon"
    },
    {
      "text": "Booksmart is hilarious without ever making fun of someone for the sake of a joke. It is earnest and sweet, a pure delight.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "Booksmart is a wonderful addition to the coming-of-age genre, one that possesses two astonishing protagonists. Beanie Feldstein and Kaitlyn Dever might become superstars in the future if they continue to display such remarkable performances.",
      "author": "Manuel São Bento"
    },
    {
      "text": "To me, Booksmart is the definitive coming-of-age movie. It's hilarious, charming and real.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "With this being Olivia Wilde’s directorial debut, I can say with full confidence that she managed to create a unique film that’s both a love letter to the coming-of-age story and to anyone who spent their Friday nights at home doing schoolwork.",
      "author": "Nicolas Soto"
    },
    {
      "text": "Olivia Wilde’s funny and sensitive story about two high school best friends...",
      "author": "Brian T. Carney"
    },
    {
      "text": "A breakout moment for stars Beanie Feldstein and Kaitlyn Dever, as well as for first-time director Olivia Wilde, Booksmart is utterly hilarious.",
      "author": "Michael Cuby"
    },
    {
      "text": "The screenplay was put together by a team of four writers whose apparent aspirations to be “Superbad 2.0” overtakes the meaningful story at the film’s core.",
      "author": "Keith Garlington"
    },
    {
      "text": "Although Booksmart doesn't break new ground or redefine the genre of teen comedies, its treatment of the material resonates enough that Generation Z will undoubtedly cling to the movie for years to come.",
      "author": "Brian Eggert"
    },
    {
      "text": "Along with great directorial choices, the films two great performances provide tons of chemistry and a lot of laughs and should be the start of cinephiles gaining anticipation for any film directed by Olivia Wilde.",
      "author": "David Gonzalez"
    },
    {
      "text": "Wilde's taken a classic coming-of-age chassis, updated it, chucked on a few mod-cons, and given it a very fresh paint job, and the resulting ride is fast and fun.",
      "author": "Matt Neal"
    },
    {
      "text": "It's a lot more meaty and soulful than you'd anticipate.",
      "author": "Lonita Cook"
    },
    {
      "text": "While being an excellent example of the power of friendship, Booksmart is also a warning to viewers that labels are dangerous.",
      "author": "Nicholas Oon"
    },
    {
      "text": "There's something innately hilarious about watching the \"good kids\" losing themselves in bad behaviour.",
      "author": "Ben Turner"
    },
    {
      "text": "It's at the top of the class.",
      "author": "Kip Mooney"
    },
    {
      "text": "Blending negatives with the swagger, insecurities, and skyrocketing emotions of teenagers, Book Smart ends up creating a positive concoction and an ode to friendship.",
      "author": "Robin Holabird"
    },
    {
      "text": "\"Booksmart is a movie about friendship, but it's also about how friendships grow and change as the people within them do as well.\"",
      "author": "Cate Young"
    },
    {
      "text": "Though it really shouldn't be at this point in time, it's exhilarating to see a film centered on teenage girls... Yet to champion the film as a universal reflection of teenage girldom rather than a highly specific fantasy also does it a disservice.",
      "author": "Aline Dolinh"
    },
    {
      "text": "With elegant clarity, Booksmart demonstrates how certain experiences can feel colossal and of walloping import even when we know we're waiting for something else-something we can't possibly fathom.",
      "author": "Rachel Vorona Cote"
    },
    {
      "text": "A veritable grab-bag of high school movie conventions cranked up to 11.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Booksmart is a mostly sweet film that works hard to show the full depth of a female friendship. Showcasing two up-and-coming highly-talented actors, it's a movie that holds up well against other recent notable comedies.",
      "author": "Alex Bentley"
    },
    {
      "text": "It's certainly on the better end of the spectrum, but transcendent, it's not.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Like its main characters Booksmart is an overachiever that knows how to have a good time.",
      "author": "Richard Crouse"
    },
    {
      "text": "Refreshingly, the film's generous spirit extends to all its characters, whether geek or jock or cool kid. Unlike almost every other high-school movie, no one here is a mean girl in need of a comeuppance.",
      "author": "Jason Best"
    },
    {
      "text": "Fast, frank, graphically sexual exchanges populate the script, but it never becomes grating.",
      "author": "Mike Massie"
    },
    {
      "text": "\"With such a fully formed debut, it's hard not to fall in love with Booksmart. It offers laughs, tears and heart by the bucket-load\"",
      "author": "Shaun Alexander"
    },
    {
      "text": "A movie like Booksmart comes along to remind us that we were actually heroes, no matter what group we belonged to.",
      "author": "Casey Cipriani"
    },
    {
      "text": "And Booksmart is incredibly smart to use a similar concept to tell a story that is much more at ease with itself, without trying to force a narrative.",
      "author": "Shah Shahid"
    },
    {
      "text": "An astonishing coming-of-age story that hardly goes by the books and honestly, it's hard to believe that this is Olivia Wilde's directing debut.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "Olivia Wilde is a tour-de-force of filmmaking.",
      "author": "Richard Propes"
    },
    {
      "text": "Olivia Wilde directs the teen actresses with flair in a somewhat overhyped coming-of-age flick that falls short of recent gems like \"Eighth Grade\" and \"Lady Bird.\"",
      "author": "Jason Fraley"
    },
    {
      "text": "A wonderful celebration of not just female friendship, but of a generation that's smart, cool and open to progression and inclusivity.",
      "author": "Andrew Gaudion"
    },
    {
      "text": "Almost certainly a teen classic in the making.",
      "author": "Tom Beasley"
    },
    {
      "text": "It's a lot harder than it looks to land this stuff. Wilde has done the hard yards, picking up tips from directors like Martin Scorsese (Vinyl) and Spike Jonze (Her) along the way.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "A tremendously entertaining coming-of-age comedy. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Booksmart succeeds in inclusivity and modernity, but its . . . characters lack context when it comes to teen culture or the funhouse mirror that refracts its many inspirations.",
      "author": "Matt Cipolla"
    },
    {
      "text": "Hilariously smart, audaciously original and expertly performed this is a top contender for comedy of the year.",
      "author": "Zehra Phelan"
    },
    {
      "text": "A poem to friendship and a celebration of the new generations. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "It feels fresh and original, mostly because it does well the postmodern trick of mixing and matching old forms.",
      "author": "CJ Sheu"
    },
    {
      "text": "Olivia Wilde and company take something we've seen before, adjust the perspective just enough to make it fresh, and with sharp focus and fabulous leads, deliver a new high school classic.",
      "author": "Brent McKnight"
    },
    {
      "text": "Booksmart is a sharp, hilarious and, as it progresses, very touching coming-of-age film.",
      "author": "Damond Fudge"
    },
    {
      "text": "A moving, modern view of teenage life that's both very funny and draped in kindness and vulnerability.",
      "author": "Matt Pais"
    },
    {
      "text": "With Booksmart, Olivia Wilde turns in a flawless debut that is a hilariously heartwarming coming of age story.",
      "author": "Dan Tabor"
    },
    {
      "text": "Powered by a quartet of female writers and endearing lead performances, Booksmart truly stands out from its peers by unabashedly celebrating female friendship and intelligence.",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "It stars a pair of credible, three-dimensional characters, and combines hilarious moments with plausible dramatic elements. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A fresh spin on the coming-of-age storyline with a new female POV...one of the best of the year.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Hilarious and fascinating look at growing up nerdy.",
      "author": "Wesley Lovell"
    },
    {
      "text": "The story, the players, and the two leads are all endearing in the very best of ways -- warm, funny, charming and bloody lovely.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "Every aspect about 'Booksmart' subverts the stereotypical high school film, there are no eye roll moments of despair, every second is gold.",
      "author": "Katie Hogan"
    },
    {
      "text": "I really liked Beanie Feldstein in Ladybird, and she is matched in this film by Kaitlyn Dever. The characters they play, and the other characters they interact with in the film are what make this an exceptional film.",
      "author": "Robert Roten"
    },
    {
      "text": "Booksmart is feminist, foul-mouthed and funny, turning the formulaic tropes of bawdy comedies inside out and giving us a couple of teen heroines who feel real and very 2019.",
      "author": "Jill Wilson"
    },
    {
      "text": "It felt decidedly new, from the pair of friends at the centre of the story to the celebration of female intelligence, ambition and loyalty.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "Franklin's voice fills the room. Nearly a half-century later, many audience members will feel just as carried away.",
      "author": "Rob Thomas"
    },
    {
      "text": "As for the film's own balance between conscientious goals and living for kicks, it's neatly done. The depiction of the pair's friendship is believable and good-spirited in a way that recalls Lady Bird...",
      "author": "Edward Porter"
    },
    {
      "text": "...witty, raucous, perfectly played and eventually packs an emotional wallop.",
      "author": "Kevin Maher"
    },
    {
      "text": "In some ways, youth never changes. But it always feels fresh.",
      "author": "Chris Knight"
    },
    {
      "text": "Booksmart already stands as the best comedy of summer. It'll be interesting to see if anything can remotely come close to dethroning it.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "This fun, fast-moving film is a directorial debut for Olivia Wilde, who helped polish a script kicking around for a decade-one written by four women, not to the detriment of its general cohesion and frequent hilarity.",
      "author": "Ken Eisner"
    },
    {
      "text": "Booksmart is as funny as both Superbad and genre cornerstone Dazed and Confused, but it has more heart than both.",
      "author": "Harry Guerin"
    },
    {
      "text": "Olivia Wilde's directorial debut jostles the ghosts of teen movies past to find its own voice ... [yet] Booksmart never quite gets to grips with the way money still matters.",
      "author": "Mel Campbell"
    },
    {
      "text": "Olivia Wilde's directorial debut is a brilliant teen comedy for the ages.",
      "author": "Aly Caviness"
    },
    {
      "text": "Every now and then, a movie comes along that is so of its time that it comes to define its time.",
      "author": "Chris McCoy"
    },
    {
      "text": "A vertiginous comedy of entanglements, existential anguish, initiation rituals and feminine empowerment. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "\"Booksmart\" is a genuinely moving story as well.",
      "author": "Asia Frey"
    },
    {
      "text": "It's raunchy and kind of gross at times, but there is such heart, sweetness, and honesty about high school.",
      "author": "Christy Lemire"
    },
    {
      "text": "Booksmart, instead, wraps its main characters in cotton wool. And despite one romantic awakening that's handled well but is best experienced without any forewarning, the script's curve balls lack impact...",
      "author": "Jason Di Rosso"
    },
    {
      "text": "In the current moment it feels like an oasis and a hug.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Everything about Booksmart feels alive and exciting and invincible, kinda like how being a teen feels.",
      "author": "Jaime Davis"
    },
    {
      "text": "While Booksmart may seem like the typical teenager, high school, coming of age story, there is so much underneath the surface that anyone who watches it can take something away from the film.",
      "author": "Allison Rose"
    },
    {
      "text": "Booksmart is the kind of option if you are looking for a youth comedy and entertainment. [Full Review in Spanish]",
      "author": "Lucero Calderón"
    },
    {
      "text": "Booksmart...managed to restore my faith in friendships and the films Hollywood makes about them.",
      "author": "Kate Rodger"
    },
    {
      "text": "Booksmart succeeds due to a freshness and feminine outlook that balances style, humor and sensibility. [Full Review in Spanish]",
      "author": "Mariana Fernández"
    },
    {
      "text": "Booksmart doesn't reach the heights of other films of its ilk, but it's a great film about identity and growth and a welcome addition. [Full Review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Booksmart feels innovative, inclusive, and progressive. Without a doubt, it is one of the best debut films by an actor-turned-director. [Full Review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "Booksmart leans on its protagonists to try and paint a portrait of coming of age that's really funny and sincere. [Full Review in Spanish]",
      "author": "Sebastian Valencia"
    },
    {
      "text": "It has a perfect balance of comedy and ridiculousness mixed with heart and compassion and growth.",
      "author": "Steph Cozza"
    },
    {
      "text": "Booksmart is a wish list for a better future world, to return home after living the dark tornado of our times. [Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "The sorority does not end by throwing the car into a ravine, but in a bulletproof, supportive and unconditional friendship in this honest, funny and emotionally intelligent movie, that is not usual in the genre. [Full Review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Manages to be a great story and the perfect debut for Olivia Wilde as a director. [Full review in Spanish]",
      "author": "Abigail Camarillo"
    },
    {
      "text": "A strong coming-of-age story with a large amount of laughs. [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "There's a lot to process. Yet, Wilde's ride wouldn't be complete without the full roller coaster of emotions, and to her credit, she doesn't pander.",
      "author": "Katherine Monk"
    },
    {
      "text": "It's great to see a feminine claim to the genre that isn't dominated by crass jokes. [Full Review in Spanish]",
      "author": "Francisco Marinero"
    },
    {
      "text": "Booksmart makes up for its somewhat conventional plot with its original spin on the party film genre, updating and flipping old tropes on their heads.",
      "author": "Claire White"
    },
    {
      "text": "Olivia Wilde directs, and boy does she show promise in her debut. While she has plenty of talent in front of the camera, it is hard to argue against her abilities behind one.",
      "author": "Alan French"
    },
    {
      "text": "Wilde's film is superconscious of the present and expresses it with lucidity, humor and optimism. [Full Review in Spanish]",
      "author": "Desirée De Fez"
    },
    {
      "text": "In addition to breaking glasses ceilings, Wilde announces herself as a director to look out for with a sharp, hilarious comedy that revives a well-trodden genre.",
      "author": "Victoria Luxford"
    },
    {
      "text": "It sounds like such a cliche but you will literally laugh and cry, and flash back to your own teenage days with fondness, not horror.",
      "author": "Wenlei Ma"
    },
    {
      "text": "[There's] great chemistry between the two actresses. [Full review in Spanish]",
      "author": "Ignacio Navarro"
    },
    {
      "text": "The film works to perfection as a wild comedy. [Full Review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "Actor-turned-director Olivia Wilde... has delivered an assured and, at times, audacious debut that delivers way more depth than it's initially simple premise would suggest.",
      "author": "James Croot"
    },
    {
      "text": "A conventional story that attempts to distinguish itself from similar products through a banal accumulation of excesses, provocations, artifice and extravagances. [Full review in Spanish]",
      "author": "Jaime Fa de Lucas"
    },
    {
      "text": "You don't have to be a queer teenage activist to relate to Amy, but imagine what Booksmart might mean to those who have not seen themselves regularly represented on the mainstream screen.",
      "author": "Greg Carlson"
    },
    {
      "text": "[A] hilarious teen comedy that's infectiously charming.",
      "author": "Toby Woollaston"
    },
    {
      "text": "Booksmart doesn't want to make fun out of the nerds, and it has no interest in lecturing young audiences about sex, school, and prioritising one's education. It tells you it's okay to make mistakes.",
      "author": "Amelia Harvey"
    },
    {
      "text": "Actress Olivia Wilde's wonderful directorial debut [is] a singularly unconventional, extremely funny, occasionally insightful tale of high school hijinx, girl talk and how reality can sometimes slap you in the face at the least convenient moment.",
      "author": "Jim Schembri"
    },
    {
      "text": "Kaitlyn Dever and Beanie Feldstein are the BFFs that you would like to have had in high school. [Full review in Spanish]",
      "author": "Andrea G. Bermejo"
    },
    {
      "text": "Warm, gentle and self-consciously woke, Booksmart isn't taking any chances with its comedy-and as such could hardly be considered ground-breaking or radical.",
      "author": "Katie Parker"
    },
    {
      "text": "Booksmart is sometimes fun and enjoyable but it could have been much sharper.",
      "author": "Damien Straker"
    },
    {
      "text": "It doesn't so much turn the tables on a traditional male-centric genre as it simply appropriates its characteristics and gives them a modern female spin.",
      "author": "James Kendrick"
    },
    {
      "text": "Booksmart is about busting taboos, showing us that a real person lurks behind the veneer of everyone you have ever judged.",
      "author": "David Harris"
    },
    {
      "text": "Booksmart is an intoxicating testament to youth that will serve as the moment Kaitlyn Dever and Beanie Feldstein got their names placed firmly on the map.",
      "author": "Mark Goodyear"
    },
    {
      "text": "There's book-smart, then there's life-smart. BFFs Amy and Molly have nailed the first ask. Now, the night before their high-school graduation, they're playing catch-up with the second.",
      "author": "Andiee Paviour"
    },
    {
      "text": "First, the good news: it's immediately clear that Wilde is a filmmaker by vocation... If anything, the film is polished to a fault: the marketing term \"elevated genre,\" most frequently applied to horror, feels equally apt here.",
      "author": "Jake Wilson"
    },
    {
      "text": "If you can deal with its unflagging zest -- for some I suspect it will grate like nails down a blackboard in the classroom of their nightmares -- then you may enjoy watching Booksmart. I did.",
      "author": "Anwen Crawford"
    },
    {
      "text": "[Booksmart is] a slightly derivative teen friendship drama that still proves mostly enjoyable thanks to memorable performances and a layer of sweet, wistful charm.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "While its general synopsis looks very familiar on paper, its expansion and execution on screen is something truly out of the ordinary.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Undoubtedly one of this year's best, I implore audiences to use their smarts and see this film instantly. And then see it again.",
      "author": "Peter Gray"
    },
    {
      "text": "The film's not perfect but if this is the next step in the grand tradition of high-school movies, then it's in good hands.",
      "author": "Thomas Barrie"
    },
    {
      "text": "By making her own distinctive impression in a crowded field, Wilde, too, announces herself as a talent to watch.",
      "author": "Vicky Roach"
    },
    {
      "text": "Booksmart is so good that you'd want to rub your face in it, thanks to its energetic performances, an infectiously upbeat script and Wilde's effortless direction. An absolute bundle of joy from start to finish.",
      "author": "Harris Dang"
    },
    {
      "text": "Booksmart is such a smart, funny, rude, cheerful, likeable movie. It's well worth checking out, even if your school days are a distant memory.",
      "author": "David Stratton"
    },
    {
      "text": "For anyone who leaned too hard into academic success in high school at the expense of carousing, partying, being cool and rocking out, the hilarious, joyously filthy Booksmart cuts deep.",
      "author": "Stephen Rebello"
    },
    {
      "text": "A hilarious, heartfelt and trailblazing teen comedy from first-time director Olivia Wilde.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Refreshing, intelligent, and utterly hilarious, 'Booksmart' fires on all cylinders.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Booksmart has something urgent going on under the surface. This is a lively and rebellious, rather profoundly feminist movie about young women with dreams, and the enormous pressures facing them.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "Booksmart isn't just wonderful, it's a proudly fierce, fun and feminist hurricane.",
      "author": "Matt Hudson"
    },
    {
      "text": "Booksmart goes down awfully easy for a first feature. Olivia Wilde's long-form directorial debut feels as breezily modern as it does effortlessly made.",
      "author": "George Elkind"
    },
    {
      "text": "In her debut outing Booksmart, Olivia Wilde crafts a not only tender, but entertaining story that's a must see for fans of the genre. Be sure to add this one to your list.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "Wilde and her collaborators have done something extraordinary and praiseworthy. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Fun ride from first time director Olivia Wilde -- but why do comedy movies about women so often fall into the gross out humor mode? Newsflash -- many women don't respond as much to gross out humor as to character based and situation based humor.",
      "author": "Julia Swift"
    },
    {
      "text": "Booksmart is likely the best film you won't see in theaters but will watch six months from now and kick yourself from not finding it sooner.",
      "author": "Matt Ward"
    },
    {
      "text": "Wilde approaches teen comedy tropes in new ways, combining them with frank honesty and a kinder sensibility (it reminded me very much of Blockers). Dever and Feldstein are an impressive double act but Lourd is the scene-stealer.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Booksmart is destined to join the pantheon of indelible high school pictures.",
      "author": "David Nusair"
    },
    {
      "text": "It's more John Hughes than Judd Apatow, and it's a little more Bridesmaids than Lady Bird...a success on [its] own terms...",
      "author": "Kristen Evans"
    },
    {
      "text": "'Booksmart' is a funny, entertaining, and very smart celebration of the deep friendship between two academically gifted girls who decide to make up for four years of non-stop studying with one epic night of partying",
      "author": "Alexandra MacAaron"
    },
    {
      "text": "... the perfect storm of direction, writing, and casting... sending a positive message that everything is going to be all right... and it won't require a superhero to save the day.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Forgive me if I'm bored by this... Politics somewhat aside, the comedy teens need today certainly isn't a fairy tale about a good-natured struggle to the top.",
      "author": "Cassie da Costa"
    },
    {
      "text": "It's a raunchy, smart look at growing up.",
      "author": "Linda Cook"
    },
    {
      "text": "Hands down, the funniest high school comedy since \"Superbad\".",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Wilde has crafted a subtly bold debut, approaching the film with a level of experimentation that is both exciting and well-attuned to her young subjects.",
      "author": "Chris Feil"
    },
    {
      "text": "It's a comedy with smarts and heart...",
      "author": "Tim Appelo"
    },
    {
      "text": "It's got heart and it's f**king hilarious. Now how many comedies can you say that about?",
      "author": "Deirdre Molumby"
    },
    {
      "text": "(Written by Luke Walpole) Much like its characters, Booksmart gets straight As. As uproarious as it is heartfelt, it's a genuinely superb coming of age film.",
      "author": "Luke Walpole"
    },
    {
      "text": "In the absence of out and out jokes, because this is still a movie in thrall to the orthodoxy that everyone must be on all the time, there's a pleasing optimism.",
      "author": "Ed Whitfield"
    },
    {
      "text": "A perfect balance between sexualized/gross-out humor and sincere admiration for one of the wildest emotional periods of a human being's life, Booksmart screens like a love letter to that best friend who was closer to a life partner than a school chum.",
      "author": "Joelle Monique"
    },
    {
      "text": "What we have here is a coming-of-age comedy made with intelligence, style, and a relentless sense of humor.",
      "author": "Tim Brennan"
    },
    {
      "text": "Whether Booksmart ends up achieving lofty status as a high school classic a la Clueless or The Breakfast Club won't be determined for some time, but for those seeking a worthy movie in a largely parched summer season, this is nothing short of a godsend.",
      "author": "Matt Brunson"
    },
    {
      "text": "Without the hypocrisy of its genre-related competitors, this is a refreshing teen movie that bounces with energy and tangy dialogue.",
      "author": "Filipe Freitas"
    },
    {
      "text": "As good as Feldstein and Dever are as a pair... Booksmart really soars when our heroines reach their destination and, separately, get to spread their wings.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "A muddled message delivered in a film that is basically flat as far as comedy is concerned.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Sequences throughout the movie that over-rely on music betray the great performances...but go out and see this movie, I want to see what Olivia Wilde does next.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "These characters really do seem like they've been best friends forever...refreshing, and genuinely funny and topical.",
      "author": "Martin Thomas"
    },
    {
      "text": "I want to see so many more Booksmarts, all Booksmarts down the line. An incredibly confident directorial debut.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Working from a dream of a screenplay, Wilde stylishly depicts the essence of female teenage life, with artistic visual flourishes and a killer soundtrack.",
      "author": "Terry Staunton"
    },
    {
      "text": "Booksmart's greatest strengths are in its actors and its script, both of which help elevate these admittedly low-stakes shenanigans into undeniably entertaining territory.",
      "author": "Alex Leininger"
    },
    {
      "text": "Ultimately, the vital takeaway is that nobody is one-dimensional, and neither is Booksmart.",
      "author": "Mia Vicino"
    },
    {
      "text": "Booksmart, however, not only subverts the tribal clichés but upends them, reflecting perhaps the new mores of a generation determined to avoid glib sexual and social classifications.",
      "author": "Paul Whitington"
    },
    {
      "text": "The movie slowly conforms to type as the end draws near, with the usual lessons being learned, hugs dispensed, all the stuff you really have seen so often before. But at its best, Booksmart is a delight.",
      "author": "Alison Rowat"
    },
    {
      "text": "That's what makes the movie powerful: Instead of watching Amy and Molly \"poor me\" themselves to death, we see them recalibrate and continue on their missions.",
      "author": "Rachel Wells"
    },
    {
      "text": "The writing from Susanna Fogel, Emily Halpern, Sarah Haskins and Katie Silberman and Wilde's hyper-attentive direction reveals the hopeful promise awaiting these two protagonists.",
      "author": "tt stern-enzi"
    },
    {
      "text": "BOOKSMART is a strong directorial debut for Olivia Wilde and another entry in the ever-expanding canon of smart films about teens on the edge of evolving and growing up.",
      "author": "Tim Stevens"
    },
    {
      "text": "Wilde humanizes this much maligned but rarely understood generation, giving it a voice that is properly rapturous, chaotic and, yes, dignified.",
      "author": "Rick Levin"
    },
    {
      "text": "While it's not clear how long these girls have been friends, what shines on the screen is their chemistry-Feldstein is a remarkable actor.",
      "author": "Megan Reynolds"
    },
    {
      "text": "The pace is fast, the wit is superior, the movie is smart and fun!",
      "author": "Martha K. Baker"
    },
    {
      "text": "This movie really got in there. I never want to go back to high school, but I sure wish I'd been able to watch Booksmart in high school.",
      "author": "Leilani Polk"
    },
    {
      "text": "\"Booksmart\" marks an outstanding debut by actress Olivia Wilde behind the camera.",
      "author": "Brad Keefe"
    },
    {
      "text": "While very raunchy I found Booksmart to be a funny comedy but also a treatise on the importance of friendship.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Olivia Wilde's directorial debut is a refreshing coming-of-age comedy that goes against stereotypes thanks to the multi-layered characters. Kaitlyn Dever and Beanie Feldstein get my vote for the best onscreen duo of 2019!",
      "author": "Joe Friar"
    },
    {
      "text": "Much foul-mouthed hilarity ensues... Feldstein and Dever's chemistry as best friends is endlessly delightful.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Olivia Wilde slam-dunks her directorial debut. Is \"Booksmart\" the G.O.A.T. of high school movies? No, but it's definitely in the top 20. Maybe the top 10. It's heavily influenced by many of the greatest.",
      "author": "Mark Jackson"
    },
    {
      "text": "Booksmart is a heartfelt and honest comedy...with a great script, great direction and a fantastic central pairing. Seriously - however good you think this movie is, it's almost certainly better.",
      "author": "Allen Adams"
    },
    {
      "text": "Actor Olivia Wilde makes a creditable directing debut with Booksmart.",
      "author": "Saskia Baron"
    },
    {
      "text": "The film doesn't merely flip the gender, it inventively finds a new path through the usual tropes to create fantastically vivid and complex characters while indulging in the kind of silly outrageousness that has always been reserved for boys",
      "author": "Rich Cline"
    },
    {
      "text": "Booksmart graduates with top marks (but doesn't forget to have fun along the way).",
      "author": "Sarah Cullen"
    },
    {
      "text": "It's easy for a movie to spout platitudes about female solidarity, but these two feel like the real deal.",
      "author": "Margot Harrison"
    },
    {
      "text": "Too many movies about teenagers feel designed to cater to the misconception that its audiences only seek dumb escapism. Not only is this film rowdy and fun, but insightful.",
      "author": "Alci Rengifo"
    },
    {
      "text": "With an exuberant soundtrack, a celebratory attitude towards diverse gender and sexuality, and a relentlessly hilarious script, Booksmart is an irresistible ode to the joy of young friendship.",
      "author": "Roe McDermott"
    },
    {
      "text": "Booksmart joins the likes of The Kings of Summer and Eighth Grade, as a contemporary snapshot of youth with a heart as big as its funny bone. Enrol now.",
      "author": "Matt Rodgers"
    },
    {
      "text": "It's replete with so much contradictory tension and accomplishes its goals though unconventional means, all the while maintaining the façade of a bitingly smart high school buddy comedy.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Oliva Wilde's directing debut is actually 'smart,' and savvy, and silly-just the right ingredients for a sure-fire comedic hit.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Confidently assured, snappy and hilarious, Booksmart is destined to become a classic.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "The film is peppered with jokes-some highly clever, some merely raunchy, as the genre demands-but it also has a beating heart.",
      "author": "Max Weiss"
    },
    {
      "text": "Booksmart puts a fresh spin on the coming-of-age night-of comedy because it's focused on two girls, one of whom is also queer.",
      "author": "Erin Keane"
    },
    {
      "text": "For a teen comedy, Booksmart is totally top of its class, but it's more than that -- this is a straight A-grade movie that's set to be one of the highlights of the whole year.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Fueled by big laughs and steadfast emotional intensity, Booksmart genuinely feels lived in. Olivia Wilde has afforded teen girls (particularly the witty, academic types) a mouthpiece in a spectacular way.",
      "author": "Brian Thompson"
    },
    {
      "text": "Feldstein and Dever have an honest chemistry and charm that keeps the narrative focused and cherishable.",
      "author": "Caitlin Quinlan"
    },
    {
      "text": "By replacing wish fulfilment with something much more powerful, Booksmart cleverly balances full-body cringes with full-hearted affection.",
      "author": "Alex Goldstein"
    },
    {
      "text": "Smart, savvy, and outrageous - Olivia Wilde's 'Booksmart' makes the grade",
      "author": "Nate Adams"
    },
    {
      "text": "Booksmart makes the grade, but needs a curve.",
      "author": "Kiko Martinez"
    },
    {
      "text": "A sharp and witty comedy that puts a fresh spin to a well-known formula. Booksmart proves it's possible to be intelligent and funny at the same time. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "The best high-school movies really love the kids in them, and that's the case with Booksmart.",
      "author": "Josh Larsen"
    },
    {
      "text": "Wilde cites as key inspirations the films Beverly Hills Cop, Training Day and Lethal Weapon. The best buddy movies resound: this is one of them.",
      "author": "Ray Pride"
    },
    {
      "text": "Witless, tedious, shallow and unfunny. Booksmart wants you to laugh at someone being vomited on. Ah, Bartleby! Ah, humanity!",
      "author": "Avi Offer"
    },
    {
      "text": "They're colorful and funny, and believably written and played (these characters are types for a reason). Most importantly, the writers complicate the types, giving them unexpected complexities and sympathetic elements.",
      "author": "Jason Bailey"
    },
    {
      "text": "Raucous, revealing, riotous and keenly cynical, Wilde's refreshing take on the growing pressures of liberating femininity and over-achieving high school academia for the suppressed female voice is a smart, observational mixture.",
      "author": "Frank Ochieng"
    },
    {
      "text": "It does take a while to find its feet, and for Beanie Feldstein and Kaitlyn Dever to convince as friends, but it's a funny, touching and slightly strange delight.",
      "author": "Matthew Bond"
    },
    {
      "text": "Booksmart is not short on outrageous larks and inappropriate remarks. It is, however, that sense of discovery that sets it apart.",
      "author": "Donald Clarke"
    },
    {
      "text": "You mean to tell me Olivia Wilde could have been directing all along?",
      "author": "James Verniere"
    },
    {
      "text": "While it scores no points where originality is concerned, the fact that its two protagonists are self-assured, overachieving young women is refreshing.",
      "author": "Charles Koplinski"
    },
    {
      "text": "A solid debut for Wilde, but really puts Dever and Feldstein on the map.",
      "author": "Hannah Strong"
    },
    {
      "text": "Savvy and surreal - this raunchy coming-of-age comedy, ultimately, turns out to be quite satisfying on the subject of female friendship.",
      "author": "Susan Granger"
    },
    {
      "text": "Dever and Feldstein sell the pair's charged, codependent dynamic, the former exuding a quiet confidence as the straight man to the latter's bossy, brassy, overcompensating comedian.",
      "author": "Simran Hans"
    },
    {
      "text": "Booksmart may be a breakneck comedy, but it also has a huge heart...",
      "author": "Michael Ward"
    },
    {
      "text": "Booksmart will be remembered as one of the great high school comedies.",
      "author": "Millicent Thomas"
    },
    {
      "text": "I promise you'll laugh out loud -- a lot!",
      "author": "John Urbancich"
    },
    {
      "text": "Parents' concerns today revolve around whether their children have enough maturity to navigate social situations enhanced by the immediacy of information exchange. If any of this film rings true, they've much reason to be proud.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Beanie Feldstein and Kaitlyn Dever deliver on the laughs and beautifully pull at your heart strings in this coming-of-age comedy.",
      "author": "Stephanie Chapman"
    },
    {
      "text": "Olivia Wilde's directorial debut bursts outward with neon electricity, encompassing, even if overcooking, the teenage tropes levied by similar films of the past, while also staying deeply rooted in the here and now.",
      "author": "Luke Parker"
    },
    {
      "text": "Every generation deserves a high school teen comedy to call its very own. Congratulations, current high schoolers. Here's yours.",
      "author": "Frank Wilkins"
    },
    {
      "text": "Booksmart is a love letter for any young woman who has ever stayed home on a Friday night to watch a Ken Burns documentary.",
      "author": "Chandler Levack"
    },
    {
      "text": "In virtually every scenario, director Wilde and the team of screenwriters serve up the material in a fresh and original manner.",
      "author": "Richard Roeper"
    },
    {
      "text": "Olivia Wilde's directorial debut is an easy A.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "I can't remember a time when I had as much fun watching a movie in a theater as when I first screened Booksmart.",
      "author": "Kevin Fallon"
    },
    {
      "text": "One of those rare films that comes along every five years or so that genuinely has a chance at becoming the defining coming-of-age comedy for its generation.",
      "author": "Dan Murrell"
    },
    {
      "text": "Booksmart is no gender-swapped remake but a funny, moving and, yes, smart coming-of-ager that deserves consideration on its own merits.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "[Booksmart] is a very satisfying movie for anyone who was never cool enough to see themselves in the star of a '90s teen comedy.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Dever and Feldstein's friendship and chemistry provide the film with both its chief appeal and dramatic engine, and the winning pair make Booksmart a film that's very easy to like. But it's less easy to believe.",
      "author": "Matthew Lickona"
    },
    {
      "text": "\"Booksmart\" is genuine enough that it doesn't sacrifice its emotional honesty for the gratification of its characters; it would feel disingenuous if everyone's arcs were wrapped up neatly, and \"Booksmart\" is too smart for that.",
      "author": "Adam Graham"
    },
    {
      "text": "This wise, funny, compassionate high school comedy succeeds wildly on almost all counts, thanks to its strong, lovable characters and fresh, bracing approach.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "I don't want to oversell Booksmart, but it's a cut above the usual teen junk and Feldstein and Dever give winning performances before the movie concludes with a ringing endorsement of friendship and delivers its message.",
      "author": "Robert Denerstein"
    },
    {
      "text": "...whatever troubles the film has are small, particularly in comparison to the charm and sincerity Molly and Amy share and invite the audience to partake in.",
      "author": "Gabrielle Bruney"
    },
    {
      "text": "It promises to be one of the genre defining, generation defining comedies of the decade.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Booksmart is a teen sex romp well suited for the summer of 2019: feminist but not preachy, raunchy but not nasty, emotionally intelligent but not sentimental.",
      "author": "Dana Stevens"
    },
    {
      "text": "Between all the gags about botched carjackings and drug-trip sequences, there's a deceptively sweet and layered story about the power of female friendship.",
      "author": "Clint Worthington"
    },
    {
      "text": "It's a high school movie that doesn't have sadistic bullies shoving helpless nerds into lockers, just a bunch of kids that, for all their flaws, are kind, funny, worldly, whip-smart and unapologetically themselves.",
      "author": "Katie Rife"
    },
    {
      "text": "Booksmart is, well, a smart comedy; it's rich with diversity and representation, new perspectives, up-and-coming actors getting their chance to break through into the mainstream, and toes the line between crude and moving",
      "author": "Robert Kojder"
    },
    {
      "text": "While it's not quite the high school cinematic epiphany you've been led to believe, Booksmart puts a fresh new spin on the coming-of-age comedy.",
      "author": "Louisa Moore"
    },
    {
      "text": "... One of the great coming-of-age comedies of its era.",
      "author": "Greg Maki"
    },
    {
      "text": "A bit over-talkie, but a smart and sympathetic portrait of good girls going on last-day binge to redeem their high school days.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Females own the screen, from director to writers to actors, following 2 academic nerds who decide it's time to go \"Wilde\" in this hilarious comedy...Booksmart is just plain smart.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Booksmart is a teen coming-of-age comedy destined to be a classic. Stars Beanie Feldstein and Kaitlyn Dever take likeability into the stratosphere. Olivia Wilde delivers greatness in her directorial debut.",
      "author": "Julian Roman"
    },
    {
      "text": "There's a lot of political window dressing for a movie that's almost studiously unpolitical. Name dropping Malala in a teen sex romp seems a bit much.",
      "author": "Vincent Mancini"
    },
    {
      "text": "The strong chemistry between actors Dever and Feldstein sparks the movie... On the other hand, Booksmart fails at the funny.",
      "author": "Julie Washington"
    },
    {
      "text": "[Olivia Wilde] creates a fricative bond between the two young women that feels genuine -- they are each other's biggest and most supportive fans.",
      "author": "Piers Marchant"
    },
    {
      "text": "\"Booksmart\" gives the girls onscreen and their older sisters behind it a chance to have fun in ways silly, salty, and magnanimous toward all concerned.",
      "author": "Ty Burr"
    },
    {
      "text": "Booksmart, the stunning directorial debut of Olivia Wilde, is Gen-Z's high school graduation movie, and may very well rank among the best of the genre.",
      "author": "Abby Olcese"
    },
    {
      "text": "Booksmart too often seems dutiful and assiduous, as if its makers had simply followed a manual listing the proper, righteous bromides for the characters to speak. In this time-condensed rumspringa, nothing offensive, troubling, or surprising happens.",
      "author": "Melissa Anderson"
    },
    {
      "text": "It's incredibly fun to watch again and again.",
      "author": "Monica Castillo"
    },
    {
      "text": "The script is just a gem, so packed with hysterical dialogue that I willed myself not to laugh out loud because I didn't want to miss a word .",
      "author": "Dana Barbuto"
    },
    {
      "text": "[Booksmart is] the teenage comedy I wanted as a teenager, and as a young adult, and now, and forever.",
      "author": "Rain Jokinen"
    },
    {
      "text": "\"Booksmart\" is smart enough to think that some teens can figure it out now, rather than years from now.",
      "author": "Michael Smith"
    },
    {
      "text": "But once the main characters strut around town with their matching blue jumpsuits, the hilarity ensues in an obscene style that takes viewers on a wild ride.",
      "author": "Samantha Incorvaia"
    },
    {
      "text": "Wilde is fundamentally telling a story about young people trying to survive and enjoy life while the outside world, and all its terrifying realities, draws ever closer.",
      "author": "David Sims"
    },
    {
      "text": "This empowering, feminist teen comedy is a Social Justice Warrior's dream project. And it's actually funny.",
      "author": "Christian Toto"
    },
    {
      "text": "It's funny because, beneath the humour, is a the ring of truth as loud as a school bell.",
      "author": "Amber Wilkinson"
    },
    {
      "text": "One of the better raunchy high school comedies to come down the pike recently, but apart from the gender switch the level of innovation is actually pretty modest.",
      "author": "Frank Swietek"
    },
    {
      "text": "The leads are what make the comedy moments and the overall film work. (Full Content Review for Parents - Sexual Content, Profanity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Wonderfully played by a universally on-point ensemble, it's rare to see this many well-drawn and diverse teenage characters who all get their moment in the sun.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Despite Booksmart's occasional missteps, much goes right. Nerds rule. Or was the message that you can goof off and still succeed? I can't remember. But I had a nice laugh.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "There are so many memorable performances.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "It's apparent from minute one of Booksmart that stars Kaitlyn Dever and Beanie Feldstein are going to deliver something honest and special.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "Booksmart is hilarious, and flows with a special kind of energy and confidence, and despite utilizing an established premise, is anything but by-the-book.",
      "author": "Tom Santilli"
    },
    {
      "text": "It's a delightful little miracle: a humane The Breakfast Club message smuggled inside an outlandish Fast Times at Ridgemont High package.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "Booksmart is the creative, sassy, witty and entertaining teenage comedy we didn't realize we were missing.",
      "author": "Dustin Chase"
    },
    {
      "text": "I honestly couldn't fault this film and want to see it again immediately.",
      "author": "Jamie East"
    },
    {
      "text": "Beautifully executed from top to bottom, Booksmart is more than a riotous teen comedy as it explores the complex ideas of friendship, falling in love, and growing up through various forms of self-realization and actualization.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Nothing funnier, smarter, quicker or more joyous has graced the big screen in a long time.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "As \"Booksmart\" takes its shape, albeit haphazardly, Wilde's filmmaking skills become more and more evident, bursting forth in a third act that builds into something beautiful and even transcendent.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Booksmart is the sort of big, crowd-pleasing and delightful comedy that doesn't come around as often as it should these days. It's genuinely and uproariously funny.",
      "author": "Steve Katz"
    },
    {
      "text": "Unlike previous teen comedies, which are now woefully outdated (ahem, Sixteen Candles), Booksmart will likely still be enjoyable 10 or 20 years from now.",
      "author": "Tiffany Kelly"
    },
    {
      "text": "\"Booksmart\" leaves you feeling unaccountably hopeful for the state of humanity - and the state of American screen comedy too.",
      "author": "Justin Chang"
    },
    {
      "text": "It's a raunchy, raucous blast for everyone involved, including the audience.",
      "author": "Karen Han"
    },
    {
      "text": "\"Booksmart\" is the movie you hope for... fresh, funny, and a bunch of instant favorite performers from booksmart and smart-smart debut director Olivia Wilde.",
      "author": "Nell Minow"
    },
    {
      "text": "I enjoyed so many things about \"Booksmart.\" There was the fun script, the easy way it incorporated progressive values, the friendship it depicts, the skilled cast, which ensured all the jokes not only landed, but landed spectacularly.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Wilde is a visually inventive director, who keeps the tempo here so brisk that we hardly notice how glib the storytelling sometimes becomes.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Feldstein and Dever are just sublime at giving these girls the depths of feeling as well as the comic flair that they need.",
      "author": "Linda Holmes"
    },
    {
      "text": "Aside from the acting and very sporadic flashes of true wit, it's one movie that viewers would be smart to avoid.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "Booksmart could very well end up being the unexpected gem of the summer.",
      "author": "George M. Thomas"
    },
    {
      "text": "The rough edges are small and easily forgotten with the infectious and palpable chemistry between Dever and Feldstein. Not enough can be said about their value to the film's success.",
      "author": "Tom Meek"
    },
    {
      "text": "... the euphoric, lightning-paced comedy that marks the directorial debut of actress Olivia Wilde...",
      "author": "Carrie Rickey"
    },
    {
      "text": "Indeed, the hyper-adrenalized pace, over-the-top set pieces, and conspicuously flashy production values strain so hard...fortunately, there's just enough charm left over to make the movie worth a look...",
      "author": "Andrew Osborne"
    },
    {
      "text": "Booksmart is a funny, smart and sweet-natured comedy.",
      "author": "Beth Accomando"
    },
    {
      "text": "Olivia Wilde's debut as director reinvigorates the high-school comedy.",
      "author": "André Hereford"
    },
    {
      "text": "The way Wilde stuffs funny gags into the corners and the background of the frame proves that she is a major comic talent.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Booksmart is quite funny ... but the film is primarily honest in its presentation of our protagonists...",
      "author": "Mark Dujsik"
    },
    {
      "text": "'Booksmart' is not another teen movie, it's a new classic. You will love it from cover to cover.",
      "author": "Preston Barta"
    },
    {
      "text": "It's an R-rated teen comedy that proves that you can center girls' experiences without sacrificing grossness, and that you can be gross without being too mean.",
      "author": "Pat Brown"
    },
    {
      "text": "The film traverses... new yet familiar territory with utter confidence, expertly subverting clichés at every turn and delivering great gags and brilliant performances.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Booksmart delivers a fresh and relevant take on high school in 2019 and does so with wit, ease, and a whole lot of love.",
      "author": "Gretchen Sterba"
    },
    {
      "text": "It's an early contender for the best comedy of the summer.",
      "author": "Peter Howell"
    },
    {
      "text": "You'd be smart to book tickets.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Feldstein and Dever have a kind of mad, cartoon chipmunk chemistry, playing characters who know each other so well that they finish each other's sentences and step on each other's lines.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "It's John Hughes meets Superbad meets Dazed and Confused -- a smart and funny experience that's one of my favorite films of 2019.",
      "author": "Micheal Compton"
    },
    {
      "text": "The movie clicks, and given the sorry state of movie comedy, its ability to be consistently funny stands out.",
      "author": "Gary Thompson"
    },
    {
      "text": "I adored Olivia Wilde's Booksmart, a movie that has a deep well of empathy not just for its brainy lead characters, but for teenagers in general.",
      "author": "Matt Goldberg"
    },
    {
      "text": "An original twist on a trite plot line that follows the last big fling before graduation. Booksmart turns the trope on its ear by dispensing with cliched stereotypes.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "It's hard not to love these confident, capable, problem-free post-millennials.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Wilde isn't interested in lazy humor, always trying to find the weirdness and the richness of the pairing as it experiences an endless night of life-changing risks.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Move over, Superbad: There's a new teen-buddy comedy in town.",
      "author": "Leah Pickett"
    },
    {
      "text": "\"Booksmart\" is a great teen comedy. Its message about knowing oneself - and others - is never preachy. Wilde delivers in a way that will leave viewers laughing.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "The genius of Olivia Wilde's raucous, inspired teen comedy Booksmart is that it doesn't attempt to reinvent the wheel.",
      "author": "Travis Hopson"
    },
    {
      "text": "If any film should bring the indie studio solidly into the black, this hilarious, heartfelt celebration of feminist teenage badassery deserves to do so.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Clichés get comically stripped away and real people step forward. It's a blast.",
      "author": "Jake Coyle"
    },
    {
      "text": "Booksmart is funny, honest and revolutionary without making too much noise. - [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "I have no problem saying that if you see any new release other than Booksmart this weekend, you're doing it wrong.",
      "author": "Andrew Parker"
    },
    {
      "text": "Booksmart's a breeze, a lovable debut, and while hardly perfect, wholly welcome.",
      "author": "Tim Robey"
    },
    {
      "text": "\"Booksmart\" is sharp but not mean, warm without feeling too soft or timid.",
      "author": "A.O. Scott"
    },
    {
      "text": "Wilde can set up a joke better than most directors, while also capturing the rhythms of high-school life and understanding the yearning souls of these smart, sweet, nerdy girls.",
      "author": "Sean P. Means"
    },
    {
      "text": "Booksmart is one of the best movies of 2019.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Every generation has their teen movie but BOOKSMART does something different. Not only does it center two female leads who are empowered and supportive of each other, it is also nonstop realness that is true and pure and hilarious.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Feldstein and Dever are both terrific in it.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "There's a near-total lack of toxic behaviour in Booksmart, as if such attitudes have been eradicated. It's an admirable social dynamic that feels like it's set a generation ahead of our own, and as a result feels slightly detached from what we know.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "Actor-turned-helmer Wilde, a veteran of The O.C. as well as Drinking Buddies, knows where the funniest gags live.",
      "author": "Kelly Vance"
    },
    {
      "text": "Booksmart is a more cerebral take on the genre: its clever, funny, feminist leads undercut the dafter party sequences with their own private wit and chemistry. On screen together, they are an infectious delight.",
      "author": "Anna Leszkiewicz"
    },
    {
      "text": "Booksmart is so good that it may actually go down as one of the best teen comedy films of all time.",
      "author": "Tom Fitzgerald and Lorenzo Marquez"
    },
    {
      "text": "If you're in high school (or have ever gone through the experience), you'll laugh quite a bit, wince more than once, and relate from start to finish.",
      "author": "James Berardinelli"
    },
    {
      "text": "Wilde... turns a five-writer screenplay into a focused fresco of the hell and hedonism of adolescence.",
      "author": "Nigel Andrews"
    },
    {
      "text": "...it's easy to fall in love with both girls, and the film's refusal to stoop to simplistic moral messages in favour of celebrating the bonds of (female) friendship is refreshing and genuinely applause-worthy.",
      "author": "Joe Lipsett"
    },
    {
      "text": "It's a movie that's hyperbolic and raunchy, a movie that has so much sympathy for its diverse characters despite all of their shortcomings.",
      "author": "James Clay"
    },
    {
      "text": "Olivia Wilde's raunchy yet adorable high-school comedy \"Booksmart\" understands a basic truth: For so many former teenage girls, your first love is your high-school best friend.",
      "author": "Moira MacDonald"
    },
    {
      "text": "'Booksmart' offers a delightful fantasy set in a world where everyone is pretty smart, awfully nice and very funny.",
      "author": "Scott Mendelson"
    },
    {
      "text": "It may begin with a scattered, cartoonish approach, but Booksmart eventually blooms into something entirely and beautifully its own.",
      "author": "Jordan Raup"
    },
    {
      "text": "The characters may appear as assigned archetypes on the surface, but the screenplay allows growth and movement, even within the smallest moments.",
      "author": "Matthew Passantino"
    },
    {
      "text": "A rare treat: a perfect film. Smart, funny, wise, sparkling with wit both visually and in its snappy dialogue. A self-assured directorial debut from Olivia Wilde, confident and effortless. Pure joy.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Booksmart casually recontextualizes the coming-of-age story for the modern era, giving us a clever comedy that feels poignant and current and, well, smart.",
      "author": "Britt Hayes"
    },
    {
      "text": "It goes without saying that Booksmart is one of the best comedies of the year. I'd go a step further and call it one of the best comedies of the last several years.",
      "author": "Dirk Libbey"
    },
    {
      "text": "Wilde delivers a confident feature directorial debut, mixing humour, embarrassment and poignancy to crowd-pleasing effect.",
      "author": "Tim Grierson"
    },
    {
      "text": "Its substance is scantly developed, its clear and simple premise dismayingly oversimplified. Despite the emotional authenticity of the protagonists' dilemma, their journey comes off as a fantasy.",
      "author": "Richard Brody"
    },
    {
      "text": "I like the general lack of meanness in \"Booksmart.\" The party-all-night premise may be as old as the hills, but the script has been successfully finessed as a slice of the here and now, idealized but full of life.",
      "author": "Michael Phillips"
    },
    {
      "text": "First-time director Olivia Wilde carves a note-perfect millennial portrait rife with specificity.",
      "author": "Ella Kemp"
    },
    {
      "text": "Every generation deserves their own definitive teen movie, although I'm proof that you never stop appreciating them, even though I'm 41. Booksmart will speak to teens of 2019 and let the rest of us feel like teenagers again, for a little while.",
      "author": "Fred Topel"
    },
    {
      "text": "Olivia Wilde comes out swinging with not only one of the best movies of the year, but one of the best high school movies of all time.",
      "author": "Katie Walsh"
    },
    {
      "text": "If the storyline doesn't so much unfold as burst out in glittery puffs - and if music cues seem to make up about 40 percent of the plot-it's still an endearing kind of chaos.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "\"Booksmart\" is the best movie of 2019 so far. Funny, heartfelt, and entertaining.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Booksmart is funny, fast-paced, well-made, full of heart, and an excellent place to find solid performances, as well as breakout stars.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Booksmart is a brilliant teen flick and a savvy female-fronted comedy and an exceptional lesbian film - and it's also just a really smart, really funny movie. It transcends every genre it's a part of.",
      "author": "Heather Hogan"
    },
    {
      "text": "It doesn't try to be the \"female\" version of anything, but nonetheless delivers a story that's feminine, raunchy, silly, sweet, inclusive, and incredibly specific, all at once.",
      "author": "Anne Cohen"
    },
    {
      "text": "Olivia Wilde's smashing feature directing debut is a femcentric spin on Freaks and Geeks that makes this laugh riot the smart choice for anyone looking for a comedy that's outrageously entertaining and quietly revolutionary at the same time.",
      "author": "Peter Travers"
    },
    {
      "text": "Olivia Wilde's coming of ager is full of heart, lol laughs and, not so coincidentally, smarts.",
      "author": "Joanna Langfield"
    },
    {
      "text": "The movie doesn't just have its pulse on what today's youth are going through, it goes a step further: it is defining a generation.",
      "author": "Jason Guerrasio"
    },
    {
      "text": "The best, brightest coming-of-age comedy in years. An easy A+.",
      "author": "Neil Pond"
    },
    {
      "text": "Smart, funny, and empathetic, \"Booksmart\" is a love letter to the blissfully uncool dorks among us.",
      "author": "Adam Lubitow"
    },
    {
      "text": "With its frantic pace and ultimate sentimentalism, \"Booksmart\" enters the field of high-school movies with considerable originality.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "The worst thing you can say about the brilliantly zany teen comedy \"Booksmart\" is you only get an hour and 45 minutes with its quirky student body.",
      "author": "Brian Truitt"
    },
    {
      "text": "Wilde vigorously made this picture, finding the tone and teasing out the laughs and the performances with a combination of bold and subtle strokes.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The first [half] sees Molly and Amy falling into the usual tropes these comedies love exploiting for laughs while the second mines deeper to show the [hidden] poignant truths.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Booksmart puts a fun, fresh and female spin on the high school coming-of-age comedy with a hilarious script and excellent performances from its leads.",
      "author": "Molly Freeman"
    },
    {
      "text": "Hilarious and intelligent in equal measure, \"Booksmart\" is the best film of 2019 so far, establishing Olivia Wilde as a powerhouse director in the process.",
      "author": "Joey Magidson"
    },
    {
      "text": "The goofy and amiable teen humor is a huge departure from the 1980s when misogyny and movies like \"Porky's (1981)\" were the norm. This is a very good thing.",
      "author": "Robin Clifford"
    },
    {
      "text": "Pretty much flawless, and that's saying something given the potential for something significantly less than that.",
      "author": "David N. Butterworth"
    },
    {
      "text": "This is a broad appeal comedy that realistically captures the weird idiosyncrasies of female friendship, bottles it up and sells it for the price of a movie ticket.",
      "author": "Matt Oakes"
    },
    {
      "text": "Just when you think you didn't need another 'last night of high school before graduation' movie, Olivia Wilde's Booksmart comes along and bursts through as one the best, funniest and most heartwarming of them ever made.",
      "author": "Erik Anderson"
    },
    {
      "text": "With its razor sharp script and electric lead performances, it could very well unseat the likes of Superbad and Mean Girls as the funniest high school comedy of the 21st century.",
      "author": "Brent Hankins"
    },
    {
      "text": "Such is the wise and humbling rule of \"Booksmart\": try as you might to flee your regular self, you always end up bumping into it.",
      "author": "Anthony Lane"
    },
    {
      "text": "Believe the hype. Booksmart  is one of the best films of the year. A solid film about the strength of female friendship and high school.",
      "author": "Jazz Tangcay"
    },
    {
      "text": "Olivia Wilde gets rich into heads of young teen girls with her directorial debut. Billie Lourd is outrageously gorgeous as Gigi and Bernie Feldstein and Kaitlyn Dever have a cinema sisterhood that will go down in history. Welcome back to H.S.",
      "author": "Carla Renata"
    },
    {
      "text": "\"Booksmart\" may have anticipated this year's college admissions scandal...but it derives its humor from the class killjoys' laser focus on letting their freak flags fly in the last possible moments of their senior year.",
      "author": "Laura Clifford"
    },
    {
      "text": "Booksmart manages to be the funniest high school comedy in years while never losing sight of its powerful emotional core.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Actor-turned-director Olivia Wilde (shockingly, this is her behind-the-camera feature debut) shows off something rarer than technique or comic timing. She's got loads of compassion and has somehow managed to make a high-school movie without villains.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "A female buddy film in the guise of a high-school partying movie, Booksmart is endlessly funny and outrageous, yet always grounded by its realistic central relationship.",
      "author": "Caryn James"
    },
    {
      "text": "A smart, authentic and impressively acted entry into a genre that so rarely does justice to young women, Booksmart marks a striking debut for director Olivia Wilde.",
      "author": "Shaun Munro"
    },
    {
      "text": "Booksmart is an unapologetically bawdy but smart and touching reflection of what female adolescence means today; it's like if Lady Bird was written by Sarah Silverman.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Incredibly sharp and witty, Booksmart is 2019's best film. The two are the perfect pair of friends, Dever and Feldstein have unmatched chemistry.",
      "author": "Ben Rolph"
    },
    {
      "text": "If this is just the beginning of her journey as a director, one can only imagine the gems Wilde has in store.",
      "author": "Alex Saveliev"
    },
    {
      "text": "Booksmart has a cock-sure strut - it's a film that's big on confidence, thicc with swagger and it hums with the virility of youth",
      "author": "Ali Gray"
    },
    {
      "text": "Booksmart is audacious, authentic, and destined to become a new coming-of-age classic.",
      "author": "Alexia Amoriello"
    },
    {
      "text": "It's smart, so very funny, and beautifully directed by Olivia Wilde.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Feldstein is an absolute revelation.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "In a genre that is generally dominated by similar white nerdy male protagonists, Booksmart is an experience that's more queer, more diverse and more female-centered than anything remotely comparable.",
      "author": "Joi Childs"
    },
    {
      "text": "Booksmart possesses a polish that places it well within the upper echelon of recent high school sex comedies.",
      "author": "Nick Johnston"
    },
    {
      "text": "Walking out of Booksmart, I knew two things: Beanie Feldstein is going to be a star, and Booksmart has effortlessly earned its place in the classic teen film canon. I can't wait to watch it again.",
      "author": "Jourdain Searles"
    },
    {
      "text": "Booksmart feels baked in sexual diversity.",
      "author": "Li Lai"
    },
    {
      "text": "Booksmart is the smart, funny, heart-warming comedy of the decade.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Molly and Amy's performances are what make Booksmart tick. There is no superficiality, as these two actresses are comfortable and feed off of one another's energy.",
      "author": "Valerie Complex"
    },
    {
      "text": "A gratifying film about sassy, intelligent women, crafted with an entertaining script and a deliberate vision, Olivia Wilde's Booksmart delivers as promised.",
      "author": "Amanda Sink"
    },
    {
      "text": "Booksmart is inclusive and progressive without feeling forced and announces Wilde, an actor who hasn't always found her groove on screen, as a major director, one of the more impressive behind-the-camera transitions I have seen for a while.",
      "author": "Benjamin Lee"
    },
    {
      "text": "With one of the best on-screen friendships I've ever seen, Booksmart is funny, loud, messy, warm, and incredibly performed by its all-star cast.",
      "author": "Kevin L. Lee"
    },
    {
      "text": "Carries off its crazy antics in an entertaining way.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Like the best of its genre, it feels both of the moment and totally classic.",
      "author": "Angie Han"
    },
    {
      "text": "A raunch fest that pulls no punches and gives us all hope that boundary pushing comedy need not include hate or regressive ideas to be absolutely hysterical.",
      "author": "Ed Travis"
    },
    {
      "text": "With a strong focus on female friendship, Olivia Wilde's directorial debut, Booksmart, is the next great classic high school comedy.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Wilde's keen directorial eye crafts a film that's almost verite-level in its authenticity and portrayal of teen girls today.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Booksmart is a lovingly endearing piece - wickedly funny and adventurous - and a jaw-dropping directorial debut from Olivia Wilde.",
      "author": "Robert Daniels"
    },
    {
      "text": "Booksmart manages to be inclusive and progressive, without being precious about anything or sacrificing an ounce of humor.",
      "author": "Emily Yoshida"
    },
    {
      "text": "Olivia Wilde's work here will leave you eagerly anticipating what she does next.",
      "author": "Natalie Mokry"
    },
    {
      "text": "Olivia Wilde makes her directorial debut with Booksmart, a whip-smart coming-of-age comedy for every girl who's ever been called a \"try-hard.\"",
      "author": "Kristy Puchko"
    },
    {
      "text": "\"Booksmart\" is both an antidote to a male-dominated genre, and a welcome addition to the collection.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Booksmart is one of the best coming-of-age films of all time. It takes all of the typical teen movie tropes and reinvents them.",
      "author": "Scott Menzel"
    },
    {
      "text": "The plot may sound like rudimentary teen movie fare, but its execution is where its genius comes through.",
      "author": "Lindsey Romain"
    },
    {
      "text": "It's almost unfathomable that this is anybody's first feature. \"Booksmart\" is a perfectly constructed and confident debut that already has me excited to see what Wilde does next.",
      "author": "Matt Shiverdecker"
    },
    {
      "text": "By far, one of the most perfect coming-of-age comedies I have ever seen.",
      "author": "Yolanda Machado"
    },
    {
      "text": "Booksmart is Olivia Wilde's directorial debut, and a declaration. This is a movie that knows exactly what it is, created by a group of women who know exactly what they want to say.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "An utter delight. Booksmart rocks an electric energy, non-stop laughs, and tons of heart. Kaitlyn Dever and Beanie Feldstein are true gems and they're also backed by a great ensemble. Quite the feature directorial debut for Olivia Wilde.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "For Booksmart being Olivia Wilde's directorial debut, she expresses the WILD through her style.",
      "author": "Rendy Jones"
    },
    {
      "text": "Exhibiting a raucous sense of humor that has no qualms with shifting gears from the gross-out to the surreal, Wilde hints we've only seen a fraction of her talent.",
      "author": "David Crow"
    },
    {
      "text": "Booksmart is a breath of fresh air that will leave audiences cheering.",
      "author": "Ashley Menzel"
    },
    {
      "text": "Sex, drugs, and peril flood just about every turn, each of which pivots at a manic, sweaty pace that deftly mirrors the giddily nervous energy of its leads.",
      "author": "Randall Colburn"
    },
    {
      "text": "Every generation needs a new anthem, and by and large, Olivia Wilde has done that with her exhilarating debut, Booksmart, that is going to absolutely destroy and dazzle audiences.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Booksmart excels at celebrating a friendship strong enough to guarantee that the party never really ends until the credits roll.",
      "author": "Eric Kohn"
    },
    {
      "text": "'Booksmart' is funny, nerdy, silly and an excellent debut for first-time director Olivia Wilde who has found her genre.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "Every generation needs its own rowdy high school comedy, and Millennials deserve one that treats the anxieties teens have been grappling with for millennia with the same urgency that Jerry Bruckheimer would bring to a high-stakes action movie.",
      "author": "Peter Debruge"
    },
    {
      "text": "A hilarious, blazingly paced teen comedy that also happens to mark the feature directing debut of Olivia Wilde.",
      "author": "John DeFore"
    }
  ],
  "release_year": 2019,
  "duration": 102,
  "genres": [
    "Comedy",
    "LGBTQ+"
  ],
  "synopsis": "Academic overachievers Amy and Molly thought keeping their noses to the grindstone gave them a leg up on their high school peers. But on the eve of graduation, the best friends suddenly realize that they may have missed out on the special moments of their teenage years. Determined to make up for lost time, the girls decide to cram four years of not-to-be missed fun into one night -- a chaotic adventure that no amount of book smarts could prepare them for.",
  "popularity": 7.7,
  "poster_url": "https://image.tmdb.org/t/p/original/2aSxRDmisJP90H3S0aocyuQIe4z.jpg"
}