{
  "movie_name": "Bridesmaids",
  "movie_id": "bridesmaids_2011",
  "total_reviews": 293,
  "reviews": [
    {
      "text": "Every lady who has ever been a bride, a bridesmaid, or a maid of honor should see this.  You will either laugh at the moments that remind of your own wedding party or laugh thankfully that none of these characters were anyone of you or someone else.",
      "author": "Don Shanahan"
    },
    {
      "text": "The movie doesn’t treat its female characters as exceptions to the absurd comedic rule that women aren’t funny, but for moviegoers devoted to that archaic idea, it will certainly prove them wrong.",
      "author": "Brian Eggert"
    },
    {
      "text": "Unforgivable two hours and a half.  [Full review in Spanish]",
      "author": "Rene Jordan"
    },
    {
      "text": "The number of jokes, visual gags, clever line readings, and insane set pieces crammed into just 2 hours is astonishing.",
      "author": "Cody Dericks"
    },
    {
      "text": "With laugh-out-loud displays of pettiness, pride and passive-aggression, the movie incisively examines the delicate dynamics of a female friendship group.",
      "author": "Yasmin Omar"
    },
    {
      "text": "Ten years later, Bridesmaids remains a cinematic classic and one of the best comedy movies of all time.",
      "author": "Danielle Solzman"
    },
    {
      "text": "BRIDESMAIDS told a more complex story of female friendship, one that centered...well, female friendship, with men taking a secondary role.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Bridesmaids is a film for everyone and one that features some of the finest comedy set-pieces since Mary put spunk in her hair.",
      "author": "Owen Nicholls"
    },
    {
      "text": "Wiig's work as the neurotic but mostly well meaning Annie is a breakthrough, proving that being funny and having feelings are not mutually exclusive.",
      "author": "Richard Crouse"
    },
    {
      "text": "Once the dilemmas hit and the lead character begins her downward spiral, the joke-a-minute pacing from the introduction is lost.",
      "author": "Mike Massie"
    },
    {
      "text": "Modestly flawed yet consistently funny.",
      "author": "Richard Propes"
    },
    {
      "text": "I'm going to start with a time saver, with a two-word litmus test of whether or not \"Bridesmaids\" is for you. If you giggle, go see this. If you make a face like you smell something rancid, sit this one out. And these two words are...sink diarrhea.",
      "author": "Brent McKnight"
    },
    {
      "text": "A tale of female anxiety deliriously and freakishly off the leash, it's as close to a perfect multiplex comedy as they come.",
      "author": "Felicia Feaster"
    },
    {
      "text": "The film is probably about 20 minutes too long and not every gag plays as well as it should have. Still, I found myself laughing a lot during \"Bridesmaids.\"",
      "author": "Micheal Compton"
    },
    {
      "text": "Bridesmaids is, in equal parts, bawdy and authentic, all the way through.",
      "author": "Kelly Jane Torrance"
    },
    {
      "text": "It's a movie about women going berserk over a wedding. Easy non-feminist laughs are built right in there, and milked for all they're worth. No amount of sad female faces during lugubrious pop song interludes can make this more meaningful than it is.",
      "author": "Eileen Jones"
    },
    {
      "text": "Bridesmaids manages to take a seen-before storyline and turn it into something unpredictable, entertaining, and so completely wrong it feels right -- and very satisfying.",
      "author": "Margherita Pellegrino"
    },
    {
      "text": "Really unsatisfying, mostly because the script by Ms. Wiig and Annie Mumolo completely ignores the movie's major issue: class.",
      "author": "Sarah Manvel"
    },
    {
      "text": "Kristen Wiig has written a lead role for herself with some great awkward moments usually regulated for fools of the male variety. It's nice to see women can be just as boneheaded when the situation calls for it.",
      "author": "Kiko Martinez"
    },
    {
      "text": "The director is sitcom vet Paul Feig but the auteur is star and co-writer Kristen Wiig, who takes center stage after displaying flashes of fuzzy brilliance.",
      "author": "Fernando F. Croce"
    },
    {
      "text": "Funny? Yes. But is revolting raunch really a step forward for women in Hollywood?",
      "author": "Alexandra MacAaron"
    },
    {
      "text": "Sure, it neatly avoids a lot of the fluff found in many chick flicks and replaces it with crass shenanigans, but it adds touching moments when they're needed most, providing for a smart, less clichéd comedy.",
      "author": "Candice Frederick"
    },
    {
      "text": "Right now, Bridesmaids is the funniest movie of the year.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Bridesmaids has all the humanity that [Judd] Apatow projects usually lack.",
      "author": "Lindy West"
    },
    {
      "text": "Women are complex creatures, and Bridesmaids presents the reality of female friendship with a level of seriousness and due care that is all the more affecting for being so rare.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "Although physical humor is a big part of the movie, Wiig shows a dramatic, darker side too. I have had high hopes for Wiig for a long time, and I'm really excited to see what she does next.",
      "author": "Jenni Miller"
    },
    {
      "text": "The result is a comedy on the competitive nature of female friendship that is aggressively uneven: sometimes smart, occasionally tender, and -- once or twice -- so self-consciously ballsy that I found myself chuckling out of sheer embarrassment.",
      "author": "John Lekich"
    },
    {
      "text": "The sweet, blissful buzz that accompanies the end of this comedy masterpiece will make you feel like you've just watched your own best friend get happily married.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "If the Hangover movies confronted dudes' sheer terror at their own poor impulse control, then Bridesmaids plunges straight into the female heart of darkness.",
      "author": "Giovanni Fazio"
    },
    {
      "text": "Bridesmaids allows its female leads to be smart, sexy, hilarious and loveable.",
      "author": "Roe McDermott"
    },
    {
      "text": "Full of heart, warmth and enough excrement to fill an all-white bridal shop.",
      "author": "Al Alexander"
    },
    {
      "text": "Through a combination of smart performances and scurrilous gags Bridesmaids yanks the buddy comedy from the hands of its traditional owners.",
      "author": "Anthony Quinn"
    },
    {
      "text": "All that straining for ribaldry feels a little sad, like Feig and his actors know they're sacrificing honesty for coarse bumptiousness.",
      "author": "Aaron Mesh"
    },
    {
      "text": "The dialogue, even when it's in questionable taste, snaps with intelligence.",
      "author": "Scott Renshaw"
    },
    {
      "text": "The big, brash laughs are coupled with a smart insight into women's friendships.",
      "author": "Kate Muir"
    },
    {
      "text": "Bridesmaids, co-written by Wiig and Annie Mumolo and directed by Freaks and Geeks creator Paul Feig, is as solid as any other comedy from Team Apatow.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "[Wiig's] is the comedy of panic, paranoia, madness and self-loathing, but her trick in the new film Bridesmaids is to remain composed even as her heart is shredded to confetti.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "For laughs per minute and a believable representation of how women interact, it's to be heartily recommended.",
      "author": "Veronica Lee"
    },
    {
      "text": "Kristen Wiig deserves much of the credit for Bridesmaids, but the laurels belong to Judd Apatow. He is the Billy Wilder of contemporary Hollywood and Bridesmaids is his Some Like It Hot.",
      "author": "Toby Young"
    },
    {
      "text": "Unashamedly smart... Bridesmaids has been hailed as a groundbreaking blow for American female cinema. That says a lot about the extent of Hollywood's current conservatism, but for now, Bridesmaids does nicely as a tonic corrective.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Wiig's characters may lose their lunch, but they never lose their heart.",
      "author": "Sean P. Means"
    },
    {
      "text": "It's a Hollywood truism that they almost never give Oscar nominations for slapstick comedy. They won't give one to Kristen Wiig for this movie, either. But they should.",
      "author": "Robert Horton"
    },
    {
      "text": "Hopefully next time they'll ditch the crass interludes and shoot one from the heart.",
      "author": "Sean Burns"
    },
    {
      "text": "Here is Kristen Wiig's star turn. She co-writes, co-produces and headlines Bridesmaids, playing a woman who's, I dunno, roughly 26 percent comedically psychotic, but not so loony that she goes over the edge from sympathetic to repellent.",
      "author": "John Serba"
    },
    {
      "text": "Bridesmaids produces frequent waves of hilarious vulgarity as it tells a sweet, endearing story about a woman suffering through a pre-mid-life crisis.",
      "author": "Dann Gire"
    },
    {
      "text": "Bridesmaids is grossly funny.",
      "author": "Mal Vincent"
    },
    {
      "text": "The result is a very funny movie, part indie comedy and part frat-girl raunch (it was co-produced by Judd Apatow), that manages to get at some of the sly truths of female friendship.",
      "author": "Jay Stone"
    },
    {
      "text": "At 125 minutes, Bridesmaids is unusually long for what is supposedly a raunchy comedy, and that's because the story steadfastly builds characters instead of knocking them down.",
      "author": "Craig Mathieson"
    },
    {
      "text": "Bridesmaids won't be the defining moment of Wiig's career, but it serves to prove that the actress has the potential to carry a movie. She just needs a comedy worth carrying.",
      "author": "Kirk Baird"
    },
    {
      "text": "This is one smart script, brought to life by director Paul Feig and working on many levels. Where it sometimes works best is in the gutter.",
      "author": "Michael Smith"
    },
    {
      "text": "Bridesmaids is being touted as a female version of The Hangover. That's an unfair bar to set, given how easily these ladies sail over it.",
      "author": "Alynda Wheat"
    },
    {
      "text": "The star and co-writer of Bridesmaids, Kristen Wiig, puts herself and her female co-stars through the comedy wringer.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Kristen Wiig is brilliant.",
      "author": "Ryan Carey"
    },
    {
      "text": "Bridesmaids is likely to be a hit with both women and men, being half formula chick-flick, half raunchy comedy of humiliation. It's hilarious -- and too bifurcated to be satisfying.",
      "author": "David Edelstein"
    },
    {
      "text": "Onetime Saturday Night Live castmates Wiig and Rudolph make Annie and Lillian's friendship believable. Which is why Annie's shenanigans are sad -- and hilarious.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Over the past couple of years, the R-rated comedy genre seemed to stale a bit, suffering a slight affliction of monotony. Seems all it needed was a woman's touch.",
      "author": "Matthew Odam"
    },
    {
      "text": "A terrific comedy, zany, ribald and fearless in just about every way you'd want a comedy to be.",
      "author": "Will Leitch"
    },
    {
      "text": "Bridesmaids is a reminder that fresh content is still alive and well, especially when it's delivered by a group of talented actresses.",
      "author": "Benjo Colautti"
    },
    {
      "text": "There's a full spectrum of emotions on show: how many comedies with a gag involving projectile vomit and diarrhoea can say that?",
      "author": "Ali Gray"
    },
    {
      "text": "El humor de Damas en guerra se parece por momentos al de la comedia masculina más guarra, escatología incluida, aunque también hay lugar para los sentimientos y hasta el romanticismo.",
      "author": "Enrique Buchichio"
    },
    {
      "text": "It shows the dark side of people to a surprising extent for a comedy. It isn't exactly a black comedy or a dark comedy, but it does explore the way that friends can sometimes become jealous and sabotage each other.",
      "author": "Robert Roten"
    },
    {
      "text": "Kristen Wiig, between her screenplay and fearlessly funny performance, gives nothing less than a tour de force.",
      "author": "Michael Dequina"
    },
    {
      "text": "Wiig, who's been underused in the past in movies like MacGruber and Paul, proves she's as good with a withering dialogue as she is with oddball characters and physical humor.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Bridesmaids is a very funny movie, with interesting characters and great performances, but the film's pacing issues make it more of a chore to get through than expected.",
      "author": "R.L. Shaffer"
    },
    {
      "text": "I like that Bridesmaids aspires to be more than just a dumb comedy, but that doesn't mean it needs to belabor its point for what feels like eons.",
      "author": "Gabe Leibowitz"
    },
    {
      "text": "Paul Feig's Bridesmaids ends up living in the memory like most weddings do; you went, you had a pleasant time, and unless somebody mentions the happy couple, you never think about the experience again.",
      "author": "Perry Seibert"
    },
    {
      "text": "I laughed almost without pause; at several points I made horselike snorting sounds that hurt the insides of my nose.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "Whether it says something incisive about female friends and their inability to truly feel comfortable and rise above petty jealousies and competition, Bridesmaids never achieves the wolf pack camaraderie that The Hangover executes so naturally.",
      "author": "Jordan Hiller"
    },
    {
      "text": "There are things to like here and the idea is a noble one. But in execution, \"Bridesmaids\" is a typical chick flick just with some extra rude words and vomit.",
      "author": "Laurence Boyce"
    },
    {
      "text": "At 125 minutes, 'Bridesmaids' is long for a comedy, but it earns its running time by fully developing its characters and their relationships ...",
      "author": "Greg Maki"
    },
    {
      "text": "The movie won't change your life or grab a fistful of Oscar nominations come next winter. But it will make you laugh, hard and often, and it proves that sometimes girls just want to have fun.",
      "author": "Leah Rozen"
    },
    {
      "text": "... a girl-bonding romp filled equally with outlandish bridal showers and alcohol-fueled slapstick aggression, grand romantic gestures and furtive sex, high couture and low blows.",
      "author": "Sean Axmaker"
    },
    {
      "text": "A bridal-shower blast of brassy hilarity and a cast of ferociously funny females.",
      "author": "Neil Pond"
    },
    {
      "text": "Bridesmaids turns the gross-out comedy genre on its head and emerges bigger and better than its predecessors. It boasts unforgettable breakout performances and is the most important comedy of the year. And the best.",
      "author": "Ed Gibbs"
    },
    {
      "text": "It is liberating to see a woman-centered comedy of misbehavior; better still to see half a dozen women share in demolishing the froufrou imperative of American dream weddings; but best of all to hear Wiig voice her character's real thoughts.",
      "author": "Stuart Klawans"
    },
    {
      "text": "It's bawdy and a bit rowdy -- the comedy equivalent of a Lady Remington shaver in that it's just as good as the original Remington for men, only a bit smaller -- and pink.",
      "author": "Nathalie Atkinson"
    },
    {
      "text": "Wiig's brand of comedy is loud, proud and just gosh darned funny.",
      "author": "Stella Papamichael"
    },
    {
      "text": "Never does Bridesmaids ever aim for truly biting commentary, opting to settle instead for a series of poop jokes and scenes of social awkwardness.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "Is it funny? Yes, at times, and its female-centric theme will appeal to many women. I just hope they have the patience to trudge through the slow spots and story detours. Bridesmaids, which might as easily bear the title Women Behaving Badly",
      "author": "Leonard Maltin"
    },
    {
      "text": "It's one I intend to re-visit over and over if only to bask in Wiig's understated sexual appeal...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "By filling the plot hole of Lillian's cluelessness with explosive diarrhea, the film undermines the whole \"Apatowian Female Comedy\" idea.",
      "author": "Stephen Himes"
    },
    {
      "text": "Bridesmaids achieves, through the laughs, a kind of poignancy and empathy.",
      "author": "Jason Solomons"
    },
    {
      "text": "At its best, Bridesmaids does that wonderful thing: tell the truth, indelicately.",
      "author": "Antonia Quirke"
    },
    {
      "text": "Indeed pretty much a rom-com in the end - but hugely enjoyable, fresh and rude, both touching and funny, all the way.",
      "author": "David Sexton"
    },
    {
      "text": "The comedy to beat this year.",
      "author": "Alex Zane"
    },
    {
      "text": "It's something old, something new, something borrowed and (cough) something very, very blue.",
      "author": "David Edwards"
    },
    {
      "text": "There is real depth to the characterizations and friendships. It is so funny because it is all so painfully real.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "As it turns out, fart and poo gags ARE universal, as demonstrated by the mostly female audience completely losing it during some of the more off-colour scenes.",
      "author": "Tim Martain"
    },
    {
      "text": "Sharply written and winningly performed, it delivers more laughs than any movie released this year, but also, the longer it goes on, develops into a surprisingly poignant evocation of self-scuppering loneliness.",
      "author": "Sukhdev Sandhu"
    },
    {
      "text": "The full horror of being a bridesmaid is shown, but Wiig persuades you there is something genuinely loving and sisterly to be found at the end of this incredible ordeal.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Bridesmaids strives a little too hard in places to show that women can do outrageous gross-out comedy too - but it remains the best chick flick in years.",
      "author": "Jason Best"
    },
    {
      "text": "By treating funny women as normal people, Wiig has crafted a game-changing comedy that's even better than The Hangover.",
      "author": "Karen Krizanovich"
    },
    {
      "text": "Really, bottom line: it's the best thing Apatow's put his name to in years.",
      "author": "Kevin Maher"
    },
    {
      "text": "Impressively directed and brilliantly written, this is a consistently hilarious and superbly acted comedy that finally gives Kristen Wiig the lead role she deserves.",
      "author": "Matthew Turner"
    },
    {
      "text": "Bridesmaids features some genuinely funny laugh out loud moments...",
      "author": "Graham Young"
    },
    {
      "text": "Move over Tina Fey, there's a new queen in town.",
      "author": "Matt Risley"
    },
    {
      "text": "An effortless blend of bad taste and good humour with a wholly believable, often very touching emotional core, all centred around one of the finest star-making comic performances in recent memory.",
      "author": "Tom Huddleston"
    },
    {
      "text": "A guaranteed good time, be you lady or gentleman.",
      "author": "Dominic Corry"
    },
    {
      "text": "It is artistically dishonest and embarrassingly naive to grant the status of \"classic\" to something only newly born. For a film to be called a classic, it must first stand...oh hell, who am I kidding? Bridesmaids is an instant classic.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "A confident, self-assured comedy with nothing to prove. Fresh, occasionally foul-mouthed, and funny.",
      "author": "Catherine Bray"
    },
    {
      "text": "Wiig is pitch-perfect ... THE best unisex night out at the cinema you'll have in ages - this is the best proposal yet, and an invite you shouldn't decline",
      "author": "Lisa Giles-Keddie"
    },
    {
      "text": "Finally, a female ensemble comedy that balances realistic characters with smart laughs and side-splitting farce.",
      "author": "Anna Smith"
    },
    {
      "text": "One of the funnier comedies (of the) year (certainly better than The Hangover Part II), but the flat patches make the film... feel a tad long.",
      "author": "Matt Neal"
    },
    {
      "text": "Completely and utterly honk-like-a-goose hilarious.",
      "author": "Robbie Collin"
    },
    {
      "text": "Bridesmaids is just fall-down funny.",
      "author": "Jim Schembri"
    },
    {
      "text": "I suspect that Wiig is funnier when she's not so frenetically intent on finding 101 ways to make a fool of herself.",
      "author": "Sandra Hall"
    },
    {
      "text": "The real problem is that Annie veers dangerously close to being unlikeable although Kristen Wiig's performance is so winning that she just about gets away with it.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "It also made me laugh so much I had a coughing fit and saw stars -- and I can't remember the last time a film of any \"gender\" made me do that.",
      "author": "Clem Bastow"
    },
    {
      "text": "Despite its flaws there's no denying that it is actually very funny and that Wiig gives a powerhouse performance full of nuance and wit.",
      "author": "Glenn Dunks"
    },
    {
      "text": "While packed with hilarity, the laughs are always grounded in Kristen Wiig's heartfelt and utterly relatable performance.",
      "author": "Cara Nash"
    },
    {
      "text": "Stars Kristen Wiig, Maya Rudolph and Rose Byrne have long deserved vehicles to showcase their talents, and here they're finally afforded the opportunities their schlubby male contemporaries were offered a long time ago.",
      "author": "Simon Miraudo"
    },
    {
      "text": "As the star and co-writer of Bridesmaids Kristen Wiig finally gets to display her full range and the results are brilliant.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "Not the chick flick it sounds like, Bridesmaids is The Hangover with skirts... hilarious and a bit of a miracle at a time when a major studio tries to force-feed audiences such cookie-cutter dreck as a PG-13 remake of Arthur.",
      "author": "James Verniere"
    },
    {
      "text": "With its often raw humour, rough language and soft heart, Bridesmaids is not a frilly girlie movie, more a busty, raunchy strut-it film",
      "author": "Andrew L. Urban"
    },
    {
      "text": "It's funny and it's charming, largely due to Kristen Wiig's great sense of timing and the smart comic script she has penned with Annie Mumolo",
      "author": "Louise Keller"
    },
    {
      "text": "I'm sure many will see it for its gross-out moments but I was more impressed with how the film captures the fragility of its imperfect characters.",
      "author": "Matthew Toomey"
    },
    {
      "text": "The funniest movie of the year. Unlike 'Hangover,' the film doesn't rely on sexism, homophobia and racial epithets to hit a punch line.",
      "author": "Clay Cane"
    },
    {
      "text": "The film veers a bit wildly between silly playfulness and extreme rudeness, but it keeps us hooked by maintaining believable characters.",
      "author": "Rich Cline"
    },
    {
      "text": "Bridesmaids delivers sweetness and sass.",
      "author": "Charles Koplinski"
    },
    {
      "text": "It's uneven, unwieldy and overlong, but if it's yucks you're after you'll find them in abundance in a side-splitting comedy that lifts the veil on every wedding's unsung heroines.",
      "author": "Neil Smith"
    },
    {
      "text": "It's a pleasant, funny couple of hours at the movies with a few great moments.",
      "author": "David Poland"
    },
    {
      "text": "While undoubtedly formulaic, it's head and shoulders above most of Hollywood's recent comedy output.",
      "author": "Charlie Lyne"
    },
    {
      "text": "It ends beautifully, the final segments as witty and as poignant as any I could have imagined.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "See? Women can be funny, too. And raunchy, brazen and, sometimes, profound.",
      "author": "Linda Cook"
    },
    {
      "text": "Bridesmaids falters long before the alter.",
      "author": "Roger Tennis"
    },
    {
      "text": "The label is Apatow but the trademark raunch plays second, maybe third fiddle to a thoughtful examination of personality conflict.",
      "author": "Rob Humanick"
    },
    {
      "text": "Kristen Wiig deserves some kind of award for her dexterously funny and touching performance",
      "author": "James Kendrick"
    },
    {
      "text": "The movie is uneven and lurching, but it provides many laughs.",
      "author": "David Denby"
    },
    {
      "text": "...Bridesmaids would've been far, far better off had it been trimmed down to a more manageable running time.",
      "author": "David Nusair"
    },
    {
      "text": "Apatow continues his assault on gentility and good taste with this roll in the gutter that degrades women. The sad part is that there is a good, sweet movie lurking here behind all the vulgarity.",
      "author": "Tony Medley"
    },
    {
      "text": "The film features at least four major comic set pieces that are quite funny, and Wiig is at the center of each of them (Parental Content Review also available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "Kristen Wiig proves she can lead an ensemble comedy that's as raunchy as anything her male counterparts produced.",
      "author": "John Wirt"
    },
    {
      "text": "Taffeta + Digestive Trouble + Feelings = Everyone wins!",
      "author": "Grae Drake"
    },
    {
      "text": "This movie is funny both as physical gag-based comedy and character-built, smart-person comedy in a nonstop, laughing-over-dialogue, smart-stupid, sweet-gross, heartfelt-raunchy way that's perfectly in keeping with the Judd Apatow brand.",
      "author": "Dave White"
    },
    {
      "text": "... brings to mind Renee Zellweger films about ugly ducklings that long to be seen for their inner beauty. Big difference: In \"Bridesmaids,\" the poufy swan poops in the street.",
      "author": "Glenn Lovell"
    },
    {
      "text": "Bridesmaids is far from a seamless comedy masterpiece, but what does work eventually outweighs what doesn't quite fit together.",
      "author": "Lori Hoffman"
    },
    {
      "text": "I liked Bridesmaids well enough -- with some reservations -- but I found it to be neither groundbreaking nor terribly funny.",
      "author": "Ken Hanke"
    },
    {
      "text": "Something even rarer than an American film with a woman as protagonist: an American film comedy that is absolutely and genuinely funny.",
      "author": "Tim Brayton"
    },
    {
      "text": "Kristen Wiig is funny, sweet and pathetic while her life falls apart, the ensemble works well, it's a comedy unafraid to get disgusting and then get dramatic, and just about every scene works.",
      "author": "Cole Abaius"
    },
    {
      "text": "Despite all the hype about how gross and profane it was, this movie still entertained with a sweet story about friendship.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "I can die happy, because I got to hear Don Draper say, \"Cup my balls.\"",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Cringe-inducing and often very, very funny.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "The attempt to apply the male slob template to female characters is dispiriting, and it's more depressing to think it will probably be a great success,",
      "author": "Frank Swietek"
    },
    {
      "text": "...one of the most moronic, ineptly made and oft-times revolting movies to be released this year.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Bridesmaids is not a movie for those looking for a pleasant, uneventful night out at the movies. Yes, it's touching. And yes, it resonates with a heart of gold. But it's also awkward, raunchy, and disgusting. Just like real life.",
      "author": "Frank Wilkins"
    },
    {
      "text": "The great American mainstream comedy of the year.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Bridesmaids moves with poise and confidence, making the hard business of earning honest laughs look easy.",
      "author": "Ethan Alter"
    },
    {
      "text": "The Apatow formula... now with women!",
      "author": "Robert Denerstein"
    },
    {
      "text": "The best female-driven, R-rated comedy of all time. Yes, even better than 'The Sweetest Thing' and 'Outrageous Fortune.'",
      "author": "Jeff Bayer"
    },
    {
      "text": "Unfortunately, \"Bridesmaids\" bears the hallmark of Apatow's more recent, less successful efforts by being overlong (two hours and five minutes is way, way too long for a comedy like this) and having an uneven tone.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "An estrogen-fueled adventure featuring madcap hilarity ranging from the scatological to the sublime!",
      "author": "Kam Williams"
    },
    {
      "text": "I must take the time to single out Melissa McCarthy, who plays Lillian's future sister-in-law Megan. McCarthy, who stars in the current CBS television program \"Mike and Molly,\" is a fireball and steals every scene she's in.",
      "author": "Michael A. Smith"
    },
    {
      "text": "...in the first rank of Apatow movies; it may be the best so far. But more importantly, it's the first great Wiig movie. Let's hope there are lots more.",
      "author": "Philip Martin"
    },
    {
      "text": "Too many of its strained comic bits were more of a miss than a hit.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Take that John Belushi!",
      "author": "Scott Nash"
    },
    {
      "text": "Judd Apatow is one of its producers, but let's be quick to steer most of the credit away from him -- and even director Paul Feig -- and place it where it clearly belongs: at the feet of Kristen Wiig.",
      "author": "Matt Brunson"
    },
    {
      "text": "Kristen Wiig is a comic genius. Her performance as Annie, a thirtysomething woman whose life is in a tailspin, is ridiculously funny. We're talking virtuoso stuff here.",
      "author": "Cole Smithey"
    },
    {
      "text": "\"Bridesmaids\" is a great first step for Apatow in finding his feminine voice, and an even better launching pad for the hilarious Kristin Wiig.",
      "author": "Christopher Smith"
    },
    {
      "text": "Bridesmaids is about as far from a dopey Kate Hudson/Katherine Heigl rom-com as you can get. It is smart where those other pictures are dumb, perceptive where the others are cliched.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Bridesmaids is a stiletto-sharp, raunchy, no-holds-barred yuk-fest that stands as a worthy female counterpart to the likes of Wedding Crashers and The Hangover.",
      "author": "Tom Charity"
    },
    {
      "text": "This crude and raunchy comedy co-written by and starring \"SNL\" regular Kristen Wiig takes an honest look at female relationships and modern romance. This will be the top destination choice for girls' night out gatherings as the..",
      "author": "Keith Cohen"
    },
    {
      "text": "Bridemaids may make Kristen Wiig the first female'SNL' alum to ascend to the A-list.",
      "author": "Christian Toto"
    },
    {
      "text": "...strives to prove that gals can be as nasty as dudes, and when it comes to raunchy yuks, they are, until those darned realistic human emotions get in the way.",
      "author": "Corey Hall"
    },
    {
      "text": "It's not mean-spirited and doesn't hate its characters. Also, it understands the key lesson of the Farrellys and \"American Pie\" and Apatow's previous work: this sort of comedy works when it has heart, and fails when it doesn't.",
      "author": "Stephen Silver"
    },
    {
      "text": "Bridesmaids takes chances, colors outside the box, and breaks the unwritten rules for what a female-driven comedy can and can't do.",
      "author": "Rebecca Murray"
    },
    {
      "text": "it just felt like Bridesmaids had something to prove",
      "author": "Kevin Carr"
    },
    {
      "text": "Is this the female version of The Hangover? No - Bridesmaids is much funnier and way more heartfelt and human than that film.",
      "author": "Devin Faraci"
    },
    {
      "text": "Director Paul Feig has taken Wiig's and Mumolo's terrific script and given us the first, big comedy hit of the year. And that's not something to be taken lightly.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Features Kristen Wiig in a true tour de force that should elevate her to elite status among comediennes.",
      "author": "David Kaplan"
    },
    {
      "text": "The film's central friendship gives Bridesmaids a heart as big as its laughs. It pays particular attention to the details and realities of maintaining long term friendships, with special attention to the specifics of friendships between women.",
      "author": "Ian Buckwalter"
    },
    {
      "text": "Wiig has terrific audience rapport, a prerequisite for comics, and a squiggly way of seeming totally reasonable and altogether daft at the same time.",
      "author": "Peter Rainer"
    },
    {
      "text": "The only question is: Will Kristen Wiig ever be this good again? The answer is, let's hope so. Bridesmaids rocks. Hopefully, a movie star is born.",
      "author": "Tom Long"
    },
    {
      "text": "Cringe-inducing, uneven, juvenile, overlong and painfully unfunny. It's a witless blend of crudeness, rudeness and lewdness which sets a new low for American comedy.",
      "author": "Avi Offer"
    },
    {
      "text": "As much a coronation as a wedding, with Wiig emerging as a successor to Lucille Ball and Carol Burnett as the queen of knockabout comedy.",
      "author": "John Beifuss"
    },
    {
      "text": "A film about women and marriage may be virgin territory for [producer Judd] Apatow but the results are the same. The film is flat-out funny and is worth saying \"I do.\"",
      "author": "Gary Wolcott"
    },
    {
      "text": "Wiig and company have impeccable comic timing and the humor almost always comes from pain. It's very funny, has a great cast, and will probably hold up to repeated viewings.",
      "author": "Eric Melin"
    },
    {
      "text": "... hilariously funny, with an outlandish surprise around almost every corner.",
      "author": "Jim Lane"
    },
    {
      "text": "Think of it as a cinematic bouquet -- catch it.",
      "author": "Tyler Hanley"
    },
    {
      "text": "Crude but sincere comedy about friendship and confidence.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "In the end, Bridesmaids is touching and funny and a tiny bit sickening. Just like a real wedding.",
      "author": "Siri Agrell"
    },
    {
      "text": "On its surface, the film marries gross-out comedy and romantic comedy and will make you laugh out loud. Right underneath that is a truly wonderful movie about female friendship that's quite unlike anything else out there.",
      "author": "Liz Braun"
    },
    {
      "text": "Bridesmaids is an infectiously funny and bittersweet look at how life can change even the strongest of friendships.",
      "author": "Julian Roman"
    },
    {
      "text": "The warring impulses within Wiig set a wonderfully skittish tone for the painfully hilarious new movie Bridesmaids, a screwy tale of female friendship and wedding planning from hell.",
      "author": "Ella Taylor"
    },
    {
      "text": "Prepare yourself to hear this comparison often: Bridesmaids is like a female version of The Hangover. But don't ever expect those words, or any variation of them, to roll off my tongue.",
      "author": "Adam Tobias"
    },
    {
      "text": "Star Kristen Wiig (and she really should be a Star with a capital S after this breakthrough performance) finds the humanity usually missing from not just the chick flick but the modern comedy in general.",
      "author": "Brian Tallerico"
    },
    {
      "text": "[T]he kernels of a truly smart, truly honest, truly brilliant movie are here, and they get lost in what has become the standard Hollywood humiliation comedy...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "An instant R-rated classic that could give the upcoming Hangover Part II a run for its money.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "In general, the movie is so funny and bracingly honest that you can forgive the few moments where the momentum flags.",
      "author": "Rob Thomas"
    },
    {
      "text": "Whatever your opinion of the film is you'll definitely come out of it with a new respect for Wiig's comedy and acting skills.",
      "author": "Matthew Razak"
    },
    {
      "text": "Overall, the movie is a winner that should propel Wiig to a big-time movie career.",
      "author": "Bob Bloom"
    },
    {
      "text": "A bawdy, riotous godsend for folks who wanted to like The Hangover but just couldn't bring themselves to root for such an annoying box of a**holes.",
      "author": "Brian Juergens"
    },
    {
      "text": "Whether in a throwaway SNl skit or an overlong, uneven comedy such as this, Kristin Wiig has a knack for transforming something lackluster into something entertaining",
      "author": "Mike Scott"
    },
    {
      "text": "Hands down, Bridesmaids is the most consistently funny comedy of the year.",
      "author": "Elias Savada"
    },
    {
      "text": "Not only is it funny, it has enough regard for its characters to acknowledge some real emotion without overdoing the pathos.",
      "author": "Rich Heldenfels"
    },
    {
      "text": "One of the great comedies of the 21st century.",
      "author": "Willie Waffle"
    },
    {
      "text": "Last week Something Borrowed showed just how bad a chick flick can be; this week Bridesmaids takes a similar setup and shows how good it can be.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Sweet, goofy and unapologetically crass, it's a broad farce built on a solid foundation of human psychology.",
      "author": "Norman Wilner"
    },
    {
      "text": "Director Paul Feig takes the film in a laid-back, absurd and often improvised direction. Such looseness suits it -- while the plot may meander, it provides plenty of room for Wiig and her talented co-stars to cut loose.",
      "author": "Matt Soergel"
    },
    {
      "text": "This is chick humor with an edge.",
      "author": "Barbara Vancheri"
    },
    {
      "text": "After one bad and surprisingly misogynistic comedy after another written by women, here is finally one that doesn't alienate either sex and should easily garner a standing as one of the funniest films of 2011.",
      "author": "Erik Childress"
    },
    {
      "text": "I laughed harder than I have in quite some time.",
      "author": "Chris Hewitt"
    },
    {
      "text": "If this is only a chick flick, then call me a chick.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "It's the smaller, more observant moments in \"Bridesmaids\" that make it worth savoring.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Bridesmaids has so many funny moments that it can be forgiven for its excesses.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Kristin Wiig is sharp-yet-sweet in this shockingly scatological comedy, filled with bawdy, uninhibited babes.",
      "author": "Susan Granger"
    },
    {
      "text": "Bridesmaids boasts the kind of wit that works on either sex. It's the more personal moments that truly linger.",
      "author": "Bill Gibron"
    },
    {
      "text": "By the time two hours had dragged by, I felt a lot like I had sat through a five-hour wedding.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Kristen Wiig is the best sketch comic alive, and \"Bridesmaids\" should finally make her a movie star.",
      "author": "Joe Williams"
    },
    {
      "text": "Kristen Wiig has always been the bridesmaid, never the bride. Which is no longer a negative, as the emphatically unbridled Wiig takes the wedding cake to delicious new lows.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "It's stunning that an R-rated female-driven comedy has been made at all, let alone that it's often uproariously funny and centers on believable characters.",
      "author": "Eric D. Snider"
    },
    {
      "text": "It's [a] subtly pained undercurrent of Bridesmaids that keeps even the film's bawdiest material on the level.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It's nice to give the women a chance to play what is by and large a man's game; the problem is that the territory the movie covers, on both the bridal side and the gross-out side, is well worn.",
      "author": "David Medsker"
    },
    {
      "text": "A destined comedy classic that knows how to be crowd-pleasing without sacrificing itself to empty-headed callousness or shoehorned distastefulness. Let's not mince words, either: Kristen Wiig is brilliant.",
      "author": "Dustin Putman"
    },
    {
      "text": "Melissa McCarthy steals the film...She is fierce, she is fearless, she is wildly hilarious, and she raises the bar for the guys over at atelier Apatow.",
      "author": "Nell Minow"
    },
    {
      "text": "That rarest of treats: an R-rated romantic comedy from the Venus point of view.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "It's Hangover raunchy, yet this ribald comedy is also surprisingly perceptive when it comes to confronting middle age, maintaining friendships and finding one's way in the world.",
      "author": "Robert W. Butler"
    },
    {
      "text": "After shining on SNL, Kristen Wiig finally has a lead role worthy of her comic talents. And wedding prep gets the absurdly humorous treatment it deserves.",
      "author": "Claudia Puig"
    },
    {
      "text": "Surrounded by a hilarious cast, Wiig has definitely found her breakout role.",
      "author": "Peter Paras"
    },
    {
      "text": "Bridesmaids is just full of awkward goodness that had me laughing out loud throughout the movie.",
      "author": "Vic Holtreman"
    },
    {
      "text": "In an age of doggedly unambitious comedy, one marvels at the finesse these first-time screenwriters and director Feig bring to marrying raunch, romantic comedy, and the tested but ever-true bond between women.",
      "author": "Kimberley Jones"
    },
    {
      "text": "A film of great hilarity, humanity, idiosyncrasy and grade-A, eyebrow-singeing raunch.",
      "author": "Amy Biancolli"
    },
    {
      "text": "Bridesmaids has a couple of X chromosomes up its sleeve, and you're wrong if you think that's merely a cosmetic difference.",
      "author": "Chris Vognar"
    },
    {
      "text": "Kristen Wiig is an indisputable goddess of comedy. This rowdy fem-friendship movie she stars in and wrote with Annie Mumolo is infused with the Wiig brand of wicked mischief.",
      "author": "Peter Travers"
    },
    {
      "text": "Resembles an \"SNL\" sketch: a good idea that starts out strong and goes on too long.",
      "author": "Duane Dudek"
    },
    {
      "text": "Cue a prolonged scene where we are treated to women vying for one toilet vomiting on each other while another evacuates from the other end in a sink. Laughing yet?",
      "author": "Laura Clifford"
    },
    {
      "text": "It definitively proves that women are the equal of men in vulgarity, sexual frankness, lust, vulnerability, overdrinking and insecurity.",
      "author": "Roger Ebert"
    },
    {
      "text": "Bridemaids sputters, coughs, and lurches, but it's a winning shambles, buoyed by a sharp, balanced comedic ensemble and some truthful observations about how close friends adapt when their lives fall out of step.",
      "author": "Scott Tobias"
    },
    {
      "text": "Hallelujah and praise the Lord for Paul Feig's Bridesmaids, a movie we've been awaiting for what feels like forever.",
      "author": "Dana Stevens"
    },
    {
      "text": "Bridesmaids is a chick flick in the way that a Rolls-Royce is a ride.",
      "author": "Kurt Loder"
    },
    {
      "text": "In an age of increasingly bland, formulaic rom-coms that seem to star the same three actresses, \"Bridesmaids\" is almost a revelation.",
      "author": "Mike Russell"
    },
    {
      "text": "Think of it as The 40-Year-Old Nonvirgin in taffeta. Or the Kristen Wiig movie that her fans have been waiting for.",
      "author": "Carrie Rickey"
    },
    {
      "text": "\"Bridesmaids\" is a classic Apatow factory product. There are about a thousand jokes - 70 percent of them are funny - and the movie is 10 minutes too long.",
      "author": "Gary Thompson"
    },
    {
      "text": "such an ebullient blast of fun that the resulting critique will sound like over-the-top gushing",
      "author": "Jason McKiernan"
    },
    {
      "text": "Bridesmaids obviously strives to seem modern, but too often it mistakes crassness for freshness.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Bridesmaids is a groundbreaker. Usually it's dudes suffering from explosive bowel movements, getting drunk and disorderly, and spitting out the one word you'd better not call any woman. Not exactly a banner for feminism but equal time is overdue.",
      "author": "Steve Persall"
    },
    {
      "text": "Funny, and subversive...",
      "author": "Peter Keough"
    },
    {
      "text": "This might be a turning point in feminism and comedy, provided that both sexes can embrace it.",
      "author": "Mary F. Pols"
    },
    {
      "text": "The movie is smart about a lot of things, including the vital importance of female friendships. And it's nice to see so many actresses taking up space while making fun of something besides other women.",
      "author": "Manohla Dargis"
    },
    {
      "text": "[It's] a female-centered ensemble comedy that's ultimately about the importance and power of friendship. And, yes, it's funny as hell.",
      "author": "Moira MacDonald"
    },
    {
      "text": "In every scene she's in, Wiig expresses on her face what no dialogue can. I want more of the fat chick.",
      "author": "Victoria Alexander"
    },
    {
      "text": "All the flab dulls the sharpness of the best moments",
      "author": "Geoff Berkshire"
    },
    {
      "text": "The brilliant Saturday Night Live player Kristen Wiig finally gets the big-screen vehicle she deserves.",
      "author": "J. R. Jones"
    },
    {
      "text": "The most hilarious comedy of the year boasts a sensational performance by Kristen Wiig as a vulnerable and stressed-out woman who loses it all during the wedding preparations",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "No one has explored the inner workings of a passive-aggressive frenemy the way Wiig has. She has the Midas touch for activating a character's petty streak while still making audiences like her.",
      "author": "Michael Phillips"
    },
    {
      "text": "The comedy is broad and predictable enough that I pretty much always saw it coming - and yet I still found myself laughing when the jokes arrived right on target.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "...expresses a deep ambivalence toward marriage, one that runs counter to the fanatical, starry-eyed nature of most romantic comedies.",
      "author": "Josh Larsen"
    },
    {
      "text": "It's been a while, but finally there's a good comedy out there that's worth a trip to the movies.",
      "author": "Neil Rosen"
    },
    {
      "text": "Kristen Wiig becomes a movie star and takes back the term 'chick flick.' Bridesmaids has a big heart and a grown-up mouth.",
      "author": "Matt Pais"
    },
    {
      "text": "This is one very funny flick, which may require a second viewing, lest loud laughter rob you of hearing some of the lines - especially during an eye-popping pivotal scene that was once the purview of the boys: the big gross-out.",
      "author": "Linda Barnard"
    },
    {
      "text": "Just as Apatow redefined leading men in a more realistic manner, Wiig may well change the way Hollywood looks at ladies.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "The setup is ripe for a black comedy but the movie never fully embraces the darkness and the level of humor is on par with the limp skits for which Wiig is responsible on Saturday Night Live.",
      "author": "James Berardinelli"
    },
    {
      "text": "[Bridesmaids is] one of the funniest films in the past few years.",
      "author": "JimmyO"
    },
    {
      "text": "In an age when so many Hollywood chick-flicks seem to really hate women, it's refreshing to see a character-driven movie about women. The humor here is outrageous, bawdy, sometimes even scatological, but it's never misogynist.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Paul Feig's film has gambled on women, assuming that female moviegoers are sick of being reduced to man-starved, materialistic shopaholics by Hollywood.",
      "author": "Joshua Tyler"
    },
    {
      "text": "This is a smart and funny movie that satisfyingly expands the Apatow brand.",
      "author": "Josh Bell"
    },
    {
      "text": "\"Bridesmaids'' openly, comfortably turns the stress of being girlfriends into comedy. It's really about the single friend backing away from the edge of temporary insanity.",
      "author": "Wesley Morris"
    },
    {
      "text": "Bridesmaids is the sort of movie in which you know exactly how everything is going to turn out by the end, but the characterizations are strong enough to overcome the formulaic template.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "In this movie, romantic envy and class envy coalesce, because Bridesmaids understands just how they're linked. Even if money can't buy you love, being broke puts you at a distinct disadvantage.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "It goes pretty much as expected, but it does seem earned, in part because the writing is so sharp.",
      "author": "Glenn Kenny"
    },
    {
      "text": "This supposed great experiment in femme-com bears the distinct scars of having been \"fixed\" -- out of fear or financial imperative -- by and for dudes.",
      "author": "Karina Longworth"
    },
    {
      "text": "Bridesmaids hits the nail on the head with its comedy about a girl who is getting married and the repercussions it can have on friendship ties.",
      "author": "Jolene Mendez"
    },
    {
      "text": "Kristen Wiig is the funnist woman alive.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Thanks to Kristin Wiig, her writing partner Annie Mumolo, Judd Apatow and Paul Fieg, we've got a dandy femme-centric, outrageously funny and downright smart comedy that nails one of the most emotionally wrought feminine rites of passage.",
      "author": "Joanna Langfield"
    },
    {
      "text": "\"Bridesmaids\" proves two things conclusively: Women are every bit as adept as men at gross-out comedy antics, and Kristen Wiig is a bona-fide comedy star.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Bridesmaids is a hoot, but it's also ridiculously overlong and surprisingly unadventurous, almost afraid to pursue its most compelling qualities.",
      "author": "Brian Orndorf"
    },
    {
      "text": "For those of you who, like me, have in recent years come to regard \"chick flick\" as a purely pejorative term, Bridesmaids is nothing short of miraculous.",
      "author": "Thomas Leupp"
    },
    {
      "text": "It's an overly contrived jumble, trying out too many comic ideas that eventually swamp the central subject of what a modern young woman expects regarding friendship, courtship and marriage.",
      "author": "Armond White"
    },
    {
      "text": "Despite trademark Apatow bloat, this is Wiig's movie and she makes the most of it...She should be as big a movie-comedy star as Steve Carell or Seth Rogen.",
      "author": "Marshall Fine"
    },
    {
      "text": "There are few greater compliments one can offer a film than to say they feel shorter than they really are, and Bridesmaids' two hours positively flew by.",
      "author": "Martin Roberts"
    },
    {
      "text": "Must every funny sequence end abruptly with a generic cut to a city skyline scored to a pop song?",
      "author": "David Fear"
    },
    {
      "text": "It's a movie that succeeds, often beautifully, not by forcing its characters to be as naughty and gross and pathetic as men are. It soars by letting them be as naughty and gross and pathetic as women are. Three cheers for equality.",
      "author": "Mary Elizabeth Williams"
    },
    {
      "text": "\"Bridesmaids\" is a female version of \"The Hangover\"--from the coarse language to the cringe-inducing grossout gags to the Vegas road trip that goes horribly wrong.",
      "author": "Richard Roeper"
    },
    {
      "text": "\"Saturday Night Live\" cast member Kristen Wiig makes a successful bid for big-screen stardom in this bawdy, hilarious comedy about the downward spiral of an insecure maid of honor.",
      "author": "Kevin Lally"
    },
    {
      "text": "Makes due on expectations, but also attempts to show off a dramatic side and while that effort isn't a failure, the comedy is so successful, it tarnishes this dramatic material.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "The first hour is one outrageously hilarious catfight. It comes at a price, though, because the second is where the girls all kiss and make-up.",
      "author": "Anders Wotzke"
    },
    {
      "text": "Playing out like a typical Judd Apatow film, Bridesmaids foregoes fantasy and instead, chooses the actions, language, and attitudes of real women.",
      "author": "Mark Sells"
    },
    {
      "text": "Bridesmaids surely doesn't mark the end of conventional female-centric comedies, but it works on so many levels, it'll hopefully make future filmmakers stop and think twice before approaching this kind of project and realize it can be done [better].",
      "author": "Christy Lemire"
    },
    {
      "text": "Silliness and sexiness are comfortable bedfellows from the outset of Bridesmaids.",
      "author": "Nick Schager"
    },
    {
      "text": "If Seth Rogen is Judd Apatow's joker, Wiig is undoubtedly his droll and charming queen.",
      "author": "Dan Gear"
    },
    {
      "text": "Whether you're looking for an easy laugh or a rioutously funny comedy, Bridesmaids will have you in tears.",
      "author": "Edward Douglas"
    },
    {
      "text": "The ensemble produces some decent laughs.",
      "author": "John Hazelton"
    },
    {
      "text": "Kristen Wiig scores in an erratic gross comedy that truthfully connects where it counts.",
      "author": "Todd McCarthy"
    },
    {
      "text": "The comedy is sharply uneven, but written by women, it displays female sensibility and offers better roles for femmes than is the norm in mainstream fare.",
      "author": "Emanuel Levy"
    },
    {
      "text": "a cynical edit of . . .a sharp, funny film about the many stages, and even more permutations, of female friendships, one that was unafraid to include the ribald, the profane, and the brutally honest",
      "author": "Andrea Chase"
    },
    {
      "text": "\"Bridesmaids\" is first and foremost a showcase for Wiig, who surely doesn't play it safe here but still comes off as an affable everywoman with a twinkle of danger in her eye.",
      "author": "Stephen Saito"
    },
    {
      "text": "It's funny stuff, with Wiig's talent for physical comedy and way with a witty put-down providing many of the film's highlights.",
      "author": "Chris Tilly"
    },
    {
      "text": "Bridesmaids proves that modern comedies about women don't have to be insipid, boring or downright loathsome. Who knew?",
      "author": "Jen Yamato"
    },
    {
      "text": "This is the sort of thing that will be beloved by many, by almost everyone who sees it.",
      "author": "Drew McWeeny"
    },
    {
      "text": "Slack in pacing but raucous in tone and held together throughout by Wiig's spotlight turn.",
      "author": "William Goss"
    },
    {
      "text": "a four-square piece of populist fun that ranks as quite possibly the best mainstream American comedy in years.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "The big problem with the premise is that jealousy is not funny... the film follows the same plot as all 'outrageous wedding' movies.",
      "author": "Fred Topel"
    },
    {
      "text": "Bridesmaids sorely lacks the saving grace of being consistently funny.",
      "author": "Joe Leydon"
    },
    {
      "text": "Kristin Wiig is the best film comedienne since Madeline Kahn.",
      "author": "Jordan Hoffman"
    }
  ],
  "release_year": 2011,
  "duration": 125,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Annie (Kristen Wiig) is a single woman whose own life is a mess, but when she learns that her lifelong best friend, Lillian (Maya Rudolph), is engaged, she has no choice but to serve as the maid of honor. Though lovelorn and almost penniless, Annie, nevertheless, winds her way through the strange and expensive rituals associated with her job as the bride's go-to gal. Determined to make things perfect, she gamely leads Lillian and the other bridesmaids down the wild road to the wedding.",
  "popularity": 7.6,
  "poster_url": "https://image.tmdb.org/t/p/original/gJtA7hYsBMQ7EM3sPBMUdBfU7a0.jpg"
}