{
  "movie_name": "Casablanca",
  "movie_id": "1003707-casablanca",
  "total_reviews": 127,
  "reviews": [
    {
      "text": "Casablanca returns to theaters to enthrall us with Rick and Ilsa's war torn love, while also cementing itself as one of the best movies ever made.",
      "author": "Sarah Moran"
    },
    {
      "text": "With an incredibly gripping narrative, filled with unforgettable characters and endlessly quotable dialogue, Casablanca is a heart-wrenching and inspiring tale of sacrifice, love, integrity, and the power of patriotism. The greatest movie ever made.",
      "author": "Mark Johnson"
    },
    {
      "text": "Casablanca is best enjoyed for its production values...",
      "author": "Zita Short"
    },
    {
      "text": "Rick and Ilsa. Laszlo and the letters of transit. Captain Renault and his charming corruptibility. \"As Time Goes By.\" \"Here's looking at you, kid.\" You know the routine. So round up the usual accolades for one of the greatest films ever made.",
      "author": "Matt Brunson"
    },
    {
      "text": "Anyone who has seen the classic film, knows Bogart and Bergman had undeniable chemistry, which is part of what makes the movie as great as it is.",
      "author": "Allison Rose"
    },
    {
      "text": "... as some of those Axis Powers rear their heads up in America, seeking to take control as shouts of America First grow louder once more, a film like \"Casablanca\" can remind audiences of what happens when even the most jaded of us take up arms once more.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Casablanca presents us with a film of extraordinary quality.  [Full review in Spanish]",
      "author": "Cinelandia Staff"
    },
    {
      "text": "“Casablanca” captures and utilizes so many things well. There’s a high level of suspense. There’s a touch of humor. There is a great realization of wartime tensions. And right in the middle of it all is what may be the best romance in cinema history.",
      "author": "Keith Garlington"
    },
    {
      "text": "Casablanca, in fact, is starry with talent, pictorially often lovely and directed with considerable spirit by Michael Curtiz.",
      "author": "Dilys Powell"
    },
    {
      "text": "It's far from a great film, but it has a special appealingly schlocky romanticism, and you're never really pressed to take its melodramatic twists and turns seriously.",
      "author": "Pauline Kael"
    },
    {
      "text": "As soon as the main titles end, you are transported into a world filled with great performances and an incredibly sophisticated screenplay that takes advantage of every emotion you can think of.",
      "author": "Josh Parham"
    },
    {
      "text": "It continues to fascinate audiences in a way that is beyond explanation, except to resolve that the picture seems to result from and fully encompass that somewhat fantastical notion of Movie Magic.",
      "author": "Brian Eggert"
    },
    {
      "text": "Casablanca is as ineffectual as a Collier’s short story, but with one thing and another -- like Bergman, Veidt and Humphrey Bogart -- it is a pleasure of sorts.",
      "author": "Manny Farber"
    },
    {
      "text": "The plot is complicated in detail but clear in its issue; and it is in the presentation of the tortuous means by which the desperately-desired end is gained that the picture succeeds admirably.",
      "author": "T.C. Kemp"
    },
    {
      "text": "So topical is the dialogue that it might have been written yesterday, instead of six months ago.",
      "author": "Reg Whitley"
    },
    {
      "text": "Some movies just have the perfect script, packed full of endlessly quotable lines that are effortlessly delivered by an extraordinary cast. A phenomenal movie, that everyone needs to have seen.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "Dooley Wilson gets his best screen role to date as Rick's piano player, and comes through with ease.",
      "author": "Virginia Wright"
    },
    {
      "text": "Casablanca walks a thin line between classic romance and cheesy, but it stays true to its course. It could have very easily steered right into cheesy and stayed there, but because Curtiz had a vision it doesn't go there.",
      "author": "Sarah Brinks"
    },
    {
      "text": "This is an occasion where the final whole seriously and decisively outweighs the sum of its flawed, imperfect parts. Screenwriter Koch lived up to his pledge to \"develop a serious melodrama of present-day significance.\"",
      "author": "Joanne Laurier"
    },
    {
      "text": "The classic pairing of Bogie and Bergman...",
      "author": "Tom Meek"
    },
    {
      "text": "It is excitingly acted, smartly directed, and tells a story crammed with suspense, characterization and action. The cast of players is enough to fill the theatre alone, for it includes some of the finest players Hollywood has to boast about.",
      "author": "Marjory Adams"
    },
    {
      "text": "It's a war picture that is not about the war so much as it is about people, just people who find themselves pocketed by one or another set of war circumstances.",
      "author": "Jane Corby"
    },
    {
      "text": "Warners have been generous in fitting fine players to roles that become gems, each in its own way, through the incisive handling of Claude Rains, Sidney Greenstreet, Peter Lorre, Dooley Wilson, S. Z. Sakall and Joy Page.",
      "author": "Mildred Martin"
    },
    {
      "text": "Claude Rains, as a French captain whose sympathies do not jibe with his uniform of allegiance to Nazi rule, gives a grand performance.",
      "author": "Mae Tinee"
    },
    {
      "text": "Casablanca won't let you down, not too much anyway. It's a good melodrama, slightly overrated perhaps, but still good to the last drop. Especially the last drop.",
      "author": "Harold V. Cohen"
    },
    {
      "text": "This film, incidentally, provides Bogart with his first great romantic role. And he is ace-high in it.",
      "author": "M. Oakley Christoph"
    },
    {
      "text": "It may not be the best of its kind ever, but it is good melodrama.",
      "author": "Evelyn Russell"
    },
    {
      "text": "It wouldn't surprise us if the director's skill in this particular instance compels his nomination for an Academy prize.",
      "author": "Gilbert Kanour"
    },
    {
      "text": "Director Michael Curtiz, whose sureness and skill ere rarely to be questioned in any picture he handles, have given Casablanca an exotic atmosphere, a flow of action, surprises and punch to make it constantly interesting.",
      "author": "Colvin McPherson"
    },
    {
      "text": "Casablanca is brisk well made for those who like romance and adventure handled by a good actor like Mr Bogart.",
      "author": "KC Star Staff"
    },
    {
      "text": "Apparently Casablanca, which I must say I liked, is working up a rather serious reputation as a fine melodrama. Why? It is obviously an improvement on one of the world's worst plays; but it is not such an improvement that that is not obvious.",
      "author": "James Agee"
    },
    {
      "text": "The tale as unfolded is one of love, hate, revenge and gallantry and will please those who watch its visualization because of its fine reserve during most of its telling.",
      "author": "Edwin Schallert"
    },
    {
      "text": "The whole thing is exciting, first-class entertainment.",
      "author": "Ida Belle Hicks"
    },
    {
      "text": "In the hands of this cast and the capable direction of Curtiz. the film remains absorbing throughout, where lesser players might have made it seems slow-moving. The picture lacks action, but never drama.",
      "author": "Herbert Whittaker"
    },
    {
      "text": "Casablanca in the days before the allied occupation had obvious possibilities as the background of a film of intrigue and adventure, and the film... has taken at least a reasonable percentage of its opportunities.",
      "author": "Times (UK) Staff"
    },
    {
      "text": "While Casablanca Is fast-moving, and the intrigue between the Germans and the French holds attention, with plenty of dramatic high spots, it is the individual performances that give the picture its real distinction.",
      "author": "Len G. Shaw"
    },
    {
      "text": "There is a careful opulence about the production which should redound to the credit of Hal B. Wallis and of Michael Curtiz, who directed.",
      "author": "E. A. Cunningham"
    },
    {
      "text": "While the exceptional performances of Bogart and Bergman are highlighted, Henreid and Greenstreet deserve their share of praise and Rains comes across with a supporting role of Academy Award proportions.",
      "author": "Bob Fredericks"
    },
    {
      "text": "It's a busy film, with bright lines, a perfunctory romance, and a dim message, that you can't escape from yourself, or something. Most people however, will let the message alone and just enjoy themselves with the mechanics of escape.",
      "author": "C.A. Lejeune"
    },
    {
      "text": "It has exciting story to unfold - and it does at a tempo that allows no slackening of suspense; It has a solid quota of romance, plenty of skilful characterisation, a fair issue of comedy, and, into the bargain, it has the exotic background of Casablanca.",
      "author": "Age Staff"
    },
    {
      "text": "A brilliant and moving melodrama.",
      "author": "Mercury Staff"
    },
    {
      "text": "Humphrey Bogart is grand. Ingrid Bergman is poignantly and dramatically beautiful. Henreid is quietly convincing as are Conrad Veidt and the rest of the notable cast.",
      "author": "Shadow Stage"
    },
    {
      "text": "As an excellent though melodramatic background to today's stirring headlines of the \"second front\" in North Africa, Casablanca is as topical a film as has ever been made.",
      "author": "MPD Staff"
    },
    {
      "text": "Casablanca is a romantic melodrama, in a striking setting; it's packed with the danger, thrills and heart of our world today.",
      "author": "Zachary Gold"
    },
    {
      "text": "The film is an exciting and suspense-laden melodrama of Nazi intrigue. The events in the picture are so close to fact as to give Casablanca a fascination that is irresistible.",
      "author": "Film Daily Staff"
    },
    {
      "text": "Timely in title and topic, Casablanca is an excellent war melodrama, one that will certainly appeal to all types of audiences.",
      "author": "P.S. Harrison"
    },
    {
      "text": "It's probably high time for a \"Casablanca\" remake. It debuted in 1943 to awaken apathetic America to the Nazi threat. Now, the Chinese Communist Party is hell-bent on world domination-somebody hurry up and discover the new Bogart and Bergman!",
      "author": "Mark Jackson"
    },
    {
      "text": "It is so iconic, so memorable, so enjoyable to watch, that it's no wonder that it is one of the most popular entertainments ever made.",
      "author": "Allen Almachar"
    },
    {
      "text": "No role is wasted, no shot overdone or overlong, and nearly every moment absolutely unforgettable.",
      "author": "Mike Massie"
    },
    {
      "text": "How can one film do so much, and be so effortlessly suave while doing it?",
      "author": "Matt Neal"
    },
    {
      "text": "Humphrey Bogart and Ingrid Bergman are pure magic in one of the most romantic films ever. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Casablanca is like fine wine--the film only gets better with time.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Directed by Michael Curtiz, the whole production is so well balanced and so capably acted that it leaves a warmth and satisfaction in the memory of the picturegoer.",
      "author": "Audrey Francis"
    },
    {
      "text": "A film that should keep patrons interested for many weeks.",
      "author": "Nelson Burns (Te Pana)"
    },
    {
      "text": "Where most other war-time melodramas have pinned their faith upon breakneck action, [Casablanca] derives its superb strength from the clashes and interplay of character [and] Michael Curtiz's highly disciplined handling of the suspense.",
      "author": "SMH Staff"
    },
    {
      "text": "Casablanca is one of the most exciting melodramas the screen has ever produced. And it is mature, intelligently conceived, and, within the limits of melodrama, honest.",
      "author": "Gilbert Seldes"
    },
    {
      "text": "Moments of high tension and suspense punctuate the action with the most thrilling moment when in Rick's cafe a group of Free French men drown out Nazi voices by singing the \"Marseillaise.\" Picture is acted with distinction by a fine cast.",
      "author": "Andrew R. Kelley"
    },
    {
      "text": "The film is at its best in its opening moments as the chaos of Casablanca, the city, is conveyed.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Casablanca is one of the indisputable peaks of the American film industry. [Full Review in Spanish]",
      "author": "Antonio Lara"
    },
    {
      "text": "There is less gunplay than is usual in such narratives, and the story is, indeed, no more than adequate, but any lack of excitement is more than balanced by excellent characterisation and quite brilliantly sensitive acting.",
      "author": "Edgar Anstey"
    },
    {
      "text": "Stride after stride, scene after scene, moment after moment, everything comes together and everything is right.",
      "author": "Don Shanahan"
    },
    {
      "text": "A long and lively film, bulging with acting talent and breathless with its own dramatic momentum.",
      "author": "Alan Dent"
    },
    {
      "text": "The support is strong. The atmosphere of Casablanca, the excellent camera work, the taut direction and the superb playing -- all these and an actionful script put this show up among the top ones.",
      "author": "W. Ward Marsh"
    },
    {
      "text": "What I love about Casablanca is that it defies categorization into any single genre. It's a war movie, a spy movie and a romantic drama, laced with bracing humor.",
      "author": "Sean P. Means"
    },
    {
      "text": "While the future was uncertain, the resolute characters of this exquisite wartime drama found peace through love and resistance.",
      "author": "Serena Donadoni"
    },
    {
      "text": "Certainly a more accomplished cast of players cannot be imagined, and their direction by Michael Curtiz is inspired.",
      "author": "THR Staff"
    },
    {
      "text": "Curtiz's film is a classic for a reason -- it's crafted with the precision, detail and beauty of a Fabergé egg; the dialogue is hauntingly memorable and, in Humphrey Bogart and Ingrid Bergman, it has one of the most magnetic screen pairings in history.",
      "author": "Wendy Ide"
    },
    {
      "text": "Knowing the story doesn't impair one's wonder at the undiminished magic of Casablanca.",
      "author": "Graham Fuller"
    },
    {
      "text": "Frankly, it's earned its reputation.",
      "author": "Witney Seibold"
    },
    {
      "text": "An entertaining adventure story played against the colorful background of the cosmopolitan city that has become an important stop on the timetable of the European refugee.",
      "author": "Kate Cameron"
    },
    {
      "text": "There are some of the very finest character actors that Warner Brothers could muster and a rich, detailed screenplay studded with an indecent number of sparklingly quotable lines. It is a movie to play again, and again.",
      "author": "Sheila Johnston"
    },
    {
      "text": "Nobody lights a torch like Ingrid Bergman's Ilsa or carries one like Humphrey Bogart's Rick.",
      "author": "Michael Wilmington"
    },
    {
      "text": "The reason Casablanca endures is that it's a timeless love story wrapped inside a gripping wartime thriller, written with such wit and meaning that it's still quoted (and misquoted) decades later.",
      "author": "Andrew Collins"
    },
    {
      "text": "The film's tensions, sexual and dramatic, derive from the ambiguity of characters' motives. We can never be too sure about Rick and Renault until the final fadeout.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Casablanca is the most sociable, the most companionable film ever made. Life as an endless party.",
      "author": "David Denby"
    },
    {
      "text": "Whether you return to Casablanca for a nostalgia fix, a guilty pleasure or for the waters, you can be certain there'll be something you didn't notice last time out.",
      "author": "Neil Smith"
    },
    {
      "text": "Its undying appeal may be the result of the Hollywood factory's skill, in those days, in fashioning something memorable out of virtually nothing.",
      "author": "Evening Standard Staff"
    },
    {
      "text": "Even hardened cynics who might be impelled to dismiss it as a collection of button-pushing clichés will most likely get swept up in the all the unabashed romance.",
      "author": "David Jenkins"
    },
    {
      "text": "Every kid should see this Bogart classic.",
      "author": "Nell Minow"
    },
    {
      "text": "Although it was made in 1942, \"Casablanca\" is still the greatest romantic drama ever made.",
      "author": "Cole Smithey"
    },
    {
      "text": "About Casablanca there clings a quality of lovely, urgent innocence.",
      "author": "TIME Staff"
    },
    {
      "text": "This is it. The best movie ever made.",
      "author": "David Cornelius"
    },
    {
      "text": "The film has a peculiar magic to it, and because of its pace the richness of its sense of detail often goes unnoticed.",
      "author": "Jeremiah Kipp"
    },
    {
      "text": "It is the product of numerous accidents, all of them happy, and I laugh, cry and have my better instincts appealed to whenever I see it.",
      "author": "Philip French"
    },
    {
      "text": "Bogart, as might be expected, is more at ease as the bitter and cynical operator of a joint than as a lover, but handles both assignments with superb finesse. Bergman, in a torn-between-love-and-duty role, lives up to her reputation as a fine actress.",
      "author": "Variety Staff"
    },
    {
      "text": "It is one of the most timeless of all movies in terms of topic, emotion, acting and motivation.",
      "author": "Steven Snyder"
    },
    {
      "text": "There's a reason the world loves this wartime film, now digitally restored: more memorable dialogue than should be strictly legal, heartbreaking performances from the two leads and a plot that works with Swiss-watch precision.",
      "author": "David Gritten"
    },
    {
      "text": "Irresistible, big-hearted film-making.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Rightly one of the most popular -- if not the most popular -- films of all time.",
      "author": "Film4 Staff"
    },
    {
      "text": "As time goes by, the appeal of Casablanca shows no sign of diminishing.",
      "author": "Tom Dawson"
    },
    {
      "text": "One of those rare films where every shot and every quotable line of dialogue counts, there's not a dead patch in Casablanca.",
      "author": "Matt Mueller"
    },
    {
      "text": "It is a true timeless classic and will stay so as long as time goes by.",
      "author": "Bob Bloom"
    },
    {
      "text": "Part of what makes this wartime Hollywood drama (1942) about love and political commitment so fondly remembered is its evocation of a time when the sentiment of this country about certain things appeared to be unified.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "Since it screened at the theater in 1943, the story of lovers Rick Blaine (Humphrey Bogart) and Ilsa Lund (Ingrid Bergman) in Casablanca has made cinematic history.",
      "author": "Diana Saenger"
    },
    {
      "text": "One of the best screenplays ever filmed.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Its complex propagandist subtexts and vision of a reluctantly martial America's 'stumbling' morality still intrigue, just as Bogart's cult reputation among younger viewers still obtains.",
      "author": "Wally Hammond"
    },
    {
      "text": "One of the most enjoyable American films ever made, Casablance, which won the 1942 Best Picture Oscar, influenced the way Americans thought about intervention in WWII and world politics in general.",
      "author": "Emanuel Levy"
    },
    {
      "text": "An entertaining film that is as timeless as great art.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The movie gods kissed the production with a confluence of brilliant writing, photography and acting, with all parties collaborating at their ultimate peak of potential.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Wars come and go, but that sense of cascading entropy is eternal.",
      "author": "Walter Chaw"
    },
    {
      "text": "One of the best movies ever. The romantic pain still holds up, and political intrigue still compels.",
      "author": "Fred Topel"
    },
    {
      "text": "It improves with each viewing.",
      "author": "Mark Robison"
    },
    {
      "text": "Yes, indeed, the Warners here have a picture which makes the spine tingle and the heart take a leap.",
      "author": "Bosley Crowther"
    },
    {
      "text": "One of the handful of films that lives up to its hype. This movie defines \"classic.\"",
      "author": "Alex Sandell"
    },
    {
      "text": "The world’s favorite Hollywood love story is all the more romantic because it doesn't exalt romantic love above all.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Play it again.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Sorry, I just don't get it. But most people seem to, so fair play to it.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Timeless. Just flat out perfect and timeless.",
      "author": "Widgett Walls"
    },
    {
      "text": "Every bit the classic.",
      "author": "Scott Weinberg"
    },
    {
      "text": "An accidental masterpiece ...",
      "author": "Philip Martin"
    },
    {
      "text": "Mounted with careful attention to its North African location the story has moments of charm, nostalgia and wit that should cause it to take hold of the audience's attention and carry along to a happy finish.",
      "author": "Boxoffice Staff"
    },
    {
      "text": "It's a film that pays off the viewer again and again and again.",
      "author": "Christopher Null"
    },
    {
      "text": "A brilliant film that merits inclusion in every self-respecting film critic's top three.",
      "author": "William Mager"
    },
    {
      "text": "What more can a person say about a movie that defines the word 'classic'?",
      "author": "John J. Puccio"
    },
    {
      "text": "The greatest pleasure anyone can derive from this movie comes through simply watching it.",
      "author": "James Berardinelli"
    },
    {
      "text": "A film for anyone who has ever had a heartbreaking choice to make, for film lovers who enjoy unpredictable endings, and for anyone who has lost a love.",
      "author": "Brian Webster"
    },
    {
      "text": "The classic and much-loved romantic melodrama Casablanca (1942), always found on top-ten lists of films,",
      "author": "Tim Dirks"
    },
    {
      "text": "The script and direction are crisp and clear, the story is compelling and the casting is first-rate.",
      "author": "Chris Hicks"
    },
    {
      "text": "Seeing the film over and over again, year after year, I find it never grows over-familiar. It plays like a favorite musical album; the more I know it, the more I like it.",
      "author": "Roger Ebert"
    },
    {
      "text": "It is a pragmatic and darkly humorous essay on aspects of the human condition, ending on a melancholy note that reverberates through even Renault's semi-vulnerable heart.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "Casablanca is a must-have DVD. It is a nearly flawless presentation of a film that has set the standard for \"timeless.\"",
      "author": "Jeffrey Wachs"
    },
    {
      "text": "This is the ultimate movie. This is the purpose for which Hollywood invented itself. This is how good a film can be.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "More an icon than a work of art, Casablanca is still thoroughly entertaining romantic melodrama, flawlessly directed, subtly played, lovingly evoking our collective daydreams about lost chances and lost loves and love versus honor.",
      "author": "TV Guide Staff"
    },
    {
      "text": "When it all comes down to the end, I think I'd rather be curled up in front of Casablanca (1942) than just about anything else. It's like a warm blanket, a hot cup of tea, or a cuddly old dog.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "This is arguably my favorite film of all time, and I could spend hours extolling its virtues.",
      "author": "Matt Easterbrook"
    },
    {
      "text": "The casting for this movie seems influenced by divine inspiration.",
      "author": "Dragan Antulov"
    },
    {
      "text": "This movie is like Hamlet in that, even if you haven't seen either one of them, you are probably familiar with much of the dialogue.",
      "author": "Scott Nash"
    }
  ],
  "release_year": 1943,
  "duration": 102,
  "genres": [
    "Drama"
  ],
  "age_rating": "PG",
  "synopsis": "Rick Blaine (Humphrey Bogart), who owns a nightclub in Casablanca, discovers his old flame Ilsa (Ingrid Bergman) is in town with her husband, Victor Laszlo (Paul Henreid). Laszlo is a famed rebel, and with Germans on his tail, Ilsa knows Rick can help them get out of the country.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/5K7cOHoay2mZusSLezBOY0Qxh8a.jpg"
}