{
  "movie_name": "Coraline",
  "movie_id": "coraline",
  "total_reviews": 275,
  "reviews": [
    {
      "text": "Coraline seems to have grown into an allegory that it was never meant to be. I honestly can’t think of a better analogy for our current algorithm-driven existence that promises to give us just what we want",
      "author": "Collin Garbarino"
    },
    {
      "text": "Compelling, beautiful, dark, funny, horrifying, and everything in between, Coraline should be recognised for what it is: one of animated cinema’s greatest offerings.",
      "author": "Calum Cooper"
    },
    {
      "text": "This film is truly one of the best features ever to incorporate 3D, as it works not only on a visual level (it looks fantastic) but also on a narrative and thematic one.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Coraline gets children's horror just right.",
      "author": "Hannah Rose"
    },
    {
      "text": "You don’t need a bank of computers to create alluring animation, just a willingness to indulge the imagination. Something this ingratiating bit of puppet love does in spades.",
      "author": "Al Alexander"
    },
    {
      "text": "With Coraline returning to theaters, I'd like to make the case for a whole new generation of kids being taken to experience its traumatic delights.",
      "author": "Alexander Harrison"
    },
    {
      "text": "I won’t go as far as to say Coraline doesn’t deserve the praise it gets to this day. I just don’t gel too much with the substance beneath the style, or at least how that substance is conveyed to us.",
      "author": "Joseph Tomastik"
    },
    {
      "text": "Fear is an integral part of childhood development, so if you have children, show them Coraline and expose them to imagination and the possibility of dreams and all the frightening aspects therein.",
      "author": "Brian Eggert"
    },
    {
      "text": "Think Dr. Seuss by way of Edward Gorey, all executed with the creative flair and painstaking detail that Henry Selick brought to 'The Nightmare Before Christmas.'",
      "author": "Sean Axmaker"
    },
    {
      "text": "Coraline is a stop-motion masterpiece.",
      "author": "Allison Rose"
    },
    {
      "text": "'Coraline' is a weird and wonderful story, with stunning stop-motion visuals, and haunting music that really heightens the already eerie atmosphere.",
      "author": "Cassondra Feltus"
    },
    {
      "text": "The bone chilling image of buttons-for-eyes will get trapped in your head. But the twists and turns of this phenomenal kid's horror romp will make it all worth it.",
      "author": "Nicole Clark"
    },
    {
      "text": "An eye-popping animated extravaganza.",
      "author": "Matt Brunson"
    },
    {
      "text": "There's a lightness to every scene of their films, even the emotionally-scarring moments, which pulls you in deeper to the story.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Insanely inventive characters and a generous helping of darkly macabre visuals permeate every facet.",
      "author": "Mike Massie"
    },
    {
      "text": "Coraline is imaginative, daring and intelligent filmmaking devoid of Hollywood manipulations and greeting card sentiments.",
      "author": "Richard Propes"
    },
    {
      "text": "A cinematic fable that strikes a nice balance between schlock and the over-serious...",
      "author": "Kathi Maio"
    },
    {
      "text": "[Coraline] is THE Best Picture of the Year.",
      "author": "Debbie Lynn Elias"
    },
    {
      "text": "[A] sumptuous, stunning film that will charm audiences young and old.",
      "author": "Nikki Baughan"
    },
    {
      "text": "The real star here is the 3D and Selick makes full advantage of advances in the technology.",
      "author": "David Harris"
    },
    {
      "text": "It's just really surprising and different and unique.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It pitches the increasingly creepy dynamic that defines its fantasy world at a level that does not condescend to its children audience, nor seem too diluted for its adult audience.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Entertaining, funny and surprisingly suspenseful a times, Coraline is the perfect movie for your little one...and for the child in all of us.",
      "author": "Candice Frederick"
    },
    {
      "text": "Having read Neil Gaiman's novella a number of times, I had my own idea of what the little girl who discovers an alternative and terrifying other world in her own home should be like but director Henry Selick's vision knocks spots off my own.",
      "author": "Brigit Grant"
    },
    {
      "text": "Coraline is an interesting film that leaves its audience with two thoughts. Normal life is perfect, even when it isn't, and beware of dreams with fangs.",
      "author": "Julie Washington"
    },
    {
      "text": "Coraline never stops taking artistic risks. I hope there's a brave enough audience out there willing to take the plunge.",
      "author": "Tom Charity"
    },
    {
      "text": "All involved in this production deserve praise for turning Coraline into a triumph of storytelling and cinematic technology. Whether you're young, middle-age or older, you'll adore it.",
      "author": "Randy Myers"
    },
    {
      "text": "For all its shortcomings, Coraline nevertheless has more imagination, heart and inventiveness in it than most recent animated films.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "You know from the very first sequence that Coraline is an extraordinary movie that is going to rattle the bejeezus out of young audience members and -- the truth be told -- their fathers as well.",
      "author": "Jay Stone"
    },
    {
      "text": "It would be difficult for any filmmaker to mimic Gaiman's seductively amusing and imaginative writing, and Selick, who also wrote the script, should be commended for not falling back on some golden-tongued narrator. But his Coraline could use more spunk.",
      "author": "Matt Prigge"
    },
    {
      "text": "The movie, though, dares not go below the surface. Could the problem be its use of 3-D? Did the filmmakers think that to offset this additional, illusory visual dimension they had to remove all depth from the story itself?",
      "author": "Peter Keough"
    },
    {
      "text": "It's the stop-motion figures themselves who steal the show. They're so vivid and expressive, in both body and facial movements, that they cease being mere puppets and take on a life all their own.",
      "author": "Carol Cling"
    },
    {
      "text": "The fine details and surreal flourishes Selick lavishes upon Coraline's tentative travels into the unknown are a never-ending delight. Even during the sections of the story that are intended to disturb.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A cinematically inventive, dramatically involving children's adventure that isn't exclusively aimed at children. There's no talking down, no softening of potentially unsettling moments. It's awesome.",
      "author": "Norman Wilner"
    },
    {
      "text": "A stunning visual delight, this beautifully-made animated adventure will thrill children of about eight and above.",
      "author": "Roz Laws"
    },
    {
      "text": "Coraline offers no broad explanation for its supernatural peculiarities. It doesn't need it. These things exist in the world we know, albeit in more ethereal forms.",
      "author": "John Serba"
    },
    {
      "text": "A film so delightfully creative, vibrant and yes, a little dark that it once again proves that Mr. Selick is a rare creature in the world of filmmaking, that rare kind of filmmaker whose creativity and vision knows no bounds.",
      "author": "Neil Miller"
    },
    {
      "text": "Coraline proves Selick to be a champion storyteller with stop-motion animation. He resurrects the dark sinisterness of Nightmare and cannily merges it with a touch of Alice in Wonderland and Arachnophobia.",
      "author": "Dann Gire"
    },
    {
      "text": "This animated fairytale is visually dazzling, fun and weaves an atmosphere somewhere between magical and creepy.",
      "author": "Leonie Hayden"
    },
    {
      "text": "Here's a splendid cautionary tale for any child who has ever, mid-tantrum, wailed, \"I'll just go find my real parents!\"",
      "author": "Leah Rozen"
    },
    {
      "text": "This is a wonderful-looking animation with a wafer-thin plot.",
      "author": "Graham Young"
    },
    {
      "text": "As in the Grimm Brothers stories, there's something very pagan in Coraline, something that doesn't jibe with our feelings that good always defeats evil. Rather it insists that cleverness and a little treachery is always needed to save our skins.",
      "author": "Richard von Busack"
    },
    {
      "text": "A juvenile nightmare that children can gasp and giggle along with and feel a bit braver for surviving.",
      "author": "Steve Persall"
    },
    {
      "text": "Whilst the denouement is a little rushed, not meeting the exceptional standards established in the first two thirds of the film, the deconstruction of the other world is fascinating as it unravels in front of your eyes.",
      "author": "Beth Wilson"
    },
    {
      "text": "Coraline is one of those films where I was blown away by the complexity of it from the second it began to the moment it ended.",
      "author": "David Sztypuljak"
    },
    {
      "text": "You're on your own when it comes to knowing how tolerant your children are for a good scare. Coraline is that rare movie that can be debated by psychiatrists as avidly as it is by third-graders.",
      "author": "Mal Vincent"
    },
    {
      "text": "Understated, dark and wonderful, it's a classic for those of Coraline's age.",
      "author": "Sacha Molitorisz"
    },
    {
      "text": "Gloriously gothic and deliciously creepy.",
      "author": "Jeff Meyers"
    },
    {
      "text": "Coraline's dangerous predicament, coupled with the eye-popping set design, makes for a sinister and menacing universe that provides excitement and thrills, but may be a little too intense for younger viewers used to more sanitised fare.",
      "author": "Terry Staunton"
    },
    {
      "text": "The sinister undertones could be unsettling for preschoolers, but Coraline is a rare treat for kids old enough to appreciate its exotic rush of wonder, weirdness and wildly imaginative adventure.",
      "author": "Neil Pond"
    },
    {
      "text": "Freudians, you have our permission to knock yourselves out.",
      "author": "Kelly Vance"
    },
    {
      "text": "Coraline looks fantastic and is wonderfully told, but you should probably leave your five and six year olds at home, especially if they get nightmares easily.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Will win over older audience with the story and design, rather than 'adult jokes' hidden within a juvenile narrative.",
      "author": "Mike Edwards"
    },
    {
      "text": "Kids can enjoy this but they're not the primary target.",
      "author": "Katina Vangopoulos"
    },
    {
      "text": "It's wildly inventive, thoroughly amusing and fuelled by unhinged imagination. And it's creepy as all hell.",
      "author": "Simon Miraudo"
    },
    {
      "text": "With its silky visuals and breathtaking creativity, Coraline is one of the few modern features to prove that Pixar doesn't have a monopoly on animated excellence.",
      "author": "Sean Edgar"
    },
    {
      "text": "Visually, \"Coraline\" rests between Terry Gilliam's rudimentary \"Monty Python\" work and Pixar's prestigious polish. Every background is beautiful in a children's film that's mesmerizing and a bit bothersome at times, just as it should be.",
      "author": "Nick Rogers"
    },
    {
      "text": "The Nightmare Before Christmas test required. If the kiddies survive that one without developing an intense fear of the boogeyman or Santa Claus, Coraline gets a green light.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Parents of impressionable littlies should be mindful that the film does descend into a very effective nightmare world in the final reel and some time could be spent shielding eyes from Selick's more confronting creations.",
      "author": "Simon Foster"
    },
    {
      "text": "Gaiman's great story and Selick's direction make it a fun few hours in the theater. Just don't take anybody under eight.",
      "author": "Jean Lowerison"
    },
    {
      "text": "Coraline is equal parts funny and frightening. This isn't a cute story for kids... but one of the most sophisticated, rewarding works of American fantasy cinema.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "An amazing stop-motion achievement.",
      "author": "Wesley Lovell"
    },
    {
      "text": "While Selick's production is not by any stretch graphic or gory, the use of odd and irregular shapes, proportions, and movement creates a dark symphony of macabre images that horrify the psyche and chill the blood all the same.",
      "author": "Jordan Hiller"
    },
    {
      "text": "Evokes \"Beetlejuice\" and \"Pan's Labyrinth\" but is much more of a children's movie and a damned good one at that.",
      "author": "Louis Proyect"
    },
    {
      "text": "It might be too sophisticated and scary for children, but it at least never insults their intelligence.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "With Coraline, Henry Selick and his team of stop-motion animators have created a real wonder, one that will entertain children for years to come.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Coraline has enough exhilaration and dread to remind viewers of the first time they read about Gretel pushing the Witch into the oven",
      "author": "Fernando F. Croce"
    },
    {
      "text": "This is one of those films that works best if you can forget about the source material. Selick's film is more like a three-ring circus.",
      "author": "Jake Wilson"
    },
    {
      "text": "A wonderfully inventive film.",
      "author": "David Stratton"
    },
    {
      "text": "The 3-D animation is just superb in Coraline; the imagination of Neil Gaiman has taken flight with director Henry Selick.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "Coraline is a genuinely creepy film that employs 3-D trickery to its best affect. A deliciously entertaining mythological adventure.",
      "author": "Pauline Adamek"
    },
    {
      "text": "The visual invention is staggering, ranging from fabulous fantasy to eerie scary",
      "author": "Andrew L. Urban"
    },
    {
      "text": "A whimsical fantasy created in stop animation and set in alternate universes, Coraline is a visual treat certain to whisk every age into a magical wonderland.",
      "author": "Louise Keller"
    },
    {
      "text": "A whimsical fantasy created in stop animation and set in alternate universes, Coraline is a visual treat certain to whisk every age into a magical wonderland.",
      "author": "Richard Kuipers"
    },
    {
      "text": "It takes an extraordinary mind to create a truly original, truly new, truly beautiful fable, Coraline is one such creation.",
      "author": "Giles Hardie"
    },
    {
      "text": "Walks the thin line between scary and downright entertaining...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "A wonderfully weird film, a modern-day Alice in Wonderland that marries technology and good old-fashioned storytelling.",
      "author": "Mike Scott"
    },
    {
      "text": "Coraline is near perfect family entertainment - if your family can handle some pretty ghoulish creatures.",
      "author": "Christian Toto"
    },
    {
      "text": "At times it was trying too hard to be WHIMSICAL %u2122 and missing the point that whimsy is best taken unselfconsciously. By all means see it if you can also endure the tedious splendor that is Nightmare Before Christmas. They are both stunning to look",
      "author": "Karina Montgomery"
    },
    {
      "text": "If you're going to make a movie that doesn't quite add up to the sum of its parts, you might as well make sure those parts are beautifully formed.",
      "author": "Richard Edwards"
    },
    {
      "text": "The film combines stunning visuals - there are scenes of incredible beauty - with good old-fashioned storytelling that is funny, inventive and at times scary. Destined to be a classic.",
      "author": "Cosmo Landesman"
    },
    {
      "text": "The movie is beautifully crafted, but like the same director's other stop-motion feature, Tim Burton's The Nightmare Before Christmas, it will mystify and in some cases terrify younger children.",
      "author": "Philip French"
    },
    {
      "text": "It's easy to admire the film's psychedelic surrealism and its marvellous design, but it's not a great deal of fun.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Here the film goes very dark but kids will lap it up, scares and all.",
      "author": "Mickey McMonagle"
    },
    {
      "text": "Here's my recommendation, don't let this be your kid's first scary movie, especially in the 3D, which is the only way to see this beautiful, hypnotic film.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Like the Tin Man of Oz, Coraline is a miracle of engineering - and absolutely heartless.",
      "author": "Ali Catterall"
    },
    {
      "text": "Technically, it's impeccable. But it's madly out of synch with the 12A certificate.",
      "author": "James Christopher"
    },
    {
      "text": "Some scary fun.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "A gorgeously hand-crafted and pleasurably detailed piece of work. It's also genuinely strange, creepy and arresting.",
      "author": "Tim Robey"
    },
    {
      "text": "Coraline is more of an odd curiosity than a must see, lacking the storytelling innovation to match its visual panache.",
      "author": "Simon Reynolds"
    },
    {
      "text": "Endlessly inventive and impeccably realised, it's tough to find fault with this freaky, feisty fable.",
      "author": "Neil Smith"
    },
    {
      "text": "It's not really suitable for younger children but their elder brothers and sisters will be fiendishly entranced by the best children's movie this year. Naysayers can button it.",
      "author": "Tim Evans"
    },
    {
      "text": "Rich, ingenious and frighteningly close to home, Selick's new nightmare puts him nearer to Guillermo del Toro and David Lynch than Tim Burton. See it in 3D. Then sleep with the light on.",
      "author": "Jonathan Crocker"
    },
    {
      "text": "Admirably, it never condescends, and the subtexts about child abduction and the nature of maternal love identify Coraline as something measurably apart from what traditionally passes for \"kids\" films these days.",
      "author": "Michael Bonner"
    },
    {
      "text": "Off-beat, weird, original, intense, stunning, jaw-dropping, enthralling and ingenious, this film is a beautiful piece of work that will hold your attention and capture your heart.",
      "author": "Simon Thompson"
    },
    {
      "text": "It lacks narrative drive, psychological depth and, most of all, warmth. This is a 'family' movie that offers an extremely dark view of human nature without providing much to relieve it.",
      "author": "Christopher Tookey"
    },
    {
      "text": "It may be a little too complex and mildly disturbing for wee ones, but its lush gothic style and amazing effects will impress film fans.",
      "author": "Mark Adams"
    },
    {
      "text": "Coraline may end up as a cult classic watched by students rather than their little sisters.",
      "author": "The Sneak"
    },
    {
      "text": "The vision of Henry Selick adds a darkness to this sometimes sinister fairy tale.",
      "author": "Martin Hoyle"
    },
    {
      "text": "Selick's wonderful stop-motion adaptation of Neil Gaiman's children's novel has a lot to do with distortions, idealisations and celebrations of home.",
      "author": "Donald Clarke"
    },
    {
      "text": "A virtuoso piece of storytelling with amazing attention to detail.",
      "author": "Allan Hunter"
    },
    {
      "text": "Skittering up goosebumps of wonderment at every turn, this latest spooky stop motion from director Henry Selick is a visual masterpiece - yet misses that magic ingredient: a heart.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Beautifully animated, superbly designed and impressively directed, this is a delightfully imaginative tale with strong characters and a great script.",
      "author": "Matthew Turner"
    },
    {
      "text": "Based on the Neil Gaiman book, this is another refreshingly dark kids' movie from Selick that never undermines its creepy story to assure undemanding audience members. And it looks utterly fantastic.",
      "author": "Rich Cline"
    },
    {
      "text": "This deliciously creepy fairy- tale-penned by Neil Gaiman and adapted by Nightmare Before Christmas director Henry Selick-might just be the best 3D film ever made. It is, without doubt, the best I've seen.",
      "author": "Robbie Collin"
    },
    {
      "text": "Imagine Burton's unique, warped, off-kilter vision crossed with the darkest of Roald Dahl's kids tales in 3D and you'll come close to Coraline's warped brilliance. Disney this ain't.",
      "author": null
    },
    {
      "text": "It's weird and wonderful stuff, with Selick using the 3D sparingly to subtly add depth and texture to this magical, macabre world.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Unfortunately Coraline is one of those movies that one thought one would have liked more . . .",
      "author": "James O'Ehley"
    },
    {
      "text": "Superbly edited and paced just right, Coraline will keep you glued to the screen until the end.",
      "author": "Jennie Kermode"
    },
    {
      "text": "Terrifying and beautiful, believable and fantastical, this is one of the best children's films in years and Selick's finest - better even than The Nightmare Before Christmas.",
      "author": "Helen O'Hara"
    },
    {
      "text": "A delightfully dark fairy tale!",
      "author": "Julian Roman"
    },
    {
      "text": "Inventive visuals and a serious scary streak permeate Coraline, a ripping example of stop-motion animation that's overflowing in wild detail.",
      "author": "Sean P. Means"
    },
    {
      "text": "The movie is a visual treat with every color in the crayon box on display.",
      "author": "Keith Cohen"
    },
    {
      "text": "...boasts an unapologetically thin storyline that grows increasingly problematic as the movie progresses.",
      "author": "David Nusair"
    },
    {
      "text": "The quality of Selick's craft and the dense, haunting nature of Gaiman's morality tale for children collectively make Coraline a resonant visceral experience.",
      "author": "Robert Levin"
    },
    {
      "text": "richly creepy, funny and completely confident",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "The other mother in Coraline is mother-love gone berserk, all-consuming and self-serving.",
      "author": "Renie Scolaro Mora"
    },
    {
      "text": "Ripe with colors and magic and mystery. 3D is very nice. Cools off towards end. Spooky.",
      "author": "Ross Anthony"
    },
    {
      "text": "the film starts off in traditional children's fable territory, it does get quite scary towards its end.",
      "author": "Sean McBride"
    },
    {
      "text": "Coraline is just dazzling to look at, the kind of film where the frame seems to be bursting with things to discover.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Coraline is meant for children. But it's neither infantile nor condescending. It has a moral... without being preachy or sanctimonious, bypasses the cynical formula that makes so many animated features so headache-inducing.",
      "author": "Maitland McDonagh"
    },
    {
      "text": "A vibrant, imaginative, and, above all, unapologetically dark children's horror fantasy.",
      "author": "David Cornelius"
    },
    {
      "text": "Creepy and cool",
      "author": "Fr. Chris Carpenter"
    },
    {
      "text": "One fantastic entertainment for viewers of any age.",
      "author": "Michael Dequina"
    },
    {
      "text": "Employing stop-motion animation that renders human beings with the distinctive characteristics evident in both The Nightmare Before Christmas and James and the Giant Peach, Selick finds the perfect look to bring Gaiman's vision to life.",
      "author": "James Berardinelli"
    },
    {
      "text": "A gift to imagination.",
      "author": "David Denby"
    },
    {
      "text": "It's one of the best fantasy stories on the screen in some time, and possibly the most kid-friendly horror movie of all time.",
      "author": "Widgett Walls"
    },
    {
      "text": "The artistry on display in Coraline cannot be underestimated.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "packed to the brim with evil, hunger, and the reasons we used to leap across the dark at the top of the stairs",
      "author": "Walter Chaw"
    },
    {
      "text": "Because Selick remains true to the novel's spirit, the film rises far above being a mere novelty.",
      "author": "Kent Turner"
    },
    {
      "text": "The 3D component in Coraline is mostly in the background, but several big scenes explode with vivid color and utilize the technology in awesome ways.",
      "author": "Lori Hoffman"
    },
    {
      "text": "Borrowing a bit from Hansel And Gretel, this lush and spooky 3-D enhanced animated world both enchants and disturbs. And with giddy comic interludes by way of peculiar grownups, like the obese Venus on half shell, overstocked with big boob chuckles.",
      "author": "Prairie Miller"
    },
    {
      "text": "So dynamically careens between set pieces of elation and dread that one hardly has time to soak in all the twirling, tumbling visual marvels enveloping the screen.",
      "author": "Nick Schager"
    },
    {
      "text": "A considerable achievement of visual dread.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "It is as though Gaiman's novel were written with Selick's visual approach in mind, and it's hard to imagine the story being told in anything other than the film's seamless blend of tactile and digital media.",
      "author": "James Kendrick"
    },
    {
      "text": "Suficientemente fascinante para merecer uma forte e inequívoca recomendação.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Selick and his crack team of animators have preserved the essential non-reality of stop-motion while infusing each character, even the scenery, with a wealth of emotions",
      "author": "Andrea Chase"
    },
    {
      "text": "The film to beat in the Oscar race for 2009's best animated feature.",
      "author": "John Wirt"
    },
    {
      "text": "Doesn't pander to the audience by gratuitiously accenting the heeby-jeebies.",
      "author": "Bryant Frazer"
    },
    {
      "text": "Somewhere between Gaiman's writing and the rendering on the screen this film loses coherence with too little happening that makes sense.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "This beautifully rendered stop-animated movie is so masterfully realized, it already has staked its claim as one of the animated films to beat at next year's Academy Awards.",
      "author": "Christopher Smith"
    },
    {
      "text": "An interesting comment on parent-child relationships ... there's a certain amount of mystery ... and disappointment to [one's] parents.",
      "author": "Eric Melin"
    },
    {
      "text": "Coraline, a stop-motion 3-D fantasia, is Alice in Wonderland without an Alice.",
      "author": "Justin Strout"
    },
    {
      "text": "Coraline succeeds more so visually than it does in terms of plot and dialogue.",
      "author": "Kevin McCarthy"
    },
    {
      "text": "A remarkable work, but it's not without its flaws, nor without its potential perils for younger viewers.",
      "author": "Ken Hanke"
    },
    {
      "text": "A charming winner - the 3-D effects have the frozen in place charm of antique stereoscope postcards.",
      "author": "Richard Knight"
    },
    {
      "text": "The Wizard of Oz for the 21st century.",
      "author": "Charles Koplinski"
    },
    {
      "text": "This is a classic fantasy tale in the great tradition of the brothers Grimm and it is wonderfully visualized.",
      "author": "Robert Roten"
    },
    {
      "text": "A comfortably creepy yet modernized Grimm fairy tale in the time-honored tradition of \"be careful what you wish for.\"",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Head and shoulders above any other family fantasy in recent memory.",
      "author": "Tim Brayton"
    },
    {
      "text": "[An] elemental tale of childhood fantasies and nightmares... uncomfortabl[y] honesty about the dark side of being a kid...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Yes, it comes off as an \"Alice in Wonderland\" copy but it's still fun viewing for the whole family. The 3-D gimmick never gets old and director Selick uses it with style.",
      "author": "Ron Wilkinson"
    },
    {
      "text": "Neil Gaiman's hugely popular 2002 children's horror novel Coraline has been given the animated 3-D treatment but you may want to keep the toddlers away from this one.",
      "author": "Peter Rainer"
    },
    {
      "text": "Be careful what you wish for, kiddies. Your wish might be granted...and with it, your worst nightmares.",
      "author": "Linda Cook"
    },
    {
      "text": "Regardless of its esteemed pedigree of writer Neil Gaiman and director/animator Henry Selick (\"The Nightmare Before Christmas\") this creepy gothic kids' movie doesn't approach anything that the Brother Grimm cooked up on a off day.",
      "author": "Cole Smithey"
    },
    {
      "text": "[F]or all of its attempted transgressive wonderment and morbid curiosity, Coraline remains firmly grounded in convention.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "Coraline is strange and bizarre and undeniably beautiful.",
      "author": "Rebecca Murray"
    },
    {
      "text": "While the 3-D effect is truly spectacular, it's the story that stokes the imaginations of children.",
      "author": "Gary Brown"
    },
    {
      "text": "A mastery of inspiration by writer-director Henry Selick. At the finale of this visual delight, every hired hand and technician also deserve acclaim.",
      "author": "Matthew Sorrento"
    },
    {
      "text": "Offbeat and wildly imaginative.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "[There] are places where [director Henry] Selick and the animators do such a good job that you'll swear it's a four-dimensional movie and not three.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Coraline mixes the dark and the light in the perfect amounts; the result is all the sweeter for having dared to tread the bitter path of childhood fears and uncertainties.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "A rare animated movie that adults might be tempted to check out with or without kids in tow.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "This is sure to be on permanent loop in homes everywhere, and deservedly so.",
      "author": "Peter Paras"
    },
    {
      "text": "probably the most refreshing thing I've seen in months and easily the first great film of 2009",
      "author": "Kevin Carr"
    },
    {
      "text": "It's a movie of consummate technical sophistication that evokes the half-forgotten terrors of childhood with a spine-tingling precision.",
      "author": "Kurt Loder"
    },
    {
      "text": "Selick puts his real faith not in the gimmickry that Coraline's audiences will think they've shown up for, but in the stronger virtues that they'd likely view as old-fashioned: character, and story, and so on.",
      "author": "Bob Mondello"
    },
    {
      "text": "A foreboding, whimsical, altogether spectacularly mounted fable.",
      "author": "Dustin Putman"
    },
    {
      "text": "A visual stunner that takes animation to thrilling new heights.",
      "author": "Pete Hammond"
    },
    {
      "text": "Coraline proves dazzling on the surface, but in the end that's all it is.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "[The] chilly visual vocabulary, along with a narrative that too often detours into ingenious irrelevancies, makes Coraline an object to be admired, but not embraced.",
      "author": "Richard Corliss"
    },
    {
      "text": "There really needs to be more films with smart, mischievous young girls.",
      "author": "Jenni Miller"
    },
    {
      "text": "Like Coraline in the doppelgänger world, we swoon over all the neat stuff without ever making ourselves at home.",
      "author": "Dana Stevens"
    },
    {
      "text": "Coraline is equal parts fanciful, menacing, beautiful, and subversive.",
      "author": "Tracie Cooper"
    },
    {
      "text": "A a children's entertainment that's much too scary for little kids (ugly insects provide a pervasive visual motif) and too lifeless to enchant older audiences.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Gorgeously fantastic, in all senses of the word.",
      "author": "Jette Kernion"
    },
    {
      "text": "Coraline is a plucky heroine, and director Selig's imagination is indisputable. But the story falters in parts, and its dark tone could be off-putting for children.",
      "author": "Claudia Puig"
    },
    {
      "text": "This animated screen rendering of Neil Gaiman's masterful children's horror fantasy is so full of life and texture, it's almost gilding the lily to add the third dimension to it.",
      "author": "Peter Howell"
    },
    {
      "text": "The effect is enchanting, and in the best sense of the word, homemade.",
      "author": "Chris Hewitt"
    },
    {
      "text": "What a rich, strange vision it is.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Nearly everything in Coraline has been painstakingly handmade.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "This PG-rated film, though visually splendid and thoroughly engaging, is also too eerie for most kids.",
      "author": "Carla Meyer"
    },
    {
      "text": "Cool but creepy animated fantasy too scary for young kids.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "This is perhaps the most effective 3-D movie I have ever seen, with a sophisticated, involving story that will appeal to many adults.",
      "author": "Lou Lumenick"
    },
    {
      "text": "An extraordinary achievement that nevertheless falls short of its full potential, Coraline is absolutely worth seeing, for older children and adults alike.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "Coraline is a remarkable feat of imagination, a magical tale with a genuinely sinister edge.",
      "author": "Kenneth Turan"
    },
    {
      "text": "What a beautiful world Henry Selick has created with CORALINE.",
      "author": "JimmyO"
    },
    {
      "text": "Coraline impresses mightily. It's just not particularly enjoyable.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Coraline is a hand-crafted masterpiece of American animation.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "It is a sumptuous visual feast and a perfectly enchanting story.",
      "author": "Amy Biancolli"
    },
    {
      "text": "Although fairytale, art and cinema references abound, Coraline is thoroughly and excitingly original -- and quite possibly the best 3-D movie ever made.",
      "author": "Jennie Punter"
    },
    {
      "text": "Spooky, stunning and savvy, Coraline is one of those kids movies that makes you wonder if all the kids are going to walk out of the theater with hair scared white and eyeballs frozen in awe.",
      "author": "Tom Long"
    },
    {
      "text": "While this stop-motion-animated fantasy film might be a little much for some really sensitive young viewers, it's visually inventive and captivating.",
      "author": "Jeff Vice"
    },
    {
      "text": "The writer-director and his gifted animators impress with stop-motion detail. Yet Coraline is short on delight",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Parents may need to give a reassuring squeeze now and then, but Coraline is the best kind of children's entertainment -- smartly told and deeply felt.",
      "author": "Tom Maurstad"
    },
    {
      "text": "I suspect you could turn the sound off and still be terrified, amused and delighted.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Selick catches you, along with Coraline, in a spider's web, and his visual splendor transfixes you, even when you feel the strands tightening around your brain.",
      "author": "Michael Sragow"
    },
    {
      "text": "Coraline is a treasure, and if families don’t take the time to discover it, they’ll be missing out on a creepy angelic sensation worth cheering.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "This is a rich, intricate world of microscopic detail, nothing short of complete, immersive enchantment.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "Parental Content Review",
      "author": "Jim Judy"
    },
    {
      "text": "Selick creates a visual wonderland, with a timeless animation style that will make this a favorite for repeat viewings.",
      "author": "Michael Smith"
    },
    {
      "text": "On a technical level alone, Coraline is a stunning achievement and may just be the finest example of stop-motion animation yet put onscreen.",
      "author": "Ethan Alter"
    },
    {
      "text": "Creative visual effects but little emotional vibrancy in the central story.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Scary and sinister, aimed at children age eight or over...and be sure to view it in 3-D because that's where the creepy magic is hidden.",
      "author": "Susan Granger"
    },
    {
      "text": "A fascinating, cautionary tale for those of us who are always thinking the grass is always greener",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Too bad the filmmakers didn't utilize more of the closing credit techniques throughout.",
      "author": "David Kaplan"
    },
    {
      "text": "With its dark tale of changeling parents and imprisoned souls, Coraline comes closer to the bracing spirit of the traditional European fairy tale than perhaps any other film, animated or otherwise, in recent memory.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "It's a film for grownups that remember their childhood, and it's a film that takes animation in America to an entirely new level. It's \"dark\" and it's a \"masterpiece.\"",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Coraline lingers in an atmosphere that is creepy, wonderfully strange and full of feeling.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's not just the 3-D glasses that add an extra dimension to the horror and hilarity of Coraline.",
      "author": "Peter Travers"
    },
    {
      "text": "Just the kind of kids' movie I like... It'll scare the crap out of them as well it should. Something's gotta toughen them up.",
      "author": "Fred Topel"
    },
    {
      "text": "Writer-director Henry Selick's delightfully imaginative toon delves into another dreamscape.",
      "author": "Susan Tavernetti"
    },
    {
      "text": "The story is always front and center, and it never fails to delight, and at times terrify, the audience.",
      "author": "David Medsker"
    },
    {
      "text": "You should go and see it, if only to remind yourself that entertainment for children can be challenging, and beautiful, and brutal, and hard to watch sometimes.",
      "author": "Coco Forsythe"
    },
    {
      "text": "At the dawn of a new age of 3-D filmmaking, the stop-motion/3-D hybrid Coraline is going to make you gasp out loud.",
      "author": "James Verniere"
    },
    {
      "text": "This is the perfect movie to show a kid who's outgrown the Little Mermaid phase of her or his life, right before you sit the child down in front of Eraserhead for the first time.",
      "author": "Dave White"
    },
    {
      "text": "After watching it I can only say, if you're curious about this story, read the book, and don't bother with this version.",
      "author": "Scott Nash"
    },
    {
      "text": "There is more imagination and invention on display here than in all the films of January put together.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Deeply frightening, telling a story that could bore into your kids' nightmares if you're not careful.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Anytime one of these [stop-motion animated films] turns up, and turns up well, we should show gratitude for the treasure.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "Easily the best movie of the young year so far and the first worthy contender for Best Animated Film of 2009.",
      "author": "Brian Tallerico"
    },
    {
      "text": "A visual masterpiece combined with a decent story",
      "author": "Willie Waffle"
    },
    {
      "text": "A visually stunning family-oriented fantasy that will simultaneously enchant kids and creep out parents.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "The animation is just plain jaw-dropping, and the implementation of 3D gives the film an added boost of visual splendor. You feel like you're living it.",
      "author": "Randy Shulman"
    },
    {
      "text": "The creepier it gets, the more mesmerizing the visuals, ravishingly grotesque and dazzlingly inventive.",
      "author": "Nell Minow"
    },
    {
      "text": "keeps the welcome resurgence of mildly-intelligent, strangely-topical animated features rolling.",
      "author": "Chris Cabin"
    },
    {
      "text": "Is it premature to assign it classic status?",
      "author": "Carrie Rickey"
    },
    {
      "text": "Children who like being scared will get a kick out of this wildly creative movie; adults needn't have a child in tow to enjoy it, too.",
      "author": "Moira MacDonald"
    },
    {
      "text": "It's easy to take the seamless complexities of stop-motion for granted. But from grand design to the smallest detail, the craftsmanship of Coraline is impeccable.",
      "author": "Duane Dudek"
    },
    {
      "text": "For all its visual delights, Coraline remains more an engaging spectacle than a connective drama.",
      "author": "Desson Thomson"
    },
    {
      "text": "Nothing short of magical.",
      "author": "Tasha Robinson"
    },
    {
      "text": "If you have a 10-and-up who's drawn to alt-comics, smart books, dark clothing, and general pop culture subversion, the movie will be his or her Wonderland.",
      "author": "Ty Burr"
    },
    {
      "text": "If 3-D is going to survive in cinemas as more than a carnivalesque gimmick, filmmakers will have to deliver more movies like the macabre and wonderful 'Coraline,' in which... the 'dimensionality' becomes part of the story.",
      "author": "John Beifuss"
    },
    {
      "text": "One of the best, biggest mind-blowing experiences you're likely to have in the theater this year -- and normally I hate dead superlatives like 'mind-blowing,' but it's the only sincere phrase I can think of here.",
      "author": "James Rocchi"
    },
    {
      "text": "Would the 8-year-old me have fallen for Coraline? Maybe not. Like my own 8-year-old, at that age I was more into comedy than anything designed to give me the comic willies. But the adult me is a big fan.",
      "author": "Michael Phillips"
    },
    {
      "text": "Sure, there's no subtext about saving the planet, but for 2009, Pixar's got to play catch-up.",
      "author": "Amy Nicholson"
    },
    {
      "text": "...the first 3-D movie that made me forget I was watching 3-D - and that's a good thing.",
      "author": "Josh Larsen"
    },
    {
      "text": "The most unnerving kids movie in many a full moon, and also one of the best.",
      "author": "Gary Thompson"
    },
    {
      "text": "For a movie that rarely leaves the house, Coraline takes a number of inspired detours.",
      "author": "Scott Von Doviak"
    },
    {
      "text": "A stop-motion-animation classic-to-be...both in concept and execution, Coraline is wildly creative stuff.",
      "author": "Peter Canavese"
    },
    {
      "text": "A work of wondrous animation with engaging characters, charming dialogue and more than a few intense moments.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Coraline, director Henry Selick's adaptation of Neil Gaiman's novel, is essentially a horror movie for kids, but it is also gentle and funny and whimsical, and even in its darkest moments, Selick never forgets who his target audience is.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "The problem is Gaiman's story, which keeps accumulating otherworldly mythology but doesn't establish a clear line of action in the home stretch.",
      "author": "J. R. Jones"
    },
    {
      "text": "Coraline may prove unsuitably macabre for the youngest viewers. Yet your children and you are unlikely to see a film anytime soon that has more of a handmade feel -- a value unto itself.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "The incredible stop-motion 3-D animation only magnifies the story. And it's a great story.",
      "author": "Jane Clifford"
    },
    {
      "text": "A veritable portfolio of dazzling stop-motion sequences so virtuosic as to lift you not only out of your workaday brain but, sometimes, out of the film itself as well.",
      "author": "Shawn Levy"
    },
    {
      "text": "I admire the film mostly because it is good to look at.",
      "author": "Roger Ebert"
    },
    {
      "text": "A consistent splendor to behold.",
      "author": "Scott Foundas"
    },
    {
      "text": "It's a gorgeous picture to behold, but fails to absorb smoothly, for the surreal nature of the material often overwhelms basic storytelling requirements. Coraline is an easy film to admire, but not always to watch.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Elements of this movie are too dark; it feels like Invasion of the Body Snatchers for kids",
      "author": "Diana Saenger"
    },
    {
      "text": "The imaginative story makes vivid use of 3-D technology, but beware: It's potentially super-scary for small kids.",
      "author": "Thelma Adams"
    },
    {
      "text": "The 3-D isn't a Super Bowl-commercial-style gimmick, but instead a savory essential element, used with restraint and in artfully deliberate contrast to the grounded tactility of Selick's signature stop-motion animation.",
      "author": "Jonathan Kiefer"
    },
    {
      "text": "Coraline is a spectacle you'll enjoy from start to finish.",
      "author": "Steve"
    },
    {
      "text": "Selick effortlessly immerses the audience in a surreal fantasia.",
      "author": "Josh Bell"
    },
    {
      "text": "Mind-blowing, stunningly beautiful and ingenious, I'll risk being struck by lightning and say Coraline far surpasses director Henry Selick's best known work, The Nightmare Before Christmas.",
      "author": "Diva Velez"
    },
    {
      "text": "An animated film that might be too good for children. It arrives in time to expose the atrocious Wall-E.",
      "author": "Armond White"
    },
    {
      "text": "...a marvel of storytelling and technology melded together into a wonderful whole.",
      "author": "Robin Clifford"
    },
    {
      "text": "Coraline, the first stop-motion animated film to be conceived and shot in 3-D, is visually dazzling, as you'd expect -- but strangely joyless.",
      "author": "Christy Lemire"
    },
    {
      "text": "Tales of alternate worlds are always fascinating when done right, and Coraline fits that description.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "This thrilling stop-motion animated adventure is a high point in [Henry] Selick's career of creating handcrafted wonderlands of beauty blended with deep, disconcerting creepiness.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "The 3-D in Coraline is so low-key that I forgot it was there for much of the film. But maybe that's less a knock on the visuals than it is a compliment to the movie's ability to pull me into its zany world.",
      "author": "Phil Villarreal"
    },
    {
      "text": "The first stop-motion animated feature in stereoscopic 3-D is a multi-dimensional show-stopper -- an idiosyncratic adolescent adventure tale as well as its own bright shiny new thing.",
      "author": "Brent Simon"
    },
    {
      "text": "Deliciously macabre...an animated film with a true touch of dark poetry.",
      "author": "Frank Swietek"
    },
    {
      "text": "In a genre packed with derivative visuals and too hip for homeroom pop culture jibes, Coraline is a welcome return to pure animation splendor.",
      "author": "Bill Gibron"
    },
    {
      "text": "A modern fairy tale with visual wonders to spare... Handcrafted, obviously, means something special with a movie like this.",
      "author": "Marshall Fine"
    },
    {
      "text": "In the same way that movies like Waltz with Bashir and Persepolis open up the possibilities of animated storytelling for adults, Coraline dares aim above the heads of toddlers.",
      "author": "Alonso Duralde"
    },
    {
      "text": "What Coraline has is a plucky and sassy little girl who's a gas to spend time with. After 100 minutes, you'll follow her anywhere.",
      "author": "Mark Keizer"
    },
    {
      "text": "Selick's work has always been fascinating, but he has never had better material to work with than Coraline (sorry, Roald Dahl and Tim Burton.)",
      "author": "Jurgen Fauth"
    },
    {
      "text": "Coraline works as long as you don't expect it to stick with you.",
      "author": "Joshua Tyler"
    },
    {
      "text": "A certain leisurely pace in the first act and a bit of routine mopping up in the third are all that stand between it and genuine masterpiece status.",
      "author": "Rob Vaux"
    },
    {
      "text": "The 3-D effects aren't overdone but are used intelligently to make this world come brilliantly to life.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Although it features some of the most exquisite stop motion animation seen to date, even more glorious to watch in 3D, the tone of the film is curiously unsympathetic.",
      "author": "Mike Goodridge"
    },
    {
      "text": "Eerily inhabiting the netherworld where a young girl's wildest dreams become her cruelest nightmares, Coraline is a dark delight.",
      "author": "Justin Chang"
    },
    {
      "text": "[Director] Selick has a great fantasy filmmaker's artistry, but he lacks that overflowing Geppetto-esque love that brings puppets to life. In Coraline, he's woozy with his own lyricism.",
      "author": "David Edelstein"
    },
    {
      "text": "As fine-looking a 3D stop-motion fantasy that four years of top-flight craftsmanship can produce.",
      "author": "Bill Weber"
    }
  ],
  "release_year": 2009,
  "duration": 100,
  "genres": [
    "Kids & Family",
    "Fantasy",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "While exploring her new home, a girl named Coraline (Dakota Fanning) discovers a secret door, behind which lies an alternate world that closely mirrors her own but, in many ways, is better. She rejoices in her discovery, until Other Mother (Teri Hatcher) and the rest of her parallel family try to keep her there forever. Coraline must use all her resources and bravery to make it back to her own family and life.",
  "popularity": 7.4,
  "poster_url": "https://image.tmdb.org/t/p/original/4jeFXQYytChdZYE9JYO7Un87IlW.jpg"
}