{
  "movie_name": "Crazy Rich Asians",
  "movie_id": "crazy_rich_asians",
  "total_reviews": 373,
  "reviews": [
    {
      "text": "[\"Crazy Rich Asians\"] balances sharp cultural commentary and astonishingly fresh direction with the kind of classic, escapist tone that a lot of filmmakers seem to have forgotten how to use in their recent stabs at romance.",
      "author": "Ankit Ojha"
    },
    {
      "text": "Crazy Rich Asians is a crowd-pleaser with a spark of resonance.",
      "author": "Caroline Cao"
    },
    {
      "text": "Wu’s magnetic performance pulls you toward Rachel’s side; you want her to stand up for herself, you want her to choose what’s best for her, even if it’s not the easy thing, which is what truly makes this movie unforgettable.",
      "author": "Patricia Karounos"
    },
    {
      "text": "Glitzy lifestyles are part of its fun, but its truest wealth is the good-hearted spirit that underpins its mix of comedy and soap opera.",
      "author": "Edward Porter"
    },
    {
      "text": "Crazy Rich Asians is a romantic comedy about the lifestyles of the incredibly wealthy and feature mostly East Asians and...South-East Asians. Watching in the diaspora felt good because you get to see how hard it is for Rachel to navigate and be accepted..",
      "author": "Maia Rose"
    },
    {
      "text": "The costumes are gorgeous, the scenery is stunning and the cast is top-notch...",
      "author": "Brian T. Carney"
    },
    {
      "text": "“Crazy Rich Asians” doesn’t reinvent the romantic comedy or stretch it in any new directions. The ‘fish out of water’, ‘meet the parents’, and ‘rags meets riches’ story elements have been done many times before. This film simply does them better.",
      "author": "Keith Garlington"
    },
    {
      "text": "That seldom experienced rom-com that proves crowd-pleasing and accessible without demeaning itself.",
      "author": "Brian Eggert"
    },
    {
      "text": "Films like Crazy Rich Asians don't come around a lot, but for goodness sake, let's see more of them.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The opulence of Crazy Rich Asians makes it different from other movies, but it's the solid and straightforward storytelling that makes it great.",
      "author": "Alex Bentley"
    },
    {
      "text": "Episode 7: Globalism",
      "author": "Taylor Baker"
    },
    {
      "text": "It ties itself to its theme very well: the idea that relationships are affected by differences in social class...how the stereotypical Western mindset of individuality clashes with the more Eastern mindset of the community.",
      "author": "Nicholas Oon"
    },
    {
      "text": "A good rom-com should sustain that sensation of blissful ignorance from credits to credits, and Crazy Rich Asians is a great rom-com, full of bubbles and bliss.",
      "author": "Jason Adams"
    },
    {
      "text": "Fun and memorable characters portrayed by a talented cast, and is full of beautiful sets, costumes, and locations.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Crazy Rich Asians represents people and places with so little thought that it upholds a painful, brutal hegemony that's painfully apparent to people who live in Southeast Asia, where the film is actually set.",
      "author": "Li Sian Goh"
    },
    {
      "text": "An escapist fantasy that entertains with its labyrinthine soap opera twists and turns, lush settings and all Asian cast but also digs a little deeper into the similarities and differences between the characters and cultures.",
      "author": "Richard Crouse"
    },
    {
      "text": "That soundtrack leaves one wondering ultimately for whom this film is made.",
      "author": "Martin Tsai"
    },
    {
      "text": "It is a fair bit better than whatever your idea of a generic rom-com is.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Buoyed by a stellar cast, Crazy Rich Asians rises above its rom-com center with a unique perspective on the Asian experience that is sure to resonate with its intended audience.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "[Crazy Rich Asians] represents a watershed moment in Hollywood, one that couldn't come at a more critical time as political forces seek to divide us, not unite us.",
      "author": "Joey Morona"
    },
    {
      "text": "...the conflict comes from honest and organic places...",
      "author": "David Bax"
    },
    {
      "text": "It's an uphill battle to complement the bland drama of culture clashes, foreign traditions, and elitist snobbery (it's terribly easy to despise the super rich).",
      "author": "Mike Massie"
    },
    {
      "text": "It's the quintessential romantic comedy with a twist...",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "A successful culture clash rom-com carried by a three-dimensional star turn from Constance Wu.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "If this is the future of rom-com, consider me converted. I was so impressed by the overall film and would recommend it to anyone.",
      "author": "Lucy Buglass"
    },
    {
      "text": "There are some pretty complex themes here, and they're wrapped up in bubbly Hollywood fare. That's mostly a good thing.",
      "author": "Matt Cipolla"
    },
    {
      "text": "Crazy Rich Asians is a triumph on two fronts; both in it's diverse cast and it's beautiful storytelling.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Asian characters deserve a rom-com. Asian characters deserve to be in love! And with each other! If Asian viewers can see themselves portrayed in many different ways on screen, then they can believe that they can be many different things in real life.",
      "author": "Raffy Ermac"
    },
    {
      "text": "Crazy Rich Asians does end up falling for the same gimmicks we've seen before ... But as a cultural statement, it's a necessary move in the right direction.",
      "author": "Allen Almachar"
    },
    {
      "text": "The materialistic plot is constantly trying to land the idea that being a millionaire is the best. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "The jokes are so broad, the characterization so flat and the story so formulaic that I had a truly difficult time sustaining the excitement I feel that this film even exists.",
      "author": "Steven Prokopy"
    },
    {
      "text": "It lived up to my expectations.",
      "author": "Andrew Galdi"
    },
    {
      "text": "It was certainly a better movie than it was a book... This is exactly what I wanted.",
      "author": "Avaryl Halley"
    },
    {
      "text": "...the heart of the film is Yeoh, who is finally getting her due...Eleanor could have easily been dismissed as a stereotypical villain, but Yeoh gives her great nuance, and her backstory demands we have empathy for her.",
      "author": "Frank J. Avella"
    },
    {
      "text": "[A] joyous, universally relatable film in the tradition of the best mainstream rom-coms.",
      "author": "Dan Scully"
    },
    {
      "text": "A glitzy offering that asks for a redemption that perhaps will never be reconciled.",
      "author": "Danielle Wu"
    },
    {
      "text": "While the dissection of family values in Chinese culture goes beyond the stereotypes, Crazy Rich Asians is not a film willing to sacrifice a good time for depth. Go for the luxury, stay for the killer one-liners.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "The film succeeds because Chu and company are strongly empathetic toward the targets of their comedy. The foibles of the Crazy Rich Asians are just like ours, only more expensive.",
      "author": "Chris McCoy"
    },
    {
      "text": "Crazy Rich Asians is not only the perfect rom-com, but it's the first rom-com I've seen in ages that hasn't bored me to tears.",
      "author": "Aly Caviness"
    },
    {
      "text": "Crazy Rich Asians is delightful and features an array of great performances. Funny yet inoffensive, sweet but not overly sentimental, it is one of the best rom-coms in recent years.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Rare is the film one can describe as effervescent, but \"Crazy Rich Asians\" is just that. It bubbles like champagne, gleams like gold, and keeps up an energy level seldom seen onscreen these days.",
      "author": "Jeff York"
    },
    {
      "text": "In the main Crazy Rich Asians works. It is a comedy, and it absolutely generated enough laughs to do its job.",
      "author": "Grant Watson"
    },
    {
      "text": "Crazy Rich Asians has been burdened with a great deal of responsibility.",
      "author": "Mimi Wong"
    },
    {
      "text": "With all the colorful characters and so much eye candy, this film is more than palatable.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Despite being groundbreaking for its cast and subject matter, it also throws back to an age of Hollywood when romantic comedies were flashy, a little corny, but grounded by its characters.",
      "author": "Karl Delossantos"
    },
    {
      "text": "The most compelling performance, even in such impressive company, is Michelle Yeoh as the lioness of a protective mother.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Crazy Rich Asians - Hilarious, Heartwarming, and Historic!",
      "author": "Allison Rose"
    },
    {
      "text": "Nothing could prepare New York economics professor Rachel Chu for the stonking wealth she encounters when her boyfriend flies her First Class (natch) to Singapore to brave his full-on family",
      "author": "Andiee Paviour"
    },
    {
      "text": "Sadly, a celebration and opulent humanizing of the wealthiest wealthy people at this moment feels like waving a Cayman Island flag aboard Betsy DeVos's yacht.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Chu's direction recalls the gentle humor and romantic charm of the great Ernst Lubitsch, especially in the final reveal at the film's deliriously romantic climax.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Crazy Rich Asians is not about real-world politics and economics but is instead a fairy-tale romance of a regular woman thrust into the world of the rich elite. And it's a great fairy-tale even when it's not a great film.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Crazy Rich Asians features an absolutely fantastic cast, clever writing, and enough style to overcome any rom-com clichés it indulges in.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "It's fun, light-hearted, cute, and very funny.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "May have a familiar base but there's a fresh gloss that's been applied that allows Jon M. Chu's comedy to reign as a new wave for a genre that too often settles for mediocrity.",
      "author": "Peter Gray"
    },
    {
      "text": "When she lands in Singapore, Rachel is like an innocent butterfly emerging from her American middle-class cocoon - into the awaiting mouths of snobbish, bejeweled bullfrogs.",
      "author": "Antonio Sison"
    },
    {
      "text": "Those who've lamented the dearth of rom-com films over the last several years will rejoice, for Crazy Rich Asians more than compensates.",
      "author": "Wendy Shreve"
    },
    {
      "text": "This is a terrific little picture, one that checks all the traditional rom-com boxes.",
      "author": "Kurt Loder"
    },
    {
      "text": "Crazy Rich Asians hits all the expected notes expertly and stuck me right in the center of my romantic comedy-loving heart square with an opulent, diamond-studded arrow.",
      "author": "Amie Simon"
    },
    {
      "text": "On top of its historical significance, Crazy Rich Asians is a great movie, period. I laughed, I cried, sometimes both at the same time. Thanks Jon M. Chu and the phenomenal cast, it's such a joyful experience that's both funny AND romantic.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Overall it's a movie that has it all!",
      "author": "Rachel Wagner"
    },
    {
      "text": "Crazy Rich Asians is a classic romantic comedy done right...",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Sure, there are some unnecessary side characters and the wealth worship is a bit off putting, but the romance and humor are mostly on point, and the cultural nuance and themes are crazy good.",
      "author": "Aaron Dicer"
    },
    {
      "text": "The wholehearted embrace of cultures is not the only reason why the film works. It succeeds just as much as a celebration of that as it does in returning the romantic-comedy back to its rightful crowning place, as a genre that can surprise and delight.",
      "author": "Debbie Zhou"
    },
    {
      "text": "Crazy Rich Asians is a great romantic comedy that happened to star all Asians. This movie is great if you're Asian. This movie is also great if you're not!",
      "author": "Tracey"
    },
    {
      "text": "Flawed, yet still easily the biggest, best, and most memorable romcom in years. A single viewing won't suffice.",
      "author": "Rachel Brook"
    },
    {
      "text": "While Crazy Rich Asians might be mired in melodrama and unoriginal story lines, it's not a bad movie.",
      "author": "Amanda Greever"
    },
    {
      "text": "This somewhat cheesy crowd-pleaser offers a great deal of neurotic gossip addressed with annoying pomposity and superfluous multi-cultural fashion.",
      "author": "Filipe Freitas"
    },
    {
      "text": "A sumptuous visual feast.",
      "author": "Fiona Underhill"
    },
    {
      "text": "[Crazy Rich Asians is] bursting with culture, glamour, color, humor and heart.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Apart from the representation-argument, the film itself was... average. The plot was trope-laden, the performances were average at best, and most characters were cut-outs of your usual rom-com cast.",
      "author": "Ciaran Kerr"
    },
    {
      "text": "[Director Jon M. Chu] dares to tread where no Hollywood movie about Asia ever has.",
      "author": "Kaori Shoji"
    },
    {
      "text": "With great performances that made me cry a few times, a story that reaches the depths of a shark cage, and an absolutely impeccable production, you'll sure be sad to be poor.",
      "author": "Amanda Sink"
    },
    {
      "text": "... funny, insightful, and psychologically astute, offering a sardonic view of life among super rich Chinese from the point of view of an outsider...",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "When it comes to standard issue rom-com territory, Crazy Rich Asians nears perfection. It's impossible not to fall victim to the film's abundant charms.",
      "author": "Louisa Moore"
    },
    {
      "text": "Fifty Shades of Cray.",
      "author": "Matt Brunson"
    },
    {
      "text": "It may not be anything particularly new, but the movie presents well-crafted and likable characters, an enjoyable story and some good laughs to create a real feel-good time.",
      "author": "Matt Hudson"
    },
    {
      "text": "Crazy Rich Asians looks more like a glossy tourist magazine produced for an international economics summit than a movie.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Islands are rented out, a fairytale wedding will make for one of the most beautiful ever captured on film, and you will get lost in the beauty of Singapore.",
      "author": "Alan French"
    },
    {
      "text": "A sparkling and thought-provoking romcom (though as usual I wished the heroine ditched him). Ultimately this is about mothers doing their best for their children. And as all mothers know, whatever you do it'll probably turn out to be wrong.",
      "author": "Sarah Cartland"
    },
    {
      "text": "The camera ogles over the dresses, the jewelry, the houses, the cars, the feasts ... with a determination to render us helpless by sheer relentlessness.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "A satirical but affectionate view of Asian culture from the inside, a genuinely serious look at the place of cultural values in marriage, and most certainly far, far more fabulous set designs than any recent film. Entertaining and fun.",
      "author": "Monica Reid"
    },
    {
      "text": "... simply a great time at the movies built to relieve through catharsis and creature comforts alike.",
      "author": "Chris Feil"
    },
    {
      "text": "It is with great pleasure to say that Crazy Rich Asians is a load of fluffy, old-school rom-com fun, all thanks to likable leads, memorable characters, visual pizazz and some welcome thematic weight thanks to its respectful look at family traditions.",
      "author": "Harris Dang"
    },
    {
      "text": "A wholly enjoyable, delightful, and relevant rom-com that solidifies Constance Wu as an absolute star.",
      "author": "Brian Gill"
    },
    {
      "text": "Not often are the words 'rom-com' and 'spectacle' paired together. Crazy Rich Asians is an absolute must-see.",
      "author": "Cameron Frew"
    },
    {
      "text": "If any Hollywood movie were so completely devoid of black, Asian or Latino characters it would be torn to shreds by the same critics that find Crazy Rich Asians refreshing and empowering.",
      "author": "John McDonald"
    },
    {
      "text": "No matter how many jokes are made that pretend to laugh at the rich, there is a rejoicing in capitalist inequality that borders on obscenity. [Full review in Spanish]",
      "author": "Gaspar Zimerman"
    },
    {
      "text": "A film that breathes some much-needed life into a genre that has had a spotty at best track record in recent years.",
      "author": "Micheal Compton"
    },
    {
      "text": "A romantic comedy that connects with our times, but its artistic level does not transcend the generic rules and formulas. [Full Review in Spanish]",
      "author": "Néstor Burtone"
    },
    {
      "text": "Crazy Rich Asians transcends borders claiming love stories as potential creators of meaning in a moment where the screens are multiplied with superheroes. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "One of the best times you will have in a cinema in 2018.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Crazy Rich Asians is a pleasant greeting card of a movie, designed to not so much impress as mollify.",
      "author": "Sean Collier"
    },
    {
      "text": "It's easy to appreciate yet another blockbuster with a cast of minority actors proving that they never had anything to prove in the first place.",
      "author": "Tomas Trussow"
    },
    {
      "text": "This is the accidental genius of Crazy Rich Asians; it shows how wealth, in the end, makes fools of us all.",
      "author": "Rebecca Liu"
    },
    {
      "text": "It seems fair to warn that the film shouldn't be seen on an empty stomach or after an itinerary-less month.",
      "author": "Nguyên Lê"
    },
    {
      "text": "I would watch a phone book if it were played by Awkwafina. She's a delight.",
      "author": "Eve Tushnet"
    },
    {
      "text": "It's lively and colorful, fun but significant; there's a little bit of everything here for everyone to enjoy.",
      "author": "Matthew Passantino"
    },
    {
      "text": "The best studio romantic comedy of the year",
      "author": "Nate Adams"
    },
    {
      "text": "If you are tired of watching all those Disney princess movies coming out of Hollywood, then give this one a chance, just to see it done with an all-Asian cast.",
      "author": "Devesh Sharma"
    },
    {
      "text": "Watching its characters, Steve Rogers' quip instantly comes to mind: \"Take away the money, what are you?\" Unfortunately for Crazy Rich Asians, it has neither the wit nor the likability of Tony Stark. Instead, it drawls like Bruce Wayne, \"I'm rich.\"",
      "author": "Rohan Naahar"
    },
    {
      "text": "'Crazy Rich Asians' is a wealth of fun.",
      "author": "Linda Cook"
    },
    {
      "text": "A romantic comedy that manages to escape some of the genre's cliches, moving away from its potentially soap-operaish roots. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Despite Wu's sympathetic performance as an independent woman willing to sacrifice her own happiness, in the end it's still all about getting the guy.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "The razzle dazzle is eye popping, and after a while a bit wearing, as money appears to be the raison d'etre of the entire Singapore crew.",
      "author": "Anne Brodie"
    },
    {
      "text": "...a delightful romantic comedy trapped within the confines of a bloated, hit-and-miss prestige production.",
      "author": "David Nusair"
    },
    {
      "text": "A binge-able series might have been a better way to go, since the script squeezes a sprawling supporting cast into boisterous caricatures and transforms an intricate flow chart of status among Singapore's superrich into a flood of affectations.",
      "author": "Michael Sragow"
    },
    {
      "text": "What I like most about Crazy Rich Asians is the way it combines the old and the new.",
      "author": "Stephen Silver"
    },
    {
      "text": "Glimmers with emotion, exuberance and cultural specificity, engagingly and enjoyably so.",
      "author": "Sarah Ward"
    },
    {
      "text": "The strong point of the film is the fascination of having an ordinary story in an extraordinary environment, always bearing in mind that it is an American production betting on something different, for a change. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Crazy Rich Asians is a romantic comedy that manages to give a small sample of Asian culture in an enjoyable plot, full of humor and family traditions. [Full Review in Spanish]",
      "author": "Monica Urruchua"
    },
    {
      "text": "Jon M. Chu captures to perfection the tension and joy that there is in the family meetings. [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "Aside from these important issues of representation and diversity, Crazy Rich Asians marks a welcome return for the funny, giddy, likeable, glamorous Hollywood romcom.",
      "author": "Tara Brady"
    },
    {
      "text": "We want to see Rachel win [Eleanor] respect: Crouching Matriarch, Hidden Dragon. Hollywood, prepare to be beaten at more than mah jong.",
      "author": "Tom Shone"
    },
    {
      "text": "First impressions were that it's noisy, shouty and just not funny enough.",
      "author": "Matthew Bond"
    },
    {
      "text": "A comedy with brains and glamour, Crazy Rich Asians arrives in cinemas long after most of us had given up hope of ever seeing a really great romcom again.",
      "author": "Paul Whitington"
    },
    {
      "text": "It is the sweet and funny journey with its issues around wealth and family honour versus personal happiness and to an extent, nationality after immigration, that give the film a certain newness.",
      "author": "Aine O'Connor"
    },
    {
      "text": "Deeply satisfying in the way of a by-the-books romantic comedy that has found good character-based reasons for checking all of the boxes that need to be checked.",
      "author": "Tim Brayton"
    },
    {
      "text": "Somewhere between My Big Fat Greek Wedding and a Jane Austen novel: meticulous and hilariously alert to social structures, family dynamics and money, with a plucky underdog heroine.",
      "author": "Simran Hans"
    },
    {
      "text": "Michelle Yeoh takes the acting honours as the heroine's steely prospective mother-in-law.",
      "author": "Jake Wilson"
    },
    {
      "text": "Michelle Yoh is terrific not least because... you have [her] character who is very not funny in a way which is kind of impressive in a comedy.",
      "author": "Mark Kermode"
    },
    {
      "text": "A culturally complex, swoon-worthy rom-com.",
      "author": "Roe McDermott"
    },
    {
      "text": "In many ways, this supposed celebration of diversity disappoints. It doesn't matter. Its unpredictable female leads are as good as gold.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Though undeniably sweet and funny in parts, I thought it mostly vacuous, lazily- plotted nonsense.",
      "author": "Brian Viner"
    },
    {
      "text": "Chu's film brings the wealth porn of Dallas and Dynasty back with a bang.",
      "author": "Andy Lea"
    },
    {
      "text": "Crazy Rich Asians has done the impossible - created a romantic comedy not only funny and dazzling but politically relevant too, without betraying its genre-bound duty to warm the heart.",
      "author": "Gabriella Geisinger"
    },
    {
      "text": "Watch this film, fall in love - and buy a handful of scratch cards on the way home.",
      "author": "Jamie East"
    },
    {
      "text": "The director, Jon M Chu, thankfully, knows his rom-coms. There's Pretty Woman in here. There's Bridget Jones and Ever After, but he's made them new.",
      "author": "Kevin Maher"
    },
    {
      "text": "And what it's doing right is showing white people that they don't own Hollywood any more, and maybe everyone wants to applaud that. In this way, it's a terrific film.",
      "author": "Deborah Ross"
    },
    {
      "text": "[A] good-natured and spectacular comedy...",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Director Jon M. Chu keeps the plot racing along as Rachel is introduced to a small army of her boyfriend's relatives and friends.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "The whole film has an idiotic élan. It's a Jane Austen story done as razzmatazz romcom, plus a bit of all-singing, all-dancing Rebecca.",
      "author": "Nigel Andrews"
    },
    {
      "text": "It was refreshing to see a story that isn't the stereotypical story...we've heard it before and seen it in many different ways, but this one felt authentic.",
      "author": "Justin Brown"
    },
    {
      "text": "A beautiful cast, a great sense of humor, although I do have a bone to pick with this movie (and Black Panther) as the baton for people of color in films...",
      "author": "Brandon Collins"
    },
    {
      "text": "Above all, it's got that romcom magic. Like any of the best real-life weddings, it makes you simultaneously laugh and cry and go 'awww!' in the kissy bits. Suffering from post-summer holiday blues? Consider them banished.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "It deserves all the kudos it can get for its representation of Asian people (but) more than that it deserves to be seen because it's a fun, well-made romance.",
      "author": "Matt Neal"
    },
    {
      "text": "There isn't a dull moment, and Chu keeps the visuals colourful and almost jaw-droppingly over the top, never pausing the stream of food, flowers, dancers, glorious settings and beautiful people.",
      "author": "Rich Cline"
    },
    {
      "text": "A decadent fever dream of gorgeous people, places and things.",
      "author": "Patrick Sproull"
    },
    {
      "text": "Jon M. Chu's adaptation of Kevin Kwan's book stands on its own, adding key scenes, tweaking character's roles while at the same time bringing the over-the-top opulence to life",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Crazy Rich Asians is as much an environment as it is a romantic comedy... The movie takes you away, and much of the trip is a pleasurable experience, with dazzling visuals, a bright score coupled with insanely catchy pop tunes, and a charismatic cast.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Lavish, lush, gaudy...but the engine of the story it's telling, that works very well. Everything else is just padding...it's telling a more specific tale.",
      "author": "Eli Glasner"
    },
    {
      "text": "For the most part, Crazy Rich Asians feels appealingly sincere, even if its obsession with image somewhat contradicts the those-who-project-perfection-rarely-have-perfect-lives message.",
      "author": "Emma Simmonds"
    },
    {
      "text": "There aren't too many surprises in terms of story but this is still fun, engaging and entertaining.",
      "author": "Matthew Toomey"
    },
    {
      "text": "a film that adheres strictly to the formulas demanded while also being as thorough an indulgent delight as the over-the-top as the antics of the super-rich that it portrays.",
      "author": "Andrea Chase"
    },
    {
      "text": "This is a glossy, energetic romance-drama-comedy that continues the process of putting Asia in a new light.",
      "author": "Stephen Romei"
    },
    {
      "text": "This earnest and heartfelt effort seems too eager to pursue mainstream conformity by emphasizing similarities rather than embracing differences.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "An opulent, juicy, splendidly silly, tears-of-joy spectacle reminiscent of the escapist fluff of 1930s Hollywood... yet also a romantic fantasy that a progressive, feminist gal can actually feel good about.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "It's a sweet movie with a sweet story.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Gives this decades-old Hollywood blueprint a welcome, refreshing makeover.",
      "author": "Dan Webster"
    },
    {
      "text": "Buckle up son and get ready to go on a romantic adventure... because Crazy Rich Asians is an entertaining blast.",
      "author": "Amelia Navascues"
    },
    {
      "text": "Crazy Rich Asians is culturally significant, but it's still about a girl falling in love with the prince.",
      "author": "CJ Johnson"
    },
    {
      "text": "It might not reinvent the wheel, but if there's a more satisfying studio release this summer, I've yet to see it. So what are you waiting for? Run, don't walk.",
      "author": "Rubén Rosario"
    },
    {
      "text": "It's a luxury-lifestyle catalogue on a 40-foot screen. How many other movies can say that?... We go to movies for escape, and Crazy Rich Asians provides it by letting viewers revel in limitless lucre guilt-free.",
      "author": "Kyle Smith"
    },
    {
      "text": "Crazy Rich Asians brims over with charm... It's not an evenly complex portrait of wealth, but it's a film winningly possessed with heart.",
      "author": "Kelli Weston"
    },
    {
      "text": "A society rom-com with all the dazzle of Sex and the City, but without the pornography of label-worship. Rather than fawning over the excess, we feel almost offended by it.",
      "author": "Tim Martain"
    },
    {
      "text": "The basic plot of this movie is conventional. Nothing unexpected happens. What makes this stand out are the characters, which although standard for a romantic comedy, are exceptionally well defined and developed.",
      "author": "Robert Roten"
    },
    {
      "text": "You can celebrate Crazy Rich Asians for many reasons, and all of them are valid - it's an unambiguously well made and well intentioned movie that does not lead the viewer into hell.",
      "author": "Alex Doenau"
    },
    {
      "text": "A funny, feel good, crowd-pleasing movie [but it's] not the ground-breaker it's being made out to be. It's simply the latest logical progression in the growing prominence of Asians in Western films, something that has been evolving for more than 60 years.",
      "author": "Jim Schembri"
    },
    {
      "text": "All of these connections, nuances, histories and complex class structures are enveloped within the confines of a charming and very amiable romantic comedy, styled after the uncomplicated screwballs of old Hollywood.",
      "author": "Oggs Cruz"
    },
    {
      "text": "This reviewer is here to tell you the romantic dramedy's runaway success is no fluke, and more than warranted. It delivers a splendid time at the movies the likes of which is all too rare from a studio release.",
      "author": "Steve Murray"
    },
    {
      "text": "An effervescent breath of fresh cinematic air, this ridiculously entertaining film succeeds as an instant cultural touchstone and a reaffirmation of the joy of romantic comedies.",
      "author": "Dominic Corry"
    },
    {
      "text": "The best romantic comedy from a big studio since Bridget Jones's Diary was released in 2001.",
      "author": "Soraya Nadia McDonald"
    },
    {
      "text": "Feels blithely liberated from the obligation to offer up suffering that has long been part of the implicit bargain made with so many mainstream movies focused on characters of color-that they are treated as marketable in relation to the pain they portray",
      "author": "Alison Willmore"
    },
    {
      "text": "Crazy Rich Asians was fun stuff and really surprising in how much I enjoyed it, even going in with slightly skeptical expectations.",
      "author": "Edward Douglas"
    },
    {
      "text": "While Wu and Golding make for a very appealing screen couple, what really takes Crazy Rich Asians to the next level as a crowd-pleaser is how much life and laughable largesse can be detected deep into its supporting ranks.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Glitzy detail, pleasing comedy and amiably broad performances propping up a very familiar plot line...",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Chu is resolved not just to say nothing about the grotesque behavior of the filthy rich - despite this being at the core of Crazy Rich Asians - but to condone it, celebrate it and wallow in its vacuity",
      "author": "Luke Buckmaster"
    },
    {
      "text": "What's in a name? It should be quite obvious that such a book title is intended to be satirical. That Nick has been hiding his wealth and privileged background in order to woo Rachel tells exactly the opposite of what the book/movie title conveys.",
      "author": "Diana Cheng"
    },
    {
      "text": "It's also first and foremost, a zingy, glossy entertainment that should resonate far and wide beyond its cultural specificity.",
      "author": "Aaron Yap"
    },
    {
      "text": "Chu's direction displays a robust regard for the combined power of glamour and velocity.",
      "author": "Sandra Hall"
    },
    {
      "text": "At one juncture, someone actually intones \"this is like The Bachelor: Singapore\", which struck me as a telling moment of self-awareness in a film that far too often relies on empty spectacle and cliché for effect.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "It's crazy good.",
      "author": "Olly Richards"
    },
    {
      "text": "It's a boisterous ride that you'll want to jump on time and again, still chortling with each rewatch.",
      "author": "Wenlei Ma"
    },
    {
      "text": "...to decry it because it's just a fairy tale is to miss the point entirely.",
      "author": "Travis Johnson"
    },
    {
      "text": "Crazy Rich Asians offers a vibrant, wildly entertaining, and achingly sincere portrait of a rarely represented culture. As for that weighty proverb, Crazy Rich Asians doesn't necessarily \"move the world.\" But it does nudge it in the right direction.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "As for the cast, though she doesn't make a false step, Wu is nonetheless totally wasted. So is Yeoh.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Crazy Rich Asians presents a new conversation while also leaning on some of the clichés that have plagued the representations of Asians in film and television. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Such uniformly strong performances from so many little-seen or unknown actors is a stark reminder of the wealth of talent that is there for a slowly diversifying Hollywood to tap into.",
      "author": "Vicky Roach"
    },
    {
      "text": "I've never cried at a wedding...this wedding they had in here, I couldn't help it... at least two choke-ups and a cry.",
      "author": "Martin Thomas"
    },
    {
      "text": "What the leads do right is what the movie does right... this movie it gets the drama down... they really do feel like a couple that's in love and against all odds.",
      "author": "Korey Coleman"
    },
    {
      "text": "A fairly-harmless, often-charming and entertaining paint-by-numbers romantic comedy...it has some good laughs along the way, and I walked out having been entertained.",
      "author": "John Campea"
    },
    {
      "text": "Crazy Rich Asians is the perfect way to avoid reality, so if that sounds tempting, I suggest you avail yourself of its charms.",
      "author": "Diane Pershing"
    },
    {
      "text": "[Jon Chu] really understands the tone of the film that he's making, and he really understands the visual palette that it needs and..he even elevates that.",
      "author": "Roth Cornet"
    },
    {
      "text": "Even within what a lot of people view broadly as the same culture there are still cultural differences based on upbringing, based on background, and that's really where the strength in this movie really hit home.",
      "author": "Dan Murrell"
    },
    {
      "text": "When the movie fully shifts from its dazzling milieu to something thornier, it finally comes alive.",
      "author": "Pat Padua"
    },
    {
      "text": "Crazy Rich Asians is therefore less about love than understanding. And every little detail works towards exposing what that means on a small and large scale.",
      "author": "Jared Mobarak"
    },
    {
      "text": "This attention to the wealth of the 1% is just conspicuous consumption of another sort, and it ain't pretty or funny.",
      "author": "Martha K. Baker"
    },
    {
      "text": "Sure, Crazy Rich Asians doesn't capture my Asian American experience growing up in America, but it hits all the right notes.",
      "author": "Jennifer Chen"
    },
    {
      "text": "Charming and refreshing. Hits all the marks. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Crazy Rich Asians is a brilliant movie with a spectacular screenplay, amazing acting and set design that needs to be watched on the big screen. This is a must-watch film.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "The central irony in Crazy Rich Asians isn't that it's so much about Asians, it's more about crazy rich people - at which point ethnicity is really just a sub-category, an identifying accessory, a marketing niche.",
      "author": "Katherine Monk"
    },
    {
      "text": "[Awkwafina] nails it...It's just a good ensemble cast. You care about these people.",
      "author": "Tony Baker"
    },
    {
      "text": "Constance Wu is a bona fide movie star ... She carries the emotional weight of the movie with sophistication and strength and vulnerability and humor.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "Crazy Rich Asians takes familiar tropes and revitalizes them and it's entire genre. It prospers from a great cast, amazing direction, and powerful writing",
      "author": "Rendy Jones"
    },
    {
      "text": "As a stepping stone to greater things, this movie is important...and it's a great date movie.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "I was dancing, it was so much fun, and I left the theater feeling great.",
      "author": "Steph Cozza"
    },
    {
      "text": "It's so vibrant...it has every rom-com trope that you miss from the 90s...",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "A great movie that is so culturally significant.",
      "author": "Mark Ellis"
    },
    {
      "text": "This two-hour feel good immersion will have you contemplating the next available flights, as well as who you can share this marvellous movie experience with next.",
      "author": "James Croot"
    },
    {
      "text": "Crazy Rich Asians is a triumph of representation.",
      "author": "Andy Greenwald"
    },
    {
      "text": "Crazy Rich Asians uses elements of the golden age of Hollywood to tell a modern and entertaining story. [Full Review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "It doesn't pretend to be anything more than a lighthearted, glitzy crowd-pleaser. That's good and bad...overwrought moments are balanced with better ones, like the family dumpling-making scene where Rachel and Eleanor exchange frosty glances.",
      "author": "Loren King"
    },
    {
      "text": "As a romantic comedy, this film has nothing new to offer except the rise of a new comedy star, Awkwafina.",
      "author": "Alachia Queen"
    },
    {
      "text": "Chu's career has been a tad uneven in the past, but he shows a sure hand here, drawing fine performance from a large ensemble - especially Wu, Golding, Awkwafina and Michelle Yeoh.",
      "author": "Jim Lane"
    },
    {
      "text": "As a rom-com it falls a little short, not offering all that much 'com'. But it's romantic as hell.",
      "author": "Simon Miraudo"
    },
    {
      "text": "This slice of escapist entertainment is all about Rich People Problems, but looking in from the outside is just so much fun.",
      "author": "John Lui"
    },
    {
      "text": "The elements that create interest such as cultural differences, familial secrets and obligations, the love of a mother and her child and, of course, romance, strongly shine through.",
      "author": "Pamela Powell"
    },
    {
      "text": "Storywise, it's all familiar territory, but the lead performances are charming, and the central characters are intelligent, complex people you enjoy spending time with.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Judging by the talent on display here, Crazy Rich Asians could be a harbinger of more than the rom-com's rebirth.",
      "author": "Margot Harrison"
    },
    {
      "text": "It's ridiculous that anyone thinks a single film can capture the Asian experience, whatever that even means, but this film is a great start toward showing a wider breadth of it.",
      "author": "Fiona Li"
    },
    {
      "text": "Jon M. Chu's landmark film glosses over questions of wealth and cultural identity for sake of spectacle.",
      "author": "Kelley Dong"
    },
    {
      "text": "A solid, fun romantic comedy about very rich, very good-looking people whose dramas and obstacles are mostly self-inflicted.",
      "author": "Ben Sin"
    },
    {
      "text": "Constance Wu and Henry Golding are perfectly charming in this sweet romantic comedy, while Michelle Yeoh is here to remind us how amazing she has always been.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Yes, it's a frothy, glittery rom com, but it's also a joyful, flashy, feel-good pic that takes you on a fabulous field trip you'll be gushing over for weeks.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Crazy Rich Asians is the rare film that shows we can have it all.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "Forget being an Asian American film or a rom-com-it's just a good film.",
      "author": "Kristina Nguyen"
    },
    {
      "text": "This is a classic rom-com narrative that's been transported to the East, which adds its own mark to the genre's traditions.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "'Crazy Rich Asians' is a blast, and within minutes it will immerse you into its extraordinary extravagance and extraordinary talent.",
      "author": "Carrie Wittmer"
    },
    {
      "text": "Wu and Golding make for a pleasant central couple, but it is the supporting characters that are most memorable.",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "A glamorous confection of a romcom. It's basically the film equivalent of a chilled, bubbly glass of champagne on a steamy August night: a refreshing, classy party starter.",
      "author": "Diana Metzger"
    },
    {
      "text": "Without lazily defaulting to formula, the film reinvigorates its genre.",
      "author": "Chelsea Phillips-Carr"
    },
    {
      "text": "See Crazy Rich Asians . It's crazy entertaining, funny and sentimental. It stands as an important signpost marking new territory for Asian opportunities in Hollywood",
      "author": "Jazz Tangcay"
    },
    {
      "text": "Imagine the rowdy comedic timing of a Preston Sturges romp mixed with the subversive glamor of Ernest Lubitsch's patented \"touch.\" Yet, beneath the glorious pomp and circumstance lies a very real conflict of cultural identity and family.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "It's been billed as rom-com, but Crazy Rich Asians can hold its own in the drama department.",
      "author": "George M. Thomas"
    },
    {
      "text": "One of the best big studio-backed romantic comedies to come down the pike in years. (Full Content Review for Parents - Profanity, Sexual Content, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "It starts all flim-flam and multi coloured visuals, makes you smile and laugh until you're hooked and then it brings up the heavy guns of drama: broken loyalties, broken families, broken promises and broken hearts.",
      "author": "Andrew L. Urban"
    },
    {
      "text": "The Singapore settings are eye-popping, the food looks amazing and the story is a mix of quirky, funny and romantic. You'd be crazy to miss it.",
      "author": "Louise Keller"
    },
    {
      "text": "...at once deeply formulaic and refreshingly unfamiliar.",
      "author": "Josh Larsen"
    },
    {
      "text": "A dazzling, enchanting romantic comedy that shatters Asian stereotypes.",
      "author": "Susan Granger"
    },
    {
      "text": "In Singapore, the term shiok is representative of a feeling of sheer happiness and pleasure. And I can't think of a better description for \"Crazy Rich Asians,\" the funniest, most joyous movie of the summer.",
      "author": "Al Alexander"
    },
    {
      "text": "Crazy Rich Asians is a romantic comedy giddy off its own supply -- the answer to the question of what a romantic comedy would look like if it were shot like an action film.",
      "author": "Megan Reynolds"
    },
    {
      "text": "A swooning fairy-tale romance that updates the Cinderella story to modern-day Singapore.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "Smartly funny, romantic without being cloying, and honest without resorting to manipulation.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Crazy Rich Asians is a rom-com that reveals the universal in the specific. The result is subtle in its message, sweet in sentiment, and swift in execution.",
      "author": "Frank H. Wu"
    },
    {
      "text": "The result is hugely enjoyable, and hooray for Hollywood for making it happen.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Ethnicity aside, this is one of the best and most effective rom-coms in quite a while, a movie that is sure to win over the hearts and minds of any audience demographic.",
      "author": "Tom Santilli"
    },
    {
      "text": "This is a straight-up jet-setting romcom, glossy, glam, very mainstream in style and tenor.",
      "author": "Dennis Harvey"
    },
    {
      "text": "This is all from the standard rom-com template, but the likable leads and sparky supporting cast manage to reinvigorate these old clichés.",
      "author": "Alison Gillmor"
    },
    {
      "text": "That status quo needs blowing up, and if Crazy Rich Asians can do that, great. For now, I'll settle for its well-heeled charms and the prospect of seeing some of these actors again in bigger roles.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "One of the great things that Crazy Rich Asians does is [show] you...the idea that Chinese people who continued to live in China or Singapore...have a very different view of Chinese people how grew up in America.",
      "author": "Ben Mankiewicz"
    },
    {
      "text": "[Awkwafina] almost steals the movie and never gives it back.",
      "author": "Matt Atchity"
    },
    {
      "text": "This movie is totally delightful...It's a wonderful mix of old-fashioned screwball comedy, romantic comedy, it's almost a musical at some points.",
      "author": "Christy Lemire"
    },
    {
      "text": "Not only does director Jon M. Chu do a marvelous job of bringing the lavishness of Kevin Kwan's book to life but he's filled the movie with a supporting cast that's so strong any of them could star in their own movie.",
      "author": "Rick Bentley"
    },
    {
      "text": "The rom-com is a dynamite showcase for cinema icon Michelle Yeoh.",
      "author": "Glenn Kenny"
    },
    {
      "text": "Crazy Rich Asians invites us to indulge in the lifestyles of the rich and semi-famous... and director Jon M. Chu does a deft job of making all that wealth look both super enticing and totally exhausting.",
      "author": "Angie Han"
    },
    {
      "text": "Crazy Rich Asians is an airy romcom that indulges our guilty cravings for family drama and the luxurious lifestyles of the obscenely wealthy. What's more American than that?",
      "author": "Lauren Yoshiko"
    },
    {
      "text": "While I wish Wu's Rachel had more fire, \"Crazy Rich Asians\" is frivolous fun that challenges non-Asians - white, black, Latino and Native American - to empathize with Asians and Asian-American characters.",
      "author": "Jana Monji"
    },
    {
      "text": "[Crazy Rich Asians is] also about old Chinese traditions, but more than that it is an excellent representation of contemporary China that the world has long been missing.",
      "author": "Michael Smith"
    },
    {
      "text": "In the end, though, it would all be for naught if the film didn't have heart and it does. We care deeply about these characters-and the film does, too.",
      "author": "Max Weiss"
    },
    {
      "text": "The same formula romance that has been churned out since the advent of movies. Not rich. Not crazy. Not funny when it's supposed to be and not all that dramatic.",
      "author": "Gary Wolcott"
    },
    {
      "text": "...a romantic comedy that breathes new life into the genre...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Awkwafina is great as Rachel's \"goofy best friend,\" and she almost makes viewers long for another film about her. Golding is agreeable, but one wishes he had more on his mind other than simply admiring Rachel.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Crazy Rich Asians is glorious, funny, and sexy, successfully fusing cultural specificity and crowd-pleasing romance.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Little more than a cascade of genre clichés, lightly dusted with heavy-handed, and arguably insensitive, cultural trappings.",
      "author": "Frank Swietek"
    },
    {
      "text": "Who knew the man who gave us Jem and the Holograms would be the one to save the rom-com?",
      "author": "Christian Toto"
    },
    {
      "text": "The world is on fire, enjoy this glass of champagne.",
      "author": "Sarah Marrs"
    },
    {
      "text": "As the obscenities of wealth accumulate while a large cast of Asian and Eurasian actors render their many silly characters, the source of the laughter becomes troubling.",
      "author": "Kate Taylor"
    },
    {
      "text": "It simply tells an endearing story in an exceptional way. And in so doing, it shows how great stories cross barriers and wind up enriching the world around us.",
      "author": "Adam Graham"
    },
    {
      "text": "There are meaningful observations about the ways that money warps relationships and how children struggle with their heritage. But by trying so hard to concoct a blowout party, the film exhausts and frustrates as much as it enlightens and delights.",
      "author": "Tim Grierson"
    },
    {
      "text": "Marvelous reinvention of Cinderella. Constance Wu lights up the screen. Michelle Yeoh is great as evil matriarch. Scene-stealer Awkwafina slays it.",
      "author": "James Verniere"
    },
    {
      "text": "Rom-coms are often lifestyle porn to some degree, 'Crazy Rich Asians' is just more straightforward about it. It's kitchy pop, done well.",
      "author": "Vincent Mancini"
    },
    {
      "text": "A beautiful, bland affair.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Crazy Rich Asians is romantic-comedy gold that should be celebrated not only for its cast but also for its perfect execution of light, breezy escapism.",
      "author": "Elinor Jones"
    },
    {
      "text": "It gets some wickedly funny jabs in at the fabulously wealthy. But it isn't mean-spirited. Rather, Crazy Rich Asians' prevailing mood is one of joyfulness. I got a contact high.",
      "author": "Kimberley Jones"
    },
    {
      "text": "It's the anti-Fifty Shades of Grey.",
      "author": "Brad Keefe"
    },
    {
      "text": "See this movie you must. Maybe you won't fall in love, but you'll for sure want to go steady for a while - at least for the two hours you're in the theater.",
      "author": "Maren Longbella"
    },
    {
      "text": "For a while, \"Crazy Rich Asians\" has the airborne, happy preposterousness of a good screwball comedy. Those first 60 minutes or so are a treat: lighthearted, sure-handed, zippy.",
      "author": "Mark Feeney"
    },
    {
      "text": "Crazy Rich Asians delivers an unabashedly glamorous love story, with a predictable but mostly satisfying narrative arc and plenty of entertaining, likable characters.",
      "author": "Josh Bell"
    },
    {
      "text": "Revels smartly in the excess of its subjects without being trite, superficial or dismissive.",
      "author": "Tom Meek"
    },
    {
      "text": "Dazzling delight that brings the romantic comedy genre roaring back to life.",
      "author": "Pete Hammond"
    },
    {
      "text": "Think of it as a trip to a cinematic spa in the company of some of the world's best dressed and most attractive people.",
      "author": "Robert Denerstein"
    },
    {
      "text": "There's enough romance in this movie to power four weddings -- and if you can't appreciate that; well, it's your funeral.",
      "author": "Chris Knight"
    },
    {
      "text": "Wu and Golding's chemistry translates well on the big screen and you want to root for them. Yeoh is also superb playing the \"mother-in-law from hell\". The supporting cast is equally as mesmerising and as a whole and the film does its job as a romcom.",
      "author": "Evelyn Lau"
    },
    {
      "text": "The film's side-trips to the ostentatious crib of Peik Lin's nouveau riche family are the best satire that Chu and the script, by Adele Lim and Peter Chiarelli, have to offer.",
      "author": "André Hereford"
    },
    {
      "text": "A romantic comedy with a knock-out cast that shows us over-the-top glamour, money, privilege, and parties and raises thoughtful, nuanced questions.",
      "author": "Nell Minow"
    },
    {
      "text": "By burrowing into what makes this world so extraordinary-and finding what is universal along way-Chu and his terrific cast have made a romantic comedy for everyone.",
      "author": "Alan Zilberman"
    },
    {
      "text": "While not nearly as scarce as an Asian-led Hollywood movie, a well-made romantic comedy is becoming very rare indeed. \"Crazy Rich Asians\" just may lead to a surge in both.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "Chu's not the most advanced filmmaker, bypassing a chance to truly rattle the world with something that remains inviting, but also emotionally penetrating and culturally incisive.",
      "author": "Brian Orndorf"
    },
    {
      "text": "At its core, the story's many themes - whether it's the clash of cultures, of class differences and of tradition versus modernity - are all universal.",
      "author": "David Tusing"
    },
    {
      "text": "The first major Hollywood production in years to boast an all-Asian cast, this is precisely the movie entertainment we need at the end of summer―funny, refreshing, giddy and emotionally satisfying.",
      "author": "Tom Gliatto"
    },
    {
      "text": "'Crazy Rich Asians' is a groundbreaker steeped with familiarity and cliches",
      "author": "Jordan Ruimy"
    },
    {
      "text": "It's simply great fun, a winsome romantic comedy and an occasionally over-the-top luxury fantasy that never flags.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "\"Crazy Rich Asians\" isn't just a good Hollywood movie for the Asian American population, and one that is overdue by about 24 years. It's a good movie, period.",
      "author": "Peter Hartlaub"
    },
    {
      "text": "Like the great romantic comedies, it's made with a great deal of visible affection both in front of and behind the camera.",
      "author": "Dominick Suzanne-Mayer"
    },
    {
      "text": "It's great that commercial films are being made to appeal directly to groups that have previously been relegated to Hollywood's sidelines, but I can't get excited that they're being marketed the same generic crap as the rest of us.",
      "author": "M. Faust"
    },
    {
      "text": "Chu and his writers find a delicate cultural balance that makes his characters universally familiar without forsaking Asian aspects of the story.",
      "author": "Jordan Riefe"
    },
    {
      "text": "Wu and Yeoh play these two characters magnificently, each adding layers of complexity and introspective analysis that's superb.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "That Crazy Rich Asians manages to collapse the immigrant tale into a story not of sentimental poverty, but of spectacular wealth, might be one of its most striking contemporary twists.",
      "author": "Jane Hu"
    },
    {
      "text": "The film is clearly trying to be a blatantly sudsy romp filled with colorful and ridiculously attractive people, shocking plot twists and startling opulence and on this level, it is an undeniable triumph.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Still, there's no doubt Crazy Rich Asians will have an impact on some Asian American audiences, who have been craving proper representation for years. They deserve a better movie.",
      "author": "Kelly Vance"
    },
    {
      "text": "CRAZY RICH ASIANS is a whirlwind of delight --- attractive actors, stunning couture, spectacular sets and outrageous parties. It's a feast for the eyes. But what really makes this dramedy work is the acting.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "It works primarily because the love-struck couple has genuine chemistry. Wu and Golding are outstanding.",
      "author": "David Kaplan"
    },
    {
      "text": "Crazy Rich Asians employs the basic formula of a crowdpleaser while still injecting universal notions that are winningly and charismatically expressed about identity, self-worth and advocacy.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "In so many ways - as bubbly romantic comedy, as cultural document, as sharp commentary on the super-wealthy, or as feminist empowerment tale - Crazy Rich Asians is a delight, an insightful and most of all funny look at life's luxury suite",
      "author": "Sean P. Means"
    },
    {
      "text": "An exotic and entertaining crowd-pleaser, a romantic, beautiful, opulent and lively comedy that's formulaic but gifted with a light touch.",
      "author": "Sean O'Connell"
    },
    {
      "text": "This is an American film through and through, one that, due to what it is depicting, delves into frankly repulsive and shortsighted territory.",
      "author": "Ryan Swen"
    },
    {
      "text": "Taking the film for what it does manage to accomplish, I have no hesitation in calling it a joy.",
      "author": "Karen Han"
    },
    {
      "text": "Jon M. Chu's movie shines brightest when it focuses on its characters and their relationships.",
      "author": "Matt Goldberg"
    },
    {
      "text": "Wu and Golding play their characters so naturally that the film stays grounded in reality even at its most candy-coloured and fanciful.",
      "author": "Caryn James"
    },
    {
      "text": "The extravagance on display is nonsensical, but that's part of the fun; the movie is filmed with colorful dynamism by Jon M. Chu..the.embrace of all things lush and unsubtle makes Crazy Rich Asians such a great time at the theater.",
      "author": "David Sims"
    },
    {
      "text": "Crazy Rich Asians glimmers and sparkles, gives us characters to root for, and is pure escapist fantasy fun.",
      "author": "Richard Roeper"
    },
    {
      "text": "It's next to impossible not to be charmed by Crazy Rich Asians and its version of a...modern fairy tale.",
      "author": "Rain Jokinen"
    },
    {
      "text": "Crazy Rich Asians is a social breakthrough that might be compared to this year's Black Panther. It may not be a great film but it will serve as a flag-bearer for yet another underserved sector of our population.",
      "author": "Leonard Maltin"
    },
    {
      "text": "By the film's climax, a $40 million wedding, conspicuous consumerism has been glamorized beyond the point of no return, and the difference between romance and showmanship becomes, at least momentarily, irrelevant.",
      "author": "Peter Canavese"
    },
    {
      "text": "The movie often appears to be awed by the same outrageous wealth it purports to be ridiculing, and the comedy is sometimes broad and overplayed.",
      "author": "Anita Katz"
    },
    {
      "text": "As you might imagine, beneath the comic story, \"Crazy Rich Asians\" seems intent on telling the audience that wealth isn't everything.",
      "author": "Josh Terry"
    },
    {
      "text": "It's not perfect, but it is impossible to not fall in love with Rachel, Nick and company. It's a celebration of love, family and culture, one that showcases just how culturally rich and diverse our world is.",
      "author": "Gabrielle Bondi"
    },
    {
      "text": "Through painfully honest and emotional moments, the movie becomes irresistibly relatable.",
      "author": "Monica Castillo"
    },
    {
      "text": "Thanks to a terrific cast, who buoy the film beyond its knuckleheaded premise, Crazy Rich Asians is a satisfying watch but could easily have been much better.",
      "author": "Liam Lacey"
    },
    {
      "text": "Something grates about our continued obsession with the well-to-do, especially if their fortune is inherited ... That said, the movie is otherwise a lot of fun.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "The adaptation of Kevin Kwan's glamour novel is a glitzy spectacle with a ton of heart.",
      "author": "Leigh Monson"
    },
    {
      "text": "Might not be a game-changing romcom, but it's exactly the shot in the arm the genre needed. It's got all the makings of a pop cultural phenomenon and a ready-made franchise.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "[T]here's a good, complex story about the pressures of familial expectations ... but in the process of telling that story, the movie loses track of the romance...",
      "author": "Mark Dujsik"
    },
    {
      "text": "You are Constance Wu as she experiences extreme culture shock, not of race, but of money. You feel the tension upon her first exposure and you can't help but empathize with her fear, love, joy, confusion, heartbreak and determination.",
      "author": "Danny Minton"
    },
    {
      "text": "Crazy Rich Asians is a romantic comedy and a fairy tale, and it helps to keep the latter in mind as you ramp up suspension of disbelief to necessary levels.",
      "author": "Gary Thompson"
    },
    {
      "text": "The movie really just wants to entertain people.",
      "author": "Peter Howell"
    },
    {
      "text": "The movie offers the same kind of characters you find in this genre - malicious young women who want to destroy their rival, eccentric relatives, lovable and laugh-inducing friends and allies, and subplots to prove that money cannot buy happiness.",
      "author": "Bob Bloom"
    },
    {
      "text": "Crazy Rich Asians,... takes that classic story, infuses it with buckets of charm and gives us a look into the culture of Singapore with a cast that all deserve to be seen again and again.",
      "author": "Jenna Busch"
    },
    {
      "text": "[It's] a frothy fairy tale, trivial and weighty at once, that simultaneously uses tried-and-true romantic comedy convention while riotously bursting free of movie-business formula.",
      "author": "Jake Coyle"
    },
    {
      "text": "Knockout visuals, a winning cast, and an irrepressibly feel-good vibe make this dazzling romantic comedy one for the ages.",
      "author": "Andrea Gronvall"
    },
    {
      "text": "With sumptuous production values and winning characters, \"Crazy Rich Asians\" is one of the year's biggest romantic surprises.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Crazy Rich Asians reminded me of my family. I suspect it will remind you of yours, regardless of where they come from.",
      "author": "Matt Singer"
    },
    {
      "text": "Just might be the no-martial-arts crossover film this cinematically neglected populace has needed forever.",
      "author": "David Noh"
    },
    {
      "text": "It will more than satisfy the sweet tooth of romantic comedy fans everywhere who have lately despaired that the frothy, frolicsome genre they adore has been subsumed by raunch and various shades of gray.",
      "author": "Ann Hornaday"
    },
    {
      "text": "At this core of any Cinderella story is, of course, Cinderella. And Constance Wu is terrific in her first leading movie role, bringing the audience along for every magical moment. She's now officially a movie star.",
      "author": "Neil Pond"
    },
    {
      "text": "In its keen and sensitive and moving observations about the uncertainty in being Asian-American, it's always drifting, and Wu's incredible ability to convey all those ideas wordlessly is what makes the film more than just about a material China girl.",
      "author": "Kyle Turner"
    },
    {
      "text": "For all its carnival-like antics, Crazy Rich Asians is all too aware of its own spectacle.",
      "author": "Alana Mohamed"
    },
    {
      "text": "Mostly, the movie is committed to the value of a good time.",
      "author": "A.O. Scott"
    },
    {
      "text": "The first good date movie to come along in quite some time.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Although the humor is variable, the romance is consistent and that allows the film to go down smoothly even if it takes an inordinately long time to do so.",
      "author": "James Berardinelli"
    },
    {
      "text": "...you don't have to be Asian to find so much of this storyrelatable, funny, and gorgeous to watch unfold.",
      "author": "Travis Hopson"
    },
    {
      "text": "While Crazy Rich Asians is a celebration of Asian culture, it doesn't mean that you have to be of Asian descent to fall in love with it. The story, characters, and the themes are universal, and I feel like everyone can appreciate this film.",
      "author": "Scott Menzel"
    },
    {
      "text": "Rom-coms have been the domain of white privilege for so long, it's going to take a lot more movies like Crazy Rich Asians to even the score. But Crazy Rich Asians is making up for lost time because it's pretty much all the rom-com tropes in one!",
      "author": "Fred Topel"
    },
    {
      "text": "This sweetie may not be particularly crazy, but it sure is rich.",
      "author": "Joanna Langfield"
    },
    {
      "text": "\"Crazy Rich Asians\" is about so much more than just Rachel and Nick's love story. It's about Rachel fully inhabiting her power, which means embracing her life story: her parentage, where she comes from, her values and the forces that shaped them.",
      "author": "Katie Walsh"
    },
    {
      "text": "Crazy Rich Asians joyously embraces a heightened aesthetic while keeping its story grounded in real emotional truth.",
      "author": "Caroline Siede"
    },
    {
      "text": "It's enough to put a smile on anyone's face. The first Asian movie made in America and widely released in 25 years is a very charming crowd pleaser.",
      "author": "Dwight Brown"
    },
    {
      "text": "In the guise of a bouncy romcom about insanely gorgeous rich kids, the pointedly entertaining Crazy Rich Asians is making history as the first Hollywood film in 25 years to feature an all-Asian cast. It's also \"the\" comedy to see this summer.",
      "author": "Peter Travers"
    },
    {
      "text": "In terms of cultural and artistic relevance, Crazy Rich Asians has more than proven itself. And yes, its even worth paying the full, non-matinee price.",
      "author": "Skylar Ezell"
    },
    {
      "text": "A shining, redefining example of what the romantic-comedy genre can do best: It's breezy and hilarious yet offers enough heartfelt gravitas to give the feel-good date movie needed emotional heft.",
      "author": "Brian Truitt"
    },
    {
      "text": "The best scenes in the movie highlight why the core couple won't be remotely happy together...",
      "author": "Scott Mendelson"
    },
    {
      "text": "With a fish-out-of-water angle, Crazy Rich Asians ought to be the type of romantic comedy that should appeal to anyone...",
      "author": "Danielle Solzman"
    },
    {
      "text": "The filmmakers' ability to seamlessly explore rapidly shifting Chinese cultural norms within the context of the classic trope of a mother who's hostile toward her son's partner is the film's most impressive feat.",
      "author": "Derek Smith"
    },
    {
      "text": "it's a rarity that a big, splashy commercial romance gets so much right, taking well worn paths in new directions...Awkwafina is so entertaining in a supporting role she should seriously be considered during awards season.",
      "author": "Laura Clifford"
    },
    {
      "text": "The vigorous cast enlivens the conventional action, and brilliant comedic sallies by Awkwafina, as Rachel's college friend, and Nico Santos, as Nick's cousin, knock it for a loop.",
      "author": "Richard Brody"
    },
    {
      "text": "The story floats between gaudy and flirtatious to emotional, dramatic and then eye-opening and heartwarming by its conclusion.",
      "author": "Clara Mae"
    },
    {
      "text": "Don't let the title fool you. This engaging, cross-cultural saga is a surefire hit with universal appeal!",
      "author": "Kam Williams"
    },
    {
      "text": "Crazy Rich Asians sets a high bar in the romantic comedy genre. You will laugh hysterically, possibly shed a few tears, and leave the theater with a whole lot of love in your heart.",
      "author": "Julian Roman"
    },
    {
      "text": "This might sound bizarre to say about a romantic comedy, but I deeply wished critics were screened Crazy Rich Asians in IMAX",
      "author": "Robert Kojder"
    },
    {
      "text": "Messages, role models stand out in culture-clash romcom.",
      "author": "Tara McNamara"
    },
    {
      "text": "I'd watch every episode of a reality show with a camera following Awkwafina while she attends parties of the rich and famous while cracking wise about them.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Crazy Rich Asians is one of those movies that both embraces and transcends its genre, in this case rom-coms, to work on multiple levels.",
      "author": "Kayti Burt"
    },
    {
      "text": "The joyful confection is coated in a sparkly gloss, bright enough to gleam from the darkest, most cynical corners.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Crazy Rich Asians reminded me why I love the rom-com genre so much.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "The movie is a wonderful foray into the romantic comedy genre with characters who feel familiar, while telling a story that will emotionally resonate with Asian and Asian-American audiences.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Crazy Rich Asians excels for reasons that go beyond its strides in representation.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "Is it as good as the book? No. Did it make me happy? Oh yes, and how nice to be reminded what a gift a joyful rom-com can be.",
      "author": "Moira MacDonald"
    },
    {
      "text": "A highly satisfying, decidedly old-fashioned romantic comedy, garnished with soapy elements and enough mouth-watering shots of food to inspire a big meal before or after.",
      "author": "Brian Lowry"
    },
    {
      "text": "The only excuse you have not to see Crazy Rich Asians is because you hate love.",
      "author": "Alan Ng"
    },
    {
      "text": "\"Crazy Rich Asians\" is a defibrillator for a genre that flatlined ages ago. This heartwarming, well-acted - and decadent - film takes you back to the greatest hits of Nancy Meyers, Richard Curtis and Nora Ephron.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Crazy Rich Asians is, at its heart, a fish-out-of-water story, and it has a lot more going for it than its literal money shots.",
      "author": "Emily Yoshida"
    },
    {
      "text": "Crazy Rich Asians is breathless fun -- rather weightless, too.",
      "author": "Richard Lawson"
    },
    {
      "text": "Seeing this kind of onscreen representation is incredibly satisfying, especially via Kwan's rich page-turner, loaded with cattiness but also plenty of Asian diversity, from wholesome friends and wise confidantes to jealous mean girls and scheming parents.",
      "author": "Danny Yu"
    },
    {
      "text": "Ultimately, Crazy Rich Asians doesn't need to subvert all its predictable elements, because even if we know where it's going, we've never seen that story told this way.",
      "author": "Carlos Aguilar"
    },
    {
      "text": "Crazy Rich Asians is a spectacular, heartwarming instant classic of a romantic comedy that brings some much-needed representation to the genre.",
      "author": "Molly Freeman"
    },
    {
      "text": "This vibrant, immersive fantasy is brimming with life and, better yet, culture. It's totally winning - and built for repeat viewings.",
      "author": "Courtney Howard"
    },
    {
      "text": "If Asians really only grazes true Crazy, the movie is still a deliriously glossy, globe-trotting trifle -- two hours of romantic fantasy and real-estate porn poured on so thick it's almost lickable.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "The entire film heavily leans into its specificity with a zest that's infectious. Crazy Rich Asians is here to celebrate in a big way.",
      "author": "Anne Cohen"
    },
    {
      "text": "A movie that expertly manages to balance the opulence of incalculable wealth with the pragmatic, well-grounded sensibility embodied by its heroine, Rachel Chu (Constance Wu).",
      "author": "Peter Debruge"
    },
    {
      "text": "The film's arrival is undeniably momentous. But it's nearly as vital that Crazy Rich is a romantic comedy -- a genre that relies on charisma above all else. The film's stereotype-busting approach is multifarious.",
      "author": "Inkoo Kang"
    },
    {
      "text": "Directed by Jon M. Chu with a combination of traditional aesthetics (silk dresses, tan hua flowers) and music-video excess (infinity pools, barge-raves), Crazy Rich Asians is nothing if not an escapist pleasure.",
      "author": "Rafer Guzman"
    },
    {
      "text": "A loving take on Kwan's books, bundled up in a wildly entertaining package.",
      "author": "Kate Erbland"
    },
    {
      "text": "This adaptation of Kevin Kwan's 2013 international bestseller is many things: a tour de force of lifestyle pornography, a slick, enjoyable divertissement, a surprisingly trenchant study of class and cultural difference.",
      "author": "Justin Chang"
    },
    {
      "text": "A thoroughly captivating exploration of the rarefied question of whether true love can conquer head-spinning wealth.",
      "author": "David Rooney"
    }
  ],
  "release_year": 2018,
  "duration": 120,
  "genres": [
    "Romance",
    "Comedy"
  ],
  "synopsis": "Rachel Chu is happy to accompany her longtime boyfriend, Nick, to his best friend's wedding in Singapore. She's also surprised to learn that Nick's family is extremely wealthy and he's considered one of the country's most eligible bachelors. Thrust into the spotlight, Rachel must now contend with jealous socialites, quirky relatives and something far, far worse -- Nick's disapproving mother.",
  "popularity": 7.6,
  "poster_url": "https://image.tmdb.org/t/p/original/1XxL4LJ5WHdrcYcihEZUCgNCpAW.jpg"
}