{
  "movie_name": "Die Hard",
  "movie_id": "die_hard",
  "total_reviews": 75,
  "reviews": [
    {
      "text": "One of the best Christmas movies ever made. Yes Christmas movies...",
      "author": "Rachel Wagner"
    },
    {
      "text": "Nothing lasts forever... except for this cinematic party that keeps welcoming us to one of the best action and christmas movies ever. \n[Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "One of the most divisive holiday classics, the argument on whether John McTiernan's Die Hard is a Christmas movie, finds its way to the forefront every year. For myself, the truth is indisputable. Die Hard is a Christmas film - no, a Christmas classic.",
      "author": "Stephanie Archer"
    },
    {
      "text": "To say Die Hard still holds up is an understatement: charismatic protagonist and antagonist, great action set pieces, well paced and a top class finale. It’s no wonder so many other films and TV series continue to “do a Die Hard”, it’s still hard to top.",
      "author": "David Hogan"
    },
    {
      "text": "Top to bottom, it is just endlessly entertaining and well-crafted with outstanding work from all involved. No matter how much action movies have continued to grow, this will always be the cinematic elder statesman that can scrap with the best of them.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "That’s right, I’m saying it, loudly and proudly, since John McTiernan’s 1988 action classic isn’t just set at Christmastime—it embodies the very spirit of the holiday.",
      "author": "Nick Schager"
    },
    {
      "text": "The gold standard for action filmmaking; what action movie tropes Die Hard doesn't follow, it reinvents or altogether originates, and all of them have yet to be bettered.",
      "author": "Brian Eggert"
    },
    {
      "text": "Give Die Hard a fresh spin this year; it's the most joyous Christmas film of all!",
      "author": "Cory Woodroof"
    },
    {
      "text": "I really appreciated the interpersonal relationship between him and his wife. It wasn't slow but it was taking its time.",
      "author": "Andrew Galdi"
    },
    {
      "text": "[It] may be the best action movie EVER.",
      "author": "Avaryl Halley"
    },
    {
      "text": "It's another anti-cheer holiday selection, but one that keeps on giving - rewatchable sans saturation...",
      "author": "Tom Meek"
    },
    {
      "text": "Sometimes-more often than not, even- a script with many hands on it becomes a case of too many cooks. With Die Hard, competing experienced creatives produced a film that works on multiple levels.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "Still the prototype of the modern action yarn -- its status was secured so rapidly that subsequent action romps were invariably described as \"Die Hard on a train / plane / bus / zeppelin / tricycle / what-have-you.\"",
      "author": "Matt Brunson"
    },
    {
      "text": "Die Hard is not only an excellent action film, it is an excellent film overall and its ability to stand the test of time and still hold up is admirable.",
      "author": "Sarah Brinks"
    },
    {
      "text": "A spectacularly thrilling film, possessing enough brains to match its brawn.",
      "author": "Mike Massie"
    },
    {
      "text": "The picture is extremely violent: bombs go off, bullets rip through flesh, heads are slammed against steel. But Die Hard is also smart, satirical-and, in an odd way, heartwarming.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "The director's spectacular ability to compose the plans and take advantage of the full range of the panoramic format possibilities. [Full Review in Spanish]",
      "author": "Sergio Benítez"
    },
    {
      "text": "It's a glorious scene-stealer for Alan Rickman, though it's a credit to Willis's cheeky charisma that his scene is not in fact stolen.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Die Hard is a great example of the Hollywood studio system getting moviemaking right - the film is a perfect storm of story and talent coming together.",
      "author": "Niall Browne"
    },
    {
      "text": "Die Hard still feels as fresh and thrilling as the first time it screened.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "From the superb pacing through to the sarcastically sinister villainy of Alan Rickman, this remains a crucial template for the modern action film.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It's as though the filmmakers approached each scene by asking themselves how entertaining they could make it.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "One of the very best action pictures of all time... Yippe-ki-yay indeed.",
      "author": "Andrew Pollard"
    },
    {
      "text": "Die Hard is film's equivalent of a terrorist attack on your senses, but Willis' intensity and presence push it into guilty pleasure territory.",
      "author": "Jay Carr"
    },
    {
      "text": "What sets 'Die Hard' apart from most action movies is the depth of characterization. [Detective John] McClane is not a macho toy with a bullet-proof body. He is a thinking, feeling man who can't believe he's doing most of what he does.",
      "author": "Marylynn Uricchio"
    },
    {
      "text": "Here, postmodern architecture meets Reagan-era Hollywood cinema and makes lots of movie magic.",
      "author": "Charles Mudede"
    },
    {
      "text": "Exciting, tense, expertly edited and directed, full of well-constructed characters and lots of action. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "There are good performances from everyone in this long, often funny, very violent but exciting melodrama.",
      "author": "Chris Chase"
    },
    {
      "text": "A masterpiece of populist filmmaking.",
      "author": "Tim Brayton"
    },
    {
      "text": "Yippee-ki-yay, action fans.",
      "author": "Martin Chilton"
    },
    {
      "text": "For all its moments of almost overwhelming cheese, Die Hard is still the definitive action thriller.",
      "author": null
    },
    {
      "text": "Within the narrow framework of the hard-action genre, Die Hard is almost as good as it gets.",
      "author": "Candice Russell"
    },
    {
      "text": "Willis gleefully strips down the action movie to a pretend game for children who like to fire guns and shoot bad guys. Machismo may never be the same.",
      "author": "Peter Travers"
    },
    {
      "text": "Die Hard is probably the most manipulative movie I've seen this year, but since it makes no bones about being manipulative and does it so well, this not only isn't a problem -- it's fun.",
      "author": "Ben Yagoda"
    },
    {
      "text": "Die Hard is an action picture with a capital A. In fact, you might as well go ahead and capitalize the whole darn word.",
      "author": "Jay Boyar"
    },
    {
      "text": "As a grand flourish of cinematic technique, it is awesome; as a human drama, it is disgusting and silly, a mindless depiction of carnage on an epic scale.",
      "author": "Kevin Thomas"
    },
    {
      "text": "The very pinnacle of the '80s action movie, and if it's not the greatest action movie ever made, then it's damn close.",
      "author": "Andrew Collins"
    },
    {
      "text": "Most of the action is run-of-the-mill Hollywood blood and thunder, but a couple of scenes are unusually reprehensible.",
      "author": "David Sterritt"
    },
    {
      "text": "McTiernan, who directed last summer's Predator, composes the action cleanly and logically, making good use of Jackson DeGovia's elaborate post-modernist set-the building becomes something of a character in itself.",
      "author": "Dave Kehr"
    },
    {
      "text": "DIE HARD is a classic film. Simply put, every single thing works.",
      "author": "JimmyO"
    },
    {
      "text": "... Not only the best action movie ever made but one of the very best of any genre.",
      "author": "Greg Maki"
    },
    {
      "text": "John McTiernan's thriller-actioner is well executed, boasting a strong performance from Bruce Willis, which made him a big-screen star.",
      "author": "Emanuel Levy"
    },
    {
      "text": "Original Bruce Willis violent actioner.",
      "author": "Kelly Kessler"
    },
    {
      "text": "High-tech cartoonish action thriller.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "In the first half of Director John McTiernan's movie, Willis wears an undershirt. In the second half he gets rid of it. And that's pretty much it for his performance.",
      "author": "Richard Schickel"
    },
    {
      "text": "Die Hard is as high tech, rock hard and souped up as an action film can be.",
      "author": "Variety Staff"
    },
    {
      "text": "A serviceable if rather overextended and overblown adventure thriller.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "...remains one of the most entertaining and flat-out thrilling examples of the action genre...",
      "author": "David Nusair"
    },
    {
      "text": "Great escapist action, but it's still nothing more than an action movie %u2013 cinema's version of a nice, tasty hamburger.",
      "author": "Brian Webster"
    },
    {
      "text": "A seminal action film that created an entire subgenre. Super action, but the key to its success is how it effectively pits Willis' common-man hero against Rickman's haughty arch-villain.",
      "author": "Chuck O'Leary"
    },
    {
      "text": "A hi-tech thriller with a human heart.",
      "author": "Nigel Floyd"
    },
    {
      "text": "Every so often a movie comes along whose concept sparks a flood of imitators. Die Hard is such a movie.",
      "author": "Scott Nash"
    },
    {
      "text": "'A landmark film that breathed life and originality into an area of cinema where only formulas were proven reliable.'",
      "author": "Derek Smith"
    },
    {
      "text": "An explosion-movie classic.",
      "author": "Nell Minow"
    },
    {
      "text": "Superior star vehicle, but utterly insubstantial.",
      "author": "Ken Hanke"
    },
    {
      "text": "There's a reason why this film's basic premise has been transplanted to every kind of building or transport known to man: it's just that good.",
      "author": "Widgett Walls"
    },
    {
      "text": "An ingenious and ceaselessly self-renewing thriller that surpasses every seeming limitation.",
      "author": "Nick Davis"
    },
    {
      "text": "Marks the peak of the 1980's action boom that made mega-stars out of the likes of Ah-nuld, Stallone and Van Damme.",
      "author": "Ryan Cracknell"
    },
    {
      "text": "The scenes move with such relentless energy and smashing special-effects extravagance that Die Hard turns out to be everything action-genre fans, and Bruce Willis's relieved investors, might have hoped for.",
      "author": "Caryn James"
    },
    {
      "text": "A landmark action film.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The best action-thriller of the 20th Century...Willis is THE Man~",
      "author": "Caffeinated Clint"
    },
    {
      "text": "Rent it on Christmas Eve and give that \"Wonderful Life\" [expletive deleted] a rest for one year.",
      "author": "Brian Mckay"
    },
    {
      "text": "Slower to get going than I remembered -- and that's a good thing",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Die Hard is in many ways the perfectly constructed action film, combining interior tension with exterior explosions.",
      "author": "James Rocchi"
    },
    {
      "text": "Bruce Willis discovered his movie legs in this superb action movie.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "For an evening of edge-of-your-seat entertainment, you’d be hard pressed to do much better.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "It may seem, in measure, that watching this in lieu of Frosty or Rudolph violates a practice during a holiday known and based on custom. However true, there is a discernable heart in Die Hard.",
      "author": "Rumsey Taylor"
    },
    {
      "text": "...practically reinvented the action thriller, or at least resuscitated a moribund genre.",
      "author": "John J. Puccio"
    },
    {
      "text": "The granddaddy of a whole genre of action films still remains sharp, tough, and exciting.",
      "author": "Almar Haflidason"
    },
    {
      "text": "It gets your heart pounding, then makes you hate yourself for it.",
      "author": "Hal Hinson"
    },
    {
      "text": "A perfect action movie in every detail, the kind of movie that makes your summer memorable.",
      "author": "Pete Croatto"
    },
    {
      "text": "an intelligent game of cat-and-mouse, complete with some proposterous situations, a lot of carnage, some male bonding, one strong woman, lots and lots of one-liners, and it even has a villain coming back from the dead for one last kiss goodnight.",
      "author": "Ted Prigge"
    },
    {
      "text": "It's good, dumb fun.",
      "author": "Desson Thomson"
    },
    {
      "text": "Inappropriate and wrongheaded interruptions reveal the fragile nature of the plot and prevent it from working.",
      "author": "Roger Ebert"
    },
    {
      "text": "For what it is, this is the top model -- flash, bang, and witty one-liners all included.",
      "author": "James Berardinelli"
    }
  ],
  "release_year": 1988,
  "duration": 131,
  "genres": [
    "Action",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "New York City policeman John McClane (Bruce Willis) is visiting his estranged wife (Bonnie Bedelia) on Christmas Eve. He joins her at a holiday party in the headquarters of the Japanese-owned business she works for. But the festivities are interrupted by a group of terrorists who take over the exclusive high-rise, and everyone in it. Very soon McClane realizes that there's no one to save the hostages -- but him.",
  "popularity": 9.4,
  "poster_url": "https://image.tmdb.org/t/p/original/1NnCbaFaWgHczKjH5Eii46VmpPp.jpg"
}