{
  "movie_name": "District 9",
  "movie_id": "district_9",
  "total_reviews": 308,
  "reviews": [
    {
      "text": "Easily, one of the most original and exciting science fiction films of the last 20 years. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Blomkamp doesn’t miss a step. His film is cynical, funny, smart, exciting, and satirical—all without losing his audience’s involvement in the scenario.",
      "author": "Brian Eggert"
    },
    {
      "text": "District 9 might not be a classic like Alien or ‘The Terminator’ (not many films are), but it’s still an effective sci-fi film with depth and style.",
      "author": "John Brhel"
    },
    {
      "text": "Funny and ferocious, cynical and satirical, \"District 9\" is both ingeniously clever and reflectively thoughtful, a science fiction thriller that bubbles with social commentary.",
      "author": "Sean Axmaker"
    },
    {
      "text": "I don't think the film is the epic reevaluation of science-fiction storytelling like some people have hailed it to be. But I do think it's a solid smart sci-fi action flick that's honest to its characters",
      "author": "Jason Adams"
    },
    {
      "text": "One of the most creative and exciting science-fiction adventures in the last decade.",
      "author": "Mike Massie"
    },
    {
      "text": "Amid the mayhem, however, it's impossible to lose sight of the film's penetrating satire on racism and xenophobia.",
      "author": "Jason Best"
    },
    {
      "text": "FEELS oppressed and this oppression permeates virtually every single minute of the film's 112-minute runtime.",
      "author": "Richard Propes"
    },
    {
      "text": "It's a genuinely impressive debut feature and unlike the singular experience of Cloverfield's faux-reality, District 9 has narrative, plus thematic weight and visceral thrills, which elevate it above the gimmick of the reality format.",
      "author": "Nikki Baughan"
    },
    {
      "text": "It is without a doubt that District 9 will be a hit.",
      "author": "David Harris"
    },
    {
      "text": "Copley is never a believable protagonist, and his transformation isn't very believable. About the only interesting cast members are the CGI aliens.",
      "author": "Micheal Compton"
    },
    {
      "text": "If someone asked me what I could offer them to convey the \"mission statement\" of science fiction, I would hand over a copy of District 9 without thought.",
      "author": "Emmet Asher-Perrin"
    },
    {
      "text": "Part found footage (or just footage), part mockumentary, part satire and part action; Blomkamp pulls it into a coherent, moving, violent, sci fi allegory. Copley is terrific as Wikus moving from species-ist opportunist to a genuine if gormless redemption.",
      "author": "Sarah Cartland"
    },
    {
      "text": "There are lots of great odd details filling the early scenes, suggesting we're not getting all the cultural references, that make for exciting film-watching.",
      "author": "Eileen Jones"
    },
    {
      "text": "The only thing saving the story is an astonishingly impressive performance from Copley. His every incarnation as Wikus-first as a cheerful, if incompetent suit, then as a pathetic xenophobe, to finally a self-sacrificing warrior-rings true.",
      "author": "Megan Basham"
    },
    {
      "text": "I won't tell you to rush out and see it, but in these days of sequels and remakes, this was an interesting original.",
      "author": "Debbie Baldwin"
    },
    {
      "text": "Neill Blomkamp has made an instant science fiction classic. From beginning to end, the thrills magnify, intensify into a horrific drama that will live for the ages.",
      "author": "Dan DiNicola"
    },
    {
      "text": "I don't know guys, at the end of the day it's aliens and hard for me to take this seriously.",
      "author": "Candice Frederick"
    },
    {
      "text": "It is a sign of intelligent filmmaking when those crafting the movie realize that less is more. Real artists show restraint.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "It has become almost impossible to make a sci-fi film these days that doesn't spend its last 30 minutes in a multiple-orgasm roar of screaming, shooting and shattering explosions.",
      "author": "Giovanni Fazio"
    },
    {
      "text": "The wonder is that despite its obvious roots, District 9 feels staggeringly original.",
      "author": "Jeannette Catsoulis"
    },
    {
      "text": "Blomkamp is good at mustering speedy action and posting grisly sight gags in the background, carnage always hovering comically at the edge of your vision. But I'm not sure that District 9 entirely gets the earthling racism out of its own system.",
      "author": "Jonathan Romney"
    },
    {
      "text": "District 9 is almost wholly unique this year in combining fantastic action with thoughtful, narrative filmmaking.",
      "author": "Christopher Monfette"
    },
    {
      "text": "One of the most original, breathtaking and downright electrifying movie experiences of 2009.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A gritty science-fiction film that features a population of humanoid crustacean-alien creatures [that] is far more grounded in reality than any of the current rom-coms currently unspooling in your neighbourhood multiplex.",
      "author": "Randall King"
    },
    {
      "text": "District 9 grabs viewers from first frame to last, not only with viscera but genuine intelligence that's rare in any genre these days.",
      "author": "Steve Persall"
    },
    {
      "text": "District 9 will appeal to science-fiction fans, but ultimately disappoint those looking for a deeper exploration of contentious issues.",
      "author": "James Rundle"
    },
    {
      "text": "Disturbingly powerful visual effects and a dark background score add to the film's appeal.",
      "author": "Anubha Sawhney Joshi"
    },
    {
      "text": "District 9 is a dark, surprising, exciting, whip-crack smart sci-fi thriller that grabs you from the beginning and never lets you go.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "The storytelling method is all jitter and no pulp.",
      "author": "Richard von Busack"
    },
    {
      "text": "In using recent political history as the subtext for his story, Blomkamp is following in a long science-fiction tradition: illustrating mankind's persistent stupidity, even after we have supposed learned lessons.",
      "author": "Robert Horton"
    },
    {
      "text": "In a film season full of bombastic, over-the-top and insultingly stupid fare, District 9 proves that there is still life in the science fiction genre.",
      "author": "Sebastian Cordoba"
    },
    {
      "text": "The creature design and prosthetics are astonishing. Throughout, cutting-edge technology is employed with a great amount of gusto.",
      "author": "Rashid Irani"
    },
    {
      "text": "Good science fiction is always about marrying entertainment with something deeper. District 9's shrewdly constructed story manages to be both plausible and out of this world, with lots of detail and subtle innovative quirks.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "Audacious, original and absolutely gut-wrenching.",
      "author": "Anupama Chopra"
    },
    {
      "text": "A moderately entertaining slice of sci-fi action that doesn't really work as idea-driven drama.",
      "author": "Scott Renshaw"
    },
    {
      "text": "First-time director Neil Blomkamp smashes onto the filmmaking scene with his sharply original debut movie, delivering a fast-paced thriller packed full of gags and guts in the manner of his mentor, producer Peter Jackson.",
      "author": "Andrew Hedley"
    },
    {
      "text": "It's a brashly confident debut, full of sharp, inventive detail (the prawns are crazy for cat food) and rooted in a couple of Big Ideas. Well worth the time, if not all of it.",
      "author": "Tom Charity"
    },
    {
      "text": "For a movie rife with violence and disturbing imagery, District 9 has a guiding spirit that's surprisingly sweet and even hokey. But that's part of its charm.",
      "author": "Margot Harrison"
    },
    {
      "text": "Phone home, E.T., and while you're at it, you might ask for extraterrestrial help for the persecuted aliens being evacuated from District 9.",
      "author": "Mal Vincent"
    },
    {
      "text": "A smart sci-fi about a group of alien refugees who come to Earth and are imprisoned in an internment camp.",
      "author": "Kirk Baird"
    },
    {
      "text": "District 9 made me think, and it made me jump. This cool science-fiction thriller pumps up the tension to wow-factor levels.",
      "author": "Michael Smith"
    },
    {
      "text": "It's too uneven and juvenile to deliver on its ambitions, and could easily be 20 minutes shorter (a dozen fewer shots of CGI goo hitting the lens would have sufficed), but it's ultimately too blazingly unique to not recommend.",
      "author": "Daniel Barnes"
    },
    {
      "text": "This extraordinary science-fiction thriller doesn't settle into a standard Tinseltown orbit. Instead, it sets its astonishing thrills and action in South Africa.",
      "author": "Alan Frank"
    },
    {
      "text": "District 9 is a brave attempt by first-time director Blomkamp and well worth a look.",
      "author": "Roz Laws"
    },
    {
      "text": "Blomkamp seems to want to invoke the memory of South African apartheid into the confusion, but he doesn't know how. Thus it remains largely a noisy action picture, barely different from all the stuff Hollywood keeps churning out.",
      "author": "John Serba"
    },
    {
      "text": "I applauded the splattergore moments and felt oddly touched by the emotional connection created to the prawns. Go see this movie.",
      "author": "Robert Fure"
    },
    {
      "text": "It's remarkable for a first-time feature film director to keep a tight rein on all these elements and meld them with such dynamism and style.",
      "author": "Catherine Jones"
    },
    {
      "text": "This remains a textbook example of fantasy cinema's ability to tackle thorny moral issues while splattering the screen with gloopy creature effects.",
      "author": "Trevor Johnston"
    },
    {
      "text": "District 9 has so much potential and seems ready to engage with so many ideas that it's disappointing when it turns out to be nothing more than a decent action movie.",
      "author": "Norman Wilner"
    },
    {
      "text": "One of the sharpest pieces of sci-fi since Star Trek kicked off the season.",
      "author": "Katherine Monk"
    },
    {
      "text": "If the basic idea is provocative, District 9 never lives up to the promise of its allegorical freight.",
      "author": "Ben Kenigsberg"
    },
    {
      "text": "District 9's skid into rote convention is matched by a retreat from the documentary conceit that so expertly delivered us into this strange world in the first place.",
      "author": "Chris Stamm"
    },
    {
      "text": "This stunning mindbender of a movie attempts to prove that science fiction can handle the heftiest allegorical payloads, even the appalling shame of apartheid.",
      "author": "Corey Hall"
    },
    {
      "text": "Every once in a great while -- perhaps only a handful of times each decade -- that rare film comes completely out of left field to let us know that there are still some original ideas out there, and that cinema can still be fresh and exciting.",
      "author": "Jason Buchanan"
    },
    {
      "text": "Ghee whiz, how abusive can you get with a movie camera?",
      "author": "David Keyes"
    },
    {
      "text": "This is an excellent idea searching for a film worthy of it. This ain't it.",
      "author": "Will Leitch"
    },
    {
      "text": "Smart, funny, touching, thought-provoking and utterly insane in the action department, District 9 is 2009's most entertaining movie by a light year.",
      "author": "Ali Gray"
    },
    {
      "text": "Despite its shortcomings, District 9 is an engaging sci-fi romp that features solid CGI work.",
      "author": "James Plath"
    },
    {
      "text": "District 9 has too many gory vaporizations to qualify as a serious statement on race relations, but it does outclank Transformers: Revenge of the Fallen by a wide margin, and you thrill to the cleanly cut action sequences.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "A rocking, rolling action drama about alien castaways that just want to go home, an evil corporation that wants to capitalize on them at any cost, and one man who freakishly gets caught in the middle.",
      "author": "Neil Pond"
    },
    {
      "text": "District 9 has the potential to satisfy two mutually exclusive groups of bottom-feeding moviegoers.",
      "author": "Kelly Vance"
    },
    {
      "text": "District 9 isn't without its rough edges. It's a bit obvious and doesn't take as full advantage of its premise as it could. But it's also a visually spectacular and cares mostly about its characters, and that's a rare thing in film today.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Part alien invasion flick, part social commentary, Neill Blomkamp's chilling, thrilling \"District 9\" is a wholly original work. And it features a star-making turn from Sharlto Copley.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Aliens clash with humans in combustible sci-fier.",
      "author": "Don Groves"
    },
    {
      "text": "Although the film is dripping in satire, Blomkamp is more concerned with delivering a balls-to-the-wall action film. District 9 has more in common with Aliens than Babel.",
      "author": "Simon Miraudo"
    },
    {
      "text": "The most audacious, auspicious sci-fi debut in years, Neill Blomkamp's modest-budget \"District 9\" throws together xenophobic satire, political allegory and raucous action in a knockabout package reminiscent of Paul Verhoeven's finest work.",
      "author": "Nick Rogers"
    },
    {
      "text": "District 9 is the most original, innovative and entertaining science-fiction film in years and contains the best mix of politics and spectacle since Starship Troopers.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "Director and cowriter Neill Blomkamp manages to have fun with the concept while simultaneously serving up a Kafkaesque tale that doubles as a clever metaphor for South African apartheid.",
      "author": "John Lekich"
    },
    {
      "text": "What the sci-fi action flick District 9 lacks in famous faces it makes up for with sheer imagination.",
      "author": "Rafer Guzman"
    },
    {
      "text": "This is why I love my job: Every so often I get to see things that I've never seen before.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "It's smart and fresh and proof that the phrase \"dog days of August\" no longer applies to the movies, or at least this one.",
      "author": "Barbara Vancheri"
    },
    {
      "text": "Best when it operates as yarn rather than as social commentary, even if it is filled with logical inconsistencies.",
      "author": "Louis Proyect"
    },
    {
      "text": "Screw Avatar - this is what people will think of when they talk about science fiction at the end of the aughts.",
      "author": "Rob Humanick"
    },
    {
      "text": "While Blomkamp's disturbing thriller does have a semi-revelatory ending, the real secret is that District 9, for all its pomp and circumstance, is no more than a decent but scrappy science fiction flick.",
      "author": "Jordan Hiller"
    },
    {
      "text": "The disconnect between the first and second half of the movie shows you how great District 9 could have been, if Jackson and his financial backers had allowed it, instead of what it is, exciting, but with nothing lingering in the mind after it was over.",
      "author": "Adam Lippe"
    },
    {
      "text": "Science fiction as it was meant to be: intelligent and challenging.",
      "author": "Wesley Lovell"
    },
    {
      "text": "full review at Movies for the Masses",
      "author": "Joseph Proimakis"
    },
    {
      "text": "Since the metaphor itself is pretty clear, Blomkamp goes for the visceral quality of the images and situations.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "The film persuades us to look beneath the aliens' chitinous exterior, and slowly eats at us as the images of racism, subjugation and internment become familiar and prod our conscience.",
      "author": "Rubin Safaya"
    },
    {
      "text": "\"One of the most intelligent science fiction entries in the last ten years...\"",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Un entretenido ejercicio de ciencia ficción que es también toda una alegoría sobre la condición racista y discriminadora del hombre.",
      "author": "Enrique Buchichio"
    },
    {
      "text": "Um presente inesperado para todos os fãs de uma boa e inteligente ficção-científica.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Le film de Neill Blomkamp brille de par son audace et la pertinence de son propos.",
      "author": "Jean-François Vandeuren"
    },
    {
      "text": "We've seen most of the film's elements before ... but all these ideas have never been assembled in exactly this manner before, let alone with Blomkamp's wit and style.",
      "author": "Andy Klein"
    },
    {
      "text": "Works as political commentary, blood-splattering action flick and sneaky-funny comedy.",
      "author": "Matt Soergel"
    },
    {
      "text": "We'll know if District 9 has become an instant cult classic if this Halloween, children start dressing up as prawns.",
      "author": "Brandon Judell"
    },
    {
      "text": "Peter Jackson let Neil Blomkamp make his Bad Taste but with all of Jackson's expensive toys.",
      "author": "Fred Topel"
    },
    {
      "text": "Original in concept and thoroughly intense, this alien encampment sci-fi thriller quickly devolves into a gritty slaughter chase that never bores but rarely surprises.",
      "author": "Bruce Bennett"
    },
    {
      "text": "You don't feel bamboozled, fooled, or patronized by District 9, as you did by most of the summer blockbusters. You feel winded, shaken, and shamed.",
      "author": "Anthony Lane"
    },
    {
      "text": "The film's tone moves easily from the comic to the cruel, and the alien creatures look authentic. From the start, the film promises a fresh and thoughtful slice of Swiftian sci-fi.",
      "author": "Cosmo Landesman"
    },
    {
      "text": "District 9 ends on a touching scene that evokes Ridley Scott's Blade Runner, but it's an honest film that repays its debts.",
      "author": "Philip French"
    },
    {
      "text": "You have to go back to 1979 and the premiere of Alien to find a sci-fi ET movie as thrilling and innovative as director Neill Blomkamp's District 9. His satirical fable on racism delivers all the toys and ploys for the fanboys while teasing and teaching t",
      "author": "Victor Olliver"
    },
    {
      "text": "Intriguing, inventive and energetic, Blomkamp's feature debut is a thoroughly tasty prawn cocktail.",
      "author": "Film4 Staff"
    },
    {
      "text": "A thundering blitzkrieg of seat-rattling entertainment with a sociopolitical message; a cerebral sci-fi and apartheid allegory that is as heavily armed with provocative ideas as it is with armour-piercing, tank-splattering torpedoes.",
      "author": "Wendy Ide"
    },
    {
      "text": "An entertaining, technically superb if faintly unsatisfying futuristic thriller.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "District 9 is that modern rarity: an adventure thriller that's even better than its advertising campaign.",
      "author": null
    },
    {
      "text": "Fiendishly plotted and with awesomely kinetic (and outrageously bloody) action scenes, Blomkamp announces himself in a major way, without letting the third act crescendo lose focus in a blur of noise.",
      "author": "Dan Brightmore"
    },
    {
      "text": "District 9 is 2009's second hugely impressive sci-fi film after Moon. Both put fresh spins on well-explored concepts.",
      "author": "Simon Reynolds"
    },
    {
      "text": "Who knew that a movie that begins like an Apartheid spin on Brazilian ghetto drama City Of God, then mutates into The Fly, would wind up pushing some emotional buttons in a way reminiscent of ET?",
      "author": "Charles Gant"
    },
    {
      "text": "A giddy triumph of invention, tight plotting and an inspired appreciation that there exists an audience who like to be challenged as well as thrilled.",
      "author": "Tim Evans"
    },
    {
      "text": "Whisking together raw docu-stylings, smart social commentary and wacky, insectoid aliens, Blomkamp has delivered a true original. Missing the thrill of brave, new, brilliantly realised sci-fi? Then don't miss the No 9...",
      "author": "Matt Mueller"
    },
    {
      "text": "The most deliriously inventive sci-fi action movie in years. Truly, this is a game changer. James Cameron may want to watch his back.",
      "author": "Mark Ramshaw"
    },
    {
      "text": "The originality of the first hour is squandered as Blomkamp unmasks corporate villainy and resorts to an increasingly programmatic series of action set-pieces that pit Wikus and a friendly alien against the multi-national's private army.",
      "author": "Michael Bonner"
    },
    {
      "text": "A lot of fun, highly original and the most entertaining action sci-fi to hit our screens for many years.",
      "author": "Christopher Tookey"
    },
    {
      "text": "While a solid actioner, what makes it so special is a human heart that propels this wham-bam sci-fi film straight into deepest six-star territory.",
      "author": "David Edwards"
    },
    {
      "text": "District 9 is one of the very best films of the year - packed with suspense, action, humour and great performances, and directed with real style and panache... brilliant!",
      "author": "Mark Adams"
    },
    {
      "text": "All the elements are familiar but Blomkamp's swaggering, guerrilla-style approach transforms them into a zestful slice of cartoonish mayhem.",
      "author": "Allan Hunter"
    },
    {
      "text": "When District 9 works, it's an explosive and exciting sci-fi that heralds the arrival of a major new talent.",
      "author": "Chris Hewitt (UK)"
    },
    {
      "text": "Director Neill Blomkamp expertly marshals the action, and although the climactic exchanges settle into familiar territory, he provokes genuine moral outrage.",
      "author": "Peter Aspden"
    },
    {
      "text": "This film has the enervating quality of a wet Tuesday in the arcade.",
      "author": "Alastair McKay"
    },
    {
      "text": "District 9 is a South African sci-fi B-movie that punches well above its weight even as it falls back on inspiration from major-league precedents.",
      "author": "Anthony Quinn"
    },
    {
      "text": "District 9 socks you with humour, gore and fast-paced action and it never feels worthy, while delivering an unexpectedly touching reflection on man's inhumanity to man.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "District 9 is one of the best films of the year and it marks director Neill Blomkamp out as a definite talent to watch.",
      "author": "Matthew Turner"
    },
    {
      "text": "With a relentless pace and seamless effects, this offbeat alien invasion thriller combines non-stop action with real emotion and provocative political themes. So not only is it thunderously entertaining, but it also makes us think.",
      "author": "Rich Cline"
    },
    {
      "text": "Movie lightning has struck here, big time. Because if this isn't what an instant sci-fi classic looks like - it'll do until the next instant sci-fi classic gets here.",
      "author": "Robbie Collin"
    },
    {
      "text": "The creature effects, overseen by Jackson's WETA workshop, are first-rate, but this appears to be one of those instances where the hype seems as likely to be detrimental as beneficial: more seasoned observers may emerge underwhelmed.",
      "author": "Mike McCahill"
    },
    {
      "text": "Intriguing but ultimately jejune space-bug yarn",
      "author": "Fernando F. Croce"
    },
    {
      "text": "Easily one of the best and most surprising films of the summer, an edge-of-your-seat actioneer that represents the very best that science fiction has to offer.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "A highly admirable sci-fi flick that crackles with wit, invention, imagination and ingenuity.",
      "author": "Orlando Parfitt"
    },
    {
      "text": "While the viral campaign and mockumentary style primed us for something in the vein of Cloverfield, District 9 ultimately proves to be in a much older tradition. This is pure body horror in the lineage of Alien, The Thing and The Fly.",
      "author": "Nick Setchfield"
    },
    {
      "text": "District 9 doesn't carry much weight as sociopolitical commentary or satire but, taken on the merits of its shrewd story sense and craftsmanship, it's a popcorn entertainment destined to stay in our minds.",
      "author": "Jay Antani"
    },
    {
      "text": "District 9 is an odd melange of a movie: part fake documentary, part body horror, part office comedy and part Mechwarrior: It's fresh and exciting if not groundbreaking.",
      "author": "Sonny Bunch"
    },
    {
      "text": "A funny, violently gross, and wildly enthralling addition to the science fiction canon.",
      "author": "Richard Knight"
    },
    {
      "text": "a sharp-edged science fiction parable that mixes metaphor and violent action with such dizzying confidence that you leave the theater feeling charged and alive",
      "author": "James Kendrick"
    },
    {
      "text": "An energetic and tantalizing film that promises more than it can ultimately deliver",
      "author": "Dan Jardine"
    },
    {
      "text": "[The \"popcorn\" egg-burning scene] in a way represents the whole film: There's popcorn appeal for casual viewers, but something more vital and desperate at stake underneath.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Wielding wicked retribution, the clever District 9 reinvents alien invasion with a wry wink.",
      "author": "John Wirt"
    },
    {
      "text": "District 9 is a down and dirty sci-fi flick that ... makes a point about racial prejudice.",
      "author": "Lori Hoffman"
    },
    {
      "text": "Copley's wild-eyed performance as the luckless Wikus has a lot going for it. The fact that he's so ridiculous -- and so dogged -- adds to the pathos, for it's patently clear Blomkamp has no taste for easy endings.",
      "author": "Sandra Hall"
    },
    {
      "text": "It's a fascinating hybrid of a film, an anti-Hollywood movie which incorporates a great deal of contemporary big-budget elements ... but with a tart, subversive sense of humour that leavens the violence and mayhem.",
      "author": "David Stratton"
    },
    {
      "text": "It signifies nothing. Still, its sound and fury are undeniably impressive.",
      "author": "Tim Brayton"
    },
    {
      "text": "This low-budget film with its unknown cast is recommended because it ultimately is thought-provoking and smart. This isn't a sci-fi thriller so much as it is a sci-fi drama. It poses several serious questions about the state of humanity.",
      "author": "Christopher Smith"
    },
    {
      "text": "Smart, provocative, fun, and exciting...District 9 is everything that Transformers 2 and G.I. Joe tried - and failed - to be.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "It has some terrific thrills and it's probably worth a video rental, but overall it's yet another case of action over ideas and messages over emotions.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The most gripping, intriguing and compelling sci-fi allegory to grace the big screen since 1968's 'Planet of the Apes' -- and that makes it an instant sci-fi classic in its own right.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "A superb realization of satire, irony, humor and the horrific, with a kick in the guts to human nature and the technical challenges of sci-fi action and destruction.",
      "author": "Jules Brenner"
    },
    {
      "text": "The film's message, that compassion and humanity extend far beyond our own species, isn't subtle, but it is effective.",
      "author": "Robert Roten"
    },
    {
      "text": "Low key in its excellence by just being solid and real and well thought-out...substantial and revealing.",
      "author": "Karina Montgomery"
    },
    {
      "text": "If you're looking for a film with a heart and a soul that isn't afraid to examine the essence of what it means -- and what it might cost -- to be human, this is it.",
      "author": "Ken Hanke"
    },
    {
      "text": "While the film is asking difficult questions, it is a first rank piece of science fiction. When it starts to answer those questions in the easiest and most predictable ways the film becomes just another loud summer action film.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "A bold and inventive science fiction vision that mostly excels but stumbles in the details.",
      "author": "Todd Hertz"
    },
    {
      "text": "A brilliant social commentary.",
      "author": "Victoria Alexander"
    },
    {
      "text": "After you've watched a doomed alien race become obsessed with cat food and Nigerian prostitutes, gunfights don't seem all that impressive anymore.",
      "author": "Sean Burns"
    },
    {
      "text": "[It] does what really good science fiction does and makes you think about the world you live in. It also does what mainstream crowd-pleasing sci-fi does and entertains with well-designed action scenes and classic Hollywood tropes.",
      "author": "Eric Melin"
    },
    {
      "text": "...a speculative fiction with genuine emotional resonance.",
      "author": "Philip Martin"
    },
    {
      "text": "It's an original idea that loses its way, or simply becomes an action flick, your choice.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Not As Innovative As Everyone Wants to Give it Credit For, But Still An Interesting Blast.",
      "author": "Jimmy O"
    },
    {
      "text": "Has some original moments but overall it fails to impress.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "To call this the best shrimp-from-outer-space South African apartheid allegory ever made does not begin to do it justice. But it's a start.",
      "author": "David Edelstein"
    },
    {
      "text": "This is a great movie.",
      "author": "Ben Mankiewicz"
    },
    {
      "text": "What an achievement in filmmaking.",
      "author": "Ben Lyons"
    },
    {
      "text": "It's hard to dwell on racism and social injustices too long when you are being so thoroughly entertained.",
      "author": "Danny Minton"
    },
    {
      "text": "This could have been one of the best sci-fi films of all time if it wasn't for an extremely unlikeable lead. But the last 40 minutes are so awesome that I can still recommend it.",
      "author": "Austin Kennedy"
    },
    {
      "text": "...A fascinating opening hooks you completely....And then, [director Neil] Blomkamp and his cohort[co-writer Terri Tatchel] run out of original ideas.",
      "author": "Gary Wolcott"
    },
    {
      "text": "The movie also has the most emotionally perfect final shot since \"Shaun of the Dead,\" which, like this film, did not originate in Hollywood.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "A thoroughly-absorbing, edge-of-your-seat thriller which is right up there with the best of sci-fi because of the subtle fashion in which it delivers its thought-provoking, universal message about ethnic tolerance.",
      "author": "Kam Williams"
    },
    {
      "text": "The special effects are terrific and don't overwhelm the harrowing story, which is surprisingly emotional.",
      "author": "John P. McCarthy"
    },
    {
      "text": "It's a bore.",
      "author": "D.K. Holm"
    },
    {
      "text": "It's an unforgettable science-fiction actioner. It's a commentary on the human condition. It's a drama about undying love. It's arguably the finest use of computer-generated imagery the big screen ever has seen.The grownups-only 'District 9' is one of the",
      "author": "Linda Cook"
    },
    {
      "text": "... transcends its inspirations by focusing on story, character, and the very human disregard for others until you've walked a mile in their shoes.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "An intelligent action-packed sci-fi film.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Edgy, provocative sci-fi thriller that serves as a pop allegory for the racial tension of apartheid.",
      "author": "Susan Granger"
    },
    {
      "text": "In spite of its waning efforts toward fulfilling a challenging allegory about the treatment of immigrant aliens--in this case with interplanetary aliens--\"District 9\" settles into a gritty, spectacle filled, sci-fi movie that borrows liberally from films",
      "author": "Cole Smithey"
    },
    {
      "text": "While District 9 delivers thrills and chills to spare... what lingers is the casualness with which we are willing to reduce others to sub-human conditions.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "District 9 is a bracing breath of fresh air [that] wears its influences well, integrating them into a well thought-out drama about what it means to be human ... a drama with big guns, car chases and exploding cars.",
      "author": "Maitland McDonagh"
    },
    {
      "text": "District 9 is a cautionary tale about man's inhumanity to aliens, especially those aliens who are high in cholesterol.",
      "author": "Mark Ramsey"
    },
    {
      "text": "Like all great science fiction, District 9 entertains mercilessly even as it challenges us to be better people. Original, urgent and not to be missed.",
      "author": "Brian Juergens"
    },
    {
      "text": "Director Neill Blomkamp has packaged an original Sci-Fi film filled with CGI and action that most moviegoers will love.",
      "author": "Jolene Mendez"
    },
    {
      "text": "really can't recommend this one enough and it should be considered a must see",
      "author": "Chris Bumbray"
    },
    {
      "text": "District 9 delivers on all fronts %u2013 it's an imaginative sci-fi tale, a gritty actioner, a dazzling effects film, a compelling dramatic story, a biting satire, and a flat out exciting piece of pop entertainment.",
      "author": "Beth Accomando"
    },
    {
      "text": "District 9 is a bold, imaginative sci-fi entry, but let's not get carried away with the hype.",
      "author": "Christian Toto"
    },
    {
      "text": "This is the movie Transformers should've been.",
      "author": "Gina Carbone"
    },
    {
      "text": "Overall, 'District 9' is a uniquely moving, heartfelt and provocative drama that stays with you after you've left the theater.",
      "author": "Wilson Morales"
    },
    {
      "text": "This ham-fisted Apartheid allegory involving beleaguered insectoid space aliens herded into the eponymous South African ghetto wins several points because it craftily hybridizes much that was cool about '80s sci-fi.",
      "author": "Gregory Weinkauf"
    },
    {
      "text": "If sensitive, intelligent, and cat food craving creatures whose heads look like transplants from the 'Star Wars' cantina scene is by itself not enough to pique your interest to see 'District 9,' then wherefore art thou?",
      "author": "Steve Crum"
    },
    {
      "text": "Parental Content Review",
      "author": "Jim Judy"
    },
    {
      "text": "Instead of running around and shrieking, this story posits an even more believable reaction to an alien invasion --- a bureaucratic one.",
      "author": "Nell Minow"
    },
    {
      "text": "Believe the hype. As a sci-fi thrill ride, and a provocative commentary on xenophobia, District 9 is definitely all that it's cracked up to be.",
      "author": "Kit Bowen"
    },
    {
      "text": "Gross but fascinating ... it held my attention from start to finish.",
      "author": "Steve Rhodes"
    },
    {
      "text": "A sci-fi original.",
      "author": "Kurt Loder"
    },
    {
      "text": "Artsy vertigo, racial profiling from outer space, black on prawn violence, Nigerian gangsters into cannibalistic health food diets, and inter-species creature sex for sale. And no, I did not have sex with that alien.",
      "author": "Prairie Miller"
    },
    {
      "text": "The backstory beats the hell out of the present-tense plot, a routine affair in which a well-meaning doofus working for the Man is infected with a virus, starts turning into an alien himself, and falls in with the oppressed creatures.",
      "author": "J. R. Jones"
    },
    {
      "text": "This is one of those rare films where seeming plot holes turn out not to be holes, after all.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "District 9 is Independence Day for the art-house set.",
      "author": "Matt Brunson"
    },
    {
      "text": "In this summer of gargantuan mediocrities, a modestly budgeted project with an actual idea in its head, and the wiles to manifest it onscreen, exploding heads and all -- that's something.",
      "author": "Michael Phillips"
    },
    {
      "text": "District 9 is the real deal. Hallelujah.",
      "author": "Walter Chaw"
    },
    {
      "text": "A memorable, monstrous fable that's consistently gripping.",
      "author": "Joe Neumaier"
    },
    {
      "text": "Is there anyone--prawn or human--that we in the audience are prompted to care about?",
      "author": "Harvey S. Karten"
    },
    {
      "text": "The movie falls into the same uneasy category as Eight Legged Freaks: too tongue-in-cheek to be thrilling, not funny enough to be a comedy.",
      "author": "Kyle Smith"
    },
    {
      "text": "The movie embodies speculative fiction, taking a real-world situation, applying it to a fantastic concept and then seeing how it makes us feel.",
      "author": "Kevin Carr"
    },
    {
      "text": "In a good summer, there's usually a movie that will come out of nowhere and completely wow us. This is a good summer, and that movie is District 9.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "Audiences everywhere will appreciate the sleek, pulsating, clever film that Blomkamp has created.",
      "author": "Shawn Levy"
    },
    {
      "text": "Taking a traditional sci-fi approach, Blomkamp examines contemporary society through a new prism.",
      "author": "Robert W. Butler"
    },
    {
      "text": "A late-summer jolt of serious science-fiction juice that marries breathless action to political satire and poignant drama.",
      "author": "Kevin Williamson"
    },
    {
      "text": "Every now and then, a film comes along that both defies and compels description.",
      "author": "Amy Biancolli"
    },
    {
      "text": "About the only way District 9 - a bloody marvelous action movie that's part science-fiction allegory and part unabashed mayhem - could get more in your face is if it was shot in 3D.",
      "author": "Sean P. Means"
    },
    {
      "text": "The film all but gets away from [the director] as battles take over and opportunities to explore the story as more than the sum of its weapons disappears.",
      "author": "Tom Keogh"
    },
    {
      "text": "The fresh premise over, the stale action returns.",
      "author": "Rick Groen"
    },
    {
      "text": "As an allegory of racial conflict and mass immigration, District 9 never really goes anywhere: The appealing premise fades into the background before 20 minutes have elapsed.",
      "author": "Daniel Engber"
    },
    {
      "text": "A swift, subtle movie, it trusts us to do some of the work.",
      "author": "Chris Hewitt"
    },
    {
      "text": "You've seen alien invasion flicks before, and you've seen more than your share of summer blockbusters. But you've never seen anything quite like District 9.",
      "author": "Adam Graham"
    },
    {
      "text": "This might go down as the year that science-fiction cinema, despite the deafening crash and clangor of sparring robots, began to rediscover its brains, heart and soul.",
      "author": "Cary Darling"
    },
    {
      "text": "A thinking man's, or man-boy's, Transformers.",
      "author": "Peter Rainer"
    },
    {
      "text": "If you're looking for the late-summer special-effects action fantasy with big franchise potential, forget about G.I. Joe: The Rise of Cobra. (You already forgot? Fine.) Instead, proceed directly to District 9.",
      "author": "Richard Corliss"
    },
    {
      "text": "Bounds from one contrivance to the next.",
      "author": "Shaula Clark"
    },
    {
      "text": "District 9 succeeds brilliantly as an exercise in style, but the style promises a level of substance the film never quite delivers.",
      "author": "Christopher Orr"
    },
    {
      "text": "Not just an excellent time for what it has to say, but also for the effortlessly exciting way in which it delivers the cargo.",
      "author": "Scott Weinberg"
    },
    {
      "text": "In a summer where toy robots and action heroes have rocked the box office and killed brain cells, it's nice to see a movie where some serious thought has been put into reviving a stale genre.",
      "author": "Peter Howell"
    },
    {
      "text": "There's a wonderfully sly, farcical verve to these early moments, but it dissipates when the script, with its strains of E.T. and The Fly, moves into high sci-fi gear.",
      "author": "Joanne Kaufman"
    },
    {
      "text": "District 9 proves that sci-fi thrillers don't have to be star-studded or mega-budgeted to be visually compelling and thoroughly entertaining.",
      "author": "Claudia Puig"
    },
    {
      "text": "A sci-fi-fueled indictment of man's inhumanity to man -- and the non-human -- District 9 is all horribly familiar, and transfixing.",
      "author": "John Anderson"
    },
    {
      "text": "In the midst of it all you almost take for granted the carefully rendered details of the setting, the tightness of the editing and the inventiveness of the special effects.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's not for everyone, but for sci-fi fans and audiences who want something different from the run-of-the-mill no-brainer Hollywood summer film, it's a must-see.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "In District 9, racism provides the white guy with a very special growth experience.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "Monty Python-esque. Reminded me a bit of the Stormtrooper spoof on TV's \"Cops.\" Sharlto Copley sells it to us with grit, charm, naivety, and humor. He's absolutely brilliant.",
      "author": "Ross Anthony"
    },
    {
      "text": "For 85 minutes, District 9 is a thinking creature's action film, but its final brain-numbing half hour sacrifices most of that logic for loud blasts and unconvincing sentiment.",
      "author": "Robert Davis"
    },
    {
      "text": "For every person who walks out of the cineplex complaining that they want to see something different and original. That doesn't mean it is awesome, but it is different.",
      "author": "Willie Waffle"
    },
    {
      "text": "District 9's City of God meets War of the Worlds hybrid proves overbearing and under-convincing.",
      "author": "Peter Canavese"
    },
    {
      "text": "The first half is great: original, well-paced, superb production design. But the promising story ultimately falls flat, devolving into an overlong shootout, turning from provocative social commentary to E.T.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "A galvanizing thriller that delivers an unfortunate mixed message through its 'alien apartheid' metaphor... A young white suburbanite might emerge from a screening thinking that aliens are cool, but, y'know, black folks are really scary.",
      "author": "John Beifuss"
    },
    {
      "text": "By avoiding the typical end of the world apocalypse that most alien invasion movies mandate...District 9 becomes that most elusive of science fiction films - a serious and thoughtful dissertation on who we really are.",
      "author": "Bill Gibron"
    },
    {
      "text": "A wonderfully-entertaining suspense thriller that reinvents and recharges the alien invasion genre.",
      "author": "David Foucher"
    },
    {
      "text": "Jolts with disturbing plot twists, disgusts with gory kills, showcases awesome and inventive alien technology, comments on inhumane medical experimentation and criticizes unchecked military might, but always remains in service of a nail-biting story.",
      "author": "Sean O'Connell"
    },
    {
      "text": "This is vibrant, original and marks the arrival of a talent to watch.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "As an action director, Blomkamp is no John Carpenter. Parts of the story are not dramatised but narrated direct-to-camera by supposed interview subjects -- a lazy device that reduces immediacy and momentum.",
      "author": "Jake Wilson"
    },
    {
      "text": "I know this word gets thrown around a lot and it should be used sparingly, but this film is very close to being a masterpiece in science fiction cinema.",
      "author": "Kevin McCarthy"
    },
    {
      "text": "A revelatory debut, an inventive, daring, original piece of filmmaking that doesn't just hint at a new arrival on the scene as much as blasts one into the film consciousness.",
      "author": "Brian Tallerico"
    },
    {
      "text": "... the last time I saw a genre film that felt like this much of a stick-the-landing home run was 'Shaun Of The Dead'... a smart, visceral sci-fi parable.",
      "author": "Drew McWeeny"
    },
    {
      "text": "It's the film's freshness -- with an original story, told in Blomkamp's unique storytelling voice -- that most defines District 9, injecting it with a feel of game-changing importance that elevates it above normal summertime fare.",
      "author": "Mike Scott"
    },
    {
      "text": "...a marginally entertaining endeavor that's sure to leave most viewers wondering what all the fuss is about.",
      "author": "David Nusair"
    },
    {
      "text": "Original and ingenious, District 9 is smart, funny and a terrifically entertaining time at the movies. That this is a first feature makes the film a marvel and Neill Blomkamp a filmmaker to watch.",
      "author": "Diva Velez"
    },
    {
      "text": "An amazing movie, one that will sweep you up emotionally and intellectually, that will give you plenty to think over and even more to marvel at. It's an achievement that needs to be seen to be believed, and once it's seen it's guaranteed to be beloved.",
      "author": "Devin Faraci"
    },
    {
      "text": "It is instead a magnificent discussion on what it is to be human, the demons that haunt us and the reasons some choose to stand against injustice no matter what the cost.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Despite my questions and small complaints, this is a great movie.",
      "author": "Scott Nash"
    },
    {
      "text": "It pulls off a rather impressive feat in being smarter and bloodier than any other action or sci-fi movie released this year.",
      "author": "David Medsker"
    },
    {
      "text": "The low budget makes everything look grimy, gutter-tech and real, and that suddenly seems striking and visually fresh compared to the slickly digital effects we're all used to being bombarded by now.",
      "author": "Dave White"
    },
    {
      "text": "Even with a second half that's significantly less compelling than the first, it earns points for its seamless special effects and its subtle but pointed sense of humor.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Because Neill Blomkamp's emphasis is on humanistic rather than cultural relevance, the writer-director's feature debut is a genuine triumph nonetheless.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "An engaging sci-fi parable rooted in both universal themes and a specific setting that often takes you by surprise with both its smarts and intensity",
      "author": "Garth Franklin"
    },
    {
      "text": "With its unique story, fantastic visual effects and real-world look, District 9 is sure to be a future Sci-Fi classic.",
      "author": "Vic Holtreman"
    },
    {
      "text": "Overall, with aliens that look like a crossbreed of roaches and lobsters, District 9 is a bad episode of Star Trek meets an insipid Apartheid mini-series. This was one disappointing sci-fi spectacle.",
      "author": "Clay Cane"
    },
    {
      "text": "\"District 9\" does show that Blomkamp is not without talent and could very well one day make a truly great genre film, even if he hasn't quite done so here.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Its early allegory may be blunt, but its second half begs for something even as heavy-handed as that to keep it involving.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Director Neil Blomkamp, whose future in Hollywood should now be a lock, along with screenwriter Terri Tatchell (not to mention Peter Jackson, the film's producer) have created a world with massive scope.",
      "author": "Matthew Razak"
    },
    {
      "text": "I'm still excited about the potential of District 9. The problem is, I've already seen it.",
      "author": "Josh Larsen"
    },
    {
      "text": "Could have been better if it had remained focused on the main character rather than trying to show off a variety of filmmaking styles with a lot of flashy CG FX-driven action.",
      "author": "Edward Douglas"
    },
    {
      "text": "This baby has the stuff to end the movie summer on a note of dazzle and distinction.",
      "author": "Peter Travers"
    },
    {
      "text": "What is absolutely impressive are the visual effects: the hordes of aliens, the mother ship, the seamless blending of the real with the fantastic.",
      "author": "Steven Rea"
    },
    {
      "text": "You grow more and more impressed with the level of detail -- District 9 is a horrible place, but it starts to feel like a real horrible place, and the plight of its ugly inhabitants begins, against all odds, to earn our sympathy.",
      "author": "Gary Thompson"
    },
    {
      "text": "The result is like a two-stage booster rocket, propelled by a tricky structure, deft style and original scenario before settling into the sort of orbit any fanboy could recognize and appreciate.",
      "author": "Duane Dudek"
    },
    {
      "text": "The movie does satisfy the cravings for a smarter sci-fi movie and does have some rewarding aspects.",
      "author": "Jeff Vice"
    },
    {
      "text": "A bold and creative science fiction adventure that shows the dire consequences of hating strangers and ignoring the spiritual practice of hospitality.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "...a sci-fi parable about bigotry and corporate greed that, backed by Jackson's special effects house WETA, brings a whole new world to the Science Fiction genre.",
      "author": "Laura Clifford"
    },
    {
      "text": "...this auspicious debut will undoubtedly make a few studio executives regret killing Halo.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "There are no quick, confusing edits to obscure fights or what the aliens look like...most remarkable, though, is how their behavior and mannerisms evoke our own.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "District 9 opens the door to a new and thrilling vision of the sci-fi genre. It's a genuinely unique and compelling cinematic reflection of our times.",
      "author": "Jennifer Merin"
    },
    {
      "text": "Somewhere between very good and awesome, but no use nitpicking.",
      "author": "Matt Pais"
    },
    {
      "text": "In an ideal world, every Hollywood studio suit would be forced to sit through District 9 as part of a curriculum titled \"How to Make a Summer Movie That Delivers.\"",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Majestic and matter-of-fact in equal measure, District 9 provides purposefully difficult and uneasy food for thought to go along with its more visceral thrills.",
      "author": "Dustin Putman"
    },
    {
      "text": "District 9 fuses science fiction mayhem and biting social commentary as well as any film since Starship Troopers. It's the rare alien invasion story that has the aliens running scared.",
      "author": "Scott Tobias"
    },
    {
      "text": "The coolest, most intelligent action movie of the year. It's visually striking and provides an adrenaline rush, but it also has a brain.",
      "author": "Frank Swietek"
    },
    {
      "text": "It's an outsider blockbuster, a juicy, bravura piece of moviemaking pulp, and its hellacious style almost -- but not quite -- disguises its shortcomings as a story.",
      "author": "Ty Burr"
    },
    {
      "text": "The strangest, funniest, most original sci-fi flick you'll see this year - or any year, for that matter.",
      "author": "Thomas Leupp"
    },
    {
      "text": "The film threads enough thoughtful commentary into its whirligig media-fractured action plot to mostly make up for its lapses into cliché.",
      "author": "Chris Barsanti"
    },
    {
      "text": "It's a bad joke that District 9 will be hailed for its \"originality.\" The movie's main fun comes from wondering what coin of the pop realm Blomkamp will pluck out from his memory bank next.",
      "author": "Michael Sragow"
    },
    {
      "text": "It's a grimy, consistently surprising and fundamentally human-centric science-fiction yarn, reminiscent of the dystopian, semi-realistic 1970s tradition.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "[F]loored with surprise that this could... feel so fresh, so original, so like nothing I'd ever seen before...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "I, for one, hope the inhabitants of Earth never encounter visitors from another planet because the reality of how we might interact with them could be close to what is depicted here, and that's a depressing thought.",
      "author": "James Berardinelli"
    },
    {
      "text": "A great example of how fresh science fiction can be when it's not just handed over to the special effects team and then the marketing division. \"District 9\" is far from perfect, but every frame in it drips with ambition, energy and vision.",
      "author": "James Rocchi"
    },
    {
      "text": "The reason District 9 reverberates so loudly is because its moral indignation is cranked to 11.",
      "author": "Joe Williams"
    },
    {
      "text": "District 9 is a wrenching, riveting, occasionally violent, often heartbreaking, and, above all, socially conscious science-fiction film featuring seamlessly integrated CGI effects alongside flat-out perfect performances.",
      "author": "Marc Savlov"
    },
    {
      "text": "The standard action plot demotes District 9 from a potential game-changer to simply a very good film. And considering the painful summer movie season we've endured thus far, you can't ask for much more than that.",
      "author": "Justin Strout"
    },
    {
      "text": "District 9 does a lot of things right, including giving us aliens to remind us not everyone who comes in a spaceship need be angelic, octopod or stainless steel.",
      "author": "Roger Ebert"
    },
    {
      "text": "You enter with a thought-provoking quasi-doc-feeling essay on the not so black and white issue of emergent social groups, you exit with your mind splattered against the back row of the theater.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Aren't the best summer movies supposed to come out before August?",
      "author": "Rob Vaux"
    },
    {
      "text": "Blomkamp is a filmmaker to watch, with absurdly precise visual instincts. But District 9 is his first film and it shows, bloating a fascinating fable to a point of collapse.",
      "author": "Brian Orndorf"
    },
    {
      "text": "There's no doubt genre fans will eagerly surrender to the crafty, low budget charms of District 9 ... It definitely has the goods",
      "author": "Geoff Berkshire"
    },
    {
      "text": "One of the best sci-fi films of the decade and one of the most entertaining movies of 2009.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Inventive, intriguing sci-fi indie with mainstream polish is pure allegory - and isn't afraid of the questions it raises or the objections it may incur.",
      "author": "Joe Lozito"
    },
    {
      "text": "Copley is a revelation as the even tempered Wikus, whose own evolution allows him to begin the film as cheerful as Monty Python's Eric Idle and end the day tougher than Christian Bale in the last \"Terminator\" film.",
      "author": "Michael A. Smith"
    },
    {
      "text": "It's always exhilarating seeing something refreshingly new on screen, and even though we've seen horror before, and aliens before, and the dirty deeds of capitalism before, it's never been quite like this.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "The world Blomkamp has created in this original creature feature is at once familiar and distinctive.",
      "author": "Vicky Roach"
    },
    {
      "text": "District 9 proves that there's intelligent alien life in the movie universe this summer.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "For science-fiction fans looking for a bit more brainpower than Transformers has to offer, District 9 points the way toward redemption for a movie genre that could use an infusion of artistic ambition.",
      "author": "Kerry Lengel"
    },
    {
      "text": "The humanity of District 9 adds another dimension to this multilayered, rewarding work - one of the best of the summer, and undoubtedly the most inventive from the multiplex this year.",
      "author": "Matthew Sorrento"
    },
    {
      "text": "Far from your average monster debauchery or invasion extravaganza, District 9 operates as an allegory for apartheid, xenophobia, corporate malfeasance, gentrification, and the dog-eat-dog nature of living in poverty under hostile and oppressive conditions",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "District 9 represents the sloppiest and dopiest pop cinema -- the kind that comes from a second-rate film culture.",
      "author": "Armond White"
    },
    {
      "text": "This is one intense, intelligent, well-crafted action movie - one that dazzles the eye with seamless special effects but also makes you think without preaching.",
      "author": "Christy Lemire"
    },
    {
      "text": "District 9 is the most exciting science fiction movie to come along in ages; definitely the most thrilling film of the summer; and quite possibly the best film I've seen all year.",
      "author": "Sara Vilkomerson"
    },
    {
      "text": "Myriad obvious ancestors prevent the film from feeling as revolutionary as some have claimed, though there's nonetheless vitality to Blomkamp's expert implementation.",
      "author": "Nick Schager"
    },
    {
      "text": "Neill Blomkamp's career-making debut film District 9 mixes alien contact with apartheid politics, deftly creating one of the best sci-fi films in recent memory.",
      "author": "Jonathon Valenzuela"
    },
    {
      "text": "District 9 is a brave, intelligent and exciting film. Some of its story beats fall into the \"unlikely\" category, but the central idea, the design, and the acting are so strong that you'll likely go with it and have a damn good time doing so.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Even in the movie's most conventional stretches, Blomkamp puts things across with terrific verve, using action and computer effects to enhance rather than trump story and character.",
      "author": "Scott Foundas"
    },
    {
      "text": "Aliens and robots will get tushes in the seats, but what makes this blockbuster so outstanding is decidedly human.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Easily the most exhilarating lesson in racial politics you're ever likely to sit through.",
      "author": "Anders Wotzke"
    },
    {
      "text": "Completely absorbing and intense. As audiences are compelled early in the film to \"learn from what has happened\", Blomkamp uses District 9 to quietly remind us that it's too late for some.",
      "author": "Patrick Kolan"
    },
    {
      "text": "Technically superb, District 9 is a feast of seamless digital work fused to live action, as it is also a smart fusion of documentary format with narrative fiction.",
      "author": "Andrew L. Urban"
    },
    {
      "text": "The \"wow\" factor in Neill Blomkamp's District 9 is huge, so much so that it would be easy to overlook what a soulful, tragically heroic story it is.",
      "author": "Marshall Fine"
    },
    {
      "text": "Produced by Peter Jackson and announcing the arrival of a major new talent, District 9 is one of the most original films this summer, an exciting sci-fi thriller that's grounded in Apartheid but whose significance goes beyond that particular context.",
      "author": "Emanuel Levy"
    },
    {
      "text": "District 9 is a thoroughly original, super realistic, sci-fi-tinted tale of woe; and at the end of the day we have to applaud such originality as loudly as we possibly can.",
      "author": "Steve"
    },
    {
      "text": "An explosive mixture of Alien Nation meets Black Hawk Down!",
      "author": "James O'Ehley"
    },
    {
      "text": "Starts out as a genuinely disturbing treatise on bigotry before devolving into a violent blitzkrieg that lacks the inventiveness of the story's earlier sequences.",
      "author": "Tim Grierson"
    },
    {
      "text": "District 9 is hands down the best film of the summer and has made me love movies all over again. It's engaging, explosive, and pure nonstop awesomeness - it's what big summer movies are supposed to be.",
      "author": "Brad Miska"
    },
    {
      "text": "Intense, graphically novelistic (though it's an original story) and just funny enough to keep you thoroughly entertained, even while the subtext is of a very serious nature.",
      "author": "Tim Cogshell"
    },
    {
      "text": "Neill Blomkamp's visceral and thumping debut presents a fascinating and effective vision of the future, and of humanity itself.",
      "author": "Katey Rich"
    },
    {
      "text": "A genuinely original science fiction film that grabs you immediately, not letting go until the final shot.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "This grossly engrossing speculative fiction bears Jackson's blood-splattered fingerprints but also heralds first-time feature director Neill Blomkamp as a nimble talent to watch.",
      "author": "Justin Chang"
    }
  ],
  "release_year": 2009,
  "duration": 111,
  "genres": [
    "Sci-Fi"
  ],
  "age_rating": "R",
  "synopsis": "Thirty years ago, aliens arrive on Earth -- not to conquer or give aid, but -- to find refuge from their dying planet. Separated from humans in a South African area called District 9, the aliens are managed by Multi-National United, which is unconcerned with the aliens' welfare but will do anything to master their advanced technology. When a company field agent (Sharlto Copley) contracts a mysterious virus that begins to alter his DNA, there is only one place he can hide: District 9.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/tuGlQkqLxnodDSk6mp5c2wvxUEd.jpg"
}