{
  "movie_name": "Divergent",
  "movie_id": "divergent",
  "total_reviews": 236,
  "reviews": [
    {
      "text": "Unfortunately, [director Neil Burger] succeeds despite the screenwriting by Vanessa Taylor and Evan Daugherty, and not because of it.",
      "author": "Ankit Ojha"
    },
    {
      "text": "There have been far more compelling metaphors for the trials of adolescence.",
      "author": "Brian Eggert"
    },
    {
      "text": "This slick-looking, but shallow slice of sci-fi features a certain amount of Harry Potter-esque HufflePuff...",
      "author": "James Croot"
    },
    {
      "text": "Divergent is Hunger Games light, but Woodley and James bring some heat to the leads and it's fun watching Kate Winslet sneering her way through a villainous role.",
      "author": "Richard Crouse"
    },
    {
      "text": "Falling victim to the same problem of many science-fiction or fantasy epic startups, the story is 90% introduction.",
      "author": "Mike Massie"
    },
    {
      "text": "It doesn't help that the music by Junkie XL is overwrought and dominating in the worst of ways.",
      "author": "Richard Propes"
    },
    {
      "text": "Despite a good lead performance, what we have is a glossy shell but not much underneath.",
      "author": "Allen Almachar"
    },
    {
      "text": "It is glaringly obvious that the movie version of Divergent is influenced by the success and popularity of The Hunger Games and sadly this underwhelming film did not deliver.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Bland, clunky, and lifeless.",
      "author": "Brent McKnight"
    },
    {
      "text": "I was bored.",
      "author": "Andrew Galdi"
    },
    {
      "text": "It's like Hunger Games, meets Enders' Game, meets every YA book you've ever read.",
      "author": "Avaryl Halley"
    },
    {
      "text": "Divergent suffers in comparison to Hunger Games. But when judged alone, Divergent makes a strong case for the entertainment value of an empowered young female hero attempting to survive and resist in a dystopian society.",
      "author": "Kathi Maio"
    },
    {
      "text": "A possibly compelling idea gets lost in the mire of trying to be appealing to a core audience that doesn't want to work hard for narrative reward.",
      "author": "Nicholas Bell"
    },
    {
      "text": "The film is more interesting than the average bad movie precisely because it so gratuitously, and even thematically, fails to fit together.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "This is a rite-of-passage film, with action, romance and self-realization woven in. But unlike some others of this genre, Divergent is thought-provoking teen sci-fi.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Saved by Woodley and James' performances, Divergent has every trope a teenage fan could ask for, and not much else.",
      "author": "Sophie WIng"
    },
    {
      "text": "Divergent is chock-full of holes, but Woodley and her bright band of co-stars try valiantly to save the day.",
      "author": "Bernard Boo"
    },
    {
      "text": "The story is told in a much too clinical fashion.",
      "author": "Paula Fleri-Soler"
    },
    {
      "text": "Divergent doesn't have the same mass appeal, but it doesn't make it any less impactful than the best that this genre - the science fiction genre, not the young adult subgenre - has to offer.",
      "author": "Amanda Greever"
    },
    {
      "text": "While I can't recommend \"Divergent\" to anyone not already fans of the novels, I will say I'm interested in where this series goes.",
      "author": "Micheal Compton"
    },
    {
      "text": "Woodley makes things believable... and she and James sell their understated relationship.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Woodley plays her part so believably you can't help but root for her despite the juvenile, it's-okay-to-be-different, people-aren't-just-one-thing thematic undertones so simply expressed for the training bra set.",
      "author": "Di Golding"
    },
    {
      "text": "Divergent wishes it had nearly the imagination, creativity and angst-ridden scope as its obvious competitor in Games. Let the vicious vixens Beatrice Prior and Katniss Everdeen duke it out until another dueling dollface comes along to settle the score",
      "author": "Frank Ochieng"
    },
    {
      "text": "Divergent is one of the few film adaptations that improves upon its source material. That's not to say that Divergent is a great film, but it's definitely a solid, often thrilling adaptation of a weakly written book.",
      "author": "Deborah Krieger"
    },
    {
      "text": "All I saw was an overly complicated riff on every YA story cliché.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "An intriguing premise, sharp casting and thoughtful world-building make \"Divergent\" an engrossing science-fiction adventure.",
      "author": "Brandy McDonnell"
    },
    {
      "text": "It's better than Twilight...When this movie DOES something, it's actually intriguing.",
      "author": "Andre Meadows"
    },
    {
      "text": "... the drama it represents is often bland.[Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Divergent may not be the most popular thrill in the theme park, but it could have been a lot worse, and you'll probably be up for a second spin.",
      "author": "Josh Terry"
    },
    {
      "text": "At the heart of this dystopian tale awash in grays and browns is a lesson about finding one's identity and being at peace with oneself.",
      "author": "Reagan Gavin Rasquinha"
    },
    {
      "text": "[Divergent] does a lot right, with slick visuals, an interesting premise and top cast delivering moments when this fantasy thriller is just that, thrilling, although it's hard to shake the impression this is a second-rate Hunger Games.",
      "author": "Francesca Rudkin"
    },
    {
      "text": "... Divergent, despite multiple claims otherwise, tries to capture the format of The Hunger Games but completely phones in almost each element.",
      "author": "Candice Frederick"
    },
    {
      "text": "[Divergent] is faithful enough to the book -- but doesn't work well unto itself.",
      "author": "Lisa Rosman"
    },
    {
      "text": "The journey is not powerful enough. It loses track and seems purposeless soon enough.",
      "author": "Anuja Jaiman"
    },
    {
      "text": "This is a movie a girl could see with her mom and a big ol' pretzel on a rainy day.",
      "author": "Amy Carlberg"
    },
    {
      "text": "Trust me when I say that, for some reason, stick with the saga in the event that the sequels will all materialise, because the ultimate pay off when you discover what it's all for will be definitely worth it.",
      "author": "Becky Suter"
    },
    {
      "text": "The pic's charismatic cast turns the skeletal narrative into something functional, making for a surprisingly pleasant ride.",
      "author": "J. Olson"
    },
    {
      "text": "It may be totally predictable and just a tad overlong and overdone, but Divergent is a far better foray into YA territory than Vampire Academy, or even The Host.",
      "author": "Theresa Smith"
    },
    {
      "text": "Rather than concentrate on environment and character development, it spends two-thirds of its runtime forgetting it needs an ending.",
      "author": "Jared Mobarak"
    },
    {
      "text": "It's really just an elaborate metaphor for Being Your Own Beautiful Self, which apparently goes over well with readers of a certain tender age.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "... a journey that puts (Tris), her family, and the entire 23rd century in danger before Buck Rogers can get back to save it.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Divergent takes its time in setting up the story and -- frankly -- future installments in the series.",
      "author": "Zach Hollwedel"
    },
    {
      "text": "Divergent is a banal experience that suffers from a stretched-out plot and uninteresting characters.",
      "author": "Jeff Beck"
    },
    {
      "text": "For this first film at least, much of the fantastical elements feels as much like window dressing as the post-apocalyptic material in After Earth.",
      "author": "Scott Mendelson"
    },
    {
      "text": "It's not at all as intelligent as it thinks it is, but it's a pretty solid epic all things considered.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Tris is no Katniss Everdeen, and Divergent is a better film for not trying to impersonate a similar trilogy. It won't excite the world to the extent of The Hunger Games but this more humble offering is nevertheless exciting, fun and satisfying.",
      "author": "Jess Lomas"
    },
    {
      "text": "This dystopia flick offers a pseudo-allegory for teenagehood along with a predictable plot, bland setting, and pat romance. So it conforms to today's alt-world teen-film formula.",
      "author": "Brian Gibson"
    },
    {
      "text": "A far more interesting plot lurks in the background ... It's this - not the mawkish romance - that leads to a fairly exciting climax and sets the stage for a more intriguing premise in the two additional movies that already are in the works ...",
      "author": "Greg Maki"
    },
    {
      "text": "Dramatically, Divergent wanders, but over rich philosophical soil.",
      "author": "John Anderson"
    },
    {
      "text": "A relatively faithful adaptation that brings with it the best and the worst parts of the novel and leaves out a few things that might have made it better.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Although 'Divergent' has understandably attracted a great readership, as did its predecessor, 'The Hunger Games' series, this new 'young adult' tale has a much weaker presence on the big screen",
      "author": "Linda Cook"
    },
    {
      "text": "If the 'Hunger Games' films do a fairly tidy job of explaining their premise, 'Divergent' has to over and over for nearly 2 1/2 hours.",
      "author": "Brad Keefe"
    },
    {
      "text": "...just another bloated adaptation that's unable to capture the magic of its literary forebear.",
      "author": "David Nusair"
    },
    {
      "text": "All the flashy digital bells and whistles one would equate with such a scenario are kept at a startling minimum--but such a back-to-basics approach thus forces one to pay attention to the actual substance of the story and characters.",
      "author": "Michael Dequina"
    },
    {
      "text": "No, it's not wildly different than other science fiction, hero's journey, and adventure movies. Sometimes we call such stories archetypal. Mythic, even.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Overall, this is a solid first-up effort for the Divergent franchise. Even though the film loses momentum in its final act as it sets up shop for next year's sequel, a majority of fans will be perfectly content with what has been achieved here.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Yet another slice of post-content sci-fi schlock that relies on audiences over-looking huge story holes and a grand lack of pace in favour of design and a hot young cast...lame-brained.",
      "author": "Jim Schembri"
    },
    {
      "text": "If I had to join a faction, I'd be looking for one called Bafflement or Exasperation. After spending the best part of five hours watching Divergent and Only Lovers Left Alive, I understand why audiences are flocking to see the Muppets and The Lego Movie.",
      "author": "Evan Williams"
    },
    {
      "text": "Science fiction it may be, but the essence of the film is that timeless adolescent conundrum: who am I?",
      "author": "Ryan Gilbey"
    },
    {
      "text": "Woodley's performance is proof, if proof were needed, that only Jennifer Lawrence can do 'blank-faced teen' compellingly.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Really the film is so intent on setting things up for, presumably, subsequent films that it forgets to be entertaining and involving in its own right, I think, and so I found this going over my head. I wasn't really interested in all of this.",
      "author": "David Stratton"
    },
    {
      "text": "The director was Neil Burger who handles the action with aplomb.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "The conflicts inherent in old-fashioned high school movies are accommodated, with bullying to stir the blood and romance to set the heart thumping. But Divergent's assimilation of all this fails to excite.",
      "author": "Sandra Hall"
    },
    {
      "text": "Romance and self-realisation wrapped in violence now sell a whole lot of tickets. At least Divergent has more to ponder than most of the field.",
      "author": "Paul Byrnes"
    },
    {
      "text": "It's all very Hunger Games Lite.",
      "author": "Tom Glasson"
    },
    {
      "text": "If one can push past the fact that its world feels a little too familiar, this is a deftly executed slice of teen sci-fi.",
      "author": "Cara Nash"
    },
    {
      "text": "Filmmaker Neil Burger is more interested in whizzy visuals and a thorny plot to pay much attention to the characters or larger underlying themes, which leaves the film feeling eerily superficial.",
      "author": "Rich Cline"
    },
    {
      "text": "A brutal slog of a movie ...",
      "author": "Siobhan Synnot"
    },
    {
      "text": "Drab production design (bombed-out buildings and Blake's 7 costumes) aims for gloomy portent, but the grit feels as fake as the fashionable tattoos.",
      "author": "Mark Kermode"
    },
    {
      "text": "For a tale that trumpets the virtues of non-conformity, teen fantasy adventure Divergent proves disappointingly content to follow the pack.",
      "author": "Jason Best"
    },
    {
      "text": "Another big yawn from the young adult stable",
      "author": "Cameron Williams"
    },
    {
      "text": "Veronica Roth loyalists may be delighted. Most everyone else will be aching for the credits.",
      "author": "Donald Clarke"
    },
    {
      "text": "This is a slickly made, energetic teen sci-fi yarn, let down by its derivative and schematic storyline.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "An often entertaining, and sometimes very interesting, piece of teen SF.",
      "author": "Andrew Osmond"
    },
    {
      "text": "Even if the visuals are rather drab and the action more brisk than imaginative, there's enough menace and suspense to create an entertaining diversion.",
      "author": "Alan Jones"
    },
    {
      "text": "In its sledgehammer metaphoring and scrappy, eager-to-please charm, it's easy to warm to this latest fantasy teen adaptation.",
      "author": "Rob Daniel"
    },
    {
      "text": "Those with a high tolerance for blockbusters in which non-fetishised females save the day will be able to put up with its flaws - including lacklustre action sequences and a preoccupation with tattoos.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Totalitarianism versus the individual is the basic concept of Divergent, a thrilling sci-fi adventure that is every bit as good as The Hunger Games with a dash of The Matrix added for good measure",
      "author": "Louise Keller"
    },
    {
      "text": "Divergent is aimed squarely at the kind of audience who will already have watched The Hunger Games films, and the comparison does it no favours.",
      "author": "Brian Viner"
    },
    {
      "text": "So many derivative elements don't make it a terrible movie, but merely shoulder-shrugging predictable.",
      "author": "Bruce Bennett"
    },
    {
      "text": "What a conformist message.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The blend of action, romance and political plotting is handled with smooth efficiency by director Neil Burger and Tris is an appealing, if ever so slightly dull heroine.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "The more you scrutinise the society Roth and these screenwriters have created, the more it seems a chintzily self-designed dystopia whose rules and entire infrastructure are pure cardboard.",
      "author": "Tim Robey"
    },
    {
      "text": "A futuristic challenge romp in the Hunger Games style.",
      "author": "Nigel Andrews"
    },
    {
      "text": "An exceptional teen girl rises up from the slurry of humanity and goes on to mount a revolution against... you know the drill.",
      "author": "David Jenkins"
    },
    {
      "text": "The satire is not as sharp as that of The Hunger Games and the training scenes borrow heavily from the much smarter Ender's Game. But it's also stylish, tense and surprisingly pacy.",
      "author": "Andy Lea"
    },
    {
      "text": "A tangle of under-expressed concepts, stock characters and stock ideas, and pacing misfires.",
      "author": "Tim Brayton"
    },
    {
      "text": "Barely diverting.",
      "author": "Bruce Diones"
    },
    {
      "text": "It's always disappointing when a film that places so much emphasis on the need to be free-thinking and different from the masses conforms so rigidly to other movies.",
      "author": "Rob Carnevale"
    },
    {
      "text": "Smart, tough and a little bit cool, this is an intriguing opening rather than a slam-dunk in its own right, but the cast - and especially Woodley - make it sufficiently diverting to merit a place in the action franchise ranks.",
      "author": "Helen O'Hara"
    },
    {
      "text": "At its heart, Divergent is wish fulfillment for teens raised by control freaks.",
      "author": "Margot Harrison"
    },
    {
      "text": "It was a relief to be pleasantly surprised by 'Divergent.' I was not expecting much, based on early reviews, but this is actually a good movie.",
      "author": "Robert Roten"
    },
    {
      "text": "I go sleep now.",
      "author": "Bob Grimm"
    },
    {
      "text": "The story is trite and the denouement looks hasty.",
      "author": "Kelly Vance"
    },
    {
      "text": "It's all pretty dumb, and it marks a career low for director Neil Burger, who's made some first-class indie dramas from his own scripts.",
      "author": "J. R. Jones"
    },
    {
      "text": "Nothing more than facile, easily digested teenage wish-fulfillment based on a shaky futurist premise.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The first impression left by the film is that Woodley's star quality is the main attraction in a storyline that feels too much like a Hunger Games-lite rip-off.",
      "author": "Lori Hoffman"
    },
    {
      "text": "With her performance as Tris Prior in Divergent, [Woodley] rescues and then raises up a film that could have been an utter disaster.",
      "author": "Sam Allard"
    },
    {
      "text": "Young adult audiences can SO relate.",
      "author": "Neil Pond"
    },
    {
      "text": "\"Divergent' is too busy warning us about the dangers of conformity to develop a distinctive personality of its own.",
      "author": "John Beifuss"
    },
    {
      "text": "The first film adapted from Veronica Roth's generically dystopian book series arrives with a sludgy, gray-hued plop.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Ultimately, Divergent is a mildly entertaining movie that only succeeds because of its talented cast.",
      "author": "David Blaustein"
    },
    {
      "text": "Despite being filmed and set in Chicago, Divergent feels like a manufactured product churned out by the Hollywood system.",
      "author": "Sam Fragoso"
    },
    {
      "text": "While the movie's not quite accomplished enough to leave us breathlessly awaiting the next chapter (as did the last Hunger Games flick), it also doesn't leave us wanting to avoid the sequel at all costs.",
      "author": "Matt Brunson"
    },
    {
      "text": "The hazy message, that you need to join a club, and only then think independently, is confused, and hardly the cynical dystopian satire of Orwell or Huxley.",
      "author": "Corey Hall"
    },
    {
      "text": "A movie so cold and monotone about its material that it plays more like an emotional concession than a full-fledged adventure.",
      "author": "David Keyes"
    },
    {
      "text": "The film is at its most captivating as the laws of the war-scarred world in a futuristic, decimated Chicago are laid out, and the heroine finds out what's in store for her.",
      "author": "Kent Turner"
    },
    {
      "text": "Yes, kids should embrace individuality, and yes, they should think for themselves. But this thinly veiled metaphor can be rough going sometimes, and the humorless, dumb script asks way too much of its cast.",
      "author": "Eric Melin"
    },
    {
      "text": "'Divergent' is one of those movies that will have you asking question after question - and not getting any answers.",
      "author": "Bob Bloom"
    },
    {
      "text": "Divergent has a few things going for it, but the bulk of its interesting material appears to be on back order.",
      "author": "Rob Vaux"
    },
    {
      "text": "I can't help comparing the movie studios that crank out these young adult fantasies to the evil organizations in the movies themselves, the ones that seek to control young minds and prevent them from thinking freely.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A painfully dumbed-down version of politics and human nature. It is exactly what you'd expect for a book aimed at 13-year-old kids... targeting the Twilight movie crowd.",
      "author": "Kevin Carr"
    },
    {
      "text": "Given the seemingly endless series of sub-mediocre YA adaptations, we should be thankful for whatever we can get.",
      "author": "Mel Valentin"
    },
    {
      "text": "The climactic chases, shootouts, and fistfights have been staged, filmed, and edited with insobriety. Visual clarity shouldn't be too much to ask from these movies, even if they fail to achieve ideological coherence.",
      "author": "Wesley Morris"
    },
    {
      "text": "This late-to-the-YA-dystopia-party look like a meal that's been left out in the sun for a day or so.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "If there's one area in which Divergent outpaces The Hunger Games by a country mile, it's chemistry.",
      "author": "Alynda Wheat"
    },
    {
      "text": "If anything's going to keep this color-by-numbers franchise afloat for that long it'll be Woodley. Her story arc may mirror that of young special heroines that came before her, but she's the most unassuming and relatable of the lot.",
      "author": "Dave White"
    },
    {
      "text": "\"Divergent\" has an empathetic heroine, an intriguing premise to keep it afloat, and enough twists to sustain it...",
      "author": "Leonard Maltin"
    },
    {
      "text": "Despite some moments of excitement, the screenplay fails to establish a deeper emotional connection for Tris outside of a casual rooting interest.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The film offers some distinct pleasures but suffers from an overriding familiarity.",
      "author": "Robert Levin"
    },
    {
      "text": "Certainly the teenagers who live and breathe these types of serial experiences will be thrilled. But, adults, who don't have a clue, can take a pass.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "It has some irritating flaws during its overly long two plus hours.",
      "author": "David Kaplan"
    },
    {
      "text": "The uninitiated will need to read Veronica Roth's book to understand what's so great about Divergent, because the movie is aggressively mediocre.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Divergent falls somewhere in a middle ground between high points of The Hunger Games and the low points of The Twilight Saga.",
      "author": "Kofi Outlaw"
    },
    {
      "text": "There's trouble with Woodley's performance, which is crushingly one-dimensional, failing to articulate the transformative hero's arc necessary to such entertainment.",
      "author": "Brian Orndorf"
    },
    {
      "text": "An action-packed romantic fantasy with an earnest message that ... encourages trusting oneself over a corrupt system, and values nonconformity.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "Divergent plods along at a snail pace. Everything unveils as expected without a whiff of surprise or nuance.",
      "author": "Julian Roman"
    },
    {
      "text": "She's nothing like Bella, that vampire-girlfriend, and this romance is nothing like Twilight.",
      "author": "Rebecca Cusey"
    },
    {
      "text": "At 139 minutes, the final explosion of story and incident feels like extra bloat in a film that is too much explanation and not enough understanding.",
      "author": "Witney Seibold"
    },
    {
      "text": "Divergent never properly settles on its motif. Is it individualism trumps tribalism? Or that individual success is tethered to teamwork? Is strict social order too constrictive? Or is intellectualism the true enemy of social order?",
      "author": "Kirk Baird"
    },
    {
      "text": "Thankfully, when Woodley isn't saddled with explaining how her world works, she's quite appealing. She's a credible teenager, a plausible tough girl, and believably smart.",
      "author": "Perry Seibert"
    },
    {
      "text": "Jackhammer music and sound design are all that hold the action scenes together.",
      "author": "Michael Sragow"
    },
    {
      "text": "Screenwriters Evan Daugherty and Vanessa Taylor have done a good job of translating the story to the screen, and fans of the novel will find little that hasn't been crammed into the film's two hours and 20 minutes.",
      "author": "Chris Knight"
    },
    {
      "text": "Strong female character leads in violent dystopia.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "...a surprisingly good action-adventure that held my interest until the Hollywood ending.",
      "author": "Tony Medley"
    },
    {
      "text": "I can recommend but the movie is hampered by a cookie-cutter societal threat and to mix metaphors, the paint-by-numbers plot turns painfully predictable at the climax.",
      "author": "Gary Wolcott"
    },
    {
      "text": "[The] future Chicago depicted in the film, with its plentiful food, steady supply of electricity, and zip lines, often seems about as post-apocalyptic as Knott's Berry Farm.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Haven't we seen this story before?",
      "author": "Robert Denerstein"
    },
    {
      "text": "I liked Shailene Woodley when I walked into the theater, and although she's prime for bigger creative challenges than Divergent, I still liked her when I walked out.",
      "author": "John Serba"
    },
    {
      "text": "If you can forget what it's saying, Divergent is fairly entertaining.",
      "author": "David Edelstein"
    },
    {
      "text": "A good young adult movie in the dystopian vein that dominates in this science-fiction sub-genre.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "The movie's awkward attempts at romance play more like parody.",
      "author": "Bryan Bishop"
    },
    {
      "text": "Like a Great Illustrated Classics adaptation of a lesser comic book, Divergent delivers a dystopian plot with mechanical precision but lacks the nuance and art that usually marks outstanding source material.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "It's like a super-violent version of 'The Breakfast Club' without that film's wit or charm.",
      "author": "John Hanlon"
    },
    {
      "text": "Based on the Hindu caste system. Is there anyone in this movie besides Theo James? He's so sexy he makes Vampires and Tributes look like sissy-girls.",
      "author": "Victoria Alexander"
    },
    {
      "text": "Woodley could be on the verge of a career breakthrough of Lawrencian dimensions.",
      "author": "Kurt Loder"
    },
    {
      "text": "The performances -- namely from stars Shailene Woodley and Theo James and Kate Winslet in a juicy supporting role -- always make the movie watchable and often quite engaging.",
      "author": "Christy Lemire"
    },
    {
      "text": "Woodley is an obviously talented actress, a standout in The Descendants and The Spectacular Now but she's let down by the story surrounding her.",
      "author": "Linda Barnard"
    },
    {
      "text": "Fans of the book will likely be pleased. More importantly, people who don't know a thing about the books may get swept up, as well.",
      "author": "Tom Long"
    },
    {
      "text": "With a couple of elaborate action set pieces and some trippy, dreamlike sequences when Tris' thoughts are on display, Divergent is sure-footed, suspenseful, and sequel-ready.",
      "author": "Steven Rea"
    },
    {
      "text": "The dark, oppressive movie around Woodley drags her down like an overcoat with stones in the pockets.",
      "author": "Liam Lacey"
    },
    {
      "text": "The movie, for all of it's post-apocalyptic themes, is at bottom a love story, and Woodley and James are good together.",
      "author": "Gary Thompson"
    },
    {
      "text": "If I was a 13-year old girl, Divergent would be my GoodFellas.",
      "author": "Willie Waffle"
    },
    {
      "text": "[T]he movie's blind acceptance of this world and its continuation means that the story itself is essentially a non-starter.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Though always an entertaining watch, Divergent is nevertheless a somewhat rickety start to a franchise.",
      "author": "Simon Reynolds"
    },
    {
      "text": "Attractively mounted and boasting some nice performances, but also peddling a thunderously stupid conceit whose dodgy details ask viewers to ignore all they know of basic human psychology.",
      "author": "Brent Simon"
    },
    {
      "text": "From the major Ferris Wheel scene to the zip line strung from high rise rooftops, Divergent the movie is a close match to the book.",
      "author": "Rebecca Murray"
    },
    {
      "text": "The film works because it engages in some creative world-building... That said, its roots in other YA successes are painfully obvious.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Comes off like yet another less than successful adaptation of a \"young adult\" piece of literary fiction. (Full Content Review for Parents Also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "It is fun to see Tris come into her own. She knows you do not have to be harsh to be strong, or weak to be kind.",
      "author": "Nell Minow"
    },
    {
      "text": "Disappointing young adult sci-fi, seeming a bit stale after other dystopian escapades.",
      "author": "Susan Granger"
    },
    {
      "text": "Directed by Neil Burger, Divergent is a solidly engaging outing. Only one wishes for more.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "There are more than a few predictable genre elements. Yet the acting is so engaging, they're easy to glide over.",
      "author": "Kelly Jane Torrance"
    },
    {
      "text": "Honestly, this is a film that will please fans of the book. It's not bad, but it feels too familiar and lacks the on-screen chemistry for it to win over those who haven't read the book.",
      "author": "Rick Bentley"
    },
    {
      "text": "Although not quite as well-focused as The Hunger Games, Divergent employs many of the same elements: a futuristic post-war setting, a strong heroine, a romance, and a struggle against the oppression inherent in the status quo.",
      "author": "James Berardinelli"
    },
    {
      "text": "Lots of stories are derivative yet still exciting to watch. Divergent, though, contains a middle stretch, during which Tris undergoes her training and falls for Four, that does not generate enough audience interest.",
      "author": "Carla Meyer"
    },
    {
      "text": "Though its main appeal will be to those who read the book and are young adults either in fact or in spirit, \"Divergent\" does have something for the rest of us and that's the chance to see the pair of performers who make that romantic music together.",
      "author": "Kenneth Turan"
    },
    {
      "text": "I just called Divergent boring. Does that make me Dauntless?",
      "author": "Fred Topel"
    },
    {
      "text": "\"Divergent's\" arriving just a bit too late.",
      "author": "Nina Garin"
    },
    {
      "text": "Ironically for a film about non-conformity, it adheres to the playbook rather slavishly.",
      "author": "Claudia Puig"
    },
    {
      "text": "Overall I was delighted with Divergent and am eager to see how the remaining two films continue to take us on Tris' adventure, as she and Four attempt to learn what's really going on in their very crazy world.",
      "author": "Bill Zwecker"
    },
    {
      "text": "Burger, whose last divergent character was the smart-drugged protagonist of Limitless, allocates more than enough of this overlong movie to details of life and society in future-Chicagoland. But he fails to make any aspect of the premise persuasive.",
      "author": "Mark Jenkins"
    },
    {
      "text": "Director Neil Burger proved a capacity for visualizing bizarre head trips in \"Limitless,\" but his production here seems half-realized.",
      "author": "Laura Clifford"
    },
    {
      "text": "\"Divergent\" is almost good enough to make you forget what a cynical exercise it is on every possible level.",
      "author": "Ty Burr"
    },
    {
      "text": "This movie could use some teeth, and it's surprising that they didn't use the ones that the book provided them.",
      "author": "David Medsker"
    },
    {
      "text": "The thriller moves as fast as one of the speeding trains that Tris must learn to jump out of.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Woodley does a perfectly solid job as Tris (though she certainly doesn't have Lawrence's steady charisma), while James is all eyebrows, jawline and piercing eyes.",
      "author": "Joe Gross"
    },
    {
      "text": "An oddly drab and unexciting portrait of a conspicuously nonsensical dystopian society... The combination of an inane premise and uninspired execution dooms the movie.",
      "author": "Frank Swietek"
    },
    {
      "text": "A fascinating dystopian tale about a multi-talented young woman who faces many challenges as she tries to remain true to her rebellious character.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Veronica Roth's Divergent is engrossing enough to devour overnight, and flimsy enough to forget by morning light. Neil Burger's film adaptation faithfully reproduces the same effect.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Hey, we gotta kill time between Hunger Games installments somehow. Why not Divergent?",
      "author": "Chris Vognar"
    },
    {
      "text": "It's rare that a movie is as good as the book on which it's based. It's even more unusual when it's better.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "While Burger, Daughtery and Taylor skimp on the characters' interior lives, they do make some surprising improvements on the book.",
      "author": "JoLene Krawczak"
    },
    {
      "text": "Is the premise of \"Divergent\" both overly familiar and borderline ridiculous? Sure, maybe. But channel the 13-year-old girl in you and enjoy.",
      "author": "Gail Pennington"
    },
    {
      "text": "I beg of you, teenage girls who may yet make Divergent a box office hit. We can't avoid the future - dystopian or not - but we can at least prevent regrettable fad tattoos.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Divergent is so busy setting the stage for what's to come, it forgets to show why what's happening now matters, too.",
      "author": "Ethan Alter"
    },
    {
      "text": "I would have liked a few more scenes with the underused Kate Winsleet than some of the unnecessarily long training sequences but \"Divergent\" was still a pleasant surprise; utilizing a likable female heroine.",
      "author": "Kristian Harloff"
    },
    {
      "text": "A worthy introduction to a familiar yet still extraordinary universe that hedges its risks to reach a teenage demographic but still teases more than enough potential.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Divergent sits squarely on the shoulders of Shailene Woodley as Tris and she carries the film well.",
      "author": "Scott Chitwood"
    },
    {
      "text": "Neil Burger, who gave us the strange, kinetic drug thriller Limitless, directs Divergent with near joyless disinterest, only occasionally lifting this promising material out of its blandly generic milieu.",
      "author": "Dann Gire"
    },
    {
      "text": "With Woodley as our outsider touchstone, this action movie from Neil Burger has all the palpable humanity it needed to be a futuristic Mean Girls because she is empathetic, but she's no milquetoast.",
      "author": "Katherine Monk"
    },
    {
      "text": "Unfortunately, [the story's] source material proves to be the film's undoing, as Divergent is built on a shaky premise that collapses when blown up to big-screen proportions.",
      "author": "Genevieve Koski"
    },
    {
      "text": "A satisfying dystopian adventure but not much else.",
      "author": "Loey Lockerby"
    },
    {
      "text": "In all candor, and with all the amity I can muster, \"Divergent\" is as dauntingly dumb as it is dauntingly long.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Unimaginative and bland.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "For a film about a defiant young heroine discovering she's a renegade nonconformist at heart, \"Divergent\" sure colors within the lines of the young-adult dystopian literature's playbook.",
      "author": "Randy Myers"
    },
    {
      "text": "It takes about 10 minutes to figure out that \"Divergent\" will not present a serious or intelligent vision of the future.",
      "author": "Mick LaSalle"
    },
    {
      "text": "For the first time since YA adaptations became the new blockbusters, we have a movie in which the most important stars do exactly what they're supposed to.",
      "author": "Matt Pais"
    },
    {
      "text": "If you're looking for a movie that faithfully reproduces the book, \"Divergent\" is the slightly unwieldy adaptation for you.",
      "author": "Chris Hewitt"
    },
    {
      "text": "It doesn't take long to get the sense that the filmmakers desperately want this to be the next 'Twilight,' 'Harry Potter' or 'Hunger Games' instead of aiming higher and simply trying to be the first 'Divergent.'",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "While the tween and teen target audience will probably love it and make it a hit, it fails to measure up to THE HUNGER GAMES. That said, it's far better than any of the TWILIGHT's.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Director Neil Burger cinematically steamrolls the potholed yet powerful source material, buffing his film adaptation to a gooey asphalt sheen.",
      "author": "Graham Killeen"
    },
    {
      "text": "...The faithful but dramatically flat film version of Divergent, from Veronica Roth's 2011 bestseller, couldn't stir palpitations in shut-ins. It's that bland and lifeless.",
      "author": "Peter Travers"
    },
    {
      "text": "...those same events that elicited thrills in the novel, and probably read like gold on the script's paper, fall terribly, even comically, flat onscreen.",
      "author": "Anna Storm"
    },
    {
      "text": "Somewhat silly and teen to the extreme, but Woodley and James are surprisingly strong. It's up to them to keep this hopeful franchise alive.",
      "author": "Rafer Guzman"
    },
    {
      "text": "\"The future belongs to those who know where they belong,\" declares the icy villain of Divergent, an action fantasy with fewer frills and thrills than Hunger Games but feeling good about that. The movie knows its runner-up place, and capably fills it.",
      "author": "Steve Persall"
    },
    {
      "text": "The bulk of this 160-minute film is taken up with an endless slog of evaluations and physical aptitude tests in smoky, diffusely lit interiors that resemble a Bill Fitzgibbons art installation.",
      "author": "Tom Shone"
    },
    {
      "text": "The world of Divergent is so bereft of stakes, momentum, and originality it becomes as taxing as the aptitude tests suffered by the lead character.",
      "author": "Travis Hopson"
    },
    {
      "text": "It's impossible to ignore the overwhelming sense that we've seen all this before, only with better execution ...",
      "author": "Mike Ryan"
    },
    {
      "text": "It's hard not to root for Ms. Woodley, who has been coming on strong in recent indie titles like \"The Descendants\" and \"The Spectacular Now,\" but she seems palpably uncomfortable here.",
      "author": "Manohla Dargis"
    },
    {
      "text": "A cogent testament to its overall success: when the movie ends, the urge lingers to find out what will happen next.",
      "author": "Dustin Putman"
    },
    {
      "text": "It will likely connect with fans of the book simply because it delivers on the cinematic promise of the story they loved but it's a pantomime, a film going through the motions without a hint of an actual pulse.",
      "author": "Brian Tallerico"
    },
    {
      "text": "With action scenes that can't raise a pulse, an expectedly chaste romance, and plodding, formulaic expansion of its mythology, Divergent has the drab sogginess of something reheated.",
      "author": "Richard Lawson"
    },
    {
      "text": "By the time it reached the 2-hour mark, I faced my own worst fear: the endless bad movie.",
      "author": "James Verniere"
    },
    {
      "text": "It's not bad ... but not great either..seems to be marking time until the story really kicks in, which doesn't happen until the final 20 minutes",
      "author": "Marshall Fine"
    },
    {
      "text": "The significance of certain deaths hangs entirely on Woodley's performance. She's mostly up to the task ...",
      "author": "Kevin McFarland"
    },
    {
      "text": "\"Divergent\" is a big, clunky slog of a movie, desperate to cash in as a successor to \"The Hunger Games\" as a franchise but never really proving up to the task.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Without [Woodley], \"Divergent\" would be a grim slog indeed.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Throws together a lot of familiar sci-fi and coming-of-age elements, but can't make any of them connect.",
      "author": "Josh Bell"
    },
    {
      "text": "The movie version of Divergent is no divergent. It goes along to get along. It's tame, formulaic and strictly by the book in every sense.",
      "author": "Michael Phillips"
    },
    {
      "text": "By the end, you may want to hop onto one of those trains yourself and hope it arrives somewhere a lot less grim. But two sequels await. So there's always hope.",
      "author": "Jocelyn Noveck"
    },
    {
      "text": "Divergent is not the movie for me. But if you find yourself still stuck in an adolescent world of cliques, and think you're the only one who uniquely feels as you do - well, this may be empowering.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Two sequels derived from Veronica Roth's novels have already been announced. Hopefully, they'll have more personality than this clunker.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Woodley, at every turn, lets us feel as if we're in her shoes, not so much Dauntless as thrillingly daunted.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Hopefully, Burger has the good sense to bail before he does any further damage.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Divergent is a solidly acted yet plodding and generic dystopian drama that could have benefitted from more dauntless filmmaking.",
      "author": "Jordan Adler"
    },
    {
      "text": "It's finally time for 'The Hunger Games' to make some room because the quality of 'Divergent' justifies all of the hype and gives the film a solid shot at becoming a successful franchise-starter, too.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "As an introduction to a series it's better than \"The Hunger Games\" ... \"Divergent\" is a nice little coming of age flick that feels bigger because it features some expansive nightmares and Kate Winslet as a baddie.",
      "author": "Brian Formo"
    },
    {
      "text": "Overall, Divergent is familiar fare, but served up by a cast that is fiercely dedicated to the material.",
      "author": "Drew McWeeny"
    },
    {
      "text": "The tentpole landscape is sorely in need of strong female leads - but not like this.",
      "author": "Matt Patches"
    },
    {
      "text": "The film transcends the déjà vu of its borrowed trappings but ironically sacrifices all momentum in favor of a long series of physical tests.",
      "author": "Eric Henderson"
    },
    {
      "text": "\"The results are decidedly mixed... [but] Burger's film is probably second-best among the YA adaptations that Hollywood has mounted since 'Twilight.'\"",
      "author": "Todd Gilchrist"
    },
    {
      "text": "Even though it stretches to nearly two-and-a-half hours and concludes with an extended gun battle, by the time \"Divergent\" ends, it still seems to be in the process of clearing its throat.",
      "author": "Andrew Barker"
    },
    {
      "text": "Even with star Shailene Woodley delivering the requisite toughness and magnetism, the clunky result is almost unrelentingly grim.",
      "author": "Sheri Linden"
    },
    {
      "text": "Burger has surrounded Woodley with a sharp cast, including her \"Spectacular Now\" co-star Miles Teller, but everyone appears hemmed in by the recycled, humorless material.",
      "author": "Tim Grierson"
    },
    {
      "text": "Jolts around in fits and starts, never sufficiently explains its premise and, yes, rips off far too many notions from better books and movies to stride successfully down its own path.",
      "author": "Alonso Duralde"
    }
  ],
  "release_year": 2014,
  "duration": 140,
  "genres": [
    "Sci-Fi",
    "Action",
    "Adventure"
  ],
  "age_rating": "PG-13",
  "synopsis": "Tris Prior (Shailene Woodley) lives in a futuristic world in which society is divided into five factions. As each person enters adulthood, he or she must choose a faction and commit to it for life. Tris chooses Dauntless -- those who pursue bravery above all else. However, her initiation leads to the discovery that she is a Divergent and will never be able to fit into just one faction. Warned that she must conceal her status, Tris uncovers a looming war which threatens everyone she loves.",
  "popularity": 6.9,
  "poster_url": "https://image.tmdb.org/t/p/original/aNh4Q3iuPKDMPi2SL7GgOpiLukX.jpg"
}