{
  "movie_name": "Don't Look Up",
  "movie_id": "dont_look_up_2021",
  "total_reviews": 304,
  "reviews": [
    {
      "text": "The film suffers in that the human moments aren’t nearly human enough.",
      "author": "Joshua Polanski"
    },
    {
      "text": "[\"Don't Look Up\"] accurately depicts how sensationalism today can stoke panic, fear, and mistrust among the public. Suddenly, science doesn’t matter as much anymore, when it contradicts one’s personal truths.",
      "author": "Paul Emmanuel Enicola"
    },
    {
      "text": "I laughed, I laughed some more, and I nearly died at certain points… but through all the satirical material there is true heart to the entire film… as well tense themes that make us look at ourselves. DiCaprio is incredible",
      "author": "Zach Pope"
    },
    {
      "text": "Disaster film is a fitting title because this film was a disaster.",
      "author": "Jillian Chilingerian"
    },
    {
      "text": "On par with a mediocre SNL sketch.",
      "author": "Paul Kanieski"
    },
    {
      "text": "Don't Look Up hilariously approaches almost every theme worthy of discussion through Adam McKay's satirical screenplay that will undoubtedly leave viewers either incredibly satisfied or extremely triggered.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Don’t Look Up doesn’t give any space for the viewer to breathe. The film is chaotic and cluttered as only some characters are used to serve a narrative purpose.",
      "author": "Nuha Hassan"
    },
    {
      "text": "Incredibly effective, and it was nice to see the craziness of the world we’re living in portrayed as how it actually feels to live in it; often frustrating but usually ridiculous at how oblivious and indifferent most people are...",
      "author": "Tyler Strandberg"
    },
    {
      "text": "Despite some clever gags... the film ultimately runs out of steam and fails to make a deep impact.",
      "author": "Dallas King"
    },
    {
      "text": "How I learned to stop worrying and love Don’t Look Up? Adam McKay’s film is a savage American political satire and the best since Wag the Dog. In his own words, he timed that shit perfectly.",
      "author": "M.N. Miller"
    },
    {
      "text": "Don’t Look Up calls out institutional indifference to impending disaster with relatable and riveting rage thanks to a scorching script and engaged ensemble.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "There’s so much crammed into this movie, and it’s a miracle that (for the most part) McKay manages to hold it all together.",
      "author": "Keith Garlington"
    },
    {
      "text": "It's merely stating what everyone has already observed for the past two years, and delivering it with a shit-eating grin.",
      "author": "Sarah Ward"
    },
    {
      "text": "A satire that at times reaches a revitalizing elegance and at others seems to emulate the level of discourse and debate in social media, television, and family tables: rough, raw, superficial, and even vulgar. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Initially, the satire has a few funny moments... But I can't remember anything else. For this reason, I can't judge it fairly. [Full review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "Although I tend to agree with McKay’s worldview and identify with his cynicism about politics, media culture, and humanity’s general short-sightedness, his methods as a filmmaker rarely convince me. Don’t Look Up might be the exception.",
      "author": "Brian Eggert"
    },
    {
      "text": "Like \"The Big Short\" and \"Vice,\" McKay's latest film pulls no punches in his political commentary, as he continues to make some excellent points but in a primarily condescending manner to his viewers who already received the message long ago.",
      "author": "Daniel Howat"
    },
    {
      "text": "The bulk of the movie is played for gags before the serious stuff kicks in at the end. Its never easy for a director to reconcile such contrasting tones, and McKay is no exception.",
      "author": "John McDonald"
    },
    {
      "text": "Its still sadly rare to see female characters working in STEM given the grace to be imperfect on screen.",
      "author": "Li Lai"
    },
    {
      "text": "Don’t Look Up ultimately feels like just one more disaster movie: it is far easier—and maybe even more fun—to imagine the apocalyptic end of the world than to imagine how we could live in a radically different way now to prevent it.",
      "author": "Kathryn Reklis"
    },
    {
      "text": "I thought this was a brilliant film, the satire was on message. It's this kind of court jester-like satire that I really resonate with, and the cast was spectacular. (Steve)",
      "author": "James Marsh"
    },
    {
      "text": "Unfortunately, McKay and Sirota remain shy and hide behind shallow and often silly humor. Despite this, many will very much come to enjoy and perhaps even love this film.",
      "author": "Josie Meléndez"
    },
    {
      "text": "The blitheness with which McKay approaches his noble pet subjects is not unlike Kendall Roys dedication to performing rap songs in Succession, which McKay also produces.",
      "author": "Elissa Suh"
    },
    {
      "text": "You dont believe anything that happens in this film. The moments are rendered in rather cartoonish fashion; for a film invested in tackling the zeitgeist, I dont think it quite gets how people act in times of crisis.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Overall, its intentions are too noble to call it a flop, but I still cant understand how so many awards bodies are slobbering all over it with accolades. Not everything with Leonardo DiCaprio and Meryl Streep in it is immediately Oscar-calibre, folks.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Dont Look Up is as entertaining as watching your most obnoxious relative rant at the family during a holiday dinner.",
      "author": "Sarah Marrs"
    },
    {
      "text": "But despite all the glitter, this satirical disaster movie about a comet hurtling toward Earth doesnt shine.",
      "author": "Collin Garbarino"
    },
    {
      "text": "DiCaprio and Lawrence are phenomenal and lead an all-star cast in this showy satire where science, politics and human nature clash in response to an imminent disaster. Full Review in Spanish",
      "author": "Rene Sanchez"
    },
    {
      "text": "Don't Look Up bites off a bit more than it can chew, but there's a certain thrill to its massive scope and all-over-the-place narrative.",
      "author": "Jeff Nelson"
    },
    {
      "text": "In making Dr. Strangelove... Stanley Kubrick largely ignored what “the media” would say; he focused on the donut, the government, not the hole. McKay focuses on the hole, the media, and then decries the void.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The films underlying message that humanity is carelessly barreling toward its own extinction and that we should be paying more attention reeks not only of self-importanceyeah, uh, we know?but also of a lack of self-awareness.",
      "author": "Miles Surrey"
    },
    {
      "text": "McKay has made a satire thats simultaneously funny and depressing. I started off my viewing chortling over a running gag regarding snacks and ended with a feeling of hopelessness.",
      "author": "Tim Brennan"
    },
    {
      "text": "\"Don't Look Up\" is no \"Dr. Strangelove\" in achieving lasting political satire brilliance, but it does mirror the times in which it was produced.",
      "author": "Steve Crum"
    },
    {
      "text": "Theres a leanness to the best movie comedy that McKays filmmaking has lost...",
      "author": "Josh Larsen"
    },
    {
      "text": "As the most risible responses to the virus outbreak become commonplace and normalized, sometimes it takes sardonic, albeit unnuanced allegory to snap us back to reality.",
      "author": "Neil Morris"
    },
    {
      "text": "Don't Look Up shows us what happens if we wait too long to interrogate our culture and ourselves, lose sight of truth, and fail to take action.",
      "author": "Amari Gaiter"
    },
    {
      "text": "McKay is doing more than preaching to the converted. He's reminding us of just what an enormous ask it is, especially in the digital era, to get anyone to heed an inconvenient truth.",
      "author": "Margot Harrison"
    },
    {
      "text": "[T]hought-provoking and engaging ... revels in the bleakness of its premise even as it mines said premise for humor.",
      "author": "Allen Adams"
    },
    {
      "text": "There is actually much to unpack in this film. A social media friend called it \"ridiculous.\" But that is the whole point, you see. We have the data.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "Funny, timely, and a reminder that humans are responsible for our own demise. Solid acting all around.",
      "author": "Rosa Parra"
    },
    {
      "text": "...perhaps the aggravation of a movie like Don't Look Up is a good thing.",
      "author": "Michael Ward"
    },
    {
      "text": "In the end, whichever way you feel about the movie's manipulations, it's difficult to watch without being strongly affected.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Here's a quick-and-easy lesson for the next time: if the end credits sequence is sixteen minutes long, the movie is part of the problem, not the solution.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "In Don't Look Up, Adam McKay's attempts at satire are smothered by the smugness of his screenplay.",
      "author": "Sameen Amer"
    },
    {
      "text": "Don't Look Up takes a big dare and earns attention that seems fair. Fine actors get into their parts while slinging extra-sharpened darts.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "McKay has little trust in his audience or his characters. The film bellows its argument at us: the world is terrible, and we are doomed if we do not change. Few would dispute this. But a good argument isn't enough to make a good movie.",
      "author": "Andrew Kendall"
    },
    {
      "text": "an entertainingly broad-side-of-the-barn satire that may be exactly the film we deserve in the post-Trump Presidency wasteland of COVID infections, science denialism, QAnon conspiracies, and locked-horns political turmoil",
      "author": "James Kendrick"
    },
    {
      "text": "This amusing black comedy is about a serious problem (global warming), but the astronomical aspects seem suspect, even on my first viewing.",
      "author": "Jana Monji"
    },
    {
      "text": "Expensive and way overlong, the film hits the same joke again and again, well past the point has been made. The",
      "author": "Steve Murray"
    },
    {
      "text": "I laughed a lot while also feeling sick to my stomach. As subtle as a sledgehammer, almost obnoxious... and yet it might as well be a documentary. Is it elegant? Is it art? Who the f*** cares?",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Meryl Streep is wonderful, and she's joined in her wonderfulness by Cate Blanchett and Tyler Perry, both hilarious, as program hosts on a spiky news channel. The world is going to end, but how do I look on camera three?",
      "author": "Michael Calleri"
    },
    {
      "text": "What's interesting about Don't Look Up is that it has tapped like a tree root into the great subterranean sea of sadness around the changing world.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "The people who need to see this movie won't see it, but those of us who don't need to see it will get a kick out of it. I did. It's sad, but I laughed a lot at the satire.",
      "author": "Robert Roten"
    },
    {
      "text": "Clever, often brilliant, luxuriously but pointedly cast, sprawling - I was never bored but I understand the plea for the shedding of 20 or so minutes - and stylishly filmed.",
      "author": "David Nice"
    },
    {
      "text": "Don't Look Up is a fun movie when you watch it as a casual comedy with a powerful cast telling a ridiculous story. However, things start falling apart when you see the movie as a commentary or satire to real-world events.",
      "author": "Shah Shahid"
    },
    {
      "text": "The film's negativity indicts McKay and insults his audience.",
      "author": "Armond White"
    },
    {
      "text": "Don't Look Up spends an inordinate amount of its time mocking a web phenomenon that's ubiquitous and requires very little effort to explain, virality.",
      "author": "Charles Mudede"
    },
    {
      "text": "The result is demonstrative and with little appeal. [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "A comedic satire about the end of the world has to be brilliant to work. This movie isn't brilliant.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "\"Don't Look Up\" is the best American film of 2021.",
      "author": "Cole Smithey"
    },
    {
      "text": "You can't completely ruin a great concept, and McKay has hit on one...This is the way the world ends; not with a bang, but a bluster.",
      "author": "Bill Newcott"
    },
    {
      "text": "To some extent the satirical discourse on the environmental crisis and the ignorant side of capitalism works well, but at times I have the feeling that everything becomes uselessly redundant. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Don't Look Up is a sizzling, coruscating, and biting satire on the modern world and our collective priorities.",
      "author": "Paul Mount"
    },
    {
      "text": "Ultimately, Don't Look Up is more than just mean-spirited and smug. It's aggressively those things -- that is, until that sentimental coda.",
      "author": "Max Weiss"
    },
    {
      "text": "The humour of the movie is often broad and preposterous, but sharp enough to keep its dark edge.",
      "author": "Monica Reid"
    },
    {
      "text": "A brilliantly scripted, wonderfully acted, and depressingly realistic satire of the environment America currently finds itself in, and the threat it poses not just to the country, but to the future of humanity.",
      "author": "Rick Marshall"
    },
    {
      "text": "A star-studded misfire that is smug, irritating, and borderline intolerable.",
      "author": "Louisa Moore"
    },
    {
      "text": "Although the film is undoubtedly sharper than [McKay's] previous political feature, VICE, the same smugness and cocksure piety blunt the more incisive moments, just as many performances are pitched more for caricature than satire.",
      "author": "Jim Ross"
    },
    {
      "text": "Melodramatic subplots emerge that contribute nothing. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "That film tried so tirelessly and relentlessly to scold us for not listening to it that it forgot to forge a powerful work of art for those who were attending.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "The agitation and quick cuts allow for the film - at 2 hours 25 minutes - to not feel longer and more laboured than the runtime suggests.",
      "author": "Prathyush Parasuraman"
    },
    {
      "text": "Ideally, Don't Look Up would make you laugh AND inspired to learn more about climate change. As it is, it mostly makes you tired.",
      "author": "Mark Meszoros"
    },
    {
      "text": "\"Don't Look Up\" is 2021's \"Mars Attacks!\"",
      "author": "Kent Garrison"
    },
    {
      "text": "Dear Adam McKay, If someone doesn't like your movie, it doesn't necessarily mean they didn't get it.",
      "author": "Matt Neal"
    },
    {
      "text": "It's not subtle, but like the killer in Se7en said, you can't just tap people on the shoulder anymore, you have to hit them with a sledgehammer. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "There's a shorthand that makes each character's real world avatar easy to get and laugh at but that also undermines the film's intelligence. This is not smart satire.",
      "author": "Murtada Elfadl"
    },
    {
      "text": "Though it is not always smooth sailing, there is more here to like than not.",
      "author": "Bobby LePire"
    },
    {
      "text": "It's as dark and nasty as it needs to be, and it's a glorious thing.",
      "author": "Bob Grimm"
    },
    {
      "text": "Although the satire shoots fish in a barrel, it's still an incisive piece of symbolism for all of our ongoing powder kegs, with society lighting up near the fuses. Adam McKay!",
      "author": "Patrick McDonald"
    },
    {
      "text": "As a satire on corporate greed, media ethics and celebrity culture it's pretty limp. All bite but no teeth, you could say. Still, as an intermittently amusing lark to stream on your 60-inch Don't Look Up passes muster as OK time-killing fodder.",
      "author": "Jim Schembri"
    },
    {
      "text": "I see and applaud [the film's] intention, but the execution isn't exactly the best. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Sometimes the sharp jabs from its script hit the target, [but] the all-star cast can only carry the silliness so far.",
      "author": "Kiko Martinez"
    },
    {
      "text": "McKay's movies are not particularly pointed in their satire and, as time has gone on, have increasingly settled into their preferred form of a harangue.",
      "author": "Alison Willmore"
    },
    {
      "text": "Despite a to-die-for cast and a seemingly can't-miss premise, Don't Look Up is a failure on too many levels and, although the viewing numbers may satisfy Netflix, it's a shock to see such a high-profile film self-destruct.",
      "author": "James Berardinelli"
    },
    {
      "text": "If I wanted to get preached at, I'll just go to church.",
      "author": "Shawn Edwards"
    },
    {
      "text": "DiCaprio and Lawrence are a delight to watch as they lead the charge with Blanchett and Streep providing the icing on the cake.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "American humour, into well-intentioned but poorly made Hollywood quasi-activism. I'm on your side, McKay, mate. Just try to do better please!.",
      "author": "Petr Navovy"
    },
    {
      "text": "Very silly, yet undeniably urgent. I loved every second.",
      "author": "Linda Marric"
    },
    {
      "text": "The new Idiocracy we deserve.",
      "author": "Matt Pais"
    },
    {
      "text": "...the big, bloated, 'n' starry Netflix satire...",
      "author": "Dennis Harvey"
    },
    {
      "text": "This satirical film spreads itself far too thin in an attempt to cover numerous issues.",
      "author": "Lindsay Press"
    },
    {
      "text": "McKay's vision leaves no room for metaphors when tackling the ill prepared politics and technological messiahs that are always willing to benefit from whatever crisis the world might be dealing with. Whether it is an asteroid, a pandemic or whatever.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "Remember when McKay was making movies like Step Brothers? Now he's making movies like Vice and Don't Look Up, glib, unfunny infomercials that are closer to Ted Talks than Talladega Nights.",
      "author": "Asher Luberto"
    },
    {
      "text": "Please ignore that instruction - or else you'll miss out on a so-sharp-it-hurts satire that skewers our current state of politics, technology and celebrity culture within the context of an asteroid headed to Earth",
      "author": "Mara Reinstein"
    },
    {
      "text": "...an uneven endeavor that nevertheless remains quite watchable from start to finish.",
      "author": "David Nusair"
    },
    {
      "text": "Nobody likes to be hit over the head with anything. The first hour was promising, but it quickly became repetitive & verbose. Don't Look Up is not nearly as shrewd nor smart as it obviously think it is.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Adam McKay offers a riff on the sad state of contemporary American politics and media via a spoof on disaster movies...and though his approach...is heavy-handed rather than sharp, enough zingers land for it to squeeze by.",
      "author": "Frank Swietek"
    },
    {
      "text": "Don't Look Up is a blunt instrument in lieu of a sharp razor, and while McKay may believe that we're long past subtlety, it doesn't mean that one man's wake-up-sheeple howl into the abyss is funny, or insightful, or even watchable.",
      "author": "David Fear"
    },
    {
      "text": "This isn't just a noble failure, it's a flat out bad film, an attempt to address a very real planetary crisis in the simplest and most misguided terms.",
      "author": "Mattie Lucas"
    },
    {
      "text": "McKay has made it inescapably clear that, no matter who you are... he is serenely confident that he is much smarter than you are.",
      "author": "Tim Brayton"
    },
    {
      "text": "The film raises a fundamental question if we truly intend to analyze its effectiveness: how to satirize something that has already become absurd to the point of defying any common sense? [Full review in Portuguese]",
      "author": "Pablo Villaça"
    },
    {
      "text": "Distracted society? Distracted movie. Don't Look Up can feel like the most expensively produced sketch-comedy show in history, but most of the bits hold both guffaws as well as gnawing elements: McKay seeks inconvenient sooth.",
      "author": "Ray Pride"
    },
    {
      "text": "Yelling \"Look at all the dumb-dumbs\" cannot be the basis for successful satire.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Big, long, fun--and disturbing. It ain't Paddy Chayefsky or Armando Iannucci but it hits the nail on the head, is very satisfying--and will age well.",
      "author": "Peter Canavese"
    },
    {
      "text": "The result, while amusing and entertaining at times, feels more like shooting fish in a barrel rather than luring them in from deep in the sea.",
      "author": "Jim Judy"
    },
    {
      "text": "\"Don't Look Up\" wants to be \"Doctor Strangelove\" for a new generation but may be too ostentatious for its own good.",
      "author": "Russ Simmons"
    },
    {
      "text": "Dark comedy has so much potential when it's handled right, but it's hard to fully defend an often downright unpleasant, shrill viewing experience in this genre.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "McKay's contempt for pop culture is frequently tiresome; he just doesn't know how to let people enjoy things - even if it is their own destruction.",
      "author": "Luke Goodsell"
    },
    {
      "text": "A thought-provoking parable, both funny and sad, about the reactions to the consequences of climate change.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "\"Don't Look Up\" makes a few decent points and gets a chuckle or two, but mostly, it is leaden when it could be farcical, sluggish when it could be screwball. This end of the world comedy should have just been more fun.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "The frustrating thing is not only how important the message is, but how much it shows that the cast wanted to do things right. [Review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "Don't Look Up gives what is probably one of the most on-the-nose assessments if the world today got the news that a comet was on a collision course with earth. While it's satire, it's a dark one, and the longer it plays the more it feels spot on.",
      "author": "Bill Watters"
    },
    {
      "text": "Director Adam McKay's star-studded Netflix film--led by Leonardo DiCaprio and Jennifer Lawrence--is on the right side of the truth, but are the liars listening?",
      "author": "Rohan Naahar"
    },
    {
      "text": "Think of it like a massive Hollywood Christmas special where the top talent comes together to scream, \"We're all going to f***ing die\" at the top of their lungs. Amen to that.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "[The premise is] squandered in a slapdash, scattershot sendup that turns almost everyone into nincompoops, trivializes everything it touches, oozes with self-delight, and becomes part of the babble and yammer it portrays.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The black comic aspects of this gloomy paradox are never fully realised. I kept wishing that it had fallen into the hands of Armando Iannucci (The Death of Stalin, Veep), a social satirist with all the gifts to make it work.",
      "author": "Sandra Hall"
    },
    {
      "text": "'Don't Look Up' very clearly has a lot on its mind. Ideas shoot out of it like a firehose, but there's a poetic, melancholic nature to all its insanity. One of the year's very best works!",
      "author": "Preston Barta"
    },
    {
      "text": "In the end, McKay isn't doing much more in this movie than yelling at us, but then, we do deserve it.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Don't Look Up doesn't have as clear of a target, so instead it swings at everyone. Its worst parts are when it stops to show people on their phones.",
      "author": "Joshua Rivera"
    },
    {
      "text": "There's nothing more excruciating than watching very famous people work entirely too hard to be funny.",
      "author": "Robert Levin"
    },
    {
      "text": "Don't Look Up is at its best when it throws the satire to the side and becomes Adam McKay's take on Melancholia.",
      "author": "Steve Katz"
    },
    {
      "text": "The Adam McKay film stays true to the writer-director's signature style. It's star-studded, and the edits often wink at the audience, but it's not so fun being in on the joke this time around.",
      "author": "Becca James"
    },
    {
      "text": "This is more nervy titters than knee slaps. This is comedy with an asterisk, where the discomfort it causes is central to its clout.",
      "author": "Hilary A White"
    },
    {
      "text": "\"Don't Look Up\" is good, but it could have been so much better.",
      "author": "Randy Myers"
    },
    {
      "text": "Travels a predictable and extensively long road (more than two hours long) for a comedy. [Full review in Spanish]",
      "author": "Emiliano Basile"
    },
    {
      "text": "\"Don't Look Up\" suffers from not being absurd enough, because the surreal truth of American politics outpaced the incredulity of fiction sometime around the 2016 election.",
      "author": "Sean P. Means"
    },
    {
      "text": "As much as I have the same political inclinations as Adam McKay and these liberal movie stars, I don't think I want to watch a movie that is presenting me with all of my personal points of views... [And] poking at everybody else.",
      "author": "Tim Cogshell"
    },
    {
      "text": "This is a broad, crass, scattergun comedy, but one that fairly reflects the age of distraction being so grimly targeted.",
      "author": "Anton Bitel"
    },
    {
      "text": "Overlong and impetuous, this is Adam McKay saying you're stupid for 2.5 hours. There's a point when going over-the-top is hazardous to the enjoyment of a movie.",
      "author": "Dan Buffa"
    },
    {
      "text": "...it's a Swiftian film about the ongoing age of stupid, one that never lectures, but entertains...",
      "author": "Eddie Harrison"
    },
    {
      "text": "Don't Look Up finds deeper meaning and a grander aesthetic that not only challenges the conversation but demands action - before it's too late. There is no mistaking that this is one of the best films of the year.",
      "author": "Stephanie Archer"
    },
    {
      "text": "A satire that laughs at our current predicament, but also hurts because of the authentic way in which it depicts the very real human idiocy and greed. [Full Review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "With a stellar cast and a razor-sharp premise, Don't Look Up is a timely offering that cuts considerably close to the bone.",
      "author": "Gemma Creagh"
    },
    {
      "text": "I don't know if Adam McKay will reach across party lines or find a new audience to hear his message, but there's enough of Don't Look Up that's worth recommending.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "I'd argue the simple road [Michael Bay's] Armageddon chose was more successfully traversed.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Armageddon meets Veep is a great idea, I just wish Adam McKay was good enough at memes to justify this many meme montages.",
      "author": "Vincent Mancini"
    },
    {
      "text": "What Carl Sagan would say? Don't waste your time seeing this mess.",
      "author": "Filipe Freitas"
    },
    {
      "text": "McKay is right: this is probably how the info-tainment industry will treat ecological disaster -- with a mixture of sneers and denial -- but Don't Look Up is clumsy satire, too earnest in its aims to be incisive.",
      "author": "Paul Whitington"
    },
    {
      "text": "In its best passages, always carried by Lawrence and DiCaprio, Don't Look Up manages to clear the excesses so that its message lands. [Full review in Spanish]",
      "author": "Natalia Trzenko"
    },
    {
      "text": "Look Up is all over the place, but it has an amazing cast centered around doomsayer astronomers played by Leonardo DiCaprio and an angry Chicken Little Jennifer Lawrence.",
      "author": "Tom Meek"
    },
    {
      "text": "[McKay has] now struck a good balance between his desire to educate and make people laugh.",
      "author": "Kip Mooney"
    },
    {
      "text": "The result, without being particularly brilliant... [is] appealing and entertaining. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Snappy and sharply well-made.",
      "author": "Rich Cline"
    },
    {
      "text": "It's all very smug and obvious, with none of the bite of McKay's financial crisis opus The Big Short.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Politics is broken, the media's broken, science is ignored and humans are fallible. So what the fuck do we do about it? McKay doesn't seem to offer any answers.",
      "author": "Steve Newall"
    },
    {
      "text": "Razor sharp satire, wielded by a cast of home run hitters. Infuriating in a darkly comic way.",
      "author": "Dan Murrell"
    },
    {
      "text": "Don't Look Up is an aggressive, unfunny misfire from a filmmaker who used to have the patent on feature-length humor.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Don't Look Up may not be a full success, but it stands out by commenting on our times with such a rough bite.",
      "author": "Alci Rengifo"
    },
    {
      "text": "The invitation to contemplate the disaster genre from the other side of a catastrophic reality is surprising and even enthusiastic. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A film that's shudderingly obvious, and not particularly likely to convince anyone not already convinced.",
      "author": "Stephen Silver"
    },
    {
      "text": "A movie about an apocalyptic event that spurs a culture war might sound exasperating right now, and that's completely understandable. We live in maddening times.",
      "author": "Matthew Passantino"
    },
    {
      "text": "Satire is a precise tool, not a blunt object.",
      "author": "Christopher James"
    },
    {
      "text": "The sign of the times' best possible depiction. [Full review in Spanish]",
      "author": "Andrea G. Bermejo"
    },
    {
      "text": "'Don't Look Up' takes aim at plenty of ills, but a smug, self-satisfied approach proves insufficient at addressing the legitimate woes at the core of this picture.",
      "author": "Tim Grierson"
    },
    {
      "text": "Don't Look Up approaches the idea of denial and fake news with all of the subtly of a 24 to the face, and that combined with some genuinely funny moments and some real heart, artfully gets the point across while not getting overly preachy.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Don't Look Up is scathing, but by the end, we get the feeling that this is mainly because, for all their on-point bite, McKay and his colleagues care so much about what they're discussing here.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "A weird middle ground where the old and new McKay clash... for better or worse.",
      "author": "Rendy Jones"
    },
    {
      "text": "Despite the star-studded cast this frantic satire is fragmented and ham-fisted. Perhaps they were hoping for another 'Dr. Strangelove' or 'Wag the Dog.' No such luck!",
      "author": "Susan Granger"
    },
    {
      "text": "An ensemble cast stacked with A-listers is no guarantee of a good time. Neither is McKay's bombastic, shake-you-by-the-shoulders direction.",
      "author": "Simran Hans"
    },
    {
      "text": "The film's multiple messages, first and foremost being LISTEN TO SCIENCE, can't help but hit home. If only, like a good mini skirt, it were a bit tighter, a bit shorter.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "McKay and his team undoubtedly want to leave you with something of substance. Unfortunately, the departures from biting satire and indulgences into base, pratfall comedy derail the film.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Of course, any similarities between such silly personalities and real people are purely coincidental. You'll laugh out loud at them a few times, maybe more, then forget most of it immediately.",
      "author": "John Urbancich"
    },
    {
      "text": "Don't Look Up is insanely hilarious and contains yet another brilliant performance by DiCaprio, proving he's the Nicholson of our time.",
      "author": "Frank J. Avella"
    },
    {
      "text": "A searing comedy that's not for everyone, but fans of McKay's clever commentary will love it. DiCaprio is miscast but still game, while Lawrence & Rylance shine brightest.",
      "author": "Grace Randolph"
    },
    {
      "text": "Who wants to see a movie about denial idiocy when we're still right in the middle of it?",
      "author": "Mike McGranaghan"
    },
    {
      "text": "I like the idea of tackling something serious and interweaving comedic beats, but it never feels seamless. The cast is still rock solid, and certain moments hit hard.",
      "author": "Austin Burke"
    },
    {
      "text": "The comedy is lazy, sanctimonious and too obvious to look up to.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Delivering satirical jabs with sledgehammer subtlety, this ambitious ensemble piece benefits from a first-rate cast to compensate for its uneven narrative missteps.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "McKay is spot on with his depiction of the current status of this country -- amazing, and yet truly terrifying.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Diabolically funny, but we don't have to look long or hard to see the satirical intent. It's a gem.",
      "author": "David Kaplan"
    },
    {
      "text": "The fruit here isn't low-hanging; it's on the ground rotting, impossible to make a meal of.",
      "author": "Kyle Smith"
    },
    {
      "text": "The cast is appreciably enhanced by the work of award-winning actor Mark Rylance.",
      "author": "Martha K. Baker"
    },
    {
      "text": "There's something oddly satisfying about the way McKay's film lets us laugh at our own doom.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "A bleak commentary on humanity's failure to address climate change, Don't Look Up eviscerates disaster movie tropes and the institutions that fail to stand up for the greater good of humanity.",
      "author": "Samantha Nelson"
    },
    {
      "text": "The film may not be as fabulous as its star-studded cast suggests, but it's still exactly what you expect it to be, and I quite like that, a slightly sly but broad satire.",
      "author": "Mark Kermode"
    },
    {
      "text": "This 145-minute political-corporate-media parody shows that in the right hands satire still lives, at least until the comet hits.",
      "author": "Stephen Romei"
    },
    {
      "text": "Where Don't Look Up finds its strength is in its lead performances, which can't be undone even by the film's exhausting, rapid-fire editing and McKay's aggressive indicating toward his own punchlines.",
      "author": "Richard Lawson"
    },
    {
      "text": "McKay and journalist David Sirota use their poisoned pens to spear fish jammed into a tiny barrel.",
      "author": "Al Alexander"
    },
    {
      "text": "Don't Look Up could be a case of misguided effort: It's possible that reality already is so ripe with extremes that it no longer can be satirized - or perhaps satirical efforts must be so keenly focused that absurdity is handled piece-by-piece.",
      "author": "Robert Denerstein"
    },
    {
      "text": "It's both hilarious and depressing at the same time.",
      "author": "Kevin Carr"
    },
    {
      "text": "It's message-y... [and] we have genre imbalance.",
      "author": "Lonita Cook"
    },
    {
      "text": "hile I enjoyed the mix of humor and emotion (and out terror), some might find the tonal shifts a bit jarring. Perhaps a more valid nit to pick is that the the jampacked script doesn't quite do all these movie stars justice.",
      "author": "Jocelyn Noveck"
    },
    {
      "text": "The content is often too depressing to find funny or too outrageous to seem real, both of which are obvious objectives. Because what we have with Don't Look Up borders on the absurd ... making it hard to read and even harder to really enjoy.",
      "author": "Candice McMillan"
    },
    {
      "text": "It won't make you laugh much, but it's good for a smile.",
      "author": "Tim Appelo"
    },
    {
      "text": "It's either too serious or too much of caricature to ever come together and have any poignancy, which really is required.",
      "author": "Nicholas Bell"
    },
    {
      "text": "If the world really is going to end in my lifetime, these were 145 minutes that I'm never getting back.",
      "author": "Brianna Zigler"
    },
    {
      "text": "It's an Iannucci film in need of dentures, Don Quixote from the point of view of the windmill. The cleverness isn't slight of hands but a middle finger.",
      "author": "Ryan Syrek"
    },
    {
      "text": "As revelations unfold and contingency plans fail, McKay horrifically incorporates a situation comedy into a nihilistic drama in the best possible way... the devil (and ensuing hilarity) is in the details.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Don't Look Up is, paradoxically, a bitter pill to swallow and a sweet comedy. Neither part of that benefits from overstaying its welcome.",
      "author": "Chris Knight"
    },
    {
      "text": "I tend to believe that a movie can only be \"bad\" inversely relative to its potential to be \"good.\"... Yet, by my above metrics, it is the worst movie I've seen this year, and it isn't even close.",
      "author": "Brad Keefe"
    },
    {
      "text": "\"Don't Look Up\" is frantic, fitfully funny, and a not a little exhausting, and behind all the japery is a righteous anger that could be put to better use elsewhere.",
      "author": "Ty Burr"
    },
    {
      "text": "Not nearly the craptastic misfire it's been labeled, but Adam McKay's latest big-bore satire combines some juicy political barbs with long, dull stretches of stars mugging for the camera.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "At the end of two remarkably bad years, Adam McKay's latest movie feels about as welcome as a kick in the teeth.",
      "author": "Alison Foreman"
    },
    {
      "text": "Don't Look Up may not be the worst film of 2021, but in terms of the sheer waste of time, talent and other resources that have been assembled, I cannot readily think of anything else that comes close to this one.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Adam McKay's clever doomsday satire is hilariously terrifying, a serio-comedy that's intended to shake viewers out of their seats.",
      "author": "Tara McNamara"
    },
    {
      "text": "Adam McKay has carved out a special role in Hollywood, one where he seems to know how to tackle weighty topics without making his films feel heavy. Don't Look Up may just be the best movie about the COVID era without ever mentioning the disease.",
      "author": "Alex Bentley"
    },
    {
      "text": "It's a full and roiling experience, enjoyable even next to the sadness, the inevitability of ruin.",
      "author": "Anne Brodie"
    },
    {
      "text": "McKay seems to swing a mighty sword... but the blade turns out to be little more than a dull rubber prop, alas.",
      "author": "Piers Marchant"
    },
    {
      "text": "It's easily the funniest movie in McKay's new mode. I left the theater thoroughly depressed, though.",
      "author": "Sean Collier"
    },
    {
      "text": "McKay needed to trim about two hours and ten minutes from this SNL skit that's rarely funny and overly pretentious.",
      "author": "Dustin Chase"
    },
    {
      "text": "A disastrous movie, Don't Look Up shows McKay as the most out of touch he's ever been with what is clever, or how to get his audience to care.",
      "author": "Nick Allen"
    },
    {
      "text": "At its best, it feels like a horrible SNL opening sketch. At its worst, it's a reminder that Trump-era satire has run its course.",
      "author": "EJ Moreno"
    },
    {
      "text": "It is, always, tempting to sneer. ... But the temptation to sneer rather than dissect can lead to a lack of focus.",
      "author": "Sonny Bunch"
    },
    {
      "text": "For a film to find glimmers of beauty amidst such bleakness is nothing if not commendable, but Don't Look Up also doesn't achieve this until well into its 145 minute runtime. Ironically, it may be too little, too late.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "The old movie cliché of you'll laugh, you'll cry has never applied more literally to a film than Don't Look Up.",
      "author": "Tom Santilli"
    },
    {
      "text": "If you cherrypick the good stuff from the unfocused choices, McKay's all-star comedy about impending doom has its provocative pleasures. But the laughs don't stick in the throat the way they must in a screwball farce that ends in utter hopelessness.",
      "author": "Peter Travers"
    },
    {
      "text": "The all-star cast, including Mark Rylance, Ariana Grande and Timothee Chalamet, makes this satire entertaining enough so that you won't look down on it.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "The most cherishable treat in this film is Rylance.",
      "author": "Brian Viner"
    },
    {
      "text": "Instead of using the movie's laborious more-than-two-hour runtime to allow his ideas to unfold, MacKay hits you with most of them in the first half hour. Being clonked with a meteor would be more subtle.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "With a cast this charismatic it's easy to forgive the movie's ramshackle nature, and the sense that much of the satire is either slightly dated or too easy.",
      "author": "Kevin Maher"
    },
    {
      "text": "McKay has a point, though his frame of reference hardly stretches beyond the United States, and the stink of localized political contempt all but overpowers the plot.",
      "author": "Anthony Lane"
    },
    {
      "text": "It's loud, it's aggressive, and its approach is drastic. But, so are the times we're living in. A perfectly violent escalation of our entire species as it stands, done up satirically and painfully.",
      "author": "Bill Arceneaux"
    },
    {
      "text": "Even at a groaning 145 minutes, the film feels overstuffed.",
      "author": "Donald Clarke"
    },
    {
      "text": "Don't Look Up is one of McKay's best. It is fun, informative, and with some brilliant performances. If you want to scream into the void along with your favourite actors, definitely do look this one up.",
      "author": "Sarah Cook"
    },
    {
      "text": "No matter how you slice it, Don't Look Up is a colossal misfire, soaring past us and floating into space.",
      "author": "Leo Brady"
    },
    {
      "text": "Like the government's misguided efforts to stop the comet, it's an expensive, unwieldy distraction that accomplishes nothing.",
      "author": "Josh Bell"
    },
    {
      "text": "A sharp, clever satire on today's media and leaders, their decisions and actions. Funny and scary, reminded me of Kubrick's Dr. Strangelove. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "An apocalyptic burlesque that's more sanctimonious than savage, Don't Look Up might make you understand why Will Ferrell recently parted ways with his longtime collaborator McKay.",
      "author": "Craig D. Lindsey"
    },
    {
      "text": "One of the best originals that the platform has produced. [Full review in Spanish]",
      "author": "Jorge Loser"
    },
    {
      "text": "Insert your own \"rooting for the asteroid\" joke here.",
      "author": "Nick Johnston"
    },
    {
      "text": "Funny from start to finish. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "If you are going to use satire to make a global, apocalyptic statement, then you need to be focused like a laser. \"Don't Look Up\" is more like a bull in a china shop.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "McKay takes aim at a million targets, most of them glaringly obvious, and the points raised by the increased stream of incompetence aren't fresh and surprising...",
      "author": "Sean O'Connell"
    },
    {
      "text": "Meryl Streep is the Commander in Chief of the year's best ensemble cast in Don't Look Up.",
      "author": "Pat Mullen"
    },
    {
      "text": "Don't Look Up takes several unexpected and clever twists and turns, ranging from laugh out loud hilarious to completely harrowing and downright bleak.",
      "author": "Germain Lussier"
    },
    {
      "text": "McKay encourages us to sympathize with even his most odious characters and nails the answer to the inevitable question, \"If you knew the world were ending, how would you spend your final moments?\"",
      "author": "Chris Hewitt"
    },
    {
      "text": "\"Don't Look Up\" is able to laugh at our culture while also expressingdeep concerns about the state we find ourselves in. It's here to wish you a very pleasant end of times.",
      "author": "Adam Graham"
    },
    {
      "text": "It packs all its best ideas, funniest scenes and most inspired moments of acting purely into the first 45 minutes, and then lets the rest - another 95, I'm afraid - drain slowly down the plughole.",
      "author": "Tim Robey"
    },
    {
      "text": "DiCaprio rages, Lawrence fumes and a promising satire quickly runs out of steam.",
      "author": "Christian Toto"
    },
    {
      "text": "Adam McKay's Downsizing.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Don't Look Up may make some cutting points ... but the movie's comedic approach is far too broad for it to feel as if it cares about these things.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Considering the effort put in, the attempt to make a point, and the level of entertainment I got out of the film, I was happy I looked.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Every scene in Don't Look Up vibrates at the most obnoxious, self-congratulatory tone.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "Don't Look Up can't reconcile the satire with its honest and open sentimentality, which is presented sincerely without being terribly compelling.",
      "author": "Josh Spiegel"
    },
    {
      "text": "Despite big glitzy Hollywood names above the title and many laugh lines, Don't Look Up isn't escapism. It's a serious movie that aims to entertain but really wants to make you think.",
      "author": "Richard Crouse"
    },
    {
      "text": "\"Don't Look Up\" bristles with the combustible elements of absurdity, observational humor and seething outrage that give the best political satires their edge...",
      "author": "Ann Hornaday"
    },
    {
      "text": "In an ideal world, \"Don't Look Up\" would be an updated \"Dr. Strangelove,\" making deadly serious fun of a deadly serious menace. But as Adam McKay knows all too well, this is not an ideal world.",
      "author": "Mark Feeney"
    },
    {
      "text": "Nothing about this is productive in the slightest, and its supposed insights are routinely vapid and Old Man-ish - this is radiating with \"these kids and their dang phones\" energy.",
      "author": "Trace Sauveur"
    },
    {
      "text": "Certainly the best of the \"adult\" McKay offerings.",
      "author": "Brian Orndorf"
    },
    {
      "text": "The movie's faults sit with McKay's screenplay, which doesn't have the necessary heft and guts it needs, and frankly, we need right now.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Adam McKay's alleged comedy about the end of the world should be ambitious. But, somehow, it sure doesn't feel that way.",
      "author": "Joanna Langfield"
    },
    {
      "text": "I feel I would have preferred to watch the fun and light version of this movie the trailer manages to somewhat misleadingly depict.",
      "author": "Patricia Puentes"
    },
    {
      "text": "That its satirical outlook tracks with our dystopian political reality is distressing, if not thoroughly funny.",
      "author": "Matt Oakes"
    },
    {
      "text": "Don't Look Up is a sledgehammer satire that skewers America's political discourse and social media fixation. It has laugh out loud moments, but goes overboard in its depiction of selfishness and ineptitude.",
      "author": "Julian Roman"
    },
    {
      "text": "'Don't Look Up' is a bloated, overheated disaster that crashes to Earth with a resounding thud.",
      "author": "Bob Bloom"
    },
    {
      "text": "The dark comedy Don't Look Up is the equivalent of watching an annoyingly smug hack comedian tell the same clumsily executed joke for more than two hours. This movie crams in a lot of big-name stars to try to make it look better than it really is.",
      "author": "Carla Hay"
    },
    {
      "text": "Don't Look Up is an excoriating trauma dump of a film that may ring false to those who find McKay's new modus operandi to be little more than the indulgent flailing...",
      "author": "Dominic Griffin"
    },
    {
      "text": "If this is Adam McKay's lot in life, to be a truth-teller through the use of movies as funny as Don't Look Up, then I'm okay with that.",
      "author": "Travis Hopson"
    },
    {
      "text": "Ironically, a movie about how we're all too distracted to care about the things that matter gets too distracted itself.",
      "author": "Rob Thomas"
    },
    {
      "text": "The movie proceeds as bitter, zany war game. What if the world was ending and everyone stared at their phone? Except - ah no - that's reality.",
      "author": "Danny Leigh"
    },
    {
      "text": "One of the funniest (and probably grimmest) movies of the year, \"Don't Look Up\" continues Adam McKay's hot streak of putting a smart and satirical edge on actual, real life and topical issues.",
      "author": "Nate Adams"
    },
    {
      "text": "Overly smug would-be satire that, worst of all, isn't funny.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Don't Look Up scans as a vanity project for all involved, an empty gesture ... from McKay and his cast that sort of seems significant only if you glance quickly.",
      "author": "M.G. Mailloux"
    },
    {
      "text": "'Don't Look Up' is aiming to be this smart satire in the vein of 'Network', but it can't seem to target anyone with real precision.",
      "author": "Brian Lloyd"
    },
    {
      "text": "It's hilarious because it's not far off from the truth, and it hurts for the exact same reason. That's why Don't Look Up hits and why it's both McKay's most chaotic and well-crafted films.",
      "author": "Kate Sánchez"
    },
    {
      "text": "...when satirical material is quite literally true it fails to be as funny as it should be. That's not to say \"Don't Look Up\" isn't entertaining, albeit in a hopeless kind of way...",
      "author": "Laura Clifford"
    },
    {
      "text": "A satire so gaudy, OTT, and stark-raving mad it plays, in these tumultuous times, like social realism.",
      "author": "Jamie Graham"
    },
    {
      "text": "The thing is, it all feels a little toothless.",
      "author": "Hannah Strong"
    },
    {
      "text": "As much as Don't Look Up makes you laugh, it could make you very angry as well. And that's the point.",
      "author": "Ian Sandwell"
    },
    {
      "text": "McKay's Netflix entry sets out to push as many buttons as possible until one or more trigger the responses to make one feel icky, offended, or, worse, seen.",
      "author": "Don Shanahan"
    },
    {
      "text": "Don't Look Up is all about science, baby.",
      "author": "Robert Daniels"
    },
    {
      "text": "This outrageously funny feature gets the urgency of its neurosis and message across while avoiding the dreaded \"too soon\" and \"too obvious\" monikers. It's absolutely on-point.",
      "author": "Courtney Howard"
    },
    {
      "text": "Bolstered by a fantastic cast, McKay's film is bold, with sharp commentary, a feeling of unease, and comedic beats that work to make a memorable film.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "Messy but also hard to look away from; The longer it goes on, the more transparent a reflection of a depressingly hilarious real-life existence it becomes",
      "author": "Robert Kojder"
    },
    {
      "text": "Certainly one of 2021's worst movies - an arrogant, obnoxious mess.",
      "author": "Evan Dossey"
    },
    {
      "text": "...we are laughing out loud almost the entire time, a surprising effect, as the masterful writer and director Adam McKay finds a way to make annihilation hilarious ...",
      "author": "Pamela Powell"
    },
    {
      "text": "A film with all the right things to say about how government, the media, and corporations ignore the emerging disaster of climate change, but couched within a satire so lumbering that it's enough to turn a tree hugger into a pro-fracker.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Don't Look Up is both types of blunt: It makes no bones about exactly what the filmmakers think of climate-change deniers and social-media distractions, and it repeatedly blunts the impact of its satire by calling its shots early, often, and loudly.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Unfortunately, [Adam McKay]'s bought too deeply into his hype as a vivid truth-teller of society's ills, and that smugness has infected too much of his films' fabric.",
      "author": "Clint Worthington"
    },
    {
      "text": "...neither McKay nor Sirota knew how to thread the needle. Don't Look Up is a failure, hopefully, one that all involved can improve from.",
      "author": "Taylor Baker"
    },
    {
      "text": "The humor isn't enough to offset the strangely unintentional realism; what was surely meant to be a satirical approach to a serious situation is instead all too believable.",
      "author": "Mike Massie"
    },
    {
      "text": "A good way for McKay to keep in step with his other recent political comedies, while also returning to the flat-out sillier sense of humor, for which he first became known.",
      "author": "Edward Douglas"
    },
    {
      "text": "The film's conceit could be sharply effective, in careful hands. But McKay knows only of punching down with meaty fists, so the result is a messy, smarmy assault.",
      "author": "Barry Hertz"
    },
    {
      "text": "McKay's biggest problem is too many stars. Leonardo Di Caprio and Jennifer Lawrence actually rein themselves in. But the rest of them do not.",
      "author": "Roger Friedman"
    },
    {
      "text": "Looking up is the least we can do and McKay's film really does push the question, \"why aren't we comfortable doing so?\" It's this thought, silly as the film might be with a truly top-notch ensemble cast, that left me in tears by the end.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Bleak, knowing and hilarious, Don't Look Up is unerringly on the nose.",
      "author": "James Mottram"
    },
    {
      "text": "Don't Look Up might be the funniest movie of 2021. It's the most depressing too, and that odd combination makes for a one-of-a-kind experience.",
      "author": "Mick LaSalle"
    },
    {
      "text": "This star-studded, extremely provocative satire at times veers off course itself, partially undermining its admirable qualities with the broadness of its tone.",
      "author": "Brian Lowry"
    },
    {
      "text": "Certainly the spirit of Billy Wilder also lives within McKay. We are the better for it, and I can't wait to see what he does next -- if we don't blow ourselves up before he gets the chance.",
      "author": "Pete Hammond"
    },
    {
      "text": "The result feels a little like Mars Attacks!, if the call were coming from inside the house: a disaster movie all dressed up for the apocalypse with too many movie stars to count and not quite enough punchlines.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "These scenes would be funnier if they were more incisively written (or at least more cleverly improvised), and also if the movie seemed to be actively critiquing rather than merely embodying the laziness of its targets.",
      "author": "Justin Chang"
    },
    {
      "text": "Don't Look Up is essentially Deep Impact played for yuks, Armageddon if it had a brain. It might bite off more than it can chew, but it is frequently funny, highly ambitious brain-food.",
      "author": "Ian Freer"
    },
    {
      "text": "Charming, witty, and full of political satire -- Don't Look Up has no business being this good. The cast has amazing chemistry and not one person is wasted. What a film.",
      "author": "Tessa Smith"
    },
    {
      "text": "The glitzy cast can't quite stitch together the sprawling satire as the film drags in places through its almost two-and-a-half-hour runtime. It's certainly still a movie to admire and appreciate though, as a sort of anti-Armageddon or Deep Impact.",
      "author": "Tori Brazier"
    },
    {
      "text": "There are enough decent gags for this to occasionally amuse, yet there's something blindingly obvious about most of the satire which, in its swipes at Trump mania and the rejection of expert advice, already feels dated.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Don't Look Up is like a 145-minute Saturday Night Live sketch with neither the brilliant comedy of Succession, which McKay co-produces, nor the seriousness that the subject might otherwise require.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Don't Look Up is filled with greatly talented actors really and truly selling this material -- but the volume remains at 11 throughout the story when some changes in tone here and there might have more effectively carried the day.",
      "author": "Richard Roeper"
    },
    {
      "text": "I'm just going to say it: Don't Look Up makes a surprisingly deep impact.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Is Don't Look Up further proof that self-importance has dulled one of Hollywood's funniest minds? I'm afraid so. Prestige is one hell of a drug.",
      "author": "David Ehrlich"
    },
    {
      "text": "It's like a Bugs Bunny cartoon suddenly veered into solemnity, and then, in the entirely unearned closing scenes, sentimentality.",
      "author": "Jason Bailey"
    },
    {
      "text": "A cynical, insufferably smug satire stuffed to the gills with stars that purports to comment on political and media inattention to the climate crisis but really just trivializes it. Dr. Strangelove it ain't.",
      "author": "David Rooney"
    },
    {
      "text": "Humans are stupid and can't be expected to agree on anything, even if their existence depends on it. That's the \"hilarious\" insight Adam McKay wants to impart with Don't Look Up, a smug, easy-target political satire.",
      "author": "Peter Debruge"
    },
    {
      "text": "It's the same bait and switch from the opposite [political] direction. And it's not saving any lives. It's dangerously dismissing the problem as farce.",
      "author": "Jared Mobarak"
    },
    {
      "text": "If it looks like I aged 20 years the next time you see me, blame Don't Look Up.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Even as some satire doesn't totally land there's the big plus of it being genuinely much funnier than McKay's other prestige films, if chiefly due to excellent comedic performances.",
      "author": "Ethan Vestby"
    },
    {
      "text": "Adam McKay is a genius behind the camera as Don't Look Up takes the satire to the next level with one of the best ensemble casts ever.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Don't Look Up is likely to go down as this generation's Dr. Strangelove.",
      "author": "James Croot"
    },
    {
      "text": "This Smug, Shrill Disaster Movie Satire Is Just A Disaster.",
      "author": "Chris Evangelista"
    },
    {
      "text": "The satire might be in your face, but it doesn't make it any less funny-or the truth in it any less chilling.",
      "author": "Nicole Ackman"
    },
    {
      "text": "McKay's nothing exceeds like excess approach results in a movie that drags in the middle (it's 2 hours and 25 minutes long). The first and last acts are something, though.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Laughs give way to anger, frustration, and ultimately a kind of desperate hope. It's a trajectory that serves as an eerie mirror to the last two years of pandemic life - just don't go in expecting lighthearted fun.",
      "author": "Andrew Webster"
    },
    {
      "text": "The end of the world isn't hilarious. It merely elicits plenty of chuckles.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "The potential end of the world at our own indifferent hands is unlikely material for comedy, but Adam McKay is up to the task.",
      "author": "Joey Magidson"
    },
    {
      "text": "Adam McKay's satire about our current facts-averse political divide and incompetent government is his best yet. It's often very funny. Unfortunately the targets are scattershot, the film is easily distracted, and it's least a half hour too long.",
      "author": "Nathaniel Rogers"
    }
  ],
  "release_year": 2021,
  "duration": 138,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Kate Dibiasky (Jennifer Lawrence), an astronomy grad student, and her professor Dr. Randall Mindy (Leonardo DiCaprio) make an astounding discovery of a comet orbiting within the solar system. The problem: it's on a direct collision course with Earth. The other problem? No one really seems to care. Turns out warning mankind about a planet-killer the size of Mount Everest is an inconvenient fact to navigate. With the help of Dr. Oglethorpe (Rob Morgan), Kate and Randall embark on a media tour that takes them from the office of an indifferent President Orlean (Meryl Streep) and her sycophantic son and Chief of Staff, Jason (Jonah Hill), to the airwaves of The Daily Rip, an upbeat morning show hosted by Brie (Cate Blanchett) and Jack (Tyler Perry). With only six months until the comet makes impact, managing the 24-hour news cycle and gaining the attention of the social media obsessed public before it's too late proves shockingly comical -- what will it take to get the world to just look up?!",
  "popularity": 7.8,
  "poster_url": "https://image.tmdb.org/t/p/original/th4E1yqsE8DGpAseLiUrI60Hf8V.jpg"
}