{
  "movie_name": "Edge of Tomorrow",
  "movie_id": "live_die_repeat_edge_of_tomorrow",
  "total_reviews": 337,
  "reviews": [
    {
      "text": "Edge of Tomorrow is one of Tom Cruise’s best films of late. The framework and structure is unique and well handled for the most part and is still exciting, even though the final act isn’t quite on the same level.",
      "author": "JD Duran"
    },
    {
      "text": "Edge of Tomorrow is a brainy sci-fi that will keep you on the edge of your seat.",
      "author": "Diana Tuova"
    },
    {
      "text": "“Edge of Tomorrow” is a brilliantly written, acted, and directed sci-fi action film that keeps you on the edge of your seat.",
      "author": "Ankit Ojha"
    },
    {
      "text": "The joy of Edge of Tomorrow is that there are many endings, and in most of them Tom Cruise’s smirk vanishes from the screen forever to trouble us no more.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Endlessly entertaining and ceaselessly innovative",
      "author": "Matt Brunson"
    },
    {
      "text": "Up to that forgivably underwhelming finale, Edge neatly synthesizes Cruise's ongoing fears of obsolescence and the fiscal pragmatics of its location into a witty story about the sheer tedium of self-improvement as a necessity for survival.",
      "author": "Vadim Rizov"
    },
    {
      "text": "There’s some good science fiction, strategic funny moments, exhilarating action, and a smart and sharp story that never grows dull.",
      "author": "Keith Garlington"
    },
    {
      "text": "Regardless of the various other films that Edge of Tomorrow could be compared to, the end result feels strangely unique, and not for a moment during its two-hour runtime does it lose the audience to thoughts of its influences.",
      "author": "Brian Eggert"
    },
    {
      "text": "There's a certain unexpected humor coming out of \"Edge of Tomorrow\" that boosts its doom-and-gloom alien invasion setup.",
      "author": "Don Shanahan"
    },
    {
      "text": "Doug Liman’s sci-fi action thriller remains one of the most enjoyable American blockbusters of the previous decade.",
      "author": "Jake Cole"
    },
    {
      "text": "Edge of Tomorrow: Live. Die. Repeat manages to keep audiences on the edge of their seats in this WWII-esque sci-fi action thriller.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Edge of Tomorrow is a rousing adventure filled with pulse-pounding thrills and surprising dashes of character-driven humor, the film a breathless two hours of fun worth celebrating.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Even if I can’t forgive the ridiculousness of the final moments of \"Edge of Tomorrow\" ...  everything leading up to that ending still rules and does so even harder with the improved picture and sound.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Death becomes Tom Cruise in Edge of Tomorrow, a gripping and meticulously constructed futuristic thriller that finds his untested soldier fighting aliens while stuck in a time loop.",
      "author": "Robert Sims"
    },
    {
      "text": "A fascinating premise with a disappointing visual style.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Episode 37: Edge of Tomorrow / Forbidden Planet / High Life",
      "author": "Taylor Baker"
    },
    {
      "text": "The Angel of Verdun is an action heroine with the skills needed to ride into battle, but the empathy to reach out to the partner she just met.",
      "author": "Cate Young"
    },
    {
      "text": "The first two reels are packed with energy and invention it's only when the conventions that made the story enticing are put aside in the last reel that the movie becomes a standard Cruise action flick.",
      "author": "Richard Crouse"
    },
    {
      "text": "Unexpectedly clever surprises keep the anticipation and mystification rolling, while the action sequences are plentiful and intense.",
      "author": "Mike Massie"
    },
    {
      "text": "On face value, Doug Liman's Edge Of Tomorrow deals with familiar tropes - of a war for the planet and time loops and alien invasions - but it's brilliantly executed with some fantastic combat sequences.",
      "author": "Film Companion Staff"
    },
    {
      "text": "Edge of Tomorrow is proof, once again, that Cruise can certainly be knocked down but can never be counted as completely out.",
      "author": "Richard Propes"
    },
    {
      "text": "Liman deftly orchestrates the destruction, ensuring it doesn't sink into mind-numbing Transformers fare. Blunt and Cruise invest a great deal of heart in their action heroics, thankfully minimising the hokum romance angle.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "The strength of the lead performances and the inventive use of sci-fi conventions make this better than the usual mainstream fare.",
      "author": "Allen Almachar"
    },
    {
      "text": "Edge of Tomorrow represents another consistent film from director Doug Liman. From projects such as The Bourne Identity, The O.C. to Mr and Mrs Smith, this film is by far his best work.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "This is exactly the raucous, smart adventure that you want out of a big summer blockbuster release.",
      "author": "Brent McKnight"
    },
    {
      "text": "\"Edge of Tomorrow\" is a fun, rip-roaring sci-fi actioner ... It has explosions and gunfire and aliens, yet it's also very smart with a wicked sense of humor.",
      "author": "Damond Fudge"
    },
    {
      "text": "This is further proof that in the last 15 years Tom Cruise has become a box office hunter with his action and science fiction movies. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "It was pretty exciting.",
      "author": "Avaryl Halley"
    },
    {
      "text": "I guess I liked it?",
      "author": "Andrew Galdi"
    },
    {
      "text": "Edge of Tomorrow threatens to become a repetitive bore, yet at each plausible juncture, its formula veers inextricably into new facets of intrigue, at least enough to keep wandering attention spans at bay.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Edge of Tomorrow deserves praise and viewers. It is proof that calculated cynicism and recycled content aren't the only ways to deliver big-budget, mainstream entertainment.",
      "author": "Ryan Syrek"
    },
    {
      "text": "This is the best we've seen from Tom Cruise in years, and Emily Blunt wears her heroism well.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Groundhog Day meets Aliens, and it's great.",
      "author": "Richard Trenholm"
    },
    {
      "text": "This movie had the potential to be a great renovation for the alien invasion genre, instead it chose to be an incoherent love story. Edge of Tomorrow is entertaining but still, it's a waste of a good idea. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "The most fun you're likely to have watching someone else play a video game any time soon.",
      "author": "Ben Nicholson"
    },
    {
      "text": "A full octane bit of escapism that proves to be a pretty good time at the movies.",
      "author": "Micheal Compton"
    },
    {
      "text": "Edge of Tomorrow, starring Tom Cruise and Emily Blunt, is smart, fun and doing more to equalize the battle of the sexes than most action films.",
      "author": "Amanda Greever"
    },
    {
      "text": "Edge of Tomorrow is entertaining from start to finish to start to finish to start to finish...",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Edge of Tomorrow is a solid military science-fiction adventure, with character progression and a bracing concept as underlying strengths.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "When the world is crashing to an end, I'd like Emily Blunt by my side.",
      "author": "Rosalie Kicks"
    },
    {
      "text": "This was smart and engaging, and as much as we love to hate his personal dramas, Tom Cruise knows how to helm a blockbuster.",
      "author": "Debbie Baldwin"
    },
    {
      "text": "Edge of Tomorrow manages to be smart and entertaining in equal measure; it's a sweet blend of smart sci-fi ideas and spectacular action spectacle.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "You have to let those bland trailers fall back into the recesses of your mind and give Edge of Tomorrow the fair shake it deserves.",
      "author": "Aaron Peterson"
    },
    {
      "text": "A brutal indictment of the disposability of life.",
      "author": "Pat Padua"
    },
    {
      "text": "Its visual universe has a strange brutal ugliness that tips into beauty, a complete, edgy and consistent world of ruin, cement and steel and harsh landscapes.",
      "author": "Anne Brodie"
    },
    {
      "text": "Tom Cruise is amazing in this. I know we always make jokes about him...put all that aside. He's an action star in this, he has great comedic timing. He really carries the film.",
      "author": "Andre Meadows"
    },
    {
      "text": "It is impossible to say how exhausting this film is -- by the fourth battle, I was gibbering.",
      "author": "Camilla Long"
    },
    {
      "text": "It's ... nice to see a film where outstanding visual effects are in place to support the story and not the other way around.",
      "author": "Josh Terry"
    },
    {
      "text": "It's like all the story parts of a video game, except boring and derivative.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The whole film whizzes by.",
      "author": "Brigit Grant"
    },
    {
      "text": "Most folks describe it as Groundhog Day meets War of the Worlds, and really, what's not to love about that infernal combo?",
      "author": "Dorothy Woodend"
    },
    {
      "text": "[Edge of Tomorrow] may not be as smart as it could've been in the broad strokes, but a clever, well-acted thrill ride like this doesn't really need to have its head fully in the game, now does it?",
      "author": "Dylan Green"
    },
    {
      "text": "The lapses in logic are as numerous as the stars in the sky. But somehow it doesn't matter. Not only has Cruise and company delivered the first great action movie of the summer, they've tossed in a bit of philosophy, too.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Credit a smart script, smarter direction, excellent production elements and an unflappable leading man for taking you to hell and back -- over and over again.",
      "author": "Dwight Brown"
    },
    {
      "text": "Edge of Tomorrow is the perfect mix of blustering action and sci-fi thinky nonsense that is best enjoyed without picking at it too much.",
      "author": "David Sims"
    },
    {
      "text": "A better video game movie than any movie based on a video game.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Round and round we go waiting for Tom Cruise to sprint through enough time-loop cycles to figure out how to kiss Emily Blunt amid the tarantula aliens. Very exciting! But as usual they get the time-loop-as-reincarnation-metaphor all wrong.",
      "author": "Mark Jackson"
    },
    {
      "text": "[Liman] reminds you that he was put on this earth to make popcorn thrillers. The ingenuity he brings to this disposable project is a sign of why Hollywood blockbusters continue to rule the globe.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "How Liman and Cruise deliver the repeated set-up scenes gives EoT plenty of light relief from warzone mayhem, the leading man's charms working a treat as he tries to convince those around him that he's seen it all before.",
      "author": "Russell Baillie"
    },
    {
      "text": "Edge of Tomorrow is a superb novel-to-screen adaptation, based on the novel \"All You Need is Kill\" by Japanese author Hiroshi Sakurazaka.",
      "author": "Kaori Shoji"
    },
    {
      "text": "The core of often feels like a prolonged montage, immaculately polished and vibrant, but lacking the depth or cohesiveness of more interesting and realized works of science-fiction.",
      "author": "Zade Constantine"
    },
    {
      "text": "Frothy enough to conceal its own undercurrent of mindless action sludge.",
      "author": "J. Olson"
    },
    {
      "text": "Edge of Tomorrow feels like it's about something more than action. Neat trick.",
      "author": "Robert Denerstein"
    },
    {
      "text": "It's easily the highlight of the summer movie offerings to me so far.",
      "author": "Allyson Johnson"
    },
    {
      "text": "Before too long, the plot begins to cut significant corners, things get terribly convenient and, by the end, the suspect plot logic utterly falls apart in favor of an idiotically beatific ending.",
      "author": "Piers Marchant"
    },
    {
      "text": "To have a fun summer blockbuster with good characters, good action, and a tight and exciting script these days is almost unheard of. The smart sci-fi action movie is back. Let's hope it happens over and over again.",
      "author": "Kyle Anderson"
    },
    {
      "text": "This is one of my favorite movies of the year so far.",
      "author": "Richard Roeper"
    },
    {
      "text": "Director Doug Liman has great fun with this just-go-with-it conceit.",
      "author": "Nick Hasted"
    },
    {
      "text": "This is the kind of thoughtfully constructed movie that other summertime blockbusters should aspire to be more like, clever and cool and never giving you that ho-hum sense that you've seen it all before.",
      "author": "Richard Lawson"
    },
    {
      "text": "As \"puzzle movies\" go, Edge of Tomorrow is one that holds up surprisingly well to scrutiny.",
      "author": "Dominick Suzanne-Mayer"
    },
    {
      "text": "A lot of it is very well done.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "With a tremendous first half and more brains, heart and laughs than any of its promotional material indicated, this is smart, witty, thrilling and, above all, fun.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "Sakurazaka's story has solid sci-fi credentials and Cruise proves that he still has the chops to pull off mega action movies. Edge of Tomorrow is one of his most compelling and nuanced performances in this genre.",
      "author": "Reagan Gavin Rasquinha"
    },
    {
      "text": "Cruise plays second fiddle to the luminous talents of Emily Blunt for a good chunk of the movie. Even at his best, he's a worthy equal but never superseding her swashbuckling charisma.",
      "author": "Sukanya Verma"
    },
    {
      "text": "At best, Edge of Tomorrow adds up to a videogame-compatible diversion.",
      "author": "Rashid Irani"
    },
    {
      "text": "[A film that] will keep] you delightfully entertained for one hot summer afternoon. Even if you get the sense that you've seen it all before.",
      "author": "Venky Vembu"
    },
    {
      "text": "Edge of Tomorrow's simple, smart pleasures include a look at how many screw-ups it can take to learn there may be things -- and people -- beyond yourself that are worth fighting for.",
      "author": "Scott Renshaw"
    },
    {
      "text": "The script, adapted by Christopher McQuarrie and the sibling team of Jez and John-Henry Butterworth, is actually ingenious in doling out its herky-jerky storytelling.",
      "author": "Robert Horton"
    },
    {
      "text": "...exactly the kick-ass, intellectual, science-fiction story everyone says they wish was made more often...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "It's the rare summer spectacle that, tacked-on coda notwithstanding, might actually warrant repeat viewings.",
      "author": "Nick Schager"
    },
    {
      "text": "I've always said it: if only there could be an epic sci-fi version of Groundhog Day. OK, I never said that, but I'm glad there is one: it's called \"Edge of Tomorrow.\"",
      "author": "David Blaustein"
    },
    {
      "text": "It's a fairly lightweight, but high quality summer movie. The kind you can just sit back and enjoy while you munch your popcorn.",
      "author": "Scott Nash"
    },
    {
      "text": "It's a near perfect closed loop of a film: fun, well-conceived and never afraid to treat death with both the reverence and contempt that it deserves.",
      "author": "Alex Doenau"
    },
    {
      "text": "Edge of Tomorrow is a diverting enough, enjoyable, Tom Cruise war movie, but perhaps one that won't linger in the mind too long after the final credits have rolled.",
      "author": "Iain McNally"
    },
    {
      "text": "It used to be that there was cool, and there was Tom Cruise. Now, there's Tom Cruise in \"Edge of Tomorrow,\" which is cool on top of cool.",
      "author": "Sean P. Means"
    },
    {
      "text": "Tom Cruise must've been grinning that Risky Business grin from ear to ear when he first read through the script for Edge of Tomorrow. He had to know he had a magnificent movie in his hands.",
      "author": "Bob Grimm"
    },
    {
      "text": "Out of nowhere, Edge of Tomorrow is an exhilarating mix of Verhoeven-esque sci-fi subversion, existential comedy straight out of Groundhog Day, and the slaughter-and-reset structure of a first-person shooter game.",
      "author": "Daniel Barnes"
    },
    {
      "text": "It's a bloodless romance and the action builds to an anticlimax, but the story is also adapted with surprising wit ...",
      "author": "Andrew Collins"
    },
    {
      "text": "Overall, it benefits so much from the expert deployment of time-travel tropes that it earns a pass on a little alien acid blood.",
      "author": "Genevieve Valentine"
    },
    {
      "text": "I had a better time than I expected.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Edge of Tomorrow obviously cost a fortune to make, but it has a light, shrugging, tossed-off air that makes it all the more impressive, let alone enjoyable.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Yes, the title is bland to the point of meaninglessness. But that's just about the only thing Edge Of Tomorrow gets wrong.",
      "author": "Norman Wilner"
    },
    {
      "text": "Shirks its responsibility to be about anything. Still, decent fun.",
      "author": "David Jenkins"
    },
    {
      "text": "It's harder to bear how the film fuses its sci-fi premise with an action movie's sensibility: one in which the characters become living, breathing video-game avatars, rather than human beings.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "\"Edge of Tomorrow\" is big, loud and undeniably fun.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "It seems to know what we've all been forgetting since 1985: science fiction can be funny, blockbusters can be kooky, and Tom Cruise can, and should, be a jackass.",
      "author": "Michael Arbeiter"
    },
    {
      "text": "Edge of Tomorrow is a decent time waster, but if you're the sort of person who watches a movie every day, you should probably look for something better.",
      "author": "J. R. Jones"
    },
    {
      "text": "It's a beautifully executed jolt of darkly funny, smart-arsed sci-fi adventure. Welcome back Tom.",
      "author": "Jarrod Walker"
    },
    {
      "text": "The smartest blockbuster of this summer season, or perhaps any summer season.",
      "author": "Kevin Maher"
    },
    {
      "text": "The reason the film works is because it throws everything into the blender and comes up with something new, something that has a great lively sense of wit and humor to it, and it takes the time to fully explore its wild premise fully.",
      "author": "Drew McWeeny"
    },
    {
      "text": "I can't say I was always quite sure what on Earth was going on, but Edge of Tomorrow, despite its flaws, despite its feeling of deja vu, manages to be tolerably entertaining mainly because of its nicely calibrated sense of humour.",
      "author": "David Stratton"
    },
    {
      "text": "Edge of Tomorrow may be the best video game movie ever made. Which is strange since it isn't actually based on a video game.",
      "author": "Steve Persall"
    },
    {
      "text": "A bold concept which could have easily resulted in tedium, but not in Liman's hands",
      "author": "Jordan Hiller"
    },
    {
      "text": "Cruise is a winner all the way, whether he's being a gung-ho hero or the butt of the joke.",
      "author": "Jason Best"
    },
    {
      "text": "With its intriguing premise, engaging characters, and plenty of thrills to go around, Edge of Tomorrow makes for a breath of fresh air in a genre that has been crushed under monotony as of late.",
      "author": "Jeff Beck"
    },
    {
      "text": "A deftly calibrated sci-fi spectacle.",
      "author": "Wesley Lovell"
    },
    {
      "text": "More story than testosterone, more time-jump-cuts than spacey filler, and more war-as-hell than war-as-cool. Leaves you pondering if we're 'masters of our fate' or just action-figures going through the emotions in some supreme player's idea of a war game.",
      "author": "Brian Gibson"
    },
    {
      "text": "It's an exceptionally entertaining, consistently humorous, and surprisingly moving story sporting top-notch visual effects...",
      "author": "Mark Hughes"
    },
    {
      "text": "Tom Cruise once again shows why he's still a movie star in this exciting, inventive and witty sci-fi actioner.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Cruise and Blunt take you on a (literally) loopy ride that's entertaining and doesn't wear out its welcome.",
      "author": "Bruce Bennett"
    },
    {
      "text": "Clever and fast-paced with a welcome streak of dark humor, this sci-fi actioner is undeniably entertaining, if ultimately not terribly substantial.",
      "author": "Ken Hanke"
    },
    {
      "text": "It succeeds on modest terms, yet it's certainly not worth repeating over and over.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "It's the writing and plotting in \"Edge of Tomorrow\" that sucks. Not the staging of scenes. Not the film's sense of humor. Not the film's quality action sequences.",
      "author": "Paul Chambers"
    },
    {
      "text": "Doug Liman directed, making the most of every opportunity for a quick cut, a good laugh and a new surge of adrenaline.",
      "author": "Stuart Klawans"
    },
    {
      "text": "This is not a run-of-the-mill genre yarn in the vein of countless modern sci-fi blockbusters, but a fascinating and enjoyable vehicle that creates an ambitious illusion.",
      "author": "David Keyes"
    },
    {
      "text": "Edge of Tomorrow is an ingenious action-comedy about how frequently movie heroes would actually die if they attempted that much crazy s***.",
      "author": "Simon Miraudo"
    },
    {
      "text": "There is a good bit of humor in the movie and the performances of Cruise and Blunt are spot on, with good supporting work from Bill Paxton, who plays a very hard-headed sergeant.",
      "author": "Robert Roten"
    },
    {
      "text": "Keeps the pace and dialogue snappy enough for a classic screwball comedy, at least until the inevitable overkill of the boom-bastic finale, centered on an alien-infested Louvre.",
      "author": "John Beifuss"
    },
    {
      "text": "One of the best, most intelligent, most exciting and surprisingly funny special effects-laden epics I have seen in several summers. A model of cinematic craftsmanship from page to screen.",
      "author": "Fr. Chris Carpenter"
    },
    {
      "text": "The financial failure of EDGE OF TOMORROW represents the greatest inverse relationship between quality and ticket sales since TWILIGHT sent breathless teen girls storming into theatres.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "Smart, unpredictable, expertly designed, shot and edited, well acted and boasting impressive special effects, \"Edge of Tomorrow\" is science fiction and the summer blockbuster done right.",
      "author": "Greg Maki"
    },
    {
      "text": "...thrilling and unexpectedly comedic...",
      "author": "David Nusair"
    },
    {
      "text": "If you can believe that repetitions of death/life can be used as a slow build toward gaining on an invincible enemy, you'll appreciate that this creative team has made a movie in which there isn't a dull moment.",
      "author": "Jules Brenner"
    },
    {
      "text": "Tom Cruise: in regards to Oblivion? All is forgiven.",
      "author": "Widgett Walls"
    },
    {
      "text": "It features all the best qualities of memorable summer-movie thrillers - it's clever, cool and quirky to the point of almost being a bit silly - and when you leave, you may consider re-living the experience all over again.",
      "author": "Michael Smith"
    },
    {
      "text": "Edge of Tomorrow will get the easy comparisons to Groundhog Day but it's also exactly the kind of punchy sci-fi adventure that goes best with salty popcorn and a willing audience.",
      "author": "John Gholson"
    },
    {
      "text": "This is a movie that is constantly ahead of the audience, where smart characters do smart things to thwart a seemingly smarter menace.",
      "author": "Jon Niccum"
    },
    {
      "text": "A reminder that the best kind of idiot fun comes from a place of very pointed intention, snug filmmaking, purposeful writing and acting.",
      "author": "Tim Brayton"
    },
    {
      "text": "This film would have been well-made regardless of its casting, but the pairing of Tom Cruise and Emily Blunt is an inspired one.",
      "author": "Rob Humanick"
    },
    {
      "text": "Though lacking the overall conceptual sophistication of modern time-warping classics such as Looper and Inception, Edge of Tomorrow is still more than capable of applying an unshakable grip upon the viewer from start to finish.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Liman takes the movie's \"Groundhog Day meets Independence Day\" premise (adapted from Hiroshi Sakurazaka's novel All You Need is Kill) and runs with it a way that makes it more compelling than it theoretically should be.",
      "author": "Gary Dowell"
    },
    {
      "text": "The concept of repetition is quite brilliantly done. It never feels \"that gag again?!\".",
      "author": "David Poland"
    },
    {
      "text": "Liman's the brains behind the Bourne franchise, so one approaches the picture with great expectations of breathless action, depth of character and narrative dazzle. One is in for great disappointment.",
      "author": "Rick Kisonak"
    },
    {
      "text": "Director Doug Liman (\"The Bourne Ultimatum\") does a nice job of taking a script credited to three screenwriters and mixing in moments of humor with mostly non-stop action.",
      "author": "John Urbancich"
    },
    {
      "text": "One of Tom Cruise's best in years, Edge of Tomorrow steers clear of its source material's heaviness and just tries to entertain, which is does in spades, packing in the action and Director Liman's gallows wit approach to a Groundhog Day premise.",
      "author": "Diva Velez"
    },
    {
      "text": "Funny, suspenseful and terrifically imaginative, Edge of Tomorrow is a thinking-person's action film.",
      "author": "Tom Glasson"
    },
    {
      "text": "A satisfying chunk of sci-fi entertainment, breezily but carefully directed by Doug Liman to be a cerebral summer spectacle.",
      "author": "Eric D. Snider"
    },
    {
      "text": "\"...represents the deconstruction - and then the hurried, harried reconstruction - of Tom Cruise.\"",
      "author": "Josh Larsen"
    },
    {
      "text": "A delirious descent into blackly funny futility.",
      "author": "Dave White"
    },
    {
      "text": "\"Edge of Tomorrow\" is a total blast.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "The filmmakers constantly keep things fresh and inventive, providing us with a different perspective of Cage's learning curve.",
      "author": "David Kaplan"
    },
    {
      "text": "Despite some quibbles, Edge of Tomorrow delivers the goods with ferocity and a funny bone, capturing intensity through the colorful details of involuntary rehearsal.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Fluidly directed, ferociously acted, and intelligently written, it even takes the time to consider such lofty issues as the ennui of immortality and the nature of reality as it blows up nifty monsters from outer space. Blows them up real good.",
      "author": "Andrea Chase"
    },
    {
      "text": "Hopefully, it will cause other filmmakers to realize you need more than a lot of blasts to make a summer movie - you also need to be a blast, which 'Edge' most definitely is.",
      "author": "Al Alexander"
    },
    {
      "text": "Liman has a gift for off-center authenticity--even amid the orchestrated chaos of a major studio FX picture.",
      "author": "Anne Thompson"
    },
    {
      "text": "It's \"Groundhog Day\" except it features Tom Cruise instead of Bill Murray, which can't make it better.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "If 'Groundhog Day' and 'District 9' had an offspring, it would be 'Edge of Tomorrow,' an action-packed science-fiction romp. The story, which is based on 'All You Need is Kill,' a Japanese graphic novel, is whip-smart.",
      "author": "Linda Cook"
    },
    {
      "text": "We should pause to give sincere thanks to the film: on top of its cred as sheer big-screen entertainment, there's no prospect of an Edge of Tomorrow sequel or prequel, or of it being spun out into a franchise - and how friggin' rare is that these days?",
      "author": "Jim Schembri"
    },
    {
      "text": "The 51-year-old Cruise clearly relishes playing the flawed hero - one who gets to be smarmy, duplicitous, exasperated, intimidated, bad-ass and wise.",
      "author": "Mara Reinstein"
    },
    {
      "text": "With a reference to several films of the past, Tom Cruise and Emily Blunt successfully make everything old, new again in the 'Edge of Tomorrow.' Throughout the film, the story never runs out of steam, which should please and entertain audiences.",
      "author": "Wilson Morales"
    },
    {
      "text": "In a summer season filled with its own time loops (i.e. sequels, reboots, etc.), \"Edge of Tomorrow\" beats the clock.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The conceit may sound constricting, but Liman (like Harold Ramis before him) gets exceptional mileage out of it, presenting his ever-revolving tale with visual style, narrative velocity, and a wonderful dose of dark humor.",
      "author": "Christopher Orr"
    },
    {
      "text": "Liman masterfully controls the pacing, sticking with scenes when necessary to figure out how the conceit works and skipping ahead at a quick clip that's often quite funny.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "one of the most deliciously exciting films to watch in the summer months",
      "author": "Kevin Carr"
    },
    {
      "text": "No, \"Edge of Tomorrow\" doesn't reinvent the cinematic wheel, but it cruises along, pun intended, by merging familiar ideas into something that's engaging and original.",
      "author": "Anders Wright"
    },
    {
      "text": "This is a movie about Tom Cruise working very, very hard to please the world.",
      "author": "David Haglund"
    },
    {
      "text": "Edge of Tomorrow is the best kind of sci-fi: smart, engaging, witty, exciting, and an entertaining joyride from start to finish.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "\"Edge of Tomorrow\" aims for heights of suspense and often reaches them.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Vicious aliens, wicked combat and Tom Cruise charm are all good fun, but what's the point when the story makes no sense?",
      "author": "Perri Nemiroff"
    },
    {
      "text": "There's no question that Doug Liman's \"Edge of Tomorrow\" is a solid one hour and 40 minute movie. Too bad it runs one hour and 53 minutes.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Certainly, the Fate of the World(tm) is at stake, but it says quite a bit about Liman and McQuarrie that they can still BeDazzle a frayed and worn out genre.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Why do invading extra-terrestrials always bring with them the single thing that can wipe them out? Couldn't they have hid it on Jupiter or something?",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Edge of Tomorrow earns props for marching to a different beat in an increasingly homogenized cinematic culture, and for treating its notions with the same respect it asks from the audience.",
      "author": "Rob Vaux"
    },
    {
      "text": "Two hours of derivative, repeat-rewind eye agony.",
      "author": "James Verniere"
    },
    {
      "text": "Comparisons to Harold Ramis' beloved and profoundly humane Groundhog Day are misguided. Edge of Tomorrow doesn't have a humanistic pixel in its digitally bloated body.",
      "author": "Jeff Meyers"
    },
    {
      "text": "Ultimately, this is a two-hour video game. But the filmmakers play it well.",
      "author": "Wesley Morris"
    },
    {
      "text": "Cruise is better than he's been in a while because he damps down his usual all-intensity-all-the-time MO. He's best here when his character seems the most scared.",
      "author": "Peter Rainer"
    },
    {
      "text": "Smarter and funnier about its central conceit that you might expect and with a pair of great performances, [its] only serious flaw is a final act that ditches all the science-fiction stuff for a murkily shot and relatively unimpressive conclusion.",
      "author": "Anthony Morris"
    },
    {
      "text": "Edge of Tomorrow doesn't go far enough in some respects, but its unique stylistic approach makes the experience an overall satisfying one.",
      "author": "Kofi Outlaw"
    },
    {
      "text": "Highlighted by a good time travel story, fine acting by Cruise, and well-paced directing by Liman, for a futuristic, special-effects laden film, this is one of the best",
      "author": "Tony Medley"
    },
    {
      "text": "Blunt makes us believe utterly in her fierce warrior mindset and her physical skills, and Cruise has a blast transforming his helpless coward into a mean fighting machine.",
      "author": "Lori Hoffman"
    },
    {
      "text": "Appealing but violent sci-fi thriller explores time, fate.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "'Groundhog Day' was a great film but 'Battle: Los Angeles' was a lousy one and this feels like a combination of both.",
      "author": "John Hanlon"
    },
    {
      "text": "The Matrix Revolutions meets Groundhog Day, Edge of Tomorrow is Tom Cruise's most entertaining film in years.",
      "author": "Julian Roman"
    },
    {
      "text": "Tom Cruise is the most committed movie star around and he's a major reason this original, big-budget picture works as well as it does.",
      "author": "Robert Levin"
    },
    {
      "text": "For all those that complain they don't make them like they used to, I recommend you get to the biggest screen you can find, buy copious amounts of popcorn, and enjoy this slice of summer movie-going fun.",
      "author": "Jason Gorber"
    },
    {
      "text": "Edge of Tomorrow is perfect summer escapism and the best Cruise film since 2002's Minority Report.",
      "author": "Kirk Baird"
    },
    {
      "text": "How good this genre of film is depends on how the actors, writers and the director get from predictable A to Z. This one does it perfectly.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Light on its feet and crisply edited, an endearing dalliance with the art of storytelling.",
      "author": "John Serba"
    },
    {
      "text": "In many ways, this movie feels like a video game, and as anyone who has ever picked up a controller will tell you, the dude who has an infinite-lives cheat-code will eventually win the game.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "A lot of talent and craft wasted on non-stop exposition trying to justify a plot conceit we'd already accepted. Meanwhile, the actual aliens are vaguely rendered and abstract.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Seen as it must be, in IMAX 3D, the movie rears up before you in a formidable display of pure commercial will. It's actually a lot of fun.",
      "author": "Kurt Loder"
    },
    {
      "text": "Just when everybody was ready to count Tom Cruise's career out for the count, not only is he back, but back again and back again and back again, ad infinitum!",
      "author": "Kam Williams"
    },
    {
      "text": "All in all, a perfectly superior example of industrially fortified Hollywood fun, and as good a guarantee as Doug Liman can offer that we haven't seen the last of him yet.",
      "author": "Geoff Pevere"
    },
    {
      "text": "Groundhog Day re-imagined as a sci-fi war game.",
      "author": "David Edelstein"
    },
    {
      "text": "Finally, a summer movie. Edge of Tomorrow is an engaging and exciting sci-fi film that has a lot of fun with its premise.",
      "author": "Bill Clark"
    },
    {
      "text": "The first two acts are excellent, but the film loses steam as the action slows and the story becomes ever more familiar and less inventive.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "If you like Tom Cruise, then you will like \"Edge of Tomorrow,\" and if you don't like Tom Cruise, then you will like it even more.",
      "author": "Rob Thomas"
    },
    {
      "text": "If you're looking for an action film that's not your standard, brainless excuse for cinematic mayhem, 'Edge of Tomorrow' may just fill the bill. (Full Content Review for Parents also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Tom Cruise might be the only great action movie hero left in this business.",
      "author": "Willie Waffle"
    },
    {
      "text": "Effective, enjoyable, and even funny where it counts, Edge Of Tomorrow lacks the smarts and the gravitas to do its gimmicky premise justice. But, like an exoskeleton-assisted haymaker, it gets the job done.",
      "author": "Michael Leader"
    },
    {
      "text": "The whole thing begins to feel like a giant-screen videogame - with the gamer getting a little further, a little deeper, with each new push of the Start button.",
      "author": "Steven Rea"
    },
    {
      "text": "Tom Cruise is the last movie star, fortunately, he's in Edge of Tomorrow, making it better despite itself.",
      "author": "Tim Cogshell"
    },
    {
      "text": "\"Edge of Tomorrow\" is laced with action and humor; the action coming during the various sequences on the beach, the humor with Cage reliving every day and confounding his fellow soldiers. ...",
      "author": "Bob Bloom"
    },
    {
      "text": "The film utilizes a flurry of fireworks effects and strong character development to create a sci-fi masterpiece.",
      "author": "Brad Miska"
    },
    {
      "text": "With a touch of slick humor, Doug Liman's energetic direction, and a hint of the bizarre, this is easily Cruise's best crack at the genre",
      "author": "Travis Hopson"
    },
    {
      "text": "Proves a summer blockbuster doesn't have to be based on a mainstream comic book or a sequel to be just as exciting, thrilling and entertaining.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Edge of Tomorrow is everything you wish summer blockbusters were - strong, charismatic central performances anchoring excellent FX work in the service of a well-constructed and smart story",
      "author": "Devin Faraci"
    },
    {
      "text": "The perfect summer blockbuster. Funnier than you'd think. Cruise's image is both satirized and celebrated. Blunt is terrific.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Liman deftly plays the rinse-and-repeat familiarity for both us and Cage as comedy and as thriller as needed.",
      "author": "Nell Minow"
    },
    {
      "text": "As for Mr. Cruise and Ms. Blunt, they hold their own in parts that really could have been cast with anyone with a SAG card.",
      "author": "Brandon Judell"
    },
    {
      "text": "[P]lows through any questions we might have about its premise with an almost unstoppable sense of narrative propulsion and a particularly nasty comic hook.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Like many compulsively watchable films, the wealth of details in the writing, direction, and characterization all but ensure that Edge of Tomorrow holds many treasures to be discovered on repeat viewings.",
      "author": "Jason Buchanan"
    },
    {
      "text": "Edge of Tomorrow is the kind of film that can be enjoyed time after time.",
      "author": "Rick Bentley"
    },
    {
      "text": "If you gave Groundhog Day a shot of adrenaline and a trip to the armoury, it might end up looking a little like Edge of Tomorrow.",
      "author": "Chris Knight"
    },
    {
      "text": "The metaphorical overlay of fantasy and history is the best thing Edge of Tomorrow has to offer -- and, for much of its running time, that overlay is enough to lend the movie a shiver of curious power.",
      "author": "Richard Brody"
    },
    {
      "text": "It's a rousing spectacle, interspersed with touching moments of really hard trying.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "In \"Edge of Tomorrow,\" Mr. Liman brings Mr. Cruise's smile out of semiretirement and also gives him the kind of physical challenges at which he so brilliantly excels.",
      "author": "Manohla Dargis"
    },
    {
      "text": "It's a star-driven mass-market entertainment that's smart, exciting and unexpected while not stinting on genre satisfactions.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Refreshing and unexpected, both for its humor and for its upending of action norms.",
      "author": "Ian Buckwalter"
    },
    {
      "text": "A sharp sci-fi thriller that's going to be hard to beat as the summer's best blockbuster.",
      "author": "Peter Howell"
    },
    {
      "text": "It has enough plot density to hold your attention for a while, along with a few feints at character development. You might not much notice its fundamental dishonesty and mendacity, except as that odd sick feeling you have later.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "'Edge Of Tomorrow,' with an intriguing premise and the ability to see it through to a satisfying conclusion, is more than razzle-dazzle visual effects.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Embraces video game logic and gives it a human face and heart, investing it with the numbness and exhaustion that come from running through the same scenario toward the same goal again and again until you get it right.",
      "author": "Alison Willmore"
    },
    {
      "text": "To paraphrase an old dictum: Directors who don't learn from history - like their hapless heroes in sci-fi movies - are doomed to repeat it. But, in [Doug] Liman's case, that has turned out to be not such a bad thing.",
      "author": "Cary Darling"
    },
    {
      "text": "It's the rare action film whose quiet moments cut as deep as its fight scenes.",
      "author": "Keith Phipps"
    },
    {
      "text": "a fun ride that never really arrives anywhere",
      "author": "Laura Clifford"
    },
    {
      "text": "Its mashup of genres proves wildly entertaining.",
      "author": "Tony Stamp"
    },
    {
      "text": "It's fun for a while, but \"Edge of Tomorrow\" is what the GIs used to call a blivet -- 10 pounds of movie in a five-pound bag.",
      "author": "Rafer Guzman"
    },
    {
      "text": "It's a spectacular and witty movie based around a revolutionary idea for its own genre: more than painful, death can actually be pretty boring sometimes.",
      "author": "Anna Tatarska"
    },
    {
      "text": "It shouldn't work. A human-versus-aliens epic that keeps repeating the same scene over and over again as if the comic tilt of Groundhog Day had turned suddenly dangerous. But Edge of Tomorrow will keep you on edge.",
      "author": "Peter Travers"
    },
    {
      "text": "What stays with you are Cruise's off-type performance, a few bravura sequences, and Blunt's molten presence.",
      "author": "Michael Sragow"
    },
    {
      "text": "Takes its Starship Troopers meets Groundhog Day premise and turns it into a rare summer movie that's both smart and a crowd-pleaser",
      "author": "Brad Keefe"
    },
    {
      "text": "A complex sci-fi tale about war, warriors within, and resetting the day.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Edge of Tomorrow is a delicious reminder that Cruise still has all the right moves.",
      "author": "Chase Whale"
    },
    {
      "text": "Edge of Tomorrow is not as inventive as Rian Johnson's time-bending noir, Looper. Nor is it as surprisingly spiritual as Groundhog Day. But it whirls with energy.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "The fact is that this is a pretty good summer-kablooie movie, and Cruise is better than pretty good in it.",
      "author": "Ty Burr"
    },
    {
      "text": "\"Edge of Tomorrow\" repeats itself without being repetitive, takes itself seriously while providing some laughs and offers plenty of action without short-changing us on the intelligence front.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "\"Edge of Tomorrow\" has neither an edge nor a vision of tomorrow that matters today.",
      "author": "Joe Williams"
    },
    {
      "text": "Cruise is a delight, exactly what he needs to be, fluid enough for comedy, physical enough for action, always going with the flow and yet finding ways to make moments memorable.",
      "author": "Mick LaSalle"
    },
    {
      "text": "It feels straight out of a thumb-worn, 1959 issue of Galaxy Magazine, an enjoyably pulpy hunk of military science-fiction with a premise that's part Groundhog Day and part Starship Troopers.",
      "author": "Joe Gross"
    },
    {
      "text": "The film's second half, however, disappoints in many respects.",
      "author": "Steve Davis"
    },
    {
      "text": "This is a movie with a lot on its mind. Perhaps too much.",
      "author": "Stephen Silver"
    },
    {
      "text": "[Cruise] delivers a one-man master class in his own fascinatingly protean screen presence.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Edge of Tomorrow is clever enough that the viewer doesn't have to feel embarrassed sitting in the audience but not so clever that there's no fun to be had.",
      "author": "James Berardinelli"
    },
    {
      "text": "\"Edge of Tomorrow\" is slick, but once its fancy plot dressing takes form, it has little more to offer aside from a few impressive action sequences and the infallible grin of its nimble lead.",
      "author": "Eric Kohn"
    },
    {
      "text": "A surprising and unforgettable adrenaline rush and is so far the summer's best action film.",
      "author": "Justin Craig"
    },
    {
      "text": "A terrific, fast-paced action flick. (Please ignore the terrible title, trailer and ad campaign.)",
      "author": "Clint O'Connor"
    },
    {
      "text": "Edge of Tomorrow isn't without its faults... but those are minor annoyances for a film that proves to be such a satisfying breath of fresh air in a summer packed with sequels.",
      "author": "Jason Zingale"
    },
    {
      "text": "I liked it well enough, but felt like I had seen it before, again and again.",
      "author": "Duane Dudek"
    },
    {
      "text": "It works in both action and humor and deftly handles what could have been an overly complicated story.",
      "author": "Matthew Razak"
    },
    {
      "text": "The rest of the cast has less to do because this is Tom Cruise's movie through-and-through, but they're all given moments of humor, terror or simple eccentricity.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Fast, exciting, surprisingly witty and just plain satisfying..the first really exciting movie of the summer-the most original, the most invigorating and the most entertaining.",
      "author": "Marshall Fine"
    },
    {
      "text": "Moderately engaging, but not up to the level of truly outstanding summer action fare. You could say that it's on the very edge of being a winner.",
      "author": "Frank Swietek"
    },
    {
      "text": "An entertaining version of a video store clerk making a love connection between the boxes for Groundhog Day and Starship Troopers.",
      "author": "Matt Pais"
    },
    {
      "text": "Intriguingly effective and exhilarating, delving into an eternal recurrence.",
      "author": "Susan Granger"
    },
    {
      "text": "I'm not sure \"Edge of Tomorrow\" holds much repeat viewing potential among teenage movie consumers, since the movie's a self-repeating entity to begin with. But once is fun.",
      "author": "Michael Phillips"
    },
    {
      "text": "An entertaining, effects-driven black comedy, with shades of Starship Troopers in its depiction of warfare as a futuristic turkey shoot, the movie is distinguished more by how fluidly it handles its high-concept premise than where it takes it.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "The tag line alone - \"Live. Die. Repeat.\" - guarantees $30 million at least on opening day. It will deserve every penny.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "Is this great art? Of course not. But it's a kick.",
      "author": "Tom Long"
    },
    {
      "text": "The whole thing should go down quite nicely with popcorn. It won't change the course of Cruise's career, but at least it mixes up the formula.",
      "author": "Moira MacDonald"
    },
    {
      "text": "we need more intelligent blockbusters that are based on original properties, and supporting films like Edge is the only way to get them. Or don't see it - but don't whine to me when you have to sit through Transformers 10.",
      "author": "Adam Ross"
    },
    {
      "text": "Now that's an action movie.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Edge of Tomorrow is clever and even poignant during its first two-thirds.",
      "author": "Josh Bell"
    },
    {
      "text": "A fairly eye-popping futuristic war story with a clever (to a point) structure.",
      "author": "Peter Canavese"
    },
    {
      "text": "The sharp script makes ineffectual carnage pretty hilarious, with laughter due in part to the fact we've seen so much of Tom Cruise in BS battle mode there's something cathartic about watching him die on a loop.",
      "author": "Sara Maria Vizcarrondo"
    },
    {
      "text": "Terrific. Best of the summer. Cruise oozes charisma and has real chemistry with Blunt.",
      "author": "Victoria Alexander"
    },
    {
      "text": "Technically handsome, but approximately as deep and lasting as a small parking-lot puddle.",
      "author": "Dustin Putman"
    },
    {
      "text": "Walks a tricky tightrope: We chuckle when Rita shoots Cage like a fallen racehorse so the day can restart, but every time he jolts back to life we feel for his gulping, startled agony.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Liman is a true master of the genre, and with Cruise and Blunt standing in the crosshairs of the viewfinder, Edge of Tomorrow not only works as pure escapism, it feels like a first-class ticket.",
      "author": "Katherine Monk"
    },
    {
      "text": "Think \"Groundhog Day,\" but more serious and with a sci-fi motif, and you'll get the idea of \"Edge of Tomorrow.\"",
      "author": "Mal Vincent"
    },
    {
      "text": "Long before the end, it's an old-fashioned high tech army fighting the Mimics, who are as spirited and pretty as Blunt. The combat is endless and predictable.",
      "author": "David Thomson"
    },
    {
      "text": "Edge of Tomorrow profits by upending action film cliches.",
      "author": "Craig Mathieson"
    },
    {
      "text": "Only toward the climax, when the live/die/repeat cycle is abandoned, does Edge of Tomorrow go logy. But it's two-thirds of a sensational ride -- one you can ride over and over without buying additional tickets.",
      "author": "Richard Corliss"
    },
    {
      "text": "Writer Christopher McQuarrie handles the concept with aplomb, and he knows that the real interest here is what effect this kind of life would have on human relationships.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Groundhog D-Day, or the reborn identity: Don't we all want a furious, jumbled intelligence like Doug Liman's to fashion memorable pop? Tom Cruise's every-doofus character is a great mid-career role for him, since it's briskly business.",
      "author": "Ray Pride"
    },
    {
      "text": "The pulse-pounding action scenes are briskly directed by Doug Liman.",
      "author": "Claudia Puig"
    },
    {
      "text": "Despite its terribly unimaginative title, Edge of Tomorrow is a surprisingly imaginative summer action movie.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "A Tom Cruise action flick with a strong female heroine and a sense of humor? \"Edge of Tomorrow'' has both of those, plus a \"Groundhog Day''-style gimmick that pays big dividends. Over and over.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Will Groundhog Day work in a space invaders movie?",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Its recursive conceit often seems poised to devolve into a cheap gimmick, but, much like Cage, it consistently makes slight course corrections that keep it feeling fresh.",
      "author": "Michael Nordine"
    },
    {
      "text": "Edge Of Tomorrow is an entertaining alien invasion movie with neat narrative wrinkles and glancing references to some classic SF-action films.",
      "author": "Philippa Hawker"
    },
    {
      "text": "Liman stages the chaotic action scenes, including several iterations of the beach assault, with clarity, precision, and wit. This is his best movie since 2002's \"The Bourne Identity.\"",
      "author": "Marc Mohan"
    },
    {
      "text": "Liman and his screenwriters - Christopher McQuarrie (\"The Usual Suspects\") and Jez and John-Henry Butterworth (\"Fair Game\") - make their concept feel fresh with smart setups and ambitious (if underdeveloped) themes.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "Tom Cruise's participation transmutes, as it always does, everything around him, turning the movie's series of false starts, dead ends, and hard lessons into a working metaphor for his own career.",
      "author": "Eric Henderson"
    },
    {
      "text": "..a thoughtful, action-packed, and occasionally amusing take on the [time loop] premise melded into the alien invasion story. For summer entertainment, it will more than do.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "A frenetic burst of energy that thrills and enthrals while carrying zero baggage",
      "author": "Cameron Williams"
    },
    {
      "text": "Yes, Tom Cruise's time trippy sci-fi-er is the best surprise of the summer.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Even if the war sequences lean a bit too heavily on Saving Private Ryan-style chaos and the Mimics never blossom beyond generic extraterrestrial monsters, Liman's approach proves more than efficient for a pulse-pounding thrill ride.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "Liman eschews the not-so-subtle \"we're-killing-our-planet\" message of similar films to let his movie progress without preaching. Edge of Tomorrow manages to keep us interested while not insulting our intelligence.",
      "author": "Tony Hicks"
    },
    {
      "text": "Among countless sequels and remakes, the high-concept Edge of Tomorrow is the right kind of a rerun.",
      "author": "Jake Coyle"
    },
    {
      "text": "Unlike many of the year's big-bang movies so far, it probably won't linger long in the memory. But then, not being any part of a larger franchise, it doesn't need to.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "One of the most enjoyable blockbusters of the year.",
      "author": "Stephen Lambrechts"
    },
    {
      "text": "I bet this ends up being the most well-executed action movie of this summer, and probably a few others.",
      "author": "Will Leitch"
    },
    {
      "text": "It'd be easy to dismiss Edge of Tomorrow as just another blunt-force summer movie, but it's sharp as a scalpel in the deft hands of its makers, with the kind of smarts, wit, filmmaking and force too many other summer films can only dream of.",
      "author": "James Rocchi"
    },
    {
      "text": "Like Cruise himself at this stage of his career, the film's concept ought to be played-out and obvious, but \"Edge of Tomorrow\" is much smarter and sharper than you'd expect.",
      "author": "Tim Grierson"
    },
    {
      "text": "It's also knows, like 'Eyes Wide Shut' before it, that it's always a joy to make the cocksure [Tom] Cruise nervous.",
      "author": "Matt Prigge"
    },
    {
      "text": "[VIDEO ESSAY] All high-concept, but affording only minimal entertainment reward by way of its stale ghost-in-the-machine storyline, \"Edge of Tomorrow\" is the \"Groundhog Day\" of sci-fi movies.",
      "author": "Cole Smithey"
    },
    {
      "text": "What do you get if you cross a big-budget humanity-vs-aliens action movie with Groundhog Day? Well, a wittier, more inventive and, paradoxically, a far less repetitive film than any number of others.",
      "author": "Laurence Phelan"
    },
    {
      "text": "At its best, Edge Of Tomorrow has the same fatalistic humour that characterised Groundhog Day. At its worst, it is both repetitive and plain ridiculous.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "This is a film that feels fully in command of its high concept and credit for this must also go to the film's editors, and the unusually witty and deft script.",
      "author": "Alistair Harkness"
    },
    {
      "text": "This Doug Liman directed feature is a cut above the usual in terms of cerebral content, but it's still difficult to imagine it appearing on Mensa must-see lists any day soon.",
      "author": "Padraic McKiernan"
    },
    {
      "text": "Somehow now 51 years old, the ever-youthful Tom Cruise is the ultimate A-list Hollywood battler -- he keeps coming back for more again and again and again.",
      "author": "Graham Young"
    },
    {
      "text": "The film's Groundhog Day-meets-Independence Day plot is actually pretty genius.",
      "author": "Cath Clarke"
    },
    {
      "text": "Doug Liman's half-inventive 'Full Metal Alien Groundhog Day' war film is buoyed at first by Tom Cruise's rascally twinkle before falling back on shopworn battle-bot effects and videogame plotting.",
      "author": "Chris Barsanti"
    },
    {
      "text": "'Groundhog Day Meets Alien.' Relatively good compared to Cruise's recent, unwatchable movies because Liman orchestrates spectacular action; the talking scenes are tiresome.",
      "author": "Caryn James"
    },
    {
      "text": "Because Edge of Tomorrow is effectively about the infinite refloggability of cinematic horses, it manages to break the chain of formulaic repetition and come out surprisingly fresh.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Now if only we could find Tom a leading lady his own age...",
      "author": "Ed Whitfield"
    },
    {
      "text": "Doug Liman's Edge of Tomorrow is the sci-fi answer to Groundhog Day that Source Code tried to be.",
      "author": "Blake Howard"
    },
    {
      "text": "Earns the right to be Groundhog Day meets Starship Troopers with a clever story that uses the narrative device in new ways.",
      "author": "Fred Topel"
    },
    {
      "text": "Thanks to brisk direction from Doug Liman and some clever plotting, said repetition never becomes predictable.",
      "author": "Chris Tilly"
    },
    {
      "text": "With Edge of Tomorrow, Tom Cruise proves he's still got the action and acting chops to carry a summer blockbuster, plus the eye for a quality role that's more than just guns-blazing, balls-out action.",
      "author": "Doug Whelan"
    },
    {
      "text": "A witty, clever, character-driven bit of science fiction wonderfulness, full of suspense, surprise, tension, and an unexpected poignancy.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Um filme intrigante com boas sequncias de ao, mas que desaponta no terceiro ato.",
      "author": "Pablo Villaça"
    },
    {
      "text": "A smarter-than-expected script turns this noisy sci-fi action movie into something remarkably entertaining.",
      "author": "Rich Cline"
    },
    {
      "text": "At its best, Edge Of Tomorrow is a cross between Groundhog Day and Saving Private Ryan, even enjoying a little of the former's humour and the latter's intensity.",
      "author": "Dave Bradley"
    },
    {
      "text": "What a delight it is to discover an early-summer action picture whose plot is something more than a machine to generate eventual digital mayhem.",
      "author": "Donald Clarke"
    },
    {
      "text": "This summer blockbuster is almost ready to conquer the world. But not quite.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "What we have here is a blockbuster with brains, and explicit references to the Normandy landings of the Second World War are both knowing and well done.",
      "author": "David Edwards"
    },
    {
      "text": "The idea of history repeating itself is already writ large, here, but what isn't so familiar is the casting of Tom Cruise as a coward.",
      "author": "Stella Papamichael"
    },
    {
      "text": "Foibles be damned, Edge of Tomorrow is mindless fun of the highest order.",
      "author": "Dominic Mill"
    },
    {
      "text": "It is a pretty exciting, Twilight Zone-style premise that Bourne Identity director Doug Liman introduces with brisk efficiency and sustains through twists and turns that are often ingenious.",
      "author": "Allan Hunter"
    },
    {
      "text": "It's taut, twisted and blackly funny in ways that only movies in which Tom Cruise gets crushed under the wheel of a truck can be.",
      "author": "Ali Gray"
    },
    {
      "text": "It is basically deadly serious, and after some moderate knockaboutfun, settles into something pretty dull. Where's the edge?",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Liman handles his high concept conceit with some particularly dynamic visual touches, while Cruise and Blunt bring energy to their roles.",
      "author": "Josh Slater-Williams"
    },
    {
      "text": "High concept action flicks largely live or die by the third act denouement (something that killed off Liman's last blockbuster effort Jumper). No such problems here.",
      "author": "Rich Phippen"
    },
    {
      "text": "Tom Cruise plays a callow, bumptious twerp in early scenes of the sci-fi adventure fantasy Edge of Tomorrow. He is very good: let's be nice and call it a stretch.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Thank heavens ... for the time-loop gimmick, which sustains a full hour of screen time with enough variations on its gambit to hook you in.",
      "author": "Tim Robey"
    },
    {
      "text": "Cruise and Blunt are both superb, the action sequences are genuinely thrilling and the effects work is impressive throughout.",
      "author": "Matthew Turner"
    },
    {
      "text": "A fresh premise, engaging chemistry and incredible sci-fi action make it the surprise movie of the summer.",
      "author": "Mark Ellis"
    },
    {
      "text": "It's \"Aliens\" meets \"Groundhog Day\" meets \"Starship Troopers\" meets \"Source Code\", and each of those films' best traits are expertly deployed into \"Edge of Tomorrow\".",
      "author": "Kristian Harloff"
    },
    {
      "text": "Edge of Tomorrow leaps onto the summer-movie playing field with ferocious tenacity, expertly balancing large-scale action with humor, tension, courage and the kind of flawed heroes you really grow to invest in.",
      "author": "Erik Davis"
    },
    {
      "text": "It's a blockbuster with brains, and when it's over, you might find yourself in a time loop of your own -- one where you can't wait to see it over and over again.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "An audacious concept, superbly executed, this grand scale sci-fi thriller will knock your socks off, combining knee-knocking tension with exhilarating action and a sense of humour.",
      "author": "Louise Keller"
    },
    {
      "text": "There's imagination, spectacle and thrills to spare. There's a freshness here too that comes not only from the structure, but from Edge Of Tomorrow being a shiny new property in this cyclical age of sequels, prequels and spin-offs",
      "author": "Jamie Graham"
    },
    {
      "text": "A playful and frantic science-fiction twister which mimics the best (Aliens, The Matrix, Groundhog Day) while offering something fresh and - most importantly - thrilling.",
      "author": "Dan Jolin"
    },
    {
      "text": "Is it possible we owe Tom Cruise a collective apology?",
      "author": "Jim Slotek"
    },
    {
      "text": "Witty, clever, thrilling - it could easily turn out to be the blockbuster of the year.",
      "author": "Andy Lea"
    },
    {
      "text": "The best action movie of the summer ... combining its innovative sci-fi premise with the type of high-gauged action James Cameron delivers so effortlessly.",
      "author": "Edward Douglas"
    },
    {
      "text": "This, ladies and gentleman, is what we call a summer blockbuster.",
      "author": "Jack Giroux"
    },
    {
      "text": "\"It's a razzle-dazzle triumph, and one we can't wait to experience again and again and again...\"",
      "author": "Drew Taylor"
    },
    {
      "text": "Feels sharper and more clever than it might have been in other hands, and for a big summer star vehicle, that's surprise enough.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Although the humor helps, the Groundhog Day-like repetition gets tedious; it makes you feel more like a hamster than a groundhog - or rather a hamster's wheel, going round and round, over and over again.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Tom Cruise stars in this cleverly crafted and propulsively executed sci-fi thriller about a soldier forced to relive the same day over and over again.",
      "author": "Justin Chang"
    },
    {
      "text": "Edge of Tomorrow will leave you breathless and grinning. Simply put, this is why we go to the movies.",
      "author": "Kristy Puchko"
    },
    {
      "text": "A nicely assembled sci-fi film that is breezily exciting if never intellectually challenging.",
      "author": "Mark Adams"
    },
    {
      "text": "Edge of Tomorrow remains as an unadulterated, captivating thriller, which revels in being such unreservedly good fun.",
      "author": "Stefan Pape"
    }
  ],
  "release_year": 2014,
  "duration": 113,
  "genres": [
    "Sci-Fi",
    "Action",
    "Adventure"
  ],
  "age_rating": "PG-13",
  "synopsis": "When Earth falls under attack from invincible aliens, no military unit in the world is able to beat them. Maj. William Cage (Tom Cruise), an officer who has never seen combat, is assigned to a suicide mission. Killed within moments, Cage finds himself thrown into a time loop, in which he relives the same brutal fight -- and his death -- over and over again. However, Cage's fighting skills improve with each encore, bringing him and a comrade (Emily Blunt) ever closer to defeating the aliens.",
  "popularity": 9.0,
  "poster_url": "https://image.tmdb.org/t/p/original/uUHvlkLavotfGsNtosDy8ShsIYF.jpg"
}