{
  "movie_name": "Edward Scissorhands",
  "movie_id": "edward_scissorhands",
  "total_reviews": 51,
  "reviews": [
    {
      "text": "With equal portions of humor and heart, this inventive, touching, poetic fairy tale is highly memorable.",
      "author": "Mike Massie"
    },
    {
      "text": "For a guy who has made some really great movies, this is very much one of Burton’s best and most heart-wrenching.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The finale packs an unforgettable emotional wallop, assisted by Danny Elfman's gloriously magical score.",
      "author": "Alan Jones"
    },
    {
      "text": "This is one of Burton’s best and it’s one of aesthetic power and emotional resonance. It’s a magical odyssey of invention and human emotion, with a distinguishable tone and look. \nThis one is for the weirdos.",
      "author": "Kristy Strouse"
    },
    {
      "text": "Tim Burton's most iconic film is a fairy tale about the way art is used to reflect on both traditional society and the artist's inability to fit into it.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "... this paean to misfit outcasts and misunderstood artists is ultimately a magical and melancholy fairy tale for the modern world.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Burton was clearly in line with a poetic atmosphere but it escapes him in the end. [Full review in Spanish]",
      "author": "Rene Jordan"
    },
    {
      "text": "It looks and feels original and new; startling, yet at the same time comforting.",
      "author": "Michael Bronski"
    },
    {
      "text": "Edward Scissorhands is a flashy and entertaining apologia from an artist who has not accumulated enough work to justify such self-concern.",
      "author": "Henry Sheehan"
    },
    {
      "text": "The highest praise must be reserved for Mr. Depp, who, as the hero, manages to evince a gentle charm in spite of being encrusted with several ounces of make-up.",
      "author": "Quentin Crisp"
    },
    {
      "text": "Long a courageous actor, Depp inhabits a character that by all accounts should have been a freak or caricature.",
      "author": "Richard Propes"
    },
    {
      "text": "One-of-a-kind fairytale for adults from director Tim Burton.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Watching the film is like turning the pages of a small child's book which has very pretty pictures and two lines of large print spelling out the story.",
      "author": "Harriet Waugh"
    },
    {
      "text": "With Burton's surreal illustrative ingenuity, Depp and Ryder's career-making performances, and a story filled with simplicity, complexity, and intangible wizardry that stands the test of time, Edward Scissorhands is one of the greatest films ever made.",
      "author": "Alex Arabian"
    },
    {
      "text": "Depp cuts a haunting figure, while Wiest is typically excellent. The rest of the actors are forced to play characters who are either underdeveloped or overcooked, and the broadness of Burton's approach eventually leads to a wholly unsatisfying resolution.",
      "author": "Matt Brunson"
    },
    {
      "text": "Burton's modern fairytale has an almost palpably personal feel: it is told gently, subtly and with infinite sympathy for an outsider who charms the locals but then inadvertently arouses their baser instincts.",
      "author": "Marc Lee"
    },
    {
      "text": "Between this masterpiece and that other Ed (Wood), TIm Burton and Johnny Depp are at their dual-career best. Ed Wood is about how insane Hollywood is -- and Edward Scissorhands delivers the pure magic that, once in a rare while, escapes the place.",
      "author": "Gregory Weinkauf"
    },
    {
      "text": "...perhaps the cinema's most enchanting parable about the misunderstood and alienated artist.",
      "author": "Josh Larsen"
    },
    {
      "text": "... this sweet 1990 fantasy ... for the first time crystallized the latent themes in the director's work: the notion of the artist as outsider, of skills that make one special but at the same time different.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "An original movie, though not Tim Burton's best.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "A delightful and delicate comic fable.",
      "author": "Variety Staff"
    },
    {
      "text": "Fine performances all around, particularly from Depp and the immensely sympathetic Wiest.",
      "author": null
    },
    {
      "text": "It's visually pleasing and an easy film to like, even if it never gets out of shallow water as far as its story goes.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "[Burton and Depp] seem to bring out the best in each other.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Burton's movies are fairytales for retarding evolution.",
      "author": "Walter Chaw"
    },
    {
      "text": "His gothic tones always mask a feeling of wonder and an endearing love for everything that is possible in life and death",
      "author": "Chris Cabin"
    },
    {
      "text": "Burton's sweet Gothic fairy tale has lost none of its charm.",
      "author": "Rob Vaux"
    },
    {
      "text": "Johnny Depp and Tim Burton in magical collaboration.",
      "author": "John Wirt"
    },
    {
      "text": "A personal film for Tim Burton, which also serves as a parable about the artist as an outsider, this lovely fairytale began the long, fruitful collaboration with the endlessly versatile Johnny Depp.",
      "author": "Emanuel Levy"
    },
    {
      "text": "Moody and bizarre modern fairytale that works on a number of levels.",
      "author": "James Plath"
    },
    {
      "text": "Definitely one of Burton's masterpieces, maybe THE one.",
      "author": "Steve Crum"
    },
    {
      "text": "A modern fairy tale about a deformed outsider whose innocence and gentle nature make him a freak in the eyes of the community he visits.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "A poetic outing by Burton with Depp offering one of his initial outsider performances. Still fun to watch.",
      "author": "Bob Bloom"
    },
    {
      "text": "Mr. Burton invests awe-inspiring ingenuity into the process of reinventing something very small.",
      "author": "Janet Maslin"
    },
    {
      "text": "Especially rewarding for those who would like to see something different in a film.",
      "author": "Robert Roten"
    },
    {
      "text": "A charming, utterly original fable with a darkness that would be surprising in a mainstream release were it not the work of Tim Burton.",
      "author": "Nick Davis"
    },
    {
      "text": "Tim Burton's finest achievement. It has an emotional wallop to go with his visual wizardry.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Probably Tim Burton's best film. Certainly his most moving.",
      "author": "Ken Hanke"
    },
    {
      "text": "Burton's richly entertaining update of the Frankenstein story is the year's most comic, romantic and haunting film fantasy.",
      "author": "Peter Travers"
    },
    {
      "text": "Enchantment on the cutting edge, a dark yet heartfelt portrait of the artist as a young mannequin.",
      "author": "Rita Kempley"
    },
    {
      "text": "Johnny Depp is excellent as the Chaplinesque title character and the support cast is good too.",
      "author": "James O'Ehley"
    },
    {
      "text": "Burton has a good central premise working here, but he never really grabs us...",
      "author": "John J. Puccio"
    },
    {
      "text": "One of my favorite films ... and one that touches me deeply.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "An engaging film, one which falls early in director Tim Burton's career, helping to highlight a remarkable decade's run of moody, quirky and goofy films.",
      "author": "Dan Jardine"
    },
    {
      "text": "Tim Burton and Johnny Depp come close to achieving perfection in this dream tale.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Depp is perfectly cast, Burton builds a surrealistically funny cul-de-sac world, and there are some very funny performances from grownups Dianne Wiest, Kathy Baker and Alan Arkin.",
      "author": "Desson Thomson"
    },
    {
      "text": "Burton has not yet found the storytelling and character-building strength to go along with his pictorial flair.",
      "author": "Roger Ebert"
    },
    {
      "text": "Edward Scissorhands is quite a surprise, an utterly enchanting fairy tale.",
      "author": "Chris Hicks"
    },
    {
      "text": "Burton has finally found the magic.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "The film has an unapologetically adolescent purity about it that transcends what would ordinarily be the shortcomings of its script.",
      "author": "John Hartl"
    },
    {
      "text": "The romanticism has a personal dimension -- for Edward is, of course, Burton's surreal portrait of himself as an artist: a wounded child converting his private darkness into outlandish pop visions. Like Edward, he finds the light.",
      "author": "Owen Gleiberman"
    }
  ],
  "release_year": 1990,
  "duration": 105,
  "genres": [
    "Holiday",
    "Fantasy",
    "Comedy",
    "Drama",
    "Romance"
  ],
  "age_rating": "PG-13",
  "synopsis": "A scientist (Vincent Price) builds an animated human being -- the gentle Edward (Johnny Depp). The scientist dies before he can finish assembling Edward, though, leaving the young man with a freakish appearance accentuated by the scissor blades he has instead of hands. Loving suburban saleswoman Peg (Dianne Wiest) discovers Edward and takes him home, where he falls for Peg's teen daughter (Winona Ryder). However, despite his kindness and artistic talent, Edward's hands make him an outcast.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/e0FqKFvGPdQNWG8tF9cZBtev9Em.jpg"
}