{
  "movie_name": "Encanto",
  "movie_id": "encanto_2021",
  "total_reviews": 210,
  "reviews": [
    {
      "text": "Story of a magical house and family in Colombia is a glorious celebration of kindness and everyday life - and Lin-Manuel Miranda's Latin rhythms will get you on your feet.",
      "author": "Francesca Steele"
    },
    {
      "text": "One of Disney's most magical animated movies yet",
      "author": "Zach Pope"
    },
    {
      "text": "A heartfelt watch that families will undoubtedly latch onto.",
      "author": "Emma-Jane Betts"
    },
    {
      "text": "To cap it all off, the story by Jared Bush, Bryon Howard, and Charise Castro Smith focuses on empathy perfectly. It’s a wonderful watch for the whole family.",
      "author": "Benjamin Wiebe"
    },
    {
      "text": "What makes this particular instalment of Disney dream-weaving a little bit different is texture. Pulling from a colourful Central American tradition that features brilliant cotton and woollen embroidery, we can almost feel the threads of every garment...",
      "author": "Katherine Monk"
    },
    {
      "text": "By exploring the traditional and non-traditional nature of family, their most common modern go-to theme, they keep connected to their familiar and beloved roots while taking audiences on unfamiliar journeys.",
      "author": "Wesley Lovell"
    },
    {
      "text": "It is in its overall focus that Encanto grasps at richer themes about how the family's magic is only part of what defines them.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "Absolutely a must if you’re into this sort of thing, and it’s a very easy, engaging sit even if you aren’t.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The screenplay has dark undertones, as all good magic realism does, but this is rooted in the troubled social history of Columbia.",
      "author": "Cris Kennedy"
    },
    {
      "text": "Encanto is one of the most aesthetically arresting and epically emotional animated features of the year, complete with a cast of colorful and captivating characters who are sure to become new fan favorites.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "Vibrant, rich, tender, sincere and lively.",
      "author": "Sarah Ward"
    },
    {
      "text": "A fun and dazzling musical adventure that celebrates the power of familia.",
      "author": "Nestor Bentancor"
    },
    {
      "text": "At its best when it's intimate and warm, Encanto's fast-paced adventure sequences and rampant physical comedy can be hit or miss. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "An impactful view of generational trauma told through impeccable songs, beautiful animation, and a moving story.",
      "author": "Rosa Parra"
    },
    {
      "text": "ENCANTO is a visually stunning animated film with wonderful songs and score, a deep, resonating emotional core and just a very positive, charming vibe to it.",
      "author": "Jimmy Cage"
    },
    {
      "text": "Love the music and the cultural urgency and accuracy of Encanto. The richness, poetry, [and] resiliance of the Colombian culture... makes Encanto such a refreshing thrill.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Encanto is a Disney film that delights without smashing expectations. Its easy to forget that the target audience for this genre are simply interested in fun and wonder, something that this movie delivers in spades.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Gorgeously animated, relatable narrative, and admirable themes!",
      "author": "Jason Escamilla"
    },
    {
      "text": "\"A spirit of communal celebration persists even after a first-act ceremony takes a turn for the ominous, and fleeting moments of chisme between cousins provide the movies breakneck pacing with instantly relatable doses of Latino-family bonding.\"",
      "author": "David Lynch"
    },
    {
      "text": "Surface Pressure unlocked the movie for me and made it more compelling than what I thought it would be - the inevitable discovery of Mirabel's gift... it's a discovery borne out of a family's denial.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "Disney deserves some credit for abandoning its typical formula with Encanto. You wont see a princess sing songs about personal actualization. The film celebrates community and doesnt even have a villain.",
      "author": "Collin Garbarino"
    },
    {
      "text": "Bright, lively, and touching, Disney’s Encanto offers heaps of musical fun.",
      "author": "Sameen Amer"
    },
    {
      "text": "That candle doesnt just provide magic to the family...It also has enough to fuel this movie to become absolutely magical.",
      "author": "Mat Brunet"
    },
    {
      "text": "Encanto boasts two standout musical numbers...",
      "author": "Josh Larsen"
    },
    {
      "text": "Many Latines will be able to connect because, while Encanto isnt an accurate or perfect representation of Colombian culture specifically, it encompasses the foundation of our cultures that brings us together.",
      "author": "Josie Meléndez"
    },
    {
      "text": "Children will be entertained by the younger characters and creatures, and families will appreciate the strong, emotional moments. Encanto is not an animated masterpiece, but it has enough unique flourishes to avoid mediocrity.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "Encanto isnt anything you havent seen before, but it succeeds in its gratifying execution.",
      "author": "Jeff Nelson"
    },
    {
      "text": "Feisty, funny, vulnerable and brave, Mirabel is a terrific Disney heroine, and her adventures will remind animation fans of Moana and Braves Merida, and she is just as likeable and enjoyable to watch as they both are.",
      "author": "Jo Berry"
    },
    {
      "text": "Come for the culture and songs, but stay for everything else.",
      "author": "Matt Neal"
    },
    {
      "text": "With its Lin Manuel Miranda songs topping the music chartseveryone is dancing to Brunothe time is now to see this burst of animated family enchantment.  Miranda gives this Oscar favorite a heart that sings and a spirit that soars.",
      "author": "Peter Travers"
    },
    {
      "text": "This pseudo fairy tale doesn't adhere to the rules of true fairy tales: such as there must be evil, which must be overcome, and there's no gaining something for nothing. Such subtle moral rudderlessness isn't maybe the best use of small children's time.",
      "author": "Mark Jackson"
    },
    {
      "text": "The dazzling craftsmanship on display in every aspect of the film...makes Encanto a feel-good hit that delivers a hefty emotional wallop when you least expect it.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "The story is thin, but the musical contributions from Lin Manuel Miranda are genuinely emotional.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "Encanto turns the magic on its head, teaching the Madrigals and the audience a valuable lesson in familial communication.",
      "author": "Adonis Gonzalez"
    },
    {
      "text": "... Encanto beautifully carries on a new tradition of containing multitudes, enabling the stories to challenge as they entertain.",
      "author": "Douglas Davidson"
    },
    {
      "text": "An animated film told with good intentions and a heart of magical realism. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "A beautiful story of family and community, letting go of societal and familial pressures, and just being yourself. Simple in the most pure and meaningful way.",
      "author": "Kristen Maldonado"
    },
    {
      "text": "With a vibrant score suggesting hidden dangers which never materialize, the final cut feels undercut. It's as if a more exciting story was muted to make room for too much of the family ensemble until it's all that remained...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "A vibrant story full of color, music and magic that explores the true meaning of family and celebrates each others' differences. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "To some degree, characters in these stories are empowered by overcoming trauma. But you could also see the trauma as creating or inspiring the empowerment.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Encanto is thoroughly enjoyable, witty and intelligent, robust in its multigenerational appeal.",
      "author": "John Serba"
    },
    {
      "text": "Like the Madrigals, we're each trying to deal with all this alone - and realizing, perhaps through projects like Encanto, that maybe we don't have to.",
      "author": "José María Luna"
    },
    {
      "text": "Honors Latinx families... The film doesn't portray our big, multigenerational, multiracial families as perfect or idealized. Rather, it asks us to be better.",
      "author": "Cristina Escobar"
    },
    {
      "text": "With their 60th animated feature, Disney takes us on a vibrant and magical trip to Colombia in Encanto to provide fun that the whole family can enjoy.",
      "author": "Danielle Solzman"
    },
    {
      "text": "[It] would appear to be an ideal follow-up to the studio's megahit girl-power production Frozen. This endearing, digitally animated feature actually owes more to an earlier superpowered family fantasy, The Incredibles.",
      "author": "Dann Gire"
    },
    {
      "text": "An average animated movie but the songs by Lin Manuel Miranda make it special.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "A fantastic journey that will delight young and old. [Full review in Spanish]",
      "author": "Laura Hiros"
    },
    {
      "text": "A thoroughly charming and fun fantasy adventure, one well worth catching on the big screen if you get the chance.",
      "author": "Travis Johnson"
    },
    {
      "text": "It's a shame that [the film] is occasionally overpowered by kitsch near the end, but it doesn't change the fundamentally positive state of mind that one takes away from Encanto. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Encanto isn't anything particularly special when it comes to the music. However, the plot and how it handles being treated like an outsider by your own family is going to hit some people much harder than others.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Directed by Jared Bush and Bryan Howard, Encanto sends all the right messages and does so with color and song.",
      "author": "Martha K. Baker"
    },
    {
      "text": "With amazing visuals, a stellar story, and a great soundtrack, Encanto is one of the best animated films Disney has recently put out.",
      "author": "Garrett Green"
    },
    {
      "text": "There is a strong element of \"Beauty and the Beast (1991)\" in \"Encanto\" with its magical house in danger of being destroyed - remember Beast was in danger of dying and his magic castle disappearing.",
      "author": "Robin Clifford"
    },
    {
      "text": "A deluge of clever, brightly coloured images and bouncy songs.",
      "author": "Edward Porter"
    },
    {
      "text": "Encanto is a sweet and culturally thoughtful animated adventure...Its focus on family dynamics - positive and not-so-positive alike - give it a sense of universality to which most audiences will relate.",
      "author": "Allen Adams"
    },
    {
      "text": "The studio's best proposition in more than five years. [Full review in Spanish]",
      "author": "Adrián Carande"
    },
    {
      "text": "Colorful settings, catchy songs, and a gallery of secondary characters that surround the protagonist... make the film a seemly topic. [Full review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "Provides a plethora of movement, bold colors... catchy songs and musical numbers that in many cases had the contribution of the prolific Lin-Manuel Miranda, who seems to be a part of any project that addresses a Latin theme. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Right away, there are too many human characters here and not enough jokes. But in most departments -- even including Lin-Michael Miranda's earnest songs -- the craft is at the level expected from a no-expense-spared Disney production.",
      "author": "Jake Wilson"
    },
    {
      "text": "Encanto feels like a smaller, more intimate story for Disney. Don't expect it to be the grand epic like Frozen, Raya and the Last Dragon or Beauty and the Beast.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "A quirky, beautifully animated film that's a terrific vehicle for not only expressing heritage-specific customs, but also opening doors to a new world.",
      "author": "Louisa Moore"
    },
    {
      "text": "Encanto certainly stands out among the recent crop of Disney Animation Studios' work.",
      "author": "Steven Prokopy"
    },
    {
      "text": "It's a modest, mostly charming diversion that embraces compassion, community, and yes -- a little bit of enchantment.",
      "author": "Luke Goodsell"
    },
    {
      "text": "In the end, I think the many positives of this movie outweigh its lack of focus.",
      "author": "Robert Roten"
    },
    {
      "text": "The images' exuberance of the, the characters' colors and vitality bestows an almost irresistible visual framework. [Full review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "Encanto's absolute perfection and (magical) hyper-realism leaves us speechless,... with something apparently as insignificant as the movement of a skirt. [Full review in Spanish]",
      "author": "Fausto Fernandez"
    },
    {
      "text": "The animation is strong and if there was an Academy Award for best animated hair, Encanto would win it. But it's too busy, its storyline too aimless, to satisfy anyone for long.",
      "author": "Paul Whitington"
    },
    {
      "text": "Nice to look at in places, witty where it has to be, but Encanto feels a bit cobbled together.",
      "author": "Hilary A White"
    },
    {
      "text": "One of the best films of 2021. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "It's gorgeously designed and rendered to a very high standard, flooding the screen with colours and textures, as well as some wondrously cinematic set-pieces.",
      "author": "Rich Cline"
    },
    {
      "text": "Fun and enjoyment for all ages. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "You will be humming 'Welcome to the Family Madrigal' -- expositional but infectious -- all the way home. The characters are infectious, too, and well-drawn, enriching Encanto's world with gifts that extend far beyond their bestowed powers.",
      "author": "Whelan Barzey"
    },
    {
      "text": "Encanto triumphs. [Full review in Spanish]",
      "author": "Antonio G. Spíndola"
    },
    {
      "text": "This is a well-oiled machine for better and worse-one that should delight audiences regardless of how fleeting the memory ultimately becomes.",
      "author": "Jared Mobarak"
    },
    {
      "text": "\"Encanto\" may adhere to a well-worn formula but its message couldn't be more timely.",
      "author": "Charles Koplinski"
    },
    {
      "text": "It's beautiful to look at, the animation is first-class, it's full of lovely songs and quirky characters and magic, with positive messaging about family values and being yourself but, to be honest, the latest offering from Disney is a bit of a bore.",
      "author": "Jim Schembri"
    },
    {
      "text": "Even by the fallen (and falling!) standards of contemporary Disney, this has an amazingly broken story.",
      "author": "Tim Brayton"
    },
    {
      "text": "The result here is an enchanting Colombian tale that's suitable for the whole family.",
      "author": "James Croot"
    },
    {
      "text": "A warm and wonderful offering that speaks truthfully and respectfully to its target audience.",
      "author": "Peter Gray"
    },
    {
      "text": "This is all rendered absolutely beautifully, with the most impressive color palette of any animated movie in memory.",
      "author": "Stephen Silver"
    },
    {
      "text": "There's more than a little \"Beauty and the Beast\" in \"Encanto,\" from its glasses wearing heroine to a magical abode fueled by magic (a rose under glass for \"Beast,\" a candle here).",
      "author": "Laura Clifford"
    },
    {
      "text": "It's a little trite and hackneyed... But what distinguishes this film somewhat is a delightful weird streak.",
      "author": "Christy Lemire"
    },
    {
      "text": "It plays like a mashup of Frozen and Coco that's trying a little too hard.",
      "author": "Charles Solomon"
    },
    {
      "text": "A bright, lively and heart-felt slice of Disney Magic. The studio delivers another fantastic cultural exploration, with great messages morals and themes.",
      "author": "Dave Lee"
    },
    {
      "text": "Visually, the film is stunning, with the characters and settings ranging from luscious to comic and back again.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "An enchanting wonder with a big beating heart and sublime visuals, Encanto is a beautiful creation.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A smiling tale about familial reconciliation and learning to see your relatives for who they are rather than who you wish they were is never unwelcome.",
      "author": "Christian Holub"
    },
    {
      "text": "There is enough heart and spirit to distinguish Encanto from the [Disney] catalogue, with the animated adventure setting itself up to be a rich appreciation of the perseverance and significance of Latino culture.",
      "author": "Hagan Osborne"
    },
    {
      "text": "There's enough to entertain younger audiences but I'm not convinced Encanto will be remembered as a Disney classic.",
      "author": "Matthew Toomey"
    },
    {
      "text": "For Disney to make a film about Colombian folk culture is a gorgeous, original choice. But like its best films, the universal touch carries the real magic.",
      "author": "Alci Rengifo"
    },
    {
      "text": "A thin story, dull characters, endlessly regurgitated gags, and a general air of pointlessness dog this fantasy about life in an enchanted house in an unspecified Latin country.",
      "author": "Kyle Smith"
    },
    {
      "text": "The story makes it easy to connect with this family, with Mirabel a worthy new addition to the ever growing list of memorable Disney heroines.",
      "author": "Micheal Compton"
    },
    {
      "text": "Encanto comes to feel rather quaint, a welcome respite from the litany of bombastic animated films that all seem to follow the same tiresome schematic.",
      "author": "Steven Warner"
    },
    {
      "text": "Gorgeously animated, packed with brilliant voice acting, and featuring the best Disney musical sequences in recent memory, it's a film that works best when it's a bold merging of old and new...",
      "author": "Matthew Jackson"
    },
    {
      "text": "The melodies aren't initially memorable, but the energy of the music complements the movie's dynamic direction.",
      "author": "Stephen Humphries"
    },
    {
      "text": "So see Encanto for the splendid visual and musical experience with a heartfelt message and something to talk about.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Full credit to the creative team at WDAS, who have celebrated their 60th film with a story that genuinely feels unique among the studio's past work.",
      "author": "Grant Watson"
    },
    {
      "text": "Among other Disney musicals it's one of the studio's better efforts.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "If the story arc gets frustrating, the images and sounds more than compensate.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Too bad this was Disney's 60th animated movie. A story written under the guidance of the most conventional algorithm and eight perfectly forgettable songs. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "What's interesting and unexpected is the film's subtle acknowledgement of culturally specific generational trauma and displacement.",
      "author": "Simran Hans"
    },
    {
      "text": "A magical and musical journey that will fill the audience with awe, despite being a bit formulaic and predictable. Another fantastic soundtrack from Lin-Manuel Miranda.",
      "author": "Tessa Smith"
    },
    {
      "text": "\"Encanto\" lives up to its name.",
      "author": "Russ Simmons"
    },
    {
      "text": "A beautiful celebration of family and Colombian culture that's very small in scale but huge in scope and heart.",
      "author": "Rendy Jones"
    },
    {
      "text": "Immigrant themes are realized, as well as the excellent songs and the so-luscious-it-hurts-the-eyes animation, ... especially the soulful flower power. Another Disney triumph!",
      "author": "Patrick McDonald"
    },
    {
      "text": "Every line in every song is whip-smart and each tune seems better than the previous one.",
      "author": "Grant Rollings"
    },
    {
      "text": "It's the 60th feature film made or distributed since 1937 by Walt Disney Animation Studios, and classics such as Snow White, Pinocchio and The Jungle Book notwithstanding, it's one of the best.",
      "author": "Brian Viner"
    },
    {
      "text": "Joyful and triumphant, this could be the perfect festive treat.",
      "author": "Andy Lea"
    },
    {
      "text": "Encanto earns its tears.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "For every generic and lifeless sequel Disney churns out for monetary gain or subscriber dollars, they create an \"Encanto,\" a wonderful, stunningly (and original) animated adventure about the power and magic of family.",
      "author": "Nate Adams"
    },
    {
      "text": "Encanto celebrates how ordinary people can be extraordinary. Vibrant and touching, it is a heaped helping of candle-lit fun and magic.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "While transporting audiences to a new world, this celebration of Latino culture can still rely on the foundations of family to best support itself.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "When you factor in its spectacular looks, Encanto has enough going for it that it isn't hard to give it a recommendation.",
      "author": "Mark Meszoros"
    },
    {
      "text": "'Encanto' is the most purely delightful, transporting Disney animated feature in some time, maybe since 'The Princess and the Frog.' And its tunes by Lin Manuel-Miranda are the best since the days of Howard Ashman and Alan Menken.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Inarguably, it's an out-and-out delight.",
      "author": "Robbie Collin"
    },
    {
      "text": "The powerhouse musical numbers, gorgeous animation work and encouraging messages about family all shape this into a must-see family event.",
      "author": "Preston Barta"
    },
    {
      "text": "Families will enjoy \"Encanto\" but what may be more meaningful are the conversations we have afterward.",
      "author": "Nell Minow"
    },
    {
      "text": "...If Encanto doesn't become an instant classic on the same level as Beauty and the Beast or Frozen, it will absolutely reign supreme as its greatest hidden gem.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Encanto is a celebration of Latino culture that stresses embracing our differences, and what it lacks in narrative propulsion, it makes up for in joy and sense of wonder.",
      "author": "Richard Crouse"
    },
    {
      "text": "Vibrant, quirky, and emotionally engaging, Encanto provides a beautiful experience for the entire family. The music will stick with you long after the film ends.",
      "author": "Austin Burke"
    },
    {
      "text": "Fueled by colorful and crisply detailed animation, it finds an agreeable balance between cheerfully celebrating cultural traditions and playfully tweaking them.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "It's sweet, it's vibrant,it's colorful, it's a big adventure, and it's bigger than you think it's going to be.",
      "author": "Kevin Carr"
    },
    {
      "text": "The fluid lines of the animation flow like a winding river offering calmness even in scenes where chaos reigns.",
      "author": "Allison Rose"
    },
    {
      "text": "A sometimes likeable, sometimes overbearing adventure about a magical kingdom under threat from a mysterious force that threatens to destroy it.",
      "author": "Alistair Harkness"
    },
    {
      "text": "If you've seen every single Disney animated feature, as I have, Encanto sits right there in that upper third.",
      "author": "Alan Ng"
    },
    {
      "text": "The absence of a hissable villain keeps \"Encanto\" from being a great animated film but it's still a good one.",
      "author": "Chris Hewitt"
    },
    {
      "text": "It takes an extraordinary effort to make plainness interesting and this movie almost succeeds.",
      "author": "John Lui"
    },
    {
      "text": "Disney's 60th animated feature, Encanto, is a wonder to behold, but the story of a South American clan blessed with extraordinary powers becomes a struggle to endure.",
      "author": "Jay Horton"
    },
    {
      "text": "Ultimately, it's just another by-the-numbers Disney flick.",
      "author": "Sean Collier"
    },
    {
      "text": "Disney's latest animated outing is full of bright colors and energy, but the songs by Lin-Manuel Miranda are surprisingly flat and the movie's internal logic falters.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "A pleasant but overloaded tale that works diligently to be enchanting but never manages to be much more than serviceable.",
      "author": "Frank Swietek"
    },
    {
      "text": "It's probably a cliché by now to say that Disney made a family movie with heart, but I don't know what to tell you. They did it again.",
      "author": "Matt Goldberg"
    },
    {
      "text": "A bit too simple but still very sweet, Encanto isn't going to be a Disney classic. But it's still a solid choice for families headed to the theaters.",
      "author": "Alison Foreman"
    },
    {
      "text": "There's a story to be told and a heartfelt message to be experienced, and in those regards, Encanto isn't just a story about magic; it is magic.",
      "author": "Dirk Libbey"
    },
    {
      "text": "The foundations of a family are tested in Encanto, an appealing animated film which finds fresh ways to tell a story about characters with powers.",
      "author": "Tim Grierson"
    },
    {
      "text": "From its predictably gorgeous yet unimaginative visuals, to its familiar songs and predictable story, the film does feel rather safe despite being superficially groundbreaking for the studio.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "It's overblown at times and a bit too busy - visually, emotionally, and as narrative - but its vibrancy and ingenuity are hard to resist.",
      "author": "Mark Feeney"
    },
    {
      "text": "It's a creative, fresh take on a story that is much more complex than your standard fairy tale.",
      "author": "Kristen Page-Kirby"
    },
    {
      "text": "It's often entertaining and, for those who have to deal with the sometimes complex interactions that come from being part of a family, extremely relatable.",
      "author": "George M. Thomas"
    },
    {
      "text": "Another rehash of Frozen, Encanto does not have much to add to the equation. Upbeat Miranda songs become a bit monotonous.",
      "author": "James Verniere"
    },
    {
      "text": "Despite a few missteps, Encanto is one of the more charming animated movies to hit theaters this year.",
      "author": "Monica Castillo"
    },
    {
      "text": "Encanto might be the best Disney animated film since Frozen.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "The positivity, love and compassion displayed in Encanto is enough to bring tears to your eyes.",
      "author": "Tom Santilli"
    },
    {
      "text": "Fabulously colorful - and, at times, breathtaking animation - carries a flimsy plot through to an ever-predictable finale.",
      "author": "John Urbancich"
    },
    {
      "text": "It all adds up to something utterly joyous.",
      "author": "Emma Simmonds"
    },
    {
      "text": "There's nothing to dislike about this latest animated film in the Disney canon (No. 60!), but there's also not much about it that sticks either...",
      "author": "Steve Davis"
    },
    {
      "text": "A heartfelt and joyful take on a good old dysfunctional family.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "\"Encanto\" is a tale of discovery that is familiar but welcome within the Disney family. You don't have to look far to find its superpowers.",
      "author": "Adam Graham"
    },
    {
      "text": "Encanto is a family-friendly win this holiday season! Perhaps not the cry-inducing fest that Coco was, Encanto is full of joy.",
      "author": "Tania Lamb"
    },
    {
      "text": "Encanto is a joy and its light deserves to be seen far and wide - the tears you cry will be happy ones.",
      "author": "Emily Breen"
    },
    {
      "text": "...a forward-looking project that pretty much bursts with vitality on screen...",
      "author": "Eddie Harrison"
    },
    {
      "text": "Several generations love their enchanted house in the gorgeous movie filled with memorable songs.",
      "author": "Richard Roeper"
    },
    {
      "text": "Should sufficiently entertain any and all members of the family, making it a solid holiday film choice.",
      "author": "Edward Douglas"
    },
    {
      "text": "Disney's delightful animated musical is a tribute to Colombian culture, magical realism, and the power of multi-generational families.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "In \"Encanto\" there's a robust engagement with, and respect for, Latino culture in all of its dimensions.",
      "author": "Maya Phillips"
    },
    {
      "text": "It's only appropriate that Encanto -- fueled by eight original songs by Hamilton creator Lin-Manuel Miranda -- turns into that most special thing of all: A triumph in every category: art, songs and heart.",
      "author": "Mark Kennedy"
    },
    {
      "text": "I didn't want it to end; I wanted to stay in that magical Latin world with the Madrigals, the music, their little town, and its emotional message. [Review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "There's an incredible lead performance from Stephanie Beatriz, who reaches impossible levels of warmth and personality in her voicework, giving the endeavor a rich sense of humanity.",
      "author": "Brian Orndorf"
    },
    {
      "text": "[T]he formulaic elements the filmmakers do embrace ... eventually overwhelm a bit too much of that story's heart.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It's a simple but resonant tale, but \"Encanto\" is charmed and charming film that just might offer a bit of healing too.",
      "author": "Katie Walsh"
    },
    {
      "text": "Encanto is not novel in the tale that it's telling, but it finds unique approaches to the narrative and does so with a lot of impressive style.",
      "author": "Rob Dean"
    },
    {
      "text": "Encanto delivers an important message about the hopes and dreams of the disenfranchised. The soundtrack becomes tiresome, but the animation is stunning.",
      "author": "Julian Roman"
    },
    {
      "text": "While aspects of the story may be atypical, the visuals are right in line with the top-notch expectations.",
      "author": "James Berardinelli"
    },
    {
      "text": "Disney's 60th animated feature refreshingly goes against the grain for a small-scale psychological mystery which, mostly mediocre songs aside, provides an emotional knock-out.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Disney Animation does it again! Encanto is a complex tale about family relationships told with stunning animation. And the immigration scene is groundbreaking for Hollywood.",
      "author": "Grace Randolph"
    },
    {
      "text": "Not as exhilarating, sweeping nor funny as Tangled nor as poignant Coco, but it's nonetheless pleasantly diverting, big-hearted and uplifting.",
      "author": "Avi Offer"
    },
    {
      "text": "Encanto is dazzling, enchanting, and powerfully elevated by its fealty to authentic Colombian culture.",
      "author": "Kim Hughes"
    },
    {
      "text": "A vibrant and magical family adventure packed full of heart, soul and toe tapping tunes, courtesy of Lin-Manuel Miranda.",
      "author": "Nicola Austin"
    },
    {
      "text": "\"Encanto\" is, as its name suggests, quite enchanting in its depiction of a family dealing with external crises and internal strife - but weathering them together, to the beat of the music.",
      "author": "Sean P. Means"
    },
    {
      "text": "Encanto is a masterpiece that makes the Disney musical-with-a-splash-of-magic formula soar.",
      "author": "Petrana Radulovic"
    },
    {
      "text": "Think of it as everything we expect from the studio - beauty, warmth, humour, emotion - just with a little bit more.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Visually, Disney's Encanto sets the bar high for the studio's future animated efforts.",
      "author": "Hayden Mears"
    },
    {
      "text": "The main departure, and it's an interesting one, is the lack of a traditional villain, an absence that's felt but mostly overcome by the warmth and energy behind the execution, which effectively draws audiences into the story.",
      "author": "Brian Lowry"
    },
    {
      "text": "An epic, family-friendly tale with a surprisingly intimate feel.",
      "author": "John Wenzel"
    },
    {
      "text": "While Encanto is slighter than many of the studio's recent offerings, it is nonetheless a heartwarming story with dazzling animation.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "As false as animation is by its nature, when it finds an emotional truth and it works, it hits a deep chord. Encanto hit mine.",
      "author": "David Poland"
    },
    {
      "text": "With Encanto, the Disney team has created a film which will relate to anyone and that should entertain and uplift the entire family.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It's no Coco, but Encanto has enough family magic to charm audiences with Disney feels. Good, but not great.",
      "author": "Christie Cronan"
    },
    {
      "text": "\"Encanto\" is a beautiful and vibrant celebration of a family, filled with the enchanting magic of \"Beauty and the Beast\" and the heart of Disney and Pixar's \"Coco.\"",
      "author": "Kirsten Acuna"
    },
    {
      "text": "'Encanto' is filled with beauty and a message of self-acceptance, but also takes on family dynamics of legacy that fills out a story arc we've seen before.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Encanto remains an absolute delight that manages to be funny, sad, heartwarming, and it may have us tapping our feet to the beat of its well-choreographed musical numbers.",
      "author": "Jonathan Sim"
    },
    {
      "text": "Recasting studio formula in fresh, dazzling shapes and shades, Encanto is high-tier modern Disney.",
      "author": "Kevin Harley"
    },
    {
      "text": "Encanto is marvelous to behold, occasionally emotional, vigorously performed, and boasts catchy tunes. Hence, it's a shame that the initially encouraging writing, for the most part, is unable to stay committed to its message",
      "author": "Robert Kojder"
    },
    {
      "text": "A wholesome, delightful movie with so much heart-every one of its frames bursts with color and personality.",
      "author": "Jon Negroni"
    },
    {
      "text": "[It] has some unnecessary clutter in the story, and the music could be better, but this animated film has enough charm to overcome its very noticeable flaws ... Encanto ultimately has meaningful messages about family and self-confidence.",
      "author": "Carla Hay"
    },
    {
      "text": "A cultural spectacle of music, magic, identity and the family spirit. This is a refreshing take on the traditional Disney animated musical.",
      "author": "Andres Cabrera"
    },
    {
      "text": "As a musical offering this holiday season, Encanto should offer just enough enchantment to last until we get the 61st Disney animated film.",
      "author": "Pete Hammond"
    },
    {
      "text": "The overwhelming impression is of a unique and original narrative jaunt with some tap-along tunes and a muscular sense of its own identity.",
      "author": "Kevin Maher"
    },
    {
      "text": "Encanto dazzles both visually and narratively, with vibrant songs and stellar animation. Stephanie Beatriz leads a superb voice cast who help bring a film to life that is grounded but also feels like a magical delight.",
      "author": "Andrea Towers"
    },
    {
      "text": "Encanto is a fiesta. ( ... ) Its story is beautiful and fresh. It has fun, feeling and emotion, and one of Disney's best music in years. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "In a movie as visually stunning as Encanto, it's the depth of its empathy that might be its most miraculous feature.",
      "author": "Drew Taylor"
    },
    {
      "text": "Disney's Encanto is, well, enchanting.",
      "author": "David Rooney"
    },
    {
      "text": "98 minutes of pure bliss, a story about how weaknesses can be strengths, strengths can be weaknesses, and how love and determination is way better than magic when it comes to healing a broken family.",
      "author": "G. Allen Johnson"
    },
    {
      "text": "An enchanting, entertaining, and beautifully painted musical that evokes the magical realism of Colombian culture",
      "author": "J. Don Birnam"
    },
    {
      "text": "Encanto delivers a poignant message about not focusing so much on our own burdens that we miss the fact that others around us have them too.",
      "author": "Caroline Siede"
    },
    {
      "text": "The Colombian setting and casita are lush and inviting but, more importantly, the distinction in the characters and their facial expressions is wonderful.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Vibrant visuals, a stack of stellar songs, and a story with real heart make for another Disney banger. Sixty films in, the Mouse House still has that magic.",
      "author": "Ben Travis"
    },
    {
      "text": "Enchant it does, in ebbs and flows, mostly when relatable human ache peaks through the razzle-dazzle.",
      "author": "Carlos Aguilar"
    },
    {
      "text": "\"Encanto\" is a pretty standard underdog story. What enriches it is the visual splendor, which dovetails with the energy of the songs.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Encanto ends up being overwrought rather than enchanting.",
      "author": "Aparita Bhandari"
    },
    {
      "text": "This is a flavourless, unsatisfying film.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "\"Encanto\" is a lively, lovely, lushly enveloping digitally animated musical fairy tale.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "While the narrative doesn't totally land, the voice cast is solid and the vibe is consistently joyous.",
      "author": "Brian Truitt"
    },
    {
      "text": "Encanto is a magical adventure that's impossible not to be moved and exhilarated by. Watch it with your family and then give them a big group hug after.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "I can't help wishing that 'Encanto' had managed to achieve all its goals and deliver a completely satisfying adventure. It comes close.",
      "author": "Peter Martin"
    },
    {
      "text": "A dazzling showstopper that proves that Disney is still capable of magic.",
      "author": "Matt Oakes"
    },
    {
      "text": "Encanto is a wonderful example of using whimsy and fantasy to showcase culture and family in a way that goes beyond expectation.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Encanto does a fine job of conveying the notion that even in the best families, it can take considerable work to keep them together.",
      "author": "Derek Smith"
    },
    {
      "text": "'Encanto' is an extremely charming film, deeply insightful into the paradoxes of familial entanglement while remaining relatable to an all-ages audience.",
      "author": "Leigh Monson"
    },
    {
      "text": "Though it can't quite break out of the Disney mold, Encanto is greatly aided by a unique story, a delightful cast of characters, and a vital message.",
      "author": "Rachel LaBonte"
    }
  ],
  "release_year": 2021,
  "duration": 99,
  "genres": [
    "Kids & Family",
    "Musical",
    "Comedy",
    "Fantasy",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "The Madrigals are an extraordinary family who live hidden in the mountains of Colombia in a charmed place called the Encanto. The magic of the Encanto has blessed every child in the family with a unique gift -- every child except Mirabel. However, she soon may be the Madrigals last hope when she discovers that the magic surrounding the Encanto is now in danger.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg"
}