{
  "movie_name": "Encanto",
  "movie_id": "encanto_2021",
  "total_reviews": 20,
  "reviews": [
    {
      "text": "Story of a magical house and family in Colombia is a glorious celebration of kindness and everyday life - and Lin-Manuel Miranda's Latin rhythms will get you on your feet.",
      "author": "Francesca Steele"
    },
    {
      "text": "One of Disney's most magical animated movies yet",
      "author": "Zach Pope"
    },
    {
      "text": "A heartfelt watch that families will undoubtedly latch onto.",
      "author": "Emma-Jane Betts"
    },
    {
      "text": "To cap it all off, the story by Jared Bush, Bryon Howard, and Charise Castro Smith focuses on empathy perfectly. It’s a wonderful watch for the whole family.",
      "author": "Benjamin Wiebe"
    },
    {
      "text": "What makes this particular instalment of Disney dream-weaving a little bit different is texture. Pulling from a colourful Central American tradition that features brilliant cotton and woollen embroidery, we can almost feel the threads of every garment...",
      "author": "Katherine Monk"
    },
    {
      "text": "By exploring the traditional and non-traditional nature of family, their most common modern go-to theme, they keep connected to their familiar and beloved roots while taking audiences on unfamiliar journeys.",
      "author": "Wesley Lovell"
    },
    {
      "text": "It is in its overall focus that Encanto grasps at richer themes about how the family's magic is only part of what defines them.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "Absolutely a must if you’re into this sort of thing, and it’s a very easy, engaging sit even if you aren’t.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The screenplay has dark undertones, as all good magic realism does, but this is rooted in the troubled social history of Columbia.",
      "author": "Cris Kennedy"
    },
    {
      "text": "Encanto is one of the most aesthetically arresting and epically emotional animated features of the year, complete with a cast of colorful and captivating characters who are sure to become new fan favorites.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "Vibrant, rich, tender, sincere and lively.",
      "author": "Sarah Ward"
    },
    {
      "text": "A fun and dazzling musical adventure that celebrates the power of familia.",
      "author": "Nestor Bentancor"
    },
    {
      "text": "At its best when it's intimate and warm, Encanto's fast-paced adventure sequences and rampant physical comedy can be hit or miss. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "An impactful view of generational trauma told through impeccable songs, beautiful animation, and a moving story.",
      "author": "Rosa Parra"
    },
    {
      "text": "ENCANTO is a visually stunning animated film with wonderful songs and score, a deep, resonating emotional core and just a very positive, charming vibe to it.",
      "author": "Jimmy Cage"
    },
    {
      "text": "Love the music and the cultural urgency and accuracy of Encanto. The richness, poetry, [and] resiliance of the Colombian culture... makes Encanto such a refreshing thrill.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Encanto is a Disney film that delights without smashing expectations. Its easy to forget that the target audience for this genre are simply interested in fun and wonder, something that this movie delivers in spades.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Gorgeously animated, relatable narrative, and admirable themes!",
      "author": "Jason Escamilla"
    },
    {
      "text": "\"A spirit of communal celebration persists even after a first-act ceremony takes a turn for the ominous, and fleeting moments of chisme between cousins provide the movies breakneck pacing with instantly relatable doses of Latino-family bonding.\"",
      "author": "David Lynch"
    },
    {
      "text": "Surface Pressure unlocked the movie for me and made it more compelling than what I thought it would be - the inevitable discovery of Mirabel's gift... it's a discovery borne out of a family's denial.",
      "author": "Adam Kempenaar"
    }
  ],
  "release_year": 2021,
  "duration": 99,
  "genres": [
    "Kids & Family",
    "Musical",
    "Comedy",
    "Fantasy",
    "Animation"
  ],
  "synopsis": "The Madrigals are an extraordinary family who live hidden in the mountains of Colombia in a charmed place called the Encanto. The magic of the Encanto has blessed every child in the family with a unique gift -- every child except Mirabel. However, she soon may be the Madrigals last hope when she discovers that the magic surrounding the Encanto is now in danger.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/4j0PNHkMr5ax3IA8tjtxcmPU3QT.jpg"
}