{
  "movie_name": "Ex Machina",
  "movie_id": "ex_machina",
  "total_reviews": 290,
  "reviews": [
    {
      "text": "It not only takes place right on that blurred line between human and AI, but also portrays the exact point where it’s finally crossed.",
      "author": "Joseph Tomastik"
    },
    {
      "text": "Ex Machina is one of the more brilliant artificial intelligence movies I've seen in quite some time.",
      "author": "JD Duran"
    },
    {
      "text": "I’ve seen Ex Machina four times now, and every time it felt like a completely different movie. Alex Garland has created a new favorite of mine in the sci-fi genre...",
      "author": "Brendan Cassidy"
    },
    {
      "text": "Alex Garland’s cerebral sci-fi feels a lot like an Asimov novel—ironic, considering the movie actively defies Asimov’s own rules of robotics.",
      "author": "Ankit Ojha"
    },
    {
      "text": "...the brilliance of the film is the way we become Garland’s Turing Test subjects.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "“Ex Machina” works as a study of what it means to be conscious/human...I’m convinced more than ever that we are in the midst of a British New Wave in science fiction cinema.",
      "author": "Wael Khairy"
    },
    {
      "text": "A commanding first directorial effort from Alex Garland, Ex Machina is the product of a perfectly-tuned collaborative endeavor, much like the mind of its artificial centerpiece.",
      "author": "Jordan Brooks"
    },
    {
      "text": "The tense, thoughtful sci-fi set in a remote cutting-edge cabin raises big questions and upgraded Alicia Vikander to even greater star status.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "All the doubts we've harbored through the film hit us like a hammer at the end, leaving us chilled. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "... a science fiction film of ideas rather than visual spectacle.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Ex Machina\" has much more good than bad and much more surprise than contrivance when it comes to traversing the mine field that can be the science fiction topic of artificial intelligence, especially with a potentially damning title like that.",
      "author": "Don Shanahan"
    },
    {
      "text": "By considering such ideas in an enclosed environment with so few characters, Garland has made Ex Machina an intense, engaging film that plays with the viewer's head and, as the best films often do, demands an exceptional degree of time to process.",
      "author": "Brian Eggert"
    },
    {
      "text": "A fascinating sci-fi study of A.I. with incredible performances all around.",
      "author": "Rosa Parra"
    },
    {
      "text": "Ex Machina is a smart, literate and occasionally quite brilliant film, which will upend a few of your expectations for where this story will end and how it will get there.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Alex Garland's directorial debut is an artificial intelligence film that asks the right questions...",
      "author": "Angus Batey"
    },
    {
      "text": "It's uncomfortable to consider that Ava might in fact be the heroine of this movie, but it's hard for me to find sympathy for men who only see her as an object to be abused or pitied.",
      "author": "Cate Young"
    },
    {
      "text": "A high tech thriller that by and large ignores the tech to get down to the nitty gritty.",
      "author": "Richard Crouse"
    },
    {
      "text": "I enjoyed watching the small cast of characters conspire with and against one another within the confines of a chillingly beautiful and remote techno-bunker.",
      "author": "Kjerstin Johnson"
    },
    {
      "text": "Ex Machina does much more than simply put the audience on edge, although it sustains that feeling expertly.",
      "author": "David Bax"
    },
    {
      "text": "A beguiling sci-fi thriller asks the audience to decide who's being tested, the AI or the human. There's plenty of twists and turns in this sensational isolated quest for survival.",
      "author": "Wesley Lovell"
    },
    {
      "text": "The premise alternates between engaging and nonsensical.",
      "author": "Mike Massie"
    },
    {
      "text": "Taut and oh-so thrilling.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "Unconcerned with the how or why of the scenario, Garland glides us straight into a lithe and increasingly intense narrative centered on the concept of manufactured manipulation.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Vikander's turn as Ava is as chilling as it is empathetic, internalising the torment of being considered inferior and subhuman to her male oglers.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Ex Machina takes a familiar concept but presents it in a deep, complex and imaginative way that not only makes it one of the best films to come out of 2015 but certainly in time will rank as one of the best sci-fi films ever made.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Ex Machina is a smart, well-crafted film that will get under your skin and have you questioning the true meaning of being human.",
      "author": "Damond Fudge"
    },
    {
      "text": "At best, it feels more like a calling card or extended short film, but there is enough singularity here to mark Alex Garland out as a writer-director of promise.",
      "author": "PJ Nabarro"
    },
    {
      "text": "This is a smart, thoughtful, and thrilling science fiction drama.",
      "author": "Grant Watson"
    },
    {
      "text": "The three leads are equally effective at conveying the ethical perils posed by a future that could be closer than we are prepared to admit.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It's about robotics and artificial intelligence and how you can or can't tell a human from a machine, but even more it's about bro culture and the blindness it can induce in those who embrace it.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Garland's finest achievement may be his old-fashioned faith in science-fiction as an engine for profound parables about the state of humanity.",
      "author": "Angela L. Harmon"
    },
    {
      "text": "Beautifully told, stunning with occasional outbursts of humour... Ex Machina will leave you reeling.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Is there a ghost in this shell or not? The only answer you get from this film is that men are easily blinded assholes, especially when it comes to something which even remotely looks like a pretty woman.",
      "author": "Ard Vijn"
    },
    {
      "text": "Ex Machina is a masterpiece. Garland puts together an original bit to an over-crowded genre, carried by Isaac's entertaining, spectacular performance.",
      "author": "Brandon Davis"
    },
    {
      "text": "[Alex Garland's] futuristic vision is no less ominous for its relatively low-key approach but, disappointingly, falls back on genre cliche and a tired depiction of gender relations.",
      "author": "Nikki Baughan"
    },
    {
      "text": "Ex Machina is a smart, slow-burning and fascinating sci-fi thriller that deals with themes of sexuality, humanity and morality against a truly luscious backdrop.",
      "author": "Joey Keogh"
    },
    {
      "text": "Excellent performances from the three key cast members elevate this compelling material even further.",
      "author": "Kate Rodger"
    },
    {
      "text": "The film Ex Machina comes not a moment too soon.",
      "author": "Leslie Combemale"
    },
    {
      "text": "What's amazing about Ex Machina is Garland's precise control over the audience both visually and through a singularly perfect script. The characters and the audience are both captive, processing the slightest information as fast as they can.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Precision-tooled to perfection with sumptuously seductive design,itcombines the brains of Blade Runner, the gloss of James Bond, and the sly satire of cult comic 2000AD.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "A delicate, sensuous and atmospheric film irrespective of its intellectual clout, Ex Machina surges with cerebral and emotional speculation. A startling and unique debut.",
      "author": "Danielle Davenport"
    },
    {
      "text": "It's creepy, weird without cheap jump scares or unnecessary gore.",
      "author": "Rachel Wagner"
    },
    {
      "text": "What's really cool about Ex Machina is that, despite its high-brow inner-workings, it's still an easily accessible, small-scale thriller that offers as many genre pleasures as it does philosophical head-scratchers.",
      "author": "Bernard Boo"
    },
    {
      "text": "It's further proof that one doesn't need an astronomical budget or big stars to tell a compelling, memorable story. Dazzling, provocative and haunting... everything you'd expect from a futuristic sci-fi film.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Vikander's ability to give the machine an emotional edge is a major reason why this works -- asking the audience to invest in her fate.",
      "author": "Micheal Compton"
    },
    {
      "text": "Strikingly compelling, cerebrally cool and eerily suspenseful.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Ex Machina  is one of the most daring, original and creative films of the year and one of the finest sci-fi films ever made.",
      "author": "Caroline Madden"
    },
    {
      "text": "It's a grand idea done with simple methods, and serves a solid template for how the British film industry should handle genre pictures.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "It might exist in a vacuum, but that doesn't stop it from being intriguing and absorbing just the same.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "Humans will never stop creating. Let's just hope they don't create something that winds up hating them.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Garland has given us a thing of beauty - a rare, shining example of an entertaining film, completely devoid of some of the more pompous tropes common in this genre.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Ex Machina is full of reflective surfaces; it's a funhouse mirror on our fears and ideas about technology, information.",
      "author": "Molly Templeton"
    },
    {
      "text": "Every word matters in this film: not a look, movement, or sequence is wasted by first-time director Alex Garland.",
      "author": "Charles Mudede"
    },
    {
      "text": "Even on more trashier terms, there was still a chance Ex Machina might have still worked for me, had Garland refrained from resorting to the kind of cruel, mean-spirited measures that marred some of his best known work.",
      "author": "Rubén Rosario"
    },
    {
      "text": "\"Ex Machina\" is not to be missed!",
      "author": "Pamela Powell"
    },
    {
      "text": "The thing that makes this movie stick out to me is the acting. Every single scene - and I mean every single one - would not work if the actors weren't as great as they are.",
      "author": "William Young"
    },
    {
      "text": "It's creepy, compelling and asks some interesting questions about the power of human sexuality.",
      "author": "Kiko Martinez"
    },
    {
      "text": "One of the most intelligent and thought-provoking sci-fi thrillers of the current generation",
      "author": "Robert Kojder"
    },
    {
      "text": "... a stellar piece of science fiction.",
      "author": "Sarah Marrs"
    },
    {
      "text": "It's refreshing to watch a science-fiction story that remains brilliantly cerebral, demanding the focus of its audience, yet constantly throws us a naughty wink.",
      "author": "Brooke Corso"
    },
    {
      "text": "If you want to make a film about how it's not okay to objectify women, the first step is to not make a film that spends its entire run time objectifying its women.",
      "author": "Alex Heeney"
    },
    {
      "text": "Too aptly titled, Ex Machina morphs into that most clichéd, if admittedly appealing, of recent genres: a sci-fi noir.",
      "author": "Lisa Rosman"
    },
    {
      "text": "In Ex Machina, (Garland) may have created his best work yet, working with a very small cast in a limited space that gives the characters plenty of chances to turn on each other in subtle, clever ways.",
      "author": "Abby Olcese"
    },
    {
      "text": "[Isaac] is superb as a psychopathic Steve Jobs type in Ex Machina, a creepily sexualised but ultimately impressive little sci-fi thriller directed by the British novelist Alex Garland.",
      "author": "Camilla Long"
    },
    {
      "text": "Alex Garland's Ex Machina is a chilling view of the future of AI, brought to captivating life through the performances of Isaac, Gleeson, and Vikander.",
      "author": "David Fontana"
    },
    {
      "text": "Alex Garland's Ex Machina uses a compelling, well-contained story to examine society's growing anxieties, something he's made a habit of doing throughout his career.",
      "author": "Sonny Bunch"
    },
    {
      "text": "A remarkable sci-fi classic.",
      "author": "Giovanni Fazio"
    },
    {
      "text": "A crackling good entertainment, a brainy science fiction picture executed in a clean, concise style, with a narrative as logical as it is unpredictable.",
      "author": "Jason Bailey"
    },
    {
      "text": "Despite Ava's revealing circuitry, it is the notable sort of science fiction film that is far more reliant on ideas than effects.",
      "author": "Joe Bendel"
    },
    {
      "text": "A film with enough attributes to be a reference in the genre and also one that legitimizes its debuting director in his craft. [Full review in Spanish]",
      "author": "Hugo Lara"
    },
    {
      "text": "The premise may not be the most original, but its director's Alex Garland's treatment that elevates this film. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "The film's aim overreaches its grasp, but its shortcomings make it no less worth the trip. And \"trip\" is the only word for it.",
      "author": "J. Olson"
    },
    {
      "text": "Ex Machina has both a heart and soul. Within these close quarters, there is something to chew on, observe, and explore.",
      "author": "Bill Graham"
    },
    {
      "text": "Ex Machina is the kind of film that proves that some of the very best cinematic storytelling can be based on ideas, not necessarily grandiose action set pieces and crazy, over-the-top concepts that many bigger studio projects often rely on.",
      "author": "Heather Wixson"
    },
    {
      "text": "Ex Machina's subtlest sleight of hand is that our eventual horror at her treatment only makes sense if she has passed the Turing Test. If Ava didn't look and emote like Vikander, her plight would seem as tragic as a toaster's.",
      "author": "Nick Hasted"
    },
    {
      "text": "Ex Machina is the iPhone to Blade Runner's Walkman.",
      "author": "Blake Howard"
    },
    {
      "text": "...a darkly funny and philosophical cyberpunk locked-room thriller that tangles with the greatest sci-fi puzzle: What does it mean to be human?",
      "author": "Chris Barsanti"
    },
    {
      "text": "As the film tests you, you're left to sort out whether you pass.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "The fine lines between spirit and flesh, and betwixt man and machine, are giddily redrawn in Ex Machina, a smart sci-fi chamber piece that reduces the future to just a few provocative elements.",
      "author": "Ken Eisner"
    },
    {
      "text": "It's just a story of four characters in a secluded location, shot on an obviously small budget. But deep inside of it is a fully imagined idea of where humanity is headed -- and what evils we're capable of.",
      "author": "Emily St. James"
    },
    {
      "text": "It's Greek tragedy with silicon parts and an Alex Garden edge... Coupled with one of the sharpest sword fights in recent screen history, making Ex Machina feel like the best bit of fakery that ever fell from heaven.",
      "author": "Katherine Monk"
    },
    {
      "text": "The dazzling directorial debut of Alex Garland is a can't-miss sci-fi thriller.",
      "author": "Daniel Gelb"
    },
    {
      "text": "A consistently enigmatic and stunning science fiction tale of humanity, and the god complex...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Ex Machina piques our curiosity, lights up our imaginations and sets our nerves a-tingling in ways that few other \"robot\" movies can match.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Ex Machina is a disquieting power struggle waged in terms of human weaknesses, refracted through gender.",
      "author": "Alison Willmore"
    },
    {
      "text": "Ex Machina is one of the year's best films because it's smart, entertaining and disturbing, and also because it never underestimates the viewer, creating a perfect balance between entertainment and deep ideas. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Ex Machina has a precise visual sheen that evokes David Fincher, and earns the sudden, quiet, powerful scares of his best work.",
      "author": "David Sims"
    },
    {
      "text": "A deliberately paced 'hard science fiction' film if ever there was one, this is graced by three terrific performances.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Ex Machina, ever muted and somber, is imbued with a looming sense of dread.",
      "author": "Tom Meek"
    },
    {
      "text": "Ex Machina uses state-of-the-art special effects to deliver a smart new take on A.I.",
      "author": "Beth Accomando"
    },
    {
      "text": "Ex Machina is a film unafraid to spend the majority of its run-time discussing the Big Questions - or indeed, just to be discussing things full-stop.",
      "author": "Ben Travis"
    },
    {
      "text": "The film is at its best when the characters are simply talking to each other, creating a delicate, hypnotic back-and-forth between the humans and the new creature in their midst.",
      "author": "Norman Wilner"
    },
    {
      "text": "Garland the writer may be a bit too fiddly about the details of what we're seeing, but his visual flair is undeniable. He also shows an ability to handle his actors. It all makes Ex Machina into a tantalizing debut and an arresting piece of [sci-fi].",
      "author": "Kristian M. Lin"
    },
    {
      "text": "It is a gorgeous, thought-provoking story and a triumph in every way for Garland, who casts three rising stars to make a small film full of big ideas.",
      "author": "Michael Smith"
    },
    {
      "text": "...a beautiful piece of science fiction on par with the best of the genre.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "The movie, written and directed by Alex Garland (\"Dredd,\" \"28 Days Later\"), is an outstanding example of what true sci-fi is about and the best sci-fi flick since \"Predestination\" earlier this year.",
      "author": "Paul Chambers"
    },
    {
      "text": "Takes its deserved place next to the other children of Fritz Lang and Karel Capek.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "With \"Ex Machina,\" writer/director Alex Garland has delivered a thoughtful, thrilling, and entertaining science-fiction tale that ends up doing more with its minimal budget than some films of the genre do with several times such an amount.",
      "author": "Jeff Beck"
    },
    {
      "text": "There are a dozen reasons to watch this little sci-fi chamber piece about two men and a babe-bot, but the top reason would be for the seamless intertwining of topicality and story.",
      "author": "John Lui"
    },
    {
      "text": "Inventive and challenging without ever forgetting to entertain, Ex Machina is smart artificial-intelligence science fiction at its absolute best.",
      "author": "Will Leitch"
    },
    {
      "text": "Ex Machina immediately enters the running for the best science fiction film of the year just by following through on the promise of its concept.",
      "author": "Rob Vaux"
    },
    {
      "text": "Garland's film sexualizes Ava to an embarrassing degree, which also is its entire point. His aim is to have his cake and eat it too, with images of female nudity literally created for the male gaze, subverted, and mined for maximum uncomfortability.",
      "author": "Eric Melin"
    },
    {
      "text": "'Ex Machina' is a smart science-fiction tale about artificial intelligence, madness and trust.",
      "author": "Linda Cook"
    },
    {
      "text": "Presents some interesting questions...but right when the film should be hitting us with some 'a-ha!' moments it swerves into voyeuristic contrivances.",
      "author": "Bruce Bennett"
    },
    {
      "text": "Screenwriter Alex Garland makes his directorial debut with this sleek sci-fi chamber play, and he exhibits the visual command of a true filmmaker, even if his storytelling gets wobbly at times.",
      "author": "Daniel Barnes"
    },
    {
      "text": "Ex Machina is worth watching just as an exercise in suspense, creepy high-tech production design, and excellent acting.",
      "author": "Stuart Klawans"
    },
    {
      "text": "This intelligent examination of our fascination with science is impeccably realised, despite a modest budget.",
      "author": "Ed Gibbs"
    },
    {
      "text": "The film is practically guaranteed to make the audience think -- and if that's not a cry to action, then what is?",
      "author": "Alex Doenau"
    },
    {
      "text": "...bodes well for his future endeavors behind the camera.",
      "author": "David Nusair"
    },
    {
      "text": "The most interesting role, of course, is Ava, and Vikander nails it. It's actually possible to say of this film that it's worth seeing just for the robot.",
      "author": "CJ Johnson"
    },
    {
      "text": "Plows through its 108-minute running time with a constant sense of doom provided from every source.",
      "author": "Tim Brayton"
    },
    {
      "text": "It's at once a thought-provoking drama and a pulse-quickening thriller.",
      "author": "Sean P. Means"
    },
    {
      "text": "The pleasure of Garland's film lies more in the deeper questions of what makes us 'human'... than in the plot, which suffers from predictability.",
      "author": "Amber Wilkinson"
    },
    {
      "text": "Ex Machina is a fine update to the artificial-intelligence genre, but it's made almost entirely of pre-existing parts.",
      "author": "Michael Nordine"
    },
    {
      "text": "With telling performances, Ex Machina spans sci-fi philosophy and a romantic triangle, but ultimately it's a horror movie where the monsters are men.",
      "author": "Craig Mathieson"
    },
    {
      "text": "An intriguing piece of understated science fiction.",
      "author": "Tom Clift"
    },
    {
      "text": "With a deep love for clinical white, subtle camera work and the 1971 George Lucas film THX-1138, first-time director Alex Garland fashions a visually stark contest of ideas in what is essentially a high-tech two-hander.",
      "author": "Jim Schembri"
    },
    {
      "text": "A mature, adult, thoughtful and credible sci fi entertainment.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "A spellbinding character study mystery made even more fascinating by the thought that its premise is far closer to becoming reality than most of its sci-fi peers.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "It's so engaged in the delicate psychology, in its observational mode, that the characters all feel like rats in a maze. Of course, that's the point.",
      "author": "Robert Levin"
    },
    {
      "text": "This is a film of creepy modernity and prescience, as Metropolis was in its time.",
      "author": "Paul Byrnes"
    },
    {
      "text": "One of the smartest, slickest and most intriguing sci-fi thrillers in recent memory, with a standout performances from Isaac and Vikander and confident, minimalist direction from Garland.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Ex Machina works because it gradually shifts the terms of the narrartive and thematic structure, forcing us to reevaluate what we thought we knew and seriously question the fundamental essence of humanity",
      "author": "James Kendrick"
    },
    {
      "text": "What holds the audience is a dark undercurrent of not so much dread as uncertainty. Your senses tell you that something is off-kilter, yet you can't place your finger on what it is.",
      "author": "Bob Bloom"
    },
    {
      "text": "Borrowing body parts from the age old horror/sci-fi workbook, Alex Garland makes a female Frankenstein movie (sort of) and interrogates the pursuit of AI in the process",
      "author": "Andrew L. Urban"
    },
    {
      "text": "Although there's a fatal flaw that diminishes its overall satisfaction rating, this is a dazzling film filled with intrigue and an innate edginess that is elevated by three startlingly good performances",
      "author": "Louise Keller"
    },
    {
      "text": "The sharply written film is cerebral yet doesn't bog down in enigmatic concepts or scientific mumbo-jumbo.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Oscar Isaac upstages impressive visual effects and set design",
      "author": "Marty Mapes"
    },
    {
      "text": "While we may tire of Caleb and Nathan's boilerplate debates about AI, the film's ominous undercurrents keep us awake and attentive.",
      "author": "Margot Harrison"
    },
    {
      "text": "Unlike most science fiction films, this one has smart characters, a smart plot and smart dialog. It also has romance, murder and suspense. This is a suspenseful, disturbing and thought-provoking film.",
      "author": "Robert Roten"
    },
    {
      "text": "When the story is all over there has been surprisingly little story told, but the viewer will have been privy to some very sophisticated philosophical ideas.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "It is a pounding psychological thriller that plants its seeds of doubt from its opening cues and builds to a tremendously affecting crescendo.",
      "author": "Allyson Johnson"
    },
    {
      "text": "This really isn't the sort of movie in which we should talk about performances and plot.",
      "author": "Kelly Vance"
    },
    {
      "text": "Brainy sci-fi thriller.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The first homoerotic sci-fi thriller of the year!",
      "author": "Victoria Alexander"
    },
    {
      "text": "While some decisions made by characters in the final act feel rushed and even unwarranted, I was always interested to see where this story went.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "A.I. goes A.W.O.L. in this minimalist sci-fi thriller from England that's justifiably turning heads for its brilliant production design, brainy cat-and-mouse narrative, and vice-like tension.",
      "author": "Glenn Lovell"
    },
    {
      "text": "Alex Garland's intense, mind-melding sci-fi thriller is the most intriguing movie I've seen so far this year.",
      "author": "Susan Granger"
    },
    {
      "text": "A thought-provoking thriller guaranteed to keep you enthralled while reassessing the meaning of consciousness",
      "author": "Kam Williams"
    },
    {
      "text": "The movie milks its desolate setting for maximum impact: Nathan's secluded house-cum-laboratory is cannily employed as its own self-contained petri dish, with existential quandaries being analyzed under Garland's morally tuned microscope.",
      "author": "Matt Brunson"
    },
    {
      "text": "Ex Machina is the best movie I've seen all year.",
      "author": "Christy Lemire"
    },
    {
      "text": "Ex Machina is memorable and downright challenging, full of sharp performances that blur the lines between humanity and programming.",
      "author": "Ben Kendrick"
    },
    {
      "text": "Intelligent and provocative, with more than a little relevance to the world we live in.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "There's a lot happening in Ex Machina and we're never entirely sure what will happen next.",
      "author": "Kirk Baird"
    },
    {
      "text": "It's rare for a science-fiction film's high-concept to get stolen out from under it by a performance -- but then again, Isaac appears to be a rare kind of actor.",
      "author": "Scott Renshaw"
    },
    {
      "text": "[A] methodically absorbing sci-fi drama.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "For one thing, it's gorgeously shot. For another, it actually takes its own ideas seriously. This is a special film.",
      "author": "Stephen Silver"
    },
    {
      "text": "The film differentiates itself nicely from others of its ilk, for lurking beneath the heady stuff is a tense, frightening horror film.",
      "author": "John Serba"
    },
    {
      "text": "Through cues both understated and not so much, the grim implications (\"grimplications?\") of creating a fembot with the potential to go full Skynet are clear.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Garland's primary concern is his flesh-and-blood characters, even though they are not nearly as showy (or beautiful) as his main attraction, the vulnerable, delicate girl with a heart of steel and wires.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "A heady piece of sci-fi, fleshed out with terrific performances, a smart script, solid special effects & expert direction. So far, it's one of the best films of 2015. (Full Content Review - Sex, Profanity, Violence, etc. - for Parents also available)",
      "author": "Jim Judy"
    },
    {
      "text": "Garland's commitment to his weird, edgy material, and his unhurried and thoughtful execution of it, makes \"Ex Machina\" something special.",
      "author": "Rob Thomas"
    },
    {
      "text": "Alex Garland's directorial debut ranks among my favorite movies this year.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "A clever film with one indelible performance from Isaac.",
      "author": "Liam Lacey"
    },
    {
      "text": "\"Ex Machina\" takes its time, wrestling with questions of responsibility, morality and compassion while getting ever weirder. At its heart is Ava, played with a fine blend of innocence and quiet panic by Vikander.",
      "author": "Tom Long"
    },
    {
      "text": "While slowly paced, the feature isn't dull, emerging as a potent study of power and corruption, setting a sinister, tech-heavy atmosphere that almost seems achievable in our day and age.",
      "author": "Brian Orndorf"
    },
    {
      "text": "At heart, Garland is a genre filmmaker, but his movies have more depth than their contemporaries. Additionally, he's cast his movie brilliantly.",
      "author": "Anders Wright"
    },
    {
      "text": "Ex Machina packs a scientist's brain inside a thrill seeker's body, much like the nubile robot within it.",
      "author": "Peter Howell"
    },
    {
      "text": "It's a teasingly slow build -- part love story, part science experiment -- that makes a few of the movie's twists seem even more surprising.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "[Oscar] Isaac - buffed, bald, and bearded - is the film's dramatic center as Nathan, a man betrayed by his own genius. He struts, he speechifies, he schemes, he scolds, all friendly menace and sly frankness.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Like stage actors who live and breathe their roles over the course of months, Isaac, Gleeson, and Vikander excel, and cast a spell.",
      "author": "Steven Rea"
    },
    {
      "text": "This futuristic take on age-old motivations, jealousy and betrayal among them, makes Ex Machina clever and engaging throughout.",
      "author": "Liz Braun"
    },
    {
      "text": "This is [Garland's] first turn as director, and it suits him; he's created a cautionary tale that entertains even as it forces us to think.",
      "author": "Chris Knight"
    },
    {
      "text": "Ex Machina is one of the smartest horror movies to come along in years. It doesn't count on big scares and excessive violence to make its points but shows that intellect left unchecked can be equally as frightening.",
      "author": "Rick Bentley"
    },
    {
      "text": "With a stellar cast and seductive look, \"Ex Machina\" is a sleek contraption for capturing our imagination.",
      "author": "Joe Williams"
    },
    {
      "text": "A neat psychological thriller for the digital age. Great performances compensate for a slightly slim story.",
      "author": "Rafer Guzman"
    },
    {
      "text": "'Ex Machina' knows that cinema's dirty little secret has always been that it shares as much with porn as it does with literature.",
      "author": "Vincent Mancini"
    },
    {
      "text": "It's great when a movie messes with your head.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "A smart, entertaining sci-fi thriller with dazzling performances and clever psychological sparring, human and otherwise.",
      "author": "Clint O'Connor"
    },
    {
      "text": "After tantalizing us with increasingly imaginative developments and the promise of catharsis, Garland lets it all dribble away at the end.",
      "author": "Marshall Fine"
    },
    {
      "text": "A B-movie that tried to be something better but stayed a B-movie.",
      "author": "Ron Wilkinson"
    },
    {
      "text": "Evokes Stanley Kubrick as much as the similarly excellent Under the Skin last year. A must-see for fans of either.",
      "author": "Brad Keefe"
    },
    {
      "text": "A masterpiece. Alex Garland puts teeth and a chill into what has either been an empty sci-fi threat, or else has been sentimentalized to death, as in the very bad Chappie.",
      "author": "Richard von Busack"
    },
    {
      "text": "Ex Machina is the best kind of speculative fiction: its action is brisk, its characters startling, and its meanings multifarious.",
      "author": "Michael Sragow"
    },
    {
      "text": "Beautifully shot and wonderfully acted, it's an enjoyable, grown-up entertainment, even if it leaves us wanting something deeper.",
      "author": "Mike Scott"
    },
    {
      "text": "Despite following a great deal of well-worn territory, the film manages to engage its audience with its icy and efficient delivery and consistent undercurrent of malevolence.",
      "author": "Patrick Cooper"
    },
    {
      "text": "It's the kind of film that seems to me shy of a masterpiece right now, but one where I may well find it to be with time and repeat viewings.",
      "author": "Ken Hanke"
    },
    {
      "text": "Alex Garland has written some of the best science fiction films of this century, so it's startling to see him succeed more as a director than as a writer here.",
      "author": "Justin Gerber"
    },
    {
      "text": "Most movies don't pass the smell test, let alone the Turing Test, but \"Ex Machina\" aces both with the sort of intelligence -- artificial or otherwise -- often absent from contemporary sci-fi.",
      "author": "Al Alexander"
    },
    {
      "text": "The Swedish actress Alicia Vikander (\"The Fifth Estate\") infuses Ava with the just the right mixture of iciness, vulnerability and mystery. It's a star-making performance.",
      "author": "Richard Roeper"
    },
    {
      "text": "Premise grabs, but more like excruciating eventually. I, Nobot.",
      "author": "James Verniere"
    },
    {
      "text": "It's the predictability that ultimately hurts \"Ex Machina\". Talk about killing the suspense ---",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "We can extract at least one truism from this imaginative and beguiling story. Women hate to be treated as chattel --- even if they're robots.",
      "author": "David Kaplan"
    },
    {
      "text": "\"Ex Machina\" is an exquisite puzzle box of a picture. It baffles. It unsettles. It intrigues.",
      "author": "Soren Andersen"
    },
    {
      "text": "A beautifully-crafted science fiction drama that recalls the ingenuity and brilliance of \"Jurassic Park.\"",
      "author": "John Hanlon"
    },
    {
      "text": "It may not be a modern masterpiece of sci-fi, but it's close enough to pass for one.",
      "author": "Marc Mohan"
    },
    {
      "text": "Visually stunning, intellectually provocative, emotionally powerful.",
      "author": "Nell Minow"
    },
    {
      "text": "The ideas here don't breathe. They simply take us from one plot point to the next.",
      "author": "Mark Dujsik"
    },
    {
      "text": "\"Ex Machina\" isn't quite \"Citizen Kane\" for an era of Internet tycoons, but it suggests that that's not such a bad idea.",
      "author": "Ty Burr"
    },
    {
      "text": "Garland also seduces with clean frames, sleek, elegant surfaces, and the most physically convincing of robots on screen in memory. Sentience is sexy!",
      "author": "Ray Pride"
    },
    {
      "text": "A singularly chilling cinematic stunner that coexists as a wild daydream and a prescient glimpse into the future.",
      "author": "Dustin Putman"
    },
    {
      "text": "A rattling and ruminative piece of speculative fiction, Ex Machina is good enough to wish it were even better.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Its aura of cool menace is largely attributable to Isaac, stealing his every scene as the smoothly bullying CEO, and production designer Mark Digby, who created the millionaire's sleek, high-tech mountain fortress.",
      "author": "J. R. Jones"
    },
    {
      "text": "Ex Machina addresses heady issues of A.I., exploring what it means to be human or, more important, what it means to be an imitation of humanity so real, what's the actual difference?",
      "author": "Dann Gire"
    },
    {
      "text": "A coolly cerebral sci-fi tale that really isn't all that inventive but nonetheless casts quie a spell.",
      "author": "Frank Swietek"
    },
    {
      "text": "\"Ex Machina\" is a smart, exceptionally stylish head trip.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Garland sidles up to some large ideas, some more provocative than others, and his premise hints at the costs of perpetual, omnivorous surveillance.",
      "author": "Michael Phillips"
    },
    {
      "text": "It's hard to imagine another director squeezing as many shades and colors from his screenplay as Garland did, and from now on, it would be understandable if he insisted on directing everything he writes.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Alex Garland brilliantly brings the past into the present with the near-future tale Ex Machina, a stark but dazzling meditation on intelligence, consciousness and morality that discreetly uses special effects in service of story, dialogue and character.",
      "author": "Cary Darling"
    },
    {
      "text": "Merciless, efficient and terrifyingly logical...",
      "author": "Josh Larsen"
    },
    {
      "text": "Ex Machina is intelligent science fiction operating at a very high level.",
      "author": "Jason Zingale"
    },
    {
      "text": "It will make you look at every other movie about artificial intelligence in a whole new way.",
      "author": "Travis Hopson"
    },
    {
      "text": "More tricky than smart.",
      "author": "Matt Pais"
    },
    {
      "text": "In the final analysis, the movie doesn't offer much about the subject that hasn't been previously explored, but the soil is fertile and many ideas germinate.",
      "author": "James Berardinelli"
    },
    {
      "text": "Garland more than establishes himself as talent to watch. The perfect balance between the cerebral and the emotional, crafting a thrilling film that still remains intellectually provocative - A difficult creature to build indeed.",
      "author": "Jason Gorber"
    },
    {
      "text": "The best thing about \"Ex Machina\" is the robotic depiction of Ava, a sleek humanoid that exudes sex appeal.",
      "author": "Robin Clifford"
    },
    {
      "text": "Slow paced, but thought provoking science fiction.",
      "author": "Scott Nash"
    },
    {
      "text": "A thrilling work of sci-fi ... a smart and visually alluring film that contemplates chilling questions about where technology is headed and the consequences of playing God.",
      "author": "Chris Tinkham"
    },
    {
      "text": "Beautifully haunting.",
      "author": "Jonah Flicker"
    },
    {
      "text": "With Ex Machina writer/director Alex Garfield delivers a science fiction film full of concepts and ideas versus overblown visual effects.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Like Ava herself, Garland manipulates our sympathies, rendering his climax all the more horrifying and his denouement, albeit understated, terrifying.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "This is the best, most credible, of the artificial intelligence movies to date. Garland keeps the tension up and the pace moving by tackling many thought-provoking existential issues. I was pleasantly surprised, rewarded, by what I had just seen.",
      "author": "Tony Medley"
    },
    {
      "text": "The writer and director, Alex Garland, keeps the movie so full of doomy atmosphere that expecting the worst sort of becomes a treat. But gradually the hypnosis wears off, the mystique dissipates, and banalities take over.",
      "author": "Wesley Morris"
    },
    {
      "text": "Many movies...almost require a reverse Turing test - you can't quite believe they were written by humans, rather than number-crunching machines. I'm happy to say Ex Machina would pass.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "A chilly yet engrossing drama, elevated beyond its four-people-locked-in-a-house framework by the eerie beauty of the production design and the thoughtful curiosity of Garland's screenplay.",
      "author": "Inkoo Kang"
    },
    {
      "text": "Ex Machina achieves that rare combination of eliciting both strong thoughts and feelings, and it deserves to be known as a sci-fi classic.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A TED Talk in the form of a movie, with a few creepy twists and suspenseful deceptions that keep the plot moving forward.",
      "author": "William Bibbiani"
    },
    {
      "text": "[O]ne of the finest sci-fi productions of the decade... as intellectually compelling as it is emotionally provocative.",
      "author": "Mark Hughes"
    },
    {
      "text": "Gleeson is terrific and Vikander, who stars in five other films this year alone, is a revelation. As is Ex Machina, a movie that looks like something destined to be savored, watched and re-watched endlessly over the years.",
      "author": "Stephen Rebello"
    },
    {
      "text": "We will be very lucky if we get another movie either as good or better this year.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "...doesn't hold a candle to Spike Jonze's \"Her\" for insights into man's relationship with artificial intelligence. For all its stunning locations, brilliant design and seamless visual effects, the story begs the question 'Is that all there is?'",
      "author": "Laura Clifford"
    },
    {
      "text": "A small sci-fi classic...",
      "author": "Kurt Loder"
    },
    {
      "text": "Shrewdly imagined and persuasively made, \"Ex Machina\" is a spooky piece of speculative fiction that's completely plausible, capable of both thinking big thoughts and providing pulp thrills.",
      "author": "Kenneth Turan"
    },
    {
      "text": "While Mr. Garland wants to tease your brain, he's an entertainer, and in time ditches science and philosophy for romance and action.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Reasonably diverting until its predictable (and predictably misogynistic) outcome.",
      "author": "Mark Jenkins"
    },
    {
      "text": "It's become far too commonplace to overuse the term 'masterpiece,' but Alex Garland's directorial debut comes about as close as you can get.",
      "author": "Edward Douglas"
    },
    {
      "text": "I know, I know. You've seen all this A.I. stuff before. But never like this. Garland is hot for ethical shop talk on what defines humanity or lack of same.",
      "author": "Peter Travers"
    },
    {
      "text": "Sizzlingly smart and agreeably sententious, Mr. Garland's film transcends some all-too-human imperfections with gorgeous images, astute writing and memorably strong performances.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "This is a classic film.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "If any film needed a brief, impromptu hip hop dance scene (Oscar Isaac, predictably, has moves), it's one attempting a treatise on the meaning of existence.",
      "author": "Matt Prigge"
    },
    {
      "text": "It makes up for its linearity with verve, first in the impeccably controlled, intellectually rigorous direction, and then in the performances.",
      "author": "Tasha Robinson"
    },
    {
      "text": "The year's most seductive high-IQ drama.",
      "author": "Richard Corliss"
    },
    {
      "text": "Ex Machina is beautiful and ominous and features another delicately nuanced performance from Isaac, who's quickly making a habit of them. But in the end, for all of Garland's ambition, his reach winds up exceeding his grasp.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "Clever novelist and screenwriter Alex Garland makes a half-dandy directorial debut with Ex Machina, a sci-fi film that - like much of his work - fakes excitingly in the direction of breaking new ground before turning formulaic so fast.",
      "author": "David Edelstein"
    },
    {
      "text": "For a first-time director, Garland seems assured. His sharp, sparse dialogue and meticulous direction are equally compelling, and the trio of lead performances are top-notch.",
      "author": "Claudia Puig"
    },
    {
      "text": "Make no mistake, this is a film of ideas-sadder, quieter, more delicate than the Hollywood sci-fi standard-where every sliding wall of opaque glass suggests something about technology and the way people would use it.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "It's the film version of an iPhone: small, expensive-looking and a touch overhyped - plus an addictive sales pitch for whatever Garland makes next.",
      "author": "Amy Nicholson"
    },
    {
      "text": "It doesn't quite add up in the end, but it's heady stuff anyway, dense with moments of shivery beauty and frightening ideas.",
      "author": "Kyle Smith"
    },
    {
      "text": "An intriguing four-character sci-fi drama about explorers of artificial intelligence.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "\"Ex Machina\" shows there's still life left in tales of artificial intelligence.",
      "author": "Joe Neumaier"
    },
    {
      "text": "By going deep on a simple construct, Ex Machina establishes itself as a unique and deeply unsettling psychological thriller that's both necessary and unforgettable.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "With uncommon intelligence and the even more uncommon ability to look without blinking, Garland's made the one of the best sci-fi films of the past several years, a wicked and wise parable of the near-now that's honed to a gleam.",
      "author": "James Rocchi"
    },
    {
      "text": "[VIDEO ESSAY] Smart, sexy, and back-loaded with a terrific twist ending, \"Ex Machina\" is an elegant sci-fi movie that considers the possibilities of artificial intelligence in thought-provoking ways.",
      "author": "Cole Smithey"
    },
    {
      "text": "Wickedly smart and often wickedly funny, this delightfully entertaining science fiction drama is one of the best films of the year.",
      "author": "Scott Mendelson"
    },
    {
      "text": "'Ex Machina' is a very cool science-fiction movie.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Beautifully crafted, but empty at its core.",
      "author": "Ethan Alter"
    },
    {
      "text": "\"Ex Machina,\" despite the stutters, slowly finds its grip and starts to squeeze.",
      "author": "Anthony Lane"
    },
    {
      "text": "A sleek, good-looking meditation on the nature of artificial intelligence, on what happens when we create robots that can pass for human.",
      "author": "Joe Gross"
    },
    {
      "text": "The real question may be: can our philosophies about artificial intelligence evolve with our stories?",
      "author": "Fred Topel"
    },
    {
      "text": "Might not be the first film about the dangers inherent in giving robots free will, but it's certainly one of the most accomplished.",
      "author": "Scott Weinberg"
    },
    {
      "text": "There comes a point where, if we have been paying attention, we know what will happen once a character walks out a door.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "In the end, more than just the machine remains an enigma.",
      "author": "Ed Gonzalez"
    },
    {
      "text": "It's a very smart movie and seems to almost be cognitive of what the audience is thinking ... one of the best pure sci-fi movies to come out in a very long time.",
      "author": "Mike Ryan"
    },
    {
      "text": "...[Ex Machina] never stops being slick, cool, and polished, its intelligence not artificial at all.",
      "author": "Eric D. Snider"
    },
    {
      "text": "A confident, engrossing debut.",
      "author": "Matt Singer"
    },
    {
      "text": "Like the artificial intelligence at its center, EX MACHINA is an experience that is both cerebral and sensual. It's riveting. It has secrets. And it will certainly surprise you.",
      "author": "Meredith Borders"
    },
    {
      "text": "It's a place where man's social retardation and his sexual fantasies collide.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Compelling, claustrophobic, cutting edge and clever, Ex Machina is as smart and satisfying as science fiction gets.",
      "author": "Peter Turner"
    },
    {
      "text": "An intriguingly stripped-down sci-fi thriller about artificial intelligence that's fully attuned to its more blockbuster elements yet pleasingly cerebral at the same time.",
      "author": "Alistair Harkness"
    },
    {
      "text": "The film touches an exposed nerve: the nagging fear that sometime in the not-too-distant future computers will outstrip and outsmart their creators.",
      "author": "Jason Best"
    },
    {
      "text": "This is knowingly seductive sci-fi cinema, its slyly subversive allegiances hidden by the two-way mirror of the silver screen, its androids dreaming of much more than mere electric sheep.",
      "author": "Mark Kermode"
    },
    {
      "text": "Closer to Caryl Churchill's stage play A Number than to, say, THX-1138, this tight, tense virtual three- hander sings with creative disharmony.",
      "author": "Donald Clarke"
    },
    {
      "text": "There's nothing fresh or even usefully true in its cartoonish dichotomy about men, but this pseudo-SF flick will expound upon it with pretentious tedium.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Cool! It's a trip! All Alex Garland's creations are a trip.",
      "author": "David Sexton"
    },
    {
      "text": "Garland has produced something seductively strange, consistently thought-provoking and admirably adult.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Its thought-provoking themes will gnaw at your own humanity long after the shocking finale has bowed.",
      "author": "John Nugent"
    },
    {
      "text": "Novelist and screenwriter Alex Garland's first film as a director takes some very old ideas and gives them an ingenious new spin.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "There are sweeping helicopter shots and chic cinematography but this three-hander isn't cinema: it's a Ted talk shot in a boutique hotel, with ideas about consciousness and evolution itemised rather than dramatised.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "Ex Machina is a smart, tricksy study of artificial intelligence and tech-sex that explores a credible near-future take on the man-machine relationship.",
      "author": "Wendy Ide"
    },
    {
      "text": "Ex Machina feels like an elegant SF short story with a droll twist that has been pumped up and sexed up into an over-bulky feature film. But it's managed with confidence.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Smart, swanky, a little inhuman and preternaturally well crafted.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Slick and seductive, this exploration of artificial intelligence may essentially only have three characters, but it's complex, provocative and thoroughly engaging.",
      "author": "Rich Cline"
    },
    {
      "text": "Stylish, elegant, tense, cerebral, satirical and creepy. Garland's directorial debut is his best work yet, while Vikander's bold performance will short your circuits.",
      "author": "Dan Jolin"
    },
    {
      "text": "Feels like a pathway to grander things for Garland.",
      "author": "David Jenkins"
    },
    {
      "text": "\"Ex Machina\" is one of the headiest and most impressive sci-fi debuts since \"Moon,\" and if we see more than a handful of movies better than it across the next twelve months, 2015 will be a terrific year.",
      "author": "Oliver Lyttelton"
    },
    {
      "text": "The lush setting avoids the stifling grey look of so many other sci-fi films and the commendably-restrained special effects are as outstanding as the three fast-rising lead actors.",
      "author": "Graham Young"
    },
    {
      "text": "This is bewitchingly smart science fiction of a type that's all too rare. Its intelligence is anything but artificial.",
      "author": "Robbie Collin"
    },
    {
      "text": "As thoughtful as it is thrilling, Ex Machina is a razor-sharp and nimble character drama which takes a controlled nosedive into exhilarating sci-fi horror.",
      "author": "Emma Dibdin"
    },
    {
      "text": "There's no little hint of Kubrick and Hitchcockian paranoia to Alex Garland's debut as writer-director, a nifty, quasi-Gothic three-hander of great performances and unerring control.",
      "author": "Chris Fyvie"
    },
    {
      "text": "A bit more intelligence would not have gone amiss.",
      "author": "Trevor Johnston"
    },
    {
      "text": "Ex Machina is smart, sexy and thrilling sci-fi filmmaking at its most fascinating.",
      "author": "Liam Dunn"
    },
    {
      "text": "There's a lot going on here. But don't think for a second this is troublesome critic-fodder. It's thrilling.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "A smart, accomplished piece of work that presses all the right buttons.",
      "author": "Siobhan Synnot"
    },
    {
      "text": "Gleeson convinces as a desperate-to-please, ambitious young coder. Isaac's difficult-to-read, drunken, pumped-up mad scientist is disquieting and Vikander excels in a demure and shifting role.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "Garland cleverly keeps us on our toes by constantly toying with our allegiances.",
      "author": "Andy Lea"
    },
    {
      "text": "Anchored by three dazzling central performances, it's a stunning directorial debut from Alex Garland that's essential viewing for anyone with even a passing interest in where technology is taking us.",
      "author": "Chris Tilly"
    },
    {
      "text": "Multi-faceted and nuanced, each with so many subtleties and complexities Ex_Machina is a film bursting with ideas.",
      "author": "Stefan Pape"
    },
    {
      "text": "For dystopian future-shock fans who can look beyond its basic design flaws, Garland's feature debut functions just fine as superior pulp sci-fi.",
      "author": "Stephen Dalton"
    },
    {
      "text": "A thoughtful and at times unnervingly sly film that makes the very most of the burgeoning star power of Alicia Vikander, Oscar Isaac and Domhnall Gleeson.",
      "author": "Mark Adams"
    },
    {
      "text": "Garland's long-anticipated directorial debut synthesizes a dizzy range of the writer's philosophical preoccupations into a sleek, spare chamber piece ...",
      "author": "Guy Lodge"
    }
  ],
  "release_year": 2015,
  "duration": 108,
  "genres": [
    "Sci-Fi",
    "Mystery & Thriller",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "Caleb Smith (Domhnall Gleeson) a programmer at a huge Internet company, wins a contest that enables him to spend a week at the private estate of Nathan Bateman (Oscar Isaac), his firm's brilliant CEO. When he arrives, Caleb learns that he has been chosen to be the human component in a Turing test to determine the capabilities and consciousness of Ava (Alicia Vikander), a beautiful robot. However, it soon becomes evident that Ava is far more self-aware and deceptive than either man imagined.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/dmJW8IAKHKxFNiUnoDR7JfsK7Rp.jpg"
}