{
  "movie_name": "Extraction",
  "movie_id": "extraction_2020",
  "total_reviews": 222,
  "reviews": [
    {
      "text": "“Extraction” is a sure-fire winner, showcasing a powerful story of redemption, and introducing intriguing characters, some of whom may surprise viewers.",
      "author": "Ian Kane"
    },
    {
      "text": "The charisma and intensity of these actors tries visibly hard to render Extraction the raw urgency its mildly ambitious setting incessantly craves.",
      "author": "Sukanya Verma"
    },
    {
      "text": "Despite its rather frustrating storytelling issues, Hargrave’s “Extraction” remains a compelling action thriller that continues to hold your attention throughout by its sheer kinetic power.",
      "author": "Ankit Ojha"
    },
    {
      "text": "Even as Extraction never falls for anything truly reprehensible, it muddles the big picture by allowing itself to be a pawn in politics that define an entire country for the worse.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "In the end, Extraction is going to be remembered for its insane action and a fantastic lead performance by Chris Hemsworth.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Ultimately unable to escape its genre roots... it is difficult not to enjoy a film where a man called Rake kills two men with a rake!",
      "author": "Dallas King"
    },
    {
      "text": "It doesn’t want to be character study or a think piece. It’s not interested in commentary or metaphors. Instead “Extraction” is a throwback to the better action movies of the late 80’s to mid-90s. It’s straightforward, unapologetic, and an absolute blast.",
      "author": "Keith Garlington"
    },
    {
      "text": "With its fidgety two-hour runtime and the nonstop procession of gunfire and explosions, Extraction grows tedious, largely as a fault of the screenplay.",
      "author": "Brian Eggert"
    },
    {
      "text": "Extraction never quite reaches the level of a great film. But, it is a film that channels the action films of yesteryear to provide much-needed quarantine entertainment for all cinephiles.",
      "author": "David Gonzalez"
    },
    {
      "text": "The action is mostly clean and precise, a clear indication of Hargrave's foundation and the respect he has for what these stunt people do.",
      "author": "Daniel Gorman"
    },
    {
      "text": "Dumb, derivative and far too serious, Chris Hemsworth's latest is still a whole heap of fun...",
      "author": "Paul M. Bradshaw"
    },
    {
      "text": "Extraction is one of those mostly brainless action movies that is best enjoyed for the intensity of its fight and chase scenes. If you can focus on those and not the story, you're in for a fun time.",
      "author": "Alex Bentley"
    },
    {
      "text": "It's nothing we hadn't seen before, but when it comes to its action and its stunt work, it's something we haven't seen done this well for quite some time.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "Hits like a ton of bricks...dumb as a sack of rocks.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "'Extraction' is indeed full of shootouts, fight sequences and chase scenes. The body count is relentless. But amid all of the action, the relationship between fathers and sons is at the heart of the film.",
      "author": "Joey Morona"
    },
    {
      "text": "\"Extraction\" is a bone-rattling, epic fifteen rounds of urban warfare rescue mission with a soulful and redemptive career-best dramatic performance from Hemsworth.",
      "author": "Blake Howard"
    },
    {
      "text": "Despite Extraction's issues with a very minimal story, it's a lot of fun. The action is a non-stop, hyperventilating barrage of greatness.",
      "author": "Shah Shahid"
    },
    {
      "text": "One does have to watch a lot of the stuntwork through a kind of veil of ineffective camera set-ups and poor visual storytelling.",
      "author": "Tim Brayton"
    },
    {
      "text": "Extraction won't revolutionize the action genre, but it shows that leaving the ones who get the punches in charge of the action is a good idea. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "It's a brutal, pretty joyless action movie that aims to awe with visceral action. But once you get beyond all the bullets and mayhem, you quickly realise that the film doesn't have much else to offer.",
      "author": "Andrew Gaudion"
    },
    {
      "text": "When you're watching a blood-soaked Hemsworth slash and shoot his way through dozens of bad guys, it's difficult to have too many complaints.",
      "author": "Tom Beasley"
    },
    {
      "text": "Patterns are only good to a certain extent. The movie is hilariously predictable. The true and only star is it's stuntman made director Sam Hargrave. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "It's an action thriller that operates with the conventional mechanisms of the genre and does not have the slightest intention of bringing some strength to the plot of the mercenary trapped by his past. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Hemsworth's leading charisma is enough to keep you glued to this (occasionally magnetic) thrill ride.",
      "author": "James Hanton"
    },
    {
      "text": "Accidentally as close as anyone has come to capturing a \"Call of Duty\" game on film (right down to the agreeably over-the-top, very VERY R-rated body-count and blood-spilling.",
      "author": "Bob Chipman"
    },
    {
      "text": "It's a mediocre and humorless suspense film with suffocating dialog and ham-fisted metaphors, however it's immensely popular with viewers.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Extraction's centerpiece is undoubtedly a prolonged, single-take shot that's nothing short of mind-blowing in terms of its audacity and effectiveness.",
      "author": "David Nusair"
    },
    {
      "text": "This is for folks who like Rambo movies with a lot of carnage delivered by likable actors, which Hemsworth is.",
      "author": "Rachel Wagner"
    },
    {
      "text": "An incredibly fun, exciting and action-packed Blockbuster, which I really enjoyed! It's everything we were promised... and not much else. But for a film like this, not much else is really needed... switch your brain off and have some mindless fun.",
      "author": "Dave Lee"
    },
    {
      "text": "It all builds to a sacrificial finale that rips off \"Man on Fire\" with its bridge heroics and \"The Bourne Identity\" with an underwater plunge, only without the Moby soundtrack.",
      "author": "Jason Fraley"
    },
    {
      "text": "Because almost all the main characters in the movie act like killing machines, there's almost a video-game quality to Extraction that's disappointing for a feature film that could have been better.",
      "author": "Carla Hay"
    },
    {
      "text": "The film is bang on with its explosions, gunfights, hand-to-hand combats and chases, all lensed without taking the foot off the pedal. The rest is strictly middling.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "Extraction loses steam fast and it turns into yet another forgettable shooting bonanza. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "Outside of the polished action scenes, there isn't anything offered here that hasn't been done a thousand times before, and better.",
      "author": "Allen Almachar"
    },
    {
      "text": "Hemsworth is a true man of action. He elevates everything here: the story, action, and lasting impact of the film. There's plenty of life after Thor for this fella.",
      "author": "Dan Buffa"
    },
    {
      "text": "Extraction brings a ton of a well organized action scenes that will certainly keep audiences entertained from beginning to end. It has the ruthlessness of a Rambo film mixed with the exciting stunts of a John Wick movie. Unfortunately, that's about all...",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "For a couple of the year's most intense white-knuckle action sequences, action fans will find it worthwhile to overlook Extraction's glaring flaws.",
      "author": "Alex Hudson"
    },
    {
      "text": "Extraction is flawed, especially when it comes to its ending feeling like an indecisive tease, but its extended and bloody action sequences are impressive enough to make Extraction a worthwhile action packed escape for any given evening.",
      "author": "Chris Sawin"
    },
    {
      "text": "There's not much invention here. But the movie knows we've seen enough such films to fill in the blanks ourselves. Extraction is nothing but chassis, but it's sturdy enough to run.",
      "author": "Jacob Lambert"
    },
    {
      "text": "The action is what saves Extraction from being totally written off considering its story and characters are so generic - the screenplay from Joe Russo (Avengers: Endgame) does it no favours.",
      "author": "Wenlei Ma"
    },
    {
      "text": "A bloody, violent, preposterous movie. Chris Hemsworth is convincing even when the story isn't.",
      "author": "Peter Canavese"
    },
    {
      "text": "It's all very kinetic eye candy, beautifully lensed with an array of saturated colors that capture the teeming population with steamy verve. But exhaustion eventually sets in.",
      "author": "Stephen Garrett"
    },
    {
      "text": "Extraction is worth watching for those who are action junkies, but for the casual viewer, it will probably leave something to be desired.",
      "author": "Kt Schaefer"
    },
    {
      "text": "All told, Extraction is a reasonably entertaining, extreme action flick, although you can tell it is more cheaply made than a big-screen movie.",
      "author": "Asia Frey"
    },
    {
      "text": "It's such a fun ride...very early on, it establishes just what it is, and man, the action is true artistry.",
      "author": "Martin Thomas"
    },
    {
      "text": "Its priority is the action, and it does it well, delivering it with charisma and depth...",
      "author": "Korey Coleman"
    },
    {
      "text": "The movie loses points not just for its regressive outlook, but also for its underdeveloped plot, with a basic storyline so dull and predictable that it lacks excitement despite all the conflict.",
      "author": "Sameen Amer"
    },
    {
      "text": "Pull out 'Extraction' for violent, fast-paced action.",
      "author": "Linda Cook"
    },
    {
      "text": "Head shot, body shot, Hemsworth sad, brown people bad, head shot, body shot. That's the rhythm of Extraction, and yes, it's also a white-savior narrative.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Sad Angry Man is played by the largest Hemsworth, Chris. Part of the film's brutality is due to Hemsworth's stupidly massive proportions. If the lithe and nimble Keanu Reeves makes John Wick feel like murder ballet, Hemsworth's Extraction is Stomp.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Extraction, while predictable and a tad overcooked, succeeds as a rousing action flick thanks to incredible set pieces and a strong performance from Chris Hemsworth.",
      "author": "Jeff Ames"
    },
    {
      "text": "Bloody violence, trite story in predictable action tale.",
      "author": "Brian Costello"
    },
    {
      "text": "It's a grimly entertaining viewing experience.",
      "author": "Dominic Corry"
    },
    {
      "text": "The body count is off the scale, yet you may well find the cartoonish violence oddly lulling. I did.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "It has a twist that makes it a not so conventional film within the genre, which does not necessarily make it better, it is only a particularity that is appreciated. [Full Review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "The sheer orchestration of some of the action set pieces is really quite breathtaking.",
      "author": "Mark Kermode"
    },
    {
      "text": "That slip of a setup... triggers breathtaking - and outlandish - action sequences, one of which is a dazzling 11-minute, sorta one-take spectacle... There's even an emotional payoff at the film's end.",
      "author": "Randy Myers"
    },
    {
      "text": "Far superior to Netflix's previous attempts at a big-budget action movie... it turns out that \"Extraction\" is precisely the testosterone-fueled pic we needed until our beloved movie theaters can reopen for business.",
      "author": "Adrian Hennigan"
    },
    {
      "text": "Promises adrenaline and relentless action and that is exactly what it offers, in huge quantities. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "We can see everything from Hemsworth taking apart a room full of luckless goons, a running gun battle through the streets of Bangladesh, and a genuinely gripping car chase with a POV-perspective.",
      "author": "Tim Brennan"
    },
    {
      "text": "Some of the best pure action choreography and cinematography of the past 10 years.",
      "author": "Vincent Mancini"
    },
    {
      "text": "In the end, after all that violence and ceaseless blokey shooting you might be left wondering whether another title might have been more appropriate: Exhaustion.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Much of this feels like a film trying hard to be serious and cinematic, despite ending up as merely one of the better produced Netflix films to come along.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "You digest it like fast food; it's not particularly nutritious, but it does taste good. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "The best thing Extraction has going for it is the camera work. It's just fantastic... The action is well executed and clear. I never found myself wondering what was happening to hammerless Thor, who was shooting at him or who he was shooting at.",
      "author": "Courtney Lanning"
    },
    {
      "text": "A solid, B-grade action thriller.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The difference is in the dizzying and powerful direction of Sam Hargrave. [Full Review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "In a way, it's got the thrill to match, but not much on the substance. It's a shame there's no joy in its characters and story to really give the action something to thrive on.",
      "author": "Melalin Mahavongtrakul"
    },
    {
      "text": "If you need a break from the news and from the urge to be anywhere but your house, Extraction might just be the distraction you need.",
      "author": "Tyler Carlsen"
    },
    {
      "text": "In Extraction, Chris Hemsworth plays a mercenary named Tyler Rake who winds up literally killing someone with a gardening rake. So, it's that kind of movie.",
      "author": "Simon Miraudo"
    },
    {
      "text": "The jewel in the crown of all the masterfully orchestrated mayhem is a brilliantly conceived set piece that combines fire fights, fist fights, car chases, foot chases and even falls from buildings into a continuous 12-minute sequence.",
      "author": "Jim Schembri"
    },
    {
      "text": "Director Sam Hargrave and writer Joe Russo don't seem very interested in the personal histories of these people. The characters are paper-thin.",
      "author": "Anupama Chopra"
    },
    {
      "text": "Extraction offers irrefutable evidence of the fact that there's no point being dumb if you refuse to be smart.",
      "author": "Rahul Desai"
    },
    {
      "text": "Extraction is bold not only for the way it tells its story but the medium in which it has chosen to tell it.",
      "author": "James Berardinelli"
    },
    {
      "text": "Extraction has the look and swagger of higher calibre action-thrillers but lacks their soul.",
      "author": "Victor Stiff"
    },
    {
      "text": "From the moment Hemsworth takes out a room of short-if-cocky kidnappers - he is at least a foot taller than most of them - in the most brutal style, it grabs and does not let go. Visceral, breathless, wince-worthy.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "Chris Hemsworth shines in this dumb as bricks slice of escapism that makes John Wick's action look PG by comparison.",
      "author": "Jimmy Donnellan"
    },
    {
      "text": "That's a lot of serious talent behind this Netflix Original and by and large they pull it off. It's Jaiswal's performance, though, and the subcontinental setting, that lift it beyond the average shoot-'em-up thriller.",
      "author": "Stephen Romei"
    },
    {
      "text": "...it's not clear what Extraction is trying to earn, except more subscribers and bigger bonuses for its streaming service executives.",
      "author": "Noah Gittell"
    },
    {
      "text": "It's a shame this real crowd-pleaser won't be playing to crowds, but it still works as a Friday night, pop-the-popcorn, living room entertainment.",
      "author": "Richard Roeper"
    },
    {
      "text": "I need my action movies to have ACTION. Extraction is cinematic cardio.",
      "author": "Shawn Edwards"
    },
    {
      "text": "...for what it is, right now, in these lockdown times, it does what it needs to: where the good guy, even if he is a white first-worlder saving the slummy third world, one bullet at a time, comes out on top...",
      "author": "Shubhra Gupta"
    },
    {
      "text": "\"Extraction\" gives Chris Hemsworth another kind of heroic role and he lives up to every requirement. This movie is action packed and then some.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Chris Hemsworth's new action vehicle packs up some pretty decent action sequences, but it could have taken benefit from a little originality script wise.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "By now, aren't we past something like 'Extraction?' The exemplary action doesn't distract from the utter brainlessness and soullessness of the entire endeavor.",
      "author": "Witney Seibold"
    },
    {
      "text": "I've seen workout videos that had more interesting dialogue.",
      "author": "Chris Knight"
    },
    {
      "text": "Hargrave's action direction is solid and clean, and there's one absolutely superlative moment... where the director attempts to outdo Atomic Blonde's insane single-shot fight/chase and manages to come reasonably close to doing so.",
      "author": "Nick Johnston"
    },
    {
      "text": "Extraction's visual and narrative flourishes and Hemsworth's charisma make for an enjoyable rollercoaster ride.",
      "author": "James Croot"
    },
    {
      "text": "Hemsworth might just be better at playing characters that share his natural droll charm and smirking sense of mischief. In Extraction, he often looks like he's the one who wants to be rescued.",
      "author": "Dan Jackson"
    },
    {
      "text": "In the end it's the action we will end up remembering. [Full review in Spanish]",
      "author": "Andrea G. Bermejo"
    },
    {
      "text": "The bustling action scenes [are] where it works best. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "It's a very polished action movie with few tropes and plenty of conflicts.",
      "author": "Frantz Jerome"
    },
    {
      "text": "\"Extraction\" is effective and more than a little exhausting, but in a way, the smaller scale helps.",
      "author": "Steve Pond"
    },
    {
      "text": "Cinematographer Newton Thomas Sigel colour grades using a thick sunset orange, apparently believing that evoking the qualities of dusk and creating moody atmosphere are the same thing.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "Who are we rooting for in this accidental parody of the empty absurdity of modern action films? Everyone is awful, or a human macguffin. This is soulless technical wankery bereft of humor or humanity.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "The film is a slight success. Just be prepared for buckets of blood and relatively little substance.",
      "author": "Sean Collier"
    },
    {
      "text": "If the stunt work were mediocre, the entire thing would be an utter waste of time. Thankfully though, Extraction boasts an exhaustingly awesome showcase of expertly choreographed fists, knives, guns, and explosions.",
      "author": "Matt Fowler"
    },
    {
      "text": "There's actually a really nice, emotional story.",
      "author": "Achara Kirk"
    },
    {
      "text": "What caught me... was the emotional aspect of the film.",
      "author": "Jaby Koay"
    },
    {
      "text": "This movie was a lot better than I expected it to be.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "The one big weapon it has - Hemsworth's ability to juxtapose his brawn with approachable charm - is one it never pulls from its holster.",
      "author": "Karen Han"
    },
    {
      "text": "Extraction has some of the best action sequences you can watch right now, and that alone makes it worth the watch.",
      "author": "Kate Sánchez"
    },
    {
      "text": "The first 45 minutes of \"Extraction\" are exhilarating; then we dip into the cat and mouse, backstory and snaky sub-agendas. It saps the energy some, but \"Extraction\" comes back with a flourish.",
      "author": "Tom Meek"
    },
    {
      "text": "Chris Hemsworth gives John Wick a run for his money in the body count department.",
      "author": "Christian Toto"
    },
    {
      "text": "Assuming we can disconnect our minds for about two hours, Extraction is quite fun. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Not only is it very well filmed... but that street chase where the police as well as more and more bad guys intervene is obviously the best of the film. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Everyone in this film is reduced to quick, shallow clichés.",
      "author": "Alci Rengifo"
    },
    {
      "text": "This movie is an action movie that has really entertaining action.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "In the end, Extraction is a solid film if you're looking for action, but falls flat in terms of both character, premise, and performance.",
      "author": "Lauren Coates"
    },
    {
      "text": "It says a lot that the most interesting thing about Extraction is its end credits, which clock in at a staggering 14 minutes. Coincidentally, it's also about 14 minutes into the film that you'll start to lose interest.",
      "author": "Robert Salusbury"
    },
    {
      "text": "Extraction is two hours of shoot-em-up excitement, a big and loud action offering that asks only that you hang on and enjoy the ride...Formulaic? Maybe. Fun? Absolutely.",
      "author": "Allen Adams"
    },
    {
      "text": "Golshifteh Farahani adds a touch of class to the cast, while director Sam Hargrave, making his feature debut, goes all out to put on a spectacle.",
      "author": "Hilary A White"
    },
    {
      "text": "Sam Hargrave's film is basic, but perks up in its action sequences, which are long and relentless in the modern way.",
      "author": "Edward Porter"
    },
    {
      "text": "\"Extraction\" is mainly for hardcore action fans and those who think Chris Hemsworth can do no wrong.",
      "author": "Joey Magidson"
    },
    {
      "text": "Though generically premised, Extraction survives on the strength of its thrillingly brutal action sequences and an entertainingly grizzled Chris Hemsworth performance.",
      "author": "Shaun Munro"
    },
    {
      "text": "Chris Hemsworth comes gunning for Keanu Reeves' title of the most hardcore gun-fu specialist with Extraction.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Very Wick-like, and I'm not just talking about the fights. The terrific action sequences and believable friendship between battle-weary mercenary and drug lord's son help Extraction rise above its cliches.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Extraction is an overstuffed rescue mission that delivers heart-racing action but never keys into any further development beyond the sum of corpses on your screen.",
      "author": "Matt Donato"
    },
    {
      "text": "Hemsworth plays a hardened and haunted mercenary (is there another kind?) who is hired to \"extract\" the son of a Bangladeshi drug lord who has been kidnapped by his rival. That's the entire narrative of the story.",
      "author": "Catherine Springer"
    },
    {
      "text": "Extraction is a lackluster and forgettable affair, despite some exciting moments. But then again, most modern war movies are exactly that. Chris Hemsworth is in a movie where stuff blows up and it's free. We're all going to watch it.",
      "author": "Charlie Ridgely"
    },
    {
      "text": "Extraction is nonstop action from beginning to end. If you like war movies, gun fights, and Chris Hemsworth, this is the movie for you.",
      "author": "Tessa Smith"
    },
    {
      "text": "Netflix's new blockbuster Extraction is a stellar action film that channels the best aspects of properties from John Wick to Call of Duty.",
      "author": "Paul Tassi"
    },
    {
      "text": "An emotionally artificial and relentlessly dull affair dressed up in some truly exceptional action. But when the bullets stop flying, you realize there's nothing else there.",
      "author": "John Campea"
    },
    {
      "text": "[I]t is one giant cliché, powered by dozens of smaller ones, from beginning to end.",
      "author": "Brian Viner"
    },
    {
      "text": "Extraction made me laugh and cry. Right here, right now, it's manna from the gods.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "[F]or pure, overpowering thrills, \"Extraction\" delivers.",
      "author": "Adam Graham"
    },
    {
      "text": "What a rush.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Illustrates an important principle in escapist entertainment: you don't have to one-up your predecessors. Sometimes, it's enough to replicate what made them successful.",
      "author": "Robert Levin"
    },
    {
      "text": "It is bombastic and vibrant and gives Hemsworth the chance to use a rifle rather than a magic hammer. Alas, the script falls short of the production values.",
      "author": "Jamie East"
    },
    {
      "text": "I didn't hate it, but I also felt like I had already seen this movie a hundred times before.",
      "author": "Angie Han"
    },
    {
      "text": "There's a lot of style, craft, and ambition on display for a first-time filmmaker, and it's an opportunity for Chris Hemsworth to show some actual dramatic range.",
      "author": "Christy Lemire"
    },
    {
      "text": "The film has no surprises. \"Extraction\" is another in a dreary lineage of Chris Hemsworth roles that seem designed to make you forget everything you liked about Chris Hemsworth.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "As preposterous as it is, it's just one of those dumb action films that we all love... If you just like nonstop action and body count, then it really delivers.",
      "author": "Wade Major"
    },
    {
      "text": "The fight scenes are plastic and glossy. Hargrave mistakes gore for cool and technical prowess for choreography, deploying overlong one-take shots that look like \"Call of Duty\" outtakes.",
      "author": "Devika Girish"
    },
    {
      "text": "It's all rather cartoony and self-aware, yet still not as much fun as it ought to be.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "We live in a post-John Wick and M:I: Fallout world, so the bar has been set high. Extraction deserves to be mentioned in the same breath.",
      "author": "John Serba"
    },
    {
      "text": "... pure adrenaline-fueled escapism, best enjoyed with your brain set to autopilot. However, its video-game mentality becomes repetitive, pounding more than just the bad guys into submission.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "An exhilarating surprise.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Amazing photography, stunts and locations, an old-fashioned macho yarn.",
      "author": "Anne Brodie"
    },
    {
      "text": "Extraction is one of those genre movies with incredible action but standard characters in a standard plot. That's fine. Steven Seagal and Jean-Claude Van Damme made a lot of those and they were fun too.",
      "author": "Fred Topel"
    },
    {
      "text": "Extraction feels like a cliche but when there's nothing else around cliche feels awfully good.",
      "author": "Matthew Razak"
    },
    {
      "text": "Sam Hargrove frames the carnage in well-edited, easy-to-follow chunks.",
      "author": "Odie Henderson"
    },
    {
      "text": "Action heroes aren't assigned one-liners anymore. Instead they get tragic backstories.",
      "author": "Sean Burns"
    },
    {
      "text": "A great action film for fans of the genre. [Full Review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "It's impossible to escape its slow pace, virtual absence of humor, and the itchy feeling that we're watching a Badass White Dude clean up the streets of an animalistic Third World.",
      "author": "Clint Worthington"
    },
    {
      "text": "Attempts to splice Rake's soulful sorrow with the carnage rarely work, in a film which largely operates in a world as unreal as Asgard. Only when the muscular momentum climaxes on a body-strewn bridge do emotion and action merge.",
      "author": "Nick Hasted"
    },
    {
      "text": "Extraction features a Chris Hemsworth more badass than Bond and more brutal than Bourne, and Sam Hargrave's debut feature will hopefully serve as a launching platform for this to be an action-packed new franchise on Netflix.",
      "author": "Josh Wilding"
    },
    {
      "text": "Closing credits make up 12% of the running time, which would suggest 88% actual movie. A pity, then, that the actual percentage of effort on all fronts - from Chris Hemsworth's performance to the alleged action bonafides - is much lower.",
      "author": "Nick Rogers"
    },
    {
      "text": "\"A rival drug lord. A kidnapped kid. Impossible odds,\" reads the blurb under Extraction, a violent yet entertaining action flick now streaming on Netflix... a more fitting one would be to compare it to running a marathon without water breaks.",
      "author": "Asher Luberto"
    },
    {
      "text": "One could wring a towel dripping with the unexpected mix of blood and suds.",
      "author": "Don Shanahan"
    },
    {
      "text": "Hemsworth holds his own as a different sort of superhuman entity, the kind of ultra-macho, near-invincible hero that populated the action films of yesteryear... if you need a quick action fix while quarantining, Extraction will do the job nicely.",
      "author": "Brent Hankins"
    },
    {
      "text": "The action sequences are staged and executed so expertly that they should engage viewers currently wrestling with any number of pent-up, stay-at-home issues and allow for a cathartic release. (Full Content Review for Parents also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Now, if you primarily watch \"Extraction\" for the action alone, this is where the movie excels the most.",
      "author": "Casey Chong"
    },
    {
      "text": "Chris Hemsworth may be appealing but the Thor star alone isn't necessarily enough to save Extraction.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Sam Hargrave's vision, giving gloss to the grime and gravitas, collapses under the narrative's constant barrage of clichés, convolution and contrivance.",
      "author": "Courtney Howard"
    },
    {
      "text": "Netflix aims to extract bored stay at homers with latest mindless action flick.",
      "author": "Dustin Chase"
    },
    {
      "text": "Sam Hargrave's work as a stunt coordinator truly shines in his directorial debut with an action pack thriller that keeps you on the edge of your seat.",
      "author": "Sharronda Williams"
    },
    {
      "text": "Dumb, but kinda fun, I liked Extraction far more than I should have and would have bloody loved to watch it on the big screen.",
      "author": "Kate Rodger"
    },
    {
      "text": "Chris Hemsworth's action filled 'Extraction' is the closest thing to a summer blockbuster this year",
      "author": "Nate Adams"
    },
    {
      "text": "Chris Hemsworth and the Russo Brothers team up again for an a pulsating action movie that ought to blow the roof off of Netflix.",
      "author": "Pete Hammond"
    },
    {
      "text": "It's just a wild, explosive ride.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "About 90 percent of the movie involves running, crashing, bone-breaking, shooting, punching and tossing out of windows, and the remaining 10 per cent is composed of threats, plot twists and sentimental backstory.",
      "author": "Liam Lacey"
    },
    {
      "text": "As pure movie kinesis, it's a trip.",
      "author": "Ty Burr"
    },
    {
      "text": "Sam Hargrave's directing debut is impressive thanks to the action choreography and camera work. Chris Hemsworth is great in full-on action mode. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "There's no shortage of gunplay, grenades, and hand-to-hand combat on Extraction - but little else.",
      "author": "Akhil Arora"
    },
    {
      "text": "In the end, Extraction must be added to such Netflix entries as Triple Frontier, 6 Underground and Bright as yet another frustrating example of the streaming giant's inability to emulate the blockbuster form.",
      "author": "Kevin Maher"
    },
    {
      "text": "[M]uch like such similarly styled, high-octane Netflix efforts as 6 Underground and Spenser Confidential, it feels a bit like slumming for its movie star leading man.",
      "author": "Frank Scheck"
    },
    {
      "text": "The type of Hollywood action film that had all but disappeared and is a refreshing entry to the genre. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "[Hemsworth] seems more at home here than he has in so many of his non-Thor projects... Hargrave similarly proves his fortitude as a director.",
      "author": "Richard Lawson"
    },
    {
      "text": "Very strong action film! Excellent fight scenes & camera work! Fantastic directorial debut by former Marvel stunt coordinator Sam Hargrave. Hemsworth lends real star power.",
      "author": "Grace Randolph"
    },
    {
      "text": "\" Extraction,\" is entirely sincere and also pretty fun.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "This is not going to win any award for performance, direction or script but you and I don't care, because is ridiculously fun, gritty, absurd and perfect to distract us for its duration. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "Alas, efforts to fuse Rake's tragic past and Ovi's apparently hopeless present into a redemptive arc are grounded in cliché, Joe Russo's script falling short of its emotional target weight.",
      "author": "Matthew Leyland"
    },
    {
      "text": "Sometimes it's refreshing when a movie is just an improper noun that delivers what it promises.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Working with a script from a familiar name in the Marvel Comics Universe, Hemsworth gets to channel his inner John Wick in this solid action flick.",
      "author": "Micheal Compton"
    },
    {
      "text": "\"Extraction\" would be better if it just doubled down on being dumb.",
      "author": "Mark Olsen"
    },
    {
      "text": "Hargrave can't keep his feature running at top speed, but he has a special vision for the picture's offerings of ultraviolent bedlam, and that's what holds the whole thing together.",
      "author": "Brian Orndorf"
    },
    {
      "text": "... proves to be a straight-forward, if silly action role for Chris Hemsworth to chew on and spit out.",
      "author": "Travis Hopson"
    },
    {
      "text": "It accomplishes its main mission with extraordinary action scenes. [Full review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Extraction's players do their jobs well, and they do them in service of some genuinely terrific action.",
      "author": "Justin Harrison"
    },
    {
      "text": "Director Sam Hargrave is obviously an admirer of contemporary genre titans Chad Stahelski and Gareth Evans, but with his feature debut he proves he's not just a fan but a similarly skilled peer.",
      "author": "Daniel Rutledge"
    },
    {
      "text": "Even without his hammer, Hemsworth still conjures a few sparks. But with apologies to his last collaboration with the Russos, Extraction feels like the short end of the stick.",
      "author": "Brian Lowry"
    },
    {
      "text": "Come for the action, ignore the rest.",
      "author": "Rob Hunter"
    },
    {
      "text": "Featuring some of the most exhilarating & ambitious action sequences & fight choreography since John Wick, Extraction is an outstanding directorial debut.",
      "author": "Nicola Austin"
    },
    {
      "text": "Extraction is an amusing thrill ride with some highly stimulating action sequences. What it lacks in uniqueness in plotting is more than made up for in its impressive achievement in physical stunts.",
      "author": "Robert Butler III"
    },
    {
      "text": "The action rolls along like something out of a video game but without the forward momentum and love for characters that the Russo Brothers gave us in the Marvel Cinematic Universe.",
      "author": "Lewis Knight"
    },
    {
      "text": "What makes \"Extraction\" a little different - that is, different enough to be good - is that Hemsworth carries this history with him, from scene to scene.",
      "author": "Mick LaSalle"
    },
    {
      "text": "'Extraction' isn't a terrible movie, but it's not just terribly great either. The action is sharply done and it pulls along at a brisk pace, but it's when things slow down that you begin to notice it's running on fumes.",
      "author": "Brian Lloyd"
    },
    {
      "text": "No judgments here if you just want to hang back and let nonstop gore, gunfire, explosions and a gung-ho Chris Hemsworth numb you into submission. Take that, COVID-19.",
      "author": "Peter Travers"
    },
    {
      "text": "Beyond some credible ambience, it's a mostly characterless affair, led by a likeable but somnolent Hemsworth in a narrative which paddles about in superficial details and motivations.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Riddled with more clichés than bullets.",
      "author": "David Crow"
    },
    {
      "text": "The only thing on its mind is finding as many ways to bash skulls, slice arteries, and crunch bones. Athletic though it may be, when this picture isn't grotesque, it's an absolute bore.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "With Extraction, one gets the sense that the Chris Hemsworth watched The Raid, or Keanu Reeves' John Wick series, and thought, \"Why not me?\"",
      "author": "Sean O'Connell"
    },
    {
      "text": "Stunt coordinator Sam Hargrave makes his feature directing debut with a impressive flurry of outrageous shootouts, fistfights and explosions.",
      "author": "Rich Cline"
    },
    {
      "text": "As an obvious and disposable piece of entertainment, \"Extraction\" will satisfy those watching movies at home. It's just not one to plan your next Netflix Party around.",
      "author": "Matthew Passantino"
    },
    {
      "text": "Extraction keeps its promises and finds Hemsworth as the ideal lead for this action-packed film. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "As comfortable in the confines of a corridor as bombing it about in a car chase, Extraction exhibits an ingenious, sometimes amusingly irreverent approach to action...",
      "author": "Emma Simmonds"
    },
    {
      "text": "Joe Russo (one half of the Russo brothers) has managed to sell on a script which feels like something he fished out of the bottom of a draw that's very low to the ground on account of the fact that he doesn't use it very often.",
      "author": "David Jenkins"
    },
    {
      "text": "If you can overlook the racial politics and are in the market for a film that does what Extraction does, Extraction does it in high style, a stuntman's symphony.",
      "author": "Danny Leigh"
    },
    {
      "text": "Extraction mostly delivers what its swaggering trailer promises: international scenery; insidious villains; a taciturn, tree-trunk Aussie.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Extraction doesn't play to any of [Hemsworth's] strengths except for literal physical strength. He shows off impressively sculpted muscles, but the character he plays might as well be a statue.",
      "author": "Josh Bell"
    },
    {
      "text": "Despite the spectacular stunt work, Extraction is a garden-variety action-thriller dragged down by its regressive white savior elements.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "As far as disposable action flicks go, Extraction makes good on its promise of seeing Chris Hemsworth kill a lot of people. Maybe that's good enough for a direct-to-Netflix release.",
      "author": "Chris Evangelista"
    },
    {
      "text": "As a Netflix release, the film is literally a glorified direct-to-video action movie-albeit one that lacks the momentum and efficiency that defines the best entries in the DTV category.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "It's a vision of foreign brutality treated as wholly interchangeable, without the weight of political or social consciousness.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Exquisite action, but suffers from some clumsy melodrama and an over-the-top ending.",
      "author": "Chris Bumbray"
    },
    {
      "text": "So, it's good enough to take a shot on, especially after a stressful day of isolated modern life. But just one shot.",
      "author": "Barry Hertz"
    },
    {
      "text": "It packs some of the visceral punch of a Tony Scott action thriller but little of the heart: not so much Man on Fire as Man Smouldering Gently.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "'Extraction' features truly superb action sequences, and it's one of the few attempts by Netflix to mimic an old-school Hollywood blockbuster that feels like the genuine article.",
      "author": "Scott Mendelson"
    },
    {
      "text": "It's the kind of solid star vehicle that isn't as common as it once was - and an enjoyable way in which to spend a couple of hours.",
      "author": "Patrick Cremona"
    },
    {
      "text": "Powered by the charisma and physicality of its star, this often gruelling action flick does more than enough to suggest that Hemsworth has found his genre, once he hangs up a certain hammer.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Extraction is a little bit hokey and absurd, and the very end has an exasperating cop-out - but it has to be admitted that, in terms of pure action octane, Russo and Hargrave bring the noise...",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Simultaneously no-nonsense and all-nonsense.",
      "author": "Robbie Collin"
    },
    {
      "text": "The movie comes alive for one truly impressive action scene; it's a bit of a slog until that point.",
      "author": "Matt Singer"
    },
    {
      "text": "There's a fine line between awe and tedium, and sometimes not even Chris Hemsworth is able to blur it for us.",
      "author": "David Ehrlich"
    },
    {
      "text": "Chris Hemsworth's hyperbolically skilled soldier is borne of childish fantasies about the order of the world.",
      "author": "Pat Brown"
    },
    {
      "text": "It's the action that matters most to them, so check your brain going in. But if the only exercise you're getting is from the couch to the kitchen these days, it's liable to get your heart racing just a little, and that's not a bad thing.",
      "author": "Peter Debruge"
    },
    {
      "text": "It's that rare Netflix movie where you really wish you could have seen it on the big screen as it's blockbuster-level action.",
      "author": "Ian Sandwell"
    },
    {
      "text": "I would have loved to see this on the big screen, even if it was a press screening at Netflix's newly-managed Paris Theater.",
      "author": "Edward Douglas"
    },
    {
      "text": "While the story itself is nothing special, Extraction delivers a heavy dose of adrenaline with wonderfully choreographed action set pieces.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "If you love hard-hitting films like Atomic Blonde, The Raid 2: Berandal, and any of the John Wick films, which have that put-you-in-the-action feel, cue up Extraction and scratch that itch.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Featuring one of the most stunning action scenes in recent memory, Chris Hemsworth's Netflix film, produced by the Russo Brothers, is the bonkers shot of adrenaline that we need right now.",
      "author": "Rohan Naahar"
    }
  ],
  "duration": 117,
  "genres": [
    "Action",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "A black-market mercenary who has nothing to lose is hired to rescue the kidnapped son of an imprisoned international crime lord. But in the murky underworld of weapons dealers and drug traffickers, an already deadly mission approaches the impossible.",
  "popularity": 7.1
}