{
  "movie_name": "Fast & Furious 7",
  "movie_id": "furious_7",
  "total_reviews": 278,
  "reviews": [
    {
      "text": "The last five minutes of this film might just have the toughest tough talker in the audience reaching for the tissue box.  Mayhem gives way to satisfying beauty and the family did right by their fallen brother.",
      "author": "Don Shanahan"
    },
    {
      "text": "... the character is ladled on thick and the stunts are so outrageous that you either dismiss the whole thing out of hand or go with the madness and enjoy the ride.",
      "author": "Sean Axmaker"
    },
    {
      "text": "The film features some wild stunts and really drives home the family theme that has come to dominate the series.",
      "author": "Brett Doze"
    },
    {
      "text": "A heartfelt send-off, giving this entry more emotional weight than would be usual. Its primary focus, however, is still on being absurdly entertaining.",
      "author": "Olly Richards"
    },
    {
      "text": "But let’s be honest and true, nobody goes to a “Fast and Furious” movie for the performances. It’s all about the cars and the action. We get a lot of both.",
      "author": "Keith Garlington"
    },
    {
      "text": "Your brain cells will be pummeled into submission over the course of an overlong two-hours-and-seventeen-minutes; your tolerance for subpar acting will be tested, and then some; but those in the mood for such diversions will be delighted.",
      "author": "Brian Eggert"
    },
    {
      "text": "Nearly a decade later, Furious 7, the sixth  sixth  sequel in the fascinating Fast and the Furious franchise, takes seemingly-impossible stunts to a whole new level  rather, a whole new solar system.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The zenith of the series' inspired ridiculousness before it began feeling overegged, Furious 7 offers a strong tribute to Paul Walker and would've frankly been a mighty ending for the entire enterprise.",
      "author": "Shaun Munro"
    },
    {
      "text": "Furious 7 is something to see, strictly for the pure adrenaline and entertainment.",
      "author": "Leo Brady"
    },
    {
      "text": "The true shame is that, despite zero constraints on the magnitude of potential action sequences, few of the extravagant set pieces actually contain anything conceptually new.",
      "author": "Mike Massie"
    },
    {
      "text": "Fast & Furious 7 certainly is the Ultimate tribute to Paul Walker; some of the scenes just make you want to cry...",
      "author": "Tony Asankomah"
    },
    {
      "text": "After losing one of the stars in 2013, Furious 7 brings emotion as they always have.",
      "author": "Dan Buffa"
    },
    {
      "text": "Essentially an action-packed and thrilling adventure with a thread of humanity.",
      "author": "Richard Propes"
    },
    {
      "text": "Despite the faults, Fast and Furious 7 is every bit as entertaining as its predecessors with an emotional weight that holds the film together for all the right reasons.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "There's a sincerity here that packs a surprisingly emotional counterpoint to the action.",
      "author": "Allen Almachar"
    },
    {
      "text": "Watching Furious 7, you get the distinct impression that, when faced with a creative choice, the filmmakers paused to ask themselves, \"What's the most insane, over the top thing we can do here?\" Then they went ahead and did that.",
      "author": "Brent McKnight"
    },
    {
      "text": "[Delivers] entertaining stunt action and [combines] it with a fun plot that not only keeps its sense of humor, but also contains a good deal of heart and emotion.",
      "author": "Damond Fudge"
    },
    {
      "text": "If you leave logic at the door, buy the biggest popcorn bucket the theater has to offer, and want to have fun- Furious 7 is the film that will take you on the ride you're looking for.",
      "author": "Brandon Davis"
    },
    {
      "text": "\"Furious 7\" is probably one of the most ridiculous non-stop action rides you'll see this year. It's also probably one of the few action films which will also reduce you to tears by its end.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Convoluted as the story is, the way they say goodbye to Paul was well done and really very poignant.",
      "author": "Leslie Combemale"
    },
    {
      "text": "\"Do we really need another Fast and Furious movie?\" No. No we do not. We also didn't need to land on the moon. Nor did we need to create the 1967 Ford Mustang. We did it because it was awesome and we could, dammit.",
      "author": "Ryan Syrek"
    },
    {
      "text": "We want these films to go on forever, and perhaps they will; but, for now, this is a fine film to ride off into the sunset to.",
      "author": "Dominic Griffin"
    },
    {
      "text": "If this is the end of an era, it's ended on a high note.",
      "author": "Phil W. Bayles"
    },
    {
      "text": "Furious 7 is respectful, even solemn, when it needs to be, but is still, thank God, plenty of crazy fun.",
      "author": "Richard Lawson"
    },
    {
      "text": "We deserve better than this.",
      "author": "Josh Dickey"
    },
    {
      "text": "There is a genuine emotional resonance to Furious 7 that is painfully real.",
      "author": "David Crow"
    },
    {
      "text": "Furious 7 is certainly a popcorn movie geared towards delivering big thrills, but it's also oozing with heart and passion.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Why are you even reading a Furious 7 review?",
      "author": "Russ Fischer"
    },
    {
      "text": "Director James Wan (Saw, The Conjuring) may be a dab hand at things that go bump in the night, but action is not his strong point.",
      "author": "Tara Brady"
    },
    {
      "text": "Furious 7 works on the simplest level: Bad guys die, good guys win. Success.",
      "author": "Armond White"
    },
    {
      "text": "You'll walk about with a half-smile, feeling vaguely like you got hit in the back of the head, but in a way that's strangely satisfying.",
      "author": "TK Burton"
    },
    {
      "text": "With Furious 7 they were trying to make an over the top action film and they do a great job with it.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It never takes itself too seriously. It's that playful ability to realize its own absurdity that has helped elevate the franchise as it continues to grow -- both in film numbers and cast members.",
      "author": "Micheal Compton"
    },
    {
      "text": "But perhaps, what\"Furious 7 does best is the simple, eloquent tribute to Walker at the end of the film.",
      "author": "Amanda Greever"
    },
    {
      "text": "While the movie succeeds spectacularly where Walker and his character Brian are concerned, it's far from the franchise's best installment.",
      "author": "Marisa Carpico"
    },
    {
      "text": "The action is huge and outrageous and plentiful and inventive, all good attributes here.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "FURIOUS 7 has found the proper transmission to provide what viewers will expect: little brains and a ton of brawn (and for the first time in a long time, that's perfectly fine).",
      "author": "James Clay"
    },
    {
      "text": "No matter how you feel about these films, the seventh one isn't going to suddenly change your opinion.",
      "author": "Zaki Hasan"
    },
    {
      "text": "It's an entertaining and carefree party of a movie from start to finish, screaming nonsense at the top of its voice and paying no attention to the obvious illogic in its thinking.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Fast cars, gorgeous characters, adrenaline pumping action, and an ending that warms the heart. This franchise isn't for everyone, but it's definitely for me.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Furious 7 is full of absurd, intricate stunt sequences that are quite gleeful in their lack of bearing on reality.",
      "author": "Molly Templeton"
    },
    {
      "text": "This constant bombardment just becomes boring.",
      "author": "Pamela Powell"
    },
    {
      "text": "At this point, the cast can play these roles in their sleep. And it shows. You genuinely believe that they're all friends as a result of their chemistry.",
      "author": "Keith Reid-Cleveland"
    },
    {
      "text": "[Paul] Walker bows out with a fitting send off.",
      "author": "Eli Glasner"
    },
    {
      "text": "That is how you do dude movies.",
      "author": "Andre Meadows"
    },
    {
      "text": "It's an interesting mixture: it's dumb and over-the-top, but also, due to Walker's death, emotional and solemn. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "These movies are about implausibility and giving the middle finger to physics in order to deliver unforgettable fistfights, car chases, one-liners, and non-stop mayhem",
      "author": "Robert Kojder"
    },
    {
      "text": "... Furious 7 is a fitting sendoff for the franchise, not only to the many millenials who grew up with the films but the rest of us who admire them for their penchant for rebellion, diverse casts and, yes, their foolishness.",
      "author": "Candice Frederick"
    },
    {
      "text": "A fitting wake for a lost friend.",
      "author": "Brooke Corso"
    },
    {
      "text": "Furious 7, more so even than its Furious Forefathers, is about people who love each other un-self-consciously (and the way they express said love with their cars).",
      "author": "Carolyn Cox"
    },
    {
      "text": "This installment makes it easy to feel like you've been part of the gang forever, introducing the characters with just the right balance of affection and respect.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Great and familiar cast, excellent script, superb production values and the direction is tight as a drum. Can't say this is the best film of the franchise, because so many of them have been excellent. But it's easily the most daring.",
      "author": "Dwight Brown"
    },
    {
      "text": "Furious Seven is constructed of clichés ('You do whatever you gotta do') and lines that aspire to be clichés ('There's a billion things that's wrong-but not in this moment').",
      "author": "Sonny Bunch"
    },
    {
      "text": "Gleefully sexist (buttttttts!), stupefyingly loud and heart-hurtingly ridiculous, you at least can't accuse Furious 7 of being boring. Or nuanced, or aware of the basic laws of science. But it sure is angry.",
      "author": "Tara Thorne"
    },
    {
      "text": "Dom's various vehicles are vehemently put through the wringer in the engine-block-destroying 'Furious 7.' It's like banging your head between two trash can lids, except fun!",
      "author": "Mark Jackson"
    },
    {
      "text": "Fast 7 delivers exactly what fans want: a high-octane thrillride that's a fitting tribute to its late star.",
      "author": "Chris Schulz"
    },
    {
      "text": "The juvenile implausibility of the stunts has always been the strength of the franchise.",
      "author": "Kong Rithdee"
    },
    {
      "text": "Wan has done an admirable job salvaging the project, but it might have been more at home in the salvage yard, among other abandoned films lost to time and circumstance.",
      "author": "J. Olson"
    },
    {
      "text": "Ultimately though, this was always about the bromance between Dominic and Brian and the film's ending will have the biggest car fans sniffing quietly into their popcorn. But, for now, this one is very much for the fans.",
      "author": "Theresa Smith"
    },
    {
      "text": "While [Paul Walker's] goodbye is heartfelt and important, it hurts the film's standalone capability.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Heavy-hearted, lead footed and energetic as hell, this James Wan directed joint fits right into the franchise.",
      "author": "Neil Miller"
    },
    {
      "text": "The images are breathtaking, as are the ideas that any vehicle could actually handle such abuse, specifically abuse for which they are absolutely and utterly not made to handle.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "With its incredibly entertaining action, this series has plenty of fuel left in the tank.",
      "author": "Alex Zane"
    },
    {
      "text": "As we must do in life, they celebrate his life but move on, giving fans a fitting tribute to one of the men who helped establish what has become one of Hollywood's most formidable franchises.",
      "author": "David Blaustein"
    },
    {
      "text": "The chemistry between Walker and his costars, his friends, gives this muscled sledgehammer of a film some surprisingly gentle moments that you'll think about hours later.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "Another factor that makes Furious 7 highly watchable is director James Wan's commitment to following the action from several characters' points of view within each set piece, and to making that action legible, if rarely plausible.",
      "author": "Margot Harrison"
    },
    {
      "text": "Freshens up the usual over-the-top thrills.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Holding it all together is Diesel, who comes off as a steroid-stoked Buddha; even in the midst of chaos he calmly delivers proverbs in a rumbling basso: \"Everyone's looking for the feel, but what's real is family.\" Whatever.",
      "author": "Robert W. Butler"
    },
    {
      "text": "The crowd cheers. Vin Diesel glowers. At almost 2 1/2 hours it isn't exactly fast, but it's as furious as hell.",
      "author": "Jay Stone"
    },
    {
      "text": "The fact that Furious 7 is messier than any of the past installments is more than mitigated by its grandeur. \"Dom, cars don't fly! Cars don't fly!\" Brian yells before its biggest stunt. Furious 7 makes you believe they can.",
      "author": "Alison Willmore"
    },
    {
      "text": "While the final salute to Paul is sweet, there's so much here that's tiresome -- not least the fact that almost nothing here involving cars is real.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "If you know how to lower your standards you'll have a great time. [Full review in Spanish]",
      "author": "Cuauhtémoc Ruelas"
    },
    {
      "text": "One of the best movies of the year.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Much of the hilarity in these films -- and they really are very funny -- comes from watching the excess as characters try to outdo one another's manliness.",
      "author": "Helen O'Hara"
    },
    {
      "text": "Can you really call a film bad if it achieves exactly what it sets out to achieve?",
      "author": "Josh Terry"
    },
    {
      "text": "Furious 7 ridiculously and often spectacularly forgoes any and all semblance of real world gravitas as its muscle cars race over cliffs, ski down tree-laden slopes and fly through the air.",
      "author": "Stephen Schaefer"
    },
    {
      "text": "The franchise's way of bidding adieu to Paul Walker is tastefully, even touchingly achieved.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "I'm waiting for the scene in this series when Vin Diesel straps himself to a Wile E. Coyote rocket and lights the fuse.",
      "author": "Rob Vaux"
    },
    {
      "text": "The actors are completely secondary. The hoops they jump through to get to the next action scene are just that. The expositional dialogue [starts] only after the action scene has, because they know we don't care why they're there: We're already with them.",
      "author": "Eric Melin"
    },
    {
      "text": "The movie feels stitched together and soldiered-on, with a heart-like-a-wheel coda that's not particularly well-executed, and is weirdly moving all the same.",
      "author": "Sean Burns"
    },
    {
      "text": "It's a franchise of winking ridiculousness, in which the characters take themselves far too seriously while giving you hints that they are in on the gag.",
      "author": "Daniel Gelb"
    },
    {
      "text": "Outlandish as it all is, the movie delivers the goods.",
      "author": "Jim Lane"
    },
    {
      "text": "After cars have been smashed and big-ticket weaponry unleashed, it is really about family, friendship and loss.",
      "author": "Jyoti Sharma Bawa"
    },
    {
      "text": "Try to remember what happened in the last few Fast & Furious films and it will blend into one head-crushingly loud montage of vehicles flipping and exploding.",
      "author": "John Lui"
    },
    {
      "text": "The Fast and Furious franchise hits its nadir with this overlong and aggressively over-the-top entry...",
      "author": "David Nusair"
    },
    {
      "text": "...while the effects shots and stunt work keep you on the edge of your seat, you can't shake that feeling that it's all one Wile E. Coyote gag from a Looney Tunes cartoon.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "... a handful of dazzling action set pieces and impressive stunts will delight fans, even if they don't make much narrative sense or contain much subtlety or surprise.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Either get out of the way or go along for the ride",
      "author": "Robert Denerstein"
    },
    {
      "text": "To really enjoy these films, it is important to understand that at their core, they are comedies.",
      "author": "Bruce Bennett"
    },
    {
      "text": "A big, noisy, ridiculously diverting time, that not only gives a proper sendoff to the character of Brian O' Conner, but manages to be a whole lot of fun in the process.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "The action scenes are ridiculous and implausible, but they are undeniably entertaining. Everything else, though, is drudgery.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Has a heightened sense of mortality giving the series stakes for once, born of tragic circumstances due to the passing of Paul Walker, handled deftly by director James Wan",
      "author": "Cameron Williams"
    },
    {
      "text": "Operating with the same adolescent, bacchanalian glee of a comic book... Furious 7 thrusts the series to new heights of intensity, emotion, and head-shaking absurdity.",
      "author": "Nathanael Hood"
    },
    {
      "text": "If this episode is a little less coherent than the previous two, it's still very much a Fast and Furious movie, which means it's two tons of fun.",
      "author": "CJ Johnson"
    },
    {
      "text": "A captivating combination of camaraderie and cartoon physics tempered by just enough nostalgia to tug at your heartstrings.",
      "author": "Kam Williams"
    },
    {
      "text": "Once you've defeated gravity in one scene, why not just keep doing it?",
      "author": "Linda Cook"
    },
    {
      "text": "The victory lap of Furious 7 proves there's still plenty of gas left in the tank.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "The touching tribute to Walker puts the entire series into perspective and will make many eyes teary. The film's flaws suddenly vanish when you realise that if there is another film in this series, it just wouldn't be the same.",
      "author": "Reagan Gavin Rasquinha"
    },
    {
      "text": "Every time Wan tries to push the emotional envelope with Lettie (Michelle Rodriguez) and Dominic, the ride loses its punch.",
      "author": "Anuj Kumar"
    },
    {
      "text": "Though many scratched their heads when Aussie filmmaker, James Wan, was tapped to replace the departing Justin Lin in the director's chair, he proves to be a perfect fit.",
      "author": "Erin Free"
    },
    {
      "text": "Wan and Morgan, stuffing another plot into the main plot like a cinematic turducken, justify a series of jaw-dropping car stunts in settings such as Azerbaijan and Abu Dhabi.",
      "author": "Sean P. Means"
    },
    {
      "text": "With heroes like these, who needs terrorists?",
      "author": "John Beifuss"
    },
    {
      "text": "Put simply and bluntly, Fast & Furious 7 is great, thrilling, balls-to-the-wall entertainment. It's not only, and easily, the best in the F&F series, it's one of the best car operas you're ever likely to see.",
      "author": "Jim Schembri"
    },
    {
      "text": "Paul Walker's action scenes excite without feeling exploitative and the finale saves it. The bummer is that \"Furious Seven\" needs saving, as too much of it feels more like joyless, obligatory and bereaved due diligence than a fist-pumping thrill.",
      "author": "Nick Rogers"
    },
    {
      "text": "It's pretty great. Or at least, it's pretty much exactly the movie it should be, even with all its lumps and missteps.",
      "author": "Tim Brayton"
    },
    {
      "text": "Rev your engines... and grab the tissues. Furious 7 delivers the same outrageous thrill ride you expect , but tears will also flow for the late Paul Walker.",
      "author": "Kit Bowen"
    },
    {
      "text": "7 disappoints a little because it doesn't go off the rails enough, especially in comparison to the last two movies.",
      "author": "Gary Dowell"
    },
    {
      "text": "Along with all of the nonsense, Furious 7 is built on a series of forced dialogues and a bad mix of different movie genres that make the story hard to believe.",
      "author": "Mabel Salinas"
    },
    {
      "text": "The special effects are simply spectacular.",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "It's becoming increasingly hard to outright dismiss this franchise, even if every nuanced critical bone in my body would love to do so.",
      "author": "Robert Levin"
    },
    {
      "text": "The action and chase sequences are visceral and triumphant but Furious 7 is undone by a misogynistic streak that runs all the way through the movie and director James Wan's relentless objectification of its female characters.",
      "author": "Sam Bathe"
    },
    {
      "text": "The director, James Wan, sends cars repeatedly airborne and seems himself to marvel at the results; the movie's real subject is the stunt work, but its stars' authentic chemistry lends melody to its relentless beat.",
      "author": "Richard Brody"
    },
    {
      "text": "Explosive, spectacular and surprisingly touching, Episode 7 is a fitting tribute to Paul Walker.",
      "author": "Andy Lea"
    },
    {
      "text": "'Furious Seven' is not the best movie in the series. It is a fine farewell tribute to (Paul) Walker and a dizzying popcorn feature.",
      "author": "Bob Bloom"
    },
    {
      "text": "The film-makers give Paul Walker and his Brian O'Conner character a graceful farewell - perhaps that's what's most memorable.",
      "author": "Susan Granger"
    },
    {
      "text": "While there's a deeply sentimental tone throughout, Furious 7 is also the biggest, loudest, and \"holy crap that was incredible!!!\" chapter yet.",
      "author": "Travis Hopson"
    },
    {
      "text": "It's flying cars and explosions. Chitty Chitty Bang Bang Bang Bang.",
      "author": "Nell Minow"
    },
    {
      "text": "I'm not ashamed to say (ok, maybe a little) that I cried like a baby at the end - but I didn't ugly cry. A perfect ending to this 7 film ride and they should just stop now and leave on a high note.",
      "author": "Michelle Alexandria"
    },
    {
      "text": "The action sequences are ridiculously over-the-top... but they're done in a semi-comedic way that is still entertaining.",
      "author": "Matthew Toomey"
    },
    {
      "text": "A deafening orgy of explosions, car chases, well-polished bumpers (human and automotive), explosions, fist-fights and more explosions.",
      "author": "Mark Kermode"
    },
    {
      "text": "As zippy, playful and amiably preposterous as the best of the previous models.",
      "author": "Mark Jenkins"
    },
    {
      "text": "Yes, it's just more junk in the trunk, but it sure leaves your heart racing.",
      "author": "Al Alexander"
    },
    {
      "text": "\"Furious 7\" could have come across as ghoulish, but it's not until the very end that we're reminded of Walker's fate, and the filmmakers handle it with taste and respect.",
      "author": "Richard Roeper"
    },
    {
      "text": "While the story ran out of steam long ago, there's plenty of action and excitement that kept the engine going. Another fun ride and first rate entertainment.",
      "author": "Wilson Morales"
    },
    {
      "text": "The film ends on a sentimental note with a tear-jerking tribute to the late Paul Walker. The audience applauded at the end. I did too. Many of us sat through the credits hoping to see a Fast 8 teaser. There isn't one. None of us want this series to end.",
      "author": "Robert Roten"
    },
    {
      "text": "For now, let's just marvel at how much mileage the studio has gotten out of what are basically 1950s-style \"B\" programmers supercharged for contemporary audiences.",
      "author": "Matt Brunson"
    },
    {
      "text": "The ending of Furious 7 is downright touching...",
      "author": "Josh Larsen"
    },
    {
      "text": "Spectacular stunts, a touching send-off for Paul Walker and pedal-to-the-metal action make this one furiously good - best in the series so far.",
      "author": "Pete Hammond"
    },
    {
      "text": "It's Dom's story -- so fun and funny and exhilaratingly over the top -- that resonates.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "I have now seen all of the Rápido y Furioso movies, and I can recall almost no salient details about any of them.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Rather than simply ignoring physics, it downright defies physics with what we see happen on screen. The result is a giant Looney Tunes car chase for more than two hours.",
      "author": "Kevin Carr"
    },
    {
      "text": "It remains a reliably entertaining series but if its to go on much longer those in creative control will have to sit down and think hard about how to give future sequels more life than pyrotechnic polish.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Fabulously stacked with furiously over the top, in a good way, action. Call it Car Wars.",
      "author": "John Wirt"
    },
    {
      "text": "A tedious, vapid and over-produced bore that will surely please the shallow masses who are unashamedly entertained by bread and circuses.",
      "author": "Avi Offer"
    },
    {
      "text": "Who would have thought that a series addicted to the high of movement could also summon a solemnity that leaves you moved?",
      "author": "Wesley Morris"
    },
    {
      "text": "It's bananas -- a loud, crackpot joyride and you'll love every messed-up minute of it.",
      "author": "Stephen Rebello"
    },
    {
      "text": "The gloriously idiotic, jingoism-tinged pro wrestling morality play that Michael Bay has been trying to make for his entire career.",
      "author": "Vincent Mancini"
    },
    {
      "text": "James Wan (\"The Conjuring\") steps out of his genre to supervise traffic and he does an excellent job.",
      "author": "Paul Chambers"
    },
    {
      "text": "This whole series is little more than adolescent boy wish fulfillment; and as a former adolescent boy that is cool with me.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "A tactful and touching legacy for Paul Walker, \"Furious 7\" is a relentlessly action-packed thrill ride that actually has a story, too. Its fun is propelled by characters you give a frick about even if you've never called yourself a franchise fan before.",
      "author": "Adam Fendelman"
    },
    {
      "text": "Furious 7 is another solid Fast and the Furious installment - one that (flaws aside) provides a nice farewell to star Paul Walker.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "The movie that is staggered by real life tragedy but refuses to be felled; it blurs the line between the world of the characters and the real world in a way that is so effective and affecting that the finale packs a humongous emotional punch.",
      "author": "Devin Faraci"
    },
    {
      "text": "Takes no names. Saves no places... The racing franchise continues bigger and better...",
      "author": "Leonard Maltin"
    },
    {
      "text": "Has a lot of the same problems as its most recent predecessors. The dialogue is flat, the action scenes are over-edited so that it's not always clear what you're looking at, and situations often get so implausible that it becomes a distraction.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Furious 7 is undeniably satisfying and mostly fun. More than pure escapism, however, it also serves as a fitting tribute to its costar Paul Walker, who was killed in a car accident while on a break during filming.",
      "author": "Kirk Baird"
    },
    {
      "text": "James Wan directs Furious 7 like a boy tossing his Matchbox cars and action figures down the steps.",
      "author": "John Serba"
    },
    {
      "text": "The only grace note in this otherwise determinedly graceless movie is the classy way Walker's exit is handled. To say more is to say too much.",
      "author": "Peter Rainer"
    },
    {
      "text": "I have never once, not ever, been genuinely disappointed in a The Fast and the Furious movie. It is, by far, the most satisfying franchise in American action cinema... That being said, something is very slightly off in Furious 7.",
      "author": "Joe Gross"
    },
    {
      "text": "Furious 7 is exactly what most popular movies are today: behemoth amusement rides adding more preposterous loop-de-loops with each sequel because nothing succeeds like excess. No brand does that better than the Fast & Furious franchise.",
      "author": "Steve Persall"
    },
    {
      "text": "The latest instalment of the franchise cost a pretty penny, yet often feels less like a slick blockbuster than a demented day-time soap.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "A masterful cavalcade of carefully orchestrated vehicular mayhem, a dose of high-octane escapism ramped up to ridiculous, fantastical extremes.",
      "author": "Neil Pond"
    },
    {
      "text": "Furious 7 kicks the biggest and hardest, but it's far from the best.",
      "author": "David Edelstein"
    },
    {
      "text": "This is an immensely entertaining movie, and if the filmmakers are wise, they'll quit on this high note.",
      "author": "Odie Henderson"
    },
    {
      "text": "It's Mission: Impossible with extra emphasis on \"impossible,\" & a gleeful anarchistic disregard for how often it jumps the shark (& a few skyscrapers) because it's having too much damn fun to care.",
      "author": "Mark Hughes"
    },
    {
      "text": "Trust me when I say absolutely nothing's been left out of Furious 7. A thrill ride from beginning to end.",
      "author": "Chris Bumbray"
    },
    {
      "text": "It's time to come back to earth, which this film only does in its memorial coda to Paul Walker, a fine sendoff which doesn't take the road most traveled.",
      "author": "Laura Clifford"
    },
    {
      "text": "The stunts are pure insanity, and the best part is, even though I'm sure there is a sizable helping of digital effects involved, there is a lot of actual, old-fashioned stunt work on the screen ...",
      "author": "Greg Maki"
    },
    {
      "text": "Suspension of disbelief is a must and watching Paul Walker in his last movie is like watching a ghost. It's uncomfortable at times.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Overall, it's a job well done and, ultimately, a fitting tribute to both the late actor and his character. (Full Content Review -- Sex, Profanity, Violence, etc. -- for Parents also available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "Furious 7 is everything you expect it to be. An over-the-top car chase film jam packed with fist fights, gun battles, insanely awesome set pieces and lots of dialog about family.",
      "author": "Matthew Razak"
    },
    {
      "text": "State-of-the-art automotive uproar, room-wrecking MMA-style smack-downs, and wild stunts performed by real live people.",
      "author": "Kurt Loder"
    },
    {
      "text": "Soap opera with supercars and explosions. Pitch perfect tribute to Paul Walker. What's not to love?",
      "author": "Rebecca Cusey"
    },
    {
      "text": "Furious 7 has so much adrenaline and testosterone that women who see the movie could become pregnant.",
      "author": "Willie Waffle"
    },
    {
      "text": "...lazy and annoying, devoid of any hint of what might have once made it interesting. But that is not to say that there aren't exciting moments, it's just that none of them add up to anything we care about.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "If you gave a 15-year-old boy $250million and told him to go away and make a movie, the result would probably look like this.",
      "author": "David Edwards"
    },
    {
      "text": "It's not a magnificent seven but fans will certainly lap it up.",
      "author": "Allan Hunter"
    },
    {
      "text": "It's all entertaining enough, I suppose. But there's a twisted coldness under the action that's anxiously concealed by the characters' refrains of the importance of \"family\" and sticking together and other ostensibly nice stuff.",
      "author": "John Semley"
    },
    {
      "text": "The real stars of these films are the bonkers action setpieces, and \"Furious 7\" achieves new high points in that department.",
      "author": "Adam Graham"
    },
    {
      "text": "It's not the best \"Furious\" but it's far from the worst.",
      "author": "Chris Hewitt"
    },
    {
      "text": "The story is an appropriately flimsy excuse for a series of undercards - Statham vs. Rock, Tony Jaa vs. Paul Walker (twice), Michelle Rodriguez vs. Ronda Rousey.",
      "author": "Gary Thompson"
    },
    {
      "text": "It's all dumb, but it's wonderfully, comfortably dumb in just the right way.",
      "author": "Molly Eichel"
    },
    {
      "text": "The brashest, noisiest, most ludicrously outrageous in the series so far. No surprises there... What is unexpected is quite how tender and poignant the film should turn out to be, a touching farewell to departed star Paul Walker.",
      "author": "Jason Best"
    },
    {
      "text": "Furious 7 is basically a live action version of Grand Theft Auto, with a touching tribute to its fallen star - Paul Walker.",
      "author": "Julian Roman"
    },
    {
      "text": "This is a franchise where the filmmakers and stars willingly embrace the absurd so going in your motto should be 'everything is impossible, but awesome.'",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Fun, exciting and emotionally involving, this sequel delivers the best qualities of this series and a stirring tribute to the late Paul Walker.",
      "author": "John Hanlon"
    },
    {
      "text": "\"Over-the-top\" doesn't cut it as a descriptor for these movies any more - there needs to be an adjective for whatever is above \"over-the-top\", because that's what F&F7 is.",
      "author": "Matt Neal"
    },
    {
      "text": "Though its respect for road safety or, indeed, logic, is flimsy at best, Fast & Furious 7 is also an undeniably enjoyable ride.",
      "author": "Lewis Bazley"
    },
    {
      "text": "It's perhaps fitting that the best part of Furious 7 is that it has drive. This is a film that knows what it wants to be, and it delivers it both with impact and precision.",
      "author": "Jason Gorber"
    },
    {
      "text": "The monster muscle-car franchise continues to relentlessly assault the senses in this globe-trotting sequel, with horror maestro James Wan's direction adding extra high-style brilliance to proceedings.",
      "author": "Alan Jones"
    },
    {
      "text": "\"Cars don't fly!\" is the recurring cry in Fast and Furious 7 and in scene after improbably hilarious heavy-metal crashing scene, this idea is disproved.",
      "author": "Kate Muir"
    },
    {
      "text": "Spectacular action, chases, races and fight scenes are combined with plotting and dialogue of mind-numbing crudity and plenty of shameless product placement in the latest sequel.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "What transpires is grimmer than what's come before, and without the sense of fun, the absurdity of the action becomes less enjoyable.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Superior set pieces continue to sustain this most dumbly enjoyable of franchises ...",
      "author": "Mike McCahill"
    },
    {
      "text": "A remarkably satisfying and entertaining action movie, one of the best in the series. Put your brain in neutral and enjoy the ride.",
      "author": "Peter Howell"
    },
    {
      "text": "Furious Seven may only be 'good' by way of the [Howard] Hawks Rule, but nonetheless, it's damn good at what it sets out to do.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The movie doesn't hold together as well as the previous chapter, but that's really a function of expanding the cast still further.",
      "author": "Tom Russo"
    },
    {
      "text": "A number of the sequences verge on the obscene, in terms of credibility, and if you thought these films disregarded the laws of physics in the past, well, Wan has simply gone ahead and dispensed with them.",
      "author": "Anders Wright"
    },
    {
      "text": "Furious Seven provides what viewers have come to expect from the long-running The Fast and the Furious series: a string of high-octane, physics-defying action scenes loosely connected by a narrative that occasionally makes rudimentary sense.",
      "author": "James Berardinelli"
    },
    {
      "text": "The film follows an exceedingly well-traveled road, though the formula-a crew of racer-adventurers who put dual premiums on speed and family values-has been spiked with ever more spectacular, or preposterous, effects.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "A huge, galumphing bore...the maelstrom of mayhem very quickly becomes an orgy of stupidity, and a remarkably tedious one at that.",
      "author": "Frank Swietek"
    },
    {
      "text": "For a franchise known for cheesy, heavy-handed lines, Furious 7 served up a classy, heartbreaking send-off for its departed star, one that acknowledged the tragedy of real life without allowing it to overwhelm the fictional world.",
      "author": "Elaine Teng"
    },
    {
      "text": "Those actors are good. But the movie survives and thrives on big explosions and even bigger explosions.",
      "author": "Rick Bentley"
    },
    {
      "text": "Although it's too long by a good 30 minutes, watching Furious 7 is about as much fun as you can legally, safely, and sanely have without crashing your own Lykan Hypersport through Abu Dhabi's famed Etihad Towers complex.",
      "author": "Marc Savlov"
    },
    {
      "text": "The story takes place in LA, Abu Dhabi, Tokyo, and the Caucasus Mountains, yet Wan has so few ideas about how to choreograph and edit action that the elaborate stunt sequences all feel exactly the same.",
      "author": "Ben Sachs"
    },
    {
      "text": "Furious 7 is incapable of being indictable: it's pure popcorn escapism, brashly dumb and knowing at the same time. Like its central muscleheads, the film is aware it's breaking all the rules.",
      "author": "Barry Hertz"
    },
    {
      "text": "This combination of the earnest with the ridiculous is exactly how Fast & Furious draws you in.",
      "author": "Alex Doenau"
    },
    {
      "text": "If it turns out that this really is the last Fast & Furious film, it's a good note to go out on.",
      "author": "Anthony Morris"
    },
    {
      "text": "The ramrod-serious Diesel and Statham sell the dialogue, anyway. So do the more lighthearted Johnson and Tyrese Gibson. Johnson and Gibson wring laughs from obvious jokes. The acting champ of 7, though, is Michelle Rodriguez.",
      "author": "Carla Meyer"
    },
    {
      "text": "When a film is this exciting in its action set pieces and this meaningful in its quiet moments, the filmmakers are getting it right.",
      "author": "Michael Smith"
    },
    {
      "text": "James Wan embraces the series' visual hallmarks with what translates to unencumbered glee onscreen.",
      "author": "Genevieve Koski"
    },
    {
      "text": "The grunted catch-phrases, the implausible escapes, the plot holes the size of the Bonneville Salt Flats - it's all pitched at a particular audience like a dog whistle that fully grown humans can't hear.",
      "author": "Joe Williams"
    },
    {
      "text": "At this rate, the next chapter will have to take place in outer space. Fast & Furious: Venusian Drift.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "It took seven movies, but \"Furious Seven\" can be counted as the franchise's first unequivocal success, a go-for-broke extravaganza of gripping tension, unbelievably wild stuntwork, and a beating heart that doesn't feel prefabricated.",
      "author": "Dustin Putman"
    },
    {
      "text": "This is a cockamamie amalgamation of absurd car chases, ridiculous fights, and more noise than you can tolerate blasting away at you for almost 2 1/2 hours with no coherent plot or raison d'être outside of big box office.",
      "author": "Tony Medley"
    },
    {
      "text": "Start your engines.",
      "author": "David Jenkins"
    },
    {
      "text": "\"Furious 7\" buzzes with a frenetic energy so contagious, there's no sense in resisting it. Like its predecessors, this film has no shame about being its high-octane, gloriously ridiculous self.",
      "author": "Jen Chaney"
    },
    {
      "text": "If you've bought into the series overall thus far, you're not going to want to miss Paul Walker's final ride.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "\"Furious 7\" is not as zippy as \"Fast Five,\" my favorite of the ones I've seen, but it has its satisfactions; its global audience is built-in, as well as strapped in and ready to ride.",
      "author": "Michael Phillips"
    },
    {
      "text": "This one sticks with you. Forget the plot bumps, muscle acting, and tweet-length dialogue. Finishing the film in Paul Walker's honor clearly brought out the best in everyone.",
      "author": "Peter Travers"
    },
    {
      "text": "In Furious 7, the unstoppable Fast and the Furious franchise sputters and stalls, edging from spectacular, tongue-in-cheek B-movie fun to soulless, insulting inanity.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Big and numbingly loud, \"Furious 7\" jets around the globe so we can watch cars crash, explode and repeatedly defy gravity. If that sounds like a great way to spend two hours and 17 minutes, read no more.",
      "author": "Randy Cordova"
    },
    {
      "text": "Physics and Gravity be Damned! \"Furious 7\" Aims to Please.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Loud, long and laughably over-the-top, Furious 7 is one of the best pure action movies ever made.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "For their seventh adventure, the Fast & Furious cast and crew continue to outdo themselves with mind-boggling stunt driving and outrageous action mayhem...",
      "author": "Rich Cline"
    },
    {
      "text": "Furious 7 is so giddy and overblown that its bloated runtime is more of a blessing than a burden.",
      "author": "Jack Giroux"
    },
    {
      "text": "Hey, action flicks aren't supposed to make you cry!",
      "author": "Mara Reinstein"
    },
    {
      "text": "The nicest thing I can say about Furious 7 is that if it were the end of the franchise, it'd be a fine and fitting one.",
      "author": "James Rocchi"
    },
    {
      "text": "Alternately entertaining and annoying.",
      "author": "Matt Pais"
    },
    {
      "text": "As long as you're willing to buckle your seat belt, disengage your brain and just go along for the ride, there's also no small amount of fun to be had.",
      "author": "Mike Scott"
    },
    {
      "text": "As for the plot, there is one. As for the acting, it's there in the sense that actors are onscreen moving around and saying words that don't make sense.",
      "author": "Jeff Baker"
    },
    {
      "text": "James Wan came up in the horror ranks and gave the world the first Saw... If \"F&F\" fans feared that he would tamper with the box-office formula and end up slaying and gutting this cinematic golden goose for shocks and giggles, they can rest easy.",
      "author": "Cary Darling"
    },
    {
      "text": "Delivers the goods, and then some.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Here and there, we get the imaginative and outrageous stunts this series is famous for, but mostly the movie plods along, muscling through without much life or spirit.",
      "author": "Mick LaSalle"
    },
    {
      "text": "\"Furious 7\" is the fuel-injected fusion of all that is and ever has been good in \"The Fast and the Furious\" saga that began in 2001 with souped-up cars and a stripped-down story about a tightknit East L.A. street racing crew.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "The series will doubtless continue on with Diesel, Rodriguez, Johnson, and the rest, but in the meantime, Furious 7 comes to the most conclusive and emotionally satisfying ending since, fittingly, the very first film.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Kind of like the Avengers, only more racially diverse, and marginally less bound by the laws of physics or common sense.",
      "author": "Tom Clift"
    },
    {
      "text": "You're left wondering if there is such a thing as too much.",
      "author": "Steve Newall"
    },
    {
      "text": "Yes, \"Furious Seven\" is incredible. I spent just about the entire running time either with a huge smile on my face or cackling hysterically.",
      "author": "Stephen Silver"
    },
    {
      "text": "It turns out 2011's \"Fast Five\" wasn't a turning point for the series, just a wildly entertaining fluke.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Furious 7 offers edge-of-the-seat excitement with outlandish action sequences, inventive stunts, hilarious cartoonish moments and even some touching emotion.",
      "author": "Claudia Puig"
    },
    {
      "text": "It is, perhaps, the ultimate proof that a ridiculous movie and a good movie aren't mutually exclusive.",
      "author": "Tony Hicks"
    },
    {
      "text": "There will no doubt be better movies released in 2015, but \"Furious 7\" is an early favorite to win the prize for most picture.",
      "author": "A.O. Scott"
    },
    {
      "text": "There's so much destruction at the climax that it's like an apocalypse with a happy ending. Furious 7 is the demon love child of Fast & Furious 6 and a Mad Max movie.",
      "author": "Michael Sragow"
    },
    {
      "text": "...if the series gives in to its worst impulses going forward, we fans have a good, satisfying stopping point.",
      "author": "Dan Schindel"
    },
    {
      "text": "All laws of velocity, geometry and air-traffic control are so flagrantly disobeyed, you just won't be able to wipe the dopey grin off your face.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The sheer implausibility is entertaining, yet it feels as if nothing is really at stake: everyone has nine lives.",
      "author": "Philippa Hawker"
    },
    {
      "text": "This is Wan's first major Hollywood production after more than a decade of profitable horror outings including Saw and Insidious, and it's disappointing that neither the gonzo gore of the former nor the calculating restraint of the latter register here.",
      "author": "Craig Mathieson"
    },
    {
      "text": "It's an enormous, steroidal blast, and as much ingenious fun as a blockbuster can be.",
      "author": "Richard Corliss"
    },
    {
      "text": "This is the pinnacle, people. This is everything they've got.",
      "author": "Will Leitch"
    },
    {
      "text": "Fast-moving fight scenes, outrageous auto antics and a sprinkling of ridiculous one-liners make Furious 7 a campy, crowd-pleasing escape.",
      "author": "Sandy Cohen"
    },
    {
      "text": "'Furious 6' was \"dumb fun\" to a breaking point. 'Furious 7' revives the franchise with cohesion and elegance.",
      "author": "Matt Patches"
    },
    {
      "text": "Seventh entry in the high-octane franchise won't disappoint fans, and serves as a moving tribute to star Paul Walker.",
      "author": "Daniel Eagan"
    },
    {
      "text": "The most gleefully meat-headed franchise going has intersected with real-life tragedy and handled it with surprising grace. Meat-headed grace, sure, but grace nonetheless.",
      "author": "Simon Miraudo"
    },
    {
      "text": "A slim excuse, and a perfectly good one, for trotting around the globe, blowing up drones in Los Angeles and sending Lebanese sports cars crashing through Abu Dhabi skyscrapers.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The good news is that Furious 7 offers more - and more, and yet more - of the same.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "It lays bare that the franchise's most radical asset is also its most conservative: an overriding emphasis on, above all else, the on-screen family.",
      "author": "Steve Macfarlane"
    },
    {
      "text": "There won't be a faster, more furious movie this year.",
      "author": "Fred Topel"
    },
    {
      "text": "You'll end up so unashamedly engrossed by Furious 7 that you'll forgive its blatant disregard of narrative, subtlety and gravity and just enjoy and appreciate the rollicking ride for what it is.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "It certainly aims to be no less than the ultimate action movie, which, for some filmgoers, translates into the ultimate movie, period.",
      "author": "Matt Prigge"
    },
    {
      "text": "\"Furious 7\" is the biggest, silliest movie in the \"Fast and Furious\" franchise, officially transforming the series into \"The Avengers\" with muscle cars. But what's wrong with big and silly?",
      "author": "Jacob Hall"
    },
    {
      "text": "Car racing, vengeance, logic-defying stunts and stuff blowing up. Too much stuff blowing up, really. We came for the cars and their reckless, gorgeous drivers; we can get explosions anywhere.",
      "author": "Sara Stewart"
    },
    {
      "text": "Screeching incomprehensibly from one stunt-filled set piece to the next, Fast And Furious 7 is an exuberantly high-octane ride across a ridiculously elaborate plot.",
      "author": "Fionnuala Halligan"
    },
    {
      "text": "Ranks a very successful fourth place overall, with at least one gargantuan set piece that ranks among the series' finest.",
      "author": "Alonso Duralde"
    },
    {
      "text": "A group more bulletproof than The Avengers, causing more mayhem than General Zod. Think Universal doesn't have a superhero franchise? Think again.",
      "author": "James Dyer"
    },
    {
      "text": "This film isn't taking itself too seriously, and it certainly doesn't expect us to.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Too long, too convoluted, too sentimental, and too ridiculous. Some will say those are its good points. Will they embrace the homoeroticism too?",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Furious 7 hits every note that it must to satisfy fans and effectively pay tribute to Walker in his final on-screen performance.",
      "author": "Roth Cornet"
    },
    {
      "text": "\"Furious 7\" isn't so much goodbye as it is merely the end of something.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Nothing is impossible in his no holds barred thrilling actioner in which cars leap from planes, skyscrapers and cliff-tops as stunts accelerate to levels that almost break the sound barrier",
      "author": "Louise Keller"
    },
    {
      "text": "\"The logic-free, consequence-free property damage is never very involving. Furious 7 is sure to be the most lucrative entry of the series. But if you give it any thought at all, it will leave you feeling carsick.\"",
      "author": "Nicholas Barber"
    },
    {
      "text": "Everything about F&F 7 is supersized, from the actors to the running time to the scope of urban destruction.",
      "author": "Catherine Shoard"
    },
    {
      "text": "So fast, furious, ginormous, crazed, maxed-out and heart-on-sleeve emotional is this gloriously ludicrous instalment that it's impossible to see where an eighth could go.",
      "author": "Jamie Graham"
    },
    {
      "text": "The face-to-face punch-ups are a lot of fun. The Statham-Johnson smackdown resembles nothing more than two shaved pitbulls in a tumble dryer.",
      "author": "Tom Huddleston"
    },
    {
      "text": "The final shot could not be more perfect. Tears will be shed.",
      "author": "Simon Reynolds"
    },
    {
      "text": "I found myself unexpectedly shedding a tear at the film's perfectly judged, sunbathed, final fade to white.",
      "author": "Robbie Collin"
    },
    {
      "text": "Diesel & Statham test each other's manhood by playing a game of car chicken, smashing into each other at maximum velocity in a tunnel - Furious 7 is the Large Hardon Collider.",
      "author": "Ali Gray"
    },
    {
      "text": "\"Furious 7\" finds the franchise at an unwanted crossroads, but it makes such a play for the diehard fans that it leaves everyone else at somewhat of a loss.",
      "author": "Charlie Schmidlin"
    },
    {
      "text": "It's impossible to watch Furious 7 and not think about [Paul] Walker the entire time. And as much as I enjoyed Furious 7 ... I found myself feeling incredibly sad. Most of the time, it feels like one long goodbye.",
      "author": "Mike Ryan"
    },
    {
      "text": "Furious 7 knows its audience and delivers exactly what they want, including an exciting last act with a huge pay-off.",
      "author": "Edward Douglas"
    },
    {
      "text": "The hit muscle-car franchise does itself and the late Paul Walker proud with a solid seventh entry.",
      "author": "Scott Foundas"
    },
    {
      "text": "Furious 7 is the perfect popcorn movie and there is no better way they could have paid tribute to Paul Walker.",
      "author": "Jon Lyus"
    },
    {
      "text": "The most over-the-top sequences the filmmakers could imagine, and each one is as fun as the last.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "The filmmakers are well aware of how silly this franchise has become. They're more than happy to keep the good times rolling, just so long as they can keep finding new and amusing ways in which to drive cars irresponsibly and destroy buildings at will.",
      "author": "Scott Weinberg"
    },
    {
      "text": "Stupendously stupid and stupidly diverting.",
      "author": "John DeFore"
    },
    {
      "text": "As a relentlessly paced action movie, Furious 7 is an excellent entry for those who would appreciate this sort of thing. As a memorial for one of its own, it's about as affecting as big, loud, ridiculous action movies get.",
      "author": "Dominick Suzanne-Mayer"
    },
    {
      "text": "Furious 7 is an in-your-face assault of awesomeness under the guidance of James Wan, who saves a more lax story by orchestrating a metallic ballet of kick-ass proportions.",
      "author": "Matt Donato"
    },
    {
      "text": "A fitting and moving send-off for Walker that still delivers the knowingly absurd stunts that Fast fans have come to expect.",
      "author": "Matt Singer"
    },
    {
      "text": "There are indeed faster and, sadly, significantly more furious movies in the Fast & Furious canon.",
      "author": "William Bibbiani"
    }
  ],
  "release_year": 2015,
  "duration": 137,
  "genres": [
    "Action",
    "Adventure",
    "Mystery & Thriller"
  ],
  "age_rating": "PG-13",
  "synopsis": "After defeating international terrorist Owen Shaw, Dominic Toretto (Vin Diesel), Brian O'Conner (Paul Walker) and the rest of the crew have separated to return to more normal lives. However, Deckard Shaw , Owen's older brother, is thirsty for revenge. A slick government agent offers to help Dom and company take care of Shaw in exchange for their help in rescuing a kidnapped computer hacker who has developed a powerful surveillance program.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/wurKlC3VKUgcfsn0K51MJYEleS2.jpg"
}