{
  "movie_name": "Game Night",
  "movie_id": "game_night_2018",
  "total_reviews": 256,
  "reviews": [
    {
      "text": "Its great screenplay allows for a little more storyline and suspense then what we expect from most comedy films while Jason Bateman once again shows why he is the current king of comedy.",
      "author": "David Griffiths"
    },
    {
      "text": "Flush with snickering hilarity and scoring plenty of points for swerving surprises, Game Night is infectiously entertaining with any cheese it serves.",
      "author": "Don Shanahan"
    },
    {
      "text": "Harkening back to the mid-budget comedy movies that have sadly disappeared from the mainstream, Game Night is the sort of breezy movie that has great potential for universal appeal, if only people are able to find out about it.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "Plemons steals every scene he is in. I also can’t say enough about the comic timing of both Bateman and McAdams. Both work at just the right pitch and hold everything together even as things begin to unravel in the third act.",
      "author": "Keith Garlington"
    },
    {
      "text": "Consistently funny and filled with dark screwball antics, Game Night is a rare, satisfying modern comedy.",
      "author": "Brian Eggert"
    },
    {
      "text": "[Game Night] looked like another run-of-the-mill R-rated comedy but it ended up providing a bunch of laughs and a surprising amount of filmmaking panache.",
      "author": "Drew Dietsch"
    },
    {
      "text": "The movie knows what it is and doesn't try to do more than that.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Isn't slap your knee funny but it is an amiable enough comedy that makes up in charm what it lacks in procedural thrills.",
      "author": "Richard Crouse"
    },
    {
      "text": "Rather than scripting the film to lighten up on the seriousness, the characters must betray normalcy to better fit insincere resolutions.",
      "author": "Mike Massie"
    },
    {
      "text": "Game Night offers enough hearty laughs to take your mind off the rest of life's daily frustrations.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "It's certainly a pleasant surprise for a late February release.",
      "author": "Richard Propes"
    },
    {
      "text": "By repeating itself in tone and material, the script begins to feel unintentionally contrived . . . the laughs of the first half turn to giggles at most by the middle.",
      "author": "Matt Cipolla"
    },
    {
      "text": "Game Night is a perfectly executed by-the-book comedy thriller, by which I mean that its limited conception is carried out with the utmost technical proficiency.",
      "author": "CJ Sheu"
    },
    {
      "text": "Game Night is an uproarious dark comedy that, sticking true to its name, has fun playing around with your preconceptions.",
      "author": "Damond Fudge"
    },
    {
      "text": "Much like a real game night, sometimes the success or failure of a film like this depends on the players, and in this case, everyone seems game.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Yes, there are points in which the story twists feel arbitrary, but that is offset by the movie's briskness and good-natured sense of adventure.",
      "author": "John Lui"
    },
    {
      "text": "It's an impressively dense script with minimal pacing problems.",
      "author": "Dan Scully"
    },
    {
      "text": "The long joke of the narrative is adroitly handled, and for once the climax pays off in laughs.",
      "author": "J. R. Jones"
    },
    {
      "text": "The secret weapon of the film is Jesse Plemons as the unsettling Gary.",
      "author": "Tim Brennan"
    },
    {
      "text": "It's a team effort with everyone working together in harmony to get the job done to surprisingly great effect.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "Game Night is never not enjoyable and the ensemble cast is fantastic. It's a fun movie that's completely entertaining.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Wanna go out and get a surprise at the theater? Take your seat and laugh at these folks in one of the first great comedies of 2018.",
      "author": "Julian Lytle"
    },
    {
      "text": "Game Night is a hilarious, deranged take on growing up and finding our weekly spark, if not an absolutely insane riff off Clue meets Keanu (in some weird mainstream comedy universe).",
      "author": "Matt Donato"
    },
    {
      "text": "It has its issues, the premise is perhaps milked for all its worth and we don't get much pay off with every storyline, but Game Night is still a step in the right direction for broad comedy.",
      "author": "Karl Delossantos"
    },
    {
      "text": "With so much of the same films being produced and shoved down our throats these days, it's nice to get something a little out of the ordinary for a change.",
      "author": "Allison Rose"
    },
    {
      "text": "The film does have a lot of laughs, even if they sometimes feel unevenly distributed among its impressive comic ensemble.",
      "author": "Rita Cannon"
    },
    {
      "text": "Game Night works best when it focuses on the personalities of its characters and meanders when it pays too much attention to the particulars of the plots-within-the-plot.",
      "author": "Matt Brunson"
    },
    {
      "text": "Its cast is very inspired and the fearsome encounter with action thriller features works better than expected. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Game Night's not much more than disposable popcorn fun, but at 100 minutes, not being a sequel or a (...) remake, and not overstaying its welcome? Not a bad way to blow a Friday night.",
      "author": "Dominic Griffin"
    },
    {
      "text": "If there is such an oxymoron as a playfully competitive personality, husband-and-wife Max and Annie are it in spades.",
      "author": "Andiee Paviour"
    },
    {
      "text": "It has energy and verve to spare, operating with a sense of comic anarchy that is hard to resist.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Game Night is one of those rare mid-tier comedies that has a few laughs, but isn't consistently good enough for a recommendation.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "The funniest movie of 2018. The character's ignorance of how unintelligent they are and the over-the-top situations the script finds the characters in is tremendously comedic.",
      "author": "Jason Escamilla"
    },
    {
      "text": "One of the better studio comedies I've seen in a while.",
      "author": "Dan Murrell"
    },
    {
      "text": "Game Night provides escapist camp, a fun night at the movies. Keep in mind, however, that rationalization should be checked at the door.",
      "author": "Wendy Shreve"
    },
    {
      "text": "The movie's strongest point are the actors who rise above the average script and make you laugh at their antics throughout.",
      "author": "S. Indra Sathiabalan"
    },
    {
      "text": "The cast has great chemistry and if you grew up in a competitive family you will be able to relate to it like I did.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It's smart and funny, driven by talented actors bringing something real to the table. It has its crass moments and is packed with referential nods, sure, but it's all in service to driving the narrative and making actual jokes.",
      "author": "Allen Adams"
    },
    {
      "text": "The film blends human drama with well-placed jokes and a decent amount of action to not only create an action comedy, but a comedy that actually works.",
      "author": "Amanda Greever"
    },
    {
      "text": "Just another game night.",
      "author": "Evan Dossey"
    },
    {
      "text": "Game Night is nice surprise from the directors of Vacation, with a fun premise, a capably comedic cast and the improved direction of Daley and Goldstein.",
      "author": "Harris Dang"
    },
    {
      "text": "This thriller/comedy combination is no masterpiece, especially given it's weak script and off the rails third act, but it is a light fun movie. Jason Bateman's charismatic performance carries the film over the rough spots.",
      "author": "Julia Swift"
    },
    {
      "text": "The characters are well-written and witty, with some razor-sharp, stinging dialogue. The natural onscreen chemistry of the actors is what elevates the film.",
      "author": "Louisa Moore"
    },
    {
      "text": "GAME NIGHT invests fully in the chemistry and charisma of its actors. The players (no pun intended) do not let them down.",
      "author": "Tim Stevens"
    },
    {
      "text": "A delightful comedy that offers some great comedic bits and a few wonderful surprises.",
      "author": "John Hanlon"
    },
    {
      "text": "The dynamic direction and the committed performances from the cast help sell a preposterous high concept.",
      "author": "Alistair Ryder"
    },
    {
      "text": "Works better in the parts, comedy in the first half and action-drama in the second, than on the whole but still, you can't help but enjoy Game Night.",
      "author": "Brian Gill"
    },
    {
      "text": "There's a genuine (and I mean this nicely) mean streak in \"Game Night\". And the balance of jokes and genuine threat, along with the constant new twists, is nothing short of audacious.",
      "author": "Sarah Cartland"
    },
    {
      "text": "The film mixes several different types of comedy, but it manages to maintain the same tone throughout, even as the reveals become ever more ridiculous.",
      "author": "Kt Schaefer"
    },
    {
      "text": "Like a good game night, some cinematic adventures require a solid group to truly bring out the magic inherent in the experience.",
      "author": "Douglas Davidson"
    },
    {
      "text": "A humdinger of a big studio comedy, never taking itself so seriously that it loses its charms but also being brave enough to indulge in some adult-only jollity.",
      "author": "Cameron Frew"
    },
    {
      "text": "Watching clueless suburbanites stumble around a plot grander & more complex than their own is funny. Abandoning the game night for unsatisfying action set pieces is not funny.",
      "author": "Christopher James"
    },
    {
      "text": "The culmination of all these aspects means that Game Night is the kind of comedy that consistently delivers the laughs with astonishing consistency, and never relying on a particular type of gag.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "The twists and turns are absurd with plot-holes, but we're never inclined to care because the messiness allows the actors to disregard reality and go for broke.",
      "author": "Jared Mobarak"
    },
    {
      "text": "There are interesting realities just outside the edges of the film, which would rather move the pieces than tip them over.",
      "author": "Matt Pais"
    },
    {
      "text": "Game Night blossomed into a critical and commercial success by absolutely nailing the three most important tenets of film making: casting, writing, and directing.",
      "author": "Josh Sorokach"
    },
    {
      "text": "I was so glad to see Rachel McAdams doing comedy again, and she's so entertaining in this.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Appreciate the effort to have this aspect of the film serve the 'playing a game' motif, but there's a point where 'ah-ha' becomes 'trying too hard.'",
      "author": "Nguyên Lê"
    },
    {
      "text": "Game Night succeeds in creating a night of mystery and debauchery audiences will love.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Because of the tightly written script, the funny characters, and cleverly well-choreographed sequences of action, \"Game Night\" is a fun ride.",
      "author": "Rendy Jones"
    },
    {
      "text": "A vulgar, violent, solidly R-rated comedy that is nevertheless sophisticated rather than gross.",
      "author": "Asia Frey"
    },
    {
      "text": "Packed with delightfully quirky characters and zany plot twists, it's far better and more amusing than the trailer would have you believe.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Game Night is a great film and is a must-see for anyone looking to watch something lighthearted and funny.",
      "author": "Steven Zamora"
    },
    {
      "text": "A solid ensemble comedy thriller that inspired some genuine chuckles from me...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "A goofy ensemble comedy that also functions as a spoof of middle-class malaise.",
      "author": "Josh Larsen"
    },
    {
      "text": "Hollywood needs to be employing Rachel McAdams for more movies where she gets to show off such physical and verbal comedic timing and prowess.",
      "author": "Christopher Campbell"
    },
    {
      "text": "A comedy can only work if the on-screen actors share a talented knack for comedic timing and chemistry. That happens here with McAdams and Bateman, an unlikely comedy dream team that carries \"Game Night\" into glory.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "As cookie cutter as the trailers for Game Night seemed, the movie did a good job of bringing some enjoyable twists and unexpected turns.",
      "author": "Ja-Quan Greene"
    },
    {
      "text": "What a journey. What a movie. What a Game Night. See it, and buy tickets in advance.",
      "author": "Bobby Finger"
    },
    {
      "text": "With so many different types of comedies, there is plenty of room for a slow boil riot like this one.",
      "author": "Wesley Lovell"
    },
    {
      "text": "It is a likeable, funny, and fast-moving caper that delivers on pretty much all levels. It'll make for fantastic couch-watching.",
      "author": "Joe Reid"
    },
    {
      "text": "Game Night is hardly a game-changer but - with the help of a spirited cast and some inspired sequences - is elevated from pedestrian material into a perfect Friday night popcorn movie.",
      "author": "Tom Augustine"
    },
    {
      "text": "Doesn't amount to much, but it'll make a decent rental for a Movie Night, with friends invited over for a breezy, occasionally gory spot of goofiness.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Full of hilarious dialog and set-pieces that keep us chortling.",
      "author": "Rich Cline"
    },
    {
      "text": "This Game Night is a real joy. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "It's surprising how well it works, and how funny it is.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The directors care very little about story development. [Full Review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "It smells like a saga because, let's face it, we want to see Jason Bateman and Rachel McAdams again, tumbling between gags and swipes. [Full Review in Spanish]",
      "author": "Antonio Trashorras"
    },
    {
      "text": "I did have a good laugh all throughout the film though, and for that, I recommend that you go see it.",
      "author": "Damian Levy"
    },
    {
      "text": "If you came here to laugh, [Game Night] is your option. [Full Review in Spanish]",
      "author": "Lucero Calderón"
    },
    {
      "text": "If your game night sometimes turns into movie night, this one should fill the bill nicely - the less you know, the better.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Game Night is an unpretentious comedy -but a good one- that manages to surprise. [Full review in Spanish]",
      "author": "Carlos Del Río"
    },
    {
      "text": "Game Night isn't exactly revolutionary comedy, but that doesn't take anything away from the fact that it's an insanely fun ride...It actually works as a real mystery whose precise unraveling produces as much wonder as laughs.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Is it a thriller? A comedy? A little bit of both, actually, and it mixes both genres in entertaining ways. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "A light, deliciously black, and consistently funny experience. Game Night is one of 2018's greatest surprises so far. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "McAdams, an eternally underrated performer, is the pic's MVP.",
      "author": "J. Olson"
    },
    {
      "text": "Bateman and McAdams make \"Game Night\" fun.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Aside from the magical pairing of Bateman and McAdams, who should do a string of films together like a modern-day Spencer Tracy and Katherine Hepburn, the film's MVP is Jesse Plemons.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "The decision to mix in some brutal shootings with the expected sexual innuendos and flatulent humour results in an uneven mix which is only vaguely satisfying.",
      "author": "Richard James Havis"
    },
    {
      "text": "Even if the humor in the film is merely pleasant and conventional for the most part, the characters themselves are massively enjoyable.",
      "author": "Tim Brayton"
    },
    {
      "text": "While watching Game Night in a packed theater, I spent my time both laughing and applauding the cinematography. I hope Game Night helps McAdams and Plemons land more much-deserved comedic work.",
      "author": "Amanda Mazzillo"
    },
    {
      "text": "\"Game Night\" is a hot mess, but there are those laughs, and they're surely worth something, right?",
      "author": "Martha K. Baker"
    },
    {
      "text": "It's an enjoyable snack, and the guests are good company and don't overstay their welcome during a mostly fun evening.",
      "author": "Damien Straker"
    },
    {
      "text": "McAdams and Bateman are the movie's only real assets; they're slumming, but they're having fun, and it's contagious.",
      "author": "Jim Lane"
    },
    {
      "text": "Overall, this is an enjoyable romp that's worth a look - if only to find out whether being a pub quiz ace and having serious skills at Pictionary or Charades can really help you when your up against international criminals.",
      "author": "James Bartlett"
    },
    {
      "text": "Filmmakers Daley and Goldstein have infused Game Night with a very slick, very fast-paced sensibility that is, at the outset, impossible to resist...",
      "author": "David Nusair"
    },
    {
      "text": "The more you think about it, the less sense it makes.... but that's not to say that you can't have fun watching it.",
      "author": "Matthew Toomey"
    },
    {
      "text": "For all its bluster, Game Night isn't really much of anything.",
      "author": "Joel Harley"
    },
    {
      "text": "From beginning to end it is comedic gold.",
      "author": "Steph Cozza"
    },
    {
      "text": "A great mix between crime thriller and screwball comedy that actually ends up working. Includes a great turn by Rachel McAdams and some impressive direction. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "But some plot points are darker, less luminous, and that's where Game Night fails. It immolates the spirit of comedy by pretending to be something that it isn't. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "The movie is a hollow throwback to classic comedy, and it shines only by contrast with dull studio competition.",
      "author": "Richard Brody"
    },
    {
      "text": "Game Night -- a slick, inventive and surprisingly efficient action/comedy -- is as solid a studio chuckle-fest as you could hope to see. Flawed, for sure, but we'll take it.",
      "author": "Chris Wasser"
    },
    {
      "text": "Studio comedies have been so bad for so long that when a halfway decent one comes along, we critics tend to get overexcited. But Game Night is a little better than decent, and handles its commendably silly premise with real skill and charm.",
      "author": "Paul Whitington"
    },
    {
      "text": "This is good, if slightly lightweight fun, albeit with Bateman and McAdams on sharp enough form to make you realise how long it's been since a decent commercial comedy came along.",
      "author": "Matthew Bond"
    },
    {
      "text": "For mainstream laughs, this is better than most.",
      "author": "Jonathan Dean"
    },
    {
      "text": "There's some nice deadpanning and comic undercutting from Bateman - his stock in trade, and some visual flourish, but the story's too contrived for its own good.",
      "author": "Ed Whitfield"
    },
    {
      "text": "The spoofy action set-pieces are ho hum. What's special is the minutiae-based, casually political banter.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "This surprisingly zingy, throwback studio comedy is witty and observant on the dynamics between couples.",
      "author": "Simran Hans"
    },
    {
      "text": "A mostly enjoyable, well-written romp wisely entrusted to the comedic chemistry of Jason Bateman and Rachel McAdams.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Game Night is so absurd it's almost surreal, but...it works and never gets dragged down by its own concept.",
      "author": "Sarah Marrs"
    },
    {
      "text": "You wouldn't think \"Fincher's The Game, except it's a comedy\" would sustain an entire movie, but it actually does.",
      "author": "Stephen Silver"
    },
    {
      "text": "The closest thing we have seen in recent years to a successful exercise in high screwball.",
      "author": "Donald Clarke"
    },
    {
      "text": "But most of all, \"Game Night\" belongs to Bateman and McAdams. No one can chew on a squeaky toy more humorously than he can, and no one is better at combining comic timing and sex appeal than she.",
      "author": "Dan Webster"
    },
    {
      "text": "The script by Mark Perez is sharp, and directors Jonathan Goldstein and John Francis Daley do a decent job, aided by some extremely engaging performances.",
      "author": "Brian Viner"
    },
    {
      "text": "This slippery, cartoonish jape is constantly springing little surprises and knocking you off balance with its unexpected twists.",
      "author": "Allan Hunter"
    },
    {
      "text": "It's clever, silly, slick and fun.",
      "author": "Ed Potton"
    },
    {
      "text": "It's properly laugh out loud and easily the best fun I've had at a comedy in ages - mainly due to the fact it's plot is sturdy and original, with more than enough to keep everyone happy.",
      "author": "Jamie East"
    },
    {
      "text": "The film not only manages to deliver the goods with its fantastically-crafted comedic narrative, but also succeeds in highlighting what we've been missing these last few years, simple and effective gags delivered with gusto and great timing.",
      "author": "Linda Marric"
    },
    {
      "text": "Bateman and McAdams have enormous chemistry in \"Game Night\"... That energy propels them into two of their funniest performances in a surprisingly clever comedy-thriller.",
      "author": "Rob Thomas"
    },
    {
      "text": "This high-concept comedy could have been mediocrity embodied, but it excels in two ways. It sought out an R-rating, so the film noir-inspired action is surprisingly intense -- but the casting is also pitch-perfect, elevating the comedic punches.",
      "author": "Roe McDermott"
    },
    {
      "text": "If the results sometimes tip towards self-indulgence or self-parody, the movie is still far cleverer and more engaging than one had any right to expect.",
      "author": "Matt Wolf"
    },
    {
      "text": "Game Night turns out to be a cool, clever surprise. The cast crackles-Bateman and McAdams are fast, easy and terrifically enjoyable together-and there's bright, sharp supporting work.",
      "author": "Stephen Rebello"
    },
    {
      "text": "[A] combination of comedy and thriller. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Even as Game Night piles on the absurdity and really tries your patience with outlandish twists and turns, it never loses pace or fails to keep pranging your funny bone. Worth a roll of the dice.",
      "author": "Alan Corr"
    },
    {
      "text": "Delivers all the undemanding laughs you could wish, and has such a plot of such baroque intricacy that it even manages a few genuine shocks.",
      "author": "Helen O'Hara"
    },
    {
      "text": "Bateman and McAdams prove to be an effective comedy pairing. .. The two of them play off of each other perfectly.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Game Night takes a long time to get rolling. At least the first third is nothing but drab exposition and characterization...but it has enough well-executed bits to make you hope that John Francis Daley and Jonathan Goldstein keep honing their craft.",
      "author": "M. Faust"
    },
    {
      "text": "Although the leads seem perfect on paper ... unusually for both of them, they're trying too hard ... The film spins endless jokes and almost none are funny. It simply reminds you of better films, and in doing so, survives for one hundred minutes.",
      "author": "CJ Johnson"
    },
    {
      "text": "Despite McAdams and Bateman's winning chemistry, the film slides down the longest ladder mid-way and never finds its way back up - no credit to the script's numerous twists and attempts to outwit itself.",
      "author": "Joanne Soh"
    },
    {
      "text": "Game Night offers a well-trod set-up, but the crack cast make this silly comedy work.",
      "author": "Al Hoff"
    },
    {
      "text": "If only every comedy was as capable of hitting as many marks as Game Night, sequel wouldn't be such a dirty word.",
      "author": "Andrea Thompson"
    },
    {
      "text": "The raucous energy of the early scenes isn't sustained and the film becomes increasingly repetitious and silly. The comedy elements here work far better than the thriller ones.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "... Game Night is a gloriously preposterous comedy/thriller hybrid that pays homage to the oeuvre of David Fincher - a delightfully preposterous thing for an absurdist comedy to do.",
      "author": "Rick Kisonak"
    },
    {
      "text": "It's a one-note black comedy. But one is better than none, and this note is high, passably sharp and could crack the odd martini glass.",
      "author": "Nigel Andrews"
    },
    {
      "text": "At least they looked like they had some fun along the way.",
      "author": "Yip Wai Yee"
    },
    {
      "text": "Game Night succeeds where so many other films of this nature suffer: it's funny.",
      "author": "Stefan Pape"
    },
    {
      "text": "Beats a game of Risk any day.",
      "author": "Hannah Strong"
    },
    {
      "text": "The flatness of their characters leaves no room for relatability.",
      "author": "Oktay Ege Kozak"
    },
    {
      "text": "Absolutely hilarious, full of smart snarksters, comedic suspense, and gleeful smashing of action-movie clichés. Part screwball comedy, part romantic adventure, all pure movie-movie joy.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Want some laughs? Make 'Game Night' your next move.",
      "author": "Linda Cook"
    },
    {
      "text": "It's very funny, with a script by Mark Perez, and all the pieces fit together like a perfect Rubix cube.",
      "author": "Katie Walsh"
    },
    {
      "text": "This is all bottom-feeder stuff, aimed at people who feel cool because they know what the Independent Spirit Awards are or who watch \"TMZ\" more than they'd like to admit.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "[Jesse] Plemons steals his scenes, if not the movie.",
      "author": "Mark Ellis"
    },
    {
      "text": "Sometimes it got a little too zany, but then it came back down and it was pretty funny.",
      "author": "Kristian Harloff"
    },
    {
      "text": "Remarkably funny, great chemistry among everybody.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "A tone-friendly dark comedy about suburban couples having weekly game nights at home with chosen friends.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Directors John Francis Daley and Jonathan Goldstein keep things peppy, benefitting hugely from a pumped, overqualified ensemble that mine a commendable amount of laughter from a so-so script.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Game Night pulls off more narrative twists than an Olympic freestyle skier. And like those gravity-defying champions, the filmmakers' timing, preparation, and technical precision makes it all look deceptively easy.",
      "author": "Vicky Roach"
    },
    {
      "text": "With its clever, whip-smart script and enthusiastic ensemble cast firing on all cylinders, crime comedy filmmakers Jonathan Francis Daley and Jonathan Goldstein score big with Game Night.",
      "author": "Amy West"
    },
    {
      "text": "Game Night is canny enough to go full-throttle with the absurd and not bother trying to do much with its meager dramatic and/or sentimental elements.",
      "author": "James Berardinelli"
    },
    {
      "text": "...once you open the box and take out the pieces, it's just a matter of going from one contrived square to another. Not even the rolls of the dice add up to more than three-act narrative math.",
      "author": "Katherine Monk"
    },
    {
      "text": "... boasts an ambitious genre-bending premise and a sharp ensemble cast, only to lack the ability to solve its own convoluted narrative puzzle.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Absolutely nutty, buoyed by a wonderfully warped sense of humor and a more-than-game cast that's equal to the film's rapid-fire dialogue and pace, Game Night easily rates as a stunning surprise.",
      "author": "Stephen Schaefer"
    },
    {
      "text": "Riotously funny little farce that is a certifiable blast and guaranteed to be the best time you've had at the movies this year.",
      "author": "Frank Wilkins"
    },
    {
      "text": "Even though during the final act it's difficult not to mentally check out, there's fun to be found in its slightly demented zaniness, all fitted with a dark and electronic score from Cliff Martinez",
      "author": "Robert Kojder"
    },
    {
      "text": "But [Jason] Bateman and [Rachel] McAdams are a superb comedic pair, the two actors playing off of one another as if they've been doing it their whole careers.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Game Night suffers from wild tonal shifts, a half-dozen or more plot developments that defy not only logic but often physics, and a cast of characters who behave in ways no human should - or would.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "The back and forth between McAdams and Bateman is what makes Game Night sing (which is not to slight Horgan's dry wit or Magnussen's elegant idiocy or Morris' magnificent Denzel Washington impression).",
      "author": "Sam Adams"
    },
    {
      "text": "Spot-on in terms of tone and performance, Game Night never goes off the rails, even in its most outrageous moments. The only goal here is to generate laughter, and boy, does it ever succeed.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Car chases, shootouts and film references abound. In other words, there's scarcely anything original about the outlandish caper.",
      "author": "Rashid Irani"
    },
    {
      "text": "Even though it has some really great funny moments, Game Night struggles to produce a successful whole.",
      "author": "Josh Terry"
    },
    {
      "text": "The clever American comic thriller Game Night is a bit like a matryoshka doll. There are stories within stories and, just when it looks like the final doll has been revealed, there is another twist to keep the game going.",
      "author": "Stephen Romei"
    },
    {
      "text": "An amazing performance from Jesse Plemons, who never lets go of a Westie Terrier. And the ridiculously likable [Rachel] McAdams proves yet again she's the Meryl Streep of her generation.",
      "author": "Ned Lannamann"
    },
    {
      "text": "A bit like the game of Monopoly that often goes on too long. But while you're playing it most of the time, it's so much fun! (Full Content Review for Parents - Violence, Profanity, Sexual Content, etc. - also Available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "All you can do is cringe and sigh, and huff, and try to remember the actor's names, and happier times you have spent in their celluloid company.",
      "author": "Piers Marchant"
    },
    {
      "text": "You keep thinking the relentless array of funny jokes will dry up sooner or later, and then the end credits roll.",
      "author": "Christian Toto"
    },
    {
      "text": "There's a slapstick sequence made to look like a single take, where bravura filmmaking services hilarity and excitement",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "Game Night is a madcap adventure packed with laughs, twists, and good performances that will keep audiences thoroughly entertained.",
      "author": "Chris Agar"
    },
    {
      "text": "With broad strokes of self-awareness [and] a screwy screenplay that sometimes crosses the line into parody ... Game Night is more gratifying than hearing an opponent say, \"You sunk my battleship!\"",
      "author": "Kiko Martinez"
    },
    {
      "text": "It's not that I was hoping for a dramatic adult turn akin to what Jonathan Demme gave us in his marvelous 1986 adventure \"Something Wild,\" but \"Game Night\" is nothing less than a live-action cartoon.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Directors Daley, Goldstein and a game cast intermittently keep this film aloft, McAdams' nutsy enthusiasm and Plemons' creepy obsessiveness particularly on target, but Mark Perez's labored script creates a drag that ultimately overtakes their efforts.",
      "author": "Laura Clifford"
    },
    {
      "text": "Thanks to winning performances from Bateman and McAdams, it is watchable, with a few clever twists and across the board strong support from the cast.",
      "author": "Nell Minow"
    },
    {
      "text": "\"Game Night\" is a blast, a sharp adult comedy that earns genuine laughs without going lowbrow or diving into raunchy humor.",
      "author": "Adam Graham"
    },
    {
      "text": "Game Night is a surprisingly solid and funny comedy that relies largely on the charisma and flair of its stars.",
      "author": "Wenlei Ma"
    },
    {
      "text": "After a deliberately slow start directors John Francis Daley & Jonathan Goldstein (working from a screenplay by Mark Perez) hit the accelerator once the game's first victim - or should that be \"victim\"? - hits the floor. It's all go from there.",
      "author": "Jim Schembri"
    },
    {
      "text": "The filmmakers have created a hilarious, highly-stylized, madcap caper that's alarmingly clever in the meta ways they infuse pop cinema language.",
      "author": "Courtney Howard"
    },
    {
      "text": "A completely stupid film about a group of friends whose game night goes horribly wrong (but also, so right)... Game Night somehow succeeds in telling a winning story.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "This outing doesn't go so well, with Game Night's inconsistent laughs and a plot that's too silly even for a comedy.",
      "author": "Kirk Baird"
    },
    {
      "text": "... One of the tightest and funniest Hollywood studio comedies of recent years.",
      "author": "Greg Maki"
    },
    {
      "text": "While it mostly follows the rules, it also includes some deviations you won't see coming.",
      "author": "Chris Knight"
    },
    {
      "text": "The cast is worth braving multiplex crowds to see. McAdams earns her comedienne wings, and Bateman's subversive deadpan, which always works, works better than usual.",
      "author": "Tim Appelo"
    },
    {
      "text": "Thankfully, the hits outweigh the misses by a margin that ultimately works in the movie's favour.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The Game Night co-directors deliver a stylish and good-looking movie.",
      "author": "Richard Roeper"
    },
    {
      "text": "Screenwriter Mark Perez knows the difference between simply making a reference and actually writing a joke - and while the jokes come ceaselessly, they are knowingly and (this turns out to be key) lightly offered.",
      "author": "Glen Weldon"
    },
    {
      "text": "It's a dense, clever, good natured and occasionally truly funny film. Bravo.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "The jokes are witty, the risk is real and there's at least one thrilling plot twist.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Game Night is clever and appropriately demented when it needs to be.",
      "author": "Mark Dujsik"
    },
    {
      "text": "In the end this is a wasted 'Night'...more likely to elicit a grimace than a grin.",
      "author": "Frank Swietek"
    },
    {
      "text": "It won't fix the studio comedy, but it's a welcome, watchable outlier for now.",
      "author": "Emily Yoshida"
    },
    {
      "text": "Game Night has the charm and definitely the players to be a real winner for those willing to roll the dice.",
      "author": "Travis Hopson"
    },
    {
      "text": "Jesse Plemons nearly steals the movie as Max and Annie's freshly-divorced cop neighbor Gary, who's all kinds of funny... The co-directors might overdo the heartfelt interludes, but they add just the right amount of Gary to the insane mix.",
      "author": "André Hereford"
    },
    {
      "text": "A four-hour documentary pitting Bateman against McAdams in an epic Settlers of Catan match-up would have been significantly more interesting ...",
      "author": "Justin Chang"
    },
    {
      "text": "Over-the-top comedy has strong language, bloody violence.",
      "author": "Michael Ordoña"
    },
    {
      "text": "Bateman has a natural flair for comedy but it's McAdams who's a pleasant surprise here, a partner who's equally engaging and doesn't settle for playing second fiddle. Together, their on-screen chemistry is a huge bonus.",
      "author": "Bruce DeMara"
    },
    {
      "text": "They inject this funny film with just enough realism to make us feel threatened, relieved and elated.",
      "author": "Dann Gire"
    },
    {
      "text": "A genially sloppy farce with some good laughs and a cast to enjoy. Bateman's \"Can you believe this crap?\" gaze as, a response to modern life, should probably be enshrined as an emoji.",
      "author": "Liam Lacey"
    },
    {
      "text": "Game Night steadily gaslights the audience by making them think they're watching a hardened dark comedy when what they're actually watching is a very sweet, very believable relationship comedy.",
      "author": "Kyle Anderson"
    },
    {
      "text": "It helps that [Jason] Bateman and [Rachel] McAdams are two of our most affable movie stars. They are both deft at delivering dry asides and getting caught up in the more manic moments.",
      "author": "Clint O'Connor"
    },
    {
      "text": "Filled with knowing pop-culture references and deriving laughs from every key character, it's the kind of smart, fast-paced entertainment that makes a pretty delicate juggling act look easy.",
      "author": "Brian Lowry"
    },
    {
      "text": "\"Game Night\" is something of a rarity - it's a smart, consistently entertaining, and actually funny studio comedy.",
      "author": "Will Ashton"
    },
    {
      "text": "\"Game Night\" gets it right.",
      "author": "Maren Longbella"
    },
    {
      "text": "Dark humor and an appealing cast keep this engaging game in motion.",
      "author": "Roger Tennis"
    },
    {
      "text": "This is high-grade adventure-comedy laughs, thanks to someone using their cranium to create something more than a trivial pursuit.",
      "author": "Michael Smith"
    },
    {
      "text": "Mostly this is a dumb comedy filled with characters who don't exist beyond the boundaries of this dumb story. The laughs are there, though, and if you keep your expectations low, you won't get too bored at this Game Night.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "It takes real intelligence to make the best dumb jokes. Game Night has plenty of both, combining skilled filmmaking and ridiculous gags in equal measure, and letting the seriousness and silliness play off of each other for maximum effect.",
      "author": "William Bibbiani"
    },
    {
      "text": "The film establishes coherent characters and drops them into a twisty mystery plot that's tightly crafted enough to generate some real narrative momentum while never getting too bogged down in its own plot that it forgets to be funny.",
      "author": "Keith Watson"
    },
    {
      "text": "If you're looking for a rapturously funny film with a crackerjack cast, Game Night's a winner.",
      "author": "Kristy Puchko"
    },
    {
      "text": "It feels a bit like someone wanted to make a Coen brothers movie for the Clue crowd: Let's call it kitschy noir.",
      "author": "Danielle White"
    },
    {
      "text": "Like a real-life game night, the comedy may not leave a lasting impression, but it's plenty of fun while it lasts.",
      "author": "Stephanie Merry"
    },
    {
      "text": "Bateman's sly way of staying one step to the left of the center of the action extracts an additional layer of humor. McAdams, meantime, does all she can to activate the screwball fizz amid the improbabilities.",
      "author": "Michael Phillips"
    },
    {
      "text": "Some, or even a lot, of the jokes are stupid. But thanks in part to a terrific cast, expert timing and an all-in aesthetic, it's really funny.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Strangely free of imagination and timing, with only a handful of moments hinting at the possibilities of a production brave enough to embrace the madness in full.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Game Night is surprisingly fun, but the real standout is Jesse Plemmons' delightfully creepy performance.",
      "author": "Matt Goldberg"
    },
    {
      "text": "When it's all over, everyone comes out a winner--despite the bullet holes, knife wounds and slightly higher body count than you'd find in a typical round of Never Have I Ever.",
      "author": "Neil Pond"
    },
    {
      "text": "Shouldn't a movie called \"Game Night\" be entertaining?",
      "author": "Tom Russo"
    },
    {
      "text": "\"This will be a game night to remember,\" intones a character, early on in the film; this isn't true, as I've already forgotten most of this movie despite having taken notes.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Farce is a beast to get right in movies. The fact that Game Night hits the mark more often than it hits a wall is cause for cheering. Jason Bateman and Rachel McAdams make sure its always party time. Talk about fun company. They're it.",
      "author": "Peter Travers"
    },
    {
      "text": "Good movie comedies are in short supply these days, making Game Night more fun than it deserves to be.",
      "author": "Steve Persall"
    },
    {
      "text": "Fast and funny, filled with memorable characters, and able to balance slapstick and violence without spilling too far in either direction, this frenetic R-rated farce is that rare comic gem that lands on all the spaces without ever going to jail.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Game Night succeeds at captivating its audience with a humorous twist on the detective genre.",
      "author": "Catalina Combs"
    },
    {
      "text": "A lively and exciting enough romp to watch unfold, even if it is completely frivolous.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "Much better than you might expect.",
      "author": "Tony Stamp"
    },
    {
      "text": "A perfectly funny, sharply written movie that's ultimately empty, where its only apparent goal was to remind you of other movies.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Game Night is a frantically funny, self aware caper that's got no real agenda except to make you have a good time.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Game Night is like playing Monopoly where the only properties are the four railroads. The players can go through the motions, but without more elements the overall result is good but far from as great as it could have been.",
      "author": "Rick Bentley"
    },
    {
      "text": "This little movie will do just fine.",
      "author": "Mick LaSalle"
    },
    {
      "text": "A charismatic ensemble cast, a sharp script and a few well-placed twists make Game Night one of the more enjoyable big studio comedies in recent memory.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "An unexpectedly sharp, upbeat action comedy. The comedy gets dark, occasionally involving violence and pain, but it's never nihilistic or mean-spirited.",
      "author": "Eric D. Snider"
    },
    {
      "text": "It's a good time, but it maybe could have been a great one.",
      "author": "Richard Lawson"
    },
    {
      "text": "Lumpy lowbrow humor and characters as thin as a Monopoly board mar Game Night, a comedy with an irresistible premise, but that only.",
      "author": "Joe McGovern"
    },
    {
      "text": "Game Night still delivers a requisite amount of worthy laughs.",
      "author": "Kit Bowen"
    },
    {
      "text": "A raucously funny film that has a knack for going right up to the edge of nastiness.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Game Night manages to be both surprising and well-executed in its comic and suspenseful moments.",
      "author": "Josh Spiegel"
    },
    {
      "text": "Game Night throws darts at the board with unflinching consistency and lands maybe 75 percent of its punchlines.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Just manages to sustain its 'is it real or is it a game?' tension through to its climactic twists.",
      "author": "Peter Canavese"
    },
    {
      "text": "Snappily paced and cleverly plotted, Game Night is the rare farce that exceeds low-ish expectations.",
      "author": "Mara Reinstein"
    },
    {
      "text": "\"Game Night\" is one of those movies that has a good premise and solid cast, but isn't as funny as it could have been.",
      "author": "Julie Washington"
    },
    {
      "text": "You'll find yourself laughing, then laughing at yourself and others for what you laughed at.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Ms. McAdams is one of cinema's most accomplished and appealing comic actresses. It's almost heartbreaking to contemplate how amazing she would be in a new comedy that was more than intermittently O.K.",
      "author": "Glenn Kenny"
    },
    {
      "text": "Each of the three couples has a different approach to solving the mystery, so it's funny to see them try to outsmart each other even though we know they're all mistaken.",
      "author": "Fred Topel"
    },
    {
      "text": "At the end of the day, it is uproariously funny - and that's pretty much all we're looking for...",
      "author": "Sophia Watson"
    },
    {
      "text": "It's hard to pin down the reasons as to why the film works so well, but it plays like a screwball comedy classic in the making.",
      "author": "Sandra Hall"
    },
    {
      "text": "Mark Perez has written one of the tightest comedy scripts to make it to be the big screen in ages.",
      "author": "April Wolfe"
    },
    {
      "text": "McAdams, whose comedic skills have gone unsung for way too long, is dizzy fun. The whole movie is, actually, even if it pretty much evaporates on impact.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "his tame but fitfully funny goof on suspense cinema at least assembles an agreeable guest list... As with any real game night, the company is more important than the game.",
      "author": "A.A. Dowd"
    },
    {
      "text": "With a packed lineup of players and a board that covers far more area than you'd expect from a wide-release early spring lark, [Game Night] is a dark romp for all the players involved.",
      "author": "Steve Greene"
    },
    {
      "text": "If Game Night were just a concoction, it might grow tiresome awfully fast. There's a nagging speck of humanity, or at least reasonably quick and cutting marital satire, that keeps the movie afloat.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "The Jason Bateman comedy model hasn't quite been radically altered in Game Night but it's one of his more entertaining outings. Just don't count on remembering much of it once the night is over.",
      "author": "Benjamin Lee"
    },
    {
      "text": "There are chuckles here and there, but a striking absence of belly laughs.",
      "author": "Jon Frosch"
    },
    {
      "text": "As a comedy about some low-key friends who love low-stakes games, Game Night is distracting enough. But as an unlikely action spoof? Yahtzee.",
      "author": "Simon Miraudo"
    },
    {
      "text": "This zippy little thriller delivers laughs aplenty amidst a hyperactive plot that keeps you guessing until the very end. A dark and welcome surprise.",
      "author": "Louise Keller"
    },
    {
      "text": "What you get here is a battlefield of comedy and action, one that's self-aware enough to eek by despite trying to look so cool and snazzy. It's a popcorn movie, a Friday night rental, a game night.",
      "author": "Michael Roffman"
    },
    {
      "text": "At a certain point, the film quits trying to make you laugh and gives in to its greater purpose: shocking you with real stakes and emotional soliloquies.",
      "author": "Dave Schilling"
    },
    {
      "text": "It's about as funny as an above-average episode of an above-average sitcom.",
      "author": "Scott Mendelson"
    },
    {
      "text": "A genre-hopper that's far better than you might think.",
      "author": "Danielle Solzman"
    }
  ],
  "release_year": 2018,
  "duration": 100,
  "genres": [
    "Comedy",
    "Action"
  ],
  "synopsis": "Max and Annie's weekly game night gets kicked up a notch when Max's brother Brooks arranges a murder mystery party -- complete with fake thugs and federal agents. So when Brooks gets kidnapped, it's all supposed to be part of the game. As the competitors set out to solve the case, they start to learn that neither the game nor Brooks are what they seem to be. The friends soon find themselves in over their heads as each twist leads to another unexpected turn over the course of one chaotic night.",
  "popularity": 7.8,
  "poster_url": "https://image.tmdb.org/t/p/original/85R8LMyn9f2Lev2YPBF8Nughrkv.jpg"
}