{
  "movie_name": "Get Out",
  "movie_id": "get_out",
  "total_reviews": 400,
  "reviews": [
    {
      "text": "To come right to the point, “Get Out” is an 104-minute living embodiment of a slow-burning WTF moment that just keeps growing with every new detail.",
      "author": "Don Shanahan"
    },
    {
      "text": "An atmospheric, albeit strange, combination of The Stepford Wives (1972) and Guess Who's Coming to Dinner (1967), but also with some \"over-the-top\" horror in the mix and hardly offering anything new or subtle by the end.",
      "author": "Diana Tuova"
    },
    {
      "text": "The experience of Get Out is unforgettable, and will hopefully provoke audiences to wrestle with why this material matters to so many. As a directorial debut, it’s hard to top what Peele does here.",
      "author": "JD Duran"
    },
    {
      "text": "Get Out achieves something that few films of its ilk do: build a scary story with human pathologies instead of ghosts and monsters... [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "Peele's exciting new voice brought horror, laughs and deeply unsettling self-reflection.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "One of the most original and refreshing films to hit the cinema in years. Jordan Peele's feature debut works as a smart dark comedy, satire and psychological thriller, touching on very relevant issues today. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Get Out is a razor-sharp horror movie with a wicked sense of humor and an adroit perspective.",
      "author": "Norman Gidney"
    },
    {
      "text": "A penetrating analysis of racism in America.",
      "author": "Brian T. Carney"
    },
    {
      "text": "Peele clearly aims to make a movie that can be several different things at once, but I’m not sure any of the film’s multiple identities are all that strong.",
      "author": "Keith Garlington"
    },
    {
      "text": "Get Out is essential viewing for the socially conscious horror fan.",
      "author": "Brian Eggert"
    },
    {
      "text": "Get Out is horror filmmaking at its absolute finest.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Get Out is perhaps the best terror tale since the mid-2000s served up The Descent and Pan's Labyrinth, two masterworks that, like this one, have much more on tap than just creeping out audiences.",
      "author": "Matt Brunson"
    },
    {
      "text": "A film from a highly influential new filmmaker that makes audiences think deeply about life, but it does so through a uniquely conscious horror lens.",
      "author": "Nathan Mattise"
    },
    {
      "text": "Its sucker punch to the status quo has ensured it's impossible to forget.",
      "author": "Yasmin Omar"
    },
    {
      "text": "Well told, impressively rendered, and creepy as all hell.",
      "author": "Michael J. Casey"
    },
    {
      "text": "When that real-life horror flows into the film's fantastical premise, it's revealed how well first-time director Jordan Peele threaded the needle.",
      "author": "Ian Brill"
    },
    {
      "text": "Get Out is a horror film but like all great genre films it isn't just that. It could more rightly be called a social thriller, a film that looks at everyday ills - in this case racial tension - through the lens of a genre movie.",
      "author": "Richard Crouse"
    },
    {
      "text": "A tense, creeping drama that gets under your skin, makes you laugh and then explodes outward in the most satisfying, pulpy of ways. Get Out is all of those things.",
      "author": "Tony Black"
    },
    {
      "text": "Get Out is a smart, quite funny, and startling picture, you just have to see it.",
      "author": "Leo Brady"
    },
    {
      "text": "With a perfect balance of terror and comedy, this smart, slightly-satirical look on society and racism is a well crafted film that dives even deeper than you expect.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "Kaluuya is exceptionally grounded (continuously tossing around genuinely inquisitive expressions), making the eerie situations more realistic and more humorous.",
      "author": "Mike Massie"
    },
    {
      "text": "Contains that third act twist that comes with smart horror movies. By the end, the audience was cheering and applauding...",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Get Out is an achievement on a textual, metatextual, and subtextual level that is effectively a roadmap for filmmakers trying to build a political message into their genre fiction.",
      "author": "Leigh Monson"
    },
    {
      "text": "One of the best films of the year for 2017.",
      "author": "Richard Propes"
    },
    {
      "text": "Jordan Peele delivers the best movie of the decade thanks to masterful symbolism of American flag wardrobe, cell-phone justice, cotton-picking escapes and dialogue double meanings.",
      "author": "Jason Fraley"
    },
    {
      "text": "They say \"a mind is a terrible thing to waste\" and in Jordan Peele's directorial debut, Get Out is certainly one of the most accomplished films of the year.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "It can work as a suspense thriller, a horror comedy, or as a launching point for a deeper social conversation.",
      "author": "Allen Almachar"
    },
    {
      "text": "Sharp and satirical, frustratingly topical and poignant, \"Get Out\" insightfully explores race in America while delivering a banger of a horror movie.",
      "author": "Brent McKnight"
    },
    {
      "text": "The complexity, though, is reduced by caricaturing the Armitage family and their guests as unfeeling monsters[.]",
      "author": "CJ Sheu"
    },
    {
      "text": "Get Out is the kind of thriller that will crawl under your skin and worm its way into your brain, making you think about it long after it's over.",
      "author": "Damond Fudge"
    },
    {
      "text": "The horror is effective because Peele, who is also a comedian, supports it with a social commentary that criticizes the most brutal veins of racism in current American society. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "I did think it was very interesting and I'm excited for Jordan Peele to make more movies.",
      "author": "Avaryl Halley"
    },
    {
      "text": "I liked it for what it was... I was entertained.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Get Out is so damn smart, funny, and impressively directed by Peele, who embraces certain great horror tropes, but never forgetting that the best horror and sci-fi often includes clandestine messages and commentary on modern society.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Jordan Peele takes us on a frustrating yet ultimately victorious ride with his race-based mystery horror movie. Get Out combines genuine thrills with a no-holds-barred critique of black-white relations.",
      "author": "Rhodé Marshall"
    },
    {
      "text": "Peele seduces, subverts and manipulates audience expectations - as the masters Alfred Hitchcock, John Carpenter, and Stanley Kubrick did before him.",
      "author": "Anne Thompson"
    },
    {
      "text": "It's tense, angry, hilarious, and here in Trump's America, it might as well be a protest film.",
      "author": "Dan Scully"
    },
    {
      "text": "Get Out isn't a great film because of its excellent pacing, strongly defined characters, and mastery of tone. It's a great film because it never loses sight of its concept.",
      "author": "Tim Brennan"
    },
    {
      "text": "...it'll be with us years later as shattered pieces from its fall, making sense for the future of how we talk about racism, and the human monster that hides within it.",
      "author": "Ashlee Blackwell"
    },
    {
      "text": "By working on both the level of social satire and scary horror flick, Get Out is one of the finest directorial debuts in recent memory.",
      "author": "Chris McCoy"
    },
    {
      "text": "Podcast Review",
      "author": "Julian Lytle"
    },
    {
      "text": "Jordan Peele hands out a great lesson in creating eerie suspense. It helps that his cast is excellent, with Daniel Kaluuya, Catherine Keener and Betty Gabriel as stand-outs.",
      "author": "Ard Vijn"
    },
    {
      "text": "Of course, the social message of the movie wouldn't carry much weight if it wasn't so well made. It's not scary so much as it is tense and unnerving, its paranoid horror elements handled well by first-time writer-director Jordan Peele.",
      "author": "Mark H. Harris"
    },
    {
      "text": "...combines a well-executed horror movie with incisive social commentary...",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "[Jordan Peele] shows a real knack for producing scares and offsetting scenes of slow-building dread with laugh-out-loud moments.",
      "author": "Phil Guie"
    },
    {
      "text": "Come for the scares. Stay for the humour, which is scalpel-sharp.",
      "author": "Randall King"
    },
    {
      "text": "Briskly paced, this is as relevant as social commentary as it is a potent horror film, and marks Jordan Peele as an exciting, multifaceted director.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Get Out makes imagining such a thing beyond the realm of an intellectual exercise. But by extension this leaves me even more disturbed at the times I tacitly nodded in approval myself. Get Out got under my skin.",
      "author": "Rhys Tarling"
    },
    {
      "text": "Get Out is filled with wonderfully eerie performances.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "You'll discover a little of everything in this movie; intelligence, wit, horror, humour, deceit, cinematography, dread, realism, scores, fear and more.",
      "author": "Zoe Rose Smith"
    },
    {
      "text": "This film is more enthralling thriller than horror, a delicious mind-bender, the blackest of humor and enduringly provocative.",
      "author": "Kate Rodger"
    },
    {
      "text": "For those out there who thought we might have entered a post racial society with the election of a Black President, this movie acknowledges that falsehood with both humor and sarcasm.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Peele has a solid script and a knack for storytelling in an appealing way which makes Get Out is more enjoyable than many of the other suspense/thriller/horror movies being made today.",
      "author": "Allison Rose"
    },
    {
      "text": "It perfectly homages classic horror movies while feeling contemporary in its themes. However, it's also one of the most entertaining movie experiences I've ever had.",
      "author": "Karl Delossantos"
    },
    {
      "text": "With great buzz and nearly universal acclaim, critics may worry about overselling Get Out. But the film truly is one of the funniest comedies, scariest horror films, and most assured cinematic debuts in recent memory.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The satirical thesis of writer/director Jordan Peele's Get Out is so deliciously literal, Jonathan Swift modestly proposes that his recipe has been bitten.",
      "author": "Ryan Syrek"
    },
    {
      "text": "One of the most complex and ferocious explorations of race in America to have ever been released by a major studio.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Jordan Peele succeeds in giving us a smart, well-written thriller/horror filled with a great balance of tongue-in-cheek humour and a viscerally intense uneasiness.",
      "author": "Carolyn Mauricette"
    },
    {
      "text": "Peele's examination of the subtle racism amongst liberal white people is unforgettable, evoking classic horror while carving out a new territory wholly his own.",
      "author": "C.H. Newell"
    },
    {
      "text": "[Jordan Peele] is starting off in a great place as far as building a filmography.",
      "author": "Dan Murrell"
    },
    {
      "text": "The film has clever ideas about literalizing black fear of the pathology of whiteness, but it doesn't go far enough in its indictment of white supremacy.",
      "author": "Cate Young"
    },
    {
      "text": "The tightly wound plot unspools with expert control. Some elements are guessable, but there are also fantastically judged reveals which balance the audience on a knife edge of possibility, creating visceral tension and even panic.",
      "author": "Rachel Brook"
    },
    {
      "text": "Suffice it to say Get Out does a good job weaving together traditional horror tropes with pointed satire about racism.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Intelligent and intense, Get Out lingers long after the credits roll. It is one of those rare films that has \"instant classic\" written all over it.",
      "author": "Allen Adams"
    },
    {
      "text": "You have a good time, and you gain a little perspective...it makes nuance a priority.",
      "author": "May Leitz"
    },
    {
      "text": "Peele's directorial debut is a promise of good things to come.",
      "author": "Amanda Greever"
    },
    {
      "text": "An ingenious, provocative and politically incorrect proposal; a slap against those who boast their lack of racism; an anguishing and disturbing nightmare about racial tensions in the Donald Trump era. [Full Review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "Huye! se percibe como uno de esos films que buscan aleccionar al espectador, pero cuando el subtexto es lo suficientemente astuto es difcil molestarse cuando se est siendo aleccionado, incluso cuando la postura del director carece de imparcialidad.",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "This movie could've been a trailblazing original commentary on race relations. It's a good idea, but it's poorly executed.",
      "author": "Louisa Moore"
    },
    {
      "text": "It shares perspectives that I believe only a film like this can share; that makes it worthy of consideration and contemplation.",
      "author": "Colby Bryant"
    },
    {
      "text": "The best horror films...[turn] abstract unease into concrete terror. The material(istic) monsters of Get Out are rich, suburban white people. I know--they freak me out too.",
      "author": "Joel Mayward"
    },
    {
      "text": "Get Out winks at centuries of painful history and honors it with an absurdist de-pantsing of race in America.",
      "author": "Li Lai"
    },
    {
      "text": "Vestiges of the ingrained attitudes of centuries of slavery on the country's home turf still remain...[and Peele] uncovers and explodes them brilliantly in this hugely entertaining horror-comedy-satire.",
      "author": "Alexa Dalby"
    },
    {
      "text": "This film took me through every emotion and left me wanting more.",
      "author": "Sharronda Williams"
    },
    {
      "text": "There are a dozen places where this could've all gone wrong and fallen apart, but Peele has clearly shown up to play.",
      "author": "Bob Chipman"
    },
    {
      "text": "The horror of Get Out is not only the events that take place, but also the racism that fuels these events. Jordan Peele skillfully takes on a serious social issue in a unique light that results in a thrilling film dripping with dark humor.",
      "author": "Molly Henery"
    },
    {
      "text": "Jordan Peele has surprisingly revealed himself as a new potential master of horror.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Peele dives fully into racial issues and the horror genre with Get Out and crafts one hell of an impressive debut.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Jordan Peele nails his colours to the mast with a very entertaining, but also very obvious, horror number that seeks to satirise contemporary American race relations.",
      "author": "PJ Nabarro"
    },
    {
      "text": "What Peele accomplishes in this film is so far above what your everyday horror film is capable of. In fact, few films have the ability to open up discourse.",
      "author": "Alan French"
    },
    {
      "text": "Get Out didn't solve problems, but it gave an idea pictures-representation of a kind. What more could you ask from a movie?",
      "author": "Sean Fennessey"
    },
    {
      "text": "For black viewers, it is like their very own version of Dante's Inferno; for white viewers, it forces us to question our own complicity.",
      "author": "Tomas Trussow"
    },
    {
      "text": "This brilliantly provocative first feature from comic turned writer-director Jordan Peele proves that the best way to get satire to a mass audience is to call it horror.",
      "author": "Jake Wilson"
    },
    {
      "text": "Get Out brings humour into the horror-thriller realm. By adding the laughs, Get Out adds a flair of fun and an odd sense of realism.",
      "author": "Kat Hughes"
    },
    {
      "text": "A modern horror classic that is smart, funny, surprisingly unpredictable throughout.",
      "author": "Rendy Jones"
    },
    {
      "text": "There are aspects that could stand better explanation within the plot, but it doesn't seem compromised, and it makes us jump, sweat and cheer in all the right places.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "I laughed, I jumped, I didn't cry... but what a way to come out the gate.",
      "author": "Funmi Sunmonu"
    },
    {
      "text": "Where the film fails is in the actual structure of the story, which is riddled with inconsistencies, gaping holes in the plot, and what seems to be a mid-point shift from one story to a completely different one.",
      "author": "Monica Reid"
    },
    {
      "text": "Everything in Get Out seems innocuous on first blush.",
      "author": "Robert Daniels"
    },
    {
      "text": "Funny, tense, clever and assured, Get Out speaks to the lie of the \"post-racial\" world without ever letting the white part of its audience off the hook.",
      "author": "Molly Templeton"
    },
    {
      "text": "There were really strong performances throughout, especially from those playing Black people trapped inside their own bodies...to have that level of emotion...",
      "author": "Achara Kirk"
    },
    {
      "text": "Even if horror or thrillers aren't your genre, it's still a great movie.",
      "author": "Jaby Koay"
    },
    {
      "text": "Get Out is unusually smart for a February horror outing, effective and bracing. Its well- scripted and directed and deeply satisfying even if it causes some politically correct discomfort.",
      "author": "Anne Brodie"
    },
    {
      "text": "The cleverness of blending these genres, with a racial commentary that is razor sharp, is what got and kept people talking about \"Get Out.\"",
      "author": "Asia Frey"
    },
    {
      "text": "\"Get Out\" is total escapism while being a wonderfully mind-bending story revolving around racism. To pull off that combination is absolutely extraordinary.",
      "author": "Pamela Powell"
    },
    {
      "text": "The performances are outstanding, as is the writing and directing. I definitely was tense watching the film (again, I'm a wimp) but I don't think you need to be deterred from the film if you're not a fan of horror.",
      "author": "Stephanie Cooke"
    },
    {
      "text": "Almost everything about this movie is both intelligent and raw.",
      "author": "Eve Tushnet"
    },
    {
      "text": "The layers are endless and once you realize the totality of what's happening, the events take on new meaning.",
      "author": "Clover Hope"
    },
    {
      "text": "You'll remember this little shocker a lot longer than you will the latest big budget flick to come out of the Hollywood meatgrinder this summer.",
      "author": "Annalee Newitz"
    },
    {
      "text": "Racism doesn't always have to be virulent, it can sometimes take benevolent and malicious forms as displayed in this haunting and topical film.",
      "author": "Wesley Lovell"
    },
    {
      "text": "A tasty performance from Kaluuya, together with Catherine Keener and Bradley Whitford as the parents, but Peele is the star find here.",
      "author": "Alison Rowat"
    },
    {
      "text": "Peele's parting thought is not to insist that we are destined to be slaves to the narrow thinking of others, but that we have a responsibility to remain cautious and vocal until such ideas have been destroyed. Get Out is an urgent call to that necessity.",
      "author": "David Keyes"
    },
    {
      "text": "If you like to be scared, if you like to laugh, and if you like to learn a thing or two at the movies, this absolutely cannot be missed.",
      "author": "Shaun Munro"
    },
    {
      "text": "In using both realities in his movie, Peele brings Get Out to a higher level of horror, at least for any person of color in the audience. We're all keenly aware of how possible it is.",
      "author": "Kendra James"
    },
    {
      "text": "Although with some touches of predictability, \"Get Out\" is an interesting proposal in a cinema that seems to repeat itself again and again. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "You don't know what's going to happen or how people are going to act. The tension is so deep.",
      "author": "Andre Meadows"
    },
    {
      "text": "The directorial debut of Key and Peele co-creator Jordan Peele, Get Out is a taut, terrifyingly appropriate thriller.",
      "author": "Rick Marshall"
    },
    {
      "text": "Dark comedy, sharp social satire and mainstream horror elements merge into the strange and smartly written first feature by filmmaker Jordan Peele, who drives his critique of cultural appropriation into a clever, anti-racism statement.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Brilliantly questions white liberal hypocrisy. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "Get Out teaches us to be ever-vigilant and aware and that's not being paranoid, that's just sad, bitter common sense.",
      "author": "Chris Alexander"
    },
    {
      "text": "The whole final stretch is nonsense. [Full review in Spanish]",
      "author": "Jaime Fa de Lucas"
    },
    {
      "text": "Satire implies the provocation of laughter, even if it's harsh or mocking. The truly disturbing Get Out seldom raises so much as a smile.",
      "author": "Stuart Klawans"
    },
    {
      "text": "Get Out is well worth seeing and is a genuinely fresh take on the genre.",
      "author": "Toby Woollaston"
    },
    {
      "text": "... let me advise you to get out - get out and see this sure-to-be-talked about film.",
      "author": "Al Hoff"
    },
    {
      "text": "Jordan Peele's debut will stand among the cream of the crop as far as 2017 horror films go. It's wildly ambitious, poignant, terrifying, full of laughs, a refreshing take on the genre with subversive tendencies, racially charged, and damn entertaining.",
      "author": "Robert Kojder"
    },
    {
      "text": "Get Out...is not a comedy but a psychological thriller that--if anything--delves into satirical territory.",
      "author": "Danielle Solzman"
    },
    {
      "text": "As a keenly observed portrayal of the African-American experience, it seems every bit as important a film as Moonlight is, even if the Academy will probably never recognise its brilliance.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "Kudos to Peele for tackling a painful subject in such a massively entertaining and thoroughly memorable fashion. [Full review in Japanese]",
      "author": "Claudia Puig"
    },
    {
      "text": "Jordan Peele's Get Out is one of the more intriguing and provocative horror movies to come out of Hollywood in recent years.",
      "author": "James Mottram"
    },
    {
      "text": "Who would've ever thought Peele would peel away from comedy to write and direct such assured work as he's done here. It's socially relevant bent is clever.",
      "author": "Courtney Howard"
    },
    {
      "text": "After playing with our expectations, this turns out to be a very different sort of film.",
      "author": "Matthew Bond"
    },
    {
      "text": "Peele is smart enough to skewer all of white America and demand they wake up to the elephant in the room. Hypocrisy seems to be the name of the game. [B+]",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Peele uses Get Out to take control of black bodies and give black men in the audience an allegory that they've craved in horror for decades.",
      "author": "Ira Madison III"
    },
    {
      "text": "With his over-the-top plot, [Jordan] Peele takes several racial themes to the extreme in Get Out. But what stood out to me the most was his take on white women's role in racism.",
      "author": "Sesali Bowen"
    },
    {
      "text": "Horror movies have bad third acts all the time; the hope is that they have two first acts that are this good, with such an excellent anchor as Daniel Kaluuya.",
      "author": "Tim Brayton"
    },
    {
      "text": "The acting is good, and the firecracker script has some excellent ideas. But Get Out has fundamental holes, which mostly occur during the second half of the film.",
      "author": "Dan Marcus"
    },
    {
      "text": "All considered, Get Out is the sharpest, most thoughtful, and against all odds, the funniest horror film that Hollywood has churned out in a long old while.",
      "author": "Nick Reilly"
    },
    {
      "text": "[Jordan] Peele has served up the season's sharpest hunk of weird fun.",
      "author": "Robert Denerstein"
    },
    {
      "text": "What makes [Get Out] a worthwhile experience is Jordan Peele's skillful genre intervention.",
      "author": "K. Austin Collins"
    },
    {
      "text": "A brilliant film that gives freshness to the rebirth of independent horror as the new genre of American social satire. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "Regardless of genre or construct, Get Out is a film that demands to be repeatedly seen to spot new clues in the most innocuous spaces, despite the encroaching shadows.",
      "author": "Brooke Corso"
    },
    {
      "text": "Get out manages to present an original proposal within the horror genre, but also makes use of social satire when dealing with racial issues without falling into clichés that generates racism as such. [Full review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "What makes it so efficient is the fact that under all the fantastical elements of its plot resides a horror that's all too real. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "Jordan Peele, a recycled comedian in a screenwriter and director, gets with this film the perfect cruel tale of horror. [Full review in Spanish]",
      "author": "Marcos Gandía"
    },
    {
      "text": "What Jordan Peele has achieved here is a delight. Intelligent, unpretentious, strong, intense and fun. [Full review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "Peele comforts the afflicted ... and he afflicts the rest of us, the comfortable, who often perpetuate racist behaviors and vocabularies even when we have the best intentions.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "The director makes his debut film and uses elements of his community to make a film with form and background to ensure that \"the color black is in fashion.\" [Full review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "It's an eminently satisfying film, combining sharp social satire with a horror flick's incremental sense of dread.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "A surprising story: in essence, a horror story with a mixture of thriller and dark humor tones. [Full review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "An electrifying achievement.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "A basic but effective film for our times and has given its community an end to aspire. [Full review in Spanish]",
      "author": "Rafael Paz"
    },
    {
      "text": "I think studios need to take more chances on films like this. Films that try to be different and push boundaries. Get Out is bold and daring and most importantly, unique.",
      "author": "Scott Menzel"
    },
    {
      "text": "Get Out is an unorthodox horror-thriller that could be game changer for the genre.",
      "author": "Matthew Toomey"
    },
    {
      "text": "... a tricky and successful mix of social satire, modern horror, and savvy commentary on race as experienced by a person of color in a largely white society.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Get Out: is a masterfully done horror film that builds its chilling menace slowly and does not reveal itself until it's too late to resist.",
      "author": "J.C. Maçek III"
    },
    {
      "text": "Jordan Peele's Get Out contains a fascinating idea and some intriguing social commentary, but it's ultimately let down by bland execution and writing that never allows the idea to come to full fruition.",
      "author": "Jeff Beck"
    },
    {
      "text": "The strenght of the film is in the perfection of the narrative artifact that always seems right in taking each decision, always brilliant, always sour. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A major work in which everything oozes talent. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "Peele plays a risky move using the film genre to establish a very real terror that usually faces hypocrisy. [Full review in Spanish]",
      "author": "Alberto Abuín"
    },
    {
      "text": "Pessimistic, violent and scathing, Jordan Peele's debut film is a faithful reflection of a divided country. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "To audiences [outside the US] who may not understand - or care - about the satire, Get Out is still a decent horror film.",
      "author": "Ben Sin"
    },
    {
      "text": "Jordan Peele's film is interesting given the provocation it exerts in a reality where politics haven't found a way to hide the undeniable. [Full review in Spanish]",
      "author": "Carlos Esquives"
    },
    {
      "text": "A fresh horror comedy about things that aren't funny; And we don't mean just visiting the in-laws. [Full review in Spanish]",
      "author": "Daniel de Partearroyo"
    },
    {
      "text": "The runaway hit of the year - this is a must-see film. Don't see it alone!",
      "author": "Louise Keller"
    },
    {
      "text": "The staging is brilliant, but it's the performances that stand as the pillar of the film. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Get Out is confident and assured and in director Peele, the 21st century has found a new voice in horror.",
      "author": "Garry McConnachie"
    },
    {
      "text": "Smart, entertaining, superbly-acted and shockingly funny, Get Out is a rare film that ticks all the boxes and works on a number of different levels.",
      "author": "Vicky Roach"
    },
    {
      "text": "Jordan Peele's debut as a feature film writer/director announces him as a major talent with a big, big career ahead. Get Out is fabulous, a film that not only gets better as it goes along, but keeps getting better the more you think about it afterwards.",
      "author": "CJ Johnson"
    },
    {
      "text": "I didn't feel the comedic elements always sat well with the rest of the film but that's a small issue with an otherwise gripping, intelligent and suspense-filled thriller.",
      "author": "Tim Martain"
    },
    {
      "text": "The film has enjoyed huge word-of-mouth success...yet it ultimately seems too frightened to face down the spectres of modern racism that it rouses. As pure genre entertainment, however, it does deliver sufficient bang.",
      "author": "Jim Schembri"
    },
    {
      "text": "Get Out is definitely great now, and I'm taking a punt that it will be considered great for decades to come.",
      "author": "Matt Neal"
    },
    {
      "text": "It's a game-changer.",
      "author": "Paul Byrnes"
    },
    {
      "text": "[Director] Peele, who also scripted, is very good at writing barbed dialogue, and as the film proceeds the audience is likely to feel as uncomfortable as Chris.",
      "author": "David Stratton"
    },
    {
      "text": "It is an ambitious and sometimes uneven affair... When it works though, it really works, and the cast is very fine.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Get out and see this rip-snorting thrill-fest and ensure more mid-sized horrors get a cinematic run in Kiwi theatres.",
      "author": "Dominic Corry"
    },
    {
      "text": "A daring and original horror film that never leaves the spectacle of its cruel satire of a social reality behind nor the dark portrait of the politically incorrect utopia that wants to reflect. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "One of the most assured, astute, entertaining and intelligent horror movies to creep out cinemas in years.",
      "author": "Sarah Ward"
    },
    {
      "text": "It's Guess Who's Coming to Dinner made over in the spirit of Rosemary's Baby, with accessories inspired by Meet the Fockers.",
      "author": "Sandra Hall"
    },
    {
      "text": "Get Out is one of the great movie experiences of 2017.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Although Get Out is a horror movie laced with hysterical comedy, the most distinguishing facet is how forthright and unflinching its politics is.",
      "author": "Damien Straker"
    },
    {
      "text": "Peele plays the suspense like a maestro wielding a Stradivarius - each tightly wound string used to create a sense of foreboding and anticipation that Hitchcock himself would've been jealous of.",
      "author": "Wenlei Ma"
    },
    {
      "text": "Jordan Peele's Get Out plucks a raw nerve with skill and style. Strange, funny and confronting, it's the horror satire of our age.",
      "author": "Simon Miraudo"
    },
    {
      "text": "A ravenous masterpiece tailor made for America's current climate.",
      "author": "Matt Patches"
    },
    {
      "text": "Get Out is about how we should get out of our own abyss conditioned by familiarity and history, and it's one of the smartest films out there.",
      "author": "Kong Rithdee"
    },
    {
      "text": "Get Out is one strong, creepy and at times, yes, funny picture which successfully combines horror and comedy with a relevant and message.",
      "author": "Marija Djurovic"
    },
    {
      "text": "Well cast and slickly edited... situations are horrific in their banality... who knew teacups could be sinister?",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "A marvel of tightly controlled pacing, off-kilter visuals, and rich atmosphere, Peele's film owes a good deal of its exquisite shocks to the claustrophobic terrors of Rosemary's Baby and the manicured dread of Bryan Forbes's The Stepford Wives.",
      "author": "Cameron McAllister"
    },
    {
      "text": "(LA GRANDE BOUFFE PODCAST) With friends like Obama-liberals, none of us need any enemies, much less the likes of the Trump administration and its legion of racist thugs. We may all need to \"get out.\"",
      "author": "Cole Smithey"
    },
    {
      "text": "Jordan Peele's semi-parodic horror film Get Out has a complexity worthy of its historical moment.",
      "author": "J. Hoberman"
    },
    {
      "text": "By focusing the storyline on a particular form of racism -- the kind that's often disguised as peculiar envy -- Get Out reveals something more insidious.",
      "author": "Mary Elizabeth Williams"
    },
    {
      "text": "Mostly [Peele] creates a lovely, off-kilter mood, riffing with tremendous visual poise on all sorts of classics, including Seconds, Guess Who's Coming to Dinner and The Stepford Wives.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Towards the end, it all gets a little overwrought. But, on the whole, what a clever, provocative and entertaining film this is in the way it pokes and prods at the emotive issue of race relations while mixing up so many genres.",
      "author": "Brian Viner"
    },
    {
      "text": "Get Out works the way it does because of its emotional purity. Chris's discomfort is real; Rose's chagrin with the way her family is behaving is real.",
      "author": "Walter Chaw"
    },
    {
      "text": "Kaluuya brings a wry intelligence his role as the straight man to the films' many eccentric characters.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "It will probably end up being the best horror movie of the year, and easily one of the best of the past five years.",
      "author": "Rain Jokinen"
    },
    {
      "text": "Smart, accessible, pin-sharp, and also a more authentic, disturbing genre-tweaking pic about slavery and the antebellum South than Django Unchained.",
      "author": "Aaron Yap"
    },
    {
      "text": "Jordan Peele is known for being really good at comedy, and now it turns out he's really good at horror too.",
      "author": "Sarah Cullen"
    },
    {
      "text": "Peele's background in comedy serves him very well. The jokes are never riffed, nor do they feel less than organic to the plot.",
      "author": "John Lui"
    },
    {
      "text": "In essence Get Out is every microaggression a black man has ever faced -- but supersized.",
      "author": "Kemi Alemoru"
    },
    {
      "text": "Don't be surprised if a knot sets up residence in your stomach as Peele toys with you.",
      "author": "Hilary A White"
    },
    {
      "text": "Jordan Peele's Get Out is so clever you could write a thesis on it the length of War and Peace.",
      "author": "Paul Whitington"
    },
    {
      "text": "A film of two halves, then, and though I'm not convinced it all fits together perfectly, the latter part's move into all-out horror is entertaining in itself.",
      "author": "Edward Porter"
    },
    {
      "text": "Proof that you don't need stars or special effects to lure an audience. Just a fresh idea and a twisted imagination.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "Beneath the beatific smile of 21st-century liberalism, Get Out finds the still grinning ghoulish skull of age-old servitude and exploitation unveiled during a rollercoaster ride into a very American nightmare.",
      "author": "Mark Kermode"
    },
    {
      "text": "A great exercise in sustained tension and menace rooted in social discomfort.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Hate Horror Films? See This One",
      "author": "Jean Lowerison"
    },
    {
      "text": "An erratic yet ultimately rewarding horror flick...",
      "author": "David Nusair"
    },
    {
      "text": "Peele succeeds where sometimes even more experienced filmmakers fail: He's made an agile entertainment whose social and cultural observations are woven so tightly into the fabric that you're laughing even as you're thinking, and vice-versa.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "It's a combination of a knowing issue-based drama, lively romantic comedy and unhinged horror that hits all of its targets with precision. And it keeps us gleefully entertained with its escalating terror.",
      "author": "Rich Cline"
    },
    {
      "text": "This isn't some inside joke, it's a universal lesson learnt... even if that lesson is expertly disguised by a brilliantly bizarre and truly bonkers story set in the 'burbs.",
      "author": "Amy West"
    },
    {
      "text": "In a double whammy of satire, Get Out upends all the expected tropes of the horror movie and gives middle-class white liberals a thorough skewering.",
      "author": "Kate Muir"
    },
    {
      "text": "It lacks the subtlety of Night of the Living Dead, but deftly balances laughs and bloody thrills.",
      "author": "Jordan Farley"
    },
    {
      "text": "It was 6 minutes before I yelped and 15 before I wondered if I'd packed fresh underwear.",
      "author": "Jamie East"
    },
    {
      "text": "It's an auspicious debut to say the least, with Peele making good on his performance background in sketch comedy to make his points land with a sly wit that makes the horror all the more powerful.",
      "author": "Alistair Harkness"
    },
    {
      "text": "To call it the most important movie of the year so far makes it sound possibly rather worthy. That's not true at all. Get Out is a comment on a highly complex situation that's also a total blast.",
      "author": "Olly Richards"
    },
    {
      "text": "The most forceful and inventive American horror film since It Follows.",
      "author": "Tim Robey"
    },
    {
      "text": "The film has more to do with discomfort and envy than blind hatred. What a strange marvel it is.",
      "author": "Donald Clarke"
    },
    {
      "text": "Jordan Peele has proven himself to be a dab hand at mixing horror and satire with his smash hit directorial debut, Get Out. It has the scares, it has the smarts, and it also has a lot to say about racism in the US.",
      "author": "Harry Guerin"
    },
    {
      "text": "Shattering and deep-down bone-chilling. A viciously unsettling nightmare of race and privilege that carves out a much-needed paradigm shift for genre film.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Is it too early to call this a modern genre classic?",
      "author": "Trevor Johnston"
    },
    {
      "text": "If there were more African-American directors working in Tinseltown, this film's plot would surely be familiar. As it is, it's quite unlike anything else out there.",
      "author": "Helen O'Hara"
    },
    {
      "text": "This scathing satire is the perfect horror film for the post-Obama era, taking a razor-sharp scalpel to white liberal attitudes on race.",
      "author": "Matthew Turner"
    },
    {
      "text": "A scary, funny and razor sharp social thriller, and the most exciting debut film this year.",
      "author": "Jamie Dunn"
    },
    {
      "text": "It's a brilliantly mischievous, unsettling movie.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Bursting onto the film scene, Peele's directorial debut of Get Out was an unexpected success that will give future films to be released in 2017 a run for their money.",
      "author": "Stephanie Archer"
    },
    {
      "text": "Witty, trenchant, very topical, sometimes utterly bloodcurdling but always with plenty of polemical points to make.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Its box office success is a sign that America 2017 -- a place where #TheResistance is a trending Twitter topic -- desperately needed this distillation of satire, cri de guerre and catharsis.",
      "author": "John Beifuss"
    },
    {
      "text": "A disturbing, darkly funny, and nightmarish cinematic gem.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Get Out is an effective, thought-provoking, slow-burn thriller",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Peele's blistering debut is a timely and powerful satire of modern prejudice as much as it is a taut, gripping exercise in horror cinema.",
      "author": "Christopher Machell"
    },
    {
      "text": "\"Get Out\" succeeds by taking a fairly-standard horror format and invigorating it with a visceral social element.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Nope, not going to ruin the movie. Suffice it to say there is creeping unease, heart-stopping tension, people who are not as they seem to be and a finale that is violent but which will knock your socks off.",
      "author": "Diane Pershing"
    },
    {
      "text": "While Peele may be best known for his comedic offerings, this endeavour is far from funny - it's pretty disturbing stuff.",
      "author": "Stefan Pape"
    },
    {
      "text": "The combination of Peele's deep understanding of the horror genre and his personal experience means his directorial debut is a sharp and fresh reflection on racial tensions in contemporary America.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "An astute, insidiously scathing, cinematic commentary on racial tension in America.",
      "author": "Susan Granger"
    },
    {
      "text": "This film is a marvel of ingenuity and inspiration, a horror tale where the most frightening image is the mirror image of the audience realizing they're the ones being so intimately examined.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "What makes Get Out more than just a slam-bang scarefest is that, in its own darkly satiric way, it is also a movie about racial paranoia that captures the zeitgeist in ways that many more \"prestigious\" movies don't.",
      "author": "Peter Rainer"
    },
    {
      "text": "I enjoyed the offering, laughed at the right moments, and actually found myself with sweaty palms as things came to a head toward the end. (Full Content Review for Parents - Violence, Profanity, Sex, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Making his directorial debut, Peele manages to continually pique our interest, even when we know where the story is heading.",
      "author": "Daniel Barnes"
    },
    {
      "text": "After everything is revealed in Get Out you'll want to see it again to watch the pieces fall into place. Nice job, Mr. Peele.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "With strong visual sense and even stronger writing, Peele keeps us off-kilter, approaching the material from odd angles, challenging us to ruminate on racial paranoia.",
      "author": "John Serba"
    },
    {
      "text": "Writer/director Jordan Peele's Get Out has a deep lineage that includes films like Night of the Living Dead, The Spook Who Sat by the Door and Bamboozled - it's that good. And... funnier.",
      "author": "Tim Cogshell"
    },
    {
      "text": "Peele manages to perfectly balance suspense, humour, and horror while making a hard-hitting political statement about liberal America; a remarkable and timely feat considering the state of the world in 2017.",
      "author": "Jack Shepherd"
    },
    {
      "text": "While it is too violent for my taste, it does have some clever comic touches and an interesting racial twist on the usual horror genre story. It is kind of like a dark comic cross between '12 Years a Slave' and 'The Man With Two Brains.'",
      "author": "Robert Roten"
    },
    {
      "text": "Get Out is a great movie for people who dislike or dismiss horror expecting \"gratuitous\" explicit violence and nudity, because of its humor, PG sex scenes, and the analogies drawn to contemporary lived experiences of race relations.",
      "author": "Ina Diane Archer"
    },
    {
      "text": "It's because of Kaluuya that Peele's commentary remains intelligible throughout, even as the movie leaps over logical chasms and loads up on hammy supporting performances.",
      "author": "J. Olson"
    },
    {
      "text": "First-time director Peele has not only written a brilliant script, but has mastered film grammar, timing, and the blocking of scenes (Splice Today)",
      "author": "Stephen Silver"
    },
    {
      "text": "... first really interesting film of the new year is an unnerving social satire that uses horror tropes to peel away the hypocrisy of white liberal America .. Peele is obviously a director to watch.",
      "author": "Glenn Lovell"
    },
    {
      "text": "I laughed, and then I was scared, and then I started laughing again, and then I wanted to run out of the theater but then I stayed, and then I started laughing again, and then I was really, really scared. That's about it. Oh...this movie is awesome.",
      "author": "Bob Grimm"
    },
    {
      "text": "It's a great movie -- one of the best horror films in recent memory, in fact.",
      "author": "Rebecca Pahle"
    },
    {
      "text": "... an allegory of African-American strengths being siphoned for the benefit of white people, disguised as a run-of-the-kill horror flick.",
      "author": "Steve Persall"
    },
    {
      "text": "Get Out is an incredibly assured debut that totally gets horror. And comedy. And politics. And it's going to be one of the standout hits of the year.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "There's something almost playful about the way Peele weaves his tale.",
      "author": "Hayden Mears"
    },
    {
      "text": "This is Guess Who's Coming to Dinner meets Six Flags' Kingda Ka roller coaster after surviving a car wreck while winning the lottery.",
      "author": "Molly Laich"
    },
    {
      "text": "Like The Stepford Wives before it, Get Out uses a fancifully exaggerated scenario to illustrate real social tensions.",
      "author": "Margot Harrison"
    },
    {
      "text": "The film wears its influences lightly (The Stepford Wives; the revelation's echo of Being John Malkovich, which starred Keener) even as it camera-tracks the dark side of a supposedly \"post-racial\" USA.",
      "author": "Brian Gibson"
    },
    {
      "text": "Precisely because it addresses fears that have been absent from horror movies, Get Out is a future classic.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "The sense of dread is palpable throughout, but Peele leavens the fear with a great device in the comedic character of Rod, played by Lil Rey Howery.",
      "author": "Michael Smith"
    },
    {
      "text": "It plays and it creates an effective admixture of comedy and intrigue, and it takes dead aim at the zeitgeist in a way that's sure to garner attention ...",
      "author": "Nick Pinkerton"
    },
    {
      "text": "Believe the hype, and go see it.",
      "author": "Brad Keefe"
    },
    {
      "text": "There's either a bit of genius at play or this is one heck of a lucky first strike",
      "author": "Frank Wilkins"
    },
    {
      "text": "Jordan Peele makes his directing debut with a horror movie that sticks closely to genre convention even as its ribbing of white liberals hardens into a social point.",
      "author": "J. R. Jones"
    },
    {
      "text": "The big joke --and it's one that draws blood-- is that we spend half the movie wondering if something sinister's going on or if these folks just don't have any idea how to behave around brown people.",
      "author": "Sean Burns"
    },
    {
      "text": "What emerges, with nods to the absurdist anxiety of Rosemary's Baby and the existential terror of Michael Haneke is a tightly wound, viciously funny comment on the quotidian horror of life in black America.",
      "author": "Walker MacMurdo"
    },
    {
      "text": "a bristling thriller that ably mixes its various horror riffs-which include stalk-and-slash tensions, an insidious cult, and medical horror-with both comedy and social satire",
      "author": "James Kendrick"
    },
    {
      "text": "It's funny, it's tense, it features two great performances from Kaluuya and Williams and Peele expertly creates a web of odd tension where you actually don't know what is happening for the majority of the run time.",
      "author": "Brian Formo"
    },
    {
      "text": "Filled with righteous anger, sly wit and genuine creepiness, Get Out is a savvy, stylish and enormously entertaining film.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Get Out knows how to mine a real social voice from simple scares, and turn a reliable thrill ride into the first truly great film of the Trump era.",
      "author": "Rob Vaux"
    },
    {
      "text": "You may be reminded of other creepy movies like Rosemary's Baby and The Stepford Wives, but this is neither a retread nor a spoof. It's a rare, seamless blend of horror and comedy: a stinging satire cloaked as a thriller.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Following Oscar's pomp and self-importance, viewing Jordan Peele's fiercely entertaining thriller offers the perfect awards hangover cure. Audiences leave the theater shaken and stirred.",
      "author": "Thelma Adams"
    },
    {
      "text": "Get Out is an attenuated comedy sketch in which serious concerns are debased.",
      "author": "Armond White"
    },
    {
      "text": "Mark my words; it'll be a modern classic.",
      "author": "Anthony Ray Bench"
    },
    {
      "text": "Jordan Peele's Get Out is essentially Dear White People for sadists; it's a therapeutic horror comedy with a shotgun barrel aimed at the racial tension that's echoing through America.",
      "author": "Michael Fairbanks"
    },
    {
      "text": "Wait for those moments, scattered throughout the action, when the winces quicken into jolts and jumps; and consider how much is packed into Peele's terrific title.",
      "author": "Anthony Lane"
    },
    {
      "text": "Retro horror and racial tension mix to surprisingly entertaining effect in Get Out, the feature directing debut of US TV comedy multi-hyphenate Jordan Peele.",
      "author": "John Hazelton"
    },
    {
      "text": "In the tradition of the best social thrillers, Get Out takes a topic that is often approached cerebrally -- casual racism -- and turns it into something you feel in your tummy. And it does it with a wicked sense of humor.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "All this diabolic lunacy, of course, Peele depicts with B-movie relish, delighting gamely in the comic-sinister thrill.",
      "author": "Calum Marsh"
    },
    {
      "text": "It provides a few shocks and a few laughs, as it leave us something sinister to think about in our race relations while having a laugh at the expense of the liberal elites.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It may fizzle in the end, but for 90 solid minutes it scares the hell out of you, taking all the color out of black and white to remind that inside we all bleed red.",
      "author": "Al Alexander"
    },
    {
      "text": "...moves from early scenes of social discomfort to a finale full of Grand Guignol violence and gore.",
      "author": "Josh Larsen"
    },
    {
      "text": "Jordan Peele's Get Out is fantastic, a horror film that is as relevant as it is scary.",
      "author": "Alan Cerny"
    },
    {
      "text": "Get Out will have you laughing one moment, gasping the next, and cheering the whole way through.",
      "author": "Steve"
    },
    {
      "text": "Get Out smartly balances its tones to provide viewers with an entertaining and clever satire that is equal parts funny and terrifying.",
      "author": "Chris Agar"
    },
    {
      "text": "[Writer-director Jordan Peele] has wrapped trenchant commentary on contemporary race relations inside of ... a horror movie.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "A refined suspense thriller, consummate film critique, savage satire, inspired horror and fierce, profane comedy. It's archetypal, prodigious American moviemaking, smart and sly... a succession of shocking, often thrilling satisfactions.",
      "author": "Ray Pride"
    },
    {
      "text": "One of the boldest, most audacious major studio movies to come along in quite some time. From the opening titles to the end credits, Get Out holds you in its grasp.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Obama may be out of office, a fool may be in the White House, but leave it to Peele to make a film that plays with the notion that the masters of Get Out's white house might just be crazier than Donald Trump.",
      "author": "Elias Savada"
    },
    {
      "text": "A terrific comedy, but a somewhat muddled thriller.",
      "author": "Rob Hunter"
    },
    {
      "text": "Want to put a little gore on your funny bone at the movies this weekend? Then just try to get in to \"Get Out,\" a very clever horror film with enough social satire to start a great debate or three.",
      "author": "John Urbancich"
    },
    {
      "text": "Cultural appropriation shifts from 'problematic' to 'horrific' in writer-director Jordan Peele's sharp take on the scary world of stuff white people like.",
      "author": "Matthew Lickona"
    },
    {
      "text": "... tweaks perceptions and stereotypes, as well as mainstream expectations, in ways that are both funny and unsettling.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "A horror film for the Age of Trump. Trenchant and subversively funny if not very original.",
      "author": "James Verniere"
    },
    {
      "text": "Get Out has its surface scares, but it's what's lingering beneath that's most frightening: the sense that no matter where you turn, no matter how many people claim they're on your side ... they're out to get you.",
      "author": "Will Leitch"
    },
    {
      "text": "While it doesn't offer any answers, it both thrills and makes you think.",
      "author": "Robert Levin"
    },
    {
      "text": "Get Out is a bonkers little film that mixes humor, horror, and satire to comment vividly on racism in America. The genius of Jordan Peele's directorial debut, however, is that you don't need to catch all of the subtext to enjoy it.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "In most slasher flicks, a guy like Chris would die first. Peele's joke is that the cliché has it backwards. Young black men know their lives are in peril from the first frame.",
      "author": "Amy Nicholson"
    },
    {
      "text": "An atmospheric, restrained, effective work of horror with a clear point of view, a darkly hilarious movie that never trips over itself in search of a cheap laugh or scare.",
      "author": "David Sims"
    },
    {
      "text": "For every assured, effective camera placement - Peele takes inspiration from Polanski, Roeg and Kubrick - he also provides a troubling and compassionate look at racism and blackness.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Peele's film, which mixes horror, comedy, and social commentary with astonishing confidence and skill, takes hold of its provocative ideas and sees them all the way through. At this socio-political moment, it shakes the theater like an earthquake.",
      "author": "Jason Bailey"
    },
    {
      "text": "Daring, funny and thumpingly suspenseful.",
      "author": "Tom Gliatto"
    },
    {
      "text": "Peele must have studied the slow-burn horror film, and the way a director like Roman Polanski (or M. Night Shyamalan, for that matter) can unnerve you with the simplest little touches.",
      "author": "Robert Horton"
    },
    {
      "text": "Peele's script is smart, original, and timely, addressing the current reality of racism in America in a clever manner and skewering horror movie tropes along the way.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Do we need a horror movie to explain America to ourselves right now? Get Out's answer is a provocative yes.",
      "author": "Taylor Antrim"
    },
    {
      "text": "Get Out isn't a sensitive movie, but it is compassionate, a chiller spun from human experience. Most of all, it's great.",
      "author": "Andy Crump"
    },
    {
      "text": "Get out and see it already.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "The result is something clearly borrowed, incredibly fresh and nearly perfect in light of the current political climate.",
      "author": "Tom Meek"
    },
    {
      "text": "Like so much of Key & Peele's comedy, Get Out is refreshing in its naked, frank aggression about confronting racial issues, with comedy, drama, and sharp, unsparing insight.",
      "author": "Tasha Robinson"
    },
    {
      "text": "If America's pervasive racial division is ever to be traversed, it will likely be up to humane provocateurs such as Peele to lead the way.",
      "author": "Piers Marchant"
    },
    {
      "text": "...plays like an instant classic.",
      "author": "Kurt Loder"
    },
    {
      "text": "Get Out is the satirical horror movie we've been waiting for, a mash-up of Guess Who's Coming to Dinner? and The Stepford Wives that's more fun than either and more illuminating, too.",
      "author": "David Edelstein"
    },
    {
      "text": "This is ultimately a movie about the very bad things that can happen when we don't address our unease, when we just try to brush it off, whether that's to fit in or to preserve our self-image.",
      "author": "David Berry"
    },
    {
      "text": "Writer-director Jordan Peele has fashioned a smart, scathing commentary ... as a base for his allegory on the horror of race in America.",
      "author": "Adam Graham"
    },
    {
      "text": "It's to Peele's credit that he's able to set up certain expectations and then pull the rug out from under us.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Peele delivers without Key.",
      "author": "Willie Waffle"
    },
    {
      "text": "I've been reviewing horror movies professionally since 1988...and I can honestly say that [Get Out] is in my top 10 of all time.",
      "author": "Steve Newton"
    },
    {
      "text": "One of those rare mainstream films that defies definition. However you choose to label it, Get Out is a wholly engaging, entertaining and particularly relevant film.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "The scariest thing about the movie is the reminder that it has taken far too long to shine the correct light - literally and figuratively - on stories that should be told.",
      "author": "Nell Minow"
    },
    {
      "text": "The praiseworthy quality of Get Out is that it delivers the goods without copycatting every cookie-cutter horror film being released today.",
      "author": "James Berardinelli"
    },
    {
      "text": "When the blood starts flowing, along with audience cheering, the battle for hearts and minds is well and truly on.",
      "author": "Peter Howell"
    },
    {
      "text": "A weird and delicious surprise, Get Out subverts the tired clichés and freshens up the horror game in all kinds of surprising -- and surprisingly stinging -- ways.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Only grows more darkly relevant as the main story gets going, masterfully unfurling all of the real-life anxieties of Existing While Black while simultaneously mining that situation for all its twisted absurdity.",
      "author": "Aisha Harris"
    },
    {
      "text": "Part of what makes \"Get Out\" both exciting and genuinely unsettling is how real life keeps asserting itself, scene after scene.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Truly, madly, mercilessly entertaining, even when it makes you want to jump out of your skin.",
      "author": "Chris Klimek"
    },
    {
      "text": "Get Out, a thrilling first feature by Jordan Peele (of the sketch comedy show Key & Peele) is both a racial satire and a horror film, and while it doesn't quite succeed as either one, it ends up being more than the sum of its parts.",
      "author": "Noah Gittell"
    },
    {
      "text": "Writer/director Jordan Peele's Get Out is a daring and auspicious directorial debut.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Get Out is more a very smart satire with scares, than a full-on horror movie. But if it makes you think while it's making you jump there's much to be said for that.",
      "author": "Bob Mondello"
    },
    {
      "text": "As you waver in its loathsome, slightly surreal but relatable atmosphere, you'll sit adjacent to affectingly casual racism, your composure breaking down, your responses discombobulated.",
      "author": "Leonardo Faierman"
    },
    {
      "text": "... layered with racial subtext regarding slavery, master-race ideology and liberal guilt that weaves throughout the movie in unexpected callbacks.",
      "author": "Jon Niccum"
    },
    {
      "text": "Peele flips horror conventions on their head, and in doing so, flips our cultural perceptions.",
      "author": "Katie Walsh"
    },
    {
      "text": "Get Out is flat-out brilliant. Peele shows a rich knowledge of horror, and a sharp edge of humor that makes for a film that's frightening, fun, and impossible to forget.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Hits the bull's-eye dead on... Funny, creepy and thought-provoking at the same time, it's a picture that transcends mere genre pigeonholing to become an outstanding blend of different elements.",
      "author": "Frank Swietek"
    },
    {
      "text": "The first must-see film of the year.",
      "author": "Clay Cane"
    },
    {
      "text": "Peele leavens the message with occasional (and much-needed) explosions of unexpected comedy, but have no illusions: he's dead serious about the story he's telling. The result is a remarkable genre work that stands with the best of them.",
      "author": "Norman Wilner"
    },
    {
      "text": "Peele has made a movie about the black experience in white America that does not appease or accommodate, that enjoys itself while still speaking to a troubling and pervasive truth.",
      "author": "Richard Lawson"
    },
    {
      "text": "[Jordan] Peele's first feature is strong",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Get Out forces white viewers (particularly liberals) to confront their own racist views while eviscerating those who continue to proclaim \"All Lives Matter\" as Black and brown bodies pile up at their feet.",
      "author": "Aramide Tinubu"
    },
    {
      "text": "A memorable horror flick if ever there was one, Get Out starts with a great title and a promising idea -- a black man's fear as he walks at night down a street in an affluent white suburb. Then it delivers on that promise with explosive brilliance.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Modest in scale (almost everything happens in one location), Get Out nevertheless signals Peele as a talent worth watching, joining the ranks of filmmakers who cut their teeth in the horror genre.",
      "author": "Brian Lowry"
    },
    {
      "text": "Get Out finds that sweet spot of laughs, chills, and social commentary. It's so flat-out entertaining, you might not even notice how scathing it really is.",
      "author": "Max Weiss"
    },
    {
      "text": "The screenplay is a masterpiece of subversion, laced with race-based fears and notions of stereotype that are played for laughs, but hit home.",
      "author": "Liz Braun"
    },
    {
      "text": "Sometimes the best social commentary movies are genre films. More often than not, those are the cleverest at it. Get Out fills that task to a T.",
      "author": "Bob Strauss"
    },
    {
      "text": "Peele has written a script that is extremely well-paced and executed as it cleverly plays with allusions to slavery and racial stereotypes, as well as audience expectations.",
      "author": "Brian Truitt"
    },
    {
      "text": "The shocks and the laughs are thoroughly entertaining, but it's the truth of \"Get Out\" that's so real.",
      "author": "Ann Hornaday"
    },
    {
      "text": "There's so much here that Peele gets right, and he delights in turning familiar thriller tropes on their head: In this racially charged context, he knows exactly how to exploit the sight of an approaching police car for maximum stomach drop.",
      "author": "Justin Chang"
    },
    {
      "text": "\"Get Out\" works much better in individual moments than it does as a whole. But those individual moments? They're a lot of fun.",
      "author": "Chris Hewitt"
    },
    {
      "text": "It's a successful endeavor, but not overwhelmingly so, with iffy taste and timing of humor disturbing the hypnotic spell it's itching to cast.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Throughout, Jordan Peele incisively probes the connection between the racism of the \"liberal elite\" and good old-fashioned white supremacy.",
      "author": "Keith Watson"
    },
    {
      "text": "Jordan Peele's first foray behind the camera as a director is funny, thrilling and often frightening.",
      "author": "Jack Giroux"
    },
    {
      "text": "Writer/director Jordan Peele puts a racial spin with a sly twist on his sharp horror film rooted in such classics as \"White Zombie,\" \"The Stepford Wives\" and \"Rosemary's Baby.\"",
      "author": "Laura Clifford"
    },
    {
      "text": "[Peele] has created a work that addresses the myriad levels of racism, pays homage to some great horror films, carves out its own creative path, has a distinctive visual style - and is flat-out funny as well.",
      "author": "Richard Roeper"
    },
    {
      "text": "Peele clearly knows his genre formulas, but moreover has a keen sense of how to make them speak to the present.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Get Out is an absolutely brilliant and original horror film. Imagine a devilishly twisted update of Guess Who's Coming to Dinner. Get Out is scary, laugh out loud funny, and an inspired satire of interracial relationships.",
      "author": "Julian Roman"
    },
    {
      "text": "Peele draws a draws a subtle, scathing line that connects American imperialism all the way back to its colonial roots, when white men essentially took whatever--and whomever--they wanted.",
      "author": "Neil Pond"
    },
    {
      "text": "This one really should be seen with a crowd.",
      "author": "Michael Phillips"
    },
    {
      "text": "It may be somewhat rough and unrefined and even ill-considered in some of its particulars. Yet it may stand as a kind of pop culture document of this historical moment, a moment that's not nearly as funny as this movie.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Whitford and Keener in particular are having a ball, letting something a little sinister bubble up in their outwardly friendly behavior. But it's Kaluuya who stands out most.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "It is not only the best horror film since \"Under the Skin,\" but a subversive and often hilarious commentary on race as well.",
      "author": "Peter Keough"
    },
    {
      "text": "It's clever stuff. Still, while I admired the conceptual daring of the movie, I confess I was never actually scared.",
      "author": "Gary Thompson"
    },
    {
      "text": "It's rare that a movie (especially from a big studio) wrings so much suspense over the degree of obliviousness some white people are displaying in their racism.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Like many of the best horror movies, it provides a grotesque exaggeration to highlight very real social problems.",
      "author": "Josh Bell"
    },
    {
      "text": "Get Out performs a service that only high-end horror and comedy films (plus some science-fiction) can: present a disturbingly honest, critical analysis of the status quo safely disguised as an entertaining genre work.",
      "author": "Dann Gire"
    },
    {
      "text": "Jordan Peele makes a tremendous directorial debut with Get Out, a socially-charged thriller that is so much more than \"necessary.\"",
      "author": "Matt Donato"
    },
    {
      "text": "All told, this is a sharp, funny, brave movie that strikes the perfect balance between humor and horror. It's the year's first must-see.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Get Out, produced by Jason Blum's low-budget horror studio Blumhouse Productions, is serious, even sober in its horror. But its archness has moments of creepy levity.",
      "author": "Jake Coyle"
    },
    {
      "text": "Get Out is best enjoyed by getting to watch the tale unfold without knowing where the plot is going.",
      "author": "Rick Bentley"
    },
    {
      "text": "I love this movie. Sure, I had a great time watching it, Jordan Peele's mash up of comic horror and social satire.",
      "author": "Joanna Langfield"
    },
    {
      "text": "The script is wonderful, briskly paced, and manages to be hilarious and scary at the same time.",
      "author": "Teresa Jusino"
    },
    {
      "text": "It's a horror movie in which virtually every element works, starting with Kaluuya's subtle performance.",
      "author": "Keith Phipps"
    },
    {
      "text": "The deliciously sinister nature of the race dynamics will make you cringe, right up until it gives you the chills.",
      "author": "Karen D'Souza"
    },
    {
      "text": "Ultimately Get Out can't help but ask the question: How would all these white people feel if they could walk in a black person's shoes for a day? And that's something worth considering.",
      "author": "Michael Rougeau"
    },
    {
      "text": "If you're not in the habit of frequenting horror films, this one may be the welcome exception. Get in on Get Out.",
      "author": "Michael Heaton"
    },
    {
      "text": "\"Get Out\" will scare you, make you laugh and perhaps make you uncomfortable. It's supposed to.",
      "author": "Moira MacDonald"
    },
    {
      "text": "With a playful sense of tone, amazing performances, and a sharp bite, Get Out resonates with you long after you've left the theater.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "Jordan Peele has made something scathing, hilarious, and -- as unlikely as this may sound -- totally fresh. I am pleased -- who am I kidding? I'm f----g thrilled -- to announce that Get Out is a legitimately great movie.",
      "author": "Kristen Yoonsoo Kim"
    },
    {
      "text": "Get Out manages to walk the tight rope between being laugh-out-loud funny and genuinely scary at times.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "It's rare for a studio horror film to feel this fresh and daring and it's arrived at a frighteningly topical moment for a country where racism is scarier than ever.",
      "author": "Benjamin Lee"
    },
    {
      "text": "Get Out is an exciting debut from Peele, who deftly combines enticing racial satire with genre thrills to impressive results.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Peele has much to say about society and race with an inventive approach that blends chills with a dash of humor.",
      "author": "Roger Tennis"
    },
    {
      "text": "This is a major filmmaking debut that's fully worthy of all the conversation it will start, both around its commentary on race in America and how truly good it is.",
      "author": "Kimber Myers"
    },
    {
      "text": "In the same way that The Stepford Wives exploited liberated feminists' fear of male chauvinists' fear of liberated feminists, Get Out finds its tension in black people's fear of white people's fear of black people.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Prudent, muscular filmmaking, a terrifically creepy thriller with a clear voice and plenty to say.",
      "author": "Dustin Putman"
    },
    {
      "text": "\"Get Out\" is scary enough, but it comes with some bonus nutritional value.",
      "author": "Kyle Smith"
    },
    {
      "text": "What's most interesting about Get Out is how it taps into the same idea to fuel both its comedy and horror: the recognition of social truths.",
      "author": "Peter Canavese"
    },
    {
      "text": "A jolt-a-minute horrorshow laced with racial tension and stinging satirical wit. How is one movie all that? See Get Out, from debuting director Jordan Peele (one half of the comic team of Key and Peele), and get woke.",
      "author": "Peter Travers"
    },
    {
      "text": "This first-class psychological thriller blending a comedy of manners into full-scale mayhem will appeal to both intellectuals and rank-and-file moviegoers.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Get Out is searing satire, with scary/comic riffs on slavery and assimilation, but it's also a smashing crowd-pleaser of a horror film ...",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "Only a master satirist like Jordan Peele could take audiences on an insane thrill ride and make us all think about racial stereotyping along the way.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Jordan Peele makes an auspicious feature directing debut with this outlandish horror thriller/social satire that transforms topical racial tensions into bracing entertainment.",
      "author": "Kevin Lally"
    },
    {
      "text": "It wears its homages on its sleeve, yet it's a true original that itself will be homaged in generations to come...",
      "author": "Scott Mendelson"
    },
    {
      "text": "It's not just a frightening concept, and it's not just terrifically suspenseful. It turns society on its ear in a way that only the best movies can.",
      "author": "William Bibbiani"
    },
    {
      "text": "The craziest thing about Jordan Peele's \"Get Out\" is this: Sometimes it's even better as a horror movie than a social critique.",
      "author": "Matt Prigge"
    },
    {
      "text": "Peele takes the concept behind Guess Who's Coming to Dinner? to its furthest, most genre extreme.",
      "author": "Edward Douglas"
    },
    {
      "text": "Peele's perfectly tuned cast and deft camera work unleash his uproarious humor along with his political fury; with his first film, he's already an American Buñuel.",
      "author": "Richard Brody"
    },
    {
      "text": "This is an excellent horror that is gripping, scary, witty and timely, and it's got something to say. Even if you don't think all of it comes off, you will be talking about it.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "A horror film with the power to put a rascally grin on the face of that great genre subverter John Carpenter ( They Live ),  Get Out has more fun playing with half-buried racial tensions than with scaring us to death.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Get Out takes racism's more traditional forms - slavery, incarceration, exploitation, blackface - for a new, thoroughly modern appropriative spin.",
      "author": "Anton Bitel"
    },
    {
      "text": "Jordan Peele takes on racism in Get Out and infuses his horrific tale with his signature satirical wit for an experience that's fearlessly bold, hilarious, and an important reminder that we have so much work left to do when it comes to issues of equality.",
      "author": "Heather Wixson"
    },
    {
      "text": "Peele is sharply perceptive about how racism is so often diminished even by people who allegedly know better, and it's a conceit that serves Get Out incredibly well.",
      "author": "Dominick Suzanne-Mayer"
    },
    {
      "text": "For his sake, I just hope Peele's real in-laws have a good sense of humor.",
      "author": "Matt Singer"
    },
    {
      "text": "Biting but good-natured, incisive but not preachy, this is the kind of self-reflective comedy that can bring America together.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Get Out may be deeply flawed, but it's about time Hollywood put some muscle behind a movie that was less interested in flattering audiences than it was in scaring them straight.",
      "author": "David Ehrlich"
    },
    {
      "text": "A complex, accomplished genre hybrid that should alter Jordan Peele's business card.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Peele doesn't just subvert a genre often dinged for making people of color expendable cleaver-fodder. He also flips pearl-clutching, white-flight anxiety about predatory black men on its ear, turning a gated community into the real danger zone.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Get Out is about as effective as a mainstream comedy can be without veering into truly revolutionary territory.",
      "author": "John Fink"
    },
    {
      "text": "Blending race-savvy satire with horror to especially potent effect, this bombshell social critique from first-time director Jordan Peele proves positively fearless - which is not at all the same thing as scareless.",
      "author": "Peter Debruge"
    },
    {
      "text": "The third act is just insane. Every little strange thing any character might have said pays off.",
      "author": "Fred Topel"
    },
    {
      "text": "I won't be surprised if Get Out helps to spell out a few important lessons for those who deign to give it a watch. The best part: Any who do will have a hell of a fun and frightful time learning.",
      "author": "Michael Arbeiter"
    },
    {
      "text": "With influences ranging from Dario Argento to THE STEPFORD WIVES, Jordan Peele's directorial debut is smart, stylish and scary.",
      "author": "Chris Bumbray"
    },
    {
      "text": "'Get Out' isn't meant to be reassuring. It isn't meant to be conciliatory. It's a bucket of ice water, and it will give you chills.",
      "author": "Matt Goldberg"
    },
    {
      "text": "When microaggressions turn macro... A big-idea film wrapped in a darkly comedic thriller.",
      "author": "Jason Gorber"
    }
  ],
  "release_year": 2017,
  "duration": 104,
  "genres": [
    "Horror",
    "Mystery & Thriller",
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Now that Chris and his girlfriend, Rose, have reached the meet-the-parents milestone of dating, she invites him for a weekend getaway with Missy and Dean. At first, Chris reads the family's overly accommodating behavior as nervous attempts to deal with their daughter's interracial relationship, but as the weekend progresses, a series of increasingly disturbing discoveries leads him to a truth that he never could have imagined.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/tFXcEccSQMf3lfhfXKSU9iRBpa3.jpg"
}