{
  "movie_name": "Good Will Hunting",
  "movie_id": "good_will_hunting",
  "total_reviews": 90,
  "reviews": [
    {
      "text": "...a predominantly engrossing drama that benefits from its compelling narrative and superb performances...",
      "author": "David Nusair"
    },
    {
      "text": "Adding moments of erudition and salty wit to a feelgood tale proves to be a winning formula.",
      "author": "Edward Porter"
    },
    {
      "text": "A terrifically warm, tender and entertaining story... In significant ways, the \"Rocky\" of the '90s.",
      "author": "Dan DiNicola"
    },
    {
      "text": "It’s got a lively screenplay and fine performances all around, and it consistently delivers emotional payoffs. (25th anniversary)",
      "author": "Stephen Silver"
    },
    {
      "text": "Good Will Hunting may follow a formulaic arc but Gus Vant Sant's direction and Robin Williams and Matt Damon's performances elevate the film.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Awash with emotion, but never descends in to the mawkish sentimentality that blights so many “kid with a problem” movies.",
      "author": "James Croot"
    },
    {
      "text": "Good Will Hunting is a grand coup from first-time writers Ben Affleck and Matt Damon. Their exploration of the life of a Genius trying to function as a normal person is quite amiable and full of great acting.",
      "author": "Wesley Lovell"
    },
    {
      "text": "The problem becomes more glaring when movies portray geniuses, characters who not only think constantly but think thoughts that are incomprehensible to the rest of us.",
      "author": "Bill Boisvert"
    },
    {
      "text": "It's writer-stars Matt Damon & Ben Affleck's childhood friendship-chemistry and the hilarious bickering between the real-life Affleck brothers that generates the magic in \"Good Will Hunting.\" Not to mention a magical performance by Robin Williams.",
      "author": "Mark Jackson"
    },
    {
      "text": "While Damon and Affleck clearly feel at home with each other in familiar surroundings during Good Will Hunting, their story relies on heart more than location since caring and friendship taking precedence.",
      "author": "Robin Holabird"
    },
    {
      "text": "Good Will Hunting still holds up as a great film.",
      "author": "Jim Rohner"
    },
    {
      "text": "What Matt Damon and Ben Affleck accomplish with such a profound, witty, inspirational and heartbreaking script is quite extraordinary. And then, Mr. Robin Williams takes it to another level. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "The acting is outstanding; Williams and Damon perfectly embody their roles, creating a believable, poignant, powerful partnership full of uplifting, feel-good triumphs.",
      "author": "Mike Massie"
    },
    {
      "text": "On the surface there doesn't seem to be too much going on, but dig a little deeper and you'll find remarkably telling insights into the mind games that go with being a genius.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The film offers Robin Williams the chance to show his dramatic acting skills.",
      "author": "Richard Propes"
    },
    {
      "text": "Good Will Hunting is lyrically directed, efficiently written, side-splittingly funny, quietly devastating.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "The movie... [is] surprisingly moving, though resolutely unsentimental, rites-of-passage yarn.",
      "author": "David Baron"
    },
    {
      "text": "It's a deceptively good performance by Williams: the schmaltzy raw materials of Maguire would seem to be a trap, but he plays it absolutely straight, in muted, dignified tones",
      "author": "PJ Nabarro"
    },
    {
      "text": "The headline story from this slice of honestly earned sentiment is Matt Damon, who delivers the year's No. 1 breakthrough performance directly atop his agreeable high-profile turn in John Grisham's The Rainmaker.",
      "author": "Mike Clark"
    },
    {
      "text": "It's a movie that captures (in a way that perhaps an older screenwriter could not convey) the limitless possibilities of youth, a movie in which a character can tell another, without cynicism, \"You could do anything you want. You are bound by nothing.\"",
      "author": "Jason Bailey"
    },
    {
      "text": "The best thing about Good Will Hunting is not in its well-crafted, psychological symmetries but in the just-plain messiness of its humanity. It's rowdy, it's funny, it's heartbreaking -- it rings of life.",
      "author": "Duane Byrge"
    },
    {
      "text": "A crowd-pleaser, with bags of charm to spare.",
      "author": "Quentin Curtis"
    },
    {
      "text": "Most movies about troubled individuals are insulting in the way in which they suddenly wrap things up with insipid developments that cause tumultuous, positive transformations in the protagonist; this film avoids that pitfall.",
      "author": "Matt Brunson"
    },
    {
      "text": "Towering performance by Matt Damon as a troubled working class who needs to address his creative genius elevates this drama way above its therapeutic approach, resulting in a zeitgeist film that may touch chord with young viewers the way The Graduate did",
      "author": "Emanuel Levy"
    },
    {
      "text": "Despite its coarse exterior, Good Will Hunting proves to be a rather positive and motivational experience.",
      "author": "Gary Brown"
    },
    {
      "text": "The film works as a character-driven narrative because Mr. Van Sant and his co-screenwriters are not afraid to unlock the psychological mysteries of their five major characters with clear and concise dialogue.",
      "author": "Andrew Sarris"
    },
    {
      "text": "Can get overly sentimental at times, but Gus Van Sant's sensitive direction... and his excellent use of the city make it a hugely entertaining and effective film.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "It's acted and directed with care, and Damon is outstanding, his scenes with Driver being especially sparky.",
      "author": "Tom Charity"
    },
    {
      "text": "There are no villains in this story, only personal demons and no one is beyond being taken down a peg. Damon and Affleck obviously had a blast with this picture, as they apparently cast all of their friends.",
      "author": "Ron Wells"
    },
    {
      "text": "The film succeeds not because of an overall arc, but as a chain of smaller moments that glimmer in their minuscule perfection.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Gus Van Sant's Good Will Hunting makes you want to go out and hug somebody. Although its protagonist is a genius, the film induces a kind of blissful, brainless euphoria.",
      "author": "James Verniere"
    },
    {
      "text": "For the first time in his career, Van Sant is invisible as a filmmaker, simply getting out of the way of the story and his performers. The film is richer for it.",
      "author": "Moriarty"
    },
    {
      "text": "Affleck is on my long list for Academy notice this year.",
      "author": "Robin Clifford"
    },
    {
      "text": "... beneath their arrogance and crass behavior, you'll find a lot of hurt and many defense mechanisms raised against a compassionless, manipulative society.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "Uno sale del cine y se da cuenta de por qu la pelcula recibi tanta atencin.",
      "author": "Alex Ramirez"
    },
    {
      "text": "A charming, entertaining and uplifting movie with the title that perfectly fits its quality.",
      "author": "Dragan Antulov"
    },
    {
      "text": "Not a work of art or great power, but it has some moving moments.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Though the movie tells a straightforward story, there are enough offbeat touches along the way to balance out its more predictable aspects.",
      "author": "James Sanford"
    },
    {
      "text": "A witty and poignant story that showcases in equal parts natural born genius, and the gritty, South Boston lifestyle.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "Reality of story combines with reality of performance to give us some of the most heartfelt emotions currently on the big screen.",
      "author": "John R. McEwen"
    },
    {
      "text": "A convincing script and bold performances (especially Driver's) save this from the formulaic feel-good movie it might have been, and Will's dilemma of which life to choose is well worth sharing.",
      "author": "Film4 Staff"
    },
    {
      "text": "Good Will Hunting is another auspicious sign that the best of Young Hollywood is not only bringing back respect for the craft of acting, but for the cogent telling of tales as well.",
      "author": "Margaret A. McGurk"
    },
    {
      "text": "realmente impressionante que dois jovens como Matt Damon e Ben Affleck tenham sido capazes de escrever um roteiro to complexo quanto o de 'Gnio Indomvel'.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Good Will Hunting is both smart and shrewd -- it wraps that same comforting message in a thoroughly entertaining package.",
      "author": "Rick Groen"
    },
    {
      "text": "Three soul friends help a troubled young man to find his place in the world.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Touching, without being sentimental, and feelgood without appearing contrived, this is one shrink-wrapped drama that's worth unpacking.",
      "author": "Nev Pierce"
    },
    {
      "text": "The joy of watching the characters come out of their protective shells is worth the bumps along the way.",
      "author": "James Kendrick"
    },
    {
      "text": "While the charismatic performances of Damon and Affleck make \"Good Will Hunting\" a difficult entertainment to resist, doing just that is not as hard as the film would like to think.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Reaffirms the arrival of the star, Matt Damon (who also co-wrote the script), as the hottest young star in Hollywood.",
      "author": "Robert Roten"
    },
    {
      "text": "Good Will Hunting is a confident film with great performances and an authentic look, sound and feel.",
      "author": "Dan Jardine"
    },
    {
      "text": "Good Will Hunting narrowly avoids many sentimental pitfalls thanks to what doesn't happen...",
      "author": "Matthew Kohut"
    },
    {
      "text": "Executed with such maximum grace, style and heartfelt emotional realism that it's almost enough to make the concept of an 'uplifting' movie not seem like such a big fat cheat any more.",
      "author": "Gemma Files"
    },
    {
      "text": "The Damon-Affleck script is jammed with good ideas, strong dialogue and vigorous characters...",
      "author": "Bruce Kirkland"
    },
    {
      "text": "Mature teens will appreciate this story, written by its appealing two stars, of a brilliant young man with a troubled past.",
      "author": "Nell Minow"
    },
    {
      "text": "Part character study, part redemptive drama, and all cheesy heart, it's Boston-baked melodrama, a little too gooey at times, but still pretty delicious.",
      "author": "Marc Savlov"
    },
    {
      "text": "Cynics may dismiss the film as an overly effusive festival of male-bonding, but for the rest of us, this is just the catharsis we need.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Damon, in a performance sure to establish him solidly as a major star, shows every sensitivity from the angry young man, to the hurt, vulnerable product of his past.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "Almost any viewer will enjoy Good Will Hunting moment by moment, but many will wake the next morning wondering why, with all that talent on hand, it amounts to so little in the end.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "Van Sant makes Good Will Hunting a lot livelier than it might have been.",
      "author": "Joe Baltake"
    },
    {
      "text": "...a worthwhile sample of entertainment.",
      "author": "James Berardinelli"
    },
    {
      "text": "There's nothing original in this picture, yet it's intensely likable just the same.",
      "author": "E! Staff"
    },
    {
      "text": "All told, the film has plenty of enjoyable moments, but it's just not the deep experience the filmmakers want you to believe it is.",
      "author": "Christopher Null"
    },
    {
      "text": "This is the sort of honest and moving story that Hollywood doesn't put out much anymore.",
      "author": "Widgett Walls"
    },
    {
      "text": "In the capable hands of Williams and Damon, the scenes work wonderfully. Sure they're manipulative, but when manipulative scenes are done right, you don't mind it at all. They're certainly done right here.",
      "author": "Madeleine Williams"
    },
    {
      "text": "Good Will Hunting represents the firmest step into the mainstream yet for director Gus van Sant.",
      "author": "Jeff Millar"
    },
    {
      "text": "Even rarer than a breath of fresh air is a breath of fresh Hollywood film. Brainy and heartfelt and right on target, Good Will Hunting is such a film.",
      "author": "Jay Carr"
    },
    {
      "text": "... accomplishes the rarely obtained goal of creating a wide variety of intricate characters, all worth caring about.",
      "author": "Steve Rhodes"
    },
    {
      "text": "...a pretty remarkable film...",
      "author": "Ted Prigge"
    },
    {
      "text": "This is a film with a serious credibility problem and one which stagnates in the middle act.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "It is the touchy-feely enterprise its plot synopsis suggests, but to simply dismiss it as that would be to discount the true emotional chords Affleck and Damon's intelligent script touches.",
      "author": "Michael Dequina"
    },
    {
      "text": "This performance by Matt Damon is brilliant, and even when Will is as unlikeable as he could possibly be, we stick with him, because we care.",
      "author": "Ian Mantgani"
    },
    {
      "text": "Damon and Affleck show a wisdom beyond their years with some of the dialogue, which is alternately poignant and humorous.",
      "author": "Jeff Vice"
    },
    {
      "text": "... an engrossing, emotional roller coaster with peaks and valleys of perceptive wit, unsettling anger, coarse humor, and touching affection.",
      "author": "Jack Garner"
    },
    {
      "text": "Despite its schematic layout and predictable outcome, the ensemble acting is of such a high level -- particularly that of Robin Williams, Matt Damon and Stellan Skarsgard -- that the impact on his audience is spellbinding.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Good Will Hunting is a most accomplished writing debut for two young actors with a solid future as Hollywood hyphenates.",
      "author": "Kevin Lally"
    },
    {
      "text": "The outcome of the movie is fairly predictable; so is the whole story, really. It's the individual moments, not the payoff, that make it so effective.",
      "author": "Roger Ebert"
    },
    {
      "text": "Will's relationships with his best friend, Chuckie (Affleck), and new girlfriend, Skylar (Minnie Driver), resonate with a depth that unfortunately few other movies approach.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Good Will Hunting may well be the Rocky story of the 90s.",
      "author": "Bob McCabe"
    },
    {
      "text": "A good movie allows its characters to learn and grow. It doesn't just happen; it takes a good script, good acting, and good direction. Good Will Hunting has all three.",
      "author": "Marty Mapes"
    },
    {
      "text": "Both believably brilliant and convincingly rough around the edges, Damon avoids the too-common actor's trap of white-washing his character's dark side.",
      "author": "Scott Renshaw"
    },
    {
      "text": "An impressive scripting debut for actors Matt Damon and Ben Affleck...",
      "author": "Kim Williamson"
    },
    {
      "text": "Good Will Hunting is a very nice movie.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "... a very good film which is well worth your hard-earned time and money.",
      "author": "Matt Easterbrook"
    },
    {
      "text": "As Francis Ford Coppola does with The Rainmaker, Van Sant demonstrates how entertainingly a real pro can direct a strong if not especially groundbreaking story.",
      "author": "Janet Maslin"
    },
    {
      "text": "Intimate, heartfelt and wickedly funny, it's a movie whose impact lingers.",
      "author": "Peter Stack"
    },
    {
      "text": "Although celebrating the redemptive power of love, loyalty, sacrifice, and genius, it roots its feel-good message in performances, dialogue, and a locale as pungently authentic as the smell of corned beef and cabbage.",
      "author": "Peter Keough"
    },
    {
      "text": "This has not been a great year for language in movies, but people are going to be memorizing and reciting some of these lines for years to come.",
      "author": "John Hartl"
    },
    {
      "text": "At the core of Good Will Hunting is vivid, succulent dialogue that is emotionally naked, yet remarkably pedestrian at the same time.",
      "author": "Rob Blackwelder"
    },
    {
      "text": "Between this film and John Grisham's The Rainmaker, Damon surfaces as one swell addition to the front line of screen actors.",
      "author": "Susan Stark"
    },
    {
      "text": "Good Will Hunting is stuffed -- indeed, overstuffed -- with heart, soul, audacity, and blarney. You may not believe a minute of it, but you don't necessarily want to stop watching.",
      "author": "Owen Gleiberman"
    }
  ],
  "release_year": 1998,
  "duration": 126,
  "genres": [
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "Will Hunting (Matt Damon) has a genius-level IQ but chooses to work as a janitor at MIT. When he solves a difficult graduate-level math problem, his talents are discovered by Professor Gerald Lambeau (Stellan Skarsgard), who decides to help the misguided youth reach his potential. When Will is arrested for attacking a police officer, Professor Lambeau makes a deal to get leniency for him if he will get treatment from therapist Sean Maguire (Robin Williams).",
  "popularity": 9.4,
  "poster_url": "https://image.tmdb.org/t/p/original/z2FnLKpFi1HPO7BEJxdkv6hpJSU.jpg"
}