{
  "movie_name": "Guardians of the Galaxy",
  "movie_id": "guardians_of_the_galaxy_vol_3",
  "total_reviews": 408,
  "reviews": [
    {
      "text": "It’s really Rocket’s movie...and the combination of Cooper’s electric voice work and the flawless digital effects create a truly wonderful performance.",
      "author": "Ian Bunting"
    },
    {
      "text": "If the first two Guardians of the Galaxy films were pure lighthearted fun, the final story gives some punchiness and gravitas to balance that story out.",
      "author": "Christina Newland"
    },
    {
      "text": "Gunn really knows how to bring out the magic in this group of actors, and their charm and love of the material bring this movie home.",
      "author": "Calum Cooper"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is probably the final triumph of Marvel Studios...There is vision and ambition behind the third film in the trilogy, a personal sincerity that these superhero movies have lost.",
      "author": "Joshua Polanski"
    },
    {
      "text": "An effects-laden spectacle propped up by an out-of-this-world ensemble whose charm carries the film through expository back story, narrative set-up, dizzying fight scenes and enough platitudes about friends and family to fill a “Fast and Furious” movie.",
      "author": "Dana Barbuto"
    },
    {
      "text": "If this is the end, I couldn’t wish for a better one. It’s everything I want from a Marvel film, but it’s also a reminder that very few of them have the heart and vision of Gunn’s trilogy.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "“Guardians of the Galaxy Vol. 3” is about Rocket finally getting to heal those wounds and do what he could never do before when he was just becoming aware—stopping this madman. This part of the MCU has always been about healing childhood trauma.",
      "author": "Sarah Vincent"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 manages to be more than honest-to-god entertainment, one that has the liberated weirdness of material (like a stealth We3 adaptation) that was never expected to find a mass audiences.",
      "author": "Alison Willmore"
    },
    {
      "text": "This is the last time we see the beloved guardians. The film is laced with emotional and entertaining bits that make the swan song a thrilling ride at the movies this week.",
      "author": "Vinamra Mathur"
    },
    {
      "text": "For me, it was an unsatisfying conclusion as the wear and tear had begun to be exposed, caused mostly by a scrambled storyline and wayward storytelling.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Now that nearly every other cinematic release reads like a holding pattern until they finally get around to mutants, Guardians Vol. 3 is the first sign in a while that Marvel might actually have some genuine enjoyment left in the tank.",
      "author": "Jackson Weaver"
    },
    {
      "text": "GotG3 has no real tie-in to the larger MCU. There are a few references to Thanos, the Snap, and the Infinity Stones, but that's about it. This tracks with the trilogy as a whole, which has always stood outside the larger Marvel narratives.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a surprisingly risky blend of dark tones and sinister villainy with great visuals, tasty music, and the emotionality we expect.",
      "author": "Jeffrey Peterson"
    },
    {
      "text": "While the fun, laughter, and quips, set to jukebox favourites that made this ragtag MCU family a joy to hang with are all present and correct, there are some problems with the Guardians’ third outing",
      "author": "Mini Anthikad-Chhibber"
    },
    {
      "text": "The strongest material is perhaps the most unexpected: the backstory of Rocket Raccoon, which is involving and even touching in ways that the rest of the picture is not.",
      "author": "Matt Brunson"
    },
    {
      "text": "It’s hopeful and poignant, filled with moments of empathy and integrity. Equal time is given to spectacle, with lots of stunning action sequences and psychedelic space weirdness.",
      "author": "Lee Zumpe"
    },
    {
      "text": "While not as engaging or fresh as the first two films Guardians of the Galaxy Vol. 3 still had the usual James Gunn combination of dazzling CG environments, enjoyable action and great dialogue, so it was still a fun way to spend an evening.",
      "author": "David Hogan"
    },
    {
      "text": "A gut punch of a film that had me in tears as much as it had me smiling.",
      "author": "Cris Parker"
    },
    {
      "text": "Gunn weaves a story with Rocket that is as horrifying as it is heartwarming.",
      "author": "Rick Bentley"
    },
    {
      "text": "…all just feels like indulgence of foppish creatives who don’t have much in the way of new or relatable ideas….",
      "author": "Eddie Harrison"
    },
    {
      "text": "Rocket's origin story is great and the only highlight of the movie. Tonally it's all over the place and the runtime is about 25 minutes too long. After the brilliance of Guardians of the Galaxy Vol. 1 we're left wondering what happened to this series.",
      "author": "Lucas Moore"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is an emotionally powerful, tear-inducing \"farewell\" to James Gunn and his Guardians. Rocket's bittersweet storyline is the soul, heart, and engine running the best MCU film since Spider-Man: No Way Home.",
      "author": "Manuel São Bento"
    },
    {
      "text": "While the first two \"Guardians\" films might have been about Peter and the Guardians coming together, \"Guardians of the Galaxy Vol. 3\" is about the search for one's true identity and contribution to the greater good.",
      "author": "Matthew Creith"
    },
    {
      "text": "\"Guardians of the Galaxy Vol. 3\" shows [Marvel] still has fuel in the tank and is capable of making good movies. [The company] just needs to remember how to make character-driven stories that give its heroes something fun to accomplish.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is unique because Gunn not only bids farewell to our beloved rejects but helps them find self-acceptance.",
      "author": "Akos Peterbencze"
    },
    {
      "text": "While the script falters, the production design soars. The world of Guardians of the Galaxy Vol. 3 is vivid, bold, and exciting.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "Though Vol.3 falls prey to the formulaic trappings of the Marvel vision, it does so with Gunn’s signature personality intact.",
      "author": "Prabhjot Bains"
    },
    {
      "text": "The Guardians of the Galaxy are here to remind you that you’re still worthy of love, you’re not alone, and you can still be your own life’s “Kevin Bacon”.",
      "author": "Serena Seghedoni"
    },
    {
      "text": "Guardians Of The Galaxy Vol 3 is endearing, heartfelt, hilarious, but most of all everything you want from a finale I cried, I laughed, & I feel completely satisfied! Gunn has delivered the perfect finale & one of the best trilogies",
      "author": "Zach Pope"
    },
    {
      "text": "This farewell to part of the MCU always feels like a zippy, self-contained Guardians of the Galaxy movie, rather than a placeholder for more and more future franchise instalments.",
      "author": "Sarah Ward"
    },
    {
      "text": "Everything comes together for this one – a brilliant screenplay from Gunn and his team of writers and a cast that seem to bring their best in what maybe some of their final times playing the characters that many cinema fans have come to know and love.",
      "author": "David Griffiths"
    },
    {
      "text": "Emotionally manipulative, too much CGI, and not nearly as fun as the first Guardians of the Galaxy film.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "James Gunn undeniably sticks the landing with one of the MCU’s most heartfelt and thoughtfully executed films, allowing the story to ascend to indelible heights.",
      "author": "Gissane Sophia"
    },
    {
      "text": "One of the best movies in the MCU; capable of making you laugh out loud, bringing you to tears, thrilling you to the core, and proving that when Marvel Studios wants to, Marvel Studios can.",
      "author": "Víctor López G."
    },
    {
      "text": "An entertaining sequel that once again showcases Marvel's cosmic side with a fast-paced adventure set in a space populated by action, humor, and wacky heroes listening to a greatest hits soundtrack to save the galaxy. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "It’s Gunn’s heart that shines brightest, though. His characters squabble like family but function wholly out of love for each other, which is precisely the thing that cuts through all the seemingly Marvel-mandated rigamarole.",
      "author": "John Serba"
    },
    {
      "text": "Gunn refuses to give his characters the type of obvious resolutions fandom pines for. Instead, he’s crafted the bitter-sweet ending his characters deserve.",
      "author": "Victor Stiff"
    },
    {
      "text": "There's a whole bunch of nit-picky stuff that kept pulling me out of the movie, that I may well be the only one who cares about it, and the only one whose viewing experience was particularly hampered by these things.",
      "author": "Vera Wylde"
    },
    {
      "text": "The lack of streamlining (ie why are there so many narrative threads?) paves the way for an uninvolving midsection...",
      "author": "David Nusair"
    },
    {
      "text": "It really hit all the points. The action, emotion and story were all great. The backstory of Rocket was the highlight for me.",
      "author": "Justin Brown"
    },
    {
      "text": "I liked this better than the previous entry in the series. It was a heartfelt film but didn't really wrap up storylines the way the trailers implied.",
      "author": "Brandon Collins"
    },
    {
      "text": "This is filmmaking that paints by numbers and with Key Performance Indicators in mind.",
      "author": "Jennie Kermode"
    },
    {
      "text": "Vol. 3 is undoubtedly one of the most ambitious MCU films, in both scope and narrative reach.",
      "author": "Sarah Marrs"
    },
    {
      "text": "It’s been a while since we had something in this genre that really did this kind of narrative heavy lifting, rather than just playing in the sandbox that we know and love and are fine with just hanging out for a little while in.",
      "author": "Jason Shawhan"
    },
    {
      "text": "Its wild tonal swings and penchant for undercutting dramatic beats with poorly timed levity aside, Guardians of the Galaxy Vol. 3 is a mostly satisfying adventure and conclusion to arguably the MCU’s most unlikely trilogy.",
      "author": "Joshua Axelrod"
    },
    {
      "text": "Bradley Cooper’s voice work has always been sharp, but he gets more to do here than in the first two films. There’s a whole piece of steak for his lovable space warrior to chew on here.",
      "author": "Dan Buffa"
    },
    {
      "text": "Hooked on a feeling and that feeling is emotional damage.",
      "author": "Amanda the Jedi"
    },
    {
      "text": "Apart from everyone just yelling at one another, there is next-to-nothing to care about in the present or for the future of the characters in this thinly stretched, humor-starved attempt at closure.",
      "author": "Erik Childress"
    },
    {
      "text": "In the heart of one of the most carefully micro-managed, corporatised franchises in contemporary media, the Marvel Cinematic Universe, Gunn and company... have managed to make three consecutive films that feel earnestly personal.",
      "author": "Tim Brayton"
    },
    {
      "text": "Guardians of the Galaxy Vol 3 is a FANTASTIC send off to one of the MCU's best trilogies! The Rocket-centric story hits every target it aims for in your heart. The themes of friendship, family and sacrifice shine brightly even amidst the stunning visuals.",
      "author": "John Rocha"
    },
    {
      "text": "There's a lot of tough love on display due to the fallout of everyone being a raw nerve. They won’t all remember what was spoken, but those who must remember will. That goes for us too since this trilogy capper is as much a beginning as it is an ending.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Lacks the humor and the heart of the first two.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Remarkably, given the studio brand: this is absolutely Gunn's movie. It's cheerfully gross, frequently hideous to behold, nakedly emotional, indulgent to the point of bloat in its desire to tie off every narrative thread...and, happily, its own thing.",
      "author": "Matthew Lickona"
    },
    {
      "text": "An immensely satisfying send off to James Gunn's Guardians.",
      "author": "Suchin Mehrotra"
    },
    {
      "text": "The animals are cute, but the action is predictable and inconsequential as the Marvel Universe struggles to find a footing into the realm originality as it enters 30+ films.",
      "author": "J. Don Birnam"
    },
    {
      "text": "It’s not perfect, but for big, dumb MCU fun the Guardians still deliver.",
      "author": "James Mottram"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is going to have the same effect on today’s kids that Indiana Jones and the Temple of Doom had on kids in the 80s, and I mean that as the highest compliment.",
      "author": "Cory Woodroof"
    },
    {
      "text": "This third volume [is] a mixed bag.",
      "author": "Kip Mooney"
    },
    {
      "text": "The first strong effort from Marvel in a while, as the Rocket story drives the plot, and attaches real stakes in a way these film usually don’t.",
      "author": "Stephen Silver"
    },
    {
      "text": "Why am I crying about a raccoon?",
      "author": "Kent Garrison"
    },
    {
      "text": "Boy, does Gunn come out guns blazing.",
      "author": "Rachel Ho"
    },
    {
      "text": "Gunn says goodbye to Marvel Studios in style, leaving his wake in the genre and giving us a valuable personal lesson that we must never forget: we all deserve a second chance [Full Review in Spanish]",
      "author": "Luis Bond"
    },
    {
      "text": "Tearfully moving with bonkers humor, Guardians of the Galaxy Vol. 3 gives the world’s most bad ass trash panda from space the most meaningful film in a trilogy overrun with super heroic and perfection obsessed a-holes.",
      "author": "Chris Sawin"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a tailor-fitted exit for James Gunn from Marvel’s Cinematic Universe ... the Gunniest Guardians yet in the best way.",
      "author": "Matt Donato"
    },
    {
      "text": "This is a vibrant, high-tech film.",
      "author": "Marie Asner"
    },
    {
      "text": "While better than most recent Marvel or DC films, it definitely lacks the fun, buddy-film aspects and sincere relationships of the original in lieu of an exhausting mission-based story.",
      "author": "Josh Flanders"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is another stylish, laugh-out-loud, offbeat and most of all, Awesome Mix of being something beautifully human and alien at the same time.",
      "author": "Sarah El-Mahmoud"
    },
    {
      "text": "Completes Rocket’ transformation from a footnote to one of Marvel’ greatest characters.",
      "author": "Matt Singer"
    },
    {
      "text": "Guardians of the Galaxy Vol 3 was surprisingly emotional and has some nice finality for James Gunn.",
      "author": "Ryan McQuade"
    },
    {
      "text": "Too often it feels like James Gunn made a playlist of songs he likes and then came up with scenes to go with them.",
      "author": "Christy Lemire"
    },
    {
      "text": "If this is the last episode of the series (could that really be true?), it’s done with great care and concern. Director James Gunn knows how to fire up the faithful. Now, he just needs to point out who they are.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "The heart and soul of Guardians has always been the camaraderie of the cast.",
      "author": "Kathia Woods"
    },
    {
      "text": "What if the real raccoons are the friends we made along the way?",
      "author": "Brian Gill"
    },
    {
      "text": "“Guardians of the Galaxy Vol. 3” is the perfect conclusion to this group of superheroes who “take ass and kick names.” A heartfelt farewell to the most grounded and memorable family in film",
      "author": "Rosa Parra"
    },
    {
      "text": ",,,having this motley crew back together one more time has deepened their ties, softened their tough exteriors, and created playful exchanges that enhance what is a dense and convoluted story.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "A joyous sweetheart of a movie; even better is that it plays like a movie, not a Marvel product...  What’s it about? Raccoons and kindness. And gleefully bad gags. Gunn’s sheer competence soars alongside his customary monumental goofiness.",
      "author": "Ray Pride"
    },
    {
      "text": "Guardians 3 is a real warm and fuzzy movie that sometimes makes you forget that you’re a bit bored with the onslaught of superhero movies.",
      "author": "Wenlei Ma"
    },
    {
      "text": "A goofy and incohesive adventure tale of an intergalactic band of artificially created misfits.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Chukwudi Iwuji as The High Evolutionary commands the screen and upstages everyone on it each and every time he appears with mad scientist vibes disguised as compassion making him more than compelling to watch. Oh yeaH!  That soundtrack is absolute fire!",
      "author": "Carla Renata"
    },
    {
      "text": "Rocket is already my favorite Guardian, so now to see how he became who he became --  it's heartbreaking.",
      "author": "Tony Baker"
    },
    {
      "text": "If you’re looking for a way to conclude your relationship with Marvel’s most vibrant characters, this is it. Given signs of diminishing returns here, it’s also a good example of quitting while you’re ahead.",
      "author": "Abby Olcese"
    },
    {
      "text": "There is plenty of humor, along with a bit of romance, some cliffhangers, some pathos and a lot of action in this fast-paced story. It is a good example of why Marvel movies are so popular.",
      "author": "Robert Roten"
    },
    {
      "text": "an eclectic and affectionate mixtape that’s funny, thrilling, shattering, and bittersweet.",
      "author": "Valerie Kalfrin"
    },
    {
      "text": "Ultimately, Guardians of the Galaxy Vol. 3 is a thoroughly enjoyable film that, while it works best for those who have followed the franchise, it does also work as a film you can watch without context.",
      "author": "Theolin Tembo"
    },
    {
      "text": "There was always something that was funny, witty, or heart wrenching that covered for any cliché that appeared.",
      "author": "Omar Holmon"
    },
    {
      "text": "I was surprised by how sad, emotional, and dark this third film was.",
      "author": "Beth Accomando"
    },
    {
      "text": "Gunn is committed to viewers understanding the horrors of being unmade and remade, inflicting a level of emotion and empathy few Marvel movies have achieved and earning every bit of crass humor as necessary moments to catch your breath.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Under the aegis of writer/director James Gunn, Rocket Raccoon's origin story turns out to be heavy-handed and bizarrely grotesque.",
      "author": "Susan Granger"
    },
    {
      "text": "Be forewarned, it’s a slog for the first 90 minutes of its 2h 30m length. Then real energy kicks in.",
      "author": "Dwight Brown"
    },
    {
      "text": "Despite the film’s bloated length and tendency to embrace nostalgia without an ounce of moderation, it’s a fitting and heartfelt sendoff for the beloved crew of misfit mercenaries.",
      "author": "Louisa Moore"
    },
    {
      "text": "Garish, with an over-prolonged animal version of Sid's creepy, mutant, cobbled-together, depressing toys from \"Toy Story,\" it's got enough animal abuse for your kids to eventually need therapy sessions. Director Gunn's gone. Somebody bring back the fun.",
      "author": "Mark Jackson"
    },
    {
      "text": "It isn’t top-tier Marvel but it’s damn solid with some great gags and action throughout. Compared to recent MCU releases, however, it’s a rousing success.",
      "author": "Matt Hudson"
    },
    {
      "text": "Writer-director James Gunn knows how to make this ragtag bunch work, but there's a layer of sadness that envelops the proceedings, despite the many laugh-out-loud moments.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "As swansongs go, Gunn’s farewell to the MCU is finely tuned.",
      "author": "Hanna Flint"
    },
    {
      "text": "Guardians of the Galaxy Vol.3 is by far one the strongest entries in the post-Endgame era. A classic adventure with a lot of heart that makes the most out of its core characters, consequentially bringing the saga to a well deserved solid closure.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "Gunn falls prey to franchise imperatives and Marvel cultural mores. More is more, leaving less and less screen time for the human story.",
      "author": "Ed Whitfield"
    },
    {
      "text": "James Gunn has an incredible way of balancing the mix of humor and heart... and has gotten bigger and better with that.",
      "author": "tt stern-enzi"
    },
    {
      "text": "Flashy, fun and funny, it honours its main characters...",
      "author": "Cris Kennedy"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 makes use of what comes before without being totally bogged down. It’s a working film product, if not a superlatively meaningful work of art.",
      "author": "Kevin Fox Jr."
    },
    {
      "text": "There's a strong central plot running through this epic, but it's so cluttered that it can be tricky to keep track of it.",
      "author": "Rich Cline"
    },
    {
      "text": "The funny – and occasionally challenging – film eschews universal stakes for emotional ones, giving us a bittersweet send-off for the ragtag heroes.",
      "author": "Joseph Garcia"
    },
    {
      "text": "The fact that Gunn himself, as writer and director, has an unusual degree of authority, and thereby seems to be largely constraining himself, renders the narrow results all the more oppressive.",
      "author": "Richard Brody"
    },
    {
      "text": "Vol. 3 scales up with an excessive 150-minute runtime but commits that length to splashing Gunn’s signature brand of gooey sentimentality across the biggest, loudest, most color-mad canvas that a Disney budget can afford.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "I cried twice.",
      "author": "Linda Cook"
    },
    {
      "text": "This is a fitting conclusion to Gunn's iteration of the Guardians of the Galaxy, full of heart and comedy, cementing an unknown B-team into a memorable A-team of A-holes.",
      "author": "Steven Redgrave"
    },
    {
      "text": "From visually stunning images to the biggest action scenes to the comedy and the heart, the family, and the journey, Guardians of The Galaxy Vol 3 had a lot to live up to, and it's easily the best Marvel movie since End Game.",
      "author": "Crockett Houghton"
    },
    {
      "text": "With two villains instead of one, an endless succession of rescues and more endings than The Lord of the Rings, volume three is the same bloated two-and-a-half-hour leviathan as every other Marvel movie these days.",
      "author": "Tom Shone"
    },
    {
      "text": "Gunn goes the whole hog with the animals in this film, from cute talking dogs to mutant pigs and even heart-rending scenes in a jail cell featuring a raccoon, a walrus and an otter.",
      "author": "Brian Viner"
    },
    {
      "text": "Not as good as the Christmas special, but still pretty good.",
      "author": "Bob Grimm"
    },
    {
      "text": "With great attention to detail, a perfect mixture of music, action, humor, and grand emotion, has been created.  [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Unlike some of the recent less-satisfying [MCU] entries, there’s a pretty solid, funny, heartfelt entry here amidst the cacophony of space battles and monsters and general James Gunn weirdness.",
      "author": "TK Burton"
    },
    {
      "text": "There is still the familiar pleasure of the Guardians’ company, free of the Avengers’ government-sponsored gravitas. Gunn is too fond of them for a cruel last go-round, kindly completing their story.",
      "author": "Nick Hasted"
    },
    {
      "text": "The final film in the Guardians franchise never feels like it was made by committee or Chat GPT. It’s got loads of action, lots of heart, and could only have been made by James Gunn.",
      "author": "Tim Brennan"
    },
    {
      "text": "The movie packs both grandeur and grit.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is enjoyable, has true affection for its people and ends as it should.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Those who already love these characters will laugh and cry with the film, and those who know little or nothing about them will still have a good time (though again, if you're an animal lover, you should bring a box of Kleenex). Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A picture that balances a slightly overstuffed storyline with mischief, humour and the biggest of hearts.",
      "author": "Wendy Ide"
    },
    {
      "text": "How can you be fatigued about superhero movies when they're this good?",
      "author": "Matt Neal"
    },
    {
      "text": "Just wonderful from beginning to end.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Because it doesn’t shy away from taking chances, and because it embraces its oddball quirkiness like a benefit and not a hindrance, it becomes endearing.",
      "author": "Allen Almachar"
    },
    {
      "text": "Yet another big, loud, and fun intergalactic adventure. Worthy of the big screen and your time, even at two plus hours with some tough to swallow animal violence, it manages to send off its main characters in an emotionally satisfying way.",
      "author": "Patrick Hicks"
    },
    {
      "text": "Beyond the found family dynamic, if these movies have a central theme, it’s these losers spitting in the eye of (a) god as payback for existing in a universe that is uncaring at best.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "...enjoyable but inconsistent.",
      "author": "Michael Ward"
    },
    {
      "text": "Guardians of the Galaxy Vol 3 not only provides an emotional ending to James Gunn's time with this crew; but also delivers the strongest and most meaningful, both in its characterization and its anti-fascist message, MCU movie since Avengers: Endgame.",
      "author": "Jessie Gender"
    },
    {
      "text": "A funny, big-hearted adventure.",
      "author": "Richard Roeper"
    },
    {
      "text": "It’s an overprocessed send-off that’s so focused on going out with a bang that it loses its joy, charm, and trust in us to actually feel things on our own.",
      "author": "Keith Garlington"
    },
    {
      "text": "The first MCU film to make grown men cry and traumatize their kids.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Marvel's best movie in at least five years -- and then it goes on for another 40 awful minutes.",
      "author": "Vincent Mancini"
    },
    {
      "text": "A solemn, but heartfelt, authentically unique, though consistently brazen spin around the universe ... the most personal and profound of the three films.",
      "author": "Candice McMillan"
    },
    {
      "text": "When the Guardians get into a big group hug at the end of the film, it’s supposed to evoke love and solidarity. But it might better be characterized as the unity of capital, determined to offend no one and turn no one’s dollars away.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "A kooky, messy grab-bag of a flick, the third and reportedly final entry in the Guardians of the Galaxy saga mixes up the good, the bad and the completely bizarre with lots of gonzo energy but sometimes questionable judgment.",
      "author": "Alison Gillmor"
    },
    {
      "text": "90% of this was the situational emotion, and I didn't connect. It became a formula of  several fighting encounters, too many new characters and the High Evolutionary villain screaming every line until there was no more scenery to chew. Yo Space Adrian!",
      "author": "Patrick McDonald"
    },
    {
      "text": "I laughed a lot throughout Guardians of the Galaxy Vol. 3 but, perhaps most surprisingly of all, I realized how much I cared about these Guardians and their presence in my galaxy.",
      "author": "Richard Propes"
    },
    {
      "text": "A rollicking space action comedy that also happens to be a treatise on the ethics of experimenting on animals.",
      "author": "Neal Pollack"
    },
    {
      "text": "Gunn signals the somber direction in the opening scene and carries it through to the end credits. It’s not necessarily a darker movie, just ­sadder, and some fans won’t be ­prepared for the goofy franchise turning into a bit of a tear-jerker.",
      "author": "Collin Garbarino"
    },
    {
      "text": "Cutting back and forth between the light-hearted moments with the Guardians, and young Rocket’s story is jarring in tone and slows down the pacing. It’s surprising Marvel Studios approved such morbid imagery of mutilated critters.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "Gunn the true-blue genre imagineer has almost always been able to pick up the slack from Gunn the overcompensating writer, even as the latter can’t resist to show every character that speaks, roars or chortles how much he loves them.",
      "author": "David Lynch"
    },
    {
      "text": "Gunn gets melancholic in his farewell to Marvel but hasn't lost his sense of fun. Rocket's backstory gets me bawling but there are plenty of laugh-out-loud moments to balance the somber mood.",
      "author": "Ruth Maramis"
    },
    {
      "text": "A near-perfect sendoff for the team. Dark, happy and risky in every way. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "Franchise loyalists should remember to stick around for the affectionate mid-credits salute to all the departing players, not to mention a giant clue at the very end about future endeavors for \"Star-Lord\" Quill.",
      "author": "John Urbancich"
    },
    {
      "text": "The film, and especially its final moments, find that delicate balance between giving the audience enough and leaving them wanting more.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Very, very few people will come out of the movie unhappy. But many will have the uncomfortable feeling that they should have been more satisfied, not as interested in deconstruction as I and other film writers are.",
      "author": "David Poland"
    },
    {
      "text": "It all adds up to a fitting swan song for one of the most beloved groups in the Marvel Comics Universe. If this is truly the end, it’s been a fun and rather memorable ride.",
      "author": "Micheal Compton"
    },
    {
      "text": "James Gunn sticks the landing with the third and final Guardians movie. It’s an emotionally powerful, wildly inventive, often hilarious tour de force farewell for our ragtag band of intergalactic space heroes.",
      "author": "Erik Kain"
    },
    {
      "text": "An unwieldy and unexpectedly emotional mess that will win you over.",
      "author": "Tori Brazier"
    },
    {
      "text": "What really makes this movie work is that it has heart. You could just feel the love that is poured into this movie.",
      "author": "Andre Meadows"
    },
    {
      "text": "It’s often surprisingly effective at tugging on the viewer’s heartstrings. But that application of personal investment and care to an enterprise that would, in another’s hands, be soulless and generic is what Gunn did best during his time at Disney,",
      "author": "Nick Johnston"
    },
    {
      "text": "Less about Star Lord’s hang ups and more a character study of Rocket, this offers an intriguing diversion from the previous films.",
      "author": "Kevin Carr"
    },
    {
      "text": "Marvel will miss James Gunn more than Gunn will miss Marvel, but if there’s any way for the MCU to get out of its current funk, then ‘Guardians of the Galaxy Vol. 3’ should be the blueprint going forward.",
      "author": "Miles Surrey"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is exciting, funny, heartbreakingly emotional and the perfect send-off...[it] proves that the “movie with the talking racoon” has come a long way…and burrowed itself deep into our hearts.",
      "author": "Damond Fudge"
    },
    {
      "text": "For \"Guardian\" junkies and kids of all stripes, this two-hour reunion with old character friends will have them singing Peaches & Herb’s 1978 soul classic “Reunited” -- and it feels so good.",
      "author": "Thelma Adams"
    },
    {
      "text": "This \"Guardians\" doesn't come with the same verve and moxie as the first two, but there is, at least, a sense of growth.",
      "author": "Piers Marchant"
    },
    {
      "text": "Even if this third outing doesn’t quite hit the heights of Vol. 1 and Vol. 2, it still avoids the “been there, done that” quality that has felled a few of the other recent Marvel releases.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Feels more like an imitation of a 'Guardians' movie rather than an actual 'Guardians' movie.",
      "author": "Doug Walker"
    },
    {
      "text": "GOT3 destroyed me because it made me self-reflect. And those are the kind of movies that stay with you. Because yes, this is a movie about aliens, epic battles in space, etc. But this is also a story about belonging and self-acceptance.",
      "author": "Lyra Hale"
    },
    {
      "text": "Flirts with being interesting but I checked out after the 90 minute mark with nearly an hour to go.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "With just the right amount of comedy, drama, sentiment, action and a soundtrack full of well-placed rock classics, writer/director James Gunn has reached a cosmic balance.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "As a final chapter for this trilogy, Vol. 3 works. But of the three films, it’s the weakest.",
      "author": "Liz Shannon Miller"
    },
    {
      "text": "As a fan of Cronenbergian body horror, is it hypocritical to find “Guardians of the Galaxy Vol. 3” repulsive for its copious CGI animal torture? No! Because fuzzy creatures didn’t invent genocide, Twitter, or the 50-hour work week.",
      "author": "Ryan Syrek"
    },
    {
      "text": "“Guardians of the Galaxy Vol. 3” hits all the quirky, comedic and heartfelt notes that made the first two movies such a blast.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 concludes Gunn’s trilogy on a positive note, reminding us why we ever fell in love with this band of misfits, and giving us even more reasons to look back on their journey with fondness.",
      "author": "Jeff Nelson"
    },
    {
      "text": "Disney did the right thing by bringing Gunn back after unceremoniously firing him over years-old tweets. Gunn IS this franchise, and by doing so Disney saved the Guardians, our joy, and possibly the Marvel Cinematic Universe as a whole.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Rocket’s backstory, though often overshadowed by exploding spaceships, space stations and planets, is actually kind of sweet. As an urban Canadian, I have to say that anything that makes me feel sympathy for a raccoon is clearly doing something right.",
      "author": "Chris Knight"
    },
    {
      "text": "Gunn may have made a new version of Tod Browning's Freaks for the masses.",
      "author": "James Verniere"
    },
    {
      "text": "More downbeat and grim, but still plenty of laughs and camaraderie in this final (?) outing for the galactic do-gooders.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "It trashes the camaraderie of its core ensemble in favor of one deafening, vicious flourish after another.",
      "author": "Michael Phillips"
    },
    {
      "text": "Vol. 3 is not a stellar sendoff by any means, but Gunn delivers some of the most ambitious filmmaking of the MCU’s post-Endgame era.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 might bite off more than it can chew, but its focus on character growth, dazzling action, and rocking playlist has James Gunn going out with his galactic-found family in style.",
      "author": "Rendy Jones"
    },
    {
      "text": "...awesome on a number of different levels. It's also my favorite Marvel movie at least since \"Avengers: End Game,\" and perhaps of all-time.",
      "author": "Tom Santilli"
    },
    {
      "text": "Mercifully, Gunn gives us a Phase whatever Marvel movie that is self-contained - more GCU than MCU.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "It is full of so much blink-and-you-miss-it humour that I’d like to watch Guardians 3 again. None of this could work without the characters whose flaws are played up for comic effect by judicious pairings.",
      "author": "Grant Rollings"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3, though imperfect, bids a fond farewell to the ragtag crew of misfits with Rocket Raccoon finally at the forefront.",
      "author": "Eric Marchen"
    },
    {
      "text": "Come for the music and the visual effects, not so much for the disjointed depressing story. While The Guardians work to save the world, it’s too bad that James Gunn and the crew couldn’t save this movie.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "[D]on't say I didn't warn you.",
      "author": "Rain Jokinen"
    },
    {
      "text": "I went into this film suffering superhero burn-out, and I came out of it with the most wonderful and comforting form of heartbreak. And I can only say thank you.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "The Guardians of the Galaxy now sits next to The Lord of the Rings, Star Wars (OG) and Back to the Future as one of the greatest movie trilogies of all-time.",
      "author": "Adam Olinger"
    },
    {
      "text": "You’ll laugh. You may cry. You’ll probably hold your breath. And you’ll almost certainly think a bit about animal experimentation.",
      "author": "Mark Meszoros"
    },
    {
      "text": "It’s entirely possible that Guardians of the Galaxy, Vol. 3 is the last gasp of [the MCU's] once-invulnerable cultural wrecking ball.",
      "author": "Sonny Bunch"
    },
    {
      "text": "For all its backsliding into bleak—stop torturing Bradley Cooper's talking raccoon—this spirited summer kickoff delivers the requisite thrill ride and ends the GOTG trilogy with the sweet sorrow of saying goodbye to these space dorks. It’s been a trip.",
      "author": "Peter Travers"
    },
    {
      "text": "With The Guardians of the Galaxy Vol 3. James Gunn stuffs it full of all of his hallmarks to craft a fitting send-off for this band of misfits. The film is a certified heartfelt feast, even if there is a lot to process all at once.",
      "author": "Maggie Lovitt"
    },
    {
      "text": "James Gunn and the company have put a stamp on the honest-to-God wackiest and most heartfelt Marvel franchise ever.",
      "author": "M.N. Miller"
    },
    {
      "text": "Overall, “Vol. 3” does everything a final film should — if it really is a final film, that is.",
      "author": "Rafer Guzman"
    },
    {
      "text": "A movie is only as good as its bad guy, and I dreaded having to spend time with him.",
      "author": "Odie Henderson"
    },
    {
      "text": "Uneven though it may be, \"Vol. 3\" continues to demonstrate that Gunn has a unique skill set.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Not only is Guardians of the Galaxy Vol. 3 my favorite film of the series, but it’s also quite possibly the best entry in the entire MCU.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "A magnificent conclusion, an ode to the imperfect and the weirdos... [Full Review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "There will probably never be another Marvel film like this again, a film so expressly about empathy, pushing forward against the odds in the messy, unpredictable path towards renewal.",
      "author": "Tanner Gordon"
    },
    {
      "text": "Guardians of the Galaxy Vol 3. is the most heart-wrenching, emotional adventure yet for the galaxy's biggest, most lovable misfits. James Gunn delivers a grand, yet poignant, sendoff for the Guardians. These morons will be missed.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "It doesn't entirely escape the fast-drying cement of MCU convention, but in true James Gunn style, it goes down swinging. It's an ode to the places we’ve been, the people we’ve become, and the questions we’ll have to ask ourselves about where we go next.",
      "author": "Gayle Sequeira"
    },
    {
      "text": "“Guardians of the Galaxy: Volume 3” is a snappy and involving comic book extravaganza.",
      "author": "Russ Simmons"
    },
    {
      "text": "It will bring a smile to your face and perhaps a tear to your eye — and it is all-around lovable — but it needed a firmer hand.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Everything in “Guardians of the Galaxy, Vol. 3” hints that this is our group’s last ride together, and that’s OK because it’s such an enjoyable ride.",
      "author": "Sean P. Means"
    },
    {
      "text": "Gunn’s work registers as that of a filmmaker with a personal vision for his comic book universe and the freedom to explore it.",
      "author": "Brian Eggert"
    },
    {
      "text": "GOTG 3 is a blahbuster that, like other recent Marvel disappointments, jogs along from one visually extravagant, strenuously jokey set piece to another without offering much in the way of either dramatic engagement or actually funny ideas.",
      "author": "Kyle Smith"
    },
    {
      "text": "Ironically -- and even sadly -- Guardians 3 feels more like a familiar MCU formula film, rather than the unique vision that started Guardians of the Galaxy in the first place.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Gunn wouldn’t be Gunn if he wasn’t compelled to mix sweetness with viciousness -- but... At this point the sadistic side of his imagination is out in the open.",
      "author": "Jake Wilson"
    },
    {
      "text": "[Vol. 3] totally sticks the landing, bringing this beloved slice of the Marvel franchise to a nourishing close, dancing across the finish line to the tune of another blockbuster soundtrack and reminding me how much I just adore going to the movies.",
      "author": "Kate Rodger"
    },
    {
      "text": "GOTG 3 brings big emotions, high stakes, and a refreshingly serious tone that add up to a very satisfying conclusion to the trilogy. Weak villains and a thin story hold it back from true greatness but these characters & their dynamic continue to shine.",
      "author": "Cody Leach"
    },
    {
      "text": "'Guardians of the Galaxy Vol. 3' is about as exceptional as blockbuster entertainment gets. In many ways, it’s the 'Toy Story 3' of Marvel movies. It rocks!",
      "author": "Preston Barta"
    },
    {
      "text": "Watching the thing is like trying to drink water from something more powerful than the proverbial fire hose. It’s like putting your head back to be waterbombed by the same service’s aerial forest-fire team.",
      "author": "Donald Clarke"
    },
    {
      "text": "James Gunn closes his 'Guardians of the Galaxy' trilogy with more gravitas than goofiness amid rockin’ interstellar set-pieces.",
      "author": "André Hereford"
    },
    {
      "text": "At two hours and 29 minutes,  Guardians can be accused of bloat. But Rocket’s origin story settles the movie down, building toward what many will regard as an emotionally satisfying conclusion.",
      "author": "Robert Denerstein"
    },
    {
      "text": "The band has broken up, but maybe it's for the better. It's a bit of a downer. Some might love this one, but it made me long for when it felt like the first time.",
      "author": "Paul Salfen"
    },
    {
      "text": "The big-picture elements of Guardians 3 work beautifully, but so do the specifics.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Gunn ingeniously reclaims each of the characters and gives them dramatic depth...",
      "author": "Juanma Fernández París"
    },
    {
      "text": "Like its characters, a mess but a lovable and entertaining mess. By now it feels like it’s our mess. So, even though I couldn’t help imagining what Honest Trailers and Pitch Meeting are going to have so say about it, I enjoyed it",
      "author": "Nell Minow"
    },
    {
      "text": "All of this is funneled through a space oddity pastiche that feels pre-approved and safely on brand; not the genuine, fascinating weirdness of an industry outsider.",
      "author": "Conor O'Donnell"
    },
    {
      "text": "Emotional with plenty of heart, Guardians of the Galaxy Vol.3 is hands down the best film in the trilogy and belongs at the elevated heights as a top-tier MCU film.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Director James Gunn’s final Guardians chapter rips and roars with the confidence and emotions that nine years and multiple movies featuring this band of space underdogs bring.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "This sweetly sentimental film is immensely entertaining.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "... Now comes Vol. 3, which has the outsider emotion of \"Creep\" with none of the nuance. Its characters are either yelling their feelings at one another or their eyes are welling up with sadness, and there's no in between.",
      "author": "Adam Graham"
    },
    {
      "text": "... Delivers the satisfaction of a broken record in a digital era. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "What Guardians of the Galaxy Volume 3 achieves is ultimately a satisfying finale to a story of unforgettable characters.",
      "author": "Maan Jalal"
    },
    {
      "text": "Vol. 3 is right up there among the best MCU films, with a blend of comedy and drama that can only exist in its galaxy.",
      "author": "Alex Bentley"
    },
    {
      "text": "[Guardians Vol. 3 is] the best Marvel since Avengers: Endgame. That may not immediately read as high praise given the dearth of quality in the interim, but the film has made one thing very clear: James Gunn really, really knows what he's doing.",
      "author": "Jack King"
    },
    {
      "text": "It's always nice when superhero movies remember that they're supposed to be about saving lives rather than taking them, and GotG 3 often plays like a celebration of life — even for animals that can't talk or fly spaceships.",
      "author": "Christian Holub"
    },
    {
      "text": "For a franchise in the throes of a post-Endgame wheel-spinning slump, and with a less-than-compelling upcoming slate of films, Guardians Vol. 3 is a refreshing, if overstuffed, respite.",
      "author": "Trace Sauveur"
    },
    {
      "text": "The performances prove to be on point, hitting the right notes. By the time the lights come up in the theater, many will realize these are characters they don’t want to say goodbye to.",
      "author": "George M. Thomas"
    },
    {
      "text": "Entertaining, surprisingly soulful and sometimes very weird.",
      "author": "Luke Goodsell"
    },
    {
      "text": "A tireless creator of visual worlds full of ideas and revelations, some of them extraordinary, Gunn delivers an ending that captures the breath, fun and vital energy of the first two adventures... [Full review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "(The film) groans under the burden most Marvel movies suffer, having to be both a story for now & a trailer for what’s to come. However, Gunn leaves the MCU teaching it a valuable lesson: that making the stakes personal keeps the audience invested.",
      "author": "Victoria Luxford"
    },
    {
      "text": "This closure is a friends' party. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Overstuffed and chaotic, veering wildly from tone to tone and winding up as a lumbering conclusion to a series that began as a comparatively light-footed part of the MCU.",
      "author": "Frank Swietek"
    },
    {
      "text": "At times the plot felt a little messy with not all the characters having enough to do and it’s definitely too long, but it's a return to form for the MCU for sure.",
      "author": "George Simpson"
    },
    {
      "text": "Writer/director James Gunn fundamentally misunderstood the boundaries of this cinematic reality.",
      "author": "Sean Collier"
    },
    {
      "text": "It’s just a shame that after two enjoyably irreverent anomalies in the canon, Gunn’s finale should be so solemn, over-frenetic and at points, shamelessly sentimental.",
      "author": "Jonathan Romney"
    },
    {
      "text": "The entire cast lands the comedy and conveys the heart of the story brilliantly. And even with a runtime of 2 and half hours, the film moves quickly thanks to an engaging plot, thrilling action sequences, and as always, a stellar soundtrack.",
      "author": "Susan Kamyab"
    },
    {
      "text": "I think 1 thing we should all remember is that Guardians of the Galaxy, Vol. 3 is a James Gunn movie and as such, feels like a symphony conducted by a child who has heard the music a hundred times, but has also had a box of Froot Loops and a 20oz Mtn Dew.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "If anything, the letdown of \"Vol. 3\" isn’t all the scenes of torture, genetic mutation, incarceration and genocide; it’s that the movie is here for kicks and little else.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Leave it to the weirdos to bypass what's becoming the same, old same-old in this franchise.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Here, the script delivers (and then some), and we end on a satisfying note that promises (maybe) more interesting stories to follow. And it’s all courtesy of a talking raccoon.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "I am Groot … ly disappointed.",
      "author": "Barry Hertz"
    },
    {
      "text": "Despite the underwhelming Vol. 2 in 2017, James Gunn has created a singular band of eccentric misfits who inject a shot of buoyancy & joy into the superhero genre.  The tag line of this film is: Once More with Feeling. And that’s pretty much what it is.",
      "author": "Anupama Chopra"
    },
    {
      "text": "By the time the end credits roll, it has become a loud, slightly over-long orgy of CGI, but James Gunn brings something most other superhero movies don’t have. Within the wham-bam action overload is a genuine sweetness that overrides the bombastic action.",
      "author": "Richard Crouse"
    },
    {
      "text": "Sure, it’s morbid, maudlin, and flippant at the same time—but it’s also infectious and full of spirit. Gunn is hooked on a feeling and high on believing. It’s far from a smooth ride, it doesn’t always work, but it’s also the bittersweet end of an era.",
      "author": "Akhil Arora"
    },
    {
      "text": "As ungainly as it can be, Vol. 3 is still an entertaining ride, full of creatively designed alien worlds and vessels, with Iwuji as an enjoyably unhinged villain.",
      "author": "Josh Bell"
    },
    {
      "text": "As outlandish as all of this is, the ending feels natural. James Gunn lets the story write itself out.",
      "author": "Korey Coleman"
    },
    {
      "text": "There might not be as many laughs but James Gunn again delivers a rollicking, robust space fantasy adventure that also chimes in as the most pro-raccoon movie ever made... It's also a significant marker in the accelerating downslide of Cancel Culture.",
      "author": "Jim Schembri"
    },
    {
      "text": "Although there are a few touching moments, for the most part, Guardians of the Galaxy Volume 3 is a convoluted work trying to juggle too many plotlines.",
      "author": "Michelle Kisner"
    },
    {
      "text": "It does drag on a bit towards the end but in the main, Guardians Vol 3 is witty, smart and consistently entertaining, one of the better Marvel outings of recent years.",
      "author": "Paul Whitington"
    },
    {
      "text": "Gunn signs off on his epic trilogy with a devastating side tale that explains how Rocket the yappy racoon got his voice. It nearly broke me. Well played, everyone.",
      "author": "Chris Wasser"
    },
    {
      "text": "… an emotional impact that can rival any modern film, let alone superhero film.",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "One of the supporting characters is right: The whole Guardians of the Galaxy saga was always Rocket’s story rather than Star-Lord’s. Turning the series into that turns out to be a stroke of genius.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "A course that needed correcting, Guardians of the Galaxy Vol. 3 is a healthy reminder of why we became so invested in these films in the first place.",
      "author": "Peter Gray"
    },
    {
      "text": "It does the same thing the previous movies did: shine a light on misfits and weirdos, celebrate their flaws and foibles, and prove that ingenuity, empathy and, yes, absolute silliness, are the most valuable forces in the galaxy.",
      "author": "Morgan Shaunette"
    },
    {
      "text": "Vol. 3 retains the Gunn edge, channelled through the perfectly cast troupe of actors making up the Guardians.",
      "author": "John Lui"
    },
    {
      "text": "Gunn achieved something I was beginning to think Marvel couldn't do any more: he kept me engrossed throughout. Guardians 3 is also quite stunning to look at.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "This is the least enjoyable of James Gunn’s trilogy.",
      "author": "James Berardinelli"
    },
    {
      "text": "It says something about the current state of superhero movies that the fate of a small frightened raccoon makes a stronger tug on the heart than any imperilled person or planet in the relentless Marvel Cinematic Universe.",
      "author": "Peter Howell"
    },
    {
      "text": "Thank God that James Gunn is back in the MCU.",
      "author": "David Crow"
    },
    {
      "text": "The jokes and banter were hilarious even though some lingered on too long. However, director James Gunn loves the characters so much and it shows. This was an incredible conclusion to this Guardians of the Galaxy trilogy.",
      "author": "Brandon Avery"
    },
    {
      "text": "An emotionally resonant blockbuster (featuring Marvel's most evil villain ever!) that re-establishes James Gunn as one of the absolute top-class creators working in modern Hollywood. This is the one you've been waiting for - an absolute stunner.",
      "author": "Bob Chipman"
    },
    {
      "text": "There are three movies here and I like two of them. GotG3 can be snide and ridiculous but what makes it work is Gunn’s ability to find the heart of a story, ridicule or explode it, and allow it to envelope his audience.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Vol. 3 shifts the tonal balance away from the free-wheeling fun in an effort to give us a Return of the King-style victory lap, wrapping up a dozen stories all at once.\n\nIt's heavy. Really heavy.",
      "author": "J Hurtado"
    },
    {
      "text": "Guardians movies are always a blast, but the beating heart of the series is the unlikely family and how they come to love and value one another. That element is as strong as ever in Vol. 3.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Where this Guardians excels, and other recent MCU releases have failed, is in delivering both action and the emotion — a tricky balancing act.",
      "author": "Randy Myers"
    },
    {
      "text": "Despite the bloated 150 minutes feeling extraneous, Gunn directs with ease and fluidity. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "The pressure is stacked for Gunn to leave on a high note, but while the main characters end up in satisfying places, the road to get there is uneven and too emotionally manipulative for its own good.",
      "author": "Kyle Wilson"
    },
    {
      "text": "James Gunn loves the characters and takes them seriously... [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "Animal lovers, comic book fans and unofficial adjudicators of narrative continuity, action and style in the Marvel Cinematic Universe: Lend me your ears. “Guardians of the Galaxy Vol. 3” is not the movie for you.",
      "author": "Maya Phillips"
    },
    {
      "text": "Unfortunately, the film from writer-director James Gunn... creates worlds that it either destroys or simply grows bored with moments later and reduces what should be complicated relationships into reductively earnest proclamations.",
      "author": "Oliver Jones"
    },
    {
      "text": "Gunn is a filmmaker with nothing to lose in the MCU, and for the end of his trilogy, his Marvel swan song, “Guardians of the Galaxy Vol. 3,” he throws it all at the wall with a satisfying splat.",
      "author": "Katie Walsh"
    },
    {
      "text": "An emotional story in an adventure full of action, humor and the beauty of fighting for your loved ones, whether they are blood or chosen family. I left happy, melancholic but especially satisfied, while wiping away my tears. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "A tremendous closure of the MCU’s best and most consistent trilogy. Enormous fun, with insane action, hilarious gags, and doses of classic Guardians heart & soul! It will leave you emotionally shattered, but filled with so much hope and optimism.",
      "author": "Dave Lee"
    },
    {
      "text": "A triumphant, beautiful closer for a team we’re devastated to lose, Guardians of the Galaxy Vol 3 is one of the best MCU movies ever made.",
      "author": "Cameron Frew"
    },
    {
      "text": "'Guardians of the Galaxy Vol. 3' sends James Gunn and his band of intergalactic misfits out in a blaze of glory that sees the writer and director bow out on no other terms but his own.",
      "author": "Scott Campbell"
    },
    {
      "text": "The latest GotG team-up delivers plenty of visual spectacle and spacefaring hijinks, but the script leaves much to be desired.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "It hits the emotional note that has often been underplayed in the previous Guardian instalments but soars in this triumphant swan song.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "As heart-wrenching as it is hilarious, Guardians of the Galaxy Vol. 3 is James Gunn’s masterstroke and a showcase for both his filmmaking talent and a cast that makes everything about this movie simply awesome. An absolute triumph.",
      "author": "Josh Wilding"
    },
    {
      "text": "A bittersweet goodbye to our beloved bunch of a-holes that goes for the heart and reminds you why you instantly fell in love with these characters way back in 2014.",
      "author": "Doug Jamieson"
    },
    {
      "text": "This third and seemingly final installment is the kind of film with too much going on for everyone to like all the moving parts equally, but the high notes are high enough that the flat patches don't linger",
      "author": "Anthony Morris"
    },
    {
      "text": "It rounds out the story of this group of misfit weirdos with a convincing and emotional finish, rather than trying to artificially force it on for another few years - something that's all too common in this genre.",
      "author": "Brian Lloyd"
    },
    {
      "text": "Did I cry watching GOTG3 like I did when Woody said goodbye to Andy in Toy Story 3? I sure did. #diandrareviews",
      "author": "Diandra Reviews"
    },
    {
      "text": "To watch Guardians of the Galaxy Vol. 3 is to watch a filmmaker under the wildly mistaken belief that the best way to get you to absorb what he's saying is by screaming it directly into your ear.",
      "author": "Glen Weldon"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 has all the highs and lows, plenty of laughs and thuds, and bonds together as a family to make for a great final ride.",
      "author": "Leo Brady"
    },
    {
      "text": "And while not every move James Gunn makes in Guardians of the Galaxy Volume 3 lands, enough of them do that make this easily the best Marvel Studios film since Avengers: Endgame.",
      "author": "Alan Cerny"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a huge improvement over the standard Phase 4 or 5 MCU film, harkening back to a time when these films didn’t feel like a compulsory bore.",
      "author": "Steve Katz"
    },
    {
      "text": "It’s wild stuff, but much like the film’s more psychedelic sci-fi elements, it works because of the effort that’s gone into creating rounded characters and a richly textured universe.",
      "author": "Alastair McKay"
    },
    {
      "text": "Rocket Raccoon’s story is the heart of this film. There are predictable but still appreciated moments (the inevitable hero-walk, the throwback soundtrack), Easter eggs and fun cameos from lesser characters, enough to demand a second viewing.",
      "author": "John Kirk"
    },
    {
      "text": "Like listening to your favorite band on their final tour: All killer, no filler (OK, maybe a little), the greatest hits mixed with new stuff that reminds you why they’re awesome in the first place, and a desire for the last song to never end.",
      "author": "Brian Truitt"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a fantastic send-off for such a great group of characters.",
      "author": "Jake Peffer"
    },
    {
      "text": "Regardless of what happens next, this weird little corner of the MCU won't be the same without James Gunn, but at least he went out in a blaze of glory with the best Marvel film since Avengers: Endgame.",
      "author": "Brent Hankins"
    },
    {
      "text": "The technically well-crafted movie tickles with one hand, while it throws low blows with the other. Gunn achieved his mission, but what did we really accomplish? [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "The decision to give Rocket the spotlight pays off with a movie that’s not only a funny conclusion to the Guardians of the Galaxy series but also surprisingly touching.",
      "author": "Rebecca Murray"
    },
    {
      "text": "After so much superhero movie fatigue, the film is [an] unexpected joy to watch. It carries tons of emotional weight, laughs and action. There were a few moments that surprised me in mixed ways, but it’s a beautiful tribute to friends who are like family.",
      "author": "Kristen Maldonado"
    },
    {
      "text": "James Gunn’s swan song in the MCU is a heartfelt and entertaining intergalactic adventure.",
      "author": "Casey Chong"
    },
    {
      "text": "In addition to being the darkest, goriest, and most disturbing Marvel movie, it’s also a contender for the funniest.",
      "author": "Nadira Goffe"
    },
    {
      "text": "GUARDIANS OF THE GALAXY Vol. 3 does a splendid job tying things together and reinforcing our love for these diverse characters.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "GUARDIANS OF THE GALAXY Vol. 3 is a very entertaining movie that doesn’t take itself too seriously.",
      "author": "David Kaplan"
    },
    {
      "text": "Yes, there are space battles, but the impetus for them is personal rather than universal survival, and that makes us more invested in the outcome.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is the best film of the MCU to date.",
      "author": "Carson Timar"
    },
    {
      "text": "manic clawing for \"cool\"",
      "author": "Jason Adams"
    },
    {
      "text": "Vol. 3 is a messy, overstuffed finale. But you rarely question whether Gunn’s heart is in it.",
      "author": "Jake Coyle"
    },
    {
      "text": "Gunn’s swan song is a big, messy, sporadically absorbing odyssey that effortlessly ranks among the MCU’s most original -and uneven – entries.",
      "author": "Hayden Mears"
    },
    {
      "text": "Gunn does a sturdy job of synthesizing his influences and tics into something resembling a tidy narrative, or at least as tidy as franchise demands allow.",
      "author": "Matt Lynch"
    },
    {
      "text": "It's a sweet and savory morsel of storytelling, drowning in a puddle of special-effects sauce.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "It’s fine, but these movies have exhibited such a higher level of quality within the MCU framework, I expected something more grounded and fulfilling.",
      "author": "Nate Adams"
    },
    {
      "text": "A mega-movie loaded with wildly colorful characters, crazy creatures,  loads of whimsy, dramatic intensity, lushly detailed world-building and ka-boomy blasts of explosive, sometimes chaotic action...and a surprising amount of emotional heft and heart.",
      "author": "Neil Pond"
    },
    {
      "text": "Mr. James Gunn delivers once again. A solid, \"all out\" farewell for this lovable band of misfits. The most emotional entry of the trilogy - full of laughs, great music and nifty action. Also, the darker and weirdest of the series. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "You can't mistake this for anything else, and for the first time in years, we're given a Marvel movie that is more concerned with the people on screen than setting up future installments.",
      "author": "Asher Luberto"
    },
    {
      "text": "You can tell Gunn isn't satisfied with the Guardians norm and continues to push the envelope in terms of story, spectacle, and characters. And it's needed considering the current MCU, and superhero, state.",
      "author": "Lee McCoy"
    },
    {
      "text": "Vol. 3 is mostly dark and dour, which only makes the series’ signature elements of goofy humor, ridiculous scenarios and too-cool-for-school soundtrack stick out like a sore thumb.",
      "author": "Joey Morona"
    },
    {
      "text": "Worlds are squandered, details are overlooked and, yes, there’s a CGI swarm. For better or worse, and much like the MCU at large, Guardians of the Galaxy Vol. 3 has a lot going on.",
      "author": "Michael Burgin"
    },
    {
      "text": "Gunn falls into the usual Marvel trap, his climax overblown and overlong in a film whose 2 ½ hour running time could have easily been condensed to better overall effect, and that, along with some brutal animal cruelty, will make this rough sledding..",
      "author": "Laura Clifford"
    },
    {
      "text": "The magic is a bit worn. The emotions and themes a little too familiar. But this team, in front of and behind the camera, fictional and in real-life, is still strong enough to deliver a still pretty entertaining and crazy space adventure film.",
      "author": "Jimmy Cage"
    },
    {
      "text": "This is probably the most James Gunniest movie there could ever be.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "It is intense and grabs hold of the audience’s emotions from the beginning to the end. Gunn’s screenplay takes what we know and intricately weaves in backstory while enhancing the universe.",
      "author": "Catalina Combs"
    },
    {
      "text": "Overlong, clunky and dull. It's high on schmaltz and visual Spectacle while low on laughs, wit and palpable thrills.",
      "author": "Avi Offer"
    },
    {
      "text": "Its gripping storyline, flawless cast chemistry, and stunning action and visuals make for an unforgettable movie experience.",
      "author": "Dorian Parks"
    },
    {
      "text": "It’s hard to say if this is Gunn’s true vision to end his trilogy or felt caught up fitting his characters back it into a universe that’s now 32 films in.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "This is a special MCU entry. These characters continue to show growth, and this finale ties so much together. Fans will feel so many things when the credits hit, but it will be hard not to smile.",
      "author": "Austin Burke"
    },
    {
      "text": "Marvel fans can relax because I enjoyed this latest entry and consider it a big step up from vol 2",
      "author": "Rachel Wagner"
    },
    {
      "text": "...a combination of those exploitative ads from animal shelters and the Japanese body-horror endurance test Tetsuo: The Iron Man.",
      "author": "Josh Larsen"
    },
    {
      "text": "What was previously a rollicking, broadly caricatured & kid-friendly superhero series completes its trilogy with an overwrought epic stuffed with neck-breaking violence, a vicious, one-note villain, and so much animal cruelty, it felt like a sucker punch.",
      "author": "Jeff York"
    },
    {
      "text": "I regret to inform you that the Guardians of the Galaxy as you know them are dead. What remains in Guardians of the Galaxy, Vol. 3 are flickering remnants of fun times, but mostly maudlin bullshit.",
      "author": "Kristy Puchko"
    },
    {
      "text": "A fitting finale for Marvel's most affable heroes.",
      "author": "Hannah Strong"
    },
    {
      "text": "“Guardians of the Galaxy Vol. 3” is overstuffed and a tad too long. But it’s also a humorous, heartfelt farewell by Gunn to his band of misfits.",
      "author": "Zaki Hasan"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 delivers the best action in the trilogy to date while also providing its most heartbreaking plot yet.",
      "author": "Alan French"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 brims with animalistic fury and human complexity, beautifully expanding upon the series’ foundational theme of found families.",
      "author": "Eric Francisco"
    },
    {
      "text": "Since \"Vol 1.,\" Gunn has been trying to teach us this lesson, but we weren’t ready to hear it. Now, with the conclusion to his space odyssey, we’re ready to receive his message and it’s one of warmth, love, and second chances.",
      "author": "Douglas Davidson"
    },
    {
      "text": "It’s Gunn’s farewell to Marvel, and he wants us to feel the Shakespearean sweet sorrow of parting. It also makes a pretty good case that he’s had a master trilogy plan all along",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 reminds us of the benefits of having a filmmaker under the Marvel umbrella with vision, guts, and love for his characters. [Full review in Spanish]",
      "author": "Mireia Mullor"
    },
    {
      "text": "The best MCU movie in years.",
      "author": "Emily Wheeler"
    },
    {
      "text": "A colorful reminder that the best of these aren’t made by committee, but by the sincere weirdos who love the craft and love these heroes.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 has James Gunn's stamp and also, is quite disconnected from the rest of the MCU. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a messy movie but a rousing, emotionally satisfying sendoff for the core team. It's also a reminder that no one understands and can get viewers to care about outcasts quite like James Gunn",
      "author": "Robert Kojder"
    },
    {
      "text": "Volume 3 is the perfect end to a wonderful story of a band of misfits motivated purely by selfish reasons and now come together as a team and family.",
      "author": "Alan Ng"
    },
    {
      "text": "It clumsily tries to blend mean-spiritedness with sentimentality. The new characters in this saga are hollow and horribly written. Most of the returning hero characters are often smug and irritating,",
      "author": "Carla Hay"
    },
    {
      "text": "When the movie is focusing on what it’s done so well in the past with the topic of family, the story beats are emotional and impactful, shining with real heart.",
      "author": "Chris Joyce"
    },
    {
      "text": "There’s such life and energy in every aspect of the filmmaking that even when the movie isn’t hitting on all cylinders, you trust that something amazing will be coming in the next minute",
      "author": "Terence Johnson"
    },
    {
      "text": "Writer-director James Gunn caps his Guardians of the Galaxy trilogy with the right emotional tone, roller coaster and all.",
      "author": "Danielle Solzman"
    },
    {
      "text": "In James Gunn's overt attempt to make ‘Vol 3.’ the most heartbreaking ‘Guardians’ movie (clearly the impetus of the film) and make you feel all the feels, the writer/director just tends to overcook a lot of scenes with weepiness that feels forced.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 has clever laughs, the requisite groovy soundtrack, and astounding action scenes, but a powerfully dramatic story arc goes to ugly places that wrench the soul. James Gunn exits the franchise on a visceral high note.",
      "author": "Julian Roman"
    },
    {
      "text": "You’ll watch the movie and wonder why they just can’t seem to make a 'Star Wars' movie that’s this damn good or full of emotion.",
      "author": "Edward Douglas"
    },
    {
      "text": "A clumsy, overlong series finale that never strikes a balance between the touching story at its core and the numerous moving parts hovering in that story’s vicinity.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Gunn delivers an emotional sendoff for his ragtag group of misfits that possesses the humor and heart of the first two movies. Devoid of any real stakes, \"Vol. 3\" is not the best of the trilogy, but it's better than the last outing.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Bravo, everyone involved... Everything you’ve come to know, love, and expect from a Guardians of the Galaxy movie is here again, and as usually Gunn has ramped it all up even better than before.",
      "author": "Mark Hughes"
    },
    {
      "text": "Where Guardians of the Galaxy Vol. 3 resonates the most is in its emotional storyline.",
      "author": "Fred Topel"
    },
    {
      "text": "Consistently chaotic and confusing, the film is the kind of mess that only a mother could love.",
      "author": "Peter Martin"
    },
    {
      "text": "A very solid ending for this trilogy. Guardians of the Galaxy Vol. 3 was the first time I've wanted to join this squad. Not for all kids as they upped the violence but did cut back on the crass content.",
      "author": "Tania Lamb"
    },
    {
      "text": "It may be a haphazard journey, but the finale is so splashy, high-octane, and colossal (essentially adopting the sensibilities of Bollywood undertakings) that it largely saves the film from the earlier tedium.",
      "author": "Mike Massie"
    },
    {
      "text": "Considering the amount of time that was given for Gunn to perfect the Guardians' final bow, it's incredibly disappointing that the last entry into the Guardians trilogy is its weakest link.",
      "author": "Annie Banks"
    },
    {
      "text": "In true Guardians fashion, Gunn and his intrepid crew decide their legacy is to go down swinging to the very end, and that will always be both intensely entertaining and unforgettably endearing.",
      "author": "Matthew Jackson"
    },
    {
      "text": "We can’t stand the idea of seeing them apart, but we also can’t imagine what the MCU would’ve been like without them.",
      "author": "Travis Hopson"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 succeeds because it isn't saddled with introducing the next six MCU movies to come after it...Guardians of the Galaxy 3 is its own story. It's Rocket's story, and that's what makes it worth watching.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Volume 3 feels like an emotional goodbye to this weird, charming corner of the Marvel universe, and to the era of Marvel that charmed even critics in its heyday.",
      "author": "Clint Worthington"
    },
    {
      "text": "The jovial intimacy brims throughout every heroic character interaction from all involved. In the end, the quality time of hugs are cooler than any perilous gunshot, slashing blade, or punching power move.",
      "author": "Don Shanahan"
    },
    {
      "text": "Cue the Sarah Mclachlan music because James Gunn is trying hard to make you feel things. This ends up as a tonal mess that relies on Disney-style emotional manipulation.",
      "author": "EJ Moreno"
    },
    {
      "text": "If there is anything Guardians of the Galaxy Vol. 3 reminds fans of, Marvel can still produce a film with a definite zest and individuality. Who would have thought this assembly of characters would unite to make a trilogy that made us feel so damn much?",
      "author": "Murjani Rawls"
    },
    {
      "text": "Overall, this is a worthwhile conclusion to the Guardians of the Galaxy trilogy, bringing the trademark sense of humor and unique visual storytelling that have always set it apart from any of Marvel's other films.",
      "author": "Audrey Fox"
    },
    {
      "text": "The misfit team’s constant punchlines and I’m-just-busting-your-chops dynamic have grown exhausting. They’ve become the guy at the party who thinks he’s hilarious but is actually just drunk.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 isn't perfect, but it works more than it doesn't, and it hits the emotional beats. It also provides the rare sense of closure that is so rarely gifted to this genre.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Half of Vol. 3 is an outright drama, heavy with themes of loss and terror. It’s an odd, lumbering patchwork of a film, occasionally fascinating but otherwise bloated and aimless.",
      "author": "Richard Lawson"
    },
    {
      "text": "The Marvel Magic is back! James Gunn continues to evolve as a filmmaker, growing more confidant and ambitious. The cast also does stellar work to deliver a thrilling but also moving superhero movie. Gunn & Chukwudi Iwuji create a truly terrifying villain.",
      "author": "Grace Randolph"
    },
    {
      "text": "So comfortable are the leads now in their spacesuits that they have the feel of a cosily familial ensemble. If there’s a standout, though, it’s Karen Gillan’s Nebula.",
      "author": "Neil Smith"
    },
    {
      "text": "Absolutely exhausting. A sensory overload of CGI spectacle with oh so very much yelling. But also thoroughly hilarious & heartfelt. Gunn's signature weird creativity is on full display & it somehow leads to a tremendously emotionally effective send-off.",
      "author": "Aaron White"
    },
    {
      "text": "Solemnity is the guiding light here, and solemnity doesn’t suit the Guardians. When detouring through your designated corner of perfectly calibrated cosmic sloppiness starts to feel like a chore and a slog, you have a serious problem on your hands.",
      "author": "David Fear"
    },
    {
      "text": "Does the occasional emotional moment land? Sure. Do those moments wind up lost in space, floating in an oxygen-free environment with no place to land? Unfortunately, yes.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Where the cast’s chemistry used to run on playful joshing and bickering, now every other group interaction is just sour, if not actively rancorous.",
      "author": "Robbie Collin"
    },
    {
      "text": "Each new installment to this franchise has felt better than the last. And somehow, Guardians of the Galaxy Vol. 3 is the best yet.",
      "author": "Rachel Leishman"
    },
    {
      "text": "... The last instalment of James Gunn’s ribald and outrageously tender MCU series is all about the difficulty of being understood.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "A largely breezy comedy that perfectly counterpoints the po-faced intrigues of the Dune saga while delivering a similarly high level of visual expertise and mastery.",
      "author": "Damon Wise"
    },
    {
      "text": "Bright, gorgeously rendered spectacle and these misfits’ unique brand of witty banter buoy a meaningful tale centered on family, fidelity and friendship that doesn’t just feel earned, but also profound.",
      "author": "Courtney Howard"
    },
    {
      "text": "The Guardians appeal because their hard-won bonds feel real, even within the confines of the outsized MCU and the particular environs the space jerks find themselves in.",
      "author": "Kate Erbland"
    },
    {
      "text": "Guardians 3 is a cheerful goodbye to many of the studio’s best heroes, who somehow managed to get through an entire series without being ruined by the larger superhero universe they inhabit. For Marvel, that’s both a win and a problem.",
      "author": "David Sims"
    },
    {
      "text": "This sci-fi/action/comedy still succumbs to a few of the MCU issues of late—bloated runtime, things-go-boom finale, too many characters—but there’s a creativity to the filmmaking, dialogue, and performances that modern superhero movies often lack.",
      "author": "Brian Tallerico"
    },
    {
      "text": "The success of Guardians of the Galaxy: Volume 3 proves that it’s still possible for Marvel movies to hit and hit hard after more than 30 films, but also that it’s getting harder to pull that trick off.",
      "author": "William Bibbiani"
    },
    {
      "text": "An angrier, noisier, and sadder turn for the MCU, with Gunn straining for emotional manipulation as he makes his usual mess of things in the comic book realm.",
      "author": "Brian Orndorf"
    },
    {
      "text": "James Gunn closes out his four-part trilogy with a triumph: a big, scrappy mix of humour and terror boasting a heart as big as Drax.",
      "author": "Helen O'Hara"
    },
    {
      "text": "A great final chapter for the Guardians. This movie brought back the feels of when I watched Avengers: Infinity War/Endgame. It'll play with your emotions, a lot. Would have liked to see more of High Evolutionary but he's a great addition to the film.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a heartfelt celebration of imperfection that welcomes everyone into the film's titular found family.",
      "author": "Caitlin Chappell"
    },
    {
      "text": "Its epic performances, scope, & soundtrack cement this gem as one of the MCU's best. When I think of Guardians of the Galaxy Vol. 3 and the MCU, I think of Michael Corleone in The Godfather Part III, \"Just when I thought I was out, they pull me back in.\"",
      "author": "David Gonzalez"
    },
    {
      "text": "This one may be the most unruly and excessive of the trilogy, but it is as sweetly touching as any film with so many slimy, tentacled monsters in it could be.",
      "author": "Nicholas Barber"
    },
    {
      "text": "This Guardians is the most downbeat of the series.",
      "author": "Soren Andersen"
    },
    {
      "text": "Gunn keeps the surprises coming, so audiences are actively engaged throughout, trying to manage multiple storylines and the ever-changing loyalties between characters.",
      "author": "Peter Debruge"
    },
    {
      "text": "The first time a saga has come to a genuine, satisfying and earned conclusion in the history of the MCU.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The second film was fun but couldn’t recapture all of the magic of the first one. By now, that magic has all but disappeared.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Now, as you peruse many a bring your tissues! review of Vol. 3, let me offer some counter-programming: this movie is hilariously gross, in a horror-comedy sort of way.",
      "author": "Brady Langmann"
    },
    {
      "text": "Guardians of the Galaxy Vol 3 is a farewell to the franchise (at least from Gunn’s perspective, as he’s since hopped over to DC), that’s really a reminder that they always represented some of the very best Marvel has to offer.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "The movie wears you down as much as it wears you out. It feels earnest in its mega-budget cringe, an expression of Gunn's sensibility as much as a play to appease stockholders.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Making a sincere summer blockbuster that’s one of Disney’s major franchise machines is no simple task, and yet here we are with a group of a-holes that we truly care about. It’s been a wild ride, but they managed to pull it off once more with feeling.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "A bursting-at-the-seams adventure that, minor missteps aside, reminds viewers why this ragtag crew remains one of the MCU’s highlights.",
      "author": "Nick Schager"
    },
    {
      "text": "Even though the plot has a bit too much going on, some of the humor feels stale, and Adam Warlock was woefully underused, the cast’s incredible chemistry and James Gunn’s soulful style remain unlike anything else in the MCU.",
      "author": "Joshua Yehl"
    },
    {
      "text": "“Guardians of the Galaxy Vol. 3” is an overall fun, exciting and emotional ending to what has been a consistently delightful trilogy within the MCU.",
      "author": "Lauren LaMagna"
    },
    {
      "text": "Overlong, yes, and finally reaching for an importance and emotional closure (perhaps inspired by Gunn’s own emotional corporate redemption) that it doesn’t quite encompass... But it’s still spectacular, spirited and often funny.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Gunn’s obvious love for these characters has been the trilogy’s consistent and undeniable saving grace. And he notably doesn’t sell out that love as he brings those characters all to a conclusion.",
      "author": "Justin Chang"
    },
    {
      "text": "A boisterous and often emotional sequel that feels very much like a true conclusion.",
      "author": "Brian Lowry"
    },
    {
      "text": "An undeniably emotional experience that highlights James Gunn's strengths as a storyteller, and while it suffers from all the same shortcomings as other MCU fare, it sends the series out on a high note.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 mixes Gunn's usual wacky action and laugh-out-loud humor with a grounded, emotional story to create something special.",
      "author": "Molly Freeman"
    },
    {
      "text": "This is how you do a trilogy. It's the perfect ending. And the perfect new beginning. Every Guardian is allowed to complete their arc in a way that feels meaningful and impactful. James Gunn has done it again.",
      "author": "Tessa Smith"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is, in some ways, the strongest of its trilogy, but it suffers from being too much.",
      "author": "Nicole Ackman"
    },
    {
      "text": "[Gunn has] created a movie as audacious and surprising as the first one, but in newer, more confident and mature ways. Like the original it simultaneously makes you laugh, makes you cry, and makes you cheer. Did I mention crying?",
      "author": "Germain Lussier"
    },
    {
      "text": "This edition largely succeeds like the other ones, thanks to the chemistry of the main ensemble, who have grown into their characters with relaxed ease. The interplay among them is frequently delightful.",
      "author": "Frank Scheck"
    },
    {
      "text": "A big, silly and disarmingly big-hearted film which makes the most of what made this film series one of the most loved in the franchise. A fond and fantastic farewell.",
      "author": "Linda Marric"
    },
    {
      "text": "It’s still a funny movie with some cool action scenes and a lot of nonsense going on, all glued together by this really powerful emotional core.",
      "author": "Mike Ryan"
    },
    {
      "text": "James Gunn lets his core cast grow and evolve, finding a fitting ending to his trilogy that may not appeal to everyone, but feels as honest as anything Marvel Studios has ever released.",
      "author": "Evan Dossey"
    },
    {
      "text": "It definitely feels like a Guardians movie should - an overall emotional farewell. But Gunn turned up the volume the next level - and not necessarily in a good way. More like on deaf ears.",
      "author": "Christie Cronan"
    },
    {
      "text": "An uneven, sporadically emotional conclusion to the trilogy.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Guardians of the Galaxy is a knockout, an impeccable send-off. It’s everything you’d want from such a film; emotional, awe-inspiring, funny and surprisingly, life-affirming",
      "author": "Maria Lattila"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 isn’t just the ideal sendoff for this group, it’s the best MCU film in years, and a reminder of how much fun and moving the Marvel Cinematic Universe can actually be after film-after-film of recent disappointments.",
      "author": "Ross Bonaime"
    },
    {
      "text": "Guardians of the Galaxy Vol 3 proves to be a brilliant end to a brilliant trilogy, which now can be considered as the MCU's strongest.",
      "author": "Ian Sandwell"
    },
    {
      "text": "Third time’s a charm for everyone’s favourite band of cosmic reprobates as the Guardians return for a threequel that’s pleasingly focused and has a dark and demented heart.",
      "author": "Kevin Maher"
    },
    {
      "text": "Rocket is the heart of Guardians of the Galaxy Vol. 3, and the Guardians of the Galaxy are the heart and soul of the MCU. James Gunn has finished the trilogy on his terms, surprising and prioritizing emotion over everything else. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "Despite its issues — including a hyperactive third act, groan-worthy humor in spurts, and a few too many indulgent look-cool-for-the-camera moments — Guardians of the Galaxy Vol. 3 is far and away the best Marvel movie since Avengers: Endgame.",
      "author": "Jon Negroni"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is a heartfelt and earnest conclusion to the trilogy. While some of James Gunn’s writing can be hit-or-miss, Vol.3 delivers on an emotionally high-stakes story that keeps you invested and entertained throughout.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is an emotional goodbye to friends from James Gunn that brought me to tears on more than one occasion.",
      "author": "Joey Magidson"
    },
    {
      "text": "The film undermines its initial sense of intimacy and momentum with a stop-and-start story structure that by and large exists to make as much room as possible for its characters’ banter.",
      "author": "Greg Nussen"
    },
    {
      "text": "Guardians of the Galaxy Vol. 3 is an emotional, action-packed, ear-pleasing space opera that hits all the right beats. The Guardians have never looked this good.",
      "author": "Matt Rodriguez"
    }
  ],
  "release_year": 2023,
  "duration": 150,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action",
    "Fantasy",
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "In Marvel Studios \"Guardians of the Galaxy Vol. 3\" our beloved band of misfits are looking a bit different these days. Peter Quill, still reeling from the loss of Gamora, must rally his team around him to defend the universe along with protecting one of their own. A mission that, if not completed successfully, could quite possibly lead to the end of the Guardians as we know them.",
  "popularity": 9.4,
  "poster_url": "https://image.tmdb.org/t/p/original/r2J02Z2OpNTctfOSN1Ydgii51I3.jpg"
}