{
  "movie_name": "Halloween",
  "movie_id": "1009113-halloween",
  "total_reviews": 80,
  "reviews": [
    {
      "text": "What differentiates Halloween from its worst copycats, though, is that its narrative decisions were made because they made sense for its characters, and not because they were considered staples of the genre.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "It’s left largely to the cast to lend the film personality, which they do in spades: Jamie Lee Curtis’s casting was almost accidental (Carpenter wanted someone else) but the film might not have worked at all without her grounding, relatable presence.",
      "author": "Tom Huddleston"
    },
    {
      "text": "If he is the Boogeyman, the Reaper, Death, she is the counterforce sharing some of his characteristics, but only using them for good. Unlike Michael, who is mad by societal terms, but exhibits no emotion, Laurie is emotional, and violence affects her.",
      "author": "Sarah Vincent"
    },
    {
      "text": "...  a beautifully-made made picture by a director who brings a visual intelligence to a genre that was so often reduced to hack directors and gimmicks in place of storytelling.",
      "author": "Sean Axmaker"
    },
    {
      "text": "The greatest slasher film of all time.",
      "author": "Howard Waldstein"
    },
    {
      "text": "There's nothing like Carpenter's original...",
      "author": "Brian Rowe"
    },
    {
      "text": "A favorite of both the Film Comment set and the Fangoria crowd because, at heart, it’s a minimalist art film.",
      "author": "Sean Burns"
    },
    {
      "text": "Even 40 years later, this proves to be a timeless classic. Carpenter shows his early greatness at executing a simple, yet frightening, concept with style and excellence. Michael Myers is an icon and it's all because of this original gem.",
      "author": "Cody Leach"
    },
    {
      "text": "The film set the standard for horror and the slasher film genre and is one of the most influential, imitated, and commercially successful independent films in history.",
      "author": "David Gonzalez"
    },
    {
      "text": "Halloween is a cipher that moviegoers, critics, and film scholars have filled in with countless readings.",
      "author": "Brian Eggert"
    },
    {
      "text": "This is meticulously made, with every decision working to craft the stylistic, iconic film many of us hold so dear.",
      "author": "Kristy Strouse"
    },
    {
      "text": "The best moments of Halloween take their lead from its exemplary opening: that iconically spare musical score-cum-leitmotif, and the film's slippery command of perspective.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Carpenter's meticulously crafted film doesn't waste a single second, the gold standard of the slasher genre with its most effective score.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Halloween is still the best slasher in movie history.",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "Episode 13: Raison D'être",
      "author": "Taylor Baker"
    },
    {
      "text": "I can recognize good filmmaking and that's what we have here",
      "author": "Rachel Wagner"
    },
    {
      "text": "Halloween remains one of the most frightening films ever released.",
      "author": "Richard Propes"
    },
    {
      "text": "One of the first, most memorable, and undeniably influential slasher movies of the '70s.",
      "author": "Mike Massie"
    },
    {
      "text": "Aside from the ideas presented by the movie, Carpenter and his team have also crafted a visually rich and well-paced thriller that provided the framework for all the future slasher films",
      "author": "Ed Travis"
    },
    {
      "text": "The quintessential popcorn horror film, a thrill ride with few equals.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "On the one hand, the script needs work. On the other, the great technical achievements manage to give the story consistency and to repeatedly scare viewers. The end result is one of those attractive American B-movies. [Full Review in Spanish]",
      "author": "Augusto Martínez Torres"
    },
    {
      "text": "Not just the gold standard for American horror, but one of the greatest achievements in cinematic history.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Halloween is the ensuing American nightmare. It's the national boogeyman.",
      "author": "Michael Roffman"
    },
    {
      "text": "Carpenter's 1978 slasher classic has inspired a million imitations as well as sequels, but few that demonstrate so clearly that a disreputable genre movie can also be a pure, rigorous work of art.",
      "author": "Jake Wilson"
    },
    {
      "text": "In horror, the jack-in-the-box scare... is the quickest way to get a scream, but the still shocks... are the ones that linger with you. \"Halloween\" has them both, but it specializes in the second.",
      "author": "Jason Zinoman"
    },
    {
      "text": "Four decades on, Halloween remains a tenacious - if messy - exercise in atmospheric thrills.",
      "author": "Shaun Munro"
    },
    {
      "text": "...most compelling as a metaphorical manifestation of Laurie Strode's sexual fears.",
      "author": "Josh Larsen"
    },
    {
      "text": "What's crucial isn't that Laurie survives because she's the only virgin; it's that she's the only virgin and still almost doesn't survive.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "Still creepy as hell.",
      "author": "Aja Romano"
    },
    {
      "text": "Filmmaker Carpenter certainly does an effective job of immediately drawing the viewer into the proceedings...",
      "author": "David Nusair"
    },
    {
      "text": "The horror genre can often (rightfully) be maligned. Many of the films within the genre are cheap exploitation films, whose filmmakers care more about monetary return than crafting a great movie.",
      "author": "Niall Browne"
    },
    {
      "text": "You'll likely be full appreciative of just how stunning a movie Halloween is.",
      "author": "Andrew Pollard"
    },
    {
      "text": "Narratively anemic - but earns its hosannas primarily in terms of atmosphere and performances, both verging on brilliant.",
      "author": "Gregory Weinkauf"
    },
    {
      "text": "A movie that laid the foundation for slasher films and also created one of the most legendary film history psychopaths, Michael Myers. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Why Halloween works is because even in its minute flaws, there's an inherent charm to the basic effectiveness and fundamental workmanship on display & it's hard to say that about many films who have tried to follow in its footsteps ever since.",
      "author": "Heather Wixson"
    },
    {
      "text": "Carpenter obviously knows the genre well and he builds a properly terrifying atmosphere through his well-paced direction. It's an effective entry for its intended market.",
      "author": "Ron Pennington"
    },
    {
      "text": "Sets the standard for slasher films and horror in general...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Halloween still remains the greatest horror film of all time.",
      "author": "Jeff Beck"
    },
    {
      "text": "Still relevant. Still scary. Make a date on Halloween night to witness cinema's scariest Michael Myers (unless you've seen The Love Guru) causing carnage on the big screen.",
      "author": "Ben Rawson-Jones"
    },
    {
      "text": "[A] simple but horribly effective low-budget suburban horror ...",
      "author": "Alan Jones"
    },
    {
      "text": "Well worth another look on the big screen.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Made on a tiny budget of $300,000, and shot in only 20 days, Halloween is one of the most influential, imitated, and commercial indies in American film history.",
      "author": "Emanuel Levy"
    },
    {
      "text": "... if there's one John Carpenter film which is a must-see, it's Halloween.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "First Michael Myers slasher fest isn't for kids.",
      "author": "Charles Cassady"
    },
    {
      "text": "A seminal slasher that gets better with age.",
      "author": null
    },
    {
      "text": "... except for its shamelessly (and irresistibly) zingy music score (by the director), Halloween achieves its considerable power almost entirely through visual means.",
      "author": "Richard T. Jameson"
    },
    {
      "text": "To call Halloween merely brilliant isn't giving it enough credit. As a horror film and as a historical milestone that single-handedly shaped and altered the future of an entire genre, it's downright transcendent.",
      "author": "Dustin Putman"
    },
    {
      "text": "Who could have predicted that the low-budget pic Halloween would have a profound influence on an industry, not to mention on the concept of Halloween itself?",
      "author": "Mike Emery"
    },
    {
      "text": "Virtually perfect. It is the one horror film that I would beg each and every lover of movies to watch, if I could pick only one.",
      "author": "Tim Brayton"
    },
    {
      "text": "The movie itself is repressed; Hitchcock would have admired the way Carpenter artfully avoids explicit bloodshed.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The film hits us at a level deeper than most slasher films, and even as we are entertained by it, we are drawn in by its powerful suspense and implications.",
      "author": "Felix Gonzalez Jr."
    },
    {
      "text": "After a promising opening, Halloween becomes just another maniac-on-the-loose suspenser.",
      "author": "Variety Staff"
    },
    {
      "text": "Regardless of how silly you think it all is, this will have you scared witless by the time the end credits roll; low budget horror hog heaven.",
      "author": "Chris Hewitt (UK)"
    },
    {
      "text": "John Carpenter's 1978 tour de force, perhaps the most widely imitated film of the 70s.",
      "author": "Dave Kehr"
    },
    {
      "text": "Perhaps not quite so resonant as Psycho to which it pays due homage, but it breathes the same air.",
      "author": "Tom Milne"
    },
    {
      "text": "If Donald Pleasance tells you something is important, you should listen to him.",
      "author": "Leo Goldsmith"
    },
    {
      "text": "One of the best horror films ever made. John Carpenter deserves a medal for his effective build-up of suspense, his knack for casting and his sensationally-scary Michael Myers!",
      "author": "Caffeinated Clint"
    },
    {
      "text": "Halloween brilliantly uses its widescreen frame, a lot of hand-held camerawork, and scary foreground and background action.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "One of the scariest movies ever made.",
      "author": "Chuck O'Leary"
    },
    {
      "text": "Halloween is an absolutely merciless thriller, a movie so violent and scary that, yes, I would compare it to Psycho.",
      "author": "Roger Ebert"
    },
    {
      "text": "One of the first and the flat-out best of that ghetto of the horror film genre, the slasher movie.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "It's hard to get behind a main character who's so unexciting. But maybe Michael Myers is the real main character. In which case, mission accomplished: I'm freaked out.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Even after repeated viewings, Carpenter's minor masterpiece holds up as a staunchly effective thriller that will always stand head and shoulders above the cinematic progeny it spawned.",
      "author": "James Kendrick"
    },
    {
      "text": "It's freaking scary. After a recent viewing, I was charged with going through the house and turning on all the lights.",
      "author": "Mark Robison"
    },
    {
      "text": "Since there is precious little character or plot development to pass the time between stalking sequences, one tends to wish the killer would get on with it.",
      "author": "Gary Arnold"
    },
    {
      "text": "very possibly no other seminal seventies film--not The Godfather, not Star Wars, perhaps not even Jaws--has had a greater influence on popular culture.",
      "author": "Walter Chaw"
    },
    {
      "text": "A real trick and treat. Genuinely creepy stuff.",
      "author": "Gerry Shamray"
    },
    {
      "text": "They should have broken the mold when they released Halloween, for when it comes to escaped-maniacs-on-the-loose films this one's the real deal.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Effective little thriller, but about as far from a great classic as you can get.",
      "author": "Ken Hanke"
    },
    {
      "text": "Arguably, the greatest horror film of the past thirty years.",
      "author": "David Grove"
    },
    {
      "text": "One of the more successful indie forays into the slasher/horror film genre.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The most significant triumph Halloween achieves is measured by the bulk of films that follow and emulate it.",
      "author": "Rumsey Taylor"
    },
    {
      "text": "flawless for what it is: a completely immersive, visceral dynamo of stylistic belly-jiggling and spine-shivering.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Halloween remains untouched -- a modern classic of the most horrific kind.",
      "author": "James Berardinelli"
    },
    {
      "text": "If you've only seen it on network television or it's been more than a few years, do yourself a favour and rediscover this one soon.",
      "author": "Scott Weinberg"
    },
    {
      "text": "It's boring. It's not scary. There. I said it.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Halloween (1978) is a genuinely scary, stylistic and tasteful, extremely well-crafted slasher/horror classic from young film director John Carpenter",
      "author": "Tim Dirks"
    },
    {
      "text": "Responsible for jump-starting Jamie Lee Curtis's career, this one so thoroughly and thoughtfully exploited American angst that it's no wonder we had to sit through a slew of derivative slasher flicks for the better part of the next decade.",
      "author": "Bryant Frazer"
    },
    {
      "text": "Considered by many to be a modern horror classic, Halloween succeeds through simplicity.",
      "author": "Norm Schrager"
    },
    {
      "text": "Perfect entertainment for the night of October 31st in any year.",
      "author": "Keith H. Brown"
    }
  ],
  "release_year": 1978,
  "duration": 91,
  "genres": [
    "Holiday",
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "On a cold Halloween night in 1963, six year old Michael Myers brutally murdered his 17-year-old sister, Judith. He was sentenced and locked away for 15 years. But on October 30, 1978, while being transferred for a court date, a 21-year-old Michael Myers steals a car and escapes Smith's Grove. He returns to his quiet hometown of Haddonfield, Illinois, where he looks for his next victims.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/wijlZ3HaYMvlDTPqJoTCWKFkCPU.jpg"
}