{
  "movie_name": "Hereditary",
  "movie_id": "hereditary",
  "total_reviews": 384,
  "reviews": [
    {
      "text": "Hereditary is insane without being absurd or campy, or calculated in its provocation. Is it a masterpiece? I think it is.",
      "author": "John Serba"
    },
    {
      "text": "Where Hereditary truly impresses is in its setting-construction, in the unhurried building of one creepy atmosphere, in the attention to detail and characterisation.",
      "author": "Diana Tuova"
    },
    {
      "text": "A precision-tooled, dread-inducing atmosphere that refuses to loosen its grip.",
      "author": "Jeremy Aspinall"
    },
    {
      "text": "Aster reminds us that when grief becomes foreboding, there’s no escaping the boxed burdens of emotional terror.",
      "author": "Brittany Patrice Witherspoon"
    },
    {
      "text": "Toni Collette gives an all-time performance in this family melodrama that endlessly rewards repeat viewings. Aster has delivered one of the best contemporary horror films with only his first feature.",
      "author": "Joe Lipsett"
    },
    {
      "text": "One of the horror genre's greats.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "Fine performances, a strong directorial debut, and soaked in the strategically menacing score by Colin Stetson, “Hereditary” slowly pulls you in before giving your nerves and your senses a good working over.",
      "author": "Keith Garlington"
    },
    {
      "text": "Audiences expecting run-of-the-mill horror will be shocked out of their moviegoing complacency early on.",
      "author": "Brian Eggert"
    },
    {
      "text": "Ari Aster's absurdly accomplished debut is the best horror movie of the year so far.",
      "author": "Olly Richards"
    },
    {
      "text": "Pawel Pogorzelski's cinematography and Colin Stetson's score craft a visually and aurally ominous atmosphere that always hints and builds towards the ultimate evil reveal.",
      "author": "Jim Rohner"
    },
    {
      "text": "So dark and so disturbing.",
      "author": "Emma Wolfe"
    },
    {
      "text": "The film's chilling lesson is timely.",
      "author": "Lena Wilson"
    },
    {
      "text": "The open-ended stakes of these genre experiments are rebellious at a time when horror movie messaging can feel so heavy-handed.",
      "author": "Jo Livingstone"
    },
    {
      "text": "Without a doubt, Hereditary really dug its hooks into me.",
      "author": "Fletcher Powell"
    },
    {
      "text": "A complete assault on your mind, body, and soul that will leave you feeling battered and broken.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "Part of the fun, if \"fun\" is even the right word for such an upsetting movie, comes from the uncertainty over what kind of horror show this is, exactly.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Hereditary is a pitch black exploration of family dynamics and the fallout of dark supernatural secrets.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "In the cruel, assured hands of writer-director Ari Aster, Hereditary comes off as an exemplary mood piece.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "Hereditary becomes more and more frightening, submerging the viewers in horror rather than splashing them with occasional waves.",
      "author": "David Bax"
    },
    {
      "text": "...if you keep your expectations within reasonable control, you'll be rewarded with a tense and atmospheric-if not all that terrifying-experience...",
      "author": "Dennis Harvey"
    },
    {
      "text": "It shouldn't be a huge surprise to see Toni Collette give a great performance. However, the things she does here are unlike anything else that she's ever done in her career.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "Things take a while to get to the occult and bloody, but when they do it's a quite visceral and grim awakening.",
      "author": "Tom Meek"
    },
    {
      "text": "Toni Collette shines in a near horror masterpiece that stumbles in the final act as it ultimately shows its hand.",
      "author": "Jason Fraley"
    },
    {
      "text": "I found myself laughing at, not with, Hereditary's hammiest horror moments, culminating in a truly awful ending that spells everything out and yet is still riddled with plot holes big enough to bury a desecrated body in.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "Hereditary doesn't punch viewers in the gut for quite a while, gently poking them instead until the slightest twitch of a finger feels like the cruelest of punchlines.",
      "author": "Matt Cipolla"
    },
    {
      "text": "This is a film that friends will dare one another to watch and then regret it instantly, and it takes a certain masochistic streak to enjoy.",
      "author": "Alex Hudson"
    },
    {
      "text": "The testament of the effectiveness of the story and macabre nature of Hereditary really manifests long after you leave the theater.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Family drama about loss and tragedy folded into supernatural horror; hints and nods and few overt statements; an exquisite mix of skin-peeling tension, heart-pounding dread, jump scares, and gore. Hereditary left me a broken, gooey mess by the end.",
      "author": "Brent McKnight"
    },
    {
      "text": "Not only is Hereditary the slowest of slow burns this side of a Michael Mann film, it is also a near-masterpiece of horror filmmaking.",
      "author": "Damond Fudge"
    },
    {
      "text": "Hereditary is a super effective slow burn shocker, a perfect blend of art house sensibilities and transgressive surreal horror that coalesces into a modern classic of the genre.",
      "author": "Dan Tabor"
    },
    {
      "text": "This was so stupid to me... Absolute, utter nonsense.",
      "author": "Andrew Galdi"
    },
    {
      "text": "I found it interesting enough.",
      "author": "Avaryl Halley"
    },
    {
      "text": "[A] film so deeply unsettling, so horrifying on an almost cellular level.",
      "author": "Dan Scully"
    },
    {
      "text": "It's creepy as anything you're apt to see in recent memory and will haunt you long after you see it.",
      "author": "Paul Salfen"
    },
    {
      "text": "There have been great screamers before, but Collette takes it to the next level with a guttural howl from the depths of her putrefying soul.",
      "author": "Chris McCoy"
    },
    {
      "text": "The film successfully invokes true terror that lingers long after the projector flickers dark.",
      "author": "Cameron Meier"
    },
    {
      "text": "What Hereditary is most successful at, though, is capturing the constricting way death is inevitable, be it family members or your own...",
      "author": "Katey Stoetzel"
    },
    {
      "text": "Ari Aster's horror directorial debut is a masterclass in crafting unbearable tension and suspense that lay the foundation for terrifying conclusion audiences aren't soon to forget.",
      "author": "Jay Krieger"
    },
    {
      "text": "[\"Hereditary\"] falters at the finish line. Not only are the last 20 minutes desperate undisciplined, but the actions are screen don't tingle the spine.",
      "author": "Jeff York"
    },
    {
      "text": "Hereditary is a screamish plunge into nightmarish insanity. It is absolutely bizarre at times, spine tingling at others, and loaded with bonkers terror in between",
      "author": "Chris Sawin"
    },
    {
      "text": "'Hereditary' features fantastic performances, with Toni Collette giving her all. The film is absolute nightmare fuel and will make your heart pound almost the whole way through.",
      "author": "Melissa Hannon"
    },
    {
      "text": "It's shocking that this is a debut. It's assured in its style and meticulously plotted. Repeat viewings will be rewarded.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Steeped in profound horrors tied to grief, guilt, resentment and mental illness, Hereditary tethers itself to real-world trauma before lifting off into the supernatural.",
      "author": "Josh Goller"
    },
    {
      "text": "'Hereditary' is a real wonder, insane and disturbing, and continues to confirm the decade that we live as one of the most creative and stimulating in the history of horror movies. [Full Review in Spanish]",
      "author": "John Tones"
    },
    {
      "text": "An impressive calling card that writer-director Ari Aster can whip out at future studio pitches.",
      "author": "Matt Brunson"
    },
    {
      "text": "It can only be confined within the limits of TERROR. One of those written in capital letters, one of those which marks and makes history. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Hobbled by a lack of cohesive narrative execution, Aster has ultimately made a very strong debut that shows a great talent for filmmaking, but one that would do with some refinement on the script level.",
      "author": "Rob Dean"
    },
    {
      "text": "Even before their personal phantoms make an aberrant entrance, it's obvious something is off with the Graham family, whose mental history isn't, to put it kindly, as robust as it could be.",
      "author": "Andiee Paviour"
    },
    {
      "text": "Hereditary is a meticulous, intricate examination of emotional trauma, a hyperbolic look at inherited mental illness and one of the most beautifully horrific films of all time. Also, the last bit will mess you up or make you laugh, so either way you win.",
      "author": "Ryan Syrek"
    },
    {
      "text": "What gives Hereditary an edge over other similarly structured titles is its strength as a family drama, and the specific anxieties Aster taps into.",
      "author": "C.J. Prince"
    },
    {
      "text": "Aesthetically warped, immensely unnerving and miraculously manages to exceed expectation by flourishing out of genre trappings into a pioneering genre masterpiece. One of the films of the year.",
      "author": "Daniel Goodwin"
    },
    {
      "text": "A truly great work of horror, an explosive and terrifying tale of shared and inherited trauma that is as emotionally devastating as it is deeply disturbing.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The movie does terrify in moments, but its movement from humanistic horror to inexplicably supernatural in the last third feels unsatisfying.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Less a horror film and more a psychological attack on the senses, unnerving its audience and evidently delighting itself in doing so",
      "author": "Peter Gray"
    },
    {
      "text": "Aster drives home the horrible ways mental health can come to bear on a family, and how hereditary cycles of psychological horror repeat themselves across generations.",
      "author": "C.H. Newell"
    },
    {
      "text": "Hereditary takes complete hostage of your emotions, and won't let go until the credits roll.",
      "author": "Kimberley Elizabeth"
    },
    {
      "text": "Hereditary pushes the horror genre to a different extreme than the one we're used to, reminding us of the immense gulf between mere \"scary\" and \"horrifying\", and the result is like nothing you've ever seen.",
      "author": "Sam Langford"
    },
    {
      "text": "Hereditary is one of the best horror films that is brought to life by a riveting performance by Toni Collette.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Ari Aster makes his feature debut with Hereditary, and he enters the horror genre like a seasoned pro. His greatest strengths in storytelling also make his film incredibly difficult to watch.",
      "author": "Preston Barta"
    },
    {
      "text": "The film takes the saying \"skeletons in the closet\" literally, giving us a genuinely terrifying portrait of a family's breakdown.",
      "author": "Poulomi Das"
    },
    {
      "text": "Toni Collette dominates the film like great actresses should.",
      "author": "Wesley Lovell"
    },
    {
      "text": "How do we keep our wits about is when all that is left behind for us is chaos, confusion and fear? ( ... ) it is generational trauma that is the Big Bad for a new generation.",
      "author": "Cate Young"
    },
    {
      "text": "... everything about Hereditary is pitch perfect, from the casting to the cinematography to the killer score.",
      "author": "Amie Simon"
    },
    {
      "text": "There's a lot going on and a lot that's been used before in \"Hereditary\". Ari Aster pushes scenes as far as they can possibly go. Yet it works. Toni Collette is its heart; she's superlative, her face moving from utter terror to delight to pure evil joy.",
      "author": "Sarah Cartland"
    },
    {
      "text": "It's that patient, character-driven, tension-building, psychological horror that firmly plants itself into your mind, and just refuses to let go.",
      "author": "Marianna Neal"
    },
    {
      "text": "Be warned, this slow-burn film is seriously spooky. But expect prickling terror rather than jump-out-of-the-seat scares, although there is one sudden shock to make you gulp.",
      "author": "Jason Best"
    },
    {
      "text": "Collette's performance as a nurturing matriarch to eventual untethered woman is one of the finest of her career.",
      "author": "Deborah Cornelious"
    },
    {
      "text": "Toni Collette delivers a soul-shattering performance in Hereditary that reminds us how much sacrifice parenthood is and how deeply parents can scar their children, utterly beyond repair.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "As a portrait of a family split by tragedy, it's a masterpiece of almost unbearable tension. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "Besides references to ritualistic patterns and symbols, there are scary, furtive appearances and characters airing guilt and resentment in an oppressive environment.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Hereditary literally demonizes a transgender spirit.",
      "author": "Li Lai"
    },
    {
      "text": "Hereditary, while struggling a bit at the end, offers a wholly original horror tale from newcomer Ari Aster.",
      "author": "Amanda Sink"
    },
    {
      "text": "This is the rare horror movie with an earned shock so unexpected and horrific that it left this veteran fan -- whose eyeballs have ingested literally thousands of screen dismemberments, decapitations and mutilations -- aghast.",
      "author": "John Beifuss"
    },
    {
      "text": "Hereditary combines domestic drama and occult horror for a one-two punch that still has me knocked to the ground.",
      "author": "Alachia Queen"
    },
    {
      "text": "It's pure aesthetic the whole way through, and, certainly, for the first 30-40 minutes the genuinely unsettling atmosphere is brilliantly sustained.",
      "author": "PJ Nabarro"
    },
    {
      "text": "El legado del diablo merece ser reconocida como una de las propuestas de horror más crudas y efectivas que se han visto en este siglo.",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "The characters in  are immersed in the story in a tragic and unappealable manner, like miniature figures in a dollhouse, unable to avoid or change their destiny. [Full review in Spanish]",
      "author": "Pablo Fernandez"
    },
    {
      "text": "There are images in HEREDITARY that cannot go unseen, but humanity is discovered in the awful truths that unravel.",
      "author": "James Clay"
    },
    {
      "text": "Hereditary arrives like a white-hot dagger driven directly into the base of the viewer's skull. It's not merely \"good\"; it's downright traumatic.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "Hereditary is a kitchen-sink drama disguised as a horror film, employing the intensity of both genres to full effect.",
      "author": "Di Golding"
    },
    {
      "text": "You really think Hereditary's bounty of symbolism will amount to something profound, until the third act when you realize it's abandoned all of its commentary for typical horror fare.",
      "author": "Angela L. Harmon"
    },
    {
      "text": "Hereditary can be difficult to watch, but for those who are willing and able to take this ride, it is likely to offer hours of discussion among friends and maybe even a few nightmares of your own.",
      "author": "Kt Schaefer"
    },
    {
      "text": "Hereditary is a disturbing descent into madness that highlights all the best parts of the horror genre.",
      "author": "Molly Henery"
    },
    {
      "text": "This is a film that pivots from quiet grief to sickening, nightmare-fuel imagery without ever losing an inch of ground-building tension.",
      "author": "Matt Oakes"
    },
    {
      "text": "An outstandingly horrifying achievement from a debut filmmaker, Hereditary is a classic in the making, built on rock-solid, terrifying, atmospheric terror.",
      "author": "Cameron Frew"
    },
    {
      "text": "A dark and dismal beast of a film that is most likely going to leave you curled up in your seat by the end of it.",
      "author": "Trace Thurman"
    },
    {
      "text": "Scared the bejesus outta me.",
      "author": "Bob Chipman"
    },
    {
      "text": "Hereditary isn't the next Exorcist, but it's not a bad start. Maybe the next generation will be a little better.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "From its opening frames, Hereditary digs its claws into you and doesn't let go.",
      "author": "Clint Worthington"
    },
    {
      "text": "Ari Aster has crafted a ghost story that brings hair on the back of your neck standing up-type chills. It's an engaging tale of the supernatural anchored by a show-stopping performance from Toni Collette.",
      "author": "Micheal Compton"
    },
    {
      "text": "Hereditary never lets the viewer feel comfortable. The film is full of tiny details that will haunt your waking life long after the end credits roll.",
      "author": "Matt Miller"
    },
    {
      "text": "Hereditary is a numbing experience. It attempts to unsettle, shock and terrify - and it does so mildly well. And yet that seems like the only goal.",
      "author": "Tanner Tafelski"
    },
    {
      "text": "Mental illness rubs up against the occult in Aster's malevolent movie Hereditary, about a mother forced to face her familial fears when her own tyrannical mother passes away.",
      "author": "Aaron Leggo"
    },
    {
      "text": "A deeply unsettling and horrifically disturbing film which will haunt you for a lifetime.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Its sheer hopelessness and tragic consequences are a haunting counterpoint to more traditional horror fare, where Final Girls escape and monsters are unable to win the day.",
      "author": "Tomas Trussow"
    },
    {
      "text": "You can believe the hype, Hereditary is absolutely nuts",
      "author": "Nate Adams"
    },
    {
      "text": "An instant horror classic joining the ranks of Rosemary's Baby and The Exorcist.",
      "author": "Joe Friar"
    },
    {
      "text": "It wasn't just pure gore, it actually messed you up a bit. It made sure you didn't sleep at night.",
      "author": "Justin Brown"
    },
    {
      "text": "There's nothing about this movie that I enjoyed, for two hours and seven minutes...this just isn't my cup of tea...",
      "author": "Brandon Collins"
    },
    {
      "text": "An absolute masterpiece in horror cinema",
      "author": "Ben Rolph"
    },
    {
      "text": "... an assured debut that folds in Shirley Jackson, Rosemary Woodhouse and, for its immersive creepiness, 'Seance on a Wet Afternoon' ... Collette fearlessly explores Annie's primal fears, at times contorting her face into hideous mask",
      "author": "Glenn Lovell"
    },
    {
      "text": "Hereditary terrifies from its first unnerving moments to its bombastic, nerve-shredding finale. This is by far the most affecting and effective horror film of the year.",
      "author": "James Marsh"
    },
    {
      "text": "Its trippy turn at first feels refreshing, then goofy: the fatalism and sense of doom underpinning the film are very hard to take as seriously.",
      "author": "Steve Erickson"
    },
    {
      "text": "It touches on annihilating despair, and asks its cast to lower themselves into an emotional meat grinder in a way that the film, I say, does not earn.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "But it's also genuinely horrific in a way that so many supposed horror films are not.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "A genuinely scary movie, delectably unsettling.",
      "author": "Lisa Nesselson"
    },
    {
      "text": "From start to finish, in its moments of ample fear and to those like its divisive ending that seem to project a perplexing joy, the film never affords its audience a second of comfort.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Hereditary ramps up the horror and anguish to points which at times feel almost unbearable.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "I loved that this movie scared me without resorting to [jump scares].",
      "author": "Dan Murrell"
    },
    {
      "text": "It builds the elements really beautifully, it orchestrally builds. You're really watching a family drama also with horror elements, then they really elevate.",
      "author": "Roth Cornet"
    },
    {
      "text": "There's so much happening that it's difficult to talk too much without full-on spoilers. Just know that the two-hour-plus runtime is airtight.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Hereditary [is] one of the rare enigmatic experiences you'd rather not entirely understand. And I'll be damned if I have to re-watch it to truly get it.",
      "author": "Rahul Desai"
    },
    {
      "text": "Toni Collette spectacularly dominates the film in a pumped-up, emotionally overwrought, deranged performance.",
      "author": "Alexa Dalby"
    },
    {
      "text": "It's an uneasy and visually well-crafted horror exploring our parental fears. It's also a film that, surprise, surprise, has split opinions among audiences and critics.",
      "author": "Robert Daniels"
    },
    {
      "text": "[Hereditary] is a tense picture, but one I found ultimately unfulfilling.",
      "author": "Terence Johnson"
    },
    {
      "text": "Hereditary is terror at its most vile, a film that will unexpectedly creep up on you and haunt you for days.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Be warned, this is indeed a scary movie. Like the recent and much louder A Quiet Place, this is cinema designed to slowly assault your senses and make you look over your shoulder on your way home.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Collette shines brightest... It's the type of rare performance which elevates and transcends the narrative beyond any of its familiarities or limitations -- and its exactly what makes Hereditary and all its disturbing intentions so powerful.",
      "author": "Nicholas Bell"
    },
    {
      "text": "This may be a psychological thriller, but Hereditary features some of the most unsettling imagery of the year that triggers stuff of nightmares.",
      "author": "Rendy Jones"
    },
    {
      "text": "It would be a far cry to claim that Hereditary is perfect,... but as far as debut features go, it is damningly smart and expects more of its audience than is necessary in a market swarmed with uninspired franchise films.",
      "author": "Chloe Leeson"
    },
    {
      "text": "Hereditary draws on the tropes of many different horror genres, which the fully engaged cast manage to help pull off without it all becoming too confusing.",
      "author": "Stephanie Watts"
    },
    {
      "text": "Has moments to wobble the collys, and makes sharp points about motherhood and duty, but as the hysteria mounts the credibility fades.",
      "author": "Alison Rowat"
    },
    {
      "text": "'Hereditary' is unsettling, terrifying, and brutal.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "How do you know when a film doesn't deliver in a particular genre? The audience starts to laugh at scenes that are supposed to be genuinely terrifying.",
      "author": "Rosalynn Try-Hane"
    },
    {
      "text": "The film lives up to this reputation. Yet those calling it the second coming of horror seem to be all too forgiving of the blatant narrative telegraphing and simplistic characterizations of those living outside the nightmare.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "The new horror film \"Hereditary\" is being hyped not only as the scariest movie in years, but as one of the best films of the year. No arguments here.",
      "author": "Tom Santilli"
    },
    {
      "text": "All things considered, Hereditary is the movie to see if you want to feel uneasy, upset, and most of all suspicious of seemingly nice old ladies.",
      "author": "Ferdosa Abdi"
    },
    {
      "text": "Writer/director Ari Aster has clearly studied the greats.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Hereditary feels like an endless drawing out of that queasy, shocking, falling dream sensation, as the ground beneath the Graham family, and the viewer, crumbles.",
      "author": "Andrew Whalen"
    },
    {
      "text": "Aster brings together plenty of brilliant pieces. The harrowed cast does a great job at showing a family breaking down under the pressure of its guilt and grief.",
      "author": "Eve Tushnet"
    },
    {
      "text": "'Hereditary' breaks tradition.",
      "author": "Linda Cook"
    },
    {
      "text": "[Director Ari] Aster's ability to \"coax\" us into this fantasy is surprising: like Annie with her miniatures and reproduction of reality, the director is meticulous and precise in handling audio, time, atmosphere and performances. [Full review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "There is no visual creativity and the ending is more of a joke: the film bites its own tail. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "This movie was created not only to entertain us but forces us to look at ourselves in relation to how we take grief. What makes this movie different from others is that it never relies on jump scares to provoke a reaction.",
      "author": "Anissa Hanley"
    },
    {
      "text": "The horrors are that much more horrible because they emerge from and intensify a chamber drama of family conflict that would be gripping in and of itself. The horror, in other words, has real meaning.",
      "author": "James Kendrick"
    },
    {
      "text": "Toni Collette does some extraordinary work, acting through a series of contorted faces, guttural howls, and despondent line deliveries.",
      "author": "Tim Brayton"
    },
    {
      "text": "Hereditary has top notch acting, a gorgeous look, and some genuinely terrifying moments that linger.",
      "author": "Peg Aloi"
    },
    {
      "text": "As Annie, Toni Collette gives a ferocious performance, one that bounces from defensive to vulnerable, from furious to terrified, in an instant but is never histrionic or cloying.",
      "author": "John McShane"
    },
    {
      "text": "The final act is a master class in swiftly mounting dread, and the climax is both terrifying and deeply unsettling.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "The movie throbs with a relentless underlying terror that is frequently mystifying, sometimes aggravating, and almost always poised to keep the mind engaged in disquieting wonder.",
      "author": "David Keyes"
    },
    {
      "text": "Hereditary seeks to confound by swinging between moments of controlled Kubrick-ian terror and unhinged emotional hysteria.",
      "author": "Dan Jackson"
    },
    {
      "text": "As it builds to a climax, the film takes a wild turn into hell with a bombast that seems unnecessary and undermining. Some viewers may be juiced by something this over-the-top, but I prefer the darker subtlety of a more quiet place.",
      "author": "Loren King"
    },
    {
      "text": "Unfortunately, the weaknesses in its script make Hereditary far from being at the level of the classics and leave it closer to effective, but disposable films like Insidious or The Amityville Horror. [Full Review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "A new contemporary horror classic. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "My disappointment would be less bitter if the first half weren't so strong, and I commend Aster for the effort, especially his direction of actors, all of whom shine.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Like poetry itself. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Hereditary is, despite the influences of classic films that can be detected during its viewing, a work with its own voice, which reinvents the foundations of the genre to deliver something different and absolutely brilliant. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "Put quite bluntly: Hereditary is a fiasco. [Full review in Spanish]",
      "author": "Jaime Fa de Lucas"
    },
    {
      "text": "Hereditary adds itself to a small, but juicy list of films who carefully and patiently create terror for audiences. [Full Review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "Hereditary doesn't let the audience off easily. It's a film designed to have maximum impact.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Manipulatively subtle, it's scary stuff, particularly the gory, grisly, over-the-top finale.",
      "author": "Susan Granger"
    },
    {
      "text": "Toni Collette is flawless.",
      "author": "Andrea Gronvall"
    },
    {
      "text": "Aster never relies on jump scares to provoke a reaction... The supernatural is treated calmly, and it is the normal in fact, that is out of the ordinary.",
      "author": "Aakash Karkare"
    },
    {
      "text": "As the story progresses, there is a perfect overture and poetic synthesis for a story about a family that lives trapped in something that surpasses it... [Full Review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "There is no scenario that ends with you having a pleasant experience watching this film. There is a malevolence about it, an unshakable evilness that penetrates your psyche drop by painful drop.",
      "author": "Rohan Naahar"
    },
    {
      "text": "Despite the Academy's disdain for horror, Collette could win an Oscar for this incendiary performance.",
      "author": "Tim Appelo"
    },
    {
      "text": "One of those films that I didn't love, but nevertheless admired the gumption that led to something so completely bonkers to actually reach the screen.",
      "author": "Stephen Silver"
    },
    {
      "text": "Ari Aster's directorial debut 'Hereditary' is truly an original that moves slowly yet completely and totally terrifies you when you least expect it to.",
      "author": "Reza Noorani"
    },
    {
      "text": "If you are looking to truly and completely get scared, 'Hereditary' will ensure that happens in the best and most unexpected way possible.",
      "author": "Devesh Sharma"
    },
    {
      "text": "The lasting nightmarish effect that [Hereditary] is due to it's strong cinematic elements. [Full Review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "[Director Ari Aster] wisely avoids resorting to cheap scares and incorporates the right amount of exposition without preying upon it and frightening the public just for pleasure. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Ride of pure terror? I've had more terrifying rides on the teacups at the fair.",
      "author": "Deborah Ross"
    },
    {
      "text": "Collette's performance is hairraisingly good.",
      "author": "John Lui"
    },
    {
      "text": "In a genre so driven by convention it's great to see another horror movie so soon after A Quiet Place take a few left turns and deliver the scares we expect by means that we don't...A very effective, cliche-averse chiller.",
      "author": "Jim Schembri"
    },
    {
      "text": "Hereditary speaks with the language of lowbrow horror when it's been setting itself up as something a little classier and a lot more original.",
      "author": "Paul Mount"
    },
    {
      "text": "Hereditary rises above the genre formula with its coolly composed formalism, its deliberate pacing, and its sly psychological manipulation that almost convinces us at certain points that this is more of a domestic drama than a horror movie.",
      "author": "Kong Rithdee"
    },
    {
      "text": "An astonishing performance by Collette as the unhinged parent elevates the scarily nuanced narrative into a league of its own. Hereditary is an emotionally wrenching viewing experience.",
      "author": "Rashid Irani"
    },
    {
      "text": "When it's bad, Hereditary feels like the wrong kind of exploitation flick, one that doesn't inhabit its traumas deeply and so believes a character as beautifully performed as Annie's deserves to be the butt of a cosmic joke.",
      "author": "Walter Chaw"
    },
    {
      "text": "Destined to be a classic...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "It rambles on for more than two hours, thumbing through genre touchstones like a drunk in a video store, serving up the occasional visual that sticks.",
      "author": "J. Olson"
    },
    {
      "text": "Hereditary is a horror film that not only transmits fear - which does provoke it, especially in its last minutes, frankly delirious - but, also, a growing sense of discomfort. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "You've heard it a million times: how horror movies are cliché. This movie is not cliché.... This movie does not rely on jump scares, nor is it predictable.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "It's a skin-prickling slow-boiler that builds like a storm.",
      "author": "Tom Shone"
    },
    {
      "text": "Hereditary is quite the opposite of fun. It seeks only to burden the audience, setting us up to hurt from the very start.",
      "author": "Dom Nero"
    },
    {
      "text": "Probably Toni Collette's best role to date. [Full review in Spanish]",
      "author": "Andrea G. Bermejo"
    },
    {
      "text": "[Toni] Collette is a true force of nature. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "A work that deserves attention and needs to be seen more than once. [Full Review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "Could it do for the genre, as some have claimed, what the likes of The Blair Witch Project and Paranormal Activity once did? Short answer - no.",
      "author": "Matthew Bond"
    },
    {
      "text": "The films strong suits successfully envelop us to witness some of the darkest and most unsettling stories in cinematic history. [Full Review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "[Ari Aster] is too clever for his own good, and late on discards his duty to his story and characters in favour of shocks and effects that feel both familiar and contrived...A film that was brooding and fascinating becomes silly, even risible.",
      "author": "Paul Whitington"
    },
    {
      "text": "An indelible classic.",
      "author": "Hilary A White"
    },
    {
      "text": "Gradually downshifts into generic cliche, abandoning well-mapped psychogeography for psychokinetic silliness and superfluous plot exposition.",
      "author": "Mark Kermode"
    },
    {
      "text": "Watching this movie, I was all like \"Nope...no...you aren't going to do that. Not allowed...No! Stop that! You stop that!!!\" I was scared.",
      "author": "Bob Grimm"
    },
    {
      "text": "Blumhouse with brains.",
      "author": "Ed Whitfield"
    },
    {
      "text": "I was so scared, I was walking down the sidewalk seeing things. So many images in my mind because of this movie...it horrified me, which is what it's supposed to do.",
      "author": "Steph Cozza"
    },
    {
      "text": "But the neatest trick that Hereditary manages is the feeling, especially in that beginning and with its ending, that there's some strange force beyond us, perhaps even beyond this film, just waiting and beholding us...",
      "author": "Brian Gibson"
    },
    {
      "text": "Ari Aster immediately proves himself a deft hand at disorientating his audience, conjuring a quite remarkable piece of unsettling, genuinely nightmarish cinema.",
      "author": "Ross Miller"
    },
    {
      "text": "Hereditary might be regarded as a psychological or supernatural thriller, an insidious ghost story, a literal cult movie, or Rosemary's Baby (1968) after the infant has come of age. On any view, it is a diabolically assured debut.",
      "author": "Anton Bitel"
    },
    {
      "text": "This is the worst best time you'll have at the cinema this year.",
      "author": "Jamie East"
    },
    {
      "text": "The results are horrific, emotionally and aesthetically, and launch a corkscrew spin towards hell.",
      "author": "Matthew Norman"
    },
    {
      "text": "Hereditary is a beautifully shot, brilliantly acted and smartly written supernatural chiller which suggests we are entering a new golden age of the scary movie.",
      "author": "Andy Lea"
    },
    {
      "text": "The best American horror film since The Sixth Sense.",
      "author": "CJ Johnson"
    },
    {
      "text": "Ari Aster’s superb psychological horror plays on one of the most powerful fears of all — the fear of turning into your parents.",
      "author": "Ed Potton"
    },
    {
      "text": "It sidesteps easy interpretation so stylishly that even when it's dangling obvious horror movie tropes in front of us, there's no danger of it being mistaken for a conventional genre exercise.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Aster, who somewhat alarmingly is said to have been inspired by his own family experiences to make this film, announces himself as a serious talent.",
      "author": "Brian Viner"
    },
    {
      "text": "If you let this movie in, you may not be able to get it out.",
      "author": "Alan Cerny"
    },
    {
      "text": "Being blindsided by fright might be fun in the moment, but it's the scares you can see coming that last.",
      "author": "Robbie Collin"
    },
    {
      "text": "I've rarely left a cinema feeling so disappointed.",
      "author": "John Byrne"
    },
    {
      "text": "An instant horror classic - and quite possibly the scariest film of the decade.",
      "author": "Matthew Turner"
    },
    {
      "text": "Hereditary is a hallmark in cinematic filmmaking, and still worth a watch, but the narrative prevents it from living up to its full potential.",
      "author": "Valerie Complex"
    },
    {
      "text": "Aster is clearly a talent to keep an eye on, while Collette deserves some form of awards recognition. Family drama has rarely been so nightmarish.",
      "author": "Garry McConnachie"
    },
    {
      "text": "As a horror film, Hereditary delivers the goods, with crack pacing and a third act of sheer gothic madness.",
      "author": "Margot Harrison"
    },
    {
      "text": "Hereditary may not be as terrifying as the advance hype has suggested but it's a provocative and subtle horror film with layers you don't find in more conventional haunted house tales.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "It's poorly paced, with a making-it-up-as-we-go feel; there's a difference between slow-burn and merely slow, and [director Ari] Aster hasn't grasped it yet.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "What I watched was a pushy, empurpled, same-with-a-twist screamer from the school of Rosemary's Baby.",
      "author": "Nigel Andrews"
    },
    {
      "text": "It's utterly terrifying - but in a way you can't quite put your finger on. Which means you will never, ever shake it off.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "This is serious, glorious, edge-of-your-seat horror.",
      "author": "Hannah Strong"
    },
    {
      "text": "The young American writer-director has made a film that goes to a few places that no horror has previously ventured. And he does so elegantly.",
      "author": "Tara Brady"
    },
    {
      "text": "It's the picture's unrelenting mood of apprehension and anxiety that marks Ari Aster's debut feature as a disturbing, discomforting masterpiece.",
      "author": "Sarah Ward"
    },
    {
      "text": "Will unhinge you on a primal level starting with the hypocrisy of obituaries and the creepiness of dollhouses, and ending with the stresses of modern family life as reality and madness become interchangeable.",
      "author": "Andrea Chase"
    },
    {
      "text": "A raw horror masterpiece from a first-time director that deserves to be mentioned in the same frantic breath as the genre's greats.",
      "author": "Dan Jolin"
    },
    {
      "text": "If there is such a thing as an \"art house horror,\" Hereditary should stand as one of the best examples... [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "What makes it a unique and sublime work are its images, terrifying not because they are macabre of fortuitous, but because they seem to connect with something deep and dark that escapes us completely. [Full Review in Spanish]",
      "author": "Diego De Fez"
    },
    {
      "text": "It's a well-crafted and well-acted classic creepy psychological horror film.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It's definitely going to stick with you for a while.",
      "author": "Sarah Marrs"
    },
    {
      "text": "All-time great Toni Collette performance.",
      "author": "Christy Lemire"
    },
    {
      "text": "To get to the end result of Aster's narrative is to go through an intense storm of chaos all meticulously adjusted to freeze you to the horrors of this family's truth. [Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "As alleged horror films go, this one is about as scary as the Bowery Boys in Spooks Run Wild.",
      "author": "Rex Reed"
    },
    {
      "text": "Hereditary commands you to lean in, watch closely, don't forget the corners and the background, even though you know the monsters are there.",
      "author": "Brooke Corso"
    },
    {
      "text": "Grief has a demonic presence in Hereditary...",
      "author": "Josh Larsen"
    },
    {
      "text": "When our own mental sanity starts failing us...it's really, really cool.",
      "author": "Mark Ellis"
    },
    {
      "text": "One of the best horror films I've seen in a very long time.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Anyone who tells you that Hereditary will leave you with nightmares presumes that you'll actually be able to sleep again - it kept me awake long after I saw it.",
      "author": "Dustin Rowles"
    },
    {
      "text": "It has the nerve to suggest that the social unit is, by definition, self-menacing, and that the home is no longer a sanctuary but a crumbling fortress, under siege from within.",
      "author": "Anthony Lane"
    },
    {
      "text": "A rich, original horror story and astounding performances result in two hours of edge-of-your-seat terror, but the final moments leave the film just short of modern masterpiece territory.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Unnerving film. Paranormal done unlike the usual paranormal film. It's as much about the implosion of a family as it is about the horror that causes the implosion.",
      "author": "Gary Wolcott"
    },
    {
      "text": "I give much due to Aster for his remarkable ability to create atmospherics, establishing a mood of uneasiness and continuing to up the ante.",
      "author": "Al Alexander"
    },
    {
      "text": "By the time the film gets into the home stretch it goes totally off the rails...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "With supernatural elements failing to pay off as window-dressing for a potentially serious broken-family drama, an audience giggling throughout the film's ending is the least of Hereditary's problems.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Truthfully, bits of story may have been borrowed from (horror) classics, but that doesn't mean first-time writer/director Ari Aster doesn't have a parcel of creepy-crawly tricks of his own to display.",
      "author": "John Urbancich"
    },
    {
      "text": "...the film examines how grief clouds judgment and renders us susceptible to manipulation by those who would abuse it for material gain.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Hereditary is a movie to be watched from between your fingers, and to be carried home as a feeling of unease under your skin.",
      "author": "Karen Han"
    },
    {
      "text": "[N]erve-shredding perfection, exactly the kind of experience that leaves the viewer screaming for mercy, but ignores those cries in favor of twisting the blade.",
      "author": "J Hurtado"
    },
    {
      "text": "Hereditary is one of the most @#$%ed-up horror movies I've ever seen. No higher praise can be paid.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "A go-for-broke stunner overflowing in a myriad of petrifying mysteries many will be attempting to decipher for a number of years to come.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Where it does succeed, though, is in its depiction of a family in crisis...",
      "author": "David Stratton"
    },
    {
      "text": "I will talk about movies having a sense of dread, this is the all-time grand champion of that.",
      "author": "Matt Atchity"
    },
    {
      "text": "Hereditary runs 127 minutes -- some of the best recent horrors tend to clock in at between 90 and 100 -- but there isn't an ounce of fat in the story.",
      "author": "Chris Knight"
    },
    {
      "text": "It's 2:38am and I'm convinced there's someone, or some-thing, in the attic. I have Ari Aster's first feature film Hereditary to thank for the past four nights of anxiety-induced sleeplessness.",
      "author": "Jeffrey Edalatpour"
    },
    {
      "text": "Hereditary has the trappings of an arthouse horror movie, but a punk rock soul.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Aster captures it all with a heart-wrenching sense of everyday horror.",
      "author": "Dom Sinacola"
    },
    {
      "text": "Here is a film that evokes the ugliest and darkest corners of our most fundamental selves, viewing our genetic identity as a maximum-security prison of sorts.",
      "author": "Robert Levin"
    },
    {
      "text": "The film's subtle shocks and realistic drama combine to create a dreamlike atmosphere, drenched in psychological horror, which builds and builds to a climax that you won't forget anytime soon...",
      "author": "William Bibbiani"
    },
    {
      "text": "[At first] we never really know where its going, and ambiguity lends to the terror. But then it decides to stop the ambiguity, landing with a very heavy thud on one side, favoring the kinds of things that ultimately don't keep us up at night.",
      "author": "Rain Jokinen"
    },
    {
      "text": "Hereditary is a sometimes exceedingly uncomfortable horror-drama with stars unfamiliar within the genre, a doomy sense of mostly-sustained menace and a series of twists and turns that make it damn hard to talk about.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "If you're the kind of horror nerd whose cage gets especially rattled by séances, shock scares, and the supernatural, you're in for a hell of a time.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "Yes, there's a certain familiarity to its general horror notes -- but only until those daring, shattering moments in which Hereditary erupts insanely and reveals itself as a thing all its own.",
      "author": "Mike Scott"
    },
    {
      "text": "Fans of this genre will find a lot to be creeped out by in this gory spook fest. My mom, however, would not approve.",
      "author": "Michael Heaton"
    },
    {
      "text": "Here's a haunted-houses movie for the ages.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Hereditary makes blood run cold with moments of pure terror... [Full Review in Spanish]",
      "author": "Marcos Gandía"
    },
    {
      "text": "With nary a jump scare in sight, Aster has created a moody piece with a delicate but devastating sense of dread.",
      "author": "Alonso Duralde"
    },
    {
      "text": "The visually hyper-articulate Ari Aster understands one important thing that any director working in the horror/thriller mode should: that the half-seen is more terrible than the big reveal.",
      "author": "Nick Pinkerton"
    },
    {
      "text": "Hereditary is devastating in its delivery and offers a bloodcurdling look into a hellish, supernatural narrative. Just be ready to live with it for a while.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Hereditary has more spooky ideas than it knows what to do with, but enough of what it throws at the wall sticks to make for one twisted horror movie.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Having announced itself, it works as a bravura technical exercise in the slow reveal. Cameras are forever following terrified gazes to the source of the terror, and revelation builds on revelation until an awful culmination begins to seem inevitable.",
      "author": "Matthew Lickona"
    },
    {
      "text": "This clammy, creeping horror movie is deeply rooted in classics from the 1960s, '70s, and beyond, but it also builds on them; it's deliberate and severe, and it's not afraid to cross a line or two.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "It is indeed an intense film, more creepy than scary, and just may make your skin crawl.",
      "author": "Alan Zilberman"
    },
    {
      "text": "An absolutely astonishing debut...",
      "author": "David Nusair"
    },
    {
      "text": "Collette effortlessly captures Annie's real fears and anxieties. She looks as if she hasn't slept in months and that protecting her family from harm is getting increasingly futile.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Hereditary is a good horror film with inclinations to be truly great.",
      "author": "Matthew Razak"
    },
    {
      "text": "A decently constructed, slow-burn horror drama that takes advantage of a familiar setting, a terrific performance from Collette, and some genuinely spooky and creepy moments. (Full Content Review - Violence, Profanity, Nudity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "No shot seems wasted, the editing is a sturdy and linear rebuke to the quick-cut madness that's infected so many recent genre films, and the sound and set design are meticulous and spare.",
      "author": "Barry Hertz"
    },
    {
      "text": "We're invited to contemplate the torments of mental instability and the awful intimacies of family life, as well as whatever malignant forces may lurk behind the veil of everyday existence.",
      "author": "Kurt Loder"
    },
    {
      "text": "Collette's performance should, and will, continue to push that conversation forward as she contends for -- and possibly receives -- Oscar glory by scaring the daylights out of unsuspecting audiences.",
      "author": "Sean O'Connell"
    },
    {
      "text": "[A] terrifying thriller that pins you to the back of your chair and leaves you paralyzed in fear.",
      "author": "Adam Graham"
    },
    {
      "text": "Forget the 'scarier than The Exorcist' line (whatever that means) that Hereditary has been tagged with - this is a movie that lives up to the hype on its own terms.",
      "author": "Hugh Armitage"
    },
    {
      "text": "The film is so restrained you may wonder whether it's a horror movie at all, and not a kitchen-table drama about an imploding family.",
      "author": "Chance Solem-Pfeifer"
    },
    {
      "text": "Toni Collette's work as a mother who's jolted between grief, anxiety and rage...is one for the ages, belonging in the same breath as Linda Blair in The Exorcist and Sissy Spacek in Carrie.",
      "author": "Andrew Lapin"
    },
    {
      "text": "Watching Hereditary inspires the kind of fear that makes you irrationally check for phantom hands under your seat that might reach out and grab you.",
      "author": "Molly Laich"
    },
    {
      "text": "Hereditary takes itself too seriously, it's too long, too predictable and frequently frustrating.",
      "author": "Michael Smith"
    },
    {
      "text": "Aster's genius here is in the way he welds old-fashioned spook-show juju to disturbingly realistic domestic turmoil.",
      "author": "Noel Murray"
    },
    {
      "text": "[W]riter/director Ari Aster, making his feature debut, takes us through a chilling exploration of mourning and madness.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Hereditary is undeniably scary and unusually well-crafted, but eventually less than the sum of its parts.",
      "author": "M. Faust"
    },
    {
      "text": "It's a family drama tinged with an ominous climate, built by disturbing details that lead in crescendo. [Full review in Spanish]",
      "author": "Gaspar Zimerman"
    },
    {
      "text": "The paradox of Hereditary is that a film seemingly cut off from everyday experience nonetheless pushes buttons very close to home.",
      "author": "Jake Wilson"
    },
    {
      "text": "Hereditary's carefully controlled release of essential intel bleeds its way into your consciousness and steadily sets about leaving a bruise there.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The indelibly unwholesome Hereditary does earn its comparison to [Rosemary's Baby], which tells you a lot about how accomplished it is.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "One of the most emotionally harrowing horror movies in years.",
      "author": "Sherilyn Connelly"
    },
    {
      "text": "Aster's direction is sure-handed. This story steers into unexpected territory with confidence, and whether or not you like where it goes, you can rarely say it played it safe.",
      "author": "Brad Keefe"
    },
    {
      "text": "A devastating portrait of an American family in sudden, inexplicable decline.",
      "author": "Justin Chang"
    },
    {
      "text": "Hereditary reaps a cheap sort of reward. It's good, but really only just good enough.",
      "author": "Adam Nayman"
    },
    {
      "text": "From scene to scene it's quite compelling, and Collette is brilliant as a brittle artist with obvious control issues.",
      "author": "Norman Wilner"
    },
    {
      "text": "The rare horror film that wears its influences on its sleeve but is nevertheless original enough to keep even genre buffs guessing (not to mention fearing).",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Collette deserves best actress consideration for playing another mother trapped in another inexplicable, spine-tingling situation.",
      "author": "Richard Roeper"
    },
    {
      "text": "\"Hereditary\" is staged, photographed and acted so brilliantly, and brings up issues of motherhood, resentment and creativity with such subtlety, that it's tempting to overlook its alternately astonishing and laughable excesses.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Aster has crafted a story with one foot in the world of the tense kitchen-sink drama and the other in something far more supernatural.",
      "author": "David Sims"
    },
    {
      "text": "Unsettling in its arid, controlled creepiness, but largely distinguished by Toni Collette's intricately layered lead performance, a portrayal of a woman whose love for her family spirals into mad decay.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Hereditary is wicked existential horror.",
      "author": "April Wolfe"
    },
    {
      "text": "Aster just might be... a major new talent. With this film, at least, he's so good it's scary.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Poorly constructed endings can leave an unpleasant aftertaste even for movies that are otherwise mostly solid. That's the case here.",
      "author": "James Berardinelli"
    },
    {
      "text": "An old-fashioned, effectively atmospheric chiller about a woman falling apart after the death of her mother.",
      "author": "Gary Thompson"
    },
    {
      "text": "A visceral experience so deeply unsettling that you don't feel right afterward. Dirty, even. So unclean that a church visit wouldn't be out of the question.",
      "author": "Brian Truitt"
    },
    {
      "text": "Mr. Aster writes an impressive-looking check and succeeds in cashing it, but on close examination the payout turns out to be skimpier than anticipated, and drawn mostly on someone else's account.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's brilliant, challenging, deliberate, scary as all get out.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "This is a horror film for the ages, a slowly unraveling puzzle of psychological torment that promises an amazing career from freshman feature writer-director Ari Aster.",
      "author": "Leigh Monson"
    },
    {
      "text": "Hereditary is a great horror movie.",
      "author": "Peter Howell"
    },
    {
      "text": "a masterpiece of freaky filmmaking, unsettling from its very first image through its hellish denouement.",
      "author": "Laura Clifford"
    },
    {
      "text": "Hereditary turns up the heat incrementally, but even when the frames erupt in flames, the hellfire cools as if waiting for an additional opportunity to scorch yet another layer of flesh.",
      "author": "tt stern-enzi"
    },
    {
      "text": "Creepy beyond belief.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Hereditary is a confident film that just knows it's going to mess you up no matter what.",
      "author": "Amelia Navascues"
    },
    {
      "text": "Through a traumatic story of familial grief, debuting director Ari Aster has pulled off a relentless horror film, possibly a new genre classic, with scares for the ages.",
      "author": "Tomris Laffly"
    },
    {
      "text": "Hereditary is a flawless example of slow-burn horror.",
      "author": "Richard Whittaker"
    },
    {
      "text": "Ari Aster's feature debut might be one of the most beautiful and nauseating horror movies ever made.",
      "author": "Ciara Dolan"
    },
    {
      "text": "It borrows from other horror movies, but this tale of ancestry gone to hell and family dysfunction twisted, toxic, wicked, warped and wrong finds a horror path all its own.",
      "author": "Neil Pond"
    },
    {
      "text": "Hereditary works as a family drama and as a genre film. Almost everyone is dealing with some sort of inner demon, even before we get to the possibility of real demons at work.",
      "author": "Karen Gordon"
    },
    {
      "text": "The rare horror movie that's not merely a good horror movie but a good movie, period...definitely slow-burning but builds up a powerful head of squirm-inducing tension.",
      "author": "Frank Swietek"
    },
    {
      "text": "Has enough memorably disturbing images to stick in viewers' minds without any explanation needed.",
      "author": "Josh Bell"
    },
    {
      "text": "...an easy film to recommend to adventurous genre lovers.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "To experience \"Hereditary\" is to sense something monumental being born, a quaking, foreboding, tragically humane tour de force penetrating itself squarely into the epicenter of darkness.",
      "author": "Dustin Putman"
    },
    {
      "text": "If there's a better horror movie this year, I'm going to need new pants.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The wrath of Satan seems pretty tame compared to the suffering that damaged family members can inflict on one another.",
      "author": "Steve Newton"
    },
    {
      "text": "Full of nightmarish imagery and emotional terror, 'Hereditary' has the makings of a horror classic. There is true evil lurking inside this film.",
      "author": "Drew Dietsch"
    },
    {
      "text": "[Hereditary is] a movie so horrifying and good that you have to see it, even if you shouldn't want to, even if you might never sleep peacefully again.",
      "author": "Jake Coyle"
    },
    {
      "text": "A disturbing horror movie with the sort of burned-in-your-brain sequences that will jolt you awake in the middle of the night.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "This one's genuinely gut-wrenching - pack some diapers.",
      "author": "Aaron Yap"
    },
    {
      "text": "\"Hereditary\" is closer in tone to the likes of \"The Babadook,\" \"It Follows,\" \"A Quiet Place\" and \"It Comes at Night,\" where the dread and fear come not from what you see but what you think you might see.",
      "author": "Cary Darling"
    },
    {
      "text": "Where other actresses would play a single note, Collette plays a symphony of emotions. She will nearly bring you to tears and then make you laugh before you know it. Academy Awards don't even feel like enough of a plaudit for this kind of performance.",
      "author": "Katie Walsh"
    },
    {
      "text": "Aster has spent a lot of time studying \"The Shining,\" \"The Exorcist,\" and \"Rosemary's Baby.\" It's nice to have a classicist back in town.",
      "author": "Ty Burr"
    },
    {
      "text": "[Director Aster] manipulates his audience with as much skill and dexterity as Annie displays in creating her everyday dolls houses, an original, contemporary, evocative twist on the classic Victorian horror trope.",
      "author": "Vicky Roach"
    },
    {
      "text": "So terrifying that I wanted to hide under a blankie during the screening.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Collette's chilling performance [is] a raw, soul-searing expression steeped in the traditions of high Greek tragedy and used to maximum effect by Aster in a grand example of gripping Grand Guignol.",
      "author": "Dann Gire"
    },
    {
      "text": "\"Hereditary\" is haunting in stretches, but Aster doesn't know when to quit, threatening to ruin a good thing with needless overkill.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Hereditary is not \"this generation's The Exorcist\"... But Hereditary is still a good time, and it delivers exactly your money's worth of jumps and lunacy.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Despite the electronic-belch music track and Pawel Pogorzelski's gorgeous cinematography, Hereditary is a dry husk of a story, more of an exercise in mood than an involving narrative.",
      "author": "Kelly Vance"
    },
    {
      "text": "It's one of the most horrifying moviegoing experiences I can recall, and emotionally upsetting on an intense level. To watch Hereditary is to feel horror in absolutely every sense of the word.",
      "author": "Adam Chitwood"
    },
    {
      "text": "Hereditary is so refreshing in part because it invents its own scare vocabulary.",
      "author": "Inkoo Kang"
    },
    {
      "text": "In its sense of poisoned family bloodlines, of the everyday invaded by unspeakable evil, of bonechilling terror you won't be able to shake, Hereditary is a new horror landmark. Toni Collette should have Oscar calling.",
      "author": "Peter Travers"
    },
    {
      "text": "Working with a superb cast, a crafty, teasing musical score by Colin Stetson and a steady accumulation of wracked nerves, gathered image by carefully planned image, this movie promises a paradoxically bright future for its director.",
      "author": "Michael Phillips"
    },
    {
      "text": "A masterclass in writing, direction and acting.",
      "author": "Rich Cline"
    },
    {
      "text": "This is a horror picture of uncommon effectiveness in terms of its ability to creep the audience out, and it's Collette who cranks the creep meter deep into the red zone.",
      "author": "Soren Andersen"
    },
    {
      "text": "Hereditary is a lugubrious film that invites us to see the past of a family who we know is in trouble, but the important thing here is how we get through this macabre story. [Full Review in Spanish]",
      "author": "Damián Moreno"
    },
    {
      "text": "That's not to say there aren't a few classic jump scare moments to go around, but by holding them on a tight leash, Hereditary is able to cultivate a world in which everything feels like a potential threat, even in broad daylight.",
      "author": "Meg Downey"
    },
    {
      "text": "In the end, horror and supernatural fans will certainly get their thrills, but it's the psychic damage on the screen that will make the film hard to forget.",
      "author": "David Lewis"
    },
    {
      "text": "In writer-director Ari Aster's smugly agitating feature debut, the devil is certainly in the hackneyed details.",
      "author": "Keith Uhlich"
    },
    {
      "text": "When you pare away its demonic accoutrements, you're left with the most intractably nightmarish arena of all: hearth and home.",
      "author": "David Edelstein"
    },
    {
      "text": "The sinister ambiance has a terrible grace, but its raw and honest portrait of grief and guilt is ultimately diminished by the supernatural horror that is also at play.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "If you're looking for something that operates on a deeper psychological level while still searing into your brain some of the most disturbing visuals projected on screen, then strap in for quite an experience.",
      "author": "Wenlei Ma"
    },
    {
      "text": "[A] style-over-substance Rosemary's Baby/Wicker Man riff riddled with tension-diluting inconsistencies and hamstrung by a holier-than-thou approach to horror tropes.",
      "author": "Simon Foster"
    },
    {
      "text": "Hereditary's tonal inconsistency and lack of thematic depth stops it from ever being scary - but that isn't to say it doesn't impress.",
      "author": "Alistair Ryder"
    },
    {
      "text": "...an easy film to recommend to adventurous genre lovers.",
      "author": "Travis Johnson"
    },
    {
      "text": "If you want to talk about filmmakers that are carrying on Stanley Kubrick's legacy, then Ari Aster is the real deal, as he effortlessly combines the amazing work Kubrick did both in The Shining and Eyes Wide Shut.",
      "author": "Edward Douglas"
    },
    {
      "text": "Hereditary is deeply, deeply upsetting, in a way I did not anticipate and which the trailers do not prepare us for.",
      "author": "Simon Miraudo"
    },
    {
      "text": "There's no other way to say it: Ari Aster's directorial debut is terrifying.",
      "author": "Christina Newland"
    },
    {
      "text": "It's a film that you don't so much enjoy as endure. But if you've got the constitution for it, it's unlikely a film will make you feel more than Hereditary this year.",
      "author": "Matt Maytum"
    },
    {
      "text": "Are events more tragic or less tragic depending on if those involved had a choice in the situation or not? All I know for sure is that this flat-out unsettling, spine-tingling masterpiece is arguably the best film of the year and all around unforgettable",
      "author": "Robert Kojder"
    },
    {
      "text": "Mostly I just felt really weirded out, which is what the movie wants... In that way, Hereditary is a true horror film.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Toni Collette should make room for another Oscar nomination...The grief wells within her, leaving her conflicted on proper routes to express it.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Hereditary is basically a brilliant machine for scaring us, and Collette's operatic, hypnotic performance seals the deal every second she's on the screen...",
      "author": "Peter Bradshaw"
    },
    {
      "text": "A taut, heartfelt and intelligent psychological horror film with superb performances, exquisite production design, and just enough room for interpretation. The less you know about the plot before watching it, the better.",
      "author": "Avi Offer"
    },
    {
      "text": "What it lacks in tension is redeemed in Toni Collette's stunning performance.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Profoundly disturbing and absolutely terrifying, Hereditary will haunt you for days.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "Collette is fallible, affecting and ferocious in one of her best roles for years.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Toni Collette's work as Annie here is gut-wrenching in its own terms, as she's able to craft a horror that reaches beyond just what goes bump in the night, but that lies at the heart of a woman whose whole family seems to be crumbling before her eyes.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "...A case study in both the perils of delayed gratification, and of prizing ominous aesthetics above genuine scares. Let's hope its own progeny don't follow in its footsteps.",
      "author": "Nick Schager"
    },
    {
      "text": "Hereditary is one of the most unsettling movies I've ever seen, and I couldn't sleep because of it.",
      "author": "Kyle Anderson"
    },
    {
      "text": "Hereditary is a long, slow burn of a movie, but by the time its final climaxes hit, you'll be shellshocked and paranoid.",
      "author": "Evan Narcisse"
    },
    {
      "text": "The film's deliberate pacing, commitment to atmosphere over cheap scares, and stellar cast, led by the remarkable Collette, make this work an early contender for one of the best horror films of the year.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Jaws will be dropped and cheers will be had from watching this one, which is already a frontrunner for my best of the year list.",
      "author": "Bill Arceneaux"
    },
    {
      "text": "Blue chip performances from a top notch cast.",
      "author": "Patrik Sandberg"
    },
    {
      "text": "Hereditary is graceful and relentless horror. It's a ballet of menace. Its savage suspense twisted my guts into knots and raised goosebumps so violently they ached.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Few films have explored the persistent, seemingly inescapable terror of mental illness with such alarming precision.",
      "author": "Britt Hayes"
    },
    {
      "text": "Director Ari Aster assaults the senses by tapping into humanistic themes through a unique craftsmanship of tension and trauma.",
      "author": "Marisa Mirabal"
    },
    {
      "text": "Hereditary shocks audiences through the use of crafty sound editing and design, creepy special effects and strong compelling performances that will terrify you.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "Hereditary is so scary relatives five generations back will be able to sense your fear.",
      "author": "Matt Donato"
    },
    {
      "text": "[Toni] Collette gives an absolute tour de force performance of a woman who slowly becomes unhinged.",
      "author": "Matt Shiverdecker"
    },
    {
      "text": "Guilt, ghosts, and a powerhouse performance by Toni Collette help make this a must-see for horror fans.",
      "author": "Rob Hunter"
    },
    {
      "text": "Hereditary's horror functions on multiple levels. What we see is undoubtedly terrifying, but it's how we see it that truly distinguishes the film.",
      "author": "Randall Colburn"
    },
    {
      "text": "Hereditary still manages to overcome a slight sense of convolutedness to deliver a mind-blowing wallop of an ending that's on par with the likes of Carrie, Kill List, Possession, The Witch, or even Sleepaway Camp.",
      "author": "Heather Wixson"
    },
    {
      "text": "Tries to be ROSEMARY'S BABY for the 21st century and, incredibly, more-or-less succeeds!",
      "author": "Chris Bumbray"
    },
    {
      "text": "Hereditary burrows deep in the brain, waiting to scare you again the next time you turn the lights off or sit down for a family meal.",
      "author": "Jordan Raup"
    },
    {
      "text": "An exercise in dramatic tension, character drama and creepy, cultish horror, Hereditary is a fascinating hybrid that nourishes our desires to be entertained, thrilled and emotionally impacted all at once.",
      "author": "Jason Gorber"
    },
    {
      "text": "This remarkable directorial debut from Ari Aster builds on classical horror tropes - the occult, possession, mental illness- to craft its own unique spin on terror.",
      "author": "Sara Stewart"
    },
    {
      "text": "First-time feature filmmaker Ari Aster works from familiar building blocks, but the film's emotional sophistication and Toni Collette's gutsy performance keep the proceedings feeling fresh and electric.",
      "author": "Tim Grierson"
    },
    {
      "text": "A deeply unsettling film, the kind of horror movie that pulls from relatable human emotions like grief and resentment to ultimately become an absolute nightmare.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Sometimes a horror film comes along that you just feel will change the game. Ari Aster's \"Hereditary\" is just that movie, a spooky, hypnotic film that feels like the culmination of the last 50 years of horror.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "A cast that includes Toni Collette, Gabriel Byrne, Alex Wolff and Ann Dowd delivers both shocks and an oppressive sense of doom.",
      "author": "Sean P. Means"
    },
    {
      "text": "Hereditary is a terrifically unsettling look at the howling despair of grief, combined with that good, old-fashioned fear of what demons we may have inherited from our parents.",
      "author": "Richard Lawson"
    },
    {
      "text": "Hereditary takes the core haunting element of a spirit with a malevolent agenda and runs with it in a seemingly endless series of unexpected directions over two breathless hours of escalating terror that never slackens for a minute.",
      "author": "David Rooney"
    },
    {
      "text": "Collette's performance is staggering. She plays Annie as a woman who begins to wear her buried rage and guilt on the outside.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "A harrowing story of unthinkable family tragedy that veers into the realm of the supernatural, Hereditary takes its place as a new generation's The Exorcist -- for some, it will spin heads even more savagely.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "It's a merciless film, crafted for maximum effect.",
      "author": "Tasha Robinson"
    },
    {
      "text": "It's pure emotional terrorism, gripping you with real horror, the unspeakable kind, and then imbuing the supernatural stuff with those feelings. It didn't play me like a fiddle. It slammed on my insides like a grand piano.",
      "author": "A.A. Dowd"
    },
    {
      "text": "This is just a great horror film, offering a great experience for packed audiences while also giving them plenty to discuss on the way home.",
      "author": "Evan Saathoff"
    },
    {
      "text": "Hereditary excels at permeating a convincing environment of despair with first-rate horror.",
      "author": "Eric Kohn"
    }
  ],
  "release_year": 2018,
  "duration": 127,
  "genres": [
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "When the matriarch of the Graham family passes away, her daughter and grandchildren begin to unravel cryptic and increasingly terrifying secrets about their ancestry, trying to outrun the sinister fate they have inherited.",
  "popularity": 7.1,
  "poster_url": "https://image.tmdb.org/t/p/original/4GFPuL14eXi66V96xBWY73Y9PfR.jpg"
}