{
  "movie_name": "Horrible Bosses",
  "movie_id": "horrible_bosses",
  "total_reviews": 218,
  "reviews": [
    {
      "text": "While the premise, of course, has no merit and is intentionally unbelievable, the movie still triggers more eye rolls than big laughs.",
      "author": "Don Shanahan"
    },
    {
      "text": "Solidly entertaining, Horrible Bosses is the kind of flick Hollywood rarely makes well, or even puts out in cinemas, these days.",
      "author": "James Croot"
    },
    {
      "text": "Without the confidence or daring to truly embrace its macabre setup, this amusing-yet-dimwitted movie proves to be lighthearted and, even worse, rather pleasant from a moral standpoint.",
      "author": "Brian Eggert"
    },
    {
      "text": "The energy and hilarity steadily run out as the film barrels towards the expected conclusion.",
      "author": "Mike Massie"
    },
    {
      "text": "Aniston doesn't just sexually harass, she practically dominates the poor guy into submission.",
      "author": "Richard Propes"
    },
    {
      "text": "In a summer full of R-rated comedies, this is the best of the bunch.",
      "author": "Micheal Compton"
    },
    {
      "text": "More often than not Horrible Bosses comes off as one of those comedies which feels more template than anything else.",
      "author": "Shubhra Gupta"
    },
    {
      "text": "On balance, Horrible Bosses is a decent employment of one's moviegoing time.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Short, well-paced and to the point, with a clear idea of what it wants to achieve. Thanks to an array of well-constructed jokes and comical situations which entertain without overdoing it, it does just that.",
      "author": "Margherita Pellegrino"
    },
    {
      "text": "It's a little too fitting, maybe, that Horrible Bosses goes all vague and mushy and out-of-focus in trying to represent what a happy ending would even look like.",
      "author": "Eileen Jones"
    },
    {
      "text": "Frequently hilarious, with laughs arriving both hard and often once the film finds its feet, thanks in no part to the sharply written script and enthusiasm evident in the well selected cast.",
      "author": "Jamie Neish"
    },
    {
      "text": "It shows very clearly how far down the rabbit hole Hollywood has fallen. If it keeps making its heroes this horrible, it's heading for a major crash of its own.",
      "author": "Sarah Manvel"
    },
    {
      "text": "Maximizes the juvenile humour and the comedy timing of its three leads, who bounce off of each other well.",
      "author": "Kaleem Aftab"
    },
    {
      "text": "Horrible Bosses avoids the worst of the murder comedy pitfalls by making bad bosses the target of the plot.",
      "author": "Sarah Marrs"
    },
    {
      "text": "So, of course, a comedy of errors ensues since these everyday guys are the last you'd think could pull of such a dirty task. And man is it fun to watch it unfold.",
      "author": "Candice Frederick"
    },
    {
      "text": "Horrible Bosses is no masterpiece, but it's a solid comedy with great chemistry.",
      "author": "Lindy West"
    },
    {
      "text": "Like rats in a collapsed maze, these are characters struggling hard to find a path to comedic freedom, and are constantly getting lost in the ruins of an absurd plot.",
      "author": "David Keyes"
    },
    {
      "text": "A ramshackle assembly of recycled characters and conflicting tones, duct-taped together at odd angles.",
      "author": "Sean Burns"
    },
    {
      "text": "This vulgar comedy is mediocre at best with some fun performances but few jokes that actually work.",
      "author": "John Hanlon"
    },
    {
      "text": "With this cast, and this concept, it's just a shame that \"Horrible Bosses\" pulls up just when it should be taking off.",
      "author": "Will Leitch"
    },
    {
      "text": "A star-studded black comedy for anyone who's ever fantasised about killing their boss.",
      "author": "Tom Glasson"
    },
    {
      "text": "Horrible Bosses is very funny and features a great cast that exudes wonderful chemistry.",
      "author": "Jeff Beck"
    },
    {
      "text": "Colin Farrell is a comedy genius.",
      "author": "Andy Lea"
    },
    {
      "text": "Rides the entertaining pitch for the entire runtime -- without attempting to offer some kind of deeper insight or social commentary.",
      "author": "Ben Kendrick"
    },
    {
      "text": "This is a story for which plausibility took a running jump off a belief-suspension bridge.",
      "author": "Matt Looker"
    },
    {
      "text": "Flawed, and not nearly as dark as it could be, but Horrible Bosses excels if only because of the fun performances and great chemistry of the cast.",
      "author": "R.L. Shaffer"
    },
    {
      "text": "Horrible movie. One of the five worst films of 2011.",
      "author": "Fr. Chris Carpenter"
    },
    {
      "text": "... An ingenious though not quite original premise, genuine wit and a fantastic cast.",
      "author": "Greg Maki"
    },
    {
      "text": "Forget The Hangover: Part II and Bridesmaids. Horrible Bosses was the funniest movie of this past summer.",
      "author": "Kevin Carr"
    },
    {
      "text": "While it may only be an average comedy, derivative of better things, these days it appears we have to be thankful for what's available.",
      "author": "John J. Puccio"
    },
    {
      "text": "Squanders a promising dark premise and attractive production values for puerile gross-out humor, 'shocking' sex talk, lazy plotting and a desperate and almost literal deus ex machina ending.",
      "author": "John Beifuss"
    },
    {
      "text": "a subversively prescient black comedy",
      "author": "Andrea Chase"
    },
    {
      "text": "to trio toy Gordon badizei se diadromes klasikoy buddy movie, arwmatismenes me mia tzoyra apo noyar doloplokies, gia na sthsei tis kwmikes eksarseis poy soy exoyn apokalypsei edw kai kati mhnes ta trailer",
      "author": "Joseph Proimakis"
    },
    {
      "text": "Fun, throwaway, unofficial remake of the classic 1980 workplace comedy Nine to Five.",
      "author": "Jim Schembri"
    },
    {
      "text": "As sloppy and unbelievable as the movie is, it is at times very funny -- a series of ridiculous setups to get these three talented comic actors in uncomfortable positions so they can make us laugh.",
      "author": "Eric Melin"
    },
    {
      "text": "A fun, lively chemistry between Nick, Kurt and Dale keeps this snappy story whipping along from gag to gag at a merciless pace.",
      "author": "Tim Martain"
    },
    {
      "text": "he trio's hysteria mounts in a manner conspicuously designed to conjure up comparisons with the panic experienced by the boys in The Hangover.",
      "author": "Sandra Hall"
    },
    {
      "text": "Whilst the bosses are unnecessarily over-the-top, the film still manages to work as a light-hearted buddy comedy.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Hangover filmmakers, this is how you do it.",
      "author": "Rob Humanick"
    },
    {
      "text": "It's far from perfect, but it features more laughs than Bad Teacher and The Hangover Part II combined.",
      "author": "Matt Neal"
    },
    {
      "text": "Everyone is having a good time making this film and, unlike some, they're able to share that with the audience.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "As far-fetched and filthy-minded as the film often gets, there is a subversive universal appeal in play that keeps lingering doubts at bay.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A guilty pleasure for anyone who hates their boss, this is original, superbly performed and wickedly funny.",
      "author": null
    },
    {
      "text": "Horrible Bosses may not be ground-breaking comedy, but it *is* comedy.",
      "author": "Paj Sandhu"
    },
    {
      "text": "No-holds-barred humour, an up-for-anything all-star cast and a fast, madcap energy make this one of the best comedies you'll see in 2011.",
      "author": "Adam Bub"
    },
    {
      "text": "If the film works at all - and it mostly does - it's because of Bateman's performance (speaking of sympathetic: he could have played Patrick Bateman and made him seem adorable).",
      "author": "Simon Miraudo"
    },
    {
      "text": "La broma más o menos funciona siempre que uno no espere una obra maestra de la comedia (no lo es) ni una ácida crítica sobre las relaciones laborales en el mundo corporativo de hoy (tampoco es el caso).",
      "author": "Enrique Buchichio"
    },
    {
      "text": "Made with the same kind of raucous, raw energy the first Hangover film delivered, Horrible Bosses dares to go for broke and is deliciously bold, over-the-top and vulgar",
      "author": "Louise Keller"
    },
    {
      "text": "Adult without being crass, goofy without being stupid, Bosses is one of the funniest films of the year.",
      "author": "Matt Glasby"
    },
    {
      "text": "Acaba entregando sua falta de confiança na própria qualidade em seus créditos finais, que trazem a marca inconfundível de uma comédia sem graça: erros de filmagem.",
      "author": "Pablo Villaça"
    },
    {
      "text": "If the R rated comedy were a man, and it would almost certainly be a man, then he'd be a lad; a boy; an overly gregarious, beer soaked, open shirted alpha with a rapacious sexuality.",
      "author": "Ed Whitfield"
    },
    {
      "text": "I laughed frequently, probably to the detriment of my self-respect.",
      "author": "Philip French"
    },
    {
      "text": "A popcorn comedy you shouldn't be ashamed of wanting to see.",
      "author": "Sam Bathe"
    },
    {
      "text": "... nonstop profanity, raunchy sex scenes and general tastelessness ... also absolutely hilarious ...",
      "author": "Jim Lane"
    },
    {
      "text": "The plot is ... flimsy and the three screenwriters struggle to bring the murderous mayhem to a satisfying conclusion.",
      "author": "Catherine Jones"
    },
    {
      "text": "It's tempting to label Horrible Bosses a post-Hangover comedy. For all I know it may have been in the works before that box-office smash saw the light of day, but it emits the same vibe, even if it doesn't go to the same extremes...",
      "author": "Leonard Maltin"
    },
    {
      "text": "Gordon has the good sense to simply step aside here, letting his cast goof around and bounce off of one another like so many rubber balls.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "It's not very tightly plotted or precisely scripted but the three leads have lots of obvious camaraderie and energy together - confirmed in a bloopers reel after the end credits - which help to keep the film moving along.",
      "author": "David Sexton"
    },
    {
      "text": "Horrible Bosses is the most repellent example yet of a trend for Hollywood to rely on the lowest common denominator from the first frame to last.",
      "author": "Graham Young"
    },
    {
      "text": "These bosses cannot justify either murder or lasting comic memories, fatally compromising a farce that could have been great but ends up merely mediocre.",
      "author": "Helen O'Hara"
    },
    {
      "text": "The sub-Porky's style humour elicits a few guffaws, but a little more wit and subtlety would have helped.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Isn't there some little corner of Hollywood that still believes in the sweet and charming?",
      "author": "Allan Hunter"
    },
    {
      "text": "I must be lagging in comedy trends. First I missed the boat on full frontal male nudity, now I'm just catching up on sexual assault humor.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "The skilled comedian Bateman has the best moments, underplaying when all about him are going over the top.",
      "author": "Christopher Tookey"
    },
    {
      "text": "A hugely satisfying sacrificial culling of those at the top ... makes for a seriously refreshing tonic after a hard week's graft.",
      "author": "Lisa Giles-Keddie"
    },
    {
      "text": "Never dark, witty, or smart enough (the line '[She's] had the crazy f***ed out of her' is up for 2011's Laziest Misogyny Joke), the murder-your-boss plot also lags and jags.",
      "author": "Brian Gibson"
    },
    {
      "text": "Overall, a pleasant surprise.",
      "author": "David Gritten"
    },
    {
      "text": "At least our would-be murderers enjoy an easy rapport, and this may provide some distraction as the pace slackens and plot continues to go nowhere.",
      "author": "Stella Papamichael"
    },
    {
      "text": "Yet another unoriginal and out-of-touch Hollywood comedy prizing its R cert status over substance.",
      "author": "Adam Woodward"
    },
    {
      "text": "The makers of Horrible Bosses resort to the lowest common denominator far too much of the time: over-the-top, \"extreme\" behavior, toilet humor, stupid and vulgar sex talk, all designed to appeal to a certain demographic.",
      "author": "David Walsh"
    },
    {
      "text": "The would-be assassins' hopelessly bungling efforts produce a steady supply of laughs, though the jokes are rude and crude and the meandering plot doesn't make the most of the film's set-up. Fortunately, the actors rise above the script.",
      "author": "Jason Best"
    },
    {
      "text": "It's horrible, all right.",
      "author": "Roz Laws"
    },
    {
      "text": "Seth Gordon rolls up his sleeves and shows the comedy pretenders exactly who's boss.",
      "author": "Tim Evans"
    },
    {
      "text": "Enjoyable comedy that succeeds thanks to strong comic performances and a string of funny gags, though it also frequently squanders its potential and a little bit of depth would have gone a long way.",
      "author": "Matthew Turner"
    },
    {
      "text": "Gordon knows what works and what doesn't, pushing the leads' chummy chemistry to the fore while allowing the schematic and, frankly, highly unlikely murder plot to sink into the background.",
      "author": "David Jenkins"
    },
    {
      "text": "If you're looking for a bit of undemanding fun with a few really good laughs, you could do a lot worse than this.",
      "author": "Film4 Staff"
    },
    {
      "text": "This moronic screenwriting through swearing does little to generate laughs and only would appear to represent creative freedom or boundary pushing to a cast used to working under television censorship laws.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "Those bosses, man... they're horrible.",
      "author": "Charlie Lyne"
    },
    {
      "text": "I'm not kidding when I tell you I have worked for a reasonable facsimile of each of the 'Horrible Bosses' depicted in this grownups-only movie.",
      "author": "Linda Cook"
    },
    {
      "text": "The movie's main thrust is lowball wish fulfillment, which comes too cheaply.",
      "author": "Richard Brody"
    },
    {
      "text": "An affable, entertaining comedy...",
      "author": "David Nusair"
    },
    {
      "text": "Horrible Bosses is a sloppy  film that wants to be an edgy black comedy but doesn't come close to pushing the envelope enough.",
      "author": "Lori Hoffman"
    },
    {
      "text": "There are laughs elsewhere in this crude comedy, but the film lights up the most when supporting player Jamie Foxx shows up and steals every scene he's in.",
      "author": "John Wirt"
    },
    {
      "text": "A foul-mouthed, anatomically obsessed and downright fun black comedy.",
      "author": "Mike Scott"
    },
    {
      "text": "Smarter ideas about revenge, politics and labor are all off the table, and that's weird for a movie where the title promises angry catharsis for everyone who's fortunate enough to even have an employer to hate in the first place.",
      "author": "Dave White"
    },
    {
      "text": "Watching these three chuckleheads plot their revenge never stops being entertaining.",
      "author": "Grae Drake"
    },
    {
      "text": "[Has] absolutely no idea what to do with a really swell concept once it gets past the exposition stage.",
      "author": "Tim Brayton"
    },
    {
      "text": "The characters in Horrible Bosses are defined by their quirks, which are spelled out in boldface.",
      "author": "Brett Michel"
    },
    {
      "text": "It's not as dark as you imagine, but it will get you grinning.",
      "author": "Rob James"
    },
    {
      "text": "I will watch Bateman, Sudeikis and Day do anything, especially kill their bosses.",
      "author": "Jeff Bayer"
    },
    {
      "text": "a crowd-pleaser",
      "author": "Jordan Hoffman"
    },
    {
      "text": "The leads, and the bosses, provide fleeting pleasures.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "A lot of low-stakes humor, occasionally brought off by a mostly ingratiating cast.",
      "author": "Sam Adams"
    },
    {
      "text": "As raunchy as \"Bridesmaids\" and \"Hangover 2\" but missing the good characters; these guys are just stupid.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "The laughs in this film come fast and furious. Bateman, Sudeikis and Day are absolutely perfect together.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "The complete comedy that achieves the near-impossible --- consistent hilarity from beginning to end.",
      "author": "David Kaplan"
    },
    {
      "text": "Yet another comedy dud of 2011.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "For something like Horrible Bosses to sparkle, the actors have to shine... and shine they do.",
      "author": "James Berardinelli"
    },
    {
      "text": "An overindulgence in coarse language exposing profanity as the hobgoblins of small minds and unimaginative scripts.",
      "author": "Kam Williams"
    },
    {
      "text": "Don't miss Horrible Bosses",
      "author": "Scott Nash"
    },
    {
      "text": "After watching this trio of bumbling schemers get in and out of trouble with a series of crazy shenanigans and listening to the filthy dialogue, you will feel like taking a long, hot shower to wash away any recollection of sitting through this garbage.",
      "author": "Keith Cohen"
    },
    {
      "text": "Two-thirds of a funny movie, Horrible Bosses takes its irresistible premise an admirable distance before pulling a Wrong Way Corrigan and heading in an alternate direction ... Still, there are plenty of laughs to be mined.",
      "author": "Matt Brunson"
    },
    {
      "text": "Outrageously crude, silly farce that works because of the cast's comedic timing.",
      "author": "Susan Granger"
    },
    {
      "text": "It should be titled Horrible Comedy.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Wonderfully mean-spirited, one sick joke piled atop another ... Farrell's cheesy, coke-head boss is the real surprise. Foxx has a great time in a role that can be taken as a knowing goof on the street-smart hit man.",
      "author": "Glenn Lovell"
    },
    {
      "text": "The coarseness wouldn't be so bad if at least the steady stream of obscenities were funny. But there is, after all, an art to talking dirty.",
      "author": "Peter Rainer"
    },
    {
      "text": "Horrible Bosses won't make you forget \"Office Space,\" but you'll be laughing too much to mind.",
      "author": "Christian Toto"
    },
    {
      "text": "Energy, chemistry, timing, and a palpable sense of raunchy fun.",
      "author": "Scott Weinberg"
    },
    {
      "text": "Horrible Bosses offers a reminder that adherence to formula may not be among the signal virtues of comedy, but--provided the jokes are funny--it's no great vice either.",
      "author": "Christopher Orr"
    },
    {
      "text": "While not likely to become the ultimate in \"I hate my job\" fury a la Office Space, it offers enough bitter laughs to be fun.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The raunchy comedy about a trio of fed-up employees who exact revenge on their freak-show employers wickedly doles out the just deserts, and that's what it makes it so much fun.",
      "author": "Randy Myers"
    },
    {
      "text": "As they say, the best laid plans go oft awry. So what transpires in a comedy about the worst-laid schemes? These guys don't seem built for premeditated murder but are perfectly capable of mayhem.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Director Seth Gordon gives us few thrills, little danger and no growth-potential.",
      "author": "Sara Maria Vizcarrondo"
    },
    {
      "text": "When added altogether, Horrible Bosses gets the job done but is not recommended for advancement.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "It's a fun, sickly entertaining ride, and while not every bullet hits its mark the ones that do strike the very center of the bull's eye.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "If this year's hit \"Bridesmaids\" is the woman's answer to the male-driven, R-rated comedy, then \"Horrible Bosses\" is a strong rebuttal.",
      "author": "Alison Gang"
    },
    {
      "text": "'Horrible Bosses' Appeal Clocks Out Early",
      "author": "James Verniere"
    },
    {
      "text": "Still, Day's scene involving a mountain of cocaine is hyperspeed-hilarious, Farrell's unhinged, irrational fuming is marvelously cretinous, and Aniston's fully committed sex-addict sexpot act is wickedly absurd.",
      "author": "Logan Hill"
    },
    {
      "text": "Horrible Bosses takes a dark premise -- three buddies band together to off their bosses -- and rings it for a solid, steady stream of laughs.",
      "author": "Adam Graham"
    },
    {
      "text": "Horrible Bosses is not the kind of comedy that delivers many gut-busting laughs. You know the guffaws I'm talking about - the ones that leave your sleeves completely saturated from dabbing away the tears that stream down your face. But ...",
      "author": "Adam Tobias"
    },
    {
      "text": "Horrible Bosses follows the precedent set by such earlier crime-gone-awry comedies as Ruthless People (1986), Throw Momma from the Train (1987) and Bottle Rocket (1996) with gut-busting gusto.",
      "author": "Tyler Hanley"
    },
    {
      "text": "Uneven, but funny.",
      "author": "Chris Bumbray"
    },
    {
      "text": "...laugh out loud funny.",
      "author": "Tony Medley"
    },
    {
      "text": "What's right about Horrible Bosses is less easy to identify, but it comes down to something like esprit de corps.",
      "author": "Liam Lacey"
    },
    {
      "text": "If the names Curly, Larry and Moe mean anything to you, then Horrible Bosses is a film you should not miss.",
      "author": "Liz Braun"
    },
    {
      "text": "Black comedy at its most delicious.",
      "author": "Pete Hammond"
    },
    {
      "text": "A ragtag R-rated comedy that ekes out just enough big laughs to make it worth your time.",
      "author": "Ethan Alter"
    },
    {
      "text": "Takes a thin premise and milks it for all its worth, riding a witty script and super-strong cast to comedic glory.",
      "author": "Stephen Silver"
    },
    {
      "text": "The stars lack the charisma, the comic energy and the overall appeal of the A-listers playing supporting roles. That's a fundamental miscalculation.",
      "author": "Robert Levin"
    },
    {
      "text": "I certainly laughed enough during it to give it a recommendation, especially for anyone who has a strong stomach for profanity and a desire to see Jennifer Aniston absolutely trashing her good-girl image. (Full Content Parental Review also available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "Saying it's not horrible is another way of saying that this movie is consistently disappointing.",
      "author": "Marshall Fine"
    },
    {
      "text": "It starts off at a slight remove from reality and gets sillier and sillier as it goes along; our only responsibility is to hang on and enjoy the ride.",
      "author": "Norman Wilner"
    },
    {
      "text": "They are harmless assassins, which is why we are laughing instead of being horrified.",
      "author": "Willie Waffle"
    },
    {
      "text": "Bits that could have courted actual darkness à la Very Bad Things-violence, venality, vindictive sex-simply register as dank shock-jock gags done with little courage, and even less conviction.",
      "author": "David Fear"
    },
    {
      "text": "\"Horrible Bosses\" provides a nifty showcase for the Jasons and for Charlie Day as three reasonably nice guys who have varying and solid reasons for wishing their bosses dead.",
      "author": "Chris Hewitt"
    },
    {
      "text": "There's an underlying, nearly universal relatability to \"Horrible Bosses\" that can't be denied and that screenwriters Michael Markowitz, John Francis Daley and Jonathan Goldstein use to great advantage.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "It's over-the-top stuff, to be sure. But Bosses never crosses that line into the macabre. Don't call in sick to this shift.",
      "author": "Scott Bowles"
    },
    {
      "text": "Look at how crazy is the craziness we are doing for you. Isn't it crazy? the movie shouts, and the more it does, the less you'll laugh.",
      "author": "Kyle Smith"
    },
    {
      "text": "A jubilant, vulgar, and extremely funny farce.... Day, Sudeikis, and Bateman are a dream team of comic actors.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Funny; really, consistently funny, with a first-class ear for non sequitur, a fast pace, and a half dozen of the year's best comic performances.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Aniston's never been funnier than she is as a raunchy, sex-crazed dentist.",
      "author": "Rebecca Murray"
    },
    {
      "text": "it's ironically refreshing that a film with the word \"horrible\" baked right into its title would end up being absolutely fantastic",
      "author": "Jason McKiernan"
    },
    {
      "text": "Another movie for fans of rude/crude humor",
      "author": "Robert Denerstein"
    },
    {
      "text": "The talented cast and colorful vulgarities work overtime to cover for a lack of coherence, but they can only distract for so long.",
      "author": "Ian Buckwalter"
    },
    {
      "text": "Horrible Bosses is without question the funniest movie released so far this year, and the slyest raunch-com to date.",
      "author": "David Medsker"
    },
    {
      "text": "Day, who was the best thing about last years rom-com \"Going the Distance,\" is hilarious here.",
      "author": "Michael A. Smith"
    },
    {
      "text": "The screenplay ... goes about the expected route in regards to the protagonists' superiors ... but it's in the central characters' actions that the film truly finds its edge.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Sustained by recession-era resentment fantasies, strong plot structure, and a bunch of top comic performers enjoying themselves so much it is impossible not to join them.",
      "author": "Nell Minow"
    },
    {
      "text": "A film as coarse, bluntly obvious and irritatingly self-conscious as its title, only nowhere near as funny.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Whether it might have meant delving into grimmer thriller territory or bending toward more courageously incendiary humor, the finished cut screams out for a clearer, firmer, fuller vision.",
      "author": "Dustin Putman"
    },
    {
      "text": "Hollywood, ever-sensitive to the heated scent of the national zeitgeist, is in the business of trotting out movies that greedily feed on subliminal obsessions.",
      "author": "Burl Burlingame"
    },
    {
      "text": "Considering how many other summer comedies deserve to be fired for cause and walked out of the building by security with their stuff in a filing box, Horrible Bosses does the job well enough.",
      "author": "James Rocchi"
    },
    {
      "text": "Though sporadically funny, this revenge comedy about emasculated males in the workplace is more talk when it should go balls-out insane.",
      "author": "Matt Stevens"
    },
    {
      "text": "Basically, \"Horrible Bosses\" is a handful of characters and a comic situation in search of something to do for 100 minutes.",
      "author": "Mick LaSalle"
    },
    {
      "text": "You'll get your laughs, but you'll also wish it had gone for the throat in the end.",
      "author": "Bill Clark"
    },
    {
      "text": "Watching good actors let their hair down can be fun, but watching them let their standards down isn't.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The best workplace comedy since \"Office Space.\"",
      "author": "Jon Niccum"
    },
    {
      "text": "It's been argued that movie comedies no longer have jokes. I would go one step further. The similarly titled (and similarly sloppy) Bad Teacher and Horrible Bosses barely even have stories.",
      "author": "Chris Vognar"
    },
    {
      "text": "Even though its satirical edge is tempered by slap-stick gags, the movie will employ your funny bone without challenging you to think too deeply.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "With stellar comic timing from the entire ensemble and a dark streak of edgy humor with just enough wit to make it not seem cruel, this is one of the straight-up funniest movies of the year.",
      "author": "Brian Tallerico"
    },
    {
      "text": "A lightweight, mildly ribald farce that offers some stray laughs, smothered in a morass of 'Three Stooges'-style dumbness.",
      "author": "Frank Swietek"
    },
    {
      "text": "Here is a curveball for a comedy home-run. But at its best, Horrible Bosses is a blooper.",
      "author": "Carrie Rickey"
    },
    {
      "text": "It may not be the funniest film of the year, but it's the only really funny one opening this weekend. Surely a little gratitude is in order.",
      "author": "Kurt Loder"
    },
    {
      "text": "Heavy on action, light on character depth and utterly over-the-top, Horrible Bosses is best approached by removing the veneer of plausibility and, to paraphrase the title of a far lesser Jennifer Aniston picture, just going with it.",
      "author": "John Thomason"
    },
    {
      "text": "Jamie Foxx hasn't been this good in years in a truly funny performance that wouldn't have been out of place in \"Fargo.\"",
      "author": "Laura Clifford"
    },
    {
      "text": "Bateman, Day and Sudeikis are ideally cast, and have the good timing of comedy pros.",
      "author": "Gary Thompson"
    },
    {
      "text": "\"Horrible Bosses\" is like a loud water-cooler routine that you're forced to endure before suggesting to your crass co-workers that they should get back to work.",
      "author": "Joe Williams"
    },
    {
      "text": "Here's a hit-and-miss farce that leaves you wishing it was funnier than it is. Why? Because it wussies out on a sharp premise. Because it wastes a killer cast that's ready to rock it.",
      "author": "Peter Travers"
    },
    {
      "text": "The movie's amusing enough, and its plot twisty enough, that you can gloss over the half-baked elements.",
      "author": "Mike Russell"
    },
    {
      "text": "What's the point of a black comedy that doesn't go for the kill?",
      "author": "Dana Stevens"
    },
    {
      "text": "Another frantic bad-boy comedy, with a good premise rendered depressingly inane by characters whose behavior barely makes sense.",
      "author": "Ty Burr"
    },
    {
      "text": "Gordon, who made the terrific documentary \"The King of Kong,\" is still a little wobbly when it comes to fiction. Fortunately, his outstanding cast steadies all but the most uneven moments.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "Slow-witted, clumsy and almost pathologically reliant on crude name-calling for laughs ... Horrible Bosses represents the lowest end of the comedy spectrum.",
      "author": "Connie Ogle"
    },
    {
      "text": "Even its most reprehensible characters - like Farrell's superbly nasty autocrat, whose first act upon taking over the company is to order Sudeikis to fire all the fat people - brim with perverse joie de vivre.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "This is a fantasy along the lines of 9 to 5: coarser, less realistic about corporate culture, but just as much a fantasy of revenge for everyone humiliated or exploited by a supervisor.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "It may be 9 to 5 stripped of its feminist bite and much of its dark potential, but it's still a fun ride through the sketchier neighborhoods of the working man's mind.",
      "author": "Brian Juergens"
    },
    {
      "text": "Horrible Bosses is consistently funny, but it lacks the driving pace and frenetic energy that it so desperately needs.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Bateman, Day and Sudeikis have a natural camaraderie on-screen, and it's fun to ride this runaway train as events careen forward.",
      "author": "Sue Pierman"
    },
    {
      "text": "Spotty in its commitment to the darker elements of the material, but damn if this is not an example of actors taking control of nearly every scene and turning it into one of the more consistently funny efforts of the year.",
      "author": "Erik Childress"
    },
    {
      "text": "This nastily funny, ultimate wish-fulfilling black comedy should prove a hit with summer audiences, all too glad to be out of the office.",
      "author": "David Noh"
    },
    {
      "text": "Gordon and company really killed it.",
      "author": "Matt Singer"
    },
    {
      "text": "Jason Bateman, Charlie Day, and Jason Sudeikis are pals who decide to knock off their miserable bosses, and their conspiracy leads in all sorts of unexpected directions in this crowd-pleasing, occasionally funny farce.",
      "author": "J. R. Jones"
    },
    {
      "text": "\"Horrible Bosses\" is funny and dirty in about that order.",
      "author": "Roger Ebert"
    },
    {
      "text": "The laughter is mean but also oddly pure: it expels shame and leaves you feeling dizzy, a little embarrassed and also exhilarated, kind of like the cocaine that two of the main characters consume by accident.",
      "author": "A.O. Scott"
    },
    {
      "text": "Cleverly structured, \"Horrible Bosses\" works in spite of its cruder, scrotum-centric instincts.",
      "author": "Michael Phillips"
    },
    {
      "text": "A safe pitch down the middle in a genre better left to those capable of throwing curveballs.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "Moving on from terrorists as the reigning stock villains, to those who mercilessly dictate whatever the content of your weekly paycheck. And clocking in at theaters none too soon as get-even office drudge gore, on the heels of this economic crisis.",
      "author": "Prairie Miller"
    },
    {
      "text": "Red band trailers don't suggest how low this movie stoops for laughs, or reveal how diabolically it turns the 9 to 5 fantasy of murdering an employer into screwball hilarity. Think of The Hangover as directed by Alfred Hitchcock and get the idea.",
      "author": "Steve Persall"
    },
    {
      "text": "It may not be the summer's funniest comedy (that would be Bridesmaids), but it's safe to say it's the most killer one.",
      "author": "Peter Howell"
    },
    {
      "text": "Seeks approval by establishing a sloppy routine of shock and improvisation, slapping viewers with pedestrian acts of misbehavior when something far more macabre was in order.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Director Seth Gordon and his trio of screenwriters needed to give this script another wash or two. But once the movie hits its stride, it's a decent enough laugh-fest to garner a marginal letter of recommendation.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "The script has some good lines, the premise is quite enjoyable, the execution is solid and the performances, by all actors involved, put the film over the top.",
      "author": "Neil Rosen"
    },
    {
      "text": "\"Horrible Bosses\" has no meaning or purpose whatever, but it does have Colin Farrell with a bad comb-over, Kevin Spacey acting really mean and Jennifer Aniston as a spray-tanned sex maniac, and that's going to have to do.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "Horrible Bosses succeeds almost entirely on the chemistry of its three leads, who remain likeable even while resorting to homicide.",
      "author": "Nathan Rabin"
    },
    {
      "text": "\"Horrible Bosses\" isn't horrible at all -- it's easy, raunchy fun in the manner of the first \"Hangover\" movie (and far better than the second).",
      "author": "Moira MacDonald"
    },
    {
      "text": "It didn't make me laugh all that much, but strangely kept me more interested in the story. I admit that watching a movie this dumb for the story is like reading Playboy for the ads.",
      "author": "Phil Villarreal"
    },
    {
      "text": "The troubling thing isn't that the rampant sexual humor is so crude, but that it's so angry.",
      "author": "Josh Larsen"
    },
    {
      "text": "Add Horrible Bosses to the list of absolutely great comedies we've been given in the past ten years.",
      "author": "Nick Nunziata"
    },
    {
      "text": "A movie afraid to follow through on its nasty premise, leaving just a handful of mildly amusing jokes and a sense of lost potential.",
      "author": "Josh Bell"
    },
    {
      "text": "It could almost be argued that Horrible Bosses' general middle of the road, vanilla, just-good-enough nature is actually on purpose, a reflection of the lead characters' own qualities.",
      "author": "Devin Faraci"
    },
    {
      "text": "There are few comedy pleasures better suited to the medium of movies than that of watching supposedly normal people behaving terribly. And if those transgressing characters are played by popular movie stars, so much the better.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "No point lamenting the missed opportunity for a really dark satire, because they were never going to make that movie. At least this trio kept it entertaining.",
      "author": "Fred Topel"
    },
    {
      "text": "Although the premise is far-fetched and the plot at times ridiculous, there's enough comedic firepower in Seth Gordon's film to carry you over the rough patches.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "It's one of those revolting, raunch-fueled movies churned out in their sleep by the Farrelly brothers and Judd Apatow that I usually hate, but with real cleverness, off-center wit and edgy imagination.",
      "author": "Rex Reed"
    },
    {
      "text": "It's a film that's wildly, brazenly stupid -- but also, you know, fun.",
      "author": "Christy Lemire"
    },
    {
      "text": "Horrible Bosses is entertaining and brazen, a clear reminder that to make a good comedy, all you've really gotta do is make it funny.",
      "author": "Katey Rich"
    },
    {
      "text": "If you're like me, you won't entirely hate it ... but you may hate yourself in the morning.",
      "author": "Glenn Kenny"
    },
    {
      "text": "Sure Day's voice travels into the grating register once in a while, but overall, the guys keep their performance in the confines of ridiculously amusing yet frankly endearing.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "Would I have really enjoyed this trio-in-trouble comedy if I hadn't felt it was a force feed of the Hangover formula?",
      "author": "Joanna Langfield"
    },
    {
      "text": "This foul-mouthed effort coasts on its leads' strong three-way chemistry and crack timing.",
      "author": "Justin Chang"
    },
    {
      "text": "The movie sounds like a high-concept commercial comedy, but it's quite funny and the whip-smart script contributes to the level of enjoyment of the cast.",
      "author": "Emanuel Levy"
    },
    {
      "text": "[VIDEO] A much more successful bromance comedy than \"The Hangover 2,\" \"Horrible Bosses\" benefits from the volatile comic mixture of chemistry between its actors, as well as a genuinely quirky script.",
      "author": "Cole Smithey"
    },
    {
      "text": "On the frat-comedy tolerance scale, this noir-comedy just about breaks even.",
      "author": "Nick Schager"
    },
    {
      "text": "I laughed, but even as I laughed, I was frustrated by the potential that feels unfulfilled.",
      "author": "Drew McWeeny"
    },
    {
      "text": "The funniest film since The Hangover. The ideal cast makes the outlandish premise work in this silly, clever summer comedy, as shrewdly played and hilarious as they come.",
      "author": "Caryn James"
    },
    {
      "text": "Like The Hangover, the genius of Horrible Bosses lies in the fact it takes the simplest of concepts and builds upon it with hilarious non-stop laughs.",
      "author": "Edward Douglas"
    },
    {
      "text": "Probably isn't horrible enough to excite younger viewers and will certainly not attract anyone else.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "What passes for comedy here doesn't have a chance against a thesis so scary and sad.",
      "author": "Karina Longworth"
    }
  ],
  "release_year": 2011,
  "duration": 98,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Nick (Jason Bateman), Dale (Charlie Day) and Kurt (Jason Sudeikis) are workers who would like nothing better than to grind their oppressive employers into the dirt. Quitting their jobs is not an option, so -- fueled by alcohol and dubious advice from a criminal (Jamie Foxx) -- the men devise a complex and seemingly foolproof plan to permanently rid themselves of their terrible bosses. The problem is, any plan is only as clever as the brains behind it.",
  "popularity": 7.0,
  "poster_url": "https://image.tmdb.org/t/p/original/uQkUwgyFHAm0jGQERPG6Z9o9Zbj.jpg"
}