{
  "movie_name": "Inside Out",
  "movie_id": "inside_out_2",
  "total_reviews": 319,
  "reviews": [
    {
      "text": "It was well made, it was well thought out as an expansion, continuation, and growth of what the previous one was. I just personally will never watch it again, because I can't handle cringe.",
      "author": "Vera Wylde"
    },
    {
      "text": "Inside Out 2 is the best PIXAR sequel ever. It deftly taps into the universal experience of young adults with new emotions, coming of age experiences and moral quandaries to navigate while also being a moving commentary on the importance of mental health.",
      "author": "John Rocha"
    },
    {
      "text": "A fine sequel during which Riley copes with some new emotions, including Anxiety.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "It's a fascinating shift of focus as a result. Where Riley needed her emotions to lead in Inside Out, her salvation in Inside Out 2 lies in stopping them from driving the car into a wall.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Even with its flaws, it’s still one of the year’s most gorgeous and heartfelt films.",
      "author": "Kip Mooney"
    },
    {
      "text": "Feels like a natural progression of the story established in the original movie.",
      "author": "Meg Walter"
    },
    {
      "text": "[Inside Out 2] is a natural progression in terms of Riley’s narrative, exploring the onset of transition from childhood to adulthood.",
      "author": "Lee Zumpe"
    },
    {
      "text": "A sequel that, from the start, promises new emotions and adventures inside the human mind, but unfortunately fails to capture the spark and depth of the original. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "The turbulent tale of teenage emotions is moving, lovable and wildly creative.",
      "author": "Christina Newland"
    },
    {
      "text": "Inside Out 2 is too nuanced and deeply felt to be called impersonal. It takes Riley's ambivalence and crushing self-esteem issues seriously, while still mining laughs from the awkwardness she finds herself unable to shake off.",
      "author": "Rubén Rosario"
    },
    {
      "text": "One of the most perfect of all Pixar flicks has finally been followed by a sequel that, while enjoyable, doesn’t come close to matching the giddy heights of its 2015 predecessor.",
      "author": "Matt Brunson"
    },
    {
      "text": "A lot better than the original - this is important film that both parents and children need to watch together.",
      "author": "David Griffiths"
    },
    {
      "text": "With smart writing and a talented cast, Inside Out 2 captivates audiences, delivering a successful and heartfelt sequel.",
      "author": "Allison Rose"
    },
    {
      "text": "... more than 1, 2 contains an important message that transcends the target viewing audience, the Riley-aged viewers, expanding its influence to those who’ve yet to learn that anxiety itself isn’t bad, but just another facet of ourselves to understand.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Scenes flow with seeming simplicity, but Inside Out 2 adds depth to its clarity, using concepts involving complicated issues that affect people on a daily basis",
      "author": "Robin Holabird"
    },
    {
      "text": "With a creaky story, a total absence of logic, and the most squeaky-clean depiction of puberty you could imagine, Inside Out 2 feels less like a $200 million film and more like a cash-grab made-for-TV movie.",
      "author": "Clement Tyler Obropta"
    },
    {
      "text": "And much like the first movie, Inside Out 2 is wildly funny, tender and sweet, and a little bit tearjerky.",
      "author": "John Serba"
    },
    {
      "text": "While Inside Out 2 might lack the emotional gut punch of some of Pixar's previous entries, it's short, sweet and competently crafted. While it might not be Pixar's best, it's also not their worst, and that's a much needed win for the studio.",
      "author": "Matthew Huff"
    },
    {
      "text": "Mostly painless and often funny.",
      "author": "Tim Brayton"
    },
    {
      "text": "Once again, Pixar has nailed the very core of Inside Out perfectly showcasing the messiness and ugliness of being a teenager.",
      "author": "Maria Lattila"
    },
    {
      "text": "Inside Out 2 is a strong follow-up to Pixar’s modern classic that isn’t quite on the same emotional level as its predecessor, but has enough profundity within its themes and evolution of the core concept that give it plenty of worthiness.",
      "author": "Jack Martin"
    },
    {
      "text": "The outline of these issues seems sensational to me, but not the way they are presented. [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "While this film has many strengths, the performances from its voice cast are what truly make it special.",
      "author": "Branyan Towe"
    },
    {
      "text": "A fantastic sequel which delivers the experience you want from an Inside Out film, but also finds new ways to explore emotions and puberty.",
      "author": "Sean Chandler"
    },
    {
      "text": "While the original remains the gold standard for modern animation, this sequel more than justifies its existence via its empathetic themes, strong humour, and engrossing animation style.",
      "author": "Calum Cooper"
    },
    {
      "text": "Inside Out 2 is an enjoyable, funny, and sometimes emotionally impactful film. But it fails to stand among Pixar’s best films because it’s too derivative of those films; and many others.",
      "author": "Kyle Logan"
    },
    {
      "text": "After a period of some ups and more downs, Pixar can at least boast of following up one of their later classics respectfully. Deserves the healthy audiences it will surely stir up.",
      "author": "Donald Clarke"
    },
    {
      "text": "I’ve seen Inside Out 2 twice now, and although it didn’t sweep me off my feet the way that Inside Out did, it didn’t let me go.",
      "author": "Ayelet Dekel"
    },
    {
      "text": "I wanted to laugh more, feel more... It only got about 30 or 40 percent there.",
      "author": "Wade Major"
    },
    {
      "text": "I found it a worthy sequel. Just about as clever, moving, and enjoyable as the original film.",
      "author": "Claudia Puig"
    },
    {
      "text": "The story is unexpectedly compelling and points to the progress being made in society in showing the diverse interests and emotions of individuals.",
      "author": "George M. Thomas"
    },
    {
      "text": "Inside Out 2 shows that Disney hasn't completely fallen off. Even though sequels and remakes seem to be the focus, I'm glad this property has been treated with respect and care. What a delight to watch with my kids.",
      "author": "Adam Olinger"
    },
    {
      "text": "Just like the first film, the subject matter will cause you to get very self-reflective, causing you to constantly find relatable memories and emotions to go along with what is on screen.",
      "author": "Danny Minton"
    },
    {
      "text": "This film might not have the groundbreaking impact of its predecessor, but it retains much of the original's imaginative brilliance.",
      "author": "Troy Ribeiro"
    },
    {
      "text": "Sparky, kaleidoscopic and boldly honest about the tougher side of growing up, Inside Out 2 is Pixar’s most profound and moving movie since, well, Inside Out.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "The beauty of \"Inside Out 2\" is that, different from all other Pixar sequels, it forces its creators to look inward to tell a story of character emotions that manages to resonate with every single audience member. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "The backdrop of a young girl's mind provides endless avenues for invention, creating a film rich in colour, texture and a steady stream of sight gags.",
      "author": "Terry Staunton"
    },
    {
      "text": "What's extraordinary about this animated coming-of-age feature is how it turns ideas into images, visually demonstrating to children - and their parents - how the subconscious mind works - peppered with suspense and humor.",
      "author": "Susan Granger"
    },
    {
      "text": "Inside Out 2 reminds you of how great Pixar movies can be, and how satisfying a well-executed sequel can feel.",
      "author": "Victoria Luxford"
    },
    {
      "text": "The animation, as to be expected, is brilliantly rendered and the story smart and captivating.  While it doesn’t pack the emotional wallop of “IF,” it’s still a great film to take the fmily to.",
      "author": "Michael A. Smith"
    },
    {
      "text": "Inside Out 2 has me thinking about how the older you get, the more complex emotions are and how we find a way to define ourselves within that glorious mess. And me thinking about it long after the film is done, is [...] a success for the movie...",
      "author": "Lyra Hale"
    },
    {
      "text": "Pixar returns to form by revisiting one of its greatest hits.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Inside Out 2 is grander in scope and complexity than the Oscar-winning original, allowing it to be stacked against Pixar’s greatest sequels!",
      "author": "Ethan Dayton"
    },
    {
      "text": "The emotions might be new, but the story is the same old. The lesson has some tread on it, too, but it’s still valuable.",
      "author": "Dana Barbuto"
    },
    {
      "text": "Inside Out 2 doesn’t feel necessary, but it does manage to create a fun story while dealing with new aspects of Riley’s character, all accompanied by Pixar’s usual high animation quality.",
      "author": "Nelson Acosta"
    },
    {
      "text": "Inside Out 2 can't, understandably, match the impact its predecessor originally made, but it does make freshly inventive use of the earlier film's clever conceits.",
      "author": "Jason Best"
    },
    {
      "text": "The line from Joy about feeling less joy as you get older (and more anxious) is a poignant one, however, Riley calling for Joy in those final scenes…to simply play hockey with her friends slayed me.",
      "author": "JD Duran"
    },
    {
      "text": "Like its predecessor, Inside Out 2 provides some emotional tools inside an entertaining and relatable package.",
      "author": "Valerie Kalfrin"
    },
    {
      "text": "A little chaotic for kids but the Pixar magic still works.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "This new film might be less easily enjoyable, but it feels larger and stirringly sincere in what it attempts to do. In some ways, I found myself more moved this time around, than with its predecessor.",
      "author": "Andrew Kendall"
    },
    {
      "text": "This is a “coming of age” movie that is not built around trauma, but around the kinds of emotional setbacks encountered in everyday life. It is a movie with a surprisingly adult point of view, and it promotes the positive qualities of adulthood.",
      "author": "Robert Roten"
    },
    {
      "text": "It is an entertaining, emotional sequel full of valuable messages, that makes excellent use of its central concept to deliver a somewhat predictable narrative, which should nevertheless appeal to all family members. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Inside Out 2 expands the worlds of its characters to capture how our worlds get bigger with age. That, ideally, is what sequels can be for Pixar: a way to help guide young audiences through the turbulence of growing up.",
      "author": "A.A. Dowd"
    },
    {
      "text": "[Anxiety] has its uses and, when channeled properly, can be a motivating factor, but it can't be the sole thing dictating your personhood. It's, therefore, ironic that Pixar's approach to Inside Out 2 should be so antithetical to the thesis of their film.",
      "author": "Griffin Schiller"
    },
    {
      "text": "Anyway, I doubt either Inside Out or Inside Out 2 will suffer any real cosmological analysis since it’s a soap opera…cynically? Yes, cynically centered on a child’s early development.",
      "author": "Walter Chaw"
    },
    {
      "text": "The animated comedy-drama Inside Out 2 is proof that it’s possible to do something right twice.",
      "author": "Stephen Romei"
    },
    {
      "text": "A decidedly charming tale that can be enjoyed by children and adults alike and will no doubt spark interesting conversations among viewers who have been through similar situations. [Full review in Spanish]",
      "author": "Sergio Burstein"
    },
    {
      "text": "Inside Out 2 is a safe play for Pixar but continues building out the intricacies of Riley’s mind with an accurate conceptualization of anxiety.",
      "author": "Jillian Chilingerian"
    },
    {
      "text": "What “Inside Out 2” does is tee up a theme park attraction. There’s a visit to Imagination Land and, guess what? Epcot has needed a refresh on its imagination ride for years. Score.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Yes, it lacks anything akin to the first movie’s “Bing-Bong moment”, but the tension is palpable and your emotions definitely feel invested, as Anxiety threatens to destroy all the Joy in Riley’s life.",
      "author": "James Croot"
    },
    {
      "text": "Pixar's real triumph is making something that anyone who was ever a teenager can probably relate to. Inside Out 2 sees you, knows you and is you.",
      "author": "Matt Neal"
    },
    {
      "text": "Inside Out 2 just saved Hollywood's summer profit margins. Too bad it's just another bland depiction of the Pixar Child's inner life.",
      "author": "Eileen Jones"
    },
    {
      "text": "I wish I had Inside Out when I was young.",
      "author": "Chris McCoy"
    },
    {
      "text": "Inside Out was groundbreaking and storytelling at its most powerful and entertaining and while this new story didn't pack as much of a punch to the heart as its predecessor, being back in this world was pure joy.",
      "author": "Kate Rodger"
    },
    {
      "text": "There’s something very ingenious about an animated film that explores the feelings we have in a way that is tangible, profound and educational.",
      "author": "Dwight Brown"
    },
    {
      "text": "Inside Out 2 may not be quite the tearjerker its predecessor was; however, it more than delivers in its humour and heart through its writing and visual gags.",
      "author": "Matt Fernandez"
    },
    {
      "text": "While not as revelatory as Inside Out, this sequel is a winsome blend of energetic voice work and positive messaging.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "With such a fantastic premise at the soul of the story, it's an unfortunate truth that Pixar dropped the ball on exploring such a prominent time in every person's life with recycled tropes.",
      "author": "Connor Petrey"
    },
    {
      "text": "... A gigantic step backward, a soulless film narrated from a psychology book that cannot shake off the obligatory sequel's status [Full review in Spanish].",
      "author": "Randy Meeks"
    },
    {
      "text": "…short, bright, bubby and thought-provoking for all ages…",
      "author": "Eddie Harrison"
    },
    {
      "text": "[capsule review] \"Inside Out 2\" illustrates complex emotions well. Embrace all your emotions; observe them, but also learn to let go. Have passion in what you do, regardless of the outcome. It's part of the joy of living!",
      "author": "Nathalia Aryani"
    },
    {
      "text": "For as strong as it is from its first few minutes, Inside Out 2 truly does save the best for last, with everything coming to a highly and believably emotional climax at the camp-concluding scrimmage.",
      "author": "Mark Meszoros"
    },
    {
      "text": "In many ways, Kelsey Mann’s Inside Out 2 was significantly more emotionally resonant, profound, and insightful than its predecessor. I was pleasantly surprised by how deeply it moved me.",
      "author": "Mark Johnson"
    },
    {
      "text": "There’s nothing to rival Bing Bong, but the panic attack scene is a standout moment, a reminder of what the writers and artists of Pixar can do at their best.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The expansion of the world brings new depth to the franchise and raises the emotional stakes quite well. The results are perhaps Pixar’s best film since Inside Out and the best sequel by the studio since Toy Story 3.",
      "author": "Micheal Compton"
    },
    {
      "text": "Inside Out 2 is not a masterpiece, and putting it toe-to-toe against its predecessor would be an ill-matched fight. But it’s an entertaining movie that gets the basics right and pays sufficient homage to the spirit of the original.",
      "author": "Melanie Fischer"
    },
    {
      "text": "... Monotonous, without the capacity to surprise, relying on a certainty: that the infallible calculator has already predicted the number of viewers. [Full review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "Inside Out 2 is not only a worthy sequel to its predecessor, but a fantastic animated feature that will leave you and your emotions satisfied.",
      "author": "Mat Brunet"
    },
    {
      "text": "I particularly enjoyed the specter of anxiety turning into a whirlwind that just burns everything up...",
      "author": "Mark Kermode"
    },
    {
      "text": "\"Inside Out\" works on so many levels you should not be  shocked if your own emotions of Joy and Envy kick in while watching this production. The film moves at such a rapid rate there is no room for a moment of Ennui.",
      "author": "Rick Bentley"
    },
    {
      "text": "There’s plenty of invention at the granular level: the battle within the Projection Room is smart, the sar-chasm is funny, the stream of consciousness is cute. But the story is very much the same.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Even with Hawke missing some of the comic potential in this role, Anxiety is probably the best thing about this sequel, partly because she is never a pure villain.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Inside Out 2 is not without its glorious moments and, without a doubt, the film runs across the screen with the visual exuberance between abstraction and house brand glory. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "“Inside Out 2″ is serviceable entertainment. That’s a sad thing to say about a Pixar film, especially when you consider they made classics like “Toy Story,” “The Incredibles,” and, well, the first “Inside Out.”",
      "author": "Odie Henderson"
    },
    {
      "text": "Even if it never quite seems to go far enough, the script touches on several terrific themes, cleverly playing with the way feelings become jumbled as the hormones kick in.",
      "author": "Rich Cline"
    },
    {
      "text": "A beautiful and thought-provoking sequel about the highs and lows of becoming a teenager. Loved the addition of Maya Hawke as \"Anxiety\"!",
      "author": "Lauren Veneziani"
    },
    {
      "text": "As deep as Inside Out 2 is, this is also a thoroughly funny film. Don't think you're paying just to sit through an animated therapy session (though, that actually sounds great).",
      "author": "Charlie Ridgely"
    },
    {
      "text": "\"Inside Out 2\" not only maintains its predecessor's core inner balance theme it also delves into the realm of teen anxiety with a unique twist of 'imperfection '-- great for all ages especially parents, as they will be enlightened to their teens emotions.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Inside Out 2 fulfills the promise of getting to the root of who we are.",
      "author": "Josh Korngut"
    },
    {
      "text": "While it is impossible to recreate how Inside Out made us feel upon that first viewing, Inside Out 2 brings a host of new emotions to the table with a clever, succinct story that is, like its predecessor, a delightful surprise.",
      "author": "Candice McMillan"
    },
    {
      "text": "…hits the same kind of authentic emotional beats that made its predecessor such an instant classic.",
      "author": "Erin Free"
    },
    {
      "text": "Inside Out completely recontextualized Sadness in the most beautiful way, and now Inside Out 2 serves as an especially poignant reminder that all of our emotions and experiences, the good and bad, make us whole.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "It’s solid, middle-of-the-road Pixar, not quite as good as some of their better sequels but superior to the Cars follow-ups.",
      "author": "James Berardinelli"
    },
    {
      "text": "The sequel pushes the control-room metaphor to its limits as Riley matures, depicting her as a quivering mess entirely ruled by whims.",
      "author": "Kathia Woods"
    },
    {
      "text": "Inside Out 2 is a harmless sequel that is fun for all ages but also absolutely unnecessary. The film recycles three-quarters of the original while introducing a quarter of new characters and ideas.",
      "author": "Chris Sawin"
    },
    {
      "text": "The plotting is very similar to the original and its setting loses some opportunities but the story’s insights into anxiety and the drawbacks to eternal happiness and sadness ring true for all ages in-between some solid laughs.",
      "author": "Erik Childress"
    },
    {
      "text": "Pixar signs its best sequel, not starring toys. [Full review in Spanish]",
      "author": "Adrián Carande"
    },
    {
      "text": "Inside Out 2 is overloaded but never dense, and is moving, tender and fun. [Full review in Spanish]",
      "author": "Pablo Vázquez"
    },
    {
      "text": "For Gen Z and Alpha audiences (and their parents)—those navigating today’s “anxious generation” world with a hyperattuned (maybe overattuned) emotional vocabulary—Inside Out 2 is unsurprisingly resonant.",
      "author": "Brett McCracken"
    },
    {
      "text": "The inner workings of a growing mind is captured in a fantastic fun way in Pixar‘s sequel that will charm children, adults, philosophers and psychologists alike",
      "author": "Mini Anthikad-Chhibber"
    },
    {
      "text": "Ultimately, \"Inside Out 2\" is about Riley discovering herself and maybe even discovering that she might be more than just one thing. It's a really special movie and I definitely teared up!",
      "author": "Stacey Yvonne"
    },
    {
      "text": "Inside Out 2 has become a very strong film that perfectly combines humor and heart and shows you what it is like to have to go through emotional chaos as a young person. [Full review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Move over Bambi, there is a new weepy cartoon in town.",
      "author": "Jonathan Dean"
    },
    {
      "text": "What matters is that the filmmakers made a good film following in the footsteps of a great one.",
      "author": "Tim Brennan"
    },
    {
      "text": "Riley's expanded internal universe offers new places to discover. There may be less imaginative audacity, but the pace is maintained throughout the movie. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Its borderline-necessary messaging doesn't render it completely invulnerable, but should Pixar be up to it, they've earned an 'Inside Out 3'.",
      "author": "Charlotte Simmons"
    },
    {
      "text": "While the four new emotions introduce fun and inventive layers to Riley's brain, the core structure of Inside Out 2 is nothing but a retread",
      "author": "Ryan Oquiza"
    },
    {
      "text": "The storyline makes little sense and the main Emotion antagonist doesn't visually fit into parameters set by the already established characters.",
      "author": "Jana Monji"
    },
    {
      "text": "Banks on the original’s charm and concept to pull the viewer’s emotional heartstrings, albeit forcefully and without earned tenderness.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "This was a return to form for Pixar theatrical releases! The new emotions worked really well, particularly Maya Hawke as \"Anxiety\". I loved the quirky comedic moments and emotional depth.",
      "author": "Brandon Collins"
    },
    {
      "text": "It doesn't have the same emotional gut punch from the original, but I really enjoyed how they illustrated the different emotions and told a different story that was worthy of continuing with these characters.",
      "author": "Tatiana Albandos"
    },
    {
      "text": "Insightful and delightful, it's one of Pixar's best films in recent years. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "The story retreads old themes, reminding us once again to avoid suppressing aspects of ourselves. But familiar messages somehow feel appropriate for a movie that transports viewers to that liminal state between childhood and adulthood.",
      "author": "Collin Garbarino"
    },
    {
      "text": "Another mid-tier Pixar sequel struggles to find its sense of self, coasting purely on cleverness. There are moments of joy, but it feels like a step down compared to the first film and Turning Red.",
      "author": "Eric Marchen"
    },
    {
      "text": "The imagery is smart, but it has the feeling of an educational children’s book. The movie‘s internal logic tests our own belief systems and fails to impart anything profoundly insightful to an adult audience.",
      "author": "Katie Walsh"
    },
    {
      "text": "One of the rare sequels that not only matches the original, but may also surpass it.",
      "author": "Doug Walker"
    },
    {
      "text": "It all adds up to an OK sequel that likely won't find itself on as many Ten Best lists as its ultra-memorable original did, with a tale that implies and even states: \"You feel less joy when you grow up.\" Just don't readily believe it, kids.",
      "author": "John Urbancich"
    },
    {
      "text": "Way more fun than therapy! Anyone who’s experienced puberty, no matter how long ago, will appreciate it. We are reminded that just because we grow up doesn’t mean we’re not still dealing with Embarrassment, Ennui, Envy and especially Anxiety.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Inside Out 2 is an all-around impressive directorial debut from Kelsey Mann...It more than lives up to the legacy of Inside Out, giving a much more nuanced and well-developed exploration of its genius concept.",
      "author": "Nicole Ackman"
    },
    {
      "text": "Coming from a studio that tends to match the eye rolls regarding news of a sequel with quality follow-ups, it’s an underwhelming result but still pleasant enough in spots and surely satisfying for those more closely aligned with Riley.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Seeing Anxiety from this perspective is somewhat eye-opening for anyone who’s struggled with it and may be a good lead-in for parents to talk to their kids about the emotion, which can be confusing and potentially stifling at times.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "If there's any Pixar movie that deserves a sequel, it's Inside Out 2. All the new emotions have their place and they all have their moment.",
      "author": "Korey Coleman"
    },
    {
      "text": "This is summer’s “must see” movie; especially for parents and tweens and teens as it’ll spark a conversation and perhaps even help kids understand what’s happening at this very tumultuous time in their lives.",
      "author": "Pamela Powell"
    },
    {
      "text": "It is a testament to human endurance and the profound impact of solidarity. Kabir Khan has crafted a compelling narrative that pays homage to Murlikant Petkar's legacy, leaving audiences inspired and moved by his indomitable spirit.",
      "author": "Devesh Sharma"
    },
    {
      "text": "This new work does not quite plumb the emotional depths of the first movie, but it is just as smart and entertaining.",
      "author": "John Lui"
    },
    {
      "text": "Anxiety might not be pleasant, but as Inside Out 2 will remind both teenagers and their parents, that doesn’t make it any less essential a part of growing up.",
      "author": "Dan Kois"
    },
    {
      "text": "Inside Out 2 is a film whose genius lies in the fact that it embraces the idea that it is possible to transform ourselves without losing our essence. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "Inside Out 2 misses that quest for excellence and instead goes for good enough.",
      "author": "Alan Ng"
    },
    {
      "text": "INSIDE OUT 2 is a great family film with beautiful animation and an emotional core that has made Pixar films stand out for decades. It’s not as good as the original, but this does course correct from some stumbles in the past.",
      "author": "Kevin Carr"
    },
    {
      "text": "Inside Out 2 is a worthy sequel in its amusing and touching story of emotions that often conflict with each other inside a 13-year-old girl. The voice cast performances and visuals are stellar, even if the overall plot has no real surprises.",
      "author": "Carla Hay"
    },
    {
      "text": "Inside Out 2 manages to recapture the charm of its predecessor while exploring more mature themes and profound emotions. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Sometimes you want a comfort watch, and Inside Out 2 is perfectly suited for that. Just don’t expect all those emotions to hit the same way they did the first time around.",
      "author": "Cindy White"
    },
    {
      "text": "Surpasses the first film in every way. A therapy session for adults, while simultaneously presenting itself as a blueprint of the mind for young children. Such a fun hilarious adventure, and a return to form for Pixar.",
      "author": "Brandon Avery"
    },
    {
      "text": "Pixar’s most emotionally powerful movie of the past 15 years.",
      "author": "Tasha Robinson"
    },
    {
      "text": "While it doesn’t surpass the wildly imaginative original the way Toy Story 2 did, it's still an outstanding successor. That is no small feat considering how high the bar was set.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Inside Out 2 merges the perspectives of kids and adults in the most amazing way.",
      "author": "Ganesh Aaglave"
    },
    {
      "text": "Inside Out may have been the best of all Pixar films, but what made it so owes to a premise that went beyond childhood innocence to imagine everyone’s psychology. Now, Inside Out 2 resorts to trite, “family movie” insipidness.",
      "author": "Armond White"
    },
    {
      "text": "While Inside Out 2 wasn’t totally necessary, it makes a good case for feeling like a natural progression. This isn’t new territory, but it does further develop the first film’s central ideas in meaningful ways.",
      "author": "Abby Olcese"
    },
    {
      "text": "Inside Out 2 is a sequel that makes sense. Puberty brings with it a whole new set of emotions, so this follow-up is able to stay true to the spirit of the original while also moving naturally in a fresh direction.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Although there are some fun expansions to the established world, the film essentially colours within the lines, taking few risks and sticking to a tried-and-tested formula. It’s a timid offering from a once-bold studio...",
      "author": "Hannah Strong"
    },
    {
      "text": "It’ll probably do a billion dollars because it is so perfectly, nebulously, inoffensively “just okay.” And yet, there’s something neat about telling young people that emotions of all kinds are valuable.",
      "author": "Ryan Syrek"
    },
    {
      "text": "In further developing a daring conceit, the filmmakers create ever more opportunities for the whole thing to collapse on itself. They mostly keep things upright, but metaphors are strained near to the breaking point in the process.",
      "author": "Richard Lawson"
    },
    {
      "text": "As in the first movie, the goal is to strive for balance, embrace complexity and learn to be OK with imperfection. I’m trying to do that myself with Inside Out 2, which, despite its many pleasures, is a pretty imperfect movie.",
      "author": "Justin Chang"
    },
    {
      "text": "“Inside Out 2” still sparkles from its lovable characters and relatable storylines told through emotions we all have. Providing a family-friendly avenue to discuss our feelings and mental health with loved ones.",
      "author": "Susan Kamyab"
    },
    {
      "text": "Inside Out 2 is so beautifully realized that one almost can’t believe that someone actually got an animated sequel right.",
      "author": "Steven Prokopy"
    },
    {
      "text": "The film is set almost entirely in a three-day ice hockey camp for girls. Ice hockey! To non-American viewers, this is about as exciting and significant as competitive calligraphy.",
      "author": "David Sexton"
    },
    {
      "text": "This toon may get stuck in your head -- in a good way. A great one to treat the grandkids to.",
      "author": "Thom Geier"
    },
    {
      "text": "As in Pixar’s house animation style of fuzzy, phosphorescent, and physically coherent surfaces, this summation is a safely hedged bet, and suggests any route toward the varieties of experience that children actually remember will remain safely not taken.",
      "author": "Michael Scoular"
    },
    {
      "text": "Just as you'd expect, it's sweet, funny, sad, and clever throughout. It's a great ride that can be enjoyed while giving something to discuss as well as maybe some grace in understanding and remembering what happens in the mind during big life changes.",
      "author": "Paul Salfen"
    },
    {
      "text": "For those viewers who are currently awash in the tumult of adolescence (and those who remember it clearly), Inside Out 2 feels remarkably true.",
      "author": "Sean Collier"
    },
    {
      "text": "A pointedly funny and observant parable of teen angst that has a lot to say about the state of youth today.",
      "author": "Kyle Smith"
    },
    {
      "text": "The good news is that “Inside Out 2” is a wonderfully entertaining picture with a story that justifies its existence and lays the groundwork for another installment, maybe even more.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "While Inside Out 2 may not quite reach the heights of its predecessor, this is a Pixar delight that is artful in both its concept and execution. So see it, but remember to keep your emotions in check.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Rarely does a sequel hit as hard as the original, but Pixar’s Inside Out 2 is a beautiful gift that reminds us of how vital all our feelings are.",
      "author": "Gissane Sophia"
    },
    {
      "text": "Inside Out 2 has a very similar scenario to the first film but it's done well. It's a solid sequel than then, in the final act, delivers that Pixar magic in a film that is very directly about battling anxiety.",
      "author": "Eric Goldman"
    },
    {
      "text": "A successful update that takes the concept in creative and rewarding directions. Also, its colorful universe looks fantastic, especially in IMAX.",
      "author": "Stephen Silver"
    },
    {
      "text": "I will never not appreciate the way these characters give us a fun visual language that makes it easy to talk through emotions with our kids. But the sequel doesn’t land the emotional wallop and the catharsis that the first movie did.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "Underneath Joy's primary mission is that secondary fear of the unknown that lies ahead. And the genius of this and other Pixar movies is that it faces this fear and comes out the other side.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The straightforward beauty and eloquence of the first film isn’t present in Inside Out 2, but that doesn’t mean it’s anything other than brilliant.",
      "author": "Tom Beasley"
    },
    {
      "text": "It’s growing up like its human protagonist. Thanks to Anxiety—the best new addition—Inside Out 2 leaves its old sense of self behind. But it’s an expansion, not an evolution. It knows it cannot top its predecessor.",
      "author": "Akhil Arora"
    },
    {
      "text": "If you like puns and you don’t mind therapy-talk, you’ll likely find much to love with Inside Out 2. ... But it does feel empty in a way the first simply wasn’t.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Why is the sequel never the equal? Mostly because the surprise goes poof, along with the kick of originality. This followup to the animated Oscar-winning 2015 original can't do much about that, except deliver charm in sweet abundance. So why resist?",
      "author": "Peter Travers"
    },
    {
      "text": "The sequel to Inside Out is terrific, smartly navigating the rough terrain that is puberty to showcase its beloved foundational emotions while introducing a new roster of well-developed characters.",
      "author": "Karen Gordon"
    },
    {
      "text": "A perfectly okay movie, but it just never quite hits the mark as the first film.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "The latest Pixar sequel will turn you \"Inside Out\" with feelings.",
      "author": "Linda Cook"
    },
    {
      "text": "Inside Out 2 adds more emotions into the mix as Riley becomes a teenager while not straying too far from the magic of its predecessor.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Inside Out 2 runs the gamut of emotions, creating an epic odyssey about growing up and the turbulent emotions young teens exhibit during that process. As far as sequels go, it’s among Pixar’s best work.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "Inside Out 2 grows with Riley, and by doing so, it shows its audience a spiritual mirror that reflects their own self-image. It’s worth peering into. It’s even more difficult to forget.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Inside Out 2 is a winner because it’s thought provoking in addressing how the coming of age passage can be difficult, awkward and beautiful all at once!",
      "author": "Kevin Sampson"
    },
    {
      "text": "The first film took most of the chances and was justifiably rewarded. The sequel finds new avenues to explore but in a more crowd-pleasing, less challenging vein.",
      "author": "Mark Keizer"
    },
    {
      "text": "While you’re not quite going to get the headrush of concept again, the new film more than makes up for it with a striking examination of how the rampant anxiety of your teenage years can throw your entire equilibrium out of whack.",
      "author": "Cory Woodroof"
    },
    {
      "text": "While the second instalment doesn’t quite pack as much of an emotional punch, it’s still an incredibly creative, wonderfully animated & thought-provoking journey.",
      "author": "Nicola Austin"
    },
    {
      "text": "Whip smart and sharply funny, “Inside Out 2” probably works best for older kids and adults, so find a kid you can take with you as an excuse.",
      "author": "Russ Simmons"
    },
    {
      "text": "Two words ... Magnificent & Masterpiece. It's hard to say it's superior to the original, but it's certainly a significant evolution. with stunning animation, action, laughs & characters that exhibit and project integrity to the very last frame. Pixar!",
      "author": "Patrick McDonald"
    },
    {
      "text": "True, the plot is basically a redo of the first film... but the writing’s sharp, the animation is delightful and, unusually for a modern-day family film, at a tight 95 minutes it doesn’t outstay its welcome.",
      "author": "Alistair Harkness"
    },
    {
      "text": "There’s a comfort in knowing that we’re all a little crazy. That’s what makes this movie so special.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Inside Out 2 is Pixar at its finest! A much-needed entertaining family comedy that's intelligent, funny & heartwarming. Not only is it up to par with the 2015 original, it's also one of Pixar's best sequels ever. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "It feels like it has gone through too many cooks and the ingredients are less appetising, getting very complicated and yet strangely slow.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "I got enough laughs out of the new emotions to essentially enjoy Inside Out 2. But although it’s often charming and relatable, it’s a letdown when you consider the heights such a project could reach.",
      "author": "David Sims"
    },
    {
      "text": "A wonderfully clever sequel that ages up the concept with one dreaded word: Puberty. Whatever one’s age, there’s much to like in a movie that offers the requisite laughs and sweetness, while managing to feel quite profound.",
      "author": "Brian Lowry"
    },
    {
      "text": "But there is something that elevates this film above the most recent entries of mass entertainment: concision. [Full review in Spanish]",
      "author": "Leonardo D'Esposito"
    },
    {
      "text": "Sweet, safe and satisfying, this Pixar sequel should reverse studio's downward trend.",
      "author": "Christian Toto"
    },
    {
      "text": "Inside Out 2 is a Pixar triumph that, arguably, even overshadows the first film, precisely because it deals with a period of life that is rife with confusion and uncertainty.",
      "author": "Razmig Bedirian"
    },
    {
      "text": "This is probably its best film since Coco, and best sequel since Toy Story 3.",
      "author": "Olly Richards"
    },
    {
      "text": "If there’s a familiarity to this overall arc that keeps this sequel from being the imaginative revelation the first Inside Out was, it’s also true that this tale isn’t usually told with so many vivid and funny details.",
      "author": "Michael Gingold"
    },
    {
      "text": "While a perfectly pleasant experience at the movies, Inside Out 2 doesn’t feel as complex or sophisticated as its predecessor. It's clever and there are laughs, but we recommend you temper your expectations if you hold the first one in high regard.",
      "author": "Dana Han-Klein"
    },
    {
      "text": "...some of the greatest pathos in a Pixar production, right up there with WALL-E and TOY STORY 3.",
      "author": "Jeff York"
    },
    {
      "text": "One of the best sequels Pixar has done. Anxiety and the other new emotions bring a whole new level of complexity to Riley that hits you in the heart. The original may still reign king, but Inside Out 2 is not far behind as it unlocks a new core memory.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "This second helping  — delivered under the direction of Kelsey Mann — keeps faith with the spirit of the 2015 original while offering fresh perspectives, a welcome change for a sequel.",
      "author": "Robert Denerstein"
    },
    {
      "text": "For every clever idea, there are several that are relatively clumsy. An eager voice cast—all of whom personify their emotions or characters with ease—cannot quite smooth over a vague mix of action and subtext.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Following a massively impactful and beloved film like Inside Out is an intimidating task, but Anxiety and the group of new emotions...add new layers and laughs to the sequel that give it a fresh feel.",
      "author": "Ron Seoul-Oh"
    },
    {
      "text": "If the movie overall lacks the enchantment—and the depth—of its predecessor, and can come across as desperate at times, there are plenty of engaging moments along the way.",
      "author": "Frank Swietek"
    },
    {
      "text": "Inside Out 2 is more metaphor than meaning. It explains plenty about the confusing emotions associated with puberty, often in intelligent ways, but it rarely lets them be felt or experienced, the way its predecessor did.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Though it will probably assist most younger viewers if they have already seen the first movie, there can be no denying Pixar has crafted a refreshingly original work that will warmly resonate with all ages.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A perfectly enjoyable, reliably entertaining, if safer and less awe-inspiring second installment in what could be a long-running franchise if Pixar so wanted.",
      "author": "Jake Kring-Schreifels"
    },
    {
      "text": "More poignant than an out-and-out tearjerker, the observations of Inside Out 2 may still get adults a little misty.",
      "author": "Amy Amatangelo"
    },
    {
      "text": "There's so much for them to have fun with in here in terms of just how people operate. That's what I felt about the previous movie, and I felt they really captured the magic of that in this sequel.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Like Wish before it, Inside Out 2 plays just fine in the moment.",
      "author": "Kristen Lopez"
    },
    {
      "text": "\"Inside Out 2\" stays on beat. Things happen just when you think they will or want them to, and in some cases, you get the joke right before the character makes it.",
      "author": "Michael J. Casey"
    },
    {
      "text": "The film is wise enough to keep going with what the original film did so well.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Welcome back, Pixar. Inside Out 2 is relatable to most ages and adds more maturity and empathy to the messiness that life can be. I felt seen.",
      "author": "Tania Lamb"
    },
    {
      "text": "Inside Out 2 is not one of Pixar’s best all-time sequels, nor does it surpass the original, but the film is entertaining, emotional, and memorable all the same. It’s Pixar doing what Pixar does best.",
      "author": "Germain Lussier"
    },
    {
      "text": "Doubtless Inside Out 2 plays well for adults and kids alike. It just does not quite touch the genius of its predecessor.",
      "author": "James Mottram"
    },
    {
      "text": "Like the best of Pixar, Inside Out 2 is doubled edged. It’s an adventure story for kids, but one that transcends the form with abstract, adult thoughts on the things that make us, us.",
      "author": "Richard Crouse"
    },
    {
      "text": "Inside Out 2 attempts to tell a tale about the messiness of puberty but ends up being extremely messy itself, with none of the realism and subtlety that made the first film so celebrated.",
      "author": "Joey Rambles"
    },
    {
      "text": "Inside Out 2 is a brilliantly animated sequel that delivers a rollercoaster of emotions with great voice acting. The film tackles important messages about authenticity and anxiety, though it will undoubtedly attract the ire of Disney and DEI haters.",
      "author": "Julian Roman"
    },
    {
      "text": "Hilarious, heartwarming, and hugely entertaining, 'Inside Out 2' does everything a great sequel should.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A direct sequel that gets to skip a lot of the complicated explanations and \"here's how this works\" tutorials in favor of putting audiences through a 96-minute therapy session.",
      "author": "Jon Negroni"
    },
    {
      "text": "A delightful, heartfelt and captivating experience for the whole family.",
      "author": "Avi Offer"
    },
    {
      "text": "This is a Pixar sequel in the good mode of Toy Story, as opposed to the shakier territory of Monsters University and Finding Dory. The story is well thought-out, the animation is attractive, and the voice performances are wonderfully entertaining.",
      "author": "Grant Watson"
    },
    {
      "text": "Skillfully expands on its predecessor, introducing new emotions and navigating teen complexities. While not as groundbreaking, it delivers humor, heart, and a valuable message on emotional balance.",
      "author": "Jason Escamilla"
    },
    {
      "text": "A splendid return to form featuring the core qualities that define the best of Disney/Pixar missing from their recent misfires – namely, a strong, emotionally driven story with lots of visual gags, loveable characters and, of course, top-shelf animation.",
      "author": "Jim Schembri"
    },
    {
      "text": "Inside Out 2 doesn’t have the heft of the original but follows in its spirit with some relatable poignancy and new emotions that people will appreciate.",
      "author": "Nadine Whitney"
    },
    {
      "text": "Inside Out 2 is the rare Pixar sequel that justifies its existence as a moving, human experience that embraces the magic of the animated form.",
      "author": "Prabhjot Bains"
    },
    {
      "text": "There is no animation Godfather II. And Inside Out 2 isn’t the first. But it’s still a terrific time at the movies… even if we wish it aspired to a bit more and was a bit more daring.",
      "author": "David Poland"
    },
    {
      "text": "\"Inside Out 2\" dives deep into what makes us human, the journey we go through in dealing with our emotions, and the often hilarious intersections of thought we face when confronted with daily activities.",
      "author": "Matthew Creith"
    },
    {
      "text": "Overflowing with imagination and brilliance, treating anxiety with the same sensitivity, relatability, and valuable insight the first film did for depression",
      "author": "Robert Kojder"
    },
    {
      "text": "It’s a resonant, profoundly fulfilling piece of work that captures the relatable drama of how a flurry of emotions emerges in teendom, yet these rather impulsive feelings never go away; we just learn to manage them better, rather than them managing us.",
      "author": "Brian Eggert"
    },
    {
      "text": "Inside Out 2 is so enjoyable, emotional and entertaining that Pixar might as well start working on a third installment now. This is a franchise that doesn’t need to worry about bottling its emotions anytime soon.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "I felt as though I was watching two different movies competing for screen time, one eliciting a two-star shrug, the other making me tear up and putting a lump in my throat.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "Impressively captures the same magic as its predecessor while dealing with more complex themes, which will undoubtedly resonate with people of all ages.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "Like the best Pixar movies, Inside Out 2 is destined to spark important conversations among families who see it. [Full review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "“Inside Out 2” is indeed a creative and emotional triumph for Pixar, and it’s not only one of the best movies of the year, it’s one of the best animated films ever made.",
      "author": "Randy Myers"
    },
    {
      "text": "Inside Out 2 is a delight both visually and in the field of physical comedy. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Inside Out 2 is a winner From Pixar and a moving testament to the need to love all of ourselves.",
      "author": "Joey Magidson"
    },
    {
      "text": "The film’s visual complexity isn’t matched by the actual journey the core emotions take back to the forefront of Riley’s mind, which can’t help but feel like a more convoluted retread of the first Inside Out’s abstract buddy comedy.",
      "author": "Justin Clark"
    },
    {
      "text": "She is, in essence, the new Andy, and if Pixar dares to push the series further into bolder directions, it may very well be the successor to the Toy Story franchise.",
      "author": "Liam Maguren"
    },
    {
      "text": "A charming work, Inside Out 2 never loses sight of its overall heart.",
      "author": "Courtney Small"
    },
    {
      "text": "Inside Out 2 is a good film that takes advantage of its concept to explain in a pleasant way and with a touch of rawness the inner workings of the human mind, in this case, that of a teenager. [Full review in Spanish]",
      "author": "Laia Cabuli"
    },
    {
      "text": "Inside Out 2 deserves praise for tackling the issue of anxiety for young woman, and finding a way to do it with humor and respect.",
      "author": "Travis Hopson"
    },
    {
      "text": "Less a quick cash grab and more of a natural progression...",
      "author": "Josh Larsen"
    },
    {
      "text": "Life, Inside Out 2 argues, is what we make it, because of the good things we experience and in spite of the bad.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "It may not be as phenomenal as the first movie, but there is a lot of heart in this film that deals with all the trials of growing up.",
      "author": "Jonathan Sim"
    },
    {
      "text": "A sweetly entertaining followup, even if its necessity is undoubtedly in question.",
      "author": "Mike Massie"
    },
    {
      "text": "Kelsey Mann was able to expand on what seemed like a complete story in the original film and tell a new and potent one, and that’s impressive and commendable even though — like many Pixar films — it falls apart in the details.",
      "author": "William Bibbiani"
    },
    {
      "text": "Inside Out 2 has a big heart and enough moving moments to win over this critic.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It’s an achievement that the sequel, “Inside Out 2,” manages to come even close to the original’s wit and insight into the mind of a girl.",
      "author": "Sean P. Means"
    },
    {
      "text": "Effective and entertaining in its own right, though it just shows how far Pixar still has to go if they really want to complete the challenge of surpassing rather than just rehashing themselves in the years to come.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Disappointingly, the film’s PG rating keeps the two sensations we’d be most curious to see get a dusting of Disney magic — PMS and Libido — from crashing Riley’s hormonal rager.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Inside Out 2 didn't need to be this good – it just needed to remain upright for 90-odd minutes so that it wouldn't ruin the original. In the end, it turned out to be almost as magical.",
      "author": "Chris Wasser"
    },
    {
      "text": "The Emotions are a lot of fun, partly because the voice work is so funny and distinctive, but the geographical features of the candy-coloured land they inhabit are so lacking in variety it’s easy to lose your bearings.",
      "author": "Sandra Hall"
    },
    {
      "text": "While not as innovative as the original, “Inside Out 2” offers a relatable take on very raw and very real adolescent emotions. An all-star cast, including some returning voices, delivers the same tempo and tone that made the first so endearing.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "A utility belt kind of film, Inside Out 2 gets the job done, which is exactly as inspiring as it sounds.",
      "author": "Kimberley Jones"
    },
    {
      "text": "It’s whipsmart, funny and chockablock with predictably clever touches. The voice acting is top-notch. But, well-made though the film undeniably is, there is nevertheless a missing magic that so often occurs when there’s a “2” in the title.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Inside Out 2 offers a deeper and wider look into Docter’s vision that brilliantly conveys the messiness of clashing emotions. While it doesn’t quite reach the highs of its predecessor, there is enough joy and creativity here to justify a sequel.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "The film proves that Inside Out is the most mature and relatable of all Pixar franchises.",
      "author": "Alex Bentley"
    },
    {
      "text": "A very fun adventure that flies by, but also one that plays it too safe and will leave much less of an impression than its predecessor [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Inside Out 2 may be the most “meh” Pixar film the studio has ever made. The film isn’t particularly funny and suffers from unusual tonal dissonance.",
      "author": "M.N. Miller"
    },
    {
      "text": "Amy Poehler continues to show why she’s been one of the smartest casting choices in Pixar history, and Maya Hawke is a riot as Anxiety. She perfectly nails all the nuance that can come from anxiety",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Nothing in Inside Out 2 matches the gut-punch of Bing-Bong’s sacrifice in the first movie, although Riley's climactic self-image, a mixture of both Joy and Anxiety’s handiwork, brought my inner Verklempt emotion to the foreground.",
      "author": "Alonso Duralde"
    },
    {
      "text": "For all its ambition and visual ingenuity, Inside Out 2 never once risks approaching the grace or emotional complexity of its predecessor, even as it adds a literal quartet of new emotions to Riley's subconscious repertoire.",
      "author": "David Crow"
    },
    {
      "text": "As they did before, Pixar has personified and made literal an array of internal and abstract concepts with wit, charm, and telling detail. Erik Erickson and Karl Jung would be impressed.",
      "author": "Nell Minow"
    },
    {
      "text": "“Inside Out 2,” a zippy yet gooey animated quest about belonging and individuality during teenage girlhood feels like a final, albeit predictable, return to normalcy.",
      "author": "Robert Daniels"
    },
    {
      "text": "Inside Out is the franchise that could most naturally run forever, as there are intimate possibilities to explore pivotal life moments from this interior perspective. Follow Riley to college, postgrad life, her wedding, having kids, growing old.",
      "author": "Fred Topel"
    },
    {
      "text": "I couldn’t love it more if I cried, I mean, if I sighed…what I mean is, I don’t have to try. The love for INSIDE OUT 2 is real.",
      "author": "Sherin Nicole"
    },
    {
      "text": "The film serves its purpose of setting up Riley’s journey into those teen years, reminding audiences of the importance of our feelings but never letting them define us. The film is a bit of a mess in the second half, but that’s just how life is",
      "author": "Laura Sirikul"
    },
    {
      "text": "It may take place in the head, but this brilliantly zany puberty parable ultimately lands squarely on the heart.",
      "author": "Neil Pond"
    },
    {
      "text": "Cute and entertaining, but far from one of Pixar's classics.",
      "author": "Chris Bumbray"
    },
    {
      "text": "The way they expand upon this idea as we experience Riley’s emotional development is fantastic... Pixar has once again captured the perfect amount of heart, mixed with some powerful and relatable teenage emotions.",
      "author": "Austin Burke"
    },
    {
      "text": "...either meant as a really tongue-in-cheek bit of Disney–Pixar self-parody, or a thorough cry for help from the Pixar animators",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "It’s adorable. Sure, much of it follows ground already trodden in the first film, but it finds that same sweet balance of tears and laughter.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Like the 1st Inside Out, Pixar wants you to know it's okay to feel bad rather than trying to make you feel good... Also, Riley acts out in serious and alarming ways. But Anxiety is an amazing character and the movie is entertaining with interesting ideas.",
      "author": "Grace Randolph"
    },
    {
      "text": "Those looking to re-experience the tear-jerking emotional heft of Inside Out won’t find that here, although the climatic scenes are sweet. It’s less joy than it is moderate satisfaction.",
      "author": "Emily Zemler"
    },
    {
      "text": "Inside Out 2 is ABSOLUTELY DELIGHTFUL and one of the most POWERFUL Pixar films ever made. A beautifully crafted and emotionally mature sequel that stands side by side with the original. A MUST WATCH for all ages!",
      "author": "Daniel Baptista"
    },
    {
      "text": "In more ways than one, Mann’s movie feels like a much-needed feature-length refuge from today’s anxiety-producing devices. Unlike many of Pixar’s moving metaphors of parenthood, this one is, affectingly, for the kids.",
      "author": "Jake Coyle"
    },
    {
      "text": "It’s not just a fitting sequel; it’s one of the studio’s best films in years.",
      "author": "Allegra Frank"
    },
    {
      "text": "What Inside Out 2 proves is that Pixar cannot rest on its laurels anymore.",
      "author": "Nick Johnston"
    },
    {
      "text": "With both so much going for it and so many fundamental issues, it definitely evokes one strong emotion: “meh.”",
      "author": "Michael Walsh"
    },
    {
      "text": "It’s hard to replicate the brilliance of “Inside Out,” but the next chapter in the development of Riley gets pretty close to greatness, remaining familiar but also charting new creative and emotional territory.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A really solid follow-up to the 2015 film. It's a bit more mature than the previous - which is natural, given Riley is now a teenager. It's so relatable and drives home a very heartfelt message. The writing is very clever. Definitely worth checking out!",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "It tells the truth of what it is to be human in all its beautiful, resonant complexities, but doesn’t go nearly as hard as the original – and that sorta feels like a missed opportunity.",
      "author": "Courtney Howard"
    },
    {
      "text": "\"Inside Out 2\" is buoyant and light on its feet, while also containing nuggets of insight into what makes us tick, which is plenty rewarding for a summer sequel.",
      "author": "Adam Graham"
    },
    {
      "text": "The new emotions, and the whole structure of the film, don’t feel sophisticated enough for someone suddenly experiencing the agonizing pressure of wanting to fit in and tearing herself to bits in a self-loathing effort to do so.",
      "author": "Alison Willmore"
    },
    {
      "text": "Even a curmudgeon would smile at scenes... But the movie always stiffens up again, aware of the Disney grown-ups nearby. And, like the first film, the sequel is torn between knowing cleverness and not wanting to do anything too weird.",
      "author": "Danny Leigh"
    },
    {
      "text": "a faded retread of the original featuring a similar journey through a world that seems far less imaginative.  It is telling that Riley’s reality is a lot more interesting than what’s going on behind the scenes.",
      "author": "Laura Clifford"
    },
    {
      "text": "If it doesn’t have the sparkling originality of its predecessor, it has its big heart, keen to show us how complex and gloriously messy teens can be.",
      "author": "Kate Stables"
    },
    {
      "text": "Inside Out 2 is an exuberant, brilliant swirl of teenage emotion.",
      "author": "Richard Roeper"
    },
    {
      "text": "Inside Out 2 is a fantastic, imaginative sequel that is a must-see event for all ages. Its heartwarming messages and life lessons make it an instant classic.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Inside Out 2 is interested more in expanding than redefining its predecessor, but it’s impressive how well even the film’s more familiar elements still work.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "This thoughtful, emotional (literally!) return to the world of Riley and her colorful, expressive emotions is a worthy follow-up to the original.",
      "author": "Betsy Bozdech"
    },
    {
      "text": "Inside Out 2’s view of growing up has nothing in it as powerful or real as the When She Loved Me song from Toy Story 2 – but there are a lot of entertaining moments...",
      "author": "Peter Bradshaw"
    },
    {
      "text": "It's the rare Pixar sequel that truly earns its existence and deepens the message of its first film. And even though it may make you deeply, deeply, deeply anxious, it's also, quite simply, a joy to watch.",
      "author": "Belen Edwards"
    },
    {
      "text": "Inside Out 2 in some ways reminded me of Toy Story 2. A bigger adventure, with more characters, more things to explore, & builds off the original in a beautiful way! \nReason being Inside Out 2 is another Pixar timeless classic that I completely adored.",
      "author": "Zach Pope"
    },
    {
      "text": "Inside Out 2 leans more towards greatness than redundancy & though it falls short of being one of Pixar's best, it's a worthy addition to the library.",
      "author": "Graeme Guttmann"
    },
    {
      "text": "You could be forgiven for thinking that this journey home will be a picaresque riot, a colorful flexing of the collective Pixar imagination, but there’s not much fun in this 13-year-old’s mind.",
      "author": "Damon Wise"
    },
    {
      "text": "Inside Out 2 is one of the best-written and crafted animated films I’ve seen in years and lives up to the standard that people have of Pixar. Inside Out 2 should be a big summer hit.",
      "author": "Julian Lytle"
    },
    {
      "text": "The newest example of the label’s pleasant, if far from groundbreaking, sequels, is Inside Out 2.",
      "author": "Lisa Laman"
    },
    {
      "text": "The film’s director, Pixar animation veteran Kelsey Mann, and the screenwriters, Meg LeFauve and Dave Holstein, build on the earlier film’s playful brilliance and come about as close as we could have hoped for to matching it.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "So perfectly ticks Pixar’s boxes in a way that forces the sincerity of its storytelling into a losing battle with the cynicism of its existence.",
      "author": "David Ehrlich"
    },
    {
      "text": "An imperfect but thoughtful sequel.",
      "author": "Matt Singer"
    },
    {
      "text": "As expected, the picture is a visual delight, as bright and shiny as Joy’s demeanour, but what’s most stirring is its willingness to tell children (and their parents) that they should not repress parts of themselves out of fear that they’ll be judged.",
      "author": "Tim Grierson"
    },
    {
      "text": "The new characters of Inside Out 2 are a success, and the voice actors definitely help bring them to life...The only problem is that the new characters in Inside Out 2 begin to outshine the old.",
      "author": "Paolo Ragusa"
    },
    {
      "text": "The cast-iron ontological brilliance of Docter’s original premise bears expansion well.",
      "author": "Robbie Collin"
    },
    {
      "text": "Though not as personal or interesting as Turning Red, Pixar's latest is still a smart, entertaining and engaging coming-of-age story.",
      "author": "Joey Morona"
    },
    {
      "text": "Works largely because the first one does wonderfully well. The new movie conforms to the original's ethos as well as inventive template, its conceit and visual design, so its pleasures are agreeably familiar.",
      "author": "Manohla Dargis"
    },
    {
      "text": "\"Inside Out 2\" may not reach the emotional highs of the first film, but don't be surprised when it reduces you into a sobbing mess at the end.",
      "author": "Chris Evangelista"
    },
    {
      "text": "With empathy, hope and a heap of metaphors, it's a matured \"Inside Out\" that still understands the wonders and wrinkles of being a kid.",
      "author": "Brian Truitt"
    },
    {
      "text": "Inside Out 2 kicks off the summer of sequels with delightfully joyous animated journey through the pains of adolescence.  Maya Hawke rocked!",
      "author": "Carla Renata"
    },
    {
      "text": "Inside Out 2 manages to capture all the eccentricities, complexities, and decisions that make us who we are, and turn that into one of Pixar’s best in years. What a joy it is to watch them do it.",
      "author": "Ross Bonaime"
    },
    {
      "text": "“Inside Out 2” more than justifies its existence and then some.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "What the sequel does achieve is being a worthy follow-up that expands the world with brilliant tweaks to the concept, as well as delivering witty gags that simplify big ideas.",
      "author": "Ian Sandwell"
    },
    {
      "text": "After a recent string of disappointments, I’m happy to report that Pixar has found their artistic stride again.",
      "author": "Nate Adams"
    },
    {
      "text": "Ultimately, “Inside Out 2” doesn’t quite capture the magic of the original, but it’s still an enjoyable 90 minutes at the movies.",
      "author": "Kevin Slane"
    },
    {
      "text": "Inside Out 2 manages to tell us a different story while still giving us an important message in the end: It is okay to feel all your emotions, but just remember to let Joy in.",
      "author": "Rachel Leishman"
    },
    {
      "text": "This sequel knows that when you leave childish things behind, you risk leaving key parts of the child’s personality and personal growth as well. It also recognizes that young adulthood is a different game altogether.",
      "author": "David Fear"
    },
    {
      "text": "The story beats, action sequences and sentimental moments — Joy’s despair when she’s out of ideas is quite touching — are expertly fine-tuned, and the dazzling visuals no less so.",
      "author": "David Rooney"
    },
    {
      "text": "Inside Out 2 will resonate with all ages, but particularly older viewers - tweens, teens, and adults. It's more mature than the first, but still delivers classic Pixar humor & heart. This one hits hard. One of Pixar's best.",
      "author": "Tessa Smith"
    },
    {
      "text": "This is not the innovative, cutting-edge filmmaking that Pixar built its name on. What was once the product of pure imagination feels reduced to brand obligation.",
      "author": "Barry Hertz"
    },
    {
      "text": "If I had a nickel for every time I reviewed a good-but-not-great 2024 sequel to a flat-out amazing 2015 film, I'd have two nickels, which isn't a lot, but it's weird that it's happened twice.",
      "author": "Reuben Baron"
    },
    {
      "text": "Despite the xeroxed nature of the movie's central themes, it's still some weighty stuff for a kid's film, which has its positives and negatives.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Hit me and my anxiety console to the core...but not in a cathartic Bing Bong soul crushing core memory kind of way.",
      "author": "Christie Cronan"
    },
    {
      "text": "Fans of the original can breathe a sigh of relief, for this is a film full of heart, emotion and a truck load of silly antics, with a strong message of hope and kindness.",
      "author": "Linda Marric"
    },
    {
      "text": "It's gratifying to see an ordinary and, yes, anxious 13-year-old’s life, like millions and millions of lives right now, treated as plenty for a good, solid sequel, and without the dubious dramatics of the first movie’s climax.",
      "author": "Michael Phillips"
    },
    {
      "text": "Inside Out 2 is an endearing sequel with an impactful message and plenty of humor, even though the adventure follows its predecessor’s formula with only a fraction of the emotional punch.",
      "author": "Jeff Nelson"
    },
    {
      "text": "A more than suitable and satisfactory follow-up that makes one think Pixar is making its return to greatness.",
      "author": "Edward Douglas"
    },
    {
      "text": "The writing’s often smart... But the climax can’t touch the original’s devastating power. Instead, the best that the Pixar brain trust can concoct here, for a rousing revelatory message, is that everyone needs a hug. Oh dear.",
      "author": "Kevin Maher"
    },
    {
      "text": "The film’s greatest strengths are almost entirely overshadowed by similar positive attributes found in “Inside Out,” namely its humorous creativity and recognition of the importance of complex emotions to form a fully rounded human.",
      "author": "Cody Dericks"
    },
    {
      "text": "A better-than-expected sequel that explores teenagehood in a heartfelt and humorous way.",
      "author": "Casey Chong"
    },
    {
      "text": "While still mining some pitch perfect humor and laughs (the ‘Sarchasm’ is probably the film’s best pun), the film curiously shies away from going too dark.",
      "author": "Erik Anderson"
    }
  ],
  "release_year": 2024,
  "duration": 96,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "The little voices inside Riley's head know her inside and out--but next summer, everything changes when Disney and Pixar's Inside Out 2 introduces a new Emotion: Anxiety.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/vpnVM9B6NMmQpWeZvzLvDESb2QY.jpg"
}