{
  "movie_name": "It",
  "movie_id": "bob_trevino_likes_it",
  "total_reviews": 59,
  "reviews": [
    {
      "text": "It's always heartening to see an original independent film with lived-in characters make its way to audiences, and for that reason alone, it's worth seeking out Bob Trevino Likes It.",
      "author": "Lisa Trifone"
    },
    {
      "text": "Effortlessly poignant, “Bob Trevino Likes It” is a stealthy film that sneaks up you, delivering a moving conclusion that beautifully underscores the power of kindness.  That it does so without a heavy hand, proves to be its greatest strength.",
      "author": "Charles Koplinski"
    },
    {
      "text": "The plot simplicity of Bob and Lily creating their special connection -- same last name, no relation -- becomes all anyone really needs to expect before simply enjoying this beautiful little film from first-time feature director and writer Tracie Laymon.",
      "author": "John Urbancich"
    },
    {
      "text": "The kind of hopeful movie I want to believe in.",
      "author": "Matt Pais"
    },
    {
      "text": "Jones and Leguizamo... have an easy rapport, and the device of snapshots for the scrapbooks gives them a believable past. She endows Jeanie with warmth, and also an elusive quality.",
      "author": "Betsy Sherman"
    },
    {
      "text": "Tracie Laymon’s film hits deep when reminding us that one person or one voice offering one moment of kindness can be foundational to repairing and restoring us.",
      "author": "Michael Ward"
    },
    {
      "text": "Bob Trevino Likes It tells a memorable story about friendships with unexpected people. Barbie Ferreira and John Leguizamo give admirable performances in this emotionally impactful drama about found families.",
      "author": "Carla Hay"
    },
    {
      "text": "This film showing the importance of human connection is slapstick funny and heart wrenching, often in the same scene. Laymon lets Ferreira and Leguizamo believe you can still friend good, honest people. It touched us and may touch you. Bring tissues.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "I don’t just like ‘Bob Trevino’; I absolutely love it!",
      "author": "Al Alexander"
    },
    {
      "text": "The film masterfully projects the parts of us all that crave companionship & connection. Ferreira and Leguizamo have an easy chemistry as the newly connected fellow travelers, and the way they help each other opens up is like a blossoming in spring. LIKE!",
      "author": "Patrick McDonald"
    },
    {
      "text": "If you want a balm for these difficult times, Bob Trevino Likes It is it.",
      "author": "Christy Lemire"
    },
    {
      "text": "When one performance in a movie is exceptional, you can credit the actor. But when everyone is great, it has to have at least something to do with the director. That’s the case with “Bob Trevino Likes It,” which has three standout performances.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The painfully needy main characters are almost too good to be true -- their fine qualities ignored at large, so lonely they hang onto the slightest social-media bump for dear life. Still, their performances and restrained approach are duly moving.",
      "author": "Dennis Harvey"
    },
    {
      "text": "Best to meet Bob Trevino on its own terms – with open arms and an unjudgey heart.",
      "author": "Kimberley Jones"
    },
    {
      "text": "“Bob Trevino” and its two leads all but reach out of the screen and give you a big hug.",
      "author": "Randy Myers"
    },
    {
      "text": "This is the best film so far in 2025, and an indie that is definitely worthy of a night out at the movies.",
      "author": "Danny Minton"
    },
    {
      "text": "Bob Trevino Likes It is a film that reminds us of the capabilities we all have to be better humans to each other.",
      "author": "Zach Youngs"
    },
    {
      "text": "'Bob Trevino Likes It' reminds us that valuable human relationships can occur randomly and that spiritual connections can be far more powerful than bloodlines.",
      "author": "Mark Jackson"
    },
    {
      "text": "Ferreira and Leguizamo transform what could've been an overly saccharine concept into a heartwarming tale that at the end managed to leave us actually feeling a smidge of hope about humanity.",
      "author": "Dana Han-Klein"
    },
    {
      "text": "A brisk, likeable film with characters that feel both real and literary, clichéd yet comfortingly convincing. It’s this challenging balance that makes Laymon’s film that much more satisfying.",
      "author": "Jason Gorber"
    },
    {
      "text": "A forced dramedy about a young woman who finds a substitute father on Facebook, the film nonetheless finds moments of genuine feeling in Barbara Ferreira’s warm. energetic lead performance.",
      "author": "Liam Lacey"
    },
    {
      "text": "Laymon’s film is a personal, reflective journey about the importance of working through trauma — complex and conflicting turns build toward an ultimate catharsis.",
      "author": "Bill Cooper"
    },
    {
      "text": "What matters, in a movie like this one, is that we believe what takes place between the characters -- who they are and the ways they connect, and how their relationship evolves.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Ferreira and Leguizamo keep this production emotionally engaging even as Bob Trevino Likes It dabbles in too many big monologues and standard shot choices for its own good.",
      "author": "Lisa Laman"
    },
    {
      "text": "It's an indie gem about the profound joy of unexpected friendship. The budding connection between Lily and Bob is wonderful to watch, even when it sometimes descends into mawkishness.",
      "author": "Ruth Maramis"
    },
    {
      "text": "A deeply moving and beautifully crafted story of found family featuring a powerhouse performance from Barbie Ferreira and a heartfelt connection that will leave you in tears—both of sorrow and joy.",
      "author": "Stephanie Malone"
    },
    {
      "text": "An earnest crowd-pleaser that generates both laughs and tears, this compassionate saga of redemption, mistaken identity, and human connection is driven by winning characters who overcome the narrative cliches.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "“Bob Trevino Likes It” is overly convenient but touching, nonetheless.",
      "author": "Peyton Robinson"
    },
    {
      "text": "is just the thing for a positive, warm feeling. … low key, sweet adventures glow with positivity in this feel-good film we all need.",
      "author": "Anne Brodie"
    },
    {
      "text": "As evidenced by the emotional acuity she shows in her first starring role, Ferreira has a long, Leguizamo-like career trajectory in front of her.",
      "author": "Oliver Jones"
    },
    {
      "text": "Not so much a tear-jerker as an extreme tear-juicer, but its heartfelt and endearing performances earn your sobs.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Ferreira pitches herself into the trite story line with enthusiasm, and her verve breathes life into even the most leaden lines.",
      "author": "Natalia Winkelman"
    },
    {
      "text": "A deeply moving film, and a passionate, uplifting paean to the importance of found family.",
      "author": "Chloe Walker"
    },
    {
      "text": "I wasn’t ready to feel as invested as I was with the people involved here, and yet Bob Trevino Likes It managed to pull off something special.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "The result is a disarmingly empathetic film, with terrific, lived-in performances from Ferreira ... and Leguizamo...",
      "author": "Mark Dujsik"
    },
    {
      "text": "A feel good tearjerker, Bob Trevino Likes It could easily have slid into easy platitudes and sentimentality but director Tracie Laymon displays a light touch, even when dealing with difficult topics.",
      "author": "Richard Crouse"
    },
    {
      "text": "An unabashed and very effective tearjerker, writer/director Tracie Laymon knows exactly how thick to lay it on.",
      "author": "Jim Schembri"
    },
    {
      "text": "Bob Trevino Likes It earns more than the generic “like” reaction; it gets heart and sad-face emojis. Barbie Ferreira and John Leguizamo have impeccable chemistry, eliciting laughter and smiles through a profoundly touching friendship",
      "author": "Robert Kojder"
    },
    {
      "text": "The type of twee indie that is perfectly able to please festival audiences when they’re in rooms filled with like-minded individiuals ... once it’s over, you wonder why you bothered wasting your time.",
      "author": "Edward Douglas"
    },
    {
      "text": "Bob Trevino Likes It reminds us that the simplest act of humanity can leave a lasting impression on somebody. Being kind to people doesn’t take much effort and can change a person’s life for the better.",
      "author": "Emma Vine"
    },
    {
      "text": "[Laymon's] screenplay lacks subtlety, Lily's dad's over the top selfish insensitivity borderline villainous, but her direction of Ferreira and John Leguizamo, so touching in how they affect each other's characters' lives, wins you over.",
      "author": "Laura Clifford"
    },
    {
      "text": "An honest, heartfelt and captivating story about the importance of friendship, compassion and self worth.",
      "author": "Avi Offer"
    },
    {
      "text": "Laymon's ode to friendship is a heart-warming film, capable of pulling on heartstrings when required to produce laughs and tears in equal measure.",
      "author": "Dallas King"
    },
    {
      "text": "It has its very powerful moments, but the oddly linear, untroubled journey of its two main characters robs the film of some of its emotional authenticity.",
      "author": "Ross McIndoe"
    },
    {
      "text": "With a hat trick of strong performances from Barbie Ferreira, John Leguizamo, and French Stewart, this wonderfully personal story is filled to the brim with a seemingly endless reservoir of laughs and tears.",
      "author": "Aidan Kelley"
    },
    {
      "text": "Bob Trevino Likes It seems like a catalog of clichés made into a film. [Full review in Spanish]",
      "author": "Carlos Losilla"
    },
    {
      "text": "This film deservedly won SXSW’s grand jury prize for its commitment to endearing characters and the surprising ways in which they find each other.",
      "author": "Abe Friedtanzer"
    },
    {
      "text": "Ferreira and Leguizamo broke my heart over and over again.",
      "author": "Matt Oakes"
    },
    {
      "text": "Writer/director Tracie Laymon takes this potentially silly premise and grounds it with humor and emotion, making it one of the most moving movies I have seen in years.",
      "author": "Seth Freilich"
    },
    {
      "text": "This film embraces a hopeful path, expressing with absolute sincerity that believing in the humanity of others is essential to healing.",
      "author": "Ferdosa Abdi"
    },
    {
      "text": "Certainly, this is not the kind of a movie for a cynic or nihilist, but as far as charming movies about nice people go, Bob Trevino Likes It checks the box and then some.",
      "author": "John Fink"
    },
    {
      "text": "A sincere, sweet portrait of healing and how the strangers we meet help us recognize ourselves.",
      "author": "Rendy Jones"
    },
    {
      "text": "Bob Trevino Likes It has an authenticity which grounds a potentially outlandish narrative.",
      "author": "Nikki Baughan"
    },
    {
      "text": "The ensemble cast is exceptional together, bringing Tracie Laymon's sweet/bittersweet story to life without sentimentality, bringing every viewer along on their emotional journey.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Laymon’s film about chosen family is an authentic one.",
      "author": "Jenny Nulf"
    },
    {
      "text": "With an excellent cast of empathetic performers, it’s easy to root for Bob Trevino Likes It.",
      "author": "Alan French"
    },
    {
      "text": "Ferreira makes for a strong leading lady, great at comedic timing but full of emotional resonance in these sad scenes about a twentysomething struggling with parental trauma.",
      "author": "Fletcher Peters"
    },
    {
      "text": "Do we “like” it? We love it.",
      "author": "Samantha Bergeson"
    },
    {
      "text": "Like its heroine, the comedy can be bright and bouncy and frequently funny. But also like her, it’s secretly a tearjerker, and never more effectively than when it’s at its very sweetest.",
      "author": "Angie Han"
    }
  ],
  "duration": 102,
  "genres": [
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "BOB TREVINO LIKES IT is inspired by the true friendship that writer/director Tracie Laymon found with a stranger when looking for her father online. Often playing the role of caretaker to people like her father who should be caring for her, Lily Trevino longs for a familial connection, having been abandoned by her mother as a child and then suddenly by her father in her twenties. Bob Trevino works long hours alone at a construction company to support his wife Jeanie's scrapbooking habit. The couple has endured a lot in the past decade, and Bob has sought to put his wife first, to the point of ignoring his own feelings and need for friendship, meaning, and connection--that is, until he gets an unexpected Facebook message from a stranger. Lily and Bob's blossoming friendship becomes a vital source of connection and healing in both their lives. Bob's small acts of fatherly kindness fill a familial void in Lily's life and hold the power to change her direction forever. In their own ways, these two must both learn they are worthy of extraordinary love exemplified through small acts of kindness.",
  "popularity": 9.8
}