{
  "movie_name": "John Wick",
  "movie_id": "john_wick_chapter_4",
  "total_reviews": 384,
  "reviews": [
    {
      "text": "The John Wick franchise continues to evolve and offer a fresh perspective on the criminal underworld and delivers some of the best action and gun-play sequences.",
      "author": "Nadya Martinez"
    },
    {
      "text": "John Wick: Chapter 4 continues to bring what the franchise does best, even if gets a bit overindulgent with its stellar action at times.",
      "author": "Justin Kim"
    },
    {
      "text": "Few sequels can one-up their predecessors.",
      "author": "Tanzim Pardiwalla"
    },
    {
      "text": "Nearly three hours of bone-crushing, elegantly choreographed violence: this is what great action movies are made of.",
      "author": "Christina Newland"
    },
    {
      "text": "As much as John Wick: Chapter 4 borrows from the previous films, its immense action set-pieces and general absurdity make this a wholly worthy entry and a fantastic cinematic spectacle.",
      "author": "William Stottor"
    },
    {
      "text": "Part of the movie’s appeal can be traced to the class warfare on display. In Wick’s tired eyes and battered body, we see a symbol of the worker, whose labor is controlled by arbitrary rules and used to prop an indulgent and empty culture.",
      "author": "Joe George"
    },
    {
      "text": "It’s astounding how this franchise has steadily improved with each instalment, and this time around, Stahelski and co. laid all their cards down on the table and crafted an action masterpiece.",
      "author": "Shakyl Lambert"
    },
    {
      "text": "The resonant boom of John Wick punching shakes up the auditorium; it is enough to make you jump right out of your seat. But it serves another fundamental purpose: to acclimatize you with the heavy-handed vibe of what’s about to follow.",
      "author": "Ankit Ojha"
    },
    {
      "text": "At some point, the original premise of the franchise– “if the worst man in existence found salvation”– runs its course and the saved becomes damned again.",
      "author": "Joshua Polanski"
    },
    {
      "text": "With Chapter 4, by thine own hand, Stahelski and Reeves have cemented John Wick as one of the greatest action franchises in cinematic history.",
      "author": "Rachel Ho"
    },
    {
      "text": "What once felt like a breath of fresh air now reeks of mildew. It’s an aggressive feat of over-engineered popcorn violence that is either a mockery of its existence or, as the film says, a ghost seeking a graveyard.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Chad Stahelski’s opera of violence is one of the most artistically stirring movies of 2023.",
      "author": "Maxance Vincent"
    },
    {
      "text": "The John Wick universe is a complex blend of gun violence, vague religious imagery, and some of the best dog actors around, and the fourth installment brought the action to a new level.",
      "author": "Nina Braca"
    },
    {
      "text": "John Wick: Chapter 4 really is a visual spectacular. With amazing fight sequences and a storyline that never signposts or becomes predictable this film is a film that deserves more credit than most will give it.",
      "author": "David Griffiths"
    },
    {
      "text": "Yes, Donnie Yen plays another blind character (my theory is that filmmakers do this because nobody would buy that a Donnie Yen with two functioning eyes could ever lose a fight).",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "You might have seen some of it before, but it has never been as big and brash as it is in this chapter... an action epic for the ages.",
      "author": "Nadine Whitney"
    },
    {
      "text": "Genuine cinematic poetry.",
      "author": "Carson Timar"
    },
    {
      "text": "John Wick 4 is the ultimate action movie.",
      "author": "Cris Parker"
    },
    {
      "text": "The action is fluid and all-consuming and makes it easy to overlook some of the story’s shortcomings (too many new threads, not so seamlessly woven in).",
      "author": "Sarah Vincent"
    },
    {
      "text": "It is an incredible ride that is designed to entertain from the opening moments and the best way to enjoy it is to just hang on.",
      "author": "Rick Bentley"
    },
    {
      "text": "This series always did a stellar job of not turning John Wick into a robotic machine, and Reeves always maintained a depth to this haunted character. The tenderness of a classically Reeves-ian performance is what is missing in John Wick: Chapter 4.",
      "author": "Alisha Mughal"
    },
    {
      "text": "They understand that it is the characters, the humour, and the jaw-dropping action that keeps us coming back for more. And as long as they keep this up, even in the form of spin-offs, audiences will continue to lap it up.",
      "author": "Ilan Preskovsky"
    },
    {
      "text": "John Wick: Chapter 4 delivers a satisfying conclusion to an outstanding action franchise that never fails to impress with its stylish action sequences and portrayal of an intriguing world of assassins and codes of conduct.",
      "author": "Surya Komal"
    },
    {
      "text": "Joins both Mad Max and Mission: Impossible in the action franchise hall of fame in the wing of films that somehow keep getting more thrilling and more beautiful to look at amidst the ballet of carnage in its breathless set pieces.",
      "author": "Erik Childress"
    },
    {
      "text": "John Wick: Chapter 4 concludes the game-changing saga with a relentless, ruthless action masterclass that ultimately justifies its epic length.",
      "author": "Manuel São Bento"
    },
    {
      "text": "\"John Wick: Chapter 4\" is the best entry since the original, and it knows the mileage on John's soul is starting to reveal itself more and more. So, it smartly plans for a narrative exit ramp.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Keanu Reeves and Chad Stahelski return with trusted collaborators to their neon labyrinth featuring elevated action and a cast of adversaries and allies to create the most John Wick film in the franchise.",
      "author": "Jillian Chilingerian"
    },
    {
      "text": "The entire series is a sisyphean journey of revenge. The audience knows that John Wick (Keanu Reeves) can never be free from this life of an assassin. He’s doomed to climb that 222-step staircase to Sacre-Cœur in Paris, both physically and metaphorically.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "A Bonafide Action MASTERPIECE. \n\nCementing John Wick as one of the greatest Action Franchises of all time. Once you think you’ve seen the coolest sequence it only gets better up until the final 30 minutes which completely had my jaw on the floor.",
      "author": "Zach Pope"
    },
    {
      "text": "With John Wick Chapter 4, Chad Stahelski crafts a grand sculpture of gunplay, feverishly yet methodically chiseled until its ultimate, explosive completion. A violent, ferocious symphony that encapsulates the very reason why we go to the movies.",
      "author": "Prabhjot Bains"
    },
    {
      "text": "From the cinematography, an atmospheric score in all the right places, to a powerful conclusion in Wick’s personal’s story – it ends the franchise in the best way it ever could.",
      "author": "Emma-Jane Betts"
    },
    {
      "text": "John Wick: Chapter 4 doesn’t feel like the fourth film of a franchise; it’s an exclamation point, a high watermark for action cinema as a whole.",
      "author": "Ryan Oquiza"
    },
    {
      "text": "The world’s most deadly wife-guy returns to inflict his brand of elaborately choreographed mayhem on anyone that’s left to get in his way. If we have indeed seen John Wick’s final headshot, it’s a well-executed conclusion.",
      "author": "Kent M. Wilhelm"
    },
    {
      "text": "... in epic fashion, everything that occurred before has led to this exact destination, creating within the narrative a sense of pre-destination and inevitability.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Sensational stunts, rigorous physical blocking and camera choreography, judicious but satisfying gore, and an incongruous nod to Frogger—good stuff, Mr. Wick.",
      "author": "Adam Nayman"
    },
    {
      "text": "This might be the most impressive John Wick film since the original, one that balances its bombastic fight sequences with plenty of compelling lore and surprising emotion. Donnie Yen and Scott Adkins steal the show.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The best film in the John Wick action collection.",
      "author": "Matt Brunson"
    },
    {
      "text": "John Wick: Chapter 4 is effective in every aspect, even when it demonstrates its faults at a full glance.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "As a franchise, John Wick offers viewers a lot and does it well.  The 4K release lives up to expectations and is a must for any John Wick fan.",
      "author": "Allison Rose"
    },
    {
      "text": "By trading brains for bullets and characters for puppets, the director made the worst possible choices for this exhausting fourth chapter.",
      "author": "Filipe Freitas"
    },
    {
      "text": "John Wick: Chapter 4 packs in everything we love about John Wick, from high style to mysterious assassins to dogs to car chases to foot chases to a Looney Tunes level of gunplay. It’s the whole kitchen sink tossed on fire into oncoming traffic.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The latest installment of the John Wick franchise offers a vast canvas for stunt work and action choreography with a sincere and brooding Keanu Reeves as the anchor.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "The film’s runtime is probably its greatest flaw, but watching Wick and Yen battle it out is well worth the price of admission.",
      "author": "Erin Maxwell"
    },
    {
      "text": "I can’t say whether John Wick: Chapter 4 is better or less-good than the other Wicks, but it’s easily the funniest – and that reflects the restless creativity of its makers.",
      "author": "John Serba"
    },
    {
      "text": "The John Wick series comes to an anti-climactic and thoroughly interminable close with this absolutely endless entry...",
      "author": "David Nusair"
    },
    {
      "text": "An exhilarating action film that takes itself and its bizarre world seriously.",
      "author": "Q.V. Hough"
    },
    {
      "text": "Not sure exactly how badly we needed a fourth John Wick installment, but it is always a fun ride.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "This pulp one was more entertaining than the others in the series.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "While Tom Cruise is jumping bikes off a ramp in Norway, Reeves is whipping reverse 180s on a famous circle drive in Paris while shooting bad guys. That’s him doing just about every ounce of stunt work and fight choreography. He’s in a league of his own.",
      "author": "Dan Buffa"
    },
    {
      "text": "The whole arc, with its excesses and ridiculousness, ends up closing –but above all, it seems to condense– not only the leit motifs of the saga, but almost everything that has been choreographically action cinema of the last 20 years.",
      "author": "Agustín Acevedo Kanopa"
    },
    {
      "text": "Translation: We can consider ourselves fortunate, because this self-aware delight, committed to the cause of relentless entertainment, has transformed cinematic action into a true work of art.",
      "author": "Víctor López G."
    },
    {
      "text": "The fight scenes are so kinetic, so recklessly energetic and just so much fun that the three hours fly by like so many bullets whizzing past Wick’s head.",
      "author": "Sean P. Means"
    },
    {
      "text": "Please don't stop making John Wick movies anytime soon.",
      "author": "Kent Garrison"
    },
    {
      "text": "John Wick: Chapter 4 benefits by knowing what it is and holding fast to what works. Clean visuals, blistering action, streamlined plot progression, and cutting-edge stuntwork.",
      "author": "Frantz Jerome"
    },
    {
      "text": "John Wick 4 is a masterclass in action movies. Chad Stahelski brings his absolute best game to this film, with action sequences that leave you in awe. \n\nWith incredible stunts, sets and cinematography, it’s one of the best films of the year thus far.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Sit back, relax, mind the language, and see fight scenes to dazzle the eye.",
      "author": "Marie Asner"
    },
    {
      "text": "John Wick: Chapter 4 is not just the magnum opus of the series, it actually corrects a problem that the series has had for a while, a question we haven’t had an answer for over the last couple of films.\n\nWhat does John Wick want?",
      "author": "Travis Johnson"
    },
    {
      "text": "“John Wick: Chapter 4” is by far the strongest film of the franchise with some of the best action in film history. The rewatchability factor will demand multiple viewings, and after seeing this movie, your eyes and mind will never be the same.",
      "author": "Rosa Parra"
    },
    {
      "text": "It's up to par with all the other films in the franchise. There were moments when you could laugh. Moments where you could cry. Highly enjoyable!",
      "author": "Josie Meléndez"
    },
    {
      "text": "Its less like a [three-hour] fight sequence and more like an incredibly bonkers ballet",
      "author": "Stephen A. Russell"
    },
    {
      "text": "The best film in the series, featuring four or five action set pieces that are breathtaking.",
      "author": "Stephen Silver"
    },
    {
      "text": "There isn’t much dialogue because there never is in a movie involving hitman Wick. Once again, Keanu Reeves plays him with as much taciturn moodiness as possible. He’s sullen, silent, and strong through 169 relentlessly supercharged minutes.",
      "author": "Michael Calleri"
    },
    {
      "text": "\"John Wick 4\" hits the mark. This grand ballet of mayhem and ultra-violence goes on a bit too long but is never dull. The story threads aren’t the most complex, but Keanu and friends commit to the action and it’s stellar.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Clocking in at a hefty 169 minutes, the fourth Wick movie spreads its wings and goes full-blown epic. Every single shot is a dazzler, it has a surefooted pace, and the simple story is elevated to mythical status.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "... Overkill in more ways than one. All that said, there are some extraordinary fight sequences, leavened with cherishable wit.",
      "author": "Brian Viner"
    },
    {
      "text": "I wasn't sure the Wickiverse could ever top \"knife museum\" but then they handed our man John a pair of nunchucks and...well...",
      "author": "Brian Gill"
    },
    {
      "text": "I wasn't sure the Wickiverse could ever top \"knife museum\" but then they gave our man John a pair of nunchucks and...well...",
      "author": "Richard Bardon"
    },
    {
      "text": "No matter how a John Wick movie finishes, it ends with viewers wanting more — and this is no exception, including more of Yen as Caine alongside Keanu.",
      "author": "Sarah Ward"
    },
    {
      "text": "Who knew the Wickiverse was a (murderous) utopia?",
      "author": "CJ Sheu"
    },
    {
      "text": "A nearly three-hour orgy of mayhem that’s flashy, raucous, brainless and as nutritious as a Twinkie.  But fans will eat it up and, like Oliver Twist, ask for more.  Others might feel not just glutted by the excess but somewhat nauseated by it.",
      "author": "Frank Swietek"
    },
    {
      "text": "If there were an Oscar for \"best headshot effects\" this movie would win it.  And its over the top, senseless and overly long plot would lost it every other accolade possible.",
      "author": "J. Don Birnam"
    },
    {
      "text": "Emphasizing spectacle over substance at every slow-motion turn while trying to constantly outdo itself, this ambitious sequel feels like a director’s cut that could have benefited from some judicious trimming.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The strongest chapter in the Wick saga and of the best Hollywood action films of all time! The magnetic characters -especially Donnie Yen- anchor the brutal and beautiful torrent of mayhem. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "One last fever dream of violence and mayhem, giving viewers a final chance to watch John Wick seek the kind of revenge on the wealthy and all-powerful that we all dream about.",
      "author": "Eileen Jones"
    },
    {
      "text": "The Godfather II of action movies. Blisteringly entertaining, and packed with some of the best action and fight sequences ever put on film",
      "author": "Caffeinated Clint"
    },
    {
      "text": "Somehow retains the sense of basicness that led the original to such prominence, whilst layering itself with the operatic expansion of its near-video game-like ultimation.",
      "author": "Peter Gray"
    },
    {
      "text": "It's a fantastic finale (maybe) for a favorite franchise.",
      "author": "Linda Cook"
    },
    {
      "text": "John Wick: Chapter 4 is still entertaining. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "The fourth film in the very entertaining John Wick series delivers lots more action and even some affecting consequences.",
      "author": "Sameen Amer"
    },
    {
      "text": "Energised by a swaggering electro-rock score, this is pulp cinema at its most giddy and gleeful.",
      "author": "Kevin Harley"
    },
    {
      "text": "Bring on the stunt people- John Wick is back in town.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "An absolutely excellent, masterful final lap for the series with Reeves dedicating himself to the action movie art form.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "This installment of the series offers nearly three hours of action, humor (a 4DX bonus), and sweeping landscapes. All come with high kill and diversity scores. There's also an Easter egg for East Asians.",
      "author": "Jana Monji"
    },
    {
      "text": "John Wick: Chapter 4 is explosive, nunchuck-bashing, bone-crunching cinematic ecstasy that allows action junkies to gorge on a buffet of bullet casings and broken necks.",
      "author": "Chris Sawin"
    },
    {
      "text": "It's impossible not to applaud the audacity in opening the movie with a reference to Lawrence of Arabia and ending it with one to The Warriors, not fearing comparison despite the prejudice with which the genre is seen by many. [Full review in Portuguese]",
      "author": "Pablo Villaça"
    },
    {
      "text": "A brutal fourth installment, which offers the right dose of action almost at the same level as the previous chapters. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "John Wick: Chapter 4 did not need to be nearly as long as it is, but in this case, the excess is the point. Much of it is ridiculous and ridiculously violent, but it’s also highly entertaining, which is all you can hope for from this type of film.",
      "author": "Alex Bentley"
    },
    {
      "text": "After this installment, it’s hard to see how another sequel would even be necessary beyond Reeves and Stahelski challenging themselves to make something close to one of the greatest action spectacles of all time.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Chapter 4 is resoundingly the best Wick sequel – but I still prefer cold-blooded efficiency over bloody excess, no matter how artfully and, at times, playfully staged.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "Aside from spectacular fights, it really doesn't have much else to recommend it. There is little character development, and the story is kind of loopy. But you know what you are going to get with this kind of film, and it does deliver what it promises.",
      "author": "Robert Roten"
    },
    {
      "text": "The meal itself is entertaining and a testament to stunt craft, but it's probably the weakest of the franchise in terms of overall success. Thankfully, that's still good enough.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Caps off what I think we have to regard, at this point, as the best and most-consistent action franchise in American cinema history.",
      "author": "Tim Brayton"
    },
    {
      "text": "The first  great blockbuster of 2023 and one of the greatest action films I've ever seen.",
      "author": "Bob Grimm"
    },
    {
      "text": "This movie did not disappoint, and the bar was high... It's creme of the crop premier action.",
      "author": "Tony Baker"
    },
    {
      "text": "JWC4 is an elaborately choregraphed, gorgeously crafted slaughter fest. A blood-thirsty spectacle. A circus of scoundrels fighting to the death in the most gracefully violent ways.",
      "author": "Dwight Brown"
    },
    {
      "text": "It's wild and bombastic...from a directional standpoint, I think this is Stahelski's best work so far in the series.",
      "author": "Ryan McQuade"
    },
    {
      "text": "[Is the film] a profoundly inane exercise in empty violence or a transcendent ballet replacing exposition with movement? ... To quote Wick, \"Yeah.\"",
      "author": "Jay Horton"
    },
    {
      "text": "Whatever happens next, Reeves and co have their work cut out to top John Wick: Chapter 4.",
      "author": "Harry Guerin"
    },
    {
      "text": "Just think: All this carnage, all this fun, all for the want of a dog. Few can beat that.",
      "author": "Nick Johnston"
    },
    {
      "text": "It’s a great way to spend an afternoon at the cinema and worth the price of admission.",
      "author": "Theolin Tembo"
    },
    {
      "text": "The final 45 minutes of the film includes three set pieces that, while interesting and certainly fun to watch, frequently push the laws of probability and physics far beyond their breaking points.",
      "author": "Michael Clark"
    },
    {
      "text": "John Wick: Chapter 4 won’t win over any doubters, but it will please the fans. If it is the end to the films series (a TV show is in the works), this caps off a thrilling and consistently entertaining franchise in the best way it can.",
      "author": "Victoria Luxford"
    },
    {
      "text": "They give John Wick nunchucks in this one. That's my review of 'John Wick Chapter 4.'",
      "author": "Bob Chipman"
    },
    {
      "text": "It was such a thrilling, immersive experience. With its high octane action and breathtaking stunt choreography.",
      "author": "Oti"
    },
    {
      "text": "A tantalising offering to an already solid franchise. Slick action, scrumptious visuals and top tier cast additions made this an epic ride!",
      "author": "KT Mahe"
    },
    {
      "text": "No easy feat for a franchise that’s attempted to top itself with each subsequent film, but Chapter 4 celebrates everything that’s made these movies work so well for this long.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "It's unrelenting and relentless... it is epic.",
      "author": "tt stern-enzi"
    },
    {
      "text": "Reeves gives more of the super-chill guy we love, though the most fun looks to be had by Skarsgard whose Marquis dresses in immaculate costuming. He camps and vamps through his role.",
      "author": "Cris Kennedy"
    },
    {
      "text": "Across an enormous running time, the film builds up a compelling tale of revenge and redemption that's unusually involving. And of course it looks fabulous, with colourful design touches and outrageously intricate fight choreography.",
      "author": "Rich Cline"
    },
    {
      "text": "Almost 10 years later, the John Wick franchise is still delivering the most unbelievable action sequences in film in recent years. This time around the universe building is more important than the otherwise bland main character. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Nearly three hours of John Wick? You’re gonna need a bigger popcorn.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Interesting elements [are stretched] far too thin with bloated, excessive fighting sequences ... The gratuitous violence and commando shooting do not offend me, but the film's superfluous, meandering runtime certainly does.",
      "author": "Candice McMillan"
    },
    {
      "text": "Everything you'd want out of an action movie!",
      "author": "Brandon Avery"
    },
    {
      "text": "Graded by the volume of quality kills, call it a success of excess.",
      "author": "Dann Gire"
    },
    {
      "text": "If the first John Wick film raised the bar for the spectacle of fight-based storytelling while reinforcing Keanu Reeves as a bona fide action star, JW4 redefines the gold standard for the genre.",
      "author": "Neil Soans"
    },
    {
      "text": "Fans of the genre, run to the theatre and prepare for your jaw to drop to the floor on more than one occasion. [Full review in Spanish]",
      "author": "Juanma Fernández París"
    },
    {
      "text": "Three hours of relentless shooting and little acting makes the fourth film in the Wick franchise an epic disappointment.",
      "author": "Stephen Romei"
    },
    {
      "text": "Just like movie theatres bore audiences with trailers and commercials before rolling out the main feature, Chapter 4 makes us wait far too long for the new ways in which Stahelski has reimagined the action sequence.",
      "author": "Nandini Ramnath"
    },
    {
      "text": "It would be a disservice to continue the saga after it has reached its highest point. The fourth installment of this action franchise is undoubtedly the best.",
      "author": "Orlando Maldonado"
    },
    {
      "text": "The John Wick franchise is two things: a fantasy world with rules and consequences for breaking them, and a series of films crafted with extraordinary care and meticulous attention to detail.",
      "author": "Walter Chaw"
    },
    {
      "text": "The set pieces in John Wick films continue to set the bar for action cinema. Chapter 4 gleefully continues the winning streak set by the first film.",
      "author": "Andrew Mack"
    },
    {
      "text": "Although at times the film is a slog to sit through, the finale is suitably bizarre and the ever-watchable Reeves is also brilliantly complimented by Donnie Yen...",
      "author": "Alistair Harkness"
    },
    {
      "text": "John Wick 4 is meticulously planned sensory madness. [Full review in Spanish]",
      "author": "José Roberto Landaverde"
    },
    {
      "text": "It might be fighting for fighting’s sake, but they sure make it look majestic.",
      "author": "Hanna Flint"
    },
    {
      "text": "While the action is absolutely terrific, it really is the cast that keeps this train running, delivering some of the most preposterous-sounding dialogue with such dedicated gravitas that you can’t help but buy into this crazy universe.",
      "author": "TK Burton"
    },
    {
      "text": "Watch the film for its never-seen-before action sequences, as also for the pleasure of watching two masters of action, Keanu Reeves and Donnie Yen, giving their best to the film.",
      "author": "Devesh Sharma"
    },
    {
      "text": "Expect three hours of furious fistfights, stylish cinematography, and some of the industry’s best stunt performances.",
      "author": "Victor Stiff"
    },
    {
      "text": "While other, equally ridiculous action films race to mock themselves before the audience gets the chance, John Wick dedicates that energy to proving that everything that’s dumb about it is actually rad.",
      "author": "Dylan Roth"
    },
    {
      "text": "With a runtime that, if you include the closing credits, sniff three hours, Chapter 4 is an action romp that’s over-the-top even by Wick-ian standards.",
      "author": "Mark Meszoros"
    },
    {
      "text": "... This franchise’s ambition has now undeniably exceeded its worth.",
      "author": "Josh Glancy"
    },
    {
      "text": "The equivalent of a beautiful ballet for hardcore action fans, this latest installment delivers the most exhilarating display of shoot-‘em-up excellence in the titular lead’s saga.",
      "author": "Rendy Jones"
    },
    {
      "text": "Stahelski finds space to say everything that needs to be said with this world and its inhabitants.",
      "author": "Alci Rengifo"
    },
    {
      "text": "A movie that has considerable hype around it – and meets pretty much every expectation it creates.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "It’s essentially a Jason Statham-style shoot-’em-up that thinks it’s a Christopher Nolan epic.",
      "author": "Kevin Maher"
    },
    {
      "text": "It's wild to be saying that everything matters in the fourth movie in a series about a guy whose dog was killed by bad guys, but here we are. It's popcorn entertainment, obviously, but it's popcorn entertainment done just right.",
      "author": "Adam Graham"
    },
    {
      "text": "“John Wick: Chapter 4” is a full-on action extravaganza and an unforgettable cinematic experience. It’s an adrenaline-fueled spectacle but with a beating heart. It’s also one of the best action movies of the last decade-plus.",
      "author": "Keith Garlington"
    },
    {
      "text": "Chapter 4 is a bit of an epic, the El Cid of shoot-’em-up movies.",
      "author": "Adam Sweeting"
    },
    {
      "text": "Some may come away feeling drained from it all, but the drive to produce such an over-the-top spectacle cannot be dismissed. The film dares to be great.",
      "author": "Allen Almachar"
    },
    {
      "text": "Hand-to-hand fighting rampage against wild dancing raves, wrecking cars and crashing bodies in nonstop circular traffic, mountains of staircases and rolling humans, dog-as-ace card are inventively shot and maximum adrenaline rush. [capsule review]",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Solidifies John Wick as a truly iconic action hero.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "A bit overlong but still with fantastic action set pieces, some fun new characters, and some unnecessary ones. That’s still a really fun action movie.",
      "author": "Julian Lytle"
    },
    {
      "text": "Perhaps the best chapter in the entire franchise, blending numerous influences to bring about something surprising and special.",
      "author": "Evan Dossey"
    },
    {
      "text": "The best of the series. Just when you think Keane Reeves and company can't surpass what they've already done, they go right ahead and do it. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "...benefits hugely from the addition of martial-arts master Donnie Yen.",
      "author": "Josh Larsen"
    },
    {
      "text": "Tension builds throughout, but some of the chases and antics get so outrageous, they are obviously staged to garner laughs. Yes, a lot of it is cartoonish, but super slick entertainment.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Deadly serious yet madly entertaining, John Wick Chapter 4 offers up a stream of astonishing, sometimes numbing battles broken up by aphorisms. Its callbacks to the first film reveal a man who can never escape his past or his path.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Even by the standards of the past Wick outings, this is remarkable.",
      "author": "Wendy Ide"
    },
    {
      "text": "John Wick has lost his mojo. The aspect of this franchise that made it compulsively watchable for the first two installments has degraded during the last two.",
      "author": "James Berardinelli"
    },
    {
      "text": "There’s something about the relentlessness of Wick’s ordeal that stands above the generic action pictures that clog up the contemporary market place. These movies are superficial but they have a personality and an intensity that lingers in the memory.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Get ready, action fans because this one is a crazy ride!",
      "author": "Marianna Neal"
    },
    {
      "text": "The overkill attains a giddy, orgiastic effect. The movie’s massiveness is part of the joke, its sheer scale the stuff of absurdist comedy.",
      "author": "Sean Burns"
    },
    {
      "text": "The latest installment of the wildly popular John Wick action franchise, “John Wick: Chapter Four,” is an amazing stunt reel in search of a plot.",
      "author": "Russ Simmons"
    },
    {
      "text": "Even as the world around Wick expands, and the death count spikes exponentially, Chapter 4 remembers well that the body keeps the score; Reeves makes the weariness of this long-anguished assassin more palpable than ever.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "The type of exhilarating, metal-as-hell ballet of bullets that blows the doors off action filmmaking.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "This is the most epic chapter of the saga, strangely & beautifully cinematic … it’s like the Swan Lake of assassination … and Wick seems to be a quasi-religious being beyond the obvious symbolism the series likes to portray. Just a slam bang action ride!",
      "author": "Patrick McDonald"
    },
    {
      "text": "JW4 brings the story to a satisfying conclusion. The ending is perfect. Anything else would have been a dishonor to such a passionate franchise made whole by Chad Stahelski and Keanu Reeves. More kills, thrills, and spills.",
      "author": "Joe Friar"
    },
    {
      "text": "John Wick has been a boogeyman, the Baba Yaga, an enigmatic cypher in the vein of so many cinematic assassins that came before him, but most of all, the franchise points out, he’s simply a man who loved, and was loved in return.",
      "author": "Gayle Sequeira"
    },
    {
      "text": "The film sets a new gold standard for gun-based mayhem.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "By that point, even the filmmakers seem to be acknowledging that we’re in live-action, blood-soaked cartoon territory, and John Wick has become something of a superhero...",
      "author": "Richard Roeper"
    },
    {
      "text": "You would think that by John Wick 4 the franchise would be tired and out of tricks—and you would be dead wrong.",
      "author": "Josh Flanders"
    },
    {
      "text": "One of the best pure action movies ever made...",
      "author": "Mike Ryan"
    },
    {
      "text": "The stylish shoot-’em up John Wick franchise is running low on imaginative ammo in Chapter 4.",
      "author": "Chris Klimek"
    },
    {
      "text": "The individual fight scenes go on for way too long until they become numbing... [But] it's a lot of fun here and there.",
      "author": "Christy Lemire"
    },
    {
      "text": "It's too long... [But] I love these films, and I love this film. It's fantastic.",
      "author": "Tim Cogshell"
    },
    {
      "text": "It might be something of a criticism to note that this critic never cared a lick about... plot, but it’s also a compliment to note that it doesn’t much matter... the film actually thoroughly works on a scene by scene level.",
      "author": "Joshua Bogatin"
    },
    {
      "text": "John Wick 4 is beautifully realized within its own context… but the context has become so disconnected from any reality, so myopic visually, so cartoonish, without any rhyme or reason. Some are calling that \"minimalist.\" I call it \"boring.\"",
      "author": "David Poland"
    },
    {
      "text": "Beautifully shot with excellent action, though a little long and leaning too much into the mythology.",
      "author": "Kevin Carr"
    },
    {
      "text": "The film is a fittingly flamboyant and fast-paced franchise finale that is bound to whet our appetite for the spinoffs that are reportedly in the offing.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "a high octane, glitzy but self-reflective outing for John Wick ...  a stylish, spectacular film imbued with humour ... does not take its foot off the brakes ... John Wick travels outside of the US leaving a trail of destruction in his wake",
      "author": "Latoya Austin"
    },
    {
      "text": "The purity is admirable. The excitement is notable. Chapter 4 may run nearly three hours, but when we’re having this much fun calling out “Oof!” and “Get him!” the evening passes in breezy delight.",
      "author": "Kyle Smith"
    },
    {
      "text": "John Wick: Chapter 4 commits so nobly to its self-seriousness that it almost borders into camp. And yet, the franchise possesses both the self-confidence and the ingenuity to earn its boldness",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "At almost three hours, the latest instalment of the Keanu Reeves hit man franchise delivers more action, more villains and more convoluted mythology than even its entertainingly overstuffed predecessors, offering fans a veritable degustation of violence.",
      "author": "Luke Goodsell"
    },
    {
      "text": "Chapter 4 is a triumph of consistent style -- a rare distinction among blockbusters usually dependent on conventional, imitative effects.",
      "author": "Armond White"
    },
    {
      "text": "John Wick Chapter 4 is non-stop action. I expected top-tier fight scenes but I was completely blown away. Incredible cinematography. So many scenes/frames looked like it was pulled straight out of a manga. A bit on the long side.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "It’s action filmmaking at its finest, and a welcome addition to an already stellar story.",
      "author": "Matthew Jackson"
    },
    {
      "text": "In magnificently choreographed, violent set piece after set piece the thrills are immersive, particularly in IMAX. It’s a killer night out at the movies, and another high for the ever-nonchalant Reeves.",
      "author": "Thelma Adams"
    },
    {
      "text": "The film feels a good deal less inspired than in some of the series’ previous efforts. Instead, we get a sort of greatest hits medley, most of which feels pretty played out long before we finally reach the final, final, final confrontation.",
      "author": "Piers Marchant"
    },
    {
      "text": "Stahelski ups the ante with each successive set piece, thus proving you can give audiences what they want without cheating or insulting them in the bargain.",
      "author": "Robert Denerstein"
    },
    {
      "text": "John Wick: Chapter 4 is the crowning achievement in director Charles Stahelski’s fluorescent-colored neo-noir martial arts western opus. The fourth chapter has put a stamp on John Wick being the greatest action franchise ever made.",
      "author": "M.N. Miller"
    },
    {
      "text": "I would be remiss were I not to mention the exceptional cinematography by Dan Laustsen, his work making every moment visually intriguing.  If there is an unsung hero in this franchise, it is him.",
      "author": "Charles Koplinski"
    },
    {
      "text": "None of it would work without Reeves’ hand in the production, both in front of and behind the camera. Say what you will about the guy, but he is the absolute beating heart of this franchise.",
      "author": "Frank Wilkins"
    },
    {
      "text": "[A] brilliantly bonkers and bombastic symphony of excess...",
      "author": "Stefan Kyriazis"
    },
    {
      "text": "Instead of covering up a Hollywood star’s limited fighting skills with shaky cameras and quick edits, he [Stahelski] uses wide shots and long takes, letting the audience revel in the balletic grace of the world’s greatest martial arts stars.",
      "author": "Andy Lea"
    },
    {
      "text": "Fans of the series are sure to appreciate this action-packed chapter, even it is more, more and more of the same.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "John Wick: Chapter 4 brings this epic series to an epic conclusion. It is a masterpiece of action filmmaking.",
      "author": "Damond Fudge"
    },
    {
      "text": "Somehow the John Wick franchise continues to top itself with the scale and choreography of its action sequences. Luckily, the story and characters are just as well-executed and memorable. This is undoubtedly one of the greatest action films ever created!",
      "author": "Cody Leach"
    },
    {
      "text": "“John Wick: Chapter 4” pushes the series to its outermost limits, delivering some of the best action in American cinema history.",
      "author": "Dominic Griffin"
    },
    {
      "text": "Ultra-stylised... John Wick: Chapter 4 is the feather in the series’ cap; a breathtaking moving of the action movie goalposts not seen since Mad Max: Fury Road.",
      "author": "James Hanton"
    },
    {
      "text": "John Wick: Chapter 4 is another fantastic display of rhythmic action-hero excess that proves why American genre filmmakers need to be looking overseas for inspiration.",
      "author": "Matt Donato"
    },
    {
      "text": "If watching all that annihilation and fake death is your idea of fun, this will be the bomb, but for those who like a little more emotional meat on the bones, it’s thin broth.",
      "author": "Leslie Felperin"
    },
    {
      "text": ".. the return of the mega aggressive killer of the most elegant group of thugs, John Wick in its fourth installment, is an absolute feast of violence aka \"Terminator\" in the most intricate level of the most vicious videogame. [Full review in Spanish]",
      "author": "Laura Hiros"
    },
    {
      "text": "A bit overlong but bigger, badder and beefier than its predecessors. Energetic mix of stunts, bloody mayhem and character beats makes for a worthy salute to Keanu Reeves' reluctant killer.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "A film that over promises yet over delivers for action fans. It’s inventive, violent, exciting, and exhilarating, with impeccably choreographed stunts and fights that provide a hefty dose of pure adrenaline.",
      "author": "Louisa Moore"
    },
    {
      "text": "The film succeeds mightily... by virtue of leaning into its lunacy. There are some wicked stunts that will take your breath away – and should by all the laws of physics and biology take Wick’s breath away permanently, but whatever.",
      "author": "Chris Knight"
    },
    {
      "text": "Stahelski, Reeves and co. upped the ante of the action in an epic way that I often go ‘how did they pull THAT off?’ Pure adrenaline actioner that’s wickedly Reeve-ting.",
      "author": "Ruth Maramis"
    },
    {
      "text": "The stupidity makes this murderverse so fun. Everyone is constantly doing death to everyone else, but then somebody is like “Ah, ah, ah! You forgot the rules.” And everybody suddenly stops what they’re doing, like when moms walk in on a sibling brawl.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Sadly, you’ll leave the theater knowing that while the franchise is still on a high note, it is no longer at its best.",
      "author": "Matthew Razak"
    },
    {
      "text": "The rapport between Reeves and the supporting cast is insane.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "The most emotional Wick film is to be commended for nailing a tone that has gravity without losing sight of the fact that this has all been for fun.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "Chapter 4 is not a narratively ambitious film. The overstuffed runtime is buoyed by exceptional fight sequences, as well the relief that the franchise seems to understand its own limitations.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "John Wick: Chapter 4 is hands down the best of the series. It's nonstop thrills where every frame is a beautiful ballet of bullets and mayhem.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "John Wick Chapter 4 combines all the best elements of the previous films, and delivers a truly WOW inducing experience. Every single action sequence is distinct, memorable, and features stunt work and effects never put on screen before.",
      "author": "Sean Chandler"
    },
    {
      "text": "The prior Wick installments gave us a taste of Gun Fu, but this time, it’s simply magnificent—dare I say, I’ve never seen action this well-choreographed and shot before.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "As thrilling and relentless as any action movie before it, John Wick: Chapter 4 is an adrenaline injection with Oscar worthy stunt work, assured direction and Keanu Reeves as magnetic as ever. The best Chapter yet...",
      "author": "Lisa Giles-Keddie"
    },
    {
      "text": "John Wick 4 is a stunning reminder of what movies can and should be. Fun. The creative output of the action set pieces is pure candy for the senses. And it may be the best in the franchise.",
      "author": "Lee McCoy"
    },
    {
      "text": "With characters able to dodge bullets left, right and centre, the film is a homage to the classic martial-arts genre with a sprinkling of old Hollywood Westerns where protagonists never seem to run out of ammunition or ways to stay alive.",
      "author": "Linda Marric"
    },
    {
      "text": "It requires significant patience to get to [the best] sequences ... but, for action fans, the wait is worthwhile.",
      "author": "Sean Collier"
    },
    {
      "text": "Where Wick-haters find only brutal monotony, the rest of us will revel in the fourth chapter’s state-of-the-art action fireworks led by a hypnotically-Zen Keanu Reeves as the hitman who treats kung fu fighting like a dance tableau. Unmissable? Hell, yeah!",
      "author": "Peter Travers"
    },
    {
      "text": "John Wick: Chapter 4 feels like a film where [Director Chad Stahelski] understood that he finally had the freedom and the budget to do, literally, anything he wanted on the screen—and might never again—so by God, he was going to do it.",
      "author": "Sonny Bunch"
    },
    {
      "text": "An exhilarating thrill ride.",
      "author": "Wenlei Ma"
    },
    {
      "text": "The combination of fights, humor, and emotional moments made this film more complete than anyone would anticipate.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "John Wick shoots, smashes, slams, stabs, cuts, slashes, and nunchucks his way through countless hordes and hordes of goons. The action is brutal and beautiful, and on a whole new level in John Wick 4.",
      "author": "Kshitij Rawat"
    },
    {
      "text": "All that said, it’s hard to argue against the sheer adrenaline thrill that John Wick 4 delivers. Sure, there are just too many dishes and the size of the portions is out of control, but you can’t escape its butt-clenching intensity.",
      "author": "Akhil Arora"
    },
    {
      "text": "Few series of this type have maintained this level of quality and ingenuity over four installments without growing stale.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Despite a bloated, overlong plot John Wick: Chapter 4 delivers the final blowoff and burst of adrenaline for the saga of Baba Yaga. Longtime fans will not be disappointed as Keanu Reeves leaves it all on the table for Wick's final stand.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "John Wick – Chapter 4 is nirvana for fans of action cinema; an incredible feat of controlled chaos jam-packed with stuntwork and memorable visual storytelling that consistently surprises, awes and thrills led by a fantastic cast of cool cats.",
      "author": "Harris Dang"
    },
    {
      "text": "The action in John Wick: Chapter 4 is impressive, but the film's star is what really sets it apart from the competition.",
      "author": "Kathia Woods"
    },
    {
      "text": "A return to the baroque melodrama of Chapter 2. This is opera.",
      "author": "Simon Miraudo"
    },
    {
      "text": "The John Wick series continues to be the most impressive action franchise of the modern era, and John Wick: Chapter 4 solidifies that reign with a truly awesome film that delivers on every level.",
      "author": "Rob Dean"
    },
    {
      "text": "It’s a lot of movie, but it sends out the character on a high-flying note, where the past and present collide in what will be remembered as an unforgettable, home-grown, action extravaganza.",
      "author": "Nate Adams"
    },
    {
      "text": "The polite elegance of Continental Osaka, the thumping industrial nightlife in the German underground, the dimly lit catacombs of the Ruska Roma, traveling as an assassin certainly gains passport stamps. Eventually though, you kinda just want to go home.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "A violent and balletic ode to action and choreography. Having a trio of Asian stars who are AARP eligible in a major blockbuster is an absolute delight. Though there are a handful of times the action runs a bit too indulgently long, it's overall a winner.",
      "author": "Dana Han-Klein"
    },
    {
      "text": "It’s not only a Keanunami, it’s a tidal wave of assault, with kill after overkill in balletic attack.;. This grim fairytale is relentless... Wick has offended the arcane rules of a reigning society that cannot bear the odor of any form of resistance.",
      "author": "Ray Pride"
    },
    {
      "text": "John Wick: Chapter 4 is an all-timer, cinephiles! It’s a 3-hour action spectacle that jumps into the pantheon of action movie classics. Its pacing is frenetic and action pieces are jaw-dropping, and it’s rich with stakes, heart, and consequences.",
      "author": "David Gonzalez"
    },
    {
      "text": "The leads do their own stunts whenever possible, the goal being to have something exciting happening in every shot. This philosophy grounds the silliness to a degree, as does Reeves’ commitment on every level to his role.",
      "author": "Jake Wilson"
    },
    {
      "text": "It's long. But it's jam packed with brilliant action scenes. Reeves is iconic in the role. Paris climax is a visual delight.",
      "author": "James Verniere"
    },
    {
      "text": "I'll always rate the lean original above the sequels. But all the John Wick films, in their bloated way, have been a huge amount of fun. John Wick 4 doesn't let the franchise down at all.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Stahelski’s preferred way of combating repetitiveness is to switch weapons, locations and opponents. And, in the new film, the set piece battles are fabulous.",
      "author": "John Lui"
    },
    {
      "text": "John Wick 4 reinvents all cinema, not just the action genre. [Full review in Spanish]",
      "author": "Fausto Fernandez"
    },
    {
      "text": "The almost blank-slate idea of this protagonist is partially why the role is ideal for Reeves’ minimal expressiveness, even when he’s kicking maximum ass. Take away the sound and fury, and you still have momentum thanks to him.",
      "author": "David Fear"
    },
    {
      "text": "It's about movement, energy and speed — and it is, by a very long shot, the most fun you can have in a movie theater right now.",
      "author": "Chris Hewitt"
    },
    {
      "text": "The John Wick franchise comes to an end with “John Wick: Chapter 4,” and what an absolutely insane, extremely violent finale it is.",
      "author": "Odie Henderson"
    },
    {
      "text": "Though its two-hour, 40-minute run time sounds hard to justify, the film fairly barrels along, lit by fizzling fight sequences, dazzling in their complexity.",
      "author": "Paul Whitington"
    },
    {
      "text": "The action scenes are as elegantly blocked and as cleanly shot as ever, but they also bear the weighty responsibility of trying to top everything that’s come before.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Stahelski and his very game star Reeves have raised the bar on the action genre and set a new gold standard.",
      "author": "Beth Accomando"
    },
    {
      "text": "Four tremendous films and nine years into the adrenaline-fueled, Reeves-led action series, director Chad Stahelski has yet to let his franchise noticeably dip in quality.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "A sequel which elevates and expands the franchise. The fourth installment is more stylish, more elegant and more bonkers",
      "author": "Mark Kennedy"
    },
    {
      "text": "Shamier Anderson and Rina Sawayama... both show enough here to conceivably carry a spinoff from the series.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Keanu Reeves returns as the Wile E. Coyote of assassins in John Wick: Chapter 4, a blood thirsty ballet of bullets, bodies and mayhem that is the gold standard of big, Hollywood action movies. It’s long and loud, but wraps up the franchise with a bang.",
      "author": "Richard Crouse"
    },
    {
      "text": "Fans of the John Wick franchise have waited eagerly for four years for the release of the latest installment, John Wick: Chapter 4... If you are one of those people, let me tell you -- this movie will scratch every itch and make you lie back in ecstasy.",
      "author": "Venessa Wong"
    },
    {
      "text": "The writers certainly know how to write for Reeves’ earnest, deadpan delivery. Secondary characters such as Ian McShane’s Manager and Yen’s Caine, who can be positively hilarious at times, receive their moment to shine.",
      "author": "George M. Thomas"
    },
    {
      "text": "An entertaining and somewhat unlikely series long poised between the expansive and the intimate.",
      "author": "Brent Simon"
    },
    {
      "text": "'John Wick: Chapter 4' is nearly a three-hour limb-breaking hurricane. Watch as Keanu Reeves and Co. smash bodies through walls, drive sharp objects through craniums and fire more bullets than what's manufactured, all in the name of fun.",
      "author": "Preston Barta"
    },
    {
      "text": "A pervasive sadness runs through John Wick: Chapter 4, one of the strangest yet most entertaining Hollywood action movies in years... even if its innovative action is far more amusing than engrossing.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "While all the cast acquit themselves well—McShane is dependably cynical, Skarsgård is deliciously evil, Brown is sinister and magisterial, and Adkins definitively steals his entire section of the movie—the standout out is Donnie Yen.",
      "author": "Don Kaye"
    },
    {
      "text": "…the final instalment in the ultra-violent, super-kinetic franchise gets everything right as it brings the John Wick box-office juggernaut to a close on a genuine high…",
      "author": "Eddie Harrison"
    },
    {
      "text": "Heart is not what John Wick 4 lacks. And it has nothing to spare. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Overlong, over-the-top, and inexplicably just right... as good as if not better than the first film that started it all... as long as John Wick keeps getting back up, it's nigh impossible to look away. Good to the last body dropped.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "John Wick Chapter 4 is standout in this franchise as Stahelski, his creative team, and Keanu Reeves give the fans bigger and elongated action sequences, precise fight choreographed all set against visually stunning set pieces.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Pure, eye-popping, body-shaking, transporting entertainment, something that (to borrow from another philosopher) has a good beat and you can dance to.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Chapter 4 is blissfully entertaining, full of pratfalls and acting turns that lead to the audience swelling with oohs, aahs, and yelps.",
      "author": "Angelica Jade Bastién"
    },
    {
      "text": "[When] the film erupts into one of its signature action sequences ... who cares, really, what excuses it has to invent to get there?",
      "author": "Mark Dujsik"
    },
    {
      "text": "This film is intentionally too much of a good thing, everything dialed up to eleven in a way that reflects Wick's own exhaustion even as he beats down a dozen goons using nunchucks",
      "author": "Anthony Morris"
    },
    {
      "text": "A self-indulgent mess, lost in the byzantine assassin underworld that has become the focus of the sequels.",
      "author": "Josh Bell"
    },
    {
      "text": "There’s no question that  “John Wick: Chapter 4” is really good for what it is. The only bad thing is what it is.",
      "author": "Mick LaSalle"
    },
    {
      "text": "John Wick: Chapter 4 is a masterpiece of action. The cinematography, choreography, and locations are breathtaking. The suspension of disbelief, however, has gotten really noticeable.",
      "author": "Korey Coleman"
    },
    {
      "text": "Revisiting the world of hitman John Wick is like touching base with an old buddy who you do not under any circumstances want to cross.",
      "author": "Andiee Paviour"
    },
    {
      "text": "JOHN WICK: CHAPTER 4 is a mesmerizing symphony of violence and death that is also about friendship, honor, family.",
      "author": "Dolores Quintana"
    },
    {
      "text": "A balls-to-the-wall nail-biter... an over-load of everything we've come to expect from the Wick movies, hopped-up on some extra adrenaline. With two of the best action scenes ever, it's a defining action film and one of the best in recent memory.",
      "author": "Dave Lee"
    },
    {
      "text": "Where else could you possibly hope to see a ten-minute fight sequence up the steps of Sacré-Cœur with two titans of eastern and western action cinema? We may never see the likes of this kind of movie again, and we will never know how good we had it.",
      "author": "Brian Lloyd"
    },
    {
      "text": "Through it all, Reeves somehow barrels through the picture with equal parts rampaging force and Zen-like cool.",
      "author": "Justin Chang"
    },
    {
      "text": "There is precious little not to love here. The only legitimate gripe you might have is that it’s overly long. But every minute is filled with such artistry and passion; not a moment of frenzied madness is anything less than hypnotic.",
      "author": "Stephanie Malone"
    },
    {
      "text": "… an epic both in duration and scale, and can stand proudly beside Mad Max: Fury Road, Mission: Impossible – Fallout, and The Raid 2: Redemption as one of the greatest modern action films.",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "Stahelski and crew have engineered a show-stopping spectacle for the third act that ascends to a level of greatness reserved only for the finest movies in the genre.",
      "author": "Eric Marchen"
    },
    {
      "text": "The most stunning and stylish-looking of the John Wick movies. Elaborate fight scenes are the movie's biggest assets, but there's also plenty of suspense, well-placed comedy, and a meaningful story of humanity at the heart of this ultra-violent movie.",
      "author": "Carla Hay"
    },
    {
      "text": "The florid narrative is, ultimately, irrelevant. John Wick Chapter 4 exists to showcase a great cast in great action sequences.",
      "author": "Grant Watson"
    },
    {
      "text": "A sprawling, Shakespearean orgy of violence, a salute to stunt choreographers, and a return to the original film’s roots — at the heart of the matter, it is the fundamentally the story of a duel, and a dog.",
      "author": "Katie Walsh"
    },
    {
      "text": "It seems director Chad Stahelski has infused this film with balletic but brutal choreography, bone dry humor and savvy style. That, plus Keanu Reeves et al cast a surprisingly scintillating cinematic spell.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Stahleski, Reeves, and their collaborators are old hands at this point, and Chapter 4 delivers its ultra-violence with all the pristine visual coherence and intoxicating relentlessness that series devotees have rightly come to expect.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "It is a nearly three-hour roller coaster ride of bullets and swords and fists that never lets up -- an action movie that delivers on every level. It may well be the best John Wick film yet,",
      "author": "Micheal Compton"
    },
    {
      "text": "Probably too long, but uses that time to pack in more of some of the best action sequences franchise movies have to offer.",
      "author": "Kambole Campbell"
    },
    {
      "text": "Mr. Wick emerges victorious from an arduous duel with routine. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "Keanu Reeves gets killer support from new, old franchise heroes, villains.",
      "author": "Christian Toto"
    },
    {
      "text": "John Wick: Chapter 4 is a fantastic tribute to action cinema, raising the bar to new levels that won’t be topped for a long time.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "John Wick: Chapter 4 continues its unlikely reign as the franchise to beat in terms of both quality and substance when it comes to modern action cinema.",
      "author": "Andrew Parker"
    },
    {
      "text": "Everything on screen is stupendous. This is what we want, to watch John Wick murder the whole world, forever and ever amen.",
      "author": "Dom Sinacola"
    },
    {
      "text": "Not only does Chapter 4 endeavor to be a potentially final John Wick movie, it plays as an attempt at the last action movie ever made.",
      "author": "Conor O'Donnell"
    },
    {
      "text": "\"John Wick 4: Chapter 4\" does not disappoint, and although I think it could have been presented as a shorter package, I still think it is a satisfying continuation (and possible conclusion?) of the saga. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "“John Wick: Chapter 4” is by far the best of the four films starring Keanu Reeves as the eponymous hit man, the first of the cycle that I’d recommend—albeit with an asterisk.",
      "author": "Richard Brody"
    },
    {
      "text": "With John Wick 4, Chad Stahelski has once again defined the action genre...",
      "author": "Kate Sánchez"
    },
    {
      "text": "A triumph of excess and brilliant artistry of weaponry. Sensational and who will top Wick’s high body count now? I want more and demand Wick fans to boycott all Reeves’s movies if he refuses to do Chapter 5,6,7 and 8.",
      "author": "Victoria Alexander"
    },
    {
      "text": "Even at practically Kubrickian length, though, the lockstep slaughter barely gives you pause for breath. It’s a barrage, and a blast.",
      "author": "Tim Robey"
    },
    {
      "text": "John Wick: Chapter 4 is action nirvana, a cinematic tour-de-force of unparalleled, adrenaline-charged ass-kicking.",
      "author": "Rebecca Murray"
    },
    {
      "text": "John Wick has an abundance of style... [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "... Perhaps the best adventure of the most wholesome hitman in the world, John Wick. [Full review in Spanish]",
      "author": "Leonardo D'Esposito"
    },
    {
      "text": "The most John Wick-ian of all the John Wick films, by virtue of the simple fact that there is more time to lavish on the films’ fans exactly what they want, in spectacular fashion.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "“John Wick: Chapter 4” delivers on the ballet of bullets and fiesta of firearms you expect while also successfully showcasing the dynamic, reluctantly unretired title hitman as a real underdog.",
      "author": "Brian Truitt"
    },
    {
      "text": "Sharp suits, stairs (you’ll see), Samurai and a devilish Skarsgard, John Wick 4 ups the ante once more. Inject this neon-drenched, blood-soaked shot of adrenaline directly into your cinematic veins at your earliest convenience.",
      "author": "Kat Hughes"
    },
    {
      "text": "Directed once again by Chad Stahelski, the one-time stunt man who has become a first-rate visual stylist and master of pacing over the years of directing “Wicks,” “Chapter 4” is dazzling.",
      "author": "Soren Andersen"
    },
    {
      "text": "With wickedly fun and lucrative action set pieces, this is first class entertainment for the masses, but the first John Wick reigns supreme.",
      "author": "Maria Lattila"
    },
    {
      "text": "Far too often, especially during the film’s first 90 minutes, the action pauses for stiff, semi-serious scenes unpacking the underworld arcana that the first three films built up with increasing ponderousness.",
      "author": "Barry Hertz"
    },
    {
      "text": "A ram-jammed, nearly three-hour mega-blast of John Wick doing his John Wick thing. It may be the John Wick-iest John Wick yet.",
      "author": "Neil Pond"
    },
    {
      "text": "Keanu Reeves and Chad Stahelski did it again in this consistently thrilling, maximalist action cinema.",
      "author": "Casey Chong"
    },
    {
      "text": "The exorbitant running time may end up testing the patience of many, but 'John Wick: Chapter 4' does exactly what the franchise does best, but somehow on an even grander and more gripping scale.",
      "author": "Scott Campbell"
    },
    {
      "text": "At times the movie veers dangerously close to self-parody with the over-the-top violence and the revelation that John Wick is now, apparently, invincible...[Still, it] offers fans precisely what they want – and then some.",
      "author": "Jim Schembri"
    },
    {
      "text": "A perfect conundrum and an astonishment of wonders.",
      "author": "Andrea Chase"
    },
    {
      "text": "Director Chad Stahelski delivers an insanely outrageous action film, clocking in at two-and-three-quarter hours. Is that excessive? Yes. But the John Wick franchise thrives on excess.",
      "author": "James Mottram"
    },
    {
      "text": "It is all there, the fighting, chases, explosions, and fascinating characters but the proportions are a bit off. While it might rise above the High Table’s box office expectations, it falls a bit below the table’s previous cinematic magic.",
      "author": "Reginald Ponder"
    },
    {
      "text": "Stahelski has pulled a masterpiece of excess action cinema out of his sleeve without neglecting this world's rich mythology while pushing Reeves' mythical character to the max. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A really big (and very long) canvas for stunt-wizard-turned-director Chad Stahelski to work his undeniable magic. A circus of violence, it’s a noisy, non-stop combination of violent ballet and Looney Tunes-worthy manic cartoonishness.",
      "author": "Jim Slotek"
    },
    {
      "text": "Merging kinetic action sequences with dynamic character work and touching emotional stakes, John Wick: Chapter 4 improves on its predecessors to establish itself as one of the greatest action films of the century.",
      "author": "Diego Andaluz"
    },
    {
      "text": "John Wick: Chapter 4 delivers on the amazing action the franchise has become known for and may be the most visually stunning of the series, but its narrative is a mess.",
      "author": "Kyle Logan"
    },
    {
      "text": "“John Wick: Chapter 4” is not a great piece of cinema, exactly, but it delivers on what it promises, time and again.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Any one of its many set pieces contains more action all by itself than most entire movies.",
      "author": "Matt Singer"
    },
    {
      "text": "Dialogue scenes exist purely to set the parameters for the next chase, the next fight, the next big city Wick will decimate. Action is this film’s method of communication, and Stahelski speaks it fluently.",
      "author": "Clint Worthington"
    },
    {
      "text": "The \"John Wick\" franchise...has always valued action over plot, visual pop over cerebral reflection...But \"Chapter 4\" takes it all to such cartoonish extremes that it makes the previous films look like PBS documentaries.",
      "author": "Cary Darling"
    },
    {
      "text": "Like its three predecessors, non-stop action with just enough story and character to establish the stakes. And endless style.",
      "author": "Nell Minow"
    },
    {
      "text": "This.  This is the climax fans of this series have been waiting for...a finale that honors the bonds of friendship...one jaw-dropping series of stunts after another.",
      "author": "Laura Clifford"
    },
    {
      "text": "The enemy brothers plot calls to mind John Woo's classics and elevates this fourth chapter above its predecessors. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "This might be the new crowning achievement of stunt-work and action imagery, but it's also a cautionary tale as to the pitfalls of excess.",
      "author": "Tom Santilli"
    },
    {
      "text": "John Wick: Chapter 4 is exactly as satisfying as you want a John Wick movie to be. It also allows its supporting characters a little more personality and development than the films have up to this point.",
      "author": "Abby Olcese"
    },
    {
      "text": "Both the most explosive and exhausting installment yet, Chad Stahelski pushes the action genre to new heights, though the narrative lulls in the bloated run time feel as though this story might finally be running out of steam.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "Yes, I checked my watch a few times during the movie... But by the last hour of its elephantine running time, Chapter 4 is a preposterous blast.",
      "author": "David Sims"
    },
    {
      "text": "With elevated action, great new additions to the cast, and a relentless performance from Keanu Reeves, John Wick: Chapter 4 may stand the test of time as the best John Wick film yet.",
      "author": "Belen Edwards"
    },
    {
      "text": "Despite an egregious running time and padded plot, the (maybe) conclusion to Keanu Reeves’ action series still serves up some of the original’s delightful weird.",
      "author": "Chris Barsanti"
    },
    {
      "text": "\"I'm going to kill them,\" Wick tells Winston.\n\n\"You can't kill everyone,\" Winston says.\n\nI didn't catch Wick's reply.",
      "author": "Kurt Loder"
    },
    {
      "text": "A rousing, mesmerizing and outrageously funny thriller loaded with action and pizazz.",
      "author": "Avi Offer"
    },
    {
      "text": "John Wick Chapter 4 ends in a big way so that Stahelski-Reeves' universe retains four cult favorites with their own mythology and indelible legacy. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "With John Wick: Chapter 4 it’s safe to say they leave everything on the floor for this one.",
      "author": "Alan Cerny"
    },
    {
      "text": "Four films in, the franchise keeps getting slicker, nastier, and funnier. It’s a glossy rollercoaster ride that keeps its main character running and gunning, along with the pace.",
      "author": "Jeff York"
    },
    {
      "text": "If not for the final, glorious hour of Chapter 4, we would be well within our rights to declare the John Wick franchise dead and buried.",
      "author": "Jon Negroni"
    },
    {
      "text": "Chapter 4 takes its mythology far more seriously than it does its action, which, rather incongruously, ends up a boon rather than a bane.",
      "author": "Hayden Mears"
    },
    {
      "text": "It’s a long and exhausting—but refreshingly never dull—spectacle of violence that’s easily the most ambitious and visually accomplished entry yet.",
      "author": "Brian Eggert"
    },
    {
      "text": "John Wick 4 is a supersized all-you-can-eat buffet of the franchise’s signature dishes: bullet-riddled revenge, teeth-chattering action sequences, and gossamer-thin characters.",
      "author": "Charles Pulliam-Moore"
    },
    {
      "text": "John Wick: Chapter 4 will have you questioning everything. Do bullets hurt? Are cars soft? Is half the world’s population sleeper assassins? Can Keanu Reeves act? Despite how insane everything in this universe may be, it remains a ridiculously good hang.",
      "author": "Matt Oakes"
    },
    {
      "text": "Retains many cinematic highs, but good heavens, does it ever need a few more passes in the editing room.",
      "author": "Brian Orndorf"
    },
    {
      "text": "These movies just keep getting better and there’s a strong argument that Chapter 4 is the best John Wick yet.",
      "author": "Leo Brady"
    },
    {
      "text": "Even at a lengthy 169 minutes, Chapter 4  never feels slow and never lets up as this is easily the biggest and most ambitious [Chad] Stahelski has been in his decade of making these.",
      "author": "Jacob Throneberry"
    },
    {
      "text": "There are at least three all-time banger set pieces here.",
      "author": "Dominic Corry"
    },
    {
      "text": "John Wick: Chapter 4 isn’t just the best installment in the series. It’s on the very short list of greatest action movies ever made.",
      "author": "Michael Walsh"
    },
    {
      "text": "Chad Stahelski and writers Shay Hatten and Michael Finch have distilled the mythology-heavy approach of the last couple chapters with the streamlined action of the first film, resulting in a final hour here that stands among the best of the genre.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Director Chad Stahelski continues to deliver what I want from these movies: A ballistic ballet; playing out within an ever-expanding world of folklore and stylized mayhem. Give me more.",
      "author": "Sherin Nicole"
    },
    {
      "text": "It just does an incredible job of making you feel like this is the first time you've experienced a John Wick Film.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "John Wick: Chapter 4 brings this part of the story to a close with some of the most unhinged action scenes ever put on screen, but shows that there’s still so much to do within this world. Yeah, I’m thinking John Wick is back, and better than ever.",
      "author": "Ross Bonaime"
    },
    {
      "text": "Chad Stahelski is the current motherf****** king of staging action",
      "author": "Robert Kojder"
    },
    {
      "text": "Strap in, folks, you’re in for a non-stop thrill ride you’ll never forget.",
      "author": "Alan Ng"
    },
    {
      "text": "Action movies seem like a dime a dozen these days, but nothing compares to the John Wick franchise. It’s smart and cool. It doesn’t rely on gigantic explosions or out of the box, farfetched car chases, or hypersexualized women.",
      "author": "Catalina Combs"
    },
    {
      "text": "With standout performances by Shamier Anderson and Donnie Yen, John Wick Chapter 4 may be the best entry yet supplying seamless action sequences and shocking fights all supporting a story filled with emotional beats and breathtaking stunts.",
      "author": "Chris Joyce"
    },
    {
      "text": "Chapter 4 comes with style, brutal action sequences, and stunning set pieces—solidifying its position as one of the greatest sequels in the franchise.",
      "author": "Brittany Patrice Witherspoon"
    },
    {
      "text": "John Wick: Chapter 4 is a blast. The best action movie of the year, and perhaps the best in the genre since Mad Max: Fury Road.",
      "author": "Michael Balderston"
    },
    {
      "text": "It’s damn near 3-hours of majestic, beautifully-orchestrated violence that will absolutely blow your mind.",
      "author": "Travis Hopson"
    },
    {
      "text": "As much as the picture doesn’t want to be more of the same, it’s exactly that – killing and more killing, sometimes flashier, sometimes not. And at this point, what will the next chapter have to offer? A 4-hour duration?",
      "author": "Mike Massie"
    },
    {
      "text": "Has the best cinematography & choreography of the series so far, arguably one of the top ten hours of action filmmaking ever, one extremely lovable killer doggo & solid emotional relationship building among assassins that builds to a satisfying end point.",
      "author": "Aaron White"
    },
    {
      "text": "Rarely does a pure action movie feel so compelling, so engaging, and so damn fun. And we finally have a supporting cast to match the non-stop insanity of Reeves’ Wick.",
      "author": "EJ Moreno"
    },
    {
      "text": "In John Wick: Chapter 4 — director Chad Stahelski’s brutal ballet of jaw-dropping action filmmaking and jaw-breaking stunts — overkill takes on a whole new meaning.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "Frenzied with a kinetic energy that's a blink and you miss it, John Wick: Chapter 4 delivers the goods in spades.",
      "author": "DarkSkyLady"
    },
    {
      "text": "If you’re not up for a film that’s nearly three hours of wall-to-wall fighting, this chapter might get on your wick. That fighting, though, is a bone-crunching, butt-clenching masterclass.",
      "author": "Alex Godfrey"
    },
    {
      "text": "John Wick Chapter 4 brings the action to a higher level.",
      "author": "John Nguyen"
    },
    {
      "text": "It's more of the same but funnier thanks to scene-stealer Donnie Yen. The action is relentless from start to finish, and this time around the filmmakers are self-aware of the over-the-top action.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "John Wick: Chapter 4 is more than another sequel in an endless churning of product, this is a fantastic action film, the likes of which we may never see again in our lifetime. This is The Gunfather.",
      "author": "Aaron Peterson"
    },
    {
      "text": "A full-on fourquel whose attempts to up the action ante yield frequently blistering results.",
      "author": "Kim Taylor-Foster"
    },
    {
      "text": "Even in the hail of bullets, shrieking needle drops, and blinding lighting effects, John Wick: Chapter 4 still works as a cohesive, linear film with a strangely philosophical heart.",
      "author": "Richard Whittaker"
    },
    {
      "text": "One of the funnier entries into Wick’s world, the film (written by Shay Hatten and Michael Finch) marries Chad Stahelski’s direction with a layer of humor that has you laughing and ready to fight anyone who comes into your path.",
      "author": "Rachel Leishman"
    },
    {
      "text": "The final 45 minutes or so of this fourth installment is a bravura attempt to top everything that came before, and it's got sequences that feel bound for the pantheon.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Like watching an above-average assembly cut. At an unwieldy two hours and 49 minutes, your eye will immediately be drawn to what cuts through the noise — and there are plenty of these moments. But “moments” does not a well-told “movie” make.",
      "author": "Gregory Lawrence"
    },
    {
      "text": "John Wick: Chapter 4 is simply one of the greatest action films of this generation, and perhaps of all time.",
      "author": "Ed Travis"
    },
    {
      "text": "\"John Wick 4\" barrels along with charming idiosyncrasy. Even when it drags -- 169 minutes is a lot of time to fill, even for this masterful crew -- the film gamely mixes comedy, action, and drama into one truly satisfying cocktail.",
      "author": "Lena Wilson"
    },
    {
      "text": "With this wildly satisfying world tour de force, Reeves’ Wick transcends icon status delivering the perfect bone-crunching crescendo to one of the great action franchises in cinema history. It’s pure gold.",
      "author": "Simon Thompson"
    },
    {
      "text": "There are no rules in the John Wick universe, where violence can emerge from any direction and any unassuming figure can be a fearsome killer, and this epic-length latest entry takes advantage of that like never before.",
      "author": "Alistair Ryder"
    },
    {
      "text": "John Wick: Chapter 4 is an epic in every sense of the word: epic in length, epic in scale and epic in thrills. Not bad for a series that started out with a hitman avenging his dead puppy.",
      "author": "Ian Sandwell"
    },
    {
      "text": "John Wick: Chapter 4 might be a little long, but when it is fun, few films can compete with its magnetism. Reeves shows why he’s one of the best genre actors in the world and pours his heart and soul into a soft-spoken performance.",
      "author": "Alan French"
    },
    {
      "text": "John Wick: Chapter 4 earns every second of its epic runtime, and there’s a strong argument to be made that it’s the best of the sequels.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "The Paris action sequences are stunning... But this is the first John Wick not written by Kolstad and it shows. The film is hard to follow & not engaging. It plays more like a stunt show than an actual movie. Also that ending...? What were they thinking?",
      "author": "Grace Randolph"
    },
    {
      "text": "If the previous three films weren't your cup of tea, the brew served up by John Wick: Chapter 4 won't change your mind. But if you love kinetic action set in gorgeous locales, there's no one in Hollywood doing it better than Reeves and Stahelski.",
      "author": "Brent Hankins"
    },
    {
      "text": "John Wick: Chapter 4 is likely to be one of the best films of 2023.",
      "author": "JimmyO"
    },
    {
      "text": "All in all, the first four John Wick movies make a pretty decent franchise that is already clearly branching out into other places.",
      "author": "Edward Douglas"
    },
    {
      "text": "Even though the action in the series is awe-inspiring, the fact that this latest film ends in such a character-focused way inspires awe of a different, incredibly welcome kind.",
      "author": "Dan Bayer"
    },
    {
      "text": "Brawny, bold and badass, this 4th film in a scorching, searing, soaring saga for the ages brilliantly balances vested stakes with an absolutely spectacular, high octane thrill ride.",
      "author": "Courtney Howard"
    },
    {
      "text": "Running at 2 hours and 49 minutes, it is bigger than the previous films in every way ­– not better or worse, just more.",
      "author": "Caryn James"
    },
    {
      "text": "Every action scene in John Wick: Chapter 4 could be the climax of any other movie. There is no small fight in this movie.",
      "author": "Fred Topel"
    },
    {
      "text": "Bolstered by a solid supporting cast, John Wick: Chapter 4 is as epic and entertaining as you'd want it to be.",
      "author": "Brandon Zachary"
    },
    {
      "text": "Designed as a culmination as much as a continuation, it may not be consistent enough to rank as the franchise’s finest, but when it gets going, it cooks with gas.",
      "author": "Nick Schager"
    },
    {
      "text": "Led by a committed Keanu Reeves, John Wick: Chapter 4’s incredibly staged set pieces, engaging ensemble, and stylish production design coalesce into a modern action masterclass.",
      "author": "Tom Jorgensen"
    },
    {
      "text": "How does nearly three hours of wham-bam noise and nonsense, unmitigated by any meaningful plot, work as well as it does?",
      "author": "Leah Greenblatt"
    },
    {
      "text": "John Wick: Chapter 4 is an immense action magnum opus. It is near non-stop wall-to-wall combat, car chases, and shoot-outs on a level not seen since Mad Max: Fury Road.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Those who appreciated the original for its brutal, sinewy agility have another thing coming: a lumbering, stultifying gargantua of a film...",
      "author": "Charles Bramesco"
    },
    {
      "text": "It’s a wild orgy of violence.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "As the title character says: \"Yeah!\"",
      "author": "Frank Scheck"
    },
    {
      "text": "“Chapter 4” feels like the first “John Wick” movie that wants to be a Clint Eastwood spaghetti Western. It’s like Sergio Leone crossed with John Woo as seen in Times Square.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "If anything, the film proves that John Wick is doomed to further Marvelization.",
      "author": "Derek Smith"
    },
    {
      "text": "A feast for fans of star Keanu Reeve’s command of this Martial Arts/Gun Fu/now Car Fu too genre.",
      "author": "Pete Hammond"
    },
    {
      "text": "John Wick is not only back, he’s better than ever in one of the best modern American action films this side of a Mission: Impossible.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "John Wick: Chapter 4 is a high-octane kick to the head that once again raises the bar in the most ridiculous, over-the-top, and violent ways. It’s a rip-roaring good time at the movies.",
      "author": "Jeff Nelson"
    },
    {
      "text": "Every other Hollywood action movie should be ashamed of itself.",
      "author": "Jacob Hall"
    }
  ],
  "release_year": 2023,
  "duration": 169,
  "genres": [
    "Action",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "John Wick (Keanu Reeves) uncovers a path to defeating The High Table. But before he can earn his freedom, Wick must face off against a new enemy with powerful alliances across the globe and forces that turn old friends into foes.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/vZloFAK7NmvMGKE7VkF5UHaz0I.jpg"
}