{
  "movie_name": "Justice League",
  "movie_id": "zack_snyders_justice_league",
  "total_reviews": 313,
  "reviews": [
    {
      "text": "The Syndercut is essentially an extended version of JL with new footage that tied up loose ends, cut out all the cheesy and sexiest JOSStice scenes, improved the horrific CGI, and primarily made all of our beloved heroes much more captivating and GODLIKE!",
      "author": "Nadya Martinez"
    },
    {
      "text": "This four-hour endurance test of a movie is a jumble of CGI battles and endless overuse slow motion.",
      "author": "Christina Newland"
    },
    {
      "text": "By the end, nothing matters. All that’s left is a resounding headache and a wish to never go through this again.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "What he’s done is make a more coherent story, allowing his characters – heroes and villains – the opportunity to develop. This is a welcome addition. Unfortunately, Snyder has also brought an almost overwhelming doom and gloom back to the DCEU.",
      "author": "Daryl MacDonald"
    },
    {
      "text": "The result is something you would expect from a film that has the task of introducing three new heroes while still having to incorporate three other established ones; It’s good enough.",
      "author": "Ryan Oquiza"
    },
    {
      "text": "Not just a MAJOR improvement from the theatrical cut, but an all-around cinematic epic delivering justice to some of the most iconic superheroes of all time.",
      "author": "Cris Parker"
    },
    {
      "text": "It’s one of my favorite EVENT/COMIC BOOK FILMS EVER. Coming off Snyder’s previous two films & giving us not just an EPIC MOVIE, but one with a heart & soul that gets to the true reasons that we love all these characters I LOVED IT.",
      "author": "Zach Pope"
    },
    {
      "text": "Zack Snyder's Justice League is arguably a more cohesive, consistent, and emotionally compelling movie than the 2017's version, despite most of the original Justice League being present in the Snyder Cut.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Bumps and all, this film is a very special second chance that rarely happens in the movie world.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Justice League is by no means a perfect visual masterpiece, especially with many of the solely Snyder-Esque colorizations that he has overutilized in 300, Batman v Superman, and Dawn of the Dead.",
      "author": "Maggie Lovitt"
    },
    {
      "text": "The general public continues to think of comic book stories and characters as something non-literary — as something not serious or worthwhile enough to consider \"high-art.\" But Zack Snyder does.",
      "author": "Jonathan Garcia"
    },
    {
      "text": "It’s a truly great blockbuster, one that surpasses the earlier theater release in every conceivable way.",
      "author": "Keith Garlington"
    },
    {
      "text": "This is unarguably (Snyder's) true vision, and while it may not win over any neutrals, die hard fans who campaigned for years can feel somewhat vindicated. Hey, at least there were no weird CGI lips.",
      "author": "Victoria Luxford"
    },
    {
      "text": "It improves upon Whedon's slapdash version from 2017, resulting in a work of visual and tonal consistency - a cohesive vision. But that doesn't make Snyder's version a masterpiece.",
      "author": "Brian Eggert"
    },
    {
      "text": "Visually, I'm never disappointed by a Zack Snyder film.",
      "author": "Kay-B"
    },
    {
      "text": "In structure and in techincals, this massive cut of 'Justice League' is perhaps better than the theatrical cut. Both, however, provide the exact same amount of entertainment.",
      "author": "Witney Seibold"
    },
    {
      "text": "Is this the ultimate example of The Emperor Has No Clothes?",
      "author": "Matt Brunson"
    },
    {
      "text": "It is impossible to overstate how much of an improvement the Snyder Cut is over the 2017 version.",
      "author": "Jason Shawhan"
    },
    {
      "text": "A significant improvement from the previous movie. Does it need to be this long? No, but this film is a reminder that a director's vision can make a significant difference in a film.",
      "author": "Rosa Parra"
    },
    {
      "text": "I can confidently say the Snyder cut is, on the whole, much better. Whether that reflects his storytelling abilities or that he had twice as much time to tell that story remains an open question.",
      "author": "James Tarmy"
    },
    {
      "text": "The Snyder Cut: Still a mess, now a million years long.",
      "author": "Richard Trenholm"
    },
    {
      "text": "Zack Snyder's Justice League has plenty of flaws and isn't likely to win over its most stubborn skeptics, but it does enough to prove it was worth making -- and worth watching.",
      "author": "Rick Marshall"
    },
    {
      "text": "This is a personal vision wrought from the toughest material imaginable, and it deserves our respect.",
      "author": "Travis Johnson"
    },
    {
      "text": "An improvement on the theatrical version-but also an overindulgent expression of its director's vision.",
      "author": "Collier Jennings"
    },
    {
      "text": "an indulgent deep, dark dive into superhero mythos, and Snyder leaves no stone unturned",
      "author": "James Kendrick"
    },
    {
      "text": "Ultimately, that this even exists is almost reason enough to give it a whirl.",
      "author": "Matt Lynch"
    },
    {
      "text": "The current DC Extended Universe can be a bit messy at times, but this is proof that when it's backed by the right minds, then it can be a hell of a show.",
      "author": "Andrew Dex"
    },
    {
      "text": "While Zack Snyder's Justice League is unquestionably better than what came before, it is still, ultimately, the same movie we've already seen.",
      "author": "Sarah Marrs"
    },
    {
      "text": "A rip-roaring superhero action picture in its own right, and more than justifies all the considerable resources and effort poured into it.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "An upgrade to be sure and one that will delight Snyder fans, DC fans, and all comic book fans (surely!?)",
      "author": "Matt Hudson"
    },
    {
      "text": "Regardless of whether you enjoy Snyder's darker, more morbid take on DC superheroes, there's no denying his 4-hour (!) cut of \"Justice League\" is a solid, all-engrossing picture",
      "author": "Caffeinated Clint"
    },
    {
      "text": "This is a time of great pride swallowing.",
      "author": "Luke Parker"
    },
    {
      "text": "Ultimately, there was nothing for me in this longer cut that I didn't already get out of the shorter cut.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The Snyder Cut turns a terrible movie into a decent one, simply by granting a coherent storytelling and proper character development. But this 4 hour long contraption won't magically turn it into a great movie (although hardcore fans may disagree).",
      "author": "Alejandro Turdó"
    },
    {
      "text": "It's overly long and there's not enough connective tissue.",
      "author": "tt stern-enzi"
    },
    {
      "text": "The pacing, though slow-burning, feels like it's telling more of a complete story, and this results in a more watchable, engaging, and polished production.",
      "author": "Stefan Pape"
    },
    {
      "text": "Can't say this one is much of an improvement other than Cyborg's character development. Overall I just don't see much artistic merit in Snyder's cut, but fan service rarely make for a good movie.",
      "author": "Ruth Maramis"
    },
    {
      "text": "There's not a moment of violent action in the long slog of the Snyder Cut that makes us feel a punch. He's like the Novocaine King of Cinema, numbing us to all feeling.",
      "author": "Eileen Jones"
    },
    {
      "text": "The original filmmaker's vision does deepen the heroes' personal and collective stories nicely, namely for the Flash and Cyborg. At four hours it's impressively light...",
      "author": "Tom Meek"
    },
    {
      "text": "Even more unbearable than the theatrical cut. [Full review in spanish].",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "This movie is kind of like revisionist history. This is better than the original cut but I don't want anyone else to do something like this.",
      "author": "Justin Brown"
    },
    {
      "text": "It's way too long. Ray Fisher and Ezra Miller are the best parts of this but it doesn't make up for the stuff that drags...",
      "author": "Brandon Collins"
    },
    {
      "text": "Zack Snyder's new director's cut of his 2017 film is twice as long, but not twice as good, as the original.",
      "author": "Robert Roten"
    },
    {
      "text": "This new cut is a good one but still way too long-which is why I had to compare it to the ultimate nachos platter. You didn't need all of it, but the end result satisfies.",
      "author": "Dan Buffa"
    },
    {
      "text": "At first, I felt relief: Wow, this is a lot better than Whedon's version! But malaria is better than Whedon's version. The new cut is merely a run-of-the-mill 21st-century comic-book flick, only more ponderous and broody than average.",
      "author": "Kyle Smith"
    },
    {
      "text": "I think it's boring, coherently boring...",
      "author": "Mark Kermode"
    },
    {
      "text": "Pointless best describes everything about this movie.",
      "author": "Shawn Edwards"
    },
    {
      "text": "Do superheroes need love while saving the world? Are they vulnerable deep down? Well, Zack Snyder's Justice League brings it all to the surface along with epic action sequences for the ages",
      "author": "Carla Renata"
    },
    {
      "text": "Let's get this out of the way first - the new cut of Justice League is better than the theatre release of Justice League. Unfortunately, that doesn't make it a good movie.",
      "author": "Robert Slack"
    },
    {
      "text": "No matter the fanbase that surrounds the film, this film is for Zack Snyder and he deserves all the praise he can get.",
      "author": "George Clark"
    },
    {
      "text": "Snyder brought it.",
      "author": "Linda Cook"
    },
    {
      "text": "Snyder has hauled the DC Comics universe to the R-rated dark side kicking and screaming...and done it oh so slowly.",
      "author": "Russ Simmons"
    },
    {
      "text": "It's at least twice as good as the original cut...but it still isn't good.",
      "author": "Bob Grimm"
    },
    {
      "text": "As a superhero product it has its moments, but it offers less than what Snyder's church followers sell on social media. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "With its improved stories, better realised protagonists and antagonists, I believe that it should resonate with fans better than ever.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "Let's not forget that the Snyder Cut was in part willed into being by a toxic social media campaign, mob rule begetting a mystical monocultural object that is finally much bigger than its ostensible creator.",
      "author": "Keith Uhlich"
    },
    {
      "text": "It still comes off like a mixed bag, with some moments that are terrific, but other parts that aren't as magical or engaging. (Full Content Review for Parents - Violence, Profanity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "The Justice League's more charismatic recruits provide spark and spunk, but not enough to elevate the interminable action scenes, which are clogged with sluggish slow motion.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "The four-hour behemoth is a cinematic singularity.",
      "author": "Neil Morris"
    },
    {
      "text": "Zack Snyder's Justice League is definitely better than the theatrical cut. If you enjoyed moments of the theatrical cut of Justice League, but you knew that something was off about it, then this one is going to feel... more coherent.",
      "author": "Andre Meadows"
    },
    {
      "text": "Not everything is fixed but everything is improved, enough to where it's quite entertaining, even at 4 hours.",
      "author": "Doug Walker"
    },
    {
      "text": "Snyder's cut is easily the strongest of the two versions released - an action packed marvel you'll want to watch again and again.",
      "author": "Jeff Ames"
    },
    {
      "text": "RELEASE THE WONDER TWINS CUT!",
      "author": "Chris McCoy"
    },
    {
      "text": "Thankfully, that character drama takes the place of all the juvenile comedy Whedon wedged into his iteration, with the young, excitable Flash serving up plenty of organic humor on his own.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "It's a miracle this film was released 4 years later! ZS's Justice League will be remembered forever in cinema history - pleasing current DC fans and attracting new ones!",
      "author": "Lauren Veneziani"
    },
    {
      "text": "Here's what Snyder seems to be trying to tell us: superheroes give you the sads.",
      "author": "Tom Shone"
    },
    {
      "text": "Ultimately, Zack Snyder's Justice League is worth it for the expanded Cyborg and Flash stories.",
      "author": "Katey Stoetzel"
    },
    {
      "text": "ZSJL is essentially a Virgilian poem about the movements of gods among men.",
      "author": "Walter Chaw"
    },
    {
      "text": "For the rest of us, it's overlong, unevenly entertaining and nonessential. I'm glad we won't be getting more of these movies.",
      "author": "Brad Keefe"
    },
    {
      "text": "An indulgence for Snyder, maybe, but one that superhero fans will enjoy.",
      "author": "Jeremy Aspinall"
    },
    {
      "text": "This is not a perfect movie, but it is both a spectacular finale to a wobbly franchise and an enormous vindication for artistic vision. We should be glad it exists.",
      "author": "Christopher Preston"
    },
    {
      "text": "This is Zack Snyder's magnum opus - a testament to the new gods of pop culture in the best and worst ways.",
      "author": "Bill Arceneaux"
    },
    {
      "text": "Self-indulgent to an extreme that few films manage while also managing to be strangely introspective, the four-hour runtime is almost necessary for this cut of film to work.",
      "author": "Matt Oakes"
    },
    {
      "text": "As with any project where the director has no checks or balances, there are problems.",
      "author": "James Berardinelli"
    },
    {
      "text": "A vast improvement over 2017's Justice League...",
      "author": "David Nusair"
    },
    {
      "text": "For all of its glorious spectacle and glaring flaws, this truly is a unique cinematic beast.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Ambitious and overstuffed, it might not be perfect, but given the choice between filmmaking-by-committee uniformity and audacious risk-taking, this overgrown fanboy will take the singular vision that aims high, however imperfect the results.",
      "author": "Rubén Rosario"
    },
    {
      "text": "More detailed, more dramatic, more entertaining - and the four hours fly by.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "This epic is vivid, original, unapologetic. Especially when compared to the sheepish 2017 picture, it's a triumph. For the first time since Wonder Woman, we're eager for a DCEU sequel.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "Zack Snyder's Justice League feels like just another name for a Special Edition Blu-ray that contains all the scenes.",
      "author": "Michael Burgin"
    },
    {
      "text": "Zack Snyder's Justice League shows Snyder's evolution from a director known for emphasizing style over substance to a man who understands why we love superhero myths, whether they live in the DC Universe or Marvel's.",
      "author": "Melanie McFarland"
    },
    {
      "text": "It remains an imperfect movie, but its issues have been greatly reduced in impact - some through the film's expansion, others through retraction - and the end result is an entertaining one.",
      "author": "Allen Adams"
    },
    {
      "text": "The thrilling reaffirmation of a unique style in superhero movies.",
      "author": "Víctor López G."
    },
    {
      "text": "Is it a satisfying event for the fans who willed it into existence? The answer is undeniably yes.",
      "author": "Rachel Wagner"
    },
    {
      "text": "As wearisomely heavy as all this probably ought to be... it's all breathtakingly watchable.",
      "author": "Tim Brayton"
    },
    {
      "text": "While retaining the basic story of its theatrically released sister cut, it's its *violent* opposite in its feeling: decadent, sincere and mythic.",
      "author": "Rhys Tarling"
    },
    {
      "text": "Snyder's vision for his superheroes finally seems to click here, while the extra length fleshes out and explores the characters tremendously well.",
      "author": "Grant Watson"
    },
    {
      "text": "In the end, though, this director's cut isn't much of an improvement over the compromised theatrical version. Both feature a strong cast and solid action serving a bland, forgettable story...",
      "author": "Tyler Smith"
    },
    {
      "text": "It validates its existence through sheer scope and force of will. You may or may not like it, but you have to respect it.",
      "author": "Allen Almachar"
    },
    {
      "text": "I think that DC fans will be happy, but regular people? Maybe not so much.",
      "author": "Lael Loewenstein"
    },
    {
      "text": "At least it makes sense, and everything works together in a way that the original cut just didn't have.",
      "author": "Andy Klein"
    },
    {
      "text": "It's a better bad film, full of CGI shenanigans.",
      "author": "Tim Cogshell"
    },
    {
      "text": "It is grand. It is ridiculous. It is, by anybody's definition of the word, cinema.",
      "author": "Sean Burns"
    },
    {
      "text": "The thing that I loved about this film that was sorely lacking in other Zack Snyder films for me and even a lot of comic book films is this had so much heart and had a great theme running through it.",
      "author": "Jaby Koay"
    },
    {
      "text": "The irresistible conclusion is that the film didn't need to be restored so much as remade; the first and most important stage in that reimagining being a new screenplay.",
      "author": "Ed Whitfield"
    },
    {
      "text": "ZSJL does an honest to Martha good job at character development. All the major characters have complete arcs. They change, grow, and are fundamentally different people at the end than they were at the beginning.",
      "author": "Tim Brennan"
    },
    {
      "text": "As much as some of the scenes made me, a casual DC Universe fan, gasp, the film's brutal length and scattershot storytelling induce more headaches than thrills.",
      "author": "Shirley Li"
    },
    {
      "text": "Zack Snyder delivers the ultimate gift to his fans. This cut of Justice League is epic and exhilarating from start to finish. It brought out a new appreciation for his work and his version with DC's beloved characters.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The two versions of Justice League provide case studies in different kinds of bad editing.",
      "author": "Dan Schindel"
    },
    {
      "text": "While not everything here works, the movie overall left me wanting more.",
      "author": "Kyle Logan"
    },
    {
      "text": "If you are going to do that (dark broody heroes), this is a very good version of that, excellent even. It just comes down to a debate over whether or not you feel this is the version of these heroes that should be getting put forth in the first place.",
      "author": "Vera Wylde"
    },
    {
      "text": "This is the DVD \"special edition\" version of a movie we're never going to see.",
      "author": "Sean P. Means"
    },
    {
      "text": "I'm not saying superhero movies or comic book movies can't have the range. I'm just saying I'm not sure that Snyder does.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "It thrives on Snyder's idiosyncrasies , and while I can't in good conscience call it a success, it's just about the best such an ill-conceived mess could've ever become.",
      "author": "Emily Wheeler"
    },
    {
      "text": "Zack Snyder's Justice League is far from being a great movie. It's an entertaining film that manages to surprise us despite telling a story we already know, showing us the importance of Snyder in putting the film together. [Full review in Spanish]",
      "author": "Alvaro Corujo"
    },
    {
      "text": "Snyder hasn't exactly pieced together a great movie, but his vision has a cohesive flow sorely missing from its predecessor. Longtime fans will find much to love.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Zack Snyder's Justice League is a vast improvement that gives fans the director's (mostly true) vision and a pretty decent closure to his trilogy of DC films.",
      "author": "Ricky Church"
    },
    {
      "text": "... needlessly overlong yet all the better for it. It still needs a good editor and significantly fewer scenes in slow-motion, but Snyder's vision does restore the most important thing Whedon cut out of Justice League: its heart.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Sadly, Snyder hasn't learned from past mistakes, stirring in more dreary Batman premonitions, sequel-baiting subplots and a comeback for Jared Leto's worst-ever Joker.",
      "author": "Andy Lea"
    },
    {
      "text": "The essential point of Snyder rebounding from a career catastrophe and making it right is demonstrated in the personal dilemma of each superhero. ZSJL's restored vision reminds us of pop art's value.",
      "author": "Armond White"
    },
    {
      "text": "This film is infinitely better. Zack Snyder's Justice League is a deeper, richer version.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Your mileage may very on this one... If you're a huge Zack Snyder fan, you're probably going to love it.",
      "author": "Kevin Carr"
    },
    {
      "text": "Zack Snyder's Justice League is now twice as long and five times more self-important...",
      "author": "Norman Wilner"
    },
    {
      "text": "The four-hour \"Snyder Cut\" doubles down on darkness and Easter eggs instead of compelling storytelling.",
      "author": "Alan Zilberman"
    },
    {
      "text": "So much more polished, entertaining, and engrossing, even when it stumbles here and there.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "While it's improved in areas of the 2017 film, Snyder's 'Justice League' still faces the same issues from 3 1/2 years ago. The long journey/fight for Snyder's 'Justice League' will be remembered while the film itself ends up being quite forgettable.",
      "author": "Alex Page"
    },
    {
      "text": "A thorough and epic story that gives every main character the time and development they deserve. A cohesive vision that is realized in the justified 4 hour runtime. Cyborg is a standout.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "Ain't half bad, which means you have at least two good solid hours of entertainingly excessive extravaganza-ism.",
      "author": "John Serba"
    },
    {
      "text": "Zack Snyder pulls off everything that was missing from the original Justice League. The Snyder's Cut is the best decision DC could have made in revitalizing their superhero universe.",
      "author": "Vincent Schilling"
    },
    {
      "text": "Zack Snyder's Justice League is a whole new movie that takes the necessary time to invest in proper character development and an epic story.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Even though Snyder has added another film's worth of material into the first one, his movie still feels choked with too much happening too fast and too little time for any of the characters to breathe.",
      "author": "Piers Marchant"
    },
    {
      "text": "Love it or hate it, Zack Snyder's Justice League is a mega moment of cinema.",
      "author": "Leo Brady"
    },
    {
      "text": "Deciding between the two versions of Justice League is like asking if you'd rather get hit in the face pretty hard for 2 hours or merely get slapped in the face for four hours.",
      "author": "Ryan Syrek"
    },
    {
      "text": "In its best moments, it achieves a distinct feel - somewhere between lovely and haunting and mythical.",
      "author": "Justin Harrison"
    },
    {
      "text": "With its excessive length, better-developed heroes, and easier-to-follow story, it's an epic, thrilling, bloated, and self-indulgent blockbuster. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "[The film] feels more relaxed between sequences, and much more respectful of the characters. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Righteous violence is Snyder's métier, and there is no one on the planet better at depicting it.",
      "author": "Sonny Bunch"
    },
    {
      "text": "The movie - which, again, is maddeningly long - is an example of what can happen when you follow your dream into a ditch.",
      "author": "Kurt Loder"
    },
    {
      "text": "A vast improvement on its predecessor, this reimagining is hedonistic, thrilling, flawed, sporadically marvellous, and ultimately entirely enjoyable popcorn cinema. In other words, it's a Zack Snyder film.",
      "author": "Doug Jamieson"
    },
    {
      "text": "[While] Snyder's version can certainly be stunning, it's ultimately undone by his excesses and the underlying flaws of an overstuffed story.",
      "author": "Tim Grierson"
    },
    {
      "text": "Is this an improvement over the more straightforward and much shorter original? Not to this reviewer, though I was in the minority who actually enjoyed the 2017 film.",
      "author": "Richard Roeper"
    },
    {
      "text": "It is a grind, it is a slog, it is a bore-it's a mental toothache of a movie, whose ending grants not so much resolution as relief.",
      "author": "Richard Brody"
    },
    {
      "text": "The result: hardly an ounce of difference.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Like him or not, theres no question Zack Snyder is a true Author - something that becomes patently clear when we compare his version of Justice League to Whedons inferior one. [Full review in Portuguese]",
      "author": "Pablo Villaça"
    },
    {
      "text": "A movie which, for all of its flaws, is evidently the result of a director's heart, soul and unfettered creative vision.",
      "author": "Tom Beasley"
    },
    {
      "text": "One of the most persuasive examples of the impact a new cut can have on a film. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "A four-hour middle finger to Joss Whedon.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "This mulligan is exhausting but an improvement.",
      "author": "Cameron Williams"
    },
    {
      "text": "...Zack Snyder's Justice League is double the length of the theatrical cut. And while it is a long movie, the story earns it...",
      "author": "Kevin Brackett"
    },
    {
      "text": "At just over four hours, ZACK SNYDER'S JUSTICE LEAGUE is an unwieldy collection of poorly reassembled subplots, rather than the sweeping epic it portends, and portends, and portends.",
      "author": "Rubin Safaya"
    },
    {
      "text": "It's perhaps the best DC film of the current cycle, and certainly the one that most embodies the inherent thrill of that publisher's canon. It's also one hell of a redemption story.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Unrelentingly funereal and serious, it confuses solemnity with profundity...a case of too much, too ponderous.",
      "author": "Frank Swietek"
    },
    {
      "text": "Zack Snyder's Justice League is a DC Comics epic that will be a delight for fans despite its lengthy runtime and some unnecessary plot detours that may turn-off general audiences.",
      "author": "Lewis Knight"
    },
    {
      "text": "Just how vastly different and improved the Snyder cut is over the prior version represents a nice feat.",
      "author": "George M. Thomas"
    },
    {
      "text": "The overall mood is funereal, though most funerals are shorter than this. Stretched over four hours, Snyder's limitations as a visual stylist also become apparent.",
      "author": "Steve Rose"
    },
    {
      "text": "It's, well... still not that good.",
      "author": "Christopher Dean"
    },
    {
      "text": "It's big, it's brash and it's bombastic. It's Zack Snyder, love him or hate him, but it's epic in every sense of the word. He's done the film Justice.",
      "author": "Garry McConnachie"
    },
    {
      "text": "So the four-hour movie argument: is it long? Yeah, I'm not denying that. But it's used well.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "ZSJL is a much better and much longer film. Cast is terrific. The grim has been toned down. The backstories are deeper, the characters more developed.",
      "author": "James Verniere"
    },
    {
      "text": "Still, a major improvement when all is said and done, and Snyder has conclusively proved his point.",
      "author": "Ty Burr"
    },
    {
      "text": "Four-plus hours is plenty of time for Snyder to have his say, yet he doesn't appear willing to let it go. But justice has been served, and it's time to move on.",
      "author": "Adam Graham"
    },
    {
      "text": "Zack Snyder's Justice League is self-indulgent, exciting, flawed, and occasionally brilliant, all at the same time.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "Zack Snyder's Justice League has a distinct view on its characters that does not disappoint, with a completely different vision than the movie released years ago. [Full Review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "As the film progressed, I found myself enjoying it. Quite a bit.",
      "author": "Dominic Corry"
    },
    {
      "text": "Zack Snyder's version of Justice League feels like too much of a good thing. He has creative control here, but its execution is this fan devoted emptiness with no real destination in mind.",
      "author": "Chris Sawin"
    },
    {
      "text": "Though Snyder's incarnation does inject the story with a little more heart and some much-needed character development for Cyborg, the changes aren't nearly compelling enough to justify making audiences sit through four hours of Synder-isms.",
      "author": "Lauren Coates"
    },
    {
      "text": "While clearing the ridiculously low bar of the previous Justice League film, the Snyder Cut delivers the goods despite being too long and flawed.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "It's a damned disgrace this version of the film wasn't the one released in theaters.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "DC should change its initials to DGAF.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Is the whole four hours really necessary? Not remotely. Still, Snyder and his fans have not fought in vain: this is genuinely a different film from the earlier Justice League, and a much more coherent one.",
      "author": "Jake Wilson"
    },
    {
      "text": "Zack Snyder's Justice League is the most successful realization of the vision that Zack Snyder's always had for the DC universe.",
      "author": "Dan Murrell"
    },
    {
      "text": "Zack Snyder's Justice League delivers exactly what people are expecting, but that might not be a good thing depending on your preference.",
      "author": "Scott Campbell"
    },
    {
      "text": "It's no wonder this Justice League feels like the Asylum version of Marvel's Avengers.",
      "author": "Ian Simmons"
    },
    {
      "text": "An ungainly miscreation trapped between extravagance in approach and austerity in mood. A habitual bleakness (to the point of self-parody) pervades the movie, doubling what was already a mind-numbing 120-minute slog into a butt-numbing 242-minute ordeal.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "It's a cinematic glow-up for the ages, transforming a box office bomb into a triumphant epic that dares to be extra.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Fans who have been waiting for this movie are likely to be pleased, but \"Zack Snyder's Justice League\" is an exercise in excess more than a truly epic movie.",
      "author": "Matthew Passantino"
    },
    {
      "text": "Snyder's pointless slo mo (movie stops for a sesame seed), muted colors, and use of music won't win over his harshest critics. Others going in with an open mind will find a much better, cohesive film that moves surprisingly well despite its length.",
      "author": "Korey Coleman"
    },
    {
      "text": "It's no 'Avengers,' but the four-hour extravaganza puts Whedon's version to shame.",
      "author": "Christian Toto"
    },
    {
      "text": "Is it worth years of hype and four hours of your time? I don't know. Is anything?",
      "author": "Sean Collier"
    },
    {
      "text": "As long as expectations are tempered and you've got four hours to kill, this curious experiment is worth your time and finally puts a decent live-action Justice League movie into the Warner Bros. catalog.",
      "author": "Kyle Wilson"
    },
    {
      "text": "An inspired vision of the same superhero team up plot we've seen 17 times now. Please let it be the last.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Is the new version a better film? Yes. A much better film? No. If we had to watch one again, would we maybe choose the shorter, funnier and messier one? Maybe.",
      "author": "Mark Meszoros"
    },
    {
      "text": "[Zack Snyder's version] is more coherent in tone and context while both motivations and character development serve better and clearer purposes.",
      "author": "Casey Chong"
    },
    {
      "text": "It actually succeeds. In more ways than I ever expected.",
      "author": "Eric Deggans"
    },
    {
      "text": "I'd love to say it isn't half-bad, but I can't, because it is. It's roughly 50 percent bad.",
      "author": "Michael Phillips"
    },
    {
      "text": "Zack Snyder's Justice League is a comicbook fan's dream come true. Despite Snyder's indulgences, its splendour and scale make it worthwhile. As a 300 million dollar dramatisation of the Super Friends cartoon? There are worse ways to spend time.",
      "author": "Kshitij Rawat"
    },
    {
      "text": "The changes in both tone and tempo are so multitudinous as to make Zack Snyder's Justice League essentially a different movie. Not so much an extended cut or a director's cut, but the definitive cut.",
      "author": "Zaki Hasan"
    },
    {
      "text": "[Zack Snyder's Justice League] is still enjoyable, but it can feel a bit long.",
      "author": "John Nguyen"
    },
    {
      "text": "If you watched Joss Whedon's version of Justice League in the theatres and thought that it needed more F-bombs and a scene in which Wonder Woman learns how to correctly brew a cup of tea, then you're in luck. This is what you asked for.",
      "author": "Rohan Naahar"
    },
    {
      "text": "Zack Snyder's Justice League is a bigger, richer, and more balanced experience, and it's a pretty good, unexpected superhero epic on its own merits.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Zack Snyder overdelivers in every category. This film is more than a cut, its an omnibus and an opera of vision. My only question is, does it promise too much?",
      "author": "Derek Sante"
    },
    {
      "text": "Justice League is ambitious popcorn movie making-meets-Greek mythology that is often just satisfied bowing down to its God-like characters as they move slowly and operatically through spaces, carrying their emotional burdens.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "The Snyder Cut manages to prove filmmaker's epic storytelling mettle while also proving that he needs an editor to whittle down his daydreams to reasonable proportions.",
      "author": "Phil Villarreal"
    },
    {
      "text": "[B]rilliant & brave, smart & complicated, hopeful & inspiring. Snyder is a great filmmaker & a wonderful storyteller, & he should be immensely proud to have created another masterpiece in the superhero genre. Hallelujah.",
      "author": "Mark Hughes"
    },
    {
      "text": "An enormous feast of Hero Cake. So much Hero Cake you could choke on it.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Review HBO Max has opened the Snyder Steakhouse and plated a Wagyu beef steak, savory in every bite because it is composed of a substantial amount of tasty and valuable fat.",
      "author": "Don Shanahan"
    },
    {
      "text": "ZSJL is a glorious beast of its own and every single facet is superior to the hodgepodge that was the theatrical cut.",
      "author": "Rendy Jones"
    },
    {
      "text": "The doubled-length simply means more opportunities for Snyder's trademark slo-mos, characters to get slammed into walls and rocks and for Junkie XL's bombastic score to drive you nuts.",
      "author": "James Croot"
    },
    {
      "text": "Zack Snyder's Justice League is aiming to be epic, and there's clearly effort put in, but it lacks the heart needed for impact.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "Zack Snyder's Justice League is a landmark in comic book films. I hope this starts a major trend in Hollywood and the mainstream studio systems: let the artists do their thing.",
      "author": "Anthony Ray Bench"
    },
    {
      "text": "Many people thought this was a Zack Snyder whim... and they were sorely mistaken. The film is very different and way better than the previous Justice League [Full Review in Spanish]",
      "author": "Gabriela Meza"
    },
    {
      "text": "Snyder improves a lot of areas from the 2017 release ... [but] all of Snyder's bad habits are amplified as well.",
      "author": "Rob Dean"
    },
    {
      "text": "... it manages to engage a surprising amount, showcasing spectacular action and undeniably effective spectacle with a more coherent (albeit bloated) story.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Snyder's infectiously sincere redux comes together in a satisfying team-up movie.",
      "author": "Matt Conway"
    },
    {
      "text": "It's amazing how context and backstory can enhance a viewing experience, \"Zack Snyder's Justice League\" - a massive, overstuffed six-part epic - makes good on its promise to fans.",
      "author": "Nate Adams"
    },
    {
      "text": "Across the board every aspect is a level up. It doesn't need to be 4 hours, but Zack Snyder still knows what he's doing. This was a fun entertaining ride that I'll never forget.",
      "author": "Brandon Avery"
    },
    {
      "text": "Zack Snyder's Justice League is the legit definition of a superhero blockbuster, with career-best work from Snyder. This is the movie we deserved four years ago and I'm sincerely happy it's here with us now.",
      "author": "Rohan Patel"
    },
    {
      "text": "Yet as a salvage job on one of cinema's biggest catastrophes, Zack Snyder's Justice League is startlingly ambitious and deeply rewarding film-making.",
      "author": "Kevin Maher"
    },
    {
      "text": "It's a flawed film, no doubt, but as an elaborate document of the battle involved in making big movies with a singular point of view it counts as some kind of bizarre victory...",
      "author": "Alistair Harkness"
    },
    {
      "text": "Suffice to say, it's deeper than the first \"cut\", though that's faint praise.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Zack Snyder's Justice League is not only the movie fans were waiting for, but it is also a great superhero film. [Full Review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "It turns out that the result is better still. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Throughout its four hours, Zack Snyder's Justice League doesn't bore you, but you also don't fall in love with it. [Full Review in Spanish]",
      "author": "Kiko Vega"
    },
    {
      "text": "Director Zack Snyder's epic vision of the Justice League delivers the hopes, dreams, and expectations of the dedicated fans that demanded it.",
      "author": "Julian Roman"
    },
    {
      "text": "This is the movie that should have been released in theaters even if it meant waiting three extra years.",
      "author": "Edward Douglas"
    },
    {
      "text": "\"Zack Snyder's Justice League\" may not be a great film, but it has the madness, strangeness and obsessiveness of a real work of art.",
      "author": "Mick LaSalle"
    },
    {
      "text": "For all its longueurs, Zack Snyder's Justice League possesses its own kind of integrity. The possessive nomenclature of the title is deserved. I'm glad the clamorous fanboys agitated and made enough noise to see their dreams come true.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Zack Snyder's Justice League may be messy and excessive, but it's nevertheless a beguiling exercise in cinematic reclamation; for better and occasionally for worse, Snyder's movie got its soul back.",
      "author": "Shaun Munro"
    },
    {
      "text": "In a genre increasingly hidebound by formula, it stands as a monument to exceptionalism that itself feels exceptional.",
      "author": "Robbie Collin"
    },
    {
      "text": "It's lengthy, uncompromising with it's tone, and has a full understanding of the importance of DC's finest heroes coming together to stop a formidable threat.",
      "author": "Murjani Rawls"
    },
    {
      "text": "When all's said and done, like the Ultimate Edition of Dawn of Justice before it, Zack Snyder's Justice League is the far superior experience. It may be longer, but the additions make the story grander and profoundly deeper ...",
      "author": "Douglas Davidson"
    },
    {
      "text": "The extended cut is ultimately a setup for future films. And could arguably be said that it's just one 4-hour long commercial.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "Zack Snyder's Justice League is a lesson in proper handling of a story, especially in terms of editing, pacing, character building, and even cinematography. It just feels more cohesive. And the 4 hour runtime only benefits it.",
      "author": "Lee McCoy"
    },
    {
      "text": "Kudos to Zack Snyder, who took this film and these beloved characters from the ashes to be re-born anew in this clearly superior new film.",
      "author": "Tom Santilli"
    },
    {
      "text": "If there's more to come Zack Snyder should be at the front of the universe so long as he wants to, as somewhere buried in all the excess here is a satisfyingly darker breed of superhero tales that's perfect counterprogramming to Marvel's family fun",
      "author": "Robert Kojder"
    },
    {
      "text": "Everything the Snyder faithful hoped it would be, and a vast improvement over its 2017 theatrical iteration.",
      "author": "Nick Schager"
    },
    {
      "text": "Painstakingly crafted and teeming with heart and substance typically left on [Snyder]'s cutting room floor, Justice League earns its indulgence.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "We're talking leaps over a tall building in a single bound better.",
      "author": "Travis Hopson"
    },
    {
      "text": "It's difficult to imagine even the most ardent Snyder detractor failing to admit that this 4-hour (we'll get to that mammoth run-time in due course) cut improves on the original film in pretty much every way.",
      "author": "Mark Cassidy"
    },
    {
      "text": "Even a good superhero flick (and this definitely isn't) shouldn't be this long.",
      "author": "John DeFore"
    },
    {
      "text": "With the length of a biblical epic and chapter breaks of a Lars von Trier drama, this reconstructed cut wears portent on its sleeve.",
      "author": "Ethan Vestby"
    },
    {
      "text": "The Snyder cut has narrative weight and fan thrilling action.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "A bigger, bolder and ultimately better Justice League, but the veneer wears thin, and after its torrid journey you may find yourself asking - was it all worth it?",
      "author": "Scott Davis"
    },
    {
      "text": "...a bold artistic achievement: a comic book movie that feels like a foreign film, and a reach by director Zack Snyder to enter Terrence Malick territory at times.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "The film is dragged out and redundant to a comical degree, but the much-improved action finale and the emphasis on Ray Fisher's Cyborg make it worth seeing and worth the fuss.",
      "author": "Scott Mendelson"
    },
    {
      "text": "I offer the simplest sentiment I can: it may be long, lofty and... long, but it's ultimately good.",
      "author": "Cameron Frew"
    },
    {
      "text": "Bigger. Better. Badass! Zack Snyder's mature and spectacular superhero epic is the best film in his DCEU trilogy. I can't wait to see it in IMAX! [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "It's all a bit #ReleaseTheDeletedScenes.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "Everything the fans wanted from the start. Bigger and better in every way!!",
      "author": "Tessa Smith"
    },
    {
      "text": "This movie was willed to life by the fans and made for fans, who will leave this film largely satisfied and hungry for more. More than three years later, justice is served.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Watching Snyder's intermittently rewarding epic - if nothing else a spectacle of completed vision - stirred up surprising emotions.",
      "author": "Richard Lawson"
    },
    {
      "text": "While there's going to be much debate both leading up to and after the release of Zack Snyder's Justice League, no one can deny the chasm in quality between Snyder and Whedon's vision.",
      "author": "Dewey Singleton"
    },
    {
      "text": "You could have totally edited a two hour cut from Snyder's footage and released the extended one on DVD.",
      "author": "Fred Topel"
    },
    {
      "text": "Twice as long, and twice as good. But is it anywhere close to even the worst Avengers movie for pure entertainment? Not in the same universe.",
      "author": "Larry Carroll"
    },
    {
      "text": "A big bold swing that truly vindicates not only Zack Snyder but the idea that DC stories are meant to be dark and dramatic. Wonder Woman, Flash & Cyborg are the standouts.",
      "author": "Grace Randolph"
    },
    {
      "text": "It's packing in a lot more than it ought to. Justice League Snyder Cut is an overambitious strange beast of a movie, designed for a select audience.",
      "author": "Akhil Arora"
    },
    {
      "text": "[Snyder's] Justice League is overlong, miserable and signifies nothing other than the potential of fandom to influence top-level creative decision-making.",
      "author": "Hannah Strong"
    },
    {
      "text": "Snyder's Justice League is more, more, more in a way that most films wouldn't dare, and, after a year of no theaters at all... to see more movies that commit so completely to a vision that it's impossible not to be swept away.",
      "author": "Karen Han"
    },
    {
      "text": "What Snyder built is a much better movie, so much that I wanted to go back to my review of the original cut and dock it a few more points.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "Though suffering from its own shortcomings, Zack Snyder's gargantuan Justice League is a commendable improvement on the widely derided original. Stock up on snacks.",
      "author": "Jordan Farley"
    },
    {
      "text": "Issues aside, Zack Snyder's Justice League has clear aspirations of being a film from the studio that gave audiences The Lord of the Rings.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Not only has the Snyder Cut finally been restored and released, it exceeds our wildest hopes.",
      "author": "Stefan Kyriazis"
    },
    {
      "text": "Zack Snyder's Justice League is a cold and it's a very broken hallelujah.",
      "author": "David Crow"
    },
    {
      "text": "This cut is no worse than the theatrical edition, but it sure is longer.",
      "author": "Darren Franich"
    },
    {
      "text": "Zack Snyder's Justice League is remarkably uninterested in people. Its heroes are gods with no believers, walking nuclear weapons that have deigned to prevent Earth from destruction.",
      "author": "Joshua Rivera"
    },
    {
      "text": "So if every whim and every indulgence has been granted, does that mean it's a good movie? If you're one of Zack Snyder's die-hard followers, then yes. For everyone else? Not really.",
      "author": "Brian Lloyd"
    },
    {
      "text": "Well, it's different enough from the 2017 film to justify its existence, if only as an artistic curio. The broad strokes, however, are largely the same, and the film's length feels inexcusable by the time the end credits have mercifully rolled.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Years of tweets have brought us a superhero movie that is kinda different than before but mostly similar and very long so it turns out hashtag ReleaseTheSnyderCut worked and PLEASE DON'T KILL BECAUSE I DIDN'T LIKE YOUR MOVIE.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "It's a vast improvement from the prior version - and, honestly, the fact there now has been more solo movies for these characters kind of retroactively helps this movie... but, in the end, it's just a movie about trying to find magic boxes.",
      "author": "Mike Ryan"
    },
    {
      "text": "An entertaining if overlong superhero flick in its own right. If this is the last DC film Snyder directs, it's a satisfactory exit.",
      "author": "Amon Warmann"
    },
    {
      "text": "while it's indisputable thatAvengers: Endgame is the better overall movie... it is not an exaggeration to say that Zack Snyder's Justice League is the more ambitious and emotionally resonant one.",
      "author": "Wade Major"
    },
    {
      "text": "Full of heart and better late than never, Zack Snyder's Justice League is the film audiences deserved to see in theatres almost four long years ago.",
      "author": "Britany Murphy"
    },
    {
      "text": "Zack Synder's Justice League is a good superhero movie that feels epic like the Lord of the Rings films, with the oldest Superheroes of our culture, added context, and characters that make it a film to definitely watch.",
      "author": "Julian Lytle"
    },
    {
      "text": "It's the Justice League that should have been, and it's painfully clear to see why. This version of the movie is a clear-cut story that really brings about closure for the DC Extended Universe that was.",
      "author": "Shah Shahid"
    },
    {
      "text": "The Snyder Cut has its share of problems - when you get the best of Snyder, you also get the worst - but it's an undeniably passionate and moving work. It earns its self-importance.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "The Snydercut is a true to form Graphic Novel come to life. From the opening scene to epic ending. Has character building, Fan deep cuts, natural comedy & levity of emotion!",
      "author": "Samuel Leggett Jr."
    },
    {
      "text": "The plot might well be standard fare for superhero movies, but its execution and clear vision makes this one of the most exciting blockbusters I've seen in a long stretch.",
      "author": "Randy Myers"
    },
    {
      "text": "The fact that it exists at all feels like a gift.",
      "author": "Emma Stefansky"
    },
    {
      "text": "The film seems to want more of everything except the quality that it most needs, and the quality that it seems to only comprehend in the abstract.",
      "author": "Maya Phillips"
    },
    {
      "text": "Mostly, though, this is a dirge, an obvious exercise in making a Serious Statement, and on that front it doesn't succeed.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "What Snyder has contrived here feels less like a vital re-energization of the form than a ponderous guided tour through a museum's worth of familiar superhero-movie tropes and convention...",
      "author": "Justin Chang"
    },
    {
      "text": "Snyder throws in everything including the kitchen sink, which occasionally makes for a clearer experience but one that's worse overall, mostly because it more vividly exposes the flaws that existed with its original premise.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "In short, it's a movie that cares enough to swing big, even if that means it misses sometimes. These beloved heroes deserve no less.",
      "author": "Angie Han"
    },
    {
      "text": "So far, so very good, and this \"Justice League\" proves a richer and more rewarding experience on almost every level.",
      "author": "Brian Lowry"
    },
    {
      "text": "At last, the wait is over for the Snyder Cut - and it's long, but surprisingly enjoyable",
      "author": "Linda Marric"
    },
    {
      "text": "Snyder's film may be exhausting but it is engaging. Justice is served.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "This feature restores the legacy of its beloved superheroes, providing them with better backstories and stirring stakes, while simultaneously restoring an auteur's creation.",
      "author": "Courtney Howard"
    },
    {
      "text": "Even though events play out largely similar to the previous version, those events at least now feel much more natural and cohesively progressed through, creating a much stronger, coherent film in the process.",
      "author": "James Whitbrook"
    },
    {
      "text": "Zack Snyder's Justice League may be the purest distillation of Snyder's concerns and stylistic tics as a filmmaker.",
      "author": "Clint Worthington"
    },
    {
      "text": "Overall, Zack Snyder's Justice League is superior to the 2017 release. It feels more coherent, more complete, and is easily the version I would recommend.",
      "author": "Brent Hankins"
    },
    {
      "text": "It's possible Zack Snyder had finally found the right balance to make the DCEU work, we'll never know now but at least we have something fun to watch.",
      "author": "Matthew Razak"
    },
    {
      "text": "It is all very faux-edgy ridiculous, but because Snyder is so straight-faced in his commitment to the exxxxxxxtreeeeeme-ness of it all, it works.",
      "author": "Barry Hertz"
    },
    {
      "text": "Zack Snyder's Justice League is an ambitious & epic instalment full of heart & humanity which will undoubtedly be a sure fire hit with Snyder cut & comic fans",
      "author": "Nicola Austin"
    },
    {
      "text": "At its core, it is a well-executed, entertaining story about the power of human connection and inspiration, one that feels both timeless and timely despite being (mostly) conceptualized and filmed nearly half a decade ago.",
      "author": "Jenna Anderson"
    },
    {
      "text": "A perfectly okay way to pass four hours.",
      "author": "Alexander Zalben"
    },
    {
      "text": "The 2017 cut got away with the characters coming together simply because it was a superhero team-up movie. Here, however, it's earned through sincere beats of coming to understand one another and well conveying that they all had something to fight for.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "The enhanced running time allows the opportunity to flesh out the character introductions (and at this length, it dang well better) but at the same time, Snyder's particular brand of storytelling and visual sensibility is very much on display.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Given its lengthy runtime, the heralded 'Snyder Cut' never makes the case for its epic scope.",
      "author": "Matt Goldberg"
    },
    {
      "text": "\"Zack Snyder's Justice League\" is a product designed to celebrate its very existence.",
      "author": "Eric Kohn"
    },
    {
      "text": "Of course this was the director's last chance to show off his sprawling vision for the DCEU, so it's understandable why he included everything, but ultimately it makes for a laborious watch.",
      "author": "Eammon Jacobs"
    },
    {
      "text": "Zack Snyder's Justice League feels more like an extended edition of 2017's theatrical release. It's better than that film, but the bar is set so incredibly low that it's not saying much.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "The film could be taken as an intentional travesty of the superhero genre, if only it weren't so tortuously tedious.",
      "author": "Pat Brown"
    },
    {
      "text": "At its core, it's an exhausting four-hour behemoth that doesn't particularly serve anyone outside of the minority that demanded its existence.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "While there are individually interesting, meaningful character arcs and it's far superior to the 2017 film, Snyder's Justice League is fragmented.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "[A] superior cut of Justice League remains out of reach, unreleased.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Zack Snyder's Justice League earns the title of one of the best superhero films because of its effectiveness in storytelling and character development.",
      "author": "Scott Menzel"
    },
    {
      "text": "No Whedon means no atrocious upper lip CGI work on Cavill, which is worth the price of admission alone.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Will surpass even the loftiest expectations. Not at all the same movie as what hit theatres in 2017.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Although it is a marathon, long and winding, I say yes to this reset (retcon) of the franchise, which begins to restore these characters to who they are and shows us a glimpse of who they might yet be: Heroes. Super and beyond.",
      "author": "Sherin Nicole"
    },
    {
      "text": "An improvement from the truncated theatrical edition, but it's still mostly a collectible for the die-hard fans with little meaningful story.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Though not every addition feels totally necessary, and some new visual effects stick out as unpolished, it's hard to overstate how much more enjoyable this version of Justice League is.",
      "author": "Tom Jorgensen"
    },
    {
      "text": "Snyder successfully balances his love of mythic imagery with a character-centric story that makes four hours feel like four minutes.",
      "author": "Evan Dossey"
    },
    {
      "text": "Zack Snyder's Justice League is unquestionably a well-crafted movie... and is vastly superior to its maligned theatrical version.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Is Zack Snyder's Justice League a superhero movie disguised as a fantasy epic, or a fantasy flick cosplaying as a superhero saga? The answer seems to be somewhere in the middle.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Everything is longer in this cut, up to and including Willem Dafoe's hair.",
      "author": "Matt Singer"
    },
    {
      "text": "Not only does this version expand on every single character and moment, but the film has way more emotion. It is a drastically different and more fleshed out movie with purpose. Zack Snyder's Justice League is epic.",
      "author": "Austin Burke"
    },
    {
      "text": "Zack Snyder's Justice League is still a shaggy dog, but it's one with a coherent vision at its core. That really does count for something.",
      "author": "Joey Magidson"
    },
    {
      "text": "[It's] more than a vindication of Snyder's original vision. It's a grand, nimble, and immersive entertainment...",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Zack Snyder's Justice League is truly an epic experience. Superior to the 2017 version in every way, this is the film experience fans deserved all along. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "It owes as much to rock concerts, video games, and multimedia installations as it does to commercial narrative filmmaking. It's maddening. It's monumental. It's art.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Zack Snyder's Justice League is a four-hour superhero movie that can be summed up in four words: 'definitely worth the wait.'",
      "author": "Carla Hay"
    },
    {
      "text": "The first epic of the streaming era. Zack Snyder's Justice League is bombastic and exactly what fans of the SnyderVerse will want.",
      "author": "EJ Moreno"
    },
    {
      "text": "Everything is perfectly consistent with what Snyder has been showing us since 2013. (...) It may be the best of the three DC movies he has directed. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "Justice League Scorecard: Snyder 1; Whedon 0",
      "author": "Allison Rose"
    },
    {
      "text": "Zack Snyder's Justice League is the superhero movie event of the decade; epic and exciting, it lives up to the hype, and features a standout performance from Ray Fisher as Cyborg along with must-see teases for a sequel we can only hope becomes a reality.",
      "author": "Josh Wilding"
    },
    {
      "text": "Unlikely to convert any of the naysayers who spent the last couple of years implying anyone tweeting #releasethesnydercut should be on a terrorist watch list, but there's no denying how impressive the final product is.",
      "author": "Dominic Griffin"
    },
    {
      "text": "Zack Snyder's Justice League is better than the theatrical cut, and if the first half wasn't so slow, the second half could have been a triumph. Instead, there is a solid three-hour movie lost in the haze of a four-hour bloated mess.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Sure, it is very long and yes, it is peak Snyder with all the visual overload you'd expect, but there's no denying it's a more cohesive and engaging version of the movie.",
      "author": "Ian Sandwell"
    },
    {
      "text": "A truly epic comic book movie, which features a tremendous amount for fans to chew over, Zack Snyder's Justice League is the film which should have hit screens back in 2017.",
      "author": "Niall Browne"
    },
    {
      "text": "If you are a DC Comics fan, you are going to love Zack Snyder's Justice League.",
      "author": "Ben Rolph"
    },
    {
      "text": "Zack Snyder's Justice League is DC's version of The Lord of the Rings. Epic, grand, and full of heart, Justice League is simply every fan's dream movie come to life.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Yes, it is better than the 2017 version, but just slightly, because it is also a 4-hour-long Zack Snyder DC superhero movie, with everything that entails. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "A highly entertaining and emotional superhero epic. This version is better than the theatrical cut in every single way.",
      "author": "Sean Chandler"
    }
  ],
  "duration": 242,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "age_rating": "R",
  "synopsis": "In ZACK SNYDER'S JUSTICE LEAGUE, determined to ensure Superman's (Henry Cavill) ultimate sacrifice was not in vain, Bruce Wayne (Ben Affleck) aligns forces with Diana Prince (Gal Gadot) with plans to recruit a team of metahumans to protect the world from an approaching threat of catastrophic proportions. The task proves more difficult than Bruce imagined, as each of the recruits must face the demons of their own pasts to transcend that which has held them back, allowing them to come together, finally forming an unprecedented league of heroes. Now united, Batman (Affleck), Wonder Woman (Gadot), Aquaman (Jason Momoa), Cyborg (Ray Fisher) and The Flash (Ezra Miller) may be too late to save the planet from Steppenwolf, DeSaad and Darkseid and their dreadful intentions.",
  "popularity": 9.2
}