{
  "movie_name": "Knives Out",
  "movie_id": "knives_out",
  "total_reviews": 471,
  "reviews": [
    {
      "text": "Not only is it so tightly written so as to sufficiently fit several characters into the story, but it is wickedly smart in how it approaches its mystery too.",
      "author": "Calum Cooper"
    },
    {
      "text": "The film is crafted in a way that is clever enough to keep you guessing, but entertaining enough to make you not care if your guess is correct.",
      "author": "Brittany Patrice Witherspoon"
    },
    {
      "text": "Knives Out is playful and entertaining but his commentary on political and personal detractions within his life spring forward...",
      "author": "Ryan McQuade"
    },
    {
      "text": "In Knives Out, the crime is treated through the police enigma genre that will keep the viewer entertained from beginning to end, through the excellent dosage of information and the different twists and turns that its resolution presents.",
      "author": "Denise Pieniazek"
    },
    {
      "text": "Witty, unpredictable and surprisingly insightful, Rian Johnson’s whodunnit Knives Out keeps you guessing until the very end.",
      "author": "Serena Seghedoni"
    },
    {
      "text": "Masterfully written dialogue, remarkable editing, and great use of classic cinematography techniques. An entertaining story with tremendous replay value and significant sociopolitical layers that only elevate the already complex yet subtle narrative.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Not only is Johnson enjoying himself, but the entire cast is clearly having a blast. And how could they not? Johnson creates for them a narrative playground full of whip-smart dialogue, genre nostalgia, and with a biting sense of humor.",
      "author": "Keith Garlington"
    },
    {
      "text": "It has good performances and brushes of originality and freshness. Yet it tries so hard for the audience's approval and validation it becomes somewhat bugging. Good movie nonetheless. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "…an engrossing puzzle that constitutes that rarest of cinematic commodities, a good story well told…",
      "author": "Eddie Harrison"
    },
    {
      "text": "A devilishly entertaining all-star murder mystery that stands with the best of the genre",
      "author": "Dan Bayer"
    },
    {
      "text": "It was one of 2019's best films, if only for the way it studies classicism in the genre that has always leaned on the lifestyles of the rich and the famous to mount its greatest mysteries.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Sharp and funny, Knives Out exceeds expectations by proving to be more than its surface implies, even as Johnson demonstrates his first-rate skill in the story's maneuvers and charades.",
      "author": "Brian Eggert"
    },
    {
      "text": "Knives Out might not be the classic whodunit that the marketing suggests, but it remains one of the most entertaining and engaging films of the year.",
      "author": "Carson Timar"
    },
    {
      "text": "A generally enjoyable time with fun cartoonish characters.",
      "author": "Taylor Baker"
    },
    {
      "text": "The dialogue is... to die for. It doesn't get any better than this.",
      "author": "Lonita Cook"
    },
    {
      "text": "An ingenious new thriller that takes the bones of Agatha Christie and brilliantly updates it for the most purely entertaining movie of the year.",
      "author": "Kip Mooney"
    },
    {
      "text": "Bubbling merrily in its humanity, and impishly clear in exposing societal rot through the cleverest of cinema lenses - a whodunit.",
      "author": "Milana Vujkov"
    },
    {
      "text": "Knives Out is a thoroughly satisfying murder mystery populated with well-drawn, idiosyncratic characters who collectively present a tapestry of modern America.",
      "author": "Yasmin Omar"
    },
    {
      "text": "A thrilling, expertly-crafted whodunit...",
      "author": "Olly Richards"
    },
    {
      "text": "A great example of what genre cinema can be on its best days, Rian Johnson's whodunit takes the rules, bends them, plays with them, reverses them and then realigns them so smoothly...",
      "author": "Luiz Oliveira"
    },
    {
      "text": "Knives Out is a self-aware, stylised farce that has a great time - and pulls you along with it.",
      "author": "Tori Brazier"
    },
    {
      "text": "Knives Out is a great antidote to the Oscar contenders and family fare that dominate this time of year. It's a purely fun time at the movies thanks to its strong story and fantastic performances.",
      "author": "Alex Bentley"
    },
    {
      "text": "It's an old-fashioned set-up but slowly echoes of modern-day issues of immigration, deportation and white entitlement are introduced to add edge to the story.",
      "author": "Richard Crouse"
    },
    {
      "text": "It's highly unlikely you're going to get through the movie without it completely getting its hooks into you.",
      "author": "Fletcher Powell"
    },
    {
      "text": "A predictable whodunit that seems to want to act as homage to the great mystery features of the past, but ends up feeling like a recycled plot from a lesser Agatha Christie novel.",
      "author": "Wesley Lovell"
    },
    {
      "text": "It gets goofier when the explanations unfold, yet the resolution and the parting shots are incredibly satisfying.",
      "author": "Mike Massie"
    },
    {
      "text": "Knives Out provides mysterious thrills while offering a timely critique of entitled white privilege.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "Everything old can be new again, and Knives Out demonstrates this brilliantly due to Rian Johnson's airtight script, assured direction and the commitment from the crazily talented cast. Foul play has never been this much fun.",
      "author": "Harris Dang"
    },
    {
      "text": "This whodunit is light entertainment at its finest, a surprising movie with an enjoyable sense of complication and a dream cast.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Rian Johnson proves himself to be one of contemporary cinema's most creative, inspired, disciplined, and downright entertaining filmmakers working today.",
      "author": "Richard Propes"
    },
    {
      "text": "This modern twist on an old classic understands that the genre's formulas are fertile ground on which to hang strident critiques of privilege and class.",
      "author": "Manuel Betancourt"
    },
    {
      "text": "Rian Johnson (\"Looper\") delivers a star-studded romp that rises above the standard \"Clue\" whodunnit by revealing the culprit early on, then watching the aftermath.",
      "author": "Jason Fraley"
    },
    {
      "text": "Rian Johnson's Knives Out is an energetic blast, not only a landmark undertaking in skill, craft, nuance, and entertaining hilarity but makes a confident and exceptional call to be considered as one of the best films of the year.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "A knowing nudge-wink that leans heavily into the genre's well-worn threads before pulling the rug out from underneath you repeatedly, Knives Out is at once a glowing tribute and a smart re-tooling of the formula by Johnson.",
      "author": "Stephen A. Russell"
    },
    {
      "text": "In its criticism of the rich for their avarice, xenophobia and general lack of humanity, Knives Out turns out to be more than a run-of-the-mill mystery yarn.",
      "author": "Joanne Laurier"
    },
    {
      "text": "The all-star cast takes turns chewing the scenery. Daniel Craig nearly steals the film as Benoit Blanc. If film fans are wondering if there is life after James Bond for Daniel Craig, the answer is a resounding YES.",
      "author": "Scott Phillips"
    },
    {
      "text": "The resolution...seems a long time coming, and it isn't quite the out-of-left-field surprise you might have hoped for. Still, writer/director Rian Johnson keeps his audience sufficiently off-balance to make things interesting.",
      "author": "Bill Newcott"
    },
    {
      "text": "Knives Out is not only a throwback to classic murder mysteries, but a well-calibrated genre exercise truly meant for these troubling times. Though the text feels retro, the subtext feels unapologetically contemporary.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Knives Out is a brilliant whodunnit film that is so much fun to unwrap and piece together. With a stellar cast, some killer humor, and a mild political undertone - it's surely set to entertain everyone.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "If you like mystery novels, you will love this film, otherwise... you will love it too. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "With a terrifically game cast and Johnson's smart, funny script, \"Knives Out\" is a wickedly fun and immensely satisfying entertainment.",
      "author": "Adam Lubitow"
    },
    {
      "text": "We are absolutely going to miss [Craig] as Bond, but perhaps he's trying out a new franchise under the unlikely name of Benoit Blanc. I certainly wouldn't mind.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "It's a mystery thriller that displays classicism and complexity without abandoning postmodern concerns. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Knives Out is at once a brilliantly plotted, tautly written whodunit in the classic style, and a brilliantly written, tautly plotted deconstruction of its genre.",
      "author": "Damond Fudge"
    },
    {
      "text": "The sheer charisma of the actors, all working at a high level and having a damn good time, propels the movie and makes it truly special.",
      "author": "Brent McKnight"
    },
    {
      "text": "I hesitate to use the term \"instant classic\" but what I will say is that Knives Out has struck a very particular sweet spot.",
      "author": "Caitlin Kennedy"
    },
    {
      "text": "It's both a witty spoof of murder mysteries and an outstanding embodiment of the genre.",
      "author": "Alex Hudson"
    },
    {
      "text": "A breath of fresh air packed tightly with wit, dark humor, and surprises aplenty...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "'Knives Out' is vital in its message, and wildly entertaining.",
      "author": "John Serba"
    },
    {
      "text": "The story, in which Johnson wrote the screenplay himself, combines a reasonably solid mix of black comedy and classic whodunit tale.",
      "author": "Casey Chong"
    },
    {
      "text": "With a perfectly calibrated tone that goes over the top and enjoys every minute, this witty, twisty comedy was vibrant yet macabre and, most importantly, totally engrossing.",
      "author": "Asia Frey"
    },
    {
      "text": "Knives Out is a deliciously twisty mystery that has no right to be as funny as it is.",
      "author": "Constance Gibbs"
    },
    {
      "text": "A hilarious \"who done it\" that will make you laugh, second guess everything, and become truly invested in the results of the investigation.",
      "author": "Tessa Smith"
    },
    {
      "text": "I love a good murder-mystery thats well-acted and well-paced. Daniel Craig was amazing.",
      "author": "Brandon Collins"
    },
    {
      "text": "It looked great, on top of the fact that the story was so interesting, and kept you glued to your seat...",
      "author": "Justin Brown"
    },
    {
      "text": "...it could be seen as a big-budget Jonathan Creek special - and is probably Johnson's least interesting film - the quality of the performances combine with the richness of the production design & Rian Johnson's style to deliver something more memorable.",
      "author": "Jim Ross"
    },
    {
      "text": "The ensemble was great.",
      "author": "Andrew Galdi"
    },
    {
      "text": "It knew what genre it was taking on and it simultaneously achieved greatness in that, but also fully meta parodied it at the same time.",
      "author": "Avaryl Halley"
    },
    {
      "text": "The entire cast is great, and the whole movie is often hilarious. This isn't your average murder mystery...",
      "author": "Shawn Edwards"
    },
    {
      "text": "A great time at the movies and just begging for a sequel.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Knives Out does go on a bit longer and there are one too many running down corridors and driving from one place to another, but as a whole the film pays off with humor, mayhem, and shows us families to whom \"entitlement\" is their middle name.",
      "author": "Marie Asner"
    },
    {
      "text": "Rian Johnson kept the mood of the movie rather light and seemingly frivolous. But don't let that fool you, it's suspenseful when it needs to be and so delightfully entertaining. That last shot is one of the best cinematic final scenes ever!",
      "author": "Ruth Maramis"
    },
    {
      "text": "While Knives Out doesn't have the weight of other Rian Johnson vehicles like Brick or Looper, one can tell the filmmaker is enjoying his time outside Star Wars.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "Johnson's writing can go from air-tight to crowded in how many figure eights it pulls like clockwork, sure, but it skips across its pond of suspects with grace.",
      "author": "Matt Cipolla"
    },
    {
      "text": "By not taking itself too seriously and focusing on the fun and intrigue, it is both delightful and smart.",
      "author": "Mina Takla"
    },
    {
      "text": "Featuring fascinating energy and political commentary laced throughout, Johnson proves he has plenty to say as a filmmaker and writer.",
      "author": "Alan French"
    },
    {
      "text": "I LOVED it. An amazing cast of characters led flawlessly by Daniel Craig, Chris Evans and Ana de Armas. The moment I thought I knew what was happening, a twist threw me. One of my year's favorite films.",
      "author": "Vincent Schilling"
    },
    {
      "text": "The wickedly talented ensemble cast are clearly having an absolute blast - and you will too.",
      "author": "Roe McDermott"
    },
    {
      "text": "It takes a look at people, how they see themselves, and how they see the people they think they know. It makes it clear, there's more to the story than we think.",
      "author": "Damian Levy"
    },
    {
      "text": "Rian Johnson's last movie was something called The Last Jedi, a trifle of a film which made little impact at the box office and generated no online reaction whatsoever.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "The classic whodunit mystery is reinvigorated in extraordinary style in writer-director Rian Johnson's Knives Out. It's the best film of its kind since 2001's Gosford Park.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Everything is familiar yet everything is amusing in Rian Johnson's composed puzzle.",
      "author": "Filipe Freitas"
    },
    {
      "text": "What I want solved is this mystery: Will we possibly get another one?",
      "author": "Michael Ward"
    },
    {
      "text": "Daniel Craig gets the best of the dialogue as the humorously named Detective Benoit Blanc.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Knives Out is self aware, funny, somewhat predictable and absolutely ridiculous in the most charming way!\"",
      "author": "Stephanie Chapman"
    },
    {
      "text": "Rian Johnson has crafted an edge of your seat mystery that is bitingly relevant as it is clever. Armed with a stellar cast and an irreverent, meticulously-paced script, Johnson has crafted a new genre classic.",
      "author": "Dan Tabor"
    },
    {
      "text": "The movie is tremendous satiric fun and that final shot is the most sublime in recent memory.",
      "author": "Randall King"
    },
    {
      "text": "Knives Out is further proof that the key factor behind exceptional success in 2019 cinema is risk taking.",
      "author": "Mahmoud Mahdy"
    },
    {
      "text": "Without losing its sense of humor and suspense, Knives Out becomes a bilious commentary on wealth and its origins. [Full Review in Spanish]",
      "author": "John Tones"
    },
    {
      "text": "a deliriously engrossing murder-mystery that wears its old-fashioned bona fides on its stylish, highly self-aware sleeve",
      "author": "James Kendrick"
    },
    {
      "text": "At over two hours, this salute to Dame Agatha feels overlong, padded ... The denouement isn't reached so much as laboriously coughed up, like a fur-ball.",
      "author": "Glenn Lovell"
    },
    {
      "text": "A plot that keeps twisting over itself without ever losing control of its goals. [Full review in Portuguese]",
      "author": "Pablo Villaça"
    },
    {
      "text": "'Knives Out' is a sharp, funny whodunit.",
      "author": "Linda Cook"
    },
    {
      "text": "Filmmaker Johnson delivers a blisteringly-paced opening stretch that effective establishes the picture's multitude of oddball, quirky figures...",
      "author": "David Nusair"
    },
    {
      "text": "[A] mischievous and wildly entertaining film.",
      "author": "Mattie Lucas"
    },
    {
      "text": "An immense Daniel Craig puts the icing on top of the delicious cake that is the casting in the film. [Full review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "It captivates the viewer 'in the moment', but starts to implode if it's further analysed. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Knives Out effectively re-establishes Johnson post-The Last Jedi as a filmmaker with a lot more on his mind than just franchise pictures.",
      "author": "Molly Templeton"
    },
    {
      "text": "The story of what really happened to Harlan Thrombey the night of his 85th birthday comes open like a safe whose dial is spun by an expert cracksman, every detail falling into place.",
      "author": "Eve Tushnet"
    },
    {
      "text": "Knives Out bends the rules without breaking them and succeeds because of it. [Full Review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "Johnson writes and directs with speed and clarity; this thing ticks along beautifully.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "In spite of such a complex story with so many great characters, Johnson makes it look too easy as it effortlessly unfolds.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The movie's fantastic cast keeps you riveted to the proceedings.",
      "author": "Sameen Amer"
    },
    {
      "text": "Features a tight plot, a superlative ensemble cast and hilarious dialogue that practically sings. One of the best of 2019.",
      "author": "Stephen Silver"
    },
    {
      "text": "Rian Johnson delivers an intelligent, fun murder mystery flick, that is certain to become a whodunit classic. [Fill review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Knives Out is a success as a great crime thriller that is wickedly clever with its unique tongue-in-cheek comedy and barrels of fun.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "This is an easy movie to adore and watch over and over.",
      "author": "Steven Prokopy"
    },
    {
      "text": "There are many motives to go see this movie. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "At a time when mainstream movies aspire to be taken seriously, Knives Out sets out to be nothing more than comfort food.",
      "author": "Asher Luberto"
    },
    {
      "text": "One of the most entertaining holiday films in years.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "A celebration of storytelling itself.",
      "author": "Ken Eisner"
    },
    {
      "text": "Most of the actors are just gussied up in cameo roles and the script is not half as clever as it thinks it is. Still you have highly watchable performances by Ana De Armas and Chris Evans.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Kudos must be given to Johnson, who took on writing, directing and producing responsibilities.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "The most fascinating thing about Knives Out is not the accumulation of unfolding events, but their characters. [Full review in Spanish]",
      "author": "Mabel Salinas"
    },
    {
      "text": "A good old-fashioned whodunnit that both celebrates and sends up the genre, but its biggest strength is an all-star cast taking its best stab at the blade-sharp dialogue.",
      "author": "Richard Trenholm"
    },
    {
      "text": "You'll enjoy this...people have to shut the heck up and just watch.",
      "author": "Korey Coleman"
    },
    {
      "text": "It delivers on what it's set out to do...very entertaining, a good crowd-pleasing movie that no one will be disappointed with.",
      "author": "Martin Thomas"
    },
    {
      "text": "This was a really good time. I was invested. It got a little slow every now and then... But then I was snap back into the flow.",
      "author": "Tony Baker"
    },
    {
      "text": "Rian Johnson's formalist homage-deconstruction of Agatha Christie whodunits has a tone unlike anything I've seen lately: wry, zesty, and relentless.",
      "author": "Sean Fennessey"
    },
    {
      "text": "Knives Outis never, ever dull and offers the kind of classy entertainment we could use more of on the big screen. And I have a feeling we'll see more of Daniel Craig's colorful character down the road.",
      "author": "Leonard Maltin"
    },
    {
      "text": "The difference [is in] Johnson's now infamous signature flourish of letting utterly traditional (even formulaic) sequences play out exactly as the audiences have been trained to expect and then going \"Okay but what if not?\"",
      "author": "Bob Chipman"
    },
    {
      "text": "Not only respects the viewer's intelligence, but invites them to be part of the story. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "It's one of those rare flicks in which I discover more to love the longer I mull it over.",
      "author": "Richard Bonaduce"
    },
    {
      "text": "This is a must-see for anyone who likes good movies, but it's a massive treat for those who believe a whodunnit should prominently feature wool cardigans.",
      "author": "Dominic Corry"
    },
    {
      "text": "The result is an atypical murder mystery that doesn't quite go the way one expects.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "Solving the mystery is one of the least important matters of Knives Out, not nearly as fun as the ride itself. And there's a lot of fun to be had.",
      "author": "Jordan Calhoun"
    },
    {
      "text": "It's murder by death in Knives Out, a delightful mystery further buoyed by a marvelous performance from Daniel Craig.",
      "author": "Matt Brunson"
    },
    {
      "text": "Rian Johnson followed up the very good Star Wars: The Last Jedi with something even better, the snide whodunit Knives Out, and we are all the better for it.",
      "author": "Tim Brennan"
    },
    {
      "text": "Wickedly entertaining, the knives are out and they hit the bullseye.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Johnson's plot is well designed, but nothing in the lensing or craft elevates the material. The film can't, or won't, commit to saying anything beyond the purely superficial...",
      "author": "Andrew Kendall"
    },
    {
      "text": "Seldom have I seen a murder mystery this well written, directed and acted. It has it all, a big, dysfunctional family all with motives for murder, a big, creepy house with a secret door, a big knife collection, witty dialog and dark humor.",
      "author": "Robert Roten"
    },
    {
      "text": "This film includes almost everything I like to see in the mystery genre. It takes place in an old Gothic mansion, exudes suspense, drops a lot of clues, introduces fascinating suspects, adds a bit of humor, and kept me guessing right up to the end.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "This delightful, hilarious, clever mystery-comedy is a total entertainment, with expert, precision work at every level -- but also with an irresistible, gleeful sense of fun bursting from the screen.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "It's one of this year's most entertaining examples of art as a reflection of the time and culture that produced it. Its Agatha Christie-inspired story, characters and aesthetic are what make it fun. Its politics are what make it valuable.",
      "author": "Abby Olcese"
    },
    {
      "text": "What makes Knives Out a meaty murder mystery is its subversive portrait of the American ruling class.",
      "author": "Chris McCoy"
    },
    {
      "text": "Knives Out is entertaining from start to finish. Perfect for fans of Agatha Christie, Clue, Murder By Death, Murder She Wrote, etc...",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Blanc is an energetic scene-stealer. [Full review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "Johnson plays somewhat by the rules of the genre, but he overwhelms the fun by holding his characters up to ridicule. Each of them is overstuffed with troubles and tribulations. The coolest cat is playboy Hugh Ransom Drysdale (an eager Chris Evans)...",
      "author": "Michael Calleri"
    },
    {
      "text": "Knives Out is loaded with flashbacks, sudden revelations, and reversals. Its greatest pleasure lies in storytelling about storytelling, planting clues that pay off an hour later.",
      "author": "Steve Erickson"
    },
    {
      "text": "Johnson's plotting is cleverly twisty and unpredictable and the dialogue witty. Even those without fond memories of the Cluedo board game or Anthony Shaffer's classic two-hander, Sleuth, should find Knives Out a rewarding amusement.",
      "author": "Lynden Barber"
    },
    {
      "text": "A thoroughly enjoyable, modern take on what is a well-worn genre, which dares to poke fun at its heritage while revelling in its quirks.",
      "author": "Martin Roberts"
    },
    {
      "text": "Rian Johnson is a masterful writer-director and his latest, Knives Out, provides plenty of evidence to support this.",
      "author": "Rob Carnevale"
    },
    {
      "text": "Silly and fun.",
      "author": "Aine O'Connor"
    },
    {
      "text": "This is good fun, even though the puking bit stands as the dumbest plot gimmick in a movie this year.",
      "author": "Bob Grimm"
    },
    {
      "text": "A classic yet still thoroughly original whodunnit, Knives Out is a movie of the year contender and makes great use of its incredible cast while keeping you guessing from start to finish.",
      "author": "Josh Wilding"
    },
    {
      "text": "A film that is happy in its own happiness. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Johnson is at his best when he's playing in his own sandbox. His take on the whodunnit is delightful and the Craig-de Armas-Evans triumvirate pops off the screen at every turn.",
      "author": "Brian Gill"
    },
    {
      "text": "Rian Johnson doesn't just laugh at the whodunit genre. He respects it and reveres it and it shows. [Full Review in Spanish]",
      "author": "Alberto Corona"
    },
    {
      "text": "To see it is to be reminded that razor-sharp dialogue is as dazzling as any special effect.",
      "author": "Margot Harrison"
    },
    {
      "text": "Beyond this just being a fun, entertaining film, the real achievement is in [Johnson] understanding exactly what his audience is thinking at all times.",
      "author": "Matt Looker"
    },
    {
      "text": "Fans of the murder mystery genre will gulp down this killing dose of delicious acting, sharp writing, and precise direction. [Full review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Knives Out is a film both familiar and completely unique, an old-school whodunnit from a new-school filmmaker. It's a razor-sharp mystery - one that cuts deep.",
      "author": "Allen Adams"
    },
    {
      "text": "Knives Out quickly spirals into unexpected territory.",
      "author": "Erik Henriksen"
    },
    {
      "text": "The extraordinary script even manages to fit in a subtext more linked to socio-political news, and without us realizing the resolution... allowing it to also generate satisfaction in that other subversive level. [Full review in Spanish]",
      "author": "Ignacio Navarro"
    },
    {
      "text": "\"Knives Out,\" in the end, believes earnestly in the whodunit, it just wants to turn it inside out. To say more about that would spoil the fun. But keep an eye here, and elsewhere, on de Armas.",
      "author": "Jake Coyle"
    },
    {
      "text": "Poirot and Miss Marple were never as much fun as this.",
      "author": "Demetrios Matheou"
    },
    {
      "text": "It's funny. It's scary. It's murderous. It's clichés blown apart, and it's ensemble acting to a farethewell.",
      "author": "Martha K. Baker"
    },
    {
      "text": "A refreshingly witty and suitably busy piece of holiday popcorn-flick entertainment.",
      "author": "Kelly Vance"
    },
    {
      "text": "If you can't tell, I found KNIVES OUT just a great time at the movies. Despite the ideas being wrestled with here, they never make the film a slog. It is an impressive feat and one that should be seen as soon as possible.",
      "author": "Tim Stevens"
    },
    {
      "text": "With Knives Out, Johnson throws out a story that Christie would have appreciated, but he makes sure to go that step further to subvert it.",
      "author": "Akhil Arora"
    },
    {
      "text": "delicious, deceptive and devious fun",
      "author": "Chris Hunneysett"
    },
    {
      "text": "Knives Out is a glorious clash of egos from the first frame to the last.",
      "author": "Kent Garrison"
    },
    {
      "text": "The movie has no narrative gaps and when it approaches that risk, it makes use of fine humorous moments. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "At two hours and 10 minutes the film's on the long side, but it's an entertaining enough pastiche and we haven't had enough of these in the cinema lately. The production design of the cluttered house is fabulous.",
      "author": "David Stratton"
    },
    {
      "text": "Rian Johnson's blackly comedic murder mystery offers a genuinely star cast, plenty of pleasing malice and twisting plot...",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "As with most ensemble casts, some actors don't get as much screen time as they should, and the problem persists here. Nevertheless, it's safe to say they all do their roles ample justice.",
      "author": "Neil Soans"
    },
    {
      "text": "Daniel Craig-starrer is two hours well spent with a hilarious and just clever enough whodunnit. Think of it as reading an Agatha Christie masterpiece.",
      "author": "Soumya Srivastava"
    },
    {
      "text": "On the one hand, I wish Rian Johnson were directing the new Star Wars installment after the job he did on The Last Jedi. On the other hand, if he were doing that, we wouldn't have the Thanksgiving feast of a murder mystery comedy, Knives Out.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Daniel Craig, people. He is outrageous. Ridiculous, even. It shouldn't work. And yet!!!",
      "author": "Kevin Fallon"
    },
    {
      "text": "As a smartly crafted and shaped piece of entertainment, Johnson's movie comes off especially good in a moment when such mid-budget, story-driven movies have all but disappeared; it's a throwback that's also an outlier.",
      "author": "Adam Nayman"
    },
    {
      "text": "In this ensemble piece of excellent performances, biting social commentary and vicious humour, de Armas is exceptional, always the blazing light at the centre of the game board.",
      "author": "Sarah Cartland"
    },
    {
      "text": "The film has a sense of glee that's infectious. It's pleasurable and occasionally silly but it's consistently fun.",
      "author": "Anupama Chopra"
    },
    {
      "text": "Johnson's affection for the all-star murder-mystery movie is evident in every frame...",
      "author": "Stephen Garrett"
    },
    {
      "text": "It's tempting to see Knives Out as a political allegory, but it's best taken at face value-as a wickedly entertaining diversion from the actual rich old men with shitty families that are part of all our lives right now.",
      "author": "Matthew Singer"
    },
    {
      "text": "Astute and light, but at the same time shockingly judicious in its social reading. [Full review in Spanish]",
      "author": "Antonio Trashorras"
    },
    {
      "text": "The film does falter a bit towards the second half but that's because Rian Johnson wanted to employ every known trope of the detective novel...You're hooked till the very end, nevertheless, thanks to the nostalgia and humour...",
      "author": "Devesh Sharma"
    },
    {
      "text": "Everyone on screen in Knives Out looks like their having the time of their lives. Jamie Lee Curtis, Toni Collette, Michael Shannon, Don Johnson, Katherine Langford, and Chris Evans bring a whole new definition to dysfunctional family.",
      "author": "Katey Stoetzel"
    },
    {
      "text": "He's not actively breaking the fourth wall, but he recognizes what's going on and just goes along for the ride, which isn't quite genre-breaking, although Johnson bends and reshapes things in an impressively sharp image.",
      "author": "tt stern-enzi"
    },
    {
      "text": "What makes it such a crowd-pleaser is that [Rian] Johnson also expresses a reassuring optimism that human decency will prevail, and that justice will favor the hard-working and good-hearted over the pernicious and self-serving.",
      "author": "Noel Murray"
    },
    {
      "text": "Ultimately, Knives Out works because the mystery works. The all-star cast is just icing on the cake-a sweet, creamy icing.",
      "author": "Alan Ng"
    },
    {
      "text": "Will keep you guessing. [Full review in Spanish]",
      "author": "Abigail Camarillo"
    },
    {
      "text": "Deception-or, rather, misperception-is built into the film's very form",
      "author": "Josh Larsen"
    },
    {
      "text": "On the performance front, the Knives Out show is comprehensively stolen - and never once returned - by a wired, inspired and kookily amusing Daniel Craig.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Writer-director Rian Johnson brilliantly keeps the game afoot. Edited with dash and panache, his ingenious plotting keeps you pretty much hooked throughout a playful 130 minutes.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Knives Out not only brings back this breed of manor house murder mystery - last a cult hit with the 1980s-era \"Clue\" - but proves that the current climate may be ripe for a full-scale modern revival.",
      "author": "Ani Bundel"
    },
    {
      "text": "A fresh, funny, intricate whodunnit which deserves to be experienced by audiences that have no idea what they're getting into.",
      "author": "Scott Wampler"
    },
    {
      "text": "Knives Out is Thanksgiving entertainment for those seething at their relatives over the turkey carcass.",
      "author": "Richard von Busack"
    },
    {
      "text": "The film is a magician's trick so thoroughly satisfying, you have no choice but to give in to its mischievous entreaties. You won't have a better time in the cineplex this year.",
      "author": "Piers Marchant"
    },
    {
      "text": "With an energised Johnson orchestrating an enthusiastic group of actors and a crew that's acing it on almost every level, it seems like cutting loose was exactly the right road to take.",
      "author": "Richard Jordan"
    },
    {
      "text": "It's too absorbingly suspenseful to be just a comedy, but it's witty.",
      "author": "Tim Appelo"
    },
    {
      "text": "Knives Out deserves to be explored as a world of it own, as Johnson balances moral conscience and black humor expertly within the constraints of the murder-mystery genre.",
      "author": "John Wenzel"
    },
    {
      "text": "I'd argue that one mystery remains: Why can't more films be this much fun?",
      "author": "Chris Knight"
    },
    {
      "text": "Rian Johnson's Knives Out is one of the best theatrical experiences to see with an audience this year.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "The movie is probably a little too long, as [Rian] Johnson can't resist piling on more and more preposterous convolutions. But the atmosphere and acting made it hard for me to decide what I'd want him to cut from it.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "Despite the story's many incidental pleasures, it never really takes off.",
      "author": "Kurt Loder"
    },
    {
      "text": "[Rian] Johnson throws in every theatrical prop he can think of and ensures that the film is both as amusing as send-ups like Clue or Murder By Death and as robust as any Christie classic.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "Knives Out isn't revolutionary and falls short of being a post-modern Poirot ... but it's an occasionally bonkers and enjoyable twist on an old tale.",
      "author": "Matt Neal"
    },
    {
      "text": "The movie Knives Out actually turns out to be is a good deal better than the cumbersome, self-satisfied movie that it's aiming towards for the first act.",
      "author": "Tim Brayton"
    },
    {
      "text": "[W]hile for all its jauntiness and whimsy, Johnson's script is serious enough to keep us guessing to the end.",
      "author": "Brian Viner"
    },
    {
      "text": "Daniel Craig is terrific leading an all star cast in fiendishly clever and entertaining murder mystery with a whole bag of new tricks that might surprise even Agatha Christie.",
      "author": "Pete Hammond"
    },
    {
      "text": "The miracle is that the whole thing doesn't topple into camp - the design ethos might best be described as HP Lovecraft meets Vivienne Westwood - but Johnson knows how stay ahead of an audience.",
      "author": "Tom Shone"
    },
    {
      "text": "Rian Johnson's Knives Out! is a cut above the usual amiable nonsense, and rescues a tired formula with ingenuity and wit.",
      "author": "Paul Whitington"
    },
    {
      "text": "[A] film that, while always likeable and easy watching, is never quite as clever or as funny as it thinks.",
      "author": "Matthew Bond"
    },
    {
      "text": "Rain Johnson's superb thriller Knives Out is an unapologetic love letter to [the] titans of mystery fiction.",
      "author": "Nathanael Hood"
    },
    {
      "text": "A modern murder mystery that delivers on the surprise of a fun mystery and plenty of murder. Rian Johnson crafts one of the year's funniest scripts.",
      "author": "EJ Moreno"
    },
    {
      "text": "It says a lot that one of the year's most entertaining films is also its most straightforward. There's little here except a tight, smart script and a bunch of extremely talented actors.",
      "author": "Jamie East"
    },
    {
      "text": "In a movie that is almost unendingly entertaining, Johnson also slides in some jokes tied to the family's political views. The whole affair is a commentary on the bizarre world of the ultra-wealthy, as well as a morality tale.",
      "author": "Brad Keefe"
    },
    {
      "text": "Sharp and cutting in its not-so-subtle critique of class warfare and ideologies, even as it serves it all up in a rambunctious caper, a hilarious whodunit (or whodonut).",
      "author": "Joel Mayward"
    },
    {
      "text": "Nefariously enjoyable, a comedic whodunit that will keep you guessing until the very end.",
      "author": "Susan Granger"
    },
    {
      "text": "Built upon a wittily verbose script that delivers more laugh-out-loud lines than most of the year's alleged comedies, Knives Out retains a beating human heart into which daggers are regularly plunged.",
      "author": "Mark Kermode"
    },
    {
      "text": "The characters are distinct for their casting but also the splenetic performance styles, a range of American popinjays heavy on the ham including the riotous multi-leveled self-caricature of Daniel Craig's Poirot-puncturing Benoit Blanc.",
      "author": "Ray Pride"
    },
    {
      "text": "Throat-slashing, backstabbing and all kinds of pointed jabs are thrust to the hilt in \"Knives Out,\" but it's the whodunit's lacerating comedy that slices to the bone. Bloody good, I'd say.",
      "author": "Al Alexander"
    },
    {
      "text": "[It] wears its influences without the tedium of pastiche or the tension-sapping laziness of parody.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Knives Out's most distinctive feature is its overwhelming sense of its own cleverness.",
      "author": "PJ Nabarro"
    },
    {
      "text": "An apparent suicide serves as the device for everyone to show up at a family compound large enough for nooks, crannies and spaces worthy of a virtual \"Clue\" game . . . with a wink, wink here and an appropriately satirical musical cue there.",
      "author": "John Urbancich"
    },
    {
      "text": "The cast looks like they were having a great time making it. Viewers should have similar fun watching it.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "A beautifully written, superbly directed and deliciously acted thriller that's alive to the pleasures of the mystery genre.",
      "author": "Matthew Turner"
    },
    {
      "text": "It's pure pleasure.",
      "author": "Jason Bailey"
    },
    {
      "text": "Decorating the action with brown wood and rep-theatre costumery, [Johnson] makes no concessions to safety in his vigorous hammering of the accelerator.",
      "author": "Donald Clarke"
    },
    {
      "text": "Rian Johnson has taken the coziest, tropiest of genres and used it to tell a story about America-and he's made my favorite movie since Mad Max: Fury Road.",
      "author": "Leah Schnelbach"
    },
    {
      "text": "Really, the only thing that keeps Knives Out from that most elite tier of renowned cinema is that it is so intentionally anti-elitist. Giving it an A+ would feel like missing the point.",
      "author": "Ryan Syrek"
    },
    {
      "text": "There's a great deal of lively and funny shenanigans with poisons and antidotes, and Johnson delivers a stab of cheerful cynicism.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "[C]inematic legerdemain as its cast expertly calibrate their performances so that arch never strays into the certain disaster of becoming artificial. The result is a giddily entertaining, emotionally engaging film that sets a new standard for its genre.",
      "author": "Andrea Chase"
    },
    {
      "text": "With shrewd plotting and razor-sharp repartee, Knives Out is one of the wittiest films of the year. It might also be one of the most hopeful.",
      "author": "Neil Morris"
    },
    {
      "text": "You hang on every line of dialogue, savor every shot, and wait breathlessly to see where things will go next. The film is pure entertainment from start to finish.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "I had a lot of fun watching this film, it was incredibly entertaining and actually funnier than I expected it to be.",
      "author": "Marianna Neal"
    },
    {
      "text": "A convoluted comic whodunit in which twist is piled upon upon twist and an exceptional cast savors the chance to misdirect us every which way while we enjoy the cunningly goofy ride they take us on.",
      "author": "Frank Swietek"
    },
    {
      "text": "However, it's Craig's tenacious, Southern-fried Poirot that steals the show. His broad drawl alone is worth the price of admission as is his exuberance once Benoit sinks his teeth into the case.",
      "author": "Charles Koplinski"
    },
    {
      "text": "An entertainment that's as smart, witty, stylish and exhilarating as any movie lover could wish for.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "\"Knives Out\" is one of the most entertaining films in theaters this holiday season.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Knives Out is clever, packed with smart twists and turns and is a dose of devilish fun. Whodunit? Rian Johnson, that's who.",
      "author": "Matt Hudson"
    },
    {
      "text": "Filmmaker Rian Johnson knows Agatha Christie's oeuvre so well that he's able to honor it and screw with it too, ripping apart its pieces, moving them around, and making the hoary conventions of the procedural genre feel almost completely fresh and vital.",
      "author": "Jeff York"
    },
    {
      "text": "[Marta] has the unenviable quirk of revealing a lie via projectile vomiting. A device used far too often, across genres, in movies these days.",
      "author": "Wendy Shreve"
    },
    {
      "text": "A sharp, witty and irresistible twist on the popular whodunnit genre.",
      "author": "Linda Marric"
    },
    {
      "text": "...after a somewhat prolonged setup, the list of suspects start exhibiting their wild personalities, putting this ensemble of legends to work.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "There is a lot of enjoyment to be had in \"Knives Out.\" (Full Content Review for Parents - Violence, Profanity, etc. - also Available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "It's wall-to-wall fun, mystery and mayhem among a wonderful array of obnoxious rich people in this snappy old-school whodunnit...The package comes complete with [enough] twists to keep fans of Agatha Christie, Murder, She Wrote and Columbo very happy.",
      "author": "Jim Schembri"
    },
    {
      "text": "This cracking mystery is a lean-forward experience, as the movie lures you deeper and deeper into its intricately plotted layers. In other words - You. Will. Be. Hooked.",
      "author": "Wenlei Ma"
    },
    {
      "text": "[Rian Johnson's] latest is a satirically malevolent gold mine that refuses to follow the rules of the genre its narrative exists within.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Knives Out is thoroughly watchable entertainment that never lets the social commentary overpower the fun. More a howdunnit than a whodunnit, it'll have you scratching your head and trying to second-guess actions right up until the end.",
      "author": "James Mottram"
    },
    {
      "text": "I suspect that Johnson, an adolescent genre enthusiast to his core, has waited since age 10 to make a movie like this. His enjoyment is contagious, even for those of us who don't think Knives Out quite hits its marks.",
      "author": "David Edelstein"
    },
    {
      "text": "All the ingredients are cooked to perfection and viewers might struggle to find a weak link in this lean cut mystery.",
      "author": "Millicent Thomas"
    },
    {
      "text": "If you are a fan of the classic style of murder-mystery whodoneits - Knives out, with a brilliant cast and sharp writing, is a brilliant effort by director/writer Rian Johnson.",
      "author": "Bill Watters"
    },
    {
      "text": "Knives Out is too long and some of the characters get lost along the way, but overall it's good nasty fun, clever enough that you cannot call it mindless but so accessible that just about everyone can enjoy the ride.",
      "author": "Robert W. Butler"
    },
    {
      "text": "To be frank, it works sublimely.",
      "author": "Jack King"
    },
    {
      "text": "It's not sharp enough to be in the awards-season discussion, but Knives Out is a deliciously fun night out at the movies.",
      "author": "Tom Santilli"
    },
    {
      "text": "Knives Out is an enticing addition to Johnson's filmography and a welcome appetizer before he goes back into orbit for more Star Wars adventures.",
      "author": "Brandy McDonnell"
    },
    {
      "text": "Knives Out is a whole lot of fun, intended to keep the audience off-balance right up until the finish. It's a razor-sharp throwback from writer-director Rian Johnson.",
      "author": "Brian Lowry"
    },
    {
      "text": "It's a murder mystery with colorful characters and a central location - but it unfolds into something more complicated and immediately relevant, creating a story that's been dazzlingly updated for a modern audience.",
      "author": "Karen Han"
    },
    {
      "text": "Even though Knives Out ultimately brings its mystery to a satisfying conclusion with a culprit named and cuffed, there's another one that gets away clean: white guilt.",
      "author": "Joshua Rivera"
    },
    {
      "text": "Knives Out is a film for lovers of murder mysteries, fans of dysfunctional family dramedies and everyone who just loves great movies.",
      "author": "James Croot"
    },
    {
      "text": "An all-round whodunitwhathappened good time.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "As Thanksgiving movies go, Knives Out is a feast of witty performances, clever writing and wicked satire for the whole (13-plus) family.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "A witty whodunnit that brings a breath of fresh air to an otherwise stale genre.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Shedding his James Bond intensity, Craig plays Blanc with well-timed goofiness, talking in circles and leaving the audience wondering (in a good way) if he is solving anything, or just likes to listen to himself.",
      "author": "Kim Campbell"
    },
    {
      "text": "Johnson's fancy style remains as appealing as ever, though his signature stylistic moves -- the rapid pans, the close-ups from low angles, the tricks with focus -- are by now as recognizable as the line of a cartoonist.",
      "author": "Jake Wilson"
    },
    {
      "text": "A viciously droll game of movie Cluedo, the murder mystery dusted off for the modern age.",
      "author": "Danny Leigh"
    },
    {
      "text": "In the hands of Craig at his most gleeful, de Armas at her career best, and Johnson oozing love for the genre, Knives Out rises splendidly to the task.",
      "author": "David Sims"
    },
    {
      "text": "The colorful character quirks and unexpected plot twists add up to a highly-enjoyable evening at the theater.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Johnson has fun with his screenplay, giving this talented group of actors their scenes of high drama and bad behavior.",
      "author": "PG Staff"
    },
    {
      "text": "A fresh Agatha Christie-type whodunnit highlighted by a sparkling performance by Daniel Craig. I truly hated to see it end.",
      "author": "Tony Medley"
    },
    {
      "text": "Mildly entertaining Clue-like outing with a disappointing role for Daniel Craig. Can I see Murder on the Orient Express instead?",
      "author": "James Verniere"
    },
    {
      "text": "Greed is definitely good when it's this funny.",
      "author": "Steve Davis"
    },
    {
      "text": "It's a worthy and loving homage to great detective stories, and also a biting satire on contemporary American politics and the hubris of the nouveau riche who forget that they never actually worked for the money they so eagerly and ignorantly protect.",
      "author": "Shelagh Rowan-Legg"
    },
    {
      "text": "The script by [Rian] Johnson does what it needs to,. with just the right amount of red herrings, plot twists and deft humor.",
      "author": "Tom Meek"
    },
    {
      "text": "This is nothing but fun from start to finish.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "With a huge ensemble of A-list talent, a razor-sharp screenplay and a head-spinning number of shocks and surprises, Johnson adheres to genre conventions while simultaneously spinning them into something more complex, more devious, and more hilarious.",
      "author": "Brent Hankins"
    },
    {
      "text": "Johnson is a stylist specializing in characters who are smarter than the genres in which they appear, but both he and the cast make it all look so easy.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Knives Out is so fun that you don't even want to think about its flaws.",
      "author": "Hannah Lynn"
    },
    {
      "text": "A heck of a lot of murderous fun.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Leave it to Johnson, who managed to piece together one of the most compelling Star Wars movies with The Last Jedi, to construct a nearly perfect murder mystery.",
      "author": "Karl Delossantos"
    },
    {
      "text": "[A] wholly original, adult-oriented Hollywood comedy which relies neither on raunchy schtick nor flaccid improv.",
      "author": "Oscar Goff"
    },
    {
      "text": "What a kick to watch whip-smart director Rian Johnson shake the cobwebs off the whodunit genre and turn it intro terrific, twisted, all-star fun that actually does keep you guessing until the deliciously slippery end.",
      "author": "Peter Travers"
    },
    {
      "text": "Looper director Johnson's clever, funny, and star-studded film subverts and elevates the mansion murder mystery genre with aplomb.",
      "author": "Thom Ernst"
    },
    {
      "text": "In the end, what's most fun about \"Knives Out\" is how fresh it feels.",
      "author": "Chris Hewitt"
    },
    {
      "text": "The plot whips along at such a pace you can feel the wind in your face, but it is also so tight that you never feel the need to even once glance back.",
      "author": "David Jenkins"
    },
    {
      "text": "It's one of the best movies of the year, and one of the most purely enjoyable, as well.",
      "author": "Linda Holmes"
    },
    {
      "text": "In an industry that often dumbs you down, Knives Out raises your IQ.",
      "author": "Cameron Meier"
    },
    {
      "text": "Simply put, Knives Out is one of the best films of Rian Johnson's career, and one of the best mysteries in a very long time.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "Though by no means groundbreaking, Knives Out is a charming addition in the popular cozy mystery subgenre.",
      "author": "David Harris"
    },
    {
      "text": "For all its faults, Knives Out is still a moderately enjoyable ride; it's brisk and often engaging, even with a substantial running time of 130 minutes.",
      "author": "Josh Martin"
    },
    {
      "text": "The breakout is the Cuban-born Ana de Armas, who brings wit and fire to the role of Marta, the lamb in the den of vipers, and a character so refreshingly honest that lying makes her puke.",
      "author": "Sean P. Means"
    },
    {
      "text": "Rian Johnson's Knives Out is an ingenious whodunit that lets us laugh at rich assholes - in this case, those of House Thrombey - and root for a protagonist who is authentically delightful.",
      "author": "Erica Ciccarone"
    },
    {
      "text": "For those looking for a well-crafted good time, the movie more than delivers.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "With Knives Out, Johnson has resurrected the whodunnit for the modern age and injected it with topical subjects while also remaining true to the form that he so clearly admires.",
      "author": "Rob Dean"
    },
    {
      "text": "Perhaps Knives Out is a bit of a predictable ride, but it's one worth taking - with all of your adult friends and siblings. This one's not for kids.",
      "author": "Tania Lamb"
    },
    {
      "text": "Ultimately, Knives Out is yet another film which demonstrates that Rian Johnson is one of the smartest most interesting directors currently working in Hollywood.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "The cast, their script, the wild and wonderful twists and turns of this finely-tuned and expertly executed plot, it's just all such an enormous ingenious unguessable giggle and I simply cannot wait to watch it again.",
      "author": "Kate Rodger"
    },
    {
      "text": "Family feuds are only fun when you're watching them, and this one is a blast -- a smart, funny ensemble cast delivering a surprisingly poignant kick in the tail.",
      "author": "Tom Bond"
    },
    {
      "text": "A really good movie, with some comedic moments and good beats...it's a great cast, and I found myself really enjoying this movie.",
      "author": "Kristian Harloff"
    },
    {
      "text": "It's almost unfair that Knives Out is as entertaining and enjoyable as it is, because any future murder mystery movies will forever have to live up to how high Rian Johnson sets the bar here with his latest effort.",
      "author": "Heather Wixson"
    },
    {
      "text": "A genre savant, Johnson understands that one of the pleasures of mystery stories is how they turn viewers into detectives, eager amateur sleuths who also sift through the clues, false and not.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Without sacrificing any of the fun and thrills of a murder mystery, Johnson toys with the basic structure and expectations of a well-worn genre.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Knives Out is best experienced knowing as little as possible. It is also best experienced with a large crowd, because there are few things as enjoyable as laughing or gasping or wincing along with a few hundred people in the dark.",
      "author": "Norman Wilner"
    },
    {
      "text": "Offers multiple levels of engagement and enjoyment; it's just that it's always hinting at the superior film it might have been.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Knives Out isn't just a beautifully made diversion. It's also a utopian vision.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Rian Johnson takes a stellar ensemble cast, then plunges them headfirst into a mystery that would make Agatha Christie swoon.",
      "author": "Julian Roman"
    },
    {
      "text": "\"Knives Out\" is as much a 'toon as it is a hat tip to the elaborate mechanics of an Agatha Christie mystery. It's silly and suspenseful in equal measure.",
      "author": "Peter Howell"
    },
    {
      "text": "Johnson has crafted a wonderfully jumbled tale of family and murder that pays homage to murder mysteries and is effortlessly entertaining.",
      "author": "Micheal Compton"
    },
    {
      "text": "It's a film filled with feints, bobs and weaves designed to throw you off the scent, earning every minute spent up onscreen.",
      "author": "Steven Sheehan"
    },
    {
      "text": "One of the insights writer-director Johnson brings to the movie is a political and cultural awareness of what is going on in today's society - a denigration and suspicion of outsiders.",
      "author": "Bob Bloom"
    },
    {
      "text": "The captivating 'Knives Out' is a cutting-edge whodunit.",
      "author": "Roger Tennis"
    },
    {
      "text": "Cuts its way to a top spot among the best films of 2019 with a terrific ensemble, a smart script and masterful direction.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Knives Out is a trite, pale comedy that tries to be as infantile as it can be within the bounds of adult entertainment.",
      "author": "Paddy Kehoe"
    },
    {
      "text": "I left not caring what the future held for a single one of these characters.",
      "author": "Michael Smith"
    },
    {
      "text": "The story is clever enough to keep you on your toes, and a fantastic cast fills in all the gaps, with especially enjoyable performances from [Chris] Evans and [Daniel] Craig.",
      "author": "Josh Terry"
    },
    {
      "text": "[Johnson] brilliantly reinvented crime noir with a high-school bent in his 2006 directorial debut \"Brick,\" and \"Knives Out\" marries the problem-solving of Sherlock and Columbo with the nuttiness of \"Clue.\"",
      "author": "Brian Truitt"
    },
    {
      "text": "[Rian] Johnson delivers what Knives Out promises: wry amusement, a mystery resolved at the last moment, and enough snide observation to justify the appropriately caustic treatment these characters so richly deserve.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Rian Johnson drags the whodunit kicking and screaming into the 21st century with the sort of breezy glee that only an enthusiast of the genre could muster.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "It's not nail-biting stuff, more of a filmed play at times, but Johnson guides the feature into some intriguing areas of behavior, and a few near-misses are fun.",
      "author": "Brian Orndorf"
    },
    {
      "text": "This is a classic murder mystery caper with a facetious postmodern point of view; it looks and feels timeless and yet its voice is quintessentially 2019.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "\"Knives Out\" deftly takes classic elements of the whodunit genre and sees Rian Johnson give it a really clever new spin. Daniel Craig, Ana de Armas, and Chris Evans shine.",
      "author": "Joey Magidson"
    },
    {
      "text": "One of the funniest movies this year, but also a genius bit of writing and filmmaking we don't get to see as often as most critics would like.",
      "author": "Edward Douglas"
    },
    {
      "text": "It is deliciously nasty, seasoned with some political jibes, a ton of fun and anything but cozy.",
      "author": "Nell Minow"
    },
    {
      "text": "The cast, the clues, and the comedy fit together like perfect puzzle pieces in quick-witted whodunit Knives Out.",
      "author": "André Hereford"
    },
    {
      "text": "Great, galloping fun---the year's most entertaining movie puzzle, with some of the sharpest edges where you least expect them.",
      "author": "Neil Pond"
    },
    {
      "text": "The kind of movie they say they don't make anymore, it's a smashing, old fashioned entertainment with a saucy, contemporary edge.",
      "author": "Sean Burns"
    },
    {
      "text": "A fresh spin on old-fashioned fun, and deserves to be witnessed by all who appreciate the medium",
      "author": "Peter Gray"
    },
    {
      "text": "Don't fear: No spoilers here. All you need to know is Knives Out is a devilish delight.",
      "author": "Simon Miraudo"
    },
    {
      "text": "...not as sharp as it could have been, but Knives Out is nonetheless an engaging romp worth taking a stab at.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "An enticing mystery, tight script, and stellar cast deliver in spades. Not only is it one of the best mysteries in eons, Knives Out is hands-down the best film of the year.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Rian Johnson has said that he wouldn't mind exploring further adventures with Blanc... So what are you waiting for? Go out and make Knives Out a hit!",
      "author": "Don Kaye"
    },
    {
      "text": "Okay, I guess, but not at all what the trailers promised. Audiences sold on an ensemble murder mystery, but instead they get a thriller with aggressive political undertones...",
      "author": "Grace Randolph"
    },
    {
      "text": "Given the way the rich keep scheming and plotting against the poor and one another, \"Knives Out\" proves to be the exact opposite of \"Parasite\" in every way imaginable.",
      "author": "Martin Tsai"
    },
    {
      "text": "This film is not as clever as it thinks it is, but is highly entertaining -- if not entirely satisfying.",
      "author": "Louisa Moore"
    },
    {
      "text": "Clever, funny and hugely entertaining.",
      "author": "Vicky Roach"
    },
    {
      "text": "Toying with the classic elements of films like Clue, Murder By Death, and the countless Agatha Christie adaptations, Rian Johnson crafts a clever puzzle that is relevant and political.",
      "author": "Sara Clements"
    },
    {
      "text": "[Rian] Johnson has constructed a tightly plotted, superbly acted \"escape room\" for both his characters and the audience to explore and puzzle over. Most will find the two hours and 10 minutes it takes to solve well worth the price of admission.",
      "author": "Michael Burgin"
    },
    {
      "text": "This incredibly smart and funny film with standout performances from actors who are having as much fun as the viewer is sure to be tops on not just critics' lists, but yours as well.",
      "author": "Pamela Powell"
    },
    {
      "text": "The class warfare picture by way of Agatha Christie that we never knew we needed, but we do, now more than ever.",
      "author": "Katie Walsh"
    },
    {
      "text": "\"Knives Out\" shows the sure hand of a serious talent.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The fun in \"Knives Out\" is watching an ensemble of super-serious actors getting to misbehave.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "The cast of familiar faces overflows with talent. [Full review in Spanish]",
      "author": "Daniel de Partearroyo"
    },
    {
      "text": "Once the game is afoot in \"Knives Out,\" its step is never less than light, swift and sure.",
      "author": "Ann Hornaday"
    },
    {
      "text": "An entirely entertaining murder-mystery jape; dryly funny, deliciously retro yet decidedly modern. Whenever you think you've got it figured out, it trips you up again... and you love it for doing so.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "It's a grand piece of star-studded, old-school studio programming, with a mix of ghoulish comedy and of-the-moment politics.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Director Rian Johnson assembles an all-star cast for this modern and humorous mystery that rejiggers all the tropes and trappings of a whodunit in a fun and frothy lens.",
      "author": "Garrett Mitchell"
    },
    {
      "text": "With the ability to make his film truly unique from any number of angles, Johnson instead plays it safe and leaves one wondering why he wanted to tell such a tame story.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "This murder mystery, which tips its hat to Sherlock Holmes, Edgar Allan Poe, Agatha Christie and Clue, features a sprawling cast of characters, almost all of whom are pegged as up to no good within the film's first twenty minutes.",
      "author": "Laura Clifford"
    },
    {
      "text": "It's exceptional escapist entertainment for those who don't mind a little spice sprinkled into their cozy mystery.",
      "author": "James Berardinelli"
    },
    {
      "text": "\"Knives Out\" is a kick. By the time it was finally revealed whodunit, I just wanted to start over and play again.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Knives Out is a reminder that one can indeed have fun at the movies!",
      "author": "Rosalie Kicks"
    },
    {
      "text": "Johnson flays layer after layer of socio-political intrigue as he twists the knife ... via an old school Jessica Fletcher-esque whodunit. Frankly, Knives Out is quite possibly the most fun you'll have at the theater this holiday season.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Thanks to a terrific ensemble cast, irreverent sensibilities, and a push for incorporating the modern world, Knives Out is more than a quirky thriller with an eye towards the past.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "\"[Craig] sprinkles all 11 herbs and spices onto his Kentucky-fried accent, and while it may prove a bit much for some, it cleverly anchors the film's tone: very humorous, a bit preposterous, but always consistent.\"",
      "author": "Liam Maguren"
    },
    {
      "text": "This film is super satisfying. It's funny, the mystery plot really works, and it also has something to say, which it does with enjoyably righteous anger. Go for the production design and the plot, leave being blown away by De Armas.",
      "author": "CJ Johnson"
    },
    {
      "text": "Knives Out is an engaging and fun whodunit story, complete with excellent writing and a stellar ensemble cast.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "Rian Johnson's Knives Out is endlessly entertaining from its twisty and captivating story to its stellar cast and subtle humor.",
      "author": "Amanda Mazzillo"
    },
    {
      "text": "It is a great cast, but mostly underutilized... It had a lot of interesting elements -- looking like an \"Eye Spy\" book come to life -- but it wasn't quite sharp enough, if you will.",
      "author": "Lael Loewenstein"
    },
    {
      "text": "I like it, but I don't love it. It wants to be an Agatha Christie film and it's setup is pretty spot on, but it's payoff is pretty clumsy.",
      "author": "Wade Major"
    },
    {
      "text": "Though earnest in its full embrace of whodunit tropes and unabashed tonal excesses, the hilarious ensemble piece capitalizes on its many qualities that will garner mass appeal.",
      "author": "Carlos Aguilar"
    },
    {
      "text": "If you liked \"Clue\" - the quintessential murder mystery of the '80s - you'll be satisfied with \"Knives Out\" which is filled with an equally eccentric ensemble played by A-listers.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Knives Out is Razor sharp! Writer/Director Rian Johnson has assembled a rogues gallery of a lovable hateful family played by A-listers who feasted on this project. This is Rian Johnson's homage to Agatha Christie",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "A fun twist on the Agatha Christie whodunit that mocks the genre while indulging in all the reasons why we like it.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Who knew murder could be this much fun?",
      "author": "Joanna Langfield"
    },
    {
      "text": "This film is just flat out fun.",
      "author": "Max Weiss"
    },
    {
      "text": "A modern take on a classic brand of storytelling, \"Knives Out\" is incredibly well crafted and endlessly entertaining.",
      "author": "Greg Maki"
    },
    {
      "text": "Sumptuous and diverting...",
      "author": "Anthony Lane"
    },
    {
      "text": "Like a clever piece of stage conjuring, \"Knives Out\" is slight but hugely enjoyable.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Enjoyed the first two acts, the last act felt sloppy.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "It's a charming, eccentric, prudent puzzler that is brave enough to become all the more thrilling.",
      "author": "Annie Banks"
    },
    {
      "text": "With everybody busy hiding something, ignorance is half the bliss of this comedic riff on classic whodunits.",
      "author": "Andiee Paviour"
    },
    {
      "text": "\"Knives Out\" plays fast and it plays farcical, but it also plays fair. Most of all, it plays like a dream.",
      "author": "Ty Burr"
    },
    {
      "text": "Maybe I'm just jaded, but to me, there isn't a genuine thrill in sight. Still, I found it an enjoyable enough way to pass the time between clichés.",
      "author": "Rex Reed"
    },
    {
      "text": "There's not a weak link in this entire cast.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "A frothy whodunit, '70s style, with a cast of today's A-list stars. Great fun.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Rian Johnson spins another wildly entertaining story that defies genre tropes, all the while giving plenty of familiar faces a ton of room to do what they do best, reminding us why we love them all in the first place.",
      "author": "Nick Kush"
    },
    {
      "text": "Writer-director Rian Johnson's fizzy Agatha Christie riff \"Knives Out\" succeeds as a throwback with more than mere nostalgia on its mind.",
      "author": "Michael Phillips"
    },
    {
      "text": "With a star-studded cast and written and directed by filmmaker, Rian Johnson, Knives Out should have been a no brainer hit.",
      "author": "Allison Rose"
    },
    {
      "text": "With its narrative double bluffs and knowingly byzantine plot twists, Knives Out nimbly swerves around the pitfalls of murder mysteries past. Full of rhythmic verve and pithy humor, this is uproariously entertaining filmmaking.",
      "author": "Christina Newland"
    },
    {
      "text": "A sensational film that brilliantly mixes humor and mystery. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "There's nuance dripping like venom from thirsty fangs all over the performance stage of Johnson's cinematic charade.",
      "author": "Don Shanahan"
    },
    {
      "text": "There's no one on earth, or even in the movies, who talks quite the way the people in Knives Out do, but we become conversant in their idiosyncratic patois by listening to it and learning the rules of this stylized fictional world.",
      "author": "Dana Stevens"
    },
    {
      "text": "Loaded with irreverent humour and a cavalcade of magnificent performances, this darkly comedic caper is a deliriously fabulous ride you won't want to end.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A renowned narrative format honoured yet subverted, a plot that is intelligent but not smug, an all-star cast that is perfectly balanced, giving performances that range from venomous to vulnerable yet are all rip-roaringly funny.",
      "author": "Laura Potier"
    },
    {
      "text": "The characters are kooky and the twists surprising, which makes for a really good time at the theater.",
      "author": "Rachel Wagner"
    },
    {
      "text": "\"Knives Out\" is witty and has an ace performance from Daniel Craig, but the mystery and big reveal left me underwhelmed.",
      "author": "Nate Adams"
    },
    {
      "text": "Knives Out leads viewers on a thrilling and wickedly fun ride as the entire ensemble offers breathtaking performances in this whodunnit mystery.",
      "author": "Molly Freeman"
    },
    {
      "text": "Rian Johnson once again subverts expectations to tremendous success.",
      "author": "Evan Dossey"
    },
    {
      "text": "With rich-families-in-crisis shows like 'Succession' becoming phenomenons, this film has potential to make a big splash at the box office. And it's good, too, which is always something.",
      "author": "Megan McLachlan"
    },
    {
      "text": "Thanks to the killer ensemble, Johnson still deals up a kind of alternative event escapism, one that deals in star-power and smarm that is so often missing from the cineplexes.",
      "author": "Matt Oakes"
    },
    {
      "text": "A fun thrill ride from beginning to end. Johnson's fresh spin on the classic whodunit formula delivers the right amount of laughs and surprises. A breakout performance from Ana de Armas. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "The contradictions at the heart of Johnson's politics make this an ultimately frustrating addition to the mystery genre.",
      "author": "Andrew Emerson"
    },
    {
      "text": "What's that I hear? It's 'as if millions of voices suddenly cried out in terror and were suddenly silenced.' The sound of deflated haters never sounded so sweet as seeing Rian Johnson's The Last Jedi followup, the wildly hilarious whodunit Knives Out.",
      "author": "Robert Daniels"
    },
    {
      "text": "Knives Out is that great story, told by someone with great imagination and at the top of his game. This might be the most fun film you'll see this year.",
      "author": "Dan Barnes"
    },
    {
      "text": "Knives Out is absolutely incredible. It honors the murder mystery genre, subverts it, injects on-point political commentary, and most importantly, is one of the most flat-out ******* entertaining movies all year",
      "author": "Robert Kojder"
    },
    {
      "text": "It's a fun and at times very amusing fresh take on the usual period genre films.",
      "author": "Katie Hogan"
    },
    {
      "text": "Hugely hilarious entertainment and delivers just what the trailer laid out to fulfill our wildest expectations.",
      "author": "Jazz Tangcay"
    },
    {
      "text": "Knives Out is a WhoDunIt thriller with an outstanding cast, an enthralling mystery, and it is directed/communicated exhilaratingly well.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Part Agatha Christie, part The Pink Panther,Knives Outis driven by its comically devious, delusional array of suspects and its southern fried detective.",
      "author": "Travis Hopson"
    },
    {
      "text": "Knives Out is an absolutely audacious but terrifically entertaining romp that's filled with suspense and plenty of twists and turns to keep you guessing throughout.",
      "author": "Nicola Austin"
    },
    {
      "text": "[T]he film plays around with the tropes of the genre while skilfully creating a riveting mystery of its own, one that functions in part as a sly, satirical take-down of Make America Great Again-style thinking.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Touching at times, this neatly wrapped tale about immigrants, upper class entitlement and Trumpian politics flawlessly refreshes the murder-mystery genre.",
      "author": "Eammon Jacobs"
    },
    {
      "text": "It's enjoyable to watch these privileged snobs squirm.",
      "author": "Rich Cline"
    },
    {
      "text": "More so than The Last Jedi, Knives Out firmly establishes Johnson as one of the most reliable filmmakers working in the mainstream today, subverting the expectations of popcorn entertainment without detracting from the simple pleasures.",
      "author": "Alistair Ryder"
    },
    {
      "text": "Knives Out delighted me to no end and kept me thinking the entire time. With each new twist, I thought I knew who did it and what was going on but then I was shown I couldn't trust a single person and that's the sign of a brilliant mystery.",
      "author": "Rachel Leishman"
    },
    {
      "text": "It's hard to imagine having a better time at the movies this year.",
      "author": "Lindsey Romain"
    },
    {
      "text": "Knives Out is a thrillingly intriguing ride. It's tense and mysterious, Rian Johnsondoes a fantastic job directing a super-tight script.",
      "author": "Ben Rolph"
    },
    {
      "text": "It's an ingeniously constructed film, which is thoroughly modern in its language and filled with so many twists it will make your head spin.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "A crowd-pleasing alternative from blockbusters and heartwrenching dramas, Johnson's take on a classic albeit outdated genre offers fresh delight for modern audiences.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Johnson, on temporary sabbatical from the Star Wars universe after The Last Jedi, has used his time well. Murder he wrote - and what a writer he is.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "There is some savvy subtext in Rian Johnson's writing, about old money and Trump-era values, but mainly this is exceptional cinematic froth, and murder at its most mirthful.",
      "author": "Kevin Maher"
    },
    {
      "text": "An ingeniously constructed, devilishly creative murder-mystery enhanced by a first-rate ensemble cast and some risky, surprising narrative choices.",
      "author": "Shaun Munro"
    },
    {
      "text": "Every time you think you've guessed what's up the writer-director's sleeve, you both have and haven't: the layering, feints, and decoys fox you exactly as he's hoping.",
      "author": "Tim Robey"
    },
    {
      "text": "A glossy, perfectly pitched production, put together with spry style and an equal desire to honour and subvert the tropes of the genre...",
      "author": "Emma Simmonds"
    },
    {
      "text": "Johnson's film is a lot of witty fun, crafted smartly and handsomely-acted, though it's not without its issues.",
      "author": "Nick Johnston"
    },
    {
      "text": "You'll burst out laughing and adore how Johnson's cast plays their cards with confidence, masks their bluffs, and presents a gallery of rogues with enjoyable deceit.",
      "author": "Matt Donato"
    },
    {
      "text": "See Knives Out! You'll laugh, you'll gasp, you'll make your guess and when the two hours and ten minutes is up you'll want to watch it all over again.",
      "author": "Gabriella Geisinger"
    },
    {
      "text": "When it comes to making a movie that's entertaining, thoughtful, sharply written, and undeniably creative, Rian Johnson is guilty as charged.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Though far from a flawless film, Knives Out is sure to be a crowd-pleaser.",
      "author": "Anna Swanson"
    },
    {
      "text": "A fun and funny whodunit which manages deliver all the classic troupes of the genre while still feeling fresh and new.",
      "author": "Sean Chandler"
    },
    {
      "text": "Bolstered by an all-star cast that entertain in every way, \"Knives Out\" is a film that brings the charm and the mystery that helped solidify Clue as an iconic film. In the future, I easily see this one standing beside it.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Knives Out is what a good trip to the cinema is all about. It is a witty, surprising, and terrifically performed film from Rian Johnson and an all-star modern classic whodunnit that subverts expectations.",
      "author": "Lewis Knight"
    },
    {
      "text": "More than anything else, Knives Out is just tremendous fun.",
      "author": "Audrey Fox"
    },
    {
      "text": "Knives Out works so well because Rian Johnson knows the clichés and tropes of this particular kind of murder mystery inside out, and understands that his audience knows them too.",
      "author": "James Marsh"
    },
    {
      "text": "The various ways in which [Rian] Johnson keeps you guessing feel fresh and new even in a dusty genre that's been selling airport paperbacks since before there were airports",
      "author": "Ed Travis"
    },
    {
      "text": "Knives Out weaves in some effective commentary on immigration.",
      "author": "Li Lai"
    },
    {
      "text": "Rian Johnson's Knives Out is an engine of perfect entertainment.",
      "author": "Alan Cerny"
    },
    {
      "text": "\"Knives Out\" is a blast, a mystery confection of good-not-great breeding.",
      "author": "Joe Gross"
    },
    {
      "text": "Knives Out is an effective, entertaining, and contemporary spin on what's no longer a worn-out genre.",
      "author": "Dan Caffrey"
    },
    {
      "text": "Knives Out's brilliant cinematography and the larger-than-life performances of the all-star cast make it stunning in theaters, but it will be an immensely rewatchable film at home, yielding new details with every viewing.",
      "author": "Bea Caicoya"
    },
    {
      "text": "Very imaginative and powerful visuals... the script is written with an amazing precision. [Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "What makes Knives Out such a joyful experience (and one that should absolutely be seen with a massive crowd) is the catharsis that comes with its very arch depiction of the toxins that currently poison the American culture.",
      "author": "Chris Feil"
    },
    {
      "text": "Knives Out is a fun and intelligent whodunnit that will keep you guessing to the very end.",
      "author": "Courtney Small"
    },
    {
      "text": "It's a miracle anyone could find a way to breathe invigorating life into the murder mystery film, but thankfully, Rian Johnson is perfect for the job.",
      "author": "Oliver Whitney"
    },
    {
      "text": "Knives Out is a fun and hilarious whodunit with an all-star cast. Rian Johnson knocks it it out of the park managing to deliver clever social commentary on our current society while paying homage to the murder mystery genre.",
      "author": "Sharronda Williams"
    },
    {
      "text": "Knives Out is an absolute blast. It'll appeal to fans of the detective mystery genre, for fans of the astounding cast, or for those that love Rian Johnson's subversively entertaining films.",
      "author": "David Fontana"
    },
    {
      "text": "There are plot twists aplenty, but none add up to much.",
      "author": "Dwight Brown"
    },
    {
      "text": "A hellishly entertaining game. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "It's a silly, sleuthy time at the movies, an autumnal caper and a sure-fire crowd-pleaser.",
      "author": "Meg Shields"
    },
    {
      "text": "Ana de Armas leads Rian Johnson's latest whodunit with the type of role and acting that transforms a career. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Knives Out is one of a kind. Rian Johnson doesn't hold back delivering big fun and spicy commentary with fiery results. And if you don't already know that Ana de Armas is something special, there's no excuses after this.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "...the idea of the film really is have a blast in giving us an old-fashioned murder mystery solved in the most old-fashioned way - through the use of the old grey cells. Poirot would approve.",
      "author": "Shubhra Gupta"
    },
    {
      "text": "Knives Out is enjoyable not just due to performance from the likes of Michael Shannon, Toni Collette, and Jamie Lee Curtis, but for the way others play against type.",
      "author": "Andrea Thompson"
    },
    {
      "text": "It's a worthy tribute to Agatha Christie, a light but pointed rebuke, and a delectable time at the movies, too.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "It lacks Hitchcockian tension or Christie-level dignity, but it's funny, surprising, and intriguing in the way it flips the usual murder-mystery script.",
      "author": "Tasha Robinson"
    },
    {
      "text": "An impeccably-staged, gripping murder mystery in the vein of Agatha Christie.",
      "author": "Christopher Machell"
    },
    {
      "text": "It's such fun to watch a writer-director like Johnson get to play with all the familiar, cozy tropes before throwing everything out the third-story window.",
      "author": "Emma Stefansky"
    },
    {
      "text": "A GREAT murder mystery.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The secret ingredient in Knives Out is its spirit of authentic love for the classic detective stories and Rian Johnson's ability to laugh with the genre and not at it. [Full Review in Spanish]",
      "author": "María Fernanda Mugica"
    },
    {
      "text": "Similar to Ready or Not earlier this year, Knives Out is an unabashed commentary on the current state of affairs in America.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Best to remember that those old movies Johnson embraces were really not that great, and to bring lowered expectations to his entertaining but scattershot update.",
      "author": "Caryn James"
    },
    {
      "text": "Through clever plotting and smart sleight of hand, Johnson has crafted a whodunit that's worthy of Agatha Christie or Arthur Conan Doyle, and one that will have audiences guessing until the final few reels.",
      "author": "Chris Tilly"
    },
    {
      "text": "A whodunit awash in twists, turns and rampant cleverness, \"Knives Out\" is, above all, a celebration of murder mysteries that puts on a fairly nifty impression of one itself.",
      "author": "Tim Grierson"
    },
    {
      "text": "Stick with Knives Out and it delivers once all of the puzzle pieces have been picked up and slotted into place.",
      "author": "Matt Maytum"
    },
    {
      "text": "Contemporary but old-fashioned shaped whodunit that both enlivens and refreshes the genre.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Johnson again infuses his love of cinema and the genre into his work. If nothing else, his clever screenplay showcases how much he enjoys one-way conversation with his audience.",
      "author": "Dustin Chase"
    },
    {
      "text": "Once you clue into the fascinating political undercurrent running beneath Knives Out, a whole other film unlocks itself before your eyes.",
      "author": "Marshall Shaffer"
    },
    {
      "text": "This film is a total bullseye from Johnson who made one of the absolute most fulfilling films of the year. Run, don't walk - KNIVES OUT flat-out rules!",
      "author": "James Clay"
    },
    {
      "text": "By proudly relaying the classic whodunit form, Rian Johnson's Knives Out returns to thrilling glory a genre whose cover has felt blown for a very long time.",
      "author": "Luke Parker"
    },
    {
      "text": "One of the funniest films of the year, this tale of deception and intrigue packs an all-star cast at their very best and some theatrical filmmaking from a technical master",
      "author": "Adam Solomons"
    },
    {
      "text": "Knives Out is a comedy first, a mystery second and a sly political commentary about the 1% a distant third. Thanks to an impeccable script, game actors and plenty of laughs, the messaging goes down easy. This one is a crowd-pleaser.",
      "author": "Joe Lipsett"
    },
    {
      "text": "Knives Out Is The Best Whodunnit Of The Decade",
      "author": "Kristy Puchko"
    },
    {
      "text": "The existence of a movie as original as Knives Out is almost a miracle. [Full Review in Spanish]",
      "author": "Daniel Martínez Mantilla"
    },
    {
      "text": "A silly, stabby, supremely clever whodunnit that only really suffers from having too little room for each of its talented players to fully register in the film's limited run time.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Knives Out positions us just where it wants us, comfortably knowing more than any one character until the tumblers fall into place and we realize there's another door, another room that we hadn't even suspected.",
      "author": "David Bax"
    },
    {
      "text": "A deliciously thrilling funhouse of mirth and malice.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Rian Johnson's Knives Out is a film that is smart and witty, has great world-building and is anchored by great performances from the entire cast.",
      "author": "Britany Murphy"
    },
    {
      "text": "A deliciously wicked murder mystery procedural that uses its superb cast to bring Agatha Christie to 2019 in a fun-filled, intriguing drama",
      "author": "J. Don Birnam"
    },
    {
      "text": "Undoubtedly, one of the year's best original films, if not one of the best studio movies of the year. I haven't had this much fun watching a movie in such a loooooong time.",
      "author": "Rendy Jones"
    },
    {
      "text": "Johnson hasn't just churned out a wink-wink spoof of the classical drawing-room mystery... with its ingenious twists and turns, he has crafted an intricate puzzle-box narrative worthy of the genre's brainiest practitioners.",
      "author": "Justin Chang"
    },
    {
      "text": "Knives Out is a classic whodunit, and doesn't mind who knows it.",
      "author": "Angie Han"
    },
    {
      "text": "This is a dizzy, zippy and surprisingly politically astute murder-mystery comedy that hits all its beats with flair, before turning around and knifing conventional thinking in the back.",
      "author": "Barry Hertz"
    },
    {
      "text": "Something new, surprising and extremely entertaining.",
      "author": "Kambole Campbell"
    },
    {
      "text": "If there's a case for a film that should be experienced purely with an audience, Rian Johnson's \"Knives Out\" would be a spectacular example. His latest feature is a deliciously entertaining, hysterical whodunit from start to finish.",
      "author": "Adriana Gomez-Weston"
    },
    {
      "text": "A crackling, devious, and hugely satisfying old-school whodunnit with a modern twist...",
      "author": "David Ehrlich"
    },
    {
      "text": "The film rolls and bounces with giddy elation, Johnson and his troupe of actors clearly enjoying themselves as they entertain.",
      "author": "Richard Lawson"
    },
    {
      "text": "Do not expect subtlety; it's the kind of movie that tells you the \"game's afoot\" twice.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Knives Out is one of the year's most entertaining films.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Benoit Blanc is Daniel Craig's next great iconic role. A total blast from beginning to end.",
      "author": "Chris Bumbray"
    },
    {
      "text": "It's an impeccably constructed roller coaster ride created by a mad (but meticulous) engineer, and when it ends you'll immediately want to get back on.",
      "author": "Adam Chitwood"
    },
    {
      "text": "This, in other words, is one of those mysteries so clever and fiendishly well-engineered that you eventually have no choice but to stop trying to get ahead of it, to simply enjoy the way it plants and payoffs.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Directing a wildly charismatic cast who are all-in on what he's doing, Johnson confidently stays a step or two ahead of his audience, leaving them breathless but satisfied at the end.",
      "author": "Brian Tallerico"
    },
    {
      "text": "The actors' hammy performances only compound the amusement of watching a dynasty propped up by largesse fall to pieces at the very thought of actually having to earn their way in life.",
      "author": "Jake Cole"
    },
    {
      "text": "If you are looking for a good time at the movies this holiday season (perhaps searching for a way to escape the family for a few hours), \"Knives Out\" is certainly one you shouldn't miss.",
      "author": "Jason Guerrasio"
    },
    {
      "text": "There's so much to love about Rian Johnson's triumph, both as gratuitously enjoyable entertainment and the first film to take on the significance of a President Trump without lapsing into corny preachiness.",
      "author": "Charles Bramesco"
    },
    {
      "text": "Knives Out gives us a hysterical whodunnit for a new generation of movie lovers.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Murder, Mayhem, Mystery with outrageously quippy dialogue from Rian Johnson makes Knives Out the most fun movie-going experience I've had in ages. A sure throwback to Christie, Clue and Hitchcock in the best way possible.",
      "author": "Carla Renata"
    },
    {
      "text": "Johnson keeps us guessing, which is good, but the thing that makes this a better mousetrap than most isn't the complexity, but the fact he's managed to rig it without the usual cheese.",
      "author": "Peter Debruge"
    },
    {
      "text": "A delicious throwback to the all-star whodunit, this juicy comedy thriller is a treat from start to finish, which should make it a sizeable hit for Lionsgate.",
      "author": "David Rooney"
    },
    {
      "text": "Working from his own original script, Johnson has much fun pulling the strings as well as the rug from underneath us time and time again.",
      "author": "Benjamin Lee"
    }
  ],
  "release_year": 2019,
  "duration": 130,
  "genres": [
    "Mystery & Thriller",
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "The circumstances surrounding the death of crime novelist Harlan Thrombey are mysterious, but there's one thing that renowned Detective Benoit Blanc knows for sure -- everyone in the wildly dysfunctional Thrombey family is a suspect. Now, Blanc must sift through a web of lies and red herrings to uncover the truth.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/pThyQovXQrw2m0s9x82twj48Jq4.jpg"
}