{
  "movie_name": "La La Land",
  "movie_id": "la_la_land",
  "total_reviews": 469,
  "reviews": [
    {
      "text": "It’s a perfect blend of homage to classic Hollywood musicals, while injecting modern filmmaking and emotion. It’s a beautiful story that evokes ideas that we can all relate with...",
      "author": "JD Duran"
    },
    {
      "text": "Chazelle takes advantage of that vulnerability for the film’s surprising second half, and that’s when La La Land gets real.",
      "author": "Brendan Cassidy"
    },
    {
      "text": "The melancholy in this film's musical sequences serves as commentary on cinema's bygone capacity to produce a unique kind of magic.",
      "author": "Angelos Koutsourakis"
    },
    {
      "text": "This film is a celebration of “the fools who dream.” The world would be a much darker place without those fools.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "I was swept away by the the dazzling, joyous, smile-inducing production.",
      "author": "Keith Garlington"
    },
    {
      "text": "La La Land may seem romantic and wistful, but from the opening sequence onward it balances reality and romance, the frustrating quality of every-day life and the false allure of Hollywood.",
      "author": "Brian Eggert"
    },
    {
      "text": "When discussing the great musicals of all time, La La Land is a film that makes us dreamers remember that anything is possible. Not only can it be added to the list of greatest musicals ever made but to the top of any list as the best film of 2016.",
      "author": "David Gonzalez"
    },
    {
      "text": "Chazelle proved he's not a One Hit Wonder director and brought a huge and ambitious production to fruition, going from the austerity of Whiplash to the bombast of Hollywood musicals [Full review in Spanish]",
      "author": "Luis Bond"
    },
    {
      "text": "The Power of Love vs. White Saviors",
      "author": "Don Shanahan"
    },
    {
      "text": "As effervescent as the finest bottle of champagne, La La Land is an intoxicating motion picture that should particularly please anyone whose heart skips a beat whenever Fred dances on the late show or Judy sings on TCM.",
      "author": "Matt Brunson"
    },
    {
      "text": "It is a simple tale told with such visual inventiveness it reminds audience the power inherent in cinema.",
      "author": "Ian Brill"
    },
    {
      "text": "Chazelle chose his leads well and he couldn't have known that betting on a team that had so much sizzle in the middling Crazy, Stupid, Love would fall flat when he brought them together again.",
      "author": "Cate Young"
    },
    {
      "text": "A gorgeous spectacle filled with beautiful music, lights, and colors. This is the must-see movie of the year.",
      "author": "Leo Brady"
    },
    {
      "text": "Doesn't just breathe new life into an old genre it performs CPR on it, bringing its beating heart back to vibrant life.",
      "author": "Richard Crouse"
    },
    {
      "text": "La La Land is a lovely, pleasing, and showstopping movie that should be watched on the biggest screen, loudest sound, and brightest colors as possible.",
      "author": "Rudie Obias"
    },
    {
      "text": "A celebration of music and magic, where swelling emotions are captured by somber yet jazzy leitmotifs.",
      "author": "Mike Massie"
    },
    {
      "text": "Features a career best performance from Emma Stone.",
      "author": "Richard Propes"
    },
    {
      "text": "La La Land 's biggest failing is its complacency...",
      "author": "Joanne Laurier"
    },
    {
      "text": "The clash of styles and ideas are collectively embraced. It's the balance of cheese meets whimsical. Romance meets heartbreak. An old tradition meets modern ways. A sincere heart meets good fun - and La La Land completely owns it, in its own magical way",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "It basks in the wonder and excitement of young love, the optimism of the dreamer, the nostalgia of classic Hollywood, and the emotion of musical fantasy.",
      "author": "Allen Almachar"
    },
    {
      "text": "It has a powerful message that lifts you from your chair, pulls you by the ears and forces you to continue with the task of fulfilling your dream. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "Pairing a filmmaker with maybe the best sense of cinematic rhythm working today with elaborate choreography, old Hollywood style musical arrangements, and two of the industry's most charming performers is a stroke of enchanting genius.",
      "author": "Brent McKnight"
    },
    {
      "text": "The meta qualities of La La Land, which have led many to call it a love letter to classic musical films, owe a great deal to this [atmospheric framing] device.",
      "author": "CJ Sheu"
    },
    {
      "text": "Its charm tells us that the magic of musicals is still more alive than ever. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "An engaging tussle, an original vision and a wonderful reboot of the Golden Age of Tinseltown musicals.",
      "author": "David Lamble"
    },
    {
      "text": "I have so many feelings about how much I hated this movie.",
      "author": "Avaryl Halley"
    },
    {
      "text": "It was a pretentious waste of my time.",
      "author": "Andrew Galdi"
    },
    {
      "text": "If La La Land brings the genre back to vitality, I'll rejoice. But while much of this movie is clever and enjoyable, I can't say I found it exciting.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "It's exquisite, unforgettable, and utterly heartbreaking.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Damien Chazelle has clearly established himself as one of today's great genre directors in all things musical.",
      "author": "Casey Chong"
    },
    {
      "text": "Do yourself a favor and catch La La Land. It's a necessary reminder that romance, triumph, and hope don't just exist in the movies.",
      "author": "Tim Brennan"
    },
    {
      "text": "La La Land is visually stunning and goes from feat to feat (the opening sequence set on a freeway is one for the books), yet it remains profoundly human.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "It'll have your heart aching with joy and yearning; its tunes will linger in your brain and hopefully weave a little bit of its magic into your life. Falling in love with it is inevitable.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "An up-beat, enchanting, classic musical...",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "It's the careful balance between the emotional realism of the acting and the sheer technical audacity of the musical numbers that elevates the movie into the realm of greatness even before Chazelle rips out your heart with the extended, bittersweet coda.",
      "author": "Chris McCoy"
    },
    {
      "text": "[Stone and Gosling] might not have the fancy footwork of Fred Astaire and Ginger Rogers, but they're radiant together nonetheless, zinging through their rapport as well as their steps.",
      "author": "Valerie Kalfrin"
    },
    {
      "text": "La La Land triumphs in its simplicity, as Chazelle seamlessly transitions witty dialogue with beautifully choreographed numbers in a heartbeat.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "[A] glorious, toe-tapping, Technicolor delight!",
      "author": "Debbie Lynn Elias"
    },
    {
      "text": "It's pretty miraculous how lush and flamboyant the movie feels from beginning to end, and it is absolutely a must-see in the theater.",
      "author": "Leslie Combemale"
    },
    {
      "text": "La La Land wants you to take in its beauty and get to know its young dreamers. The ending packs an emotional punch but most of the ride is a joyous visual feast that just wants you to have a good time.",
      "author": "Mark Varley"
    },
    {
      "text": "The characters, the chemistry, the story, the music, the dance, the romance, the view - it all tapped right into the inner recesses of my fanatical love affair with cinema.",
      "author": "Kate Rodger"
    },
    {
      "text": "While the movie is \"tongue in cheek\" and may not completely live up to the movie musical grandeur of olden days, it is, nonetheless, an uplifting, fun film.",
      "author": "Allison Rose"
    },
    {
      "text": "Here's to the ones who dream.",
      "author": "Michael J. Casey"
    },
    {
      "text": "The director replaces the dances with a sense of rhythm, applying musical mathematics with precision to the cinematographic narrative, its images, the dialogues, carry a hidden musical compass. [Full Review in Spanish]",
      "author": "Jorge Loser"
    },
    {
      "text": "While La La Land is escapist entertainment for a good chunk, its greatest parts lie in the realities, while not harsh, that plague our dreams. But hey, here's to the fools who dream.",
      "author": "Karl Delossantos"
    },
    {
      "text": "A shameless love letter to a bygone era of cinema, but it leverages that nostalgia to hide a tragic lesson about life and love.",
      "author": "Dominic Griffin"
    },
    {
      "text": "To love La La Land is to do the work for the film it didn't do itself. It requires sanitizing Sebastian, and to a lesser degree Mia, and endowing them with characteristics they never demonstrate.",
      "author": "Ryan Syrek"
    },
    {
      "text": "A ravishing romance, to be sure, filled with romance deliriously exhilarating music and declarations of love in the classic Hollywood vein.",
      "author": "Mattie Lucas"
    },
    {
      "text": "This is a very charming musical with two very likable leads.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "The takeaway for me is the love story here. At risk of understatement, this is a cinematic love story for the ages. This is a story we haven't seen on screen before, at least certainly not done this well.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "This movie is going to be in the mix for a lot of big awards.",
      "author": "Dan Murrell"
    },
    {
      "text": "It was wistful, nostalgic and magical.",
      "author": "Rachel Wagner"
    },
    {
      "text": "I left the theater, if not enchanted or swept away then at the very least diverted and perked up. I had been irrationally touched near the beginning by a shot of Stone standing alone on a hilly street in Los Angeles at night.",
      "author": "Geoffrey O'Brien"
    },
    {
      "text": "Go watch La La Land because as clichéd as it sounds, there's something in it for everyone.",
      "author": "Deborah Cornelious"
    },
    {
      "text": "La La Land captures the nostalgic joy of old Hollywood while infusing it with a generous helping of the new.",
      "author": "Allen Adams"
    },
    {
      "text": "Is it possible to fall in love with an entire film, as if it were a fellow human? Is it possible to feel nervous before (another) screening and elated after?",
      "author": "Rahul Desai"
    },
    {
      "text": "La La Land doesn't just have Male Writer Syndrome, it has White Male Writer Syndrome, which prevents writer-director Damien Chazelle's film from living up to its glorious premise.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Romantic and dreamy, colorful and elegant, melancholic, nostalgic and reflective. A breath of fresh air. [Full Review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "A romantic musical that blends Old Hollywood fantasy with modern reality.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "\"Beyond its music and costume, La La Land is retro in more ways than one.\"",
      "author": "Li Lai"
    },
    {
      "text": "Damien Chazelle gives this one a visual splendor that vibrates with style and never lacks substance from its wildly charming leads Emma Stone and Ryan Gosling.",
      "author": "James Clay"
    },
    {
      "text": "La La Land  is a melancholic ode to the 'fools who dream' and an overall majestic cinematic experience.",
      "author": "Caroline Madden"
    },
    {
      "text": "...a vivid smorgasbord of color and life.",
      "author": "Joel Mayward"
    },
    {
      "text": "La La Land is cute, pretty and fabulously entertaining but it's not happy ever after. Hollywood has broken many hearts. There are dreams and then there's reality - but the pull of Hollywood always wins in the end.",
      "author": "Alexa Dalby"
    },
    {
      "text": "La La Land plays like a big ole piece of MGM musical nostalgia. The musical numbers are impressive, with Stone and Gosling both showing incredible range. They sing. They dance. They act. And they do all three very well.",
      "author": "Micheal Compton"
    },
    {
      "text": "La La Land falls ironically foul of the dialectic it is trying so ardently to dramatise.",
      "author": "PJ Nabarro"
    },
    {
      "text": "La La Land is a wonderfully entertaining throwback film that respects the legacy it's drawing from but keeps its eyes on the present.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "The film is a very good movie that is always flirting with greatness yet its songs fail impress on the same level as the intricate imagery on display.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "The love story is paper thin and predictable, but that doesn't matter. It's the sound and the spectacle that will leave you feeling like you've just witnessed a near-perfect piece of cinema.",
      "author": "Nick Pope"
    },
    {
      "text": "It pays [its predecessors] respectful tribute and, most importantly, imparts its nostalgic hankerings to the audience seeing it so that they will be compelled to revisit those old favorites again.",
      "author": "Tomas Trussow"
    },
    {
      "text": "It's a really, really fun movie.",
      "author": "Matt Atchity"
    },
    {
      "text": "It is joyful. It leaps off the screen.",
      "author": "Christy Lemire"
    },
    {
      "text": "It's a lot of music and dancing in the movie and [the stars] aren't great at either; they're okay but not great.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "As much it is Chazelle's direction that powers the film, it is the chemistry of Ryan Gosling and Emma Stone that ties it all together.",
      "author": "Rendy Jones"
    },
    {
      "text": "La La Land shows us a Hollywood fable of failure and desperation dressed up with a fresh coat of new-wave earnestness and nostalgia.",
      "author": "Jacob Oller"
    },
    {
      "text": "Chazelle has crafted a true modern day classic that reminds us of the power of possibility and of dreams, the belief in love and being in love. It's one of the very best films of the year.",
      "author": "Erik Anderson"
    },
    {
      "text": "It's like a breath of fresh air.",
      "author": "Glynis Costin"
    },
    {
      "text": "A gorgeously photographed, unashamedly nostalgic, bittersweet marriage of the modern and the traditional, proving Chazelle's fantastic eye for musical sequences.",
      "author": "Kambole Campbell"
    },
    {
      "text": "\"La La Land\" is a wonderful romp back into the dreamy time of Old Hollywood that will make you smile.",
      "author": "Pamela Powell"
    },
    {
      "text": "Charming, alluring, beautiful, and emotionally balanced, \"La La Land\" is more than a satisfying film; it's an enchanting experience.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "Borrowing (or repackaging) liberally from 20th century musical titans, La La Land often appears drunk on nostalgia... It's a traditionalist that so longs to be a revolutionary, but not really.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "It's an airy confection of delight that is at the same time wised-up and nostalgic. And it aims for a vision of moviemaking that is rhapsodic and earnest without being sentimental.",
      "author": "Kathryn Reklis"
    },
    {
      "text": "La La Land is a throwback film that celebrates the way movies were made and the feelings that came with them, while simultaneously infusing that nostalgia into a glamorized modern Hollywood romance.",
      "author": "Morgan Rojas"
    },
    {
      "text": "The whole thing felt like such a waste of time. I squinted at the screen, trying in vain to find a point.",
      "author": "Rich Juzwiak"
    },
    {
      "text": "When I wasn't charmed by the characters, I was transported by the film's playfulness. The camera bobs and weaves around like a jazz instrument. It's not content to simply film the content. It has to react to it as well.",
      "author": "Damian Levy"
    },
    {
      "text": "Here, the director is happy, but his characters are not.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Damien Chazelle gives us a human film... [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Visually stunning. It makes Los Angeles look a lot prettier than it actually does.",
      "author": "Andre Meadows"
    },
    {
      "text": "Ambitious, hopeful and loving... a celebration of musical culture.",
      "author": "David Keyes"
    },
    {
      "text": "From its exuberant opening musical number, set atop a traffic-jammed Los Angeles freeway overpass, La La Land announces its intention to win your heart through whimsy.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Taking his love for jazz music, director/writer Damien Chazelle breathes new life into the old Hollywood musical genre much like 2011's The Artist did for silent cinema.",
      "author": "Kiko Martinez"
    },
    {
      "text": "This is totally a love letter to those old school movies with old school musicals of old-school Hollywood and it does it much better than movies who try to do it now.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "La La Land is the best movie I've ever seen.",
      "author": "Steph Cozza"
    },
    {
      "text": "La La Land is a bit like its Oscar-winning song, City of Stars: it may seem slight, but in the end, it's the little things you remember most.",
      "author": "James Plath"
    },
    {
      "text": "La La Land may not reach the greatness of the classic musicals that Chazelle clearly adores, but to borrow from J.K. Simmons' jazz taskmaster in Whiplash: good job.",
      "author": "Lawrence Garcia"
    },
    {
      "text": "La La Land is a film to treasure and to share. [Full review in Spanish]",
      "author": "Jordi Campeny"
    },
    {
      "text": "\"La La Land\" serves not only as a paean to young love and the thousands of dreamers striving to catch a break every day in LA, but also as a beautiful tribute to the city at its magical best.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "One minute in and I was bewitched. And from there it just kept on getting better.",
      "author": "Lynden Barber"
    },
    {
      "text": "... an original, distinctive, smart, witty work, whose use of its materials and allusions is utterly contemporary.",
      "author": "Uri Klein"
    },
    {
      "text": "Gosling and Stone are adorable; they comport themselves well enough at singing and dancing, and the effervescence of the work gives their somewhat amateurish routines a shaggy charm.",
      "author": "Al Hoff"
    },
    {
      "text": "Director Damien Chazelle shoots for the stars and then breathtakingly frames his leads dancing together in the moonlight",
      "author": "Robert Kojder"
    },
    {
      "text": "If Gene Kelly, Woody Allen and Steve Martin had a chance to collaborate, the result might be La La Land, the remarkable new movie by precocious young writer/director Damien Chazelle.",
      "author": "Alexandra MacAaron"
    },
    {
      "text": "With its candy-coated color palette and Emma Stone's earth-shattering performance, there's plenty of love found within La La Land.",
      "author": "Kristen Lopez"
    },
    {
      "text": "To call La La Land amazing would be an understatement. Damien Chazelle's new LA-set musical is absolute perfection.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Here it is: the musical that won an Oscar but had the statuette taken away one minute later.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Gosling shines as a prickly Jazz purist, who conceals his emotions while Stone stands out as the sparkly girl, whose eyes speak a million words. Together they are magical and so is this eternal love ballad that will change the way you look at life.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "Gosling's effortless-looking performance is relaxed, understated and, thanks to months of piano lessons, totally convincing. But it's Stone who captures the heart, with a performance that runs the full emotional gamut.",
      "author": "Matthew Bond"
    },
    {
      "text": "Stone and Gosling, at the top of their respective games, are delightful to watch together.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The wayward side effect of casting Gosling as this jazz whisperer is that La La Land becomes a Trojan horse white-savior film.",
      "author": "Ira Madison III"
    },
    {
      "text": "La La Land endeavors to show us that while it may take hard work and bitter sacrifice to reach our destination, every choice along the way, including whether or not to keep going, is up to the dreamer.",
      "author": "Emily Sears"
    },
    {
      "text": "It makes it more difficult to just let something like La La Land just passively wash over you when, however well-intentioned, the film hearkens back to a time when black humanity onscreen was deliberately hamstrung.",
      "author": "Soraya Nadia McDonald"
    },
    {
      "text": "La La Land may look like the world that we dream about, but it also understands the cruelty that can come out of (or undermine) those dreams.",
      "author": "Diana Dabrowska"
    },
    {
      "text": "With Hollywood churning out comic book superheroes and sequels, La La Land is a welcome relief, one that is truly original and celebrates music.",
      "author": "Joanne Soh"
    },
    {
      "text": "There is a reason that La La Land is the best film of the year.",
      "author": "George M. Thomas"
    },
    {
      "text": "La La Land engaged my senses in the moment, and will certainly do so any time I watch it, but it will not linger like a haunting refrain. Sadly, it didn't go to my head.",
      "author": "tt stern-enzi"
    },
    {
      "text": "La La Land is a virtuoso production that gives us all something to sing (and dance) about.",
      "author": "Lisa Jensen"
    },
    {
      "text": "La La Land is actually a love story for jazz, with a leading male character who likes to mansplain very loudly and intently whenever he gets the chance about just how important jazz music is and how he will be the saviour jazz music needs.",
      "author": "Rebecca Lewis"
    },
    {
      "text": "Writer/director Damien Chazelle's La La Land offers a delightful, exuberant indulgence in song and dance in the Fred Astaire-Ginger Rogers tradition.",
      "author": "Diane Carson"
    },
    {
      "text": "For all their crazy chemistry, the stars of Hollywood's new musical, La La Land, don't actually sing or dance all that well. Somewhat surprisingly, this actually makes the movie work.",
      "author": "Lili Loofbourow"
    },
    {
      "text": "With its occasional forays into alternate realities and dreamy, keyed-up atmosphere, La La Land plays sort of like a cheerful Mulholland Dr., but shares none of that movie's cynicism.",
      "author": "Megan Burbank"
    },
    {
      "text": "The movie has charm, at least, if nothing else. And as an attempt to pay homage to a vanishing world, La La Land is as dutiful as it is endearing - sweet, if a little sour, too.",
      "author": "K. Austin Collins"
    },
    {
      "text": "La La Land is unapologetically nostalgic for dreams, and the dream factory itself.",
      "author": "Brooke Corso"
    },
    {
      "text": "Damien Chazelle's new musical, La La Land, lacks this secret sauce of musicals: his characters have no particular reason, no real urgency, for bursting into song.",
      "author": "Alex Heeney"
    },
    {
      "text": "La La Land is a heartwarming, but not nauseating, story that will leave you feeling good when you walk out of the theater.",
      "author": "Morgan Baila"
    },
    {
      "text": "La La Land touts itself as a love letter to movie musicals, but it fails to honor the memory of films like Singing In The Rain and West Side Story through its casting choices.",
      "author": "Rebecca Farley"
    },
    {
      "text": "While (the film has) an optimistic, positive message, it loses potency by showing just how little room there is for real life - with all its compromises and challenges - in the dreams of its main characters.",
      "author": "Abby Olcese"
    },
    {
      "text": "This bittersweet musical valentine to Los Angeles - which stars Emma Stone and Ryan Gosling - is delivered with MGM magic and Jacques Demy's earthbound élan.",
      "author": "Graham Fuller"
    },
    {
      "text": "Utterly justifying why it caused such a big song and dance. Joyous.",
      "author": "Robert Martin"
    },
    {
      "text": "It's a story as old as Hollywood and jazz, and Ryan Gosling and Emma Stone feel like a pairing for the ages.",
      "author": "Angie Han"
    },
    {
      "text": "For all that, for all the time and effort the movie took, very little passion comes through.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "\"La La Land\" takes a city of broken dreams and gives us characters that are willing to take chances in spite of tasting that bitter pill of reality.",
      "author": "Blake Howard"
    },
    {
      "text": "It's a wonderful throwback to the golden era of musicals with a 21st century sheen.",
      "author": "Garry McConnachie"
    },
    {
      "text": "a bright, energetic, buzzy blast of show biz dreams and romantic fantasy, a classic story with a pair of beautiful and charismatic young stars... who meet cute, clash instantly, and dance their way to romance during a walk through the Hollywood Hills.",
      "author": "Sean Axmaker"
    },
    {
      "text": "With its gorgeous visuals, captivating narrative, and phenomenal music, La La Land easily earns its place as the very best film of 2016.",
      "author": "Jeff Beck"
    },
    {
      "text": "La La Land reflects the classic musicals just like Peter Jackson's The Hobbit reflects The Lord of the Rings: you can recognize the inspiration, but can't avoid thinking the originals were much better. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "There are so many moments that left me wanting to clap with joy, and the ending managed to both break my swelling heart and make it swell again.",
      "author": "Rain Jokinen"
    },
    {
      "text": "Don't get me wrong, LA LA LAND is fun and cutesy, and made me leave the theater with a big, goofy smile on my face. But there's one distinct difference between good movie musicals and great movie musicals.",
      "author": "Candice Frederick"
    },
    {
      "text": "In the end, La La Land is one of those rare achievements: a movie dream within a dream.",
      "author": "Dan Webster"
    },
    {
      "text": "A film with a scenic exuberance that resembles a patina in primary colors of the very vintage almanac of a disappeared and endearing world, and that tries to mythologize to Los Angeles like the capital of the dreams. [Full review in Spanish]",
      "author": "Carlos Bonfil"
    },
    {
      "text": "A huge, ambitious, color-soaked film, it's about 80 percent successful at following through on its goal to bring back the American musical.",
      "author": "Diane Pershing"
    },
    {
      "text": "There's a melancholy to La La Land that makes it linger.",
      "author": "Giovanni Fazio"
    },
    {
      "text": "La La Land doesn't swing. \"Hustle and Flow\" is a much better musical.",
      "author": "Cole Smithey"
    },
    {
      "text": "A film for the crazy ones who dare to dream, without forgetting the inescapable adversities and the sacrifices that can be quite stormy. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "A film with a nostalgic dynamism that secretes a powerful and calmly positive current that summarizes and unifies all the negative energies. [Full review in Spanish]",
      "author": "Jorge Ayala Blanco"
    },
    {
      "text": "An exceptional film that pays homage to classic musicals while building its own instant classic status. [Full review in Spanish]",
      "author": "Juan Carlos Ugarelli"
    },
    {
      "text": "Under the inherent optimism of musicals, La La Land hides a melancholic flow that will inevitably will captivate the audience. [Full review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "An instant classic that celebrates the city of Los Angeles as well as Hollywood musicals, in the hands of a director and actors who modernize the genre of musicals. [Full review in Spanish]",
      "author": "Mario P. Székely"
    },
    {
      "text": "An endearing and friendly film that, among its many successes, confirms in its protagonists two new stars for the Hollywood industry. [Full review in Spanish]",
      "author": "Fernando Moreno"
    },
    {
      "text": "The story is solid, albeit a bit predictable at times, the songs, choreography, and costume design are all so stunning, and the cinematography and lighting are the best I've seen in years. Definitely give La La Land a visit.",
      "author": "Anthony Ray Bench"
    },
    {
      "text": "A love story that has a final sequence that is as devastating as, paradoxically, hopeful. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "A fable with an dreamy atmosphere and a realistic and current message. [Full review in Spanish]",
      "author": "Anaid Ramírez"
    },
    {
      "text": "The most nominated film of this year's Oscars is also a fresh re-elaboration of musical cinema. [Full review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "La La Land is exciting and amazing, is a modern fable and a musical of the 21st century. It makes you want to continue watching and maybe try some dance steps. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "It's a pity that La La Land fled from cliche to incur in what is consider cliche. At its best, the movie flirts with the ghosts of professional frustration, only to return to the most rude pretentions. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "La La Land gives two hours of pure and genuine entertainment that ratify Chazelle no longer as a promise but as one of the most talented directors on the current scene. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "An imperfect film but with a lot of identity, and for the Hollywood atmosphere accustomed to formalities, that's very transcendental. [Full review in Spanish]",
      "author": "Carlos Caramantín"
    },
    {
      "text": "It's just gorgeous, like a flipbook made of dreamy vintage postcards that are somehow about contemporary life in Los Angeles.",
      "author": "Linda Holmes"
    },
    {
      "text": "La La Land is a beautiful modern homage to the classic musicals from yesteryear and a love letter to all those people struggling to follow their dreams. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "A film where every single piece clicks perfectly into place ... there are numerous moments that look and feel instantly iconic.",
      "author": "Matt Neal"
    },
    {
      "text": "The extended final sequence takes everything that has occurred and remakes it so that happiness seemingly lasts for both a few perfect moments and many years. It's incandescent and heartbreaking at the same time.",
      "author": "Craig Mathieson"
    },
    {
      "text": "A sophisticated tap routine on the tombs of the great masters of the genre, taking care not to destroy the tombstones. [Full review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "La La Land offers a warming, renewing sense of magic and hope in the world, the perfect antidote to all the chaos of the present. In the end it's an unapologetically bona fide love affair with love and dreams.",
      "author": "Michael Lee"
    },
    {
      "text": "A film that works like a fine string watch, like a soft and elegant mechanism that breathes the rhythm of jazz melancholy and classic dreams of Hollywood. [Full review in Spanish]",
      "author": "Ira Franco"
    },
    {
      "text": "Chazelle's vision of LA is unnervingly whitewashed, and the film could do with another original song, but his inventive cinematography and joyous spirit will leave you inspired -- and dying to see what he does next.",
      "author": "Roe McDermott"
    },
    {
      "text": "A beautiful film that evades corniness and low punches with spontaneous moments of realism and otherwise, is extremely effective as a comedy, romance and musical. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "\"La La Land\" deserves all the awards and praises it has received so far, and more. It's an ode to jazz, cinema, theater, classical musicals and love. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A film that has a very good choreography and production design but its director/writer spoils much of the democratic and popular pleasure that the great classic musicals of Hollywood used to had. [Full review in Spanish]",
      "author": "Diego Lerer"
    },
    {
      "text": "A bittersweet musical with scenarios that suppurate a vintage aura inspired by classic Hollywood and with the brilliant performances of Gosling and Stone. [Full review in Spanish]",
      "author": "Carlota Mosegui"
    },
    {
      "text": "A film with a perfect acting combination and explosive musical numbers that would restore faith in the magic of Hollywood and Broadway. [Full review in Spanish]",
      "author": "Manu Yáñez"
    },
    {
      "text": "Although it seems a little overrated to me, it's an enjoyable and well made film and entertains.If you like musicals, I recommend it. [Full review in Spanish]",
      "author": "Lucero Solórzano"
    },
    {
      "text": "A film that achieves a classic style, evoking musicals from the 30's, 50's and the new French wave, but at the same time it has a contemporary touch. [Full review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "A film that goes from a romantic comedy to drama to the rhythm of pop and jazz, while criticizing the frivolity of Los Angeles. [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "A film that causes fascination because is capable of providing a different reading and ending for each individual in spite of the naive ambiguity of its lyricism. [Full review in Spanish]",
      "author": "Alberto Sáez Villarino"
    },
    {
      "text": "A beautiful film that touches the soul through its colors, performances, soundtrack, photography, light, and above all, for its story. [Full review in Spanish]",
      "author": "Daniel Bernal"
    },
    {
      "text": "Alas, the stylized, wall-to-wall inauthenticity pries out the emotional heart of this modern-day musical fantasy, leaving it needless and empty.",
      "author": "David N. Butterworth"
    },
    {
      "text": "La La Land is cinematic magic in its purest form.",
      "author": "Ben Sin"
    },
    {
      "text": "A rare example of a musical with dramatic integrity; a beautiful dream.",
      "author": "Ed Whitfield"
    },
    {
      "text": "A toasty splash of sound and color .",
      "author": "Tom Shone"
    },
    {
      "text": "Somehow manages to be a feel-good triumph as well as a darkly honest exploration of the quest for fame and romance in Los Angeles.",
      "author": "Rich Cline"
    },
    {
      "text": "Chazelle makes retro chic feel richly contemporary.",
      "author": "Matt Wolf"
    },
    {
      "text": "Joyous, romantic and achingly stylish.",
      "author": "Andy Lea"
    },
    {
      "text": "La La Land remembers when movies were magical and fun, blending nostalgia and contemporaneity in a candy-sweet love letter to cinema.",
      "author": "Erika Balsom"
    },
    {
      "text": "Chazelle's movie is a must-see experience and an instant classic, entirely worthy of the adulation and awards that have come its way.",
      "author": "Rob Carnevale"
    },
    {
      "text": "It's preposterous, ludicrous - and it's exactly the film we need right now.",
      "author": "Stuart McGurk"
    },
    {
      "text": "Chazelle pulls it off magnificently, helped by the fearless commitment of his two leads.",
      "author": "Paul Whitington"
    },
    {
      "text": "It can be exhilarating, thanks to Chazelle's marvelous use of space and color, and thanks to Justin Hurwitz's lovely score.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A good movie with amazing musical sequences and charismatic protagonists. [Full review in Spanish]",
      "author": "Alonso Díaz de la Vega"
    },
    {
      "text": "An old fashioned movie that at the same time is tremendously modern and also nostalgic, romantic, magical and unique. [Full review in Spanish]",
      "author": "Lucía Ros Serra"
    },
    {
      "text": "A fizzy surprise.",
      "author": "Camilla Long"
    },
    {
      "text": "A film that starts as an explosion of therapeutic vitality with contagious dance and music admirably filmed while telling a playful and warm love story. [Full review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "Chazelle has taken a big gamble with this homage. It could have turned out horribly twee and sentimental. Instead the picture celebrates a movie-making form from yesteryear with dazzling visual technique and a huge dollop of charm.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "It is simply a splendid continuation of cinema's ever-evolving love affair with song and dance.",
      "author": "Mark Kermode"
    },
    {
      "text": "A marvel. Funny and exuberant and bittersweet and cliché-busting and unexpected as hell. We are going to need more movies like this one.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Be prepared to go Ga Ga over La La.",
      "author": "Jamie East"
    },
    {
      "text": "Sweet-natured in a time of often bitter cynicism, this buoyantly uplifting fable sets the soul soaring and the heart beating.",
      "author": "Tim Evans"
    },
    {
      "text": "It's not hard to see the appeal - or indeed admire the ambition of Chazelle, who's still in his early 30s (La La Land is only his third movie).",
      "author": "Alistair Harkness"
    },
    {
      "text": "Chazelle takes his cue from past masters of the musicals from Fred Astaire to Jacques Demy. He brings an infectious energy to a film that fizzes like vintage Champagne and has all the colour and sparkle of exploding fireworks.",
      "author": "Allan Hunter"
    },
    {
      "text": "It's as gorgeous in its gloom as in its wonderfully shameless whimsy. It's a dizzying whirlwind of romance and sorrow, cinema to make you swoon.",
      "author": "Emma Simmonds"
    },
    {
      "text": "A film that will possibly become the last hero of a dying genre that everybody will be talking about, at least for a few years. [Full review in Spanish]",
      "author": "Quim Casas"
    },
    {
      "text": "An absolute delight, a great musical and an exquisite chant dedicated to love. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "La La Land ravishes from densely populated beginning to eye-moistening denouement.",
      "author": "Donald Clarke"
    },
    {
      "text": "It's too long, the music isn't great, and I can't stand all the brightly colored twirling skirts.",
      "author": "Molly Laich"
    },
    {
      "text": "The film is at its most convincing in those intimate exchanges between Gosling, with his melted eyes, and Stone, with her anime face.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "La La Land with caveats is still more wonderful than almost anything else.",
      "author": "Deborah Ross"
    },
    {
      "text": "If it were any more enchanting, the musical romantic comedy La La Land ... would break your heart.",
      "author": "Nigel Andrews"
    },
    {
      "text": "The rare kind of spellbinding, wonderful film that has reviewers like me tripping over themselves to find new superlatives for describing it.",
      "author": "Matt Looker"
    },
    {
      "text": "Every moment of La La Land is worth living through because of Stone and Gosling, and Chazelle, whose direction is alive to the thrill of duets, first kisses and getting on with the show, even when you just want to cry backstage.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "An engaging yet far-from-flawless modern musical...",
      "author": "David Nusair"
    },
    {
      "text": "A formidable film where Stone and Gosling will make you leave the cinema singing and dancing your frustrations away. [Full review in Spanish]",
      "author": "Carlos Marañón"
    },
    {
      "text": "La La Land is an ode to those who are brave enough to dream big and for that reason alone it deserves a standing ovation.",
      "author": "Laura Delaney"
    },
    {
      "text": "It's almost impossible not to fall in love with Damien Chazelle's musical masterpiece La La Land.",
      "author": "Marija Djurovic"
    },
    {
      "text": "As a romance it's perfect -- mostly because the two leads have such incredible chemistry -- and as a musical it works even for those who don't love musicals.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Chazelle's depiction of career conflict and erotic attraction in Mia and Sebastian's romance ... prevents La La Land from being a satisfying movie musical. He imitates the generic form but never imbues it with feeling.",
      "author": "Armond White"
    },
    {
      "text": "Open-hearted gushy romanticism in CinemaScope. What's not to love?",
      "author": "Christina Newland"
    },
    {
      "text": "Audacious, retro, funny and heartfelt, La La Land is the latest great musical for people who don't like musicals - and will slap a mile-wide smile across the most miserable of faces.",
      "author": "Ian Freer"
    },
    {
      "text": "Could have been a grand folly but instead it's just grand. Will make audiences break into grins like its characters break into song.",
      "author": "Jamie Graham"
    },
    {
      "text": "Not just a bona fide masterpiece, but also the best film of the year bar none, capturing the true nature of Hollywood and Los Angeles in a way that's both unconventional and surprising.",
      "author": "Ryan Pollard"
    },
    {
      "text": "La La Land is itself a hugely successful and joyous hybrid of the arts, or to quote the film's rousing opening song Another Day of Sun: \"a Technicolor world made out of music and machine\".",
      "author": "Damien Straker"
    },
    {
      "text": "For a film that easily could have just been ripe with clichés, La La Land is instead refreshingly different, and is sure to be a hit with audiences as a result.",
      "author": "David Fontana"
    },
    {
      "text": "La La Land's song-and-dance never feels routine, knowing when to soar and when to come, tapping, down to earth.",
      "author": "Brian Gibson"
    },
    {
      "text": "This is a colorful, energetic, vibrant, heartfelt throwback to this once wildly popular film genre, but the singing and dancing isn't really up to the level of the rest of the film.",
      "author": "Robert Roten"
    },
    {
      "text": "\"La La Land\" is a mirage, a self-satisfied illusion that tries and fails to sanctify a heap of classics that don't require its sanctification.",
      "author": "J. Olson"
    },
    {
      "text": "La La Land is more a companion piece to Whiplash, expressing similarly ambivalent and conflicted attitudes to the creative process.",
      "author": "Ian Barr"
    },
    {
      "text": "La La Land is finely cut, A-grade nostalgia that proves nigh-on-impossible to resist.",
      "author": "Ben Nicholson"
    },
    {
      "text": "Here's to the fools who dream.",
      "author": "Jay Stone"
    },
    {
      "text": "An impeccably accomplished film that is also passionate and vital, and takes formal risks in its unstoppable first forty minutes. [Full review in Spanish]",
      "author": "Gonzalo Hernández Espinosa"
    },
    {
      "text": "Surreal, romantic and a strong contender for Best Picture at the Academy Awards.",
      "author": "Linda Cook"
    },
    {
      "text": "This delightful extravaganza revives the big-screen musical -- and how.",
      "author": "Rashid Irani"
    },
    {
      "text": "La La Land is a worthy showcase for the magnificent Stone's talents, and she is heartbreaking throughout.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "Trying to court Mia, Sebastian sings \"What a waste of lovely light.\" Unfortunately, that's about the size of it.",
      "author": "Richard von Busack"
    },
    {
      "text": "A modern lover story with a healthy dose of homage.",
      "author": "Wesley Lovell"
    },
    {
      "text": "It's a slight, often affecting story that mixes the confusion of contemporary life with nostalgic yearning for a time when the whole boy-meets-girl thing was less complicated.",
      "author": "Alison Gillmor"
    },
    {
      "text": "It's an easy film to enjoy, even love. But it's unwise to carry that love to any irrational extremes. Me? I'd be very careful tossing gold statues in its direction.",
      "author": "Jeff Simon"
    },
    {
      "text": "Despite its failings, there's a lot of magic in this movie.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "La La Land shows that you can make a highly personal, intimate movie and still use the style of an old-fashioned, cast-of-hundreds musical.",
      "author": "Mal Vincent"
    },
    {
      "text": "If you haven't already fallen for this gauzy romp through the city of Angels at this point, you surely will during the last scene, with its bittersweet homage to the way times goes by.",
      "author": "Karen D'Souza"
    },
    {
      "text": "Anchored by the two great performances from its leads, terrific musical numbers and stylish direction, La La Land is a proper crowd-pleaser and a heartfelt salute to old Hollywood that harkens back to the past in order to create something fresh.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Of course movie critics love this film; shamelessly referential, it clearly loves movies as much as we do. But don't let that scare you. Chazelle's filmmaking is at once virtuosic and instinctive.",
      "author": "John Serba"
    },
    {
      "text": "[Chazelle's] filmmaking exuberance and the energy and sweetness of his two stars give this thin soup considerable tang.",
      "author": "Michael Sragow"
    },
    {
      "text": "No, you don't need to have seen any of [La La Land's] reference points to find it pleasurable and often exquisite entertainment.",
      "author": "Amy Taubin"
    },
    {
      "text": "This is why we go to movies.",
      "author": "Brad Keefe"
    },
    {
      "text": "Ryan Gosling and Emma Stone are shaping up to be today's equivalent of Garland and Rooney, this third outing (after Crazy, Stupid, Love and Gangster Squad) demonstrating yet again their chemistry and endearing camaraderie.",
      "author": "Sarah Watt"
    },
    {
      "text": "Chazelle's graceful camera work is thrilling, his timing impeccably tied to sumptuous images that are as delightful as the leads on screen.",
      "author": "Jason Gorber"
    },
    {
      "text": "Longing for an old Hollywood musical?... Look no further, movie fan.",
      "author": "Marie Asner"
    },
    {
      "text": "It asks what the characters of a Cinemascope musical would have to dream about, and answers with a finale that lifts the film to a higher plane of wish fulfillment and melancholy.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "...fans of 2011's big award winner 'The Artist' are in for a treat... greater than the sum of its parts. PG-13 for language and criminal use of the a-ha song \"Take On Me.\"",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The cinematography and special effects are fantastic, but don't actually compensate for a weak storyline, and forgettable musical numbers.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "La La Land is a Christmas miracle for these coldhearted times: a vibrant and emotive present that warms the soul with good cheer as a celebration of a film genre and the indefatigable human spirit.",
      "author": "Kirk Baird"
    },
    {
      "text": "With the first musical number in La La Land, I thought that I was in love. Unfortunately, as is the case with romance in the movie, holding onto that love was more difficult than I at first thought.",
      "author": "Rich Heldenfels"
    },
    {
      "text": "Chazelle combines familiarity with wildly creative execution, proving that style is substance.",
      "author": "Alex Doenau"
    },
    {
      "text": "One from the heart ... Chazelle doesn't for a moment wink at the viewer. He's guileless; he really believes in this trompe l'oeil world of violet sunsets, movie star murals, twinkly planetarium stars.",
      "author": "Glenn Lovell"
    },
    {
      "text": "I don't know if the music will still be sung in 20 or 30 years. I do know that dance schools all around the world are going to see a rush of enrolments.",
      "author": "Paul Byrnes"
    },
    {
      "text": "For those who know The Umbrellas of Cherbourg, it's a harmless curiosity, a workable but rather heavily implied time-travel voyage to 50 years ago; for those who don't, it will probably be incomprehensible.",
      "author": "Kelly Vance"
    },
    {
      "text": "A renovated version of the old-fashioned movie musical about making it big in the City of Stars.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "La Land Land gives us the beauty of the world and its harder realities and intertwines them, leaving us with notes of grace and hope and love that transcend cynicism-bulldozes it, really. And that is lovely.",
      "author": "James Kendrick"
    },
    {
      "text": "As loving a valentine as the film is to old-school Hollywood, the rapturous reception it has received might be a collective reaction against Hollywood's current trends, as enjoyable, breezy and ceaselessly entertaining as it is.",
      "author": "Jim Schembri"
    },
    {
      "text": "Easy on the eyes and tough on the heart, La La Land is a film I could watch again and again.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Any concerns about the experimental nature of this film fantasy are blown away by the sheer talent and attractiveness of the stars.",
      "author": "Jules Brenner"
    },
    {
      "text": "The ideal Christmas Day release gives the gift of its ever-engaging lead couple, music and director Damien Chazelle's surefire Oscar-bound craftsmanship for all to behold.",
      "author": "John Urbancich"
    },
    {
      "text": "...a film that tries too hard and is always showing how much it's straining.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "The mind-blowing opening scene is masterfully shot on the LA freeway.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "While there is much to recommend Damien Chazelle's ode to Hollywood musicals of the 40s and 50s, there were times when I found myself curiously out of step with the rambling, retro production and the self-involved nature of the world in which it is set.",
      "author": "Vicky Roach"
    },
    {
      "text": "The last quarter of La La Land is so beautifully shot and performed, it makes up for the flat opening. It becomes a film that embraces a world where dreamers may seem foolish but eventually are very interesting.",
      "author": "Rick Bentley"
    },
    {
      "text": "La La Land has the best opening scene of the year. It has the best closing scene of the year. What's in between those scenes is merely incredible entertainment and expert filmmaking.",
      "author": "Michael Smith"
    },
    {
      "text": "Chazelle's film, with its unfettered embrace of the imperfect, creates nothing less than a vital symphony of the human condition.",
      "author": "Piers Marchant"
    },
    {
      "text": "The film is full of color, brightness, rhythm and emotion. Although there's a narrative bump in the middle of it, the show gets back on track in a bittersweet, melancholic and radiant final. [Full review in Spanish]",
      "author": "Pilar Ayuso"
    },
    {
      "text": "Sometimes a movie comes along that is so different, so refreshingly light, so right for the moment that people can happily forgive it for not being very good.",
      "author": "Ken Eisner"
    },
    {
      "text": "I have yet to meet someone who's watched it and come out in a bad mood.",
      "author": "Jim Slotek"
    },
    {
      "text": "The perfect movie for anyone who needs a bit of cheering up after a bruising year, La La Land is the cinematic equivalent of a really fun morphine trip.",
      "author": "Wenlei Ma"
    },
    {
      "text": "A clever, perfect film.",
      "author": "Russell Baillie"
    },
    {
      "text": "La La Land is not just a musical, but a musical that loves musicals.",
      "author": "Meg Watson"
    },
    {
      "text": "To make an earnest, gleeful song-and-dance musical in 2016 with no political subtext or social commentary, not as a parody or deconstruction but simply as an old-fashioned ode to dreaming, is revolutionary.",
      "author": "Eric D. Snider"
    },
    {
      "text": "People say the movie musical is dead. Tell that that to your tapping toes while watching the enchantment of La La Land, one of the year's best films.",
      "author": "Peter Howell"
    },
    {
      "text": "The beauty of La La Land is that is uses an escapist format to tell a story about professional disappointment and the limitations of love. It's a romance for cynics.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Almost anyone who happens to see it will be converted by minute three. Guaranteed.",
      "author": "Barry Hertz"
    },
    {
      "text": "My heart goes out to Chazelle because of his desires; it sinks at how he's compromised them.",
      "author": "Stuart Klawans"
    },
    {
      "text": "A one-note bore.",
      "author": "Phil Hall"
    },
    {
      "text": "It's deeply derivative yet wholly original, an odd mix that will keep audiences on their toes.",
      "author": "Tom Meek"
    },
    {
      "text": "Audiences find themselves carried away. That may be sensible enough. What's odd is that La La Land is not the merry entertainment it sometimes seems to be.",
      "author": "Calum Marsh"
    },
    {
      "text": "Simultaneously escaping into fantasy and reflecting reality, La La Land proves a big-hearted delight... dream-like in style but ultimately melancholy in sentiment.",
      "author": "Sarah Ward"
    },
    {
      "text": "Stone and Gosling are the perfect pair to sing, soar and charm in La La Land. Now that your chance to see this standout film is finally here, don't miss out.",
      "author": "Julie Washington"
    },
    {
      "text": "La La Land's transportive reverie is its strength.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "Chazelle revitalizes not only a genre but an optimism coming in handy now. La La Land is the movie we didn't know we needed until it's here.",
      "author": "Steve Persall"
    },
    {
      "text": "Envisioning the best versions of ourselves in snappy musical numbers before reality crashes the party.",
      "author": "Cameron Williams"
    },
    {
      "text": "It's simply impossible not to completely fall in love with.",
      "author": "Sophia Watson"
    },
    {
      "text": "Chazelle has reinvigorated the big-screen musical by embracing the present while paying tribute to the past, by balancing irony and innocence, novelty and nostalgia.",
      "author": "Christopher Orr"
    },
    {
      "text": "La La Land is a moving, melancholy musical that's very pleasant, if a bit thin; not unlike its appealing leads' voices.",
      "author": "Simon Miraudo"
    },
    {
      "text": "This year's The Artist. So basically it's a superhero movie for middlebrows.",
      "author": "Sean Burns"
    },
    {
      "text": "Damien Chazelle heard the call: \"Make musicals great again.\" And he's responded bigly with \"La La Land,\" his dazzling display of spectacle and heart that will lock him up -- a front-row seat at the Oscars.",
      "author": "Al Alexander"
    },
    {
      "text": "Can one movie revive Hollywood's musical era AND bring old-fashioned courtship back to theaters? La La Land just might.",
      "author": "Christian Toto"
    },
    {
      "text": "La La Land is a beautiful, inspired film. Ryan Gosling and Emma Stone will leave you with a bounce in your step and love in your hearts.",
      "author": "Julian Roman"
    },
    {
      "text": "Director/writer Damien Chazelle reinvents the Hollywood musical with style and class.",
      "author": "Roger Tennis"
    },
    {
      "text": "La La Land's exhilarating and nearly unflagging energy strives to inspire in viewers an equally bold appreciation for all the things it celebrates.",
      "author": "Anthony Salveggi"
    },
    {
      "text": "When the film ended, I floated out of the theater misty-eyed, cockeyed and starry-eyed. My feet haven't touched the ground since.",
      "author": "Carrie Rickey"
    },
    {
      "text": "As fun as that opening scene may be, the story that follows is what makes \"La La Land\" a great movie.",
      "author": "Josh Terry"
    },
    {
      "text": "The result is enough to make you leap out of your seat and punch the air in triumph.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "La La Land is magnificent, Chazelle delivering a musical that instantly ranks alongside my favorites of the genre.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Damien Chazelle, the writer/director behind the Oscar-nominated Whiplash, set out to make a musical romance, but his new film La La Land transcends both genres.",
      "author": "Alicia Cohn"
    },
    {
      "text": "The film's opening sequence is jaw-droppingly wonderful.",
      "author": "David Stratton"
    },
    {
      "text": "A terrific modern day musical that often feels like and certainly harkens back to such genre pics of old. (Full Content Review for Parents - Profanity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Utterly captivating. A seismic event in contemporary American cinema.",
      "author": "James Verniere"
    },
    {
      "text": "The musical romance from writer-director Damien Chazelle is packed with \"movie magic,\" big, un-self-conscious moments where the characters burst off the screen in song and dance. This is a movie in love with movies.",
      "author": "Rob Thomas"
    },
    {
      "text": "[Emma Stone] is so captivating as an actor that we are somehow attentive and interested through lousy songwriting and cliches.",
      "author": "Shawn Hazelett"
    },
    {
      "text": "The film's highs are its light special effects and whimsical choreography. The ensemble cast is phenomenal, but Emma Stone and Ryan Gosling? Not so much.",
      "author": "Valerie Complex"
    },
    {
      "text": "\"La La Land\" is a special, special experience, and movies like this don't come around too often.",
      "author": "Adam Graham"
    },
    {
      "text": "Much to my surprise, I quite enjoyed La La Land. And I imagine most moviegoers will too.",
      "author": "Sonny Bunch"
    },
    {
      "text": "You have been wronged far too often, I know; the movies have wronged us all. They have stood us up, left us alone on rainy curbs, but you must put your faith in them, one last time. You must run to La La Land.",
      "author": "Rohan Naahar"
    },
    {
      "text": "I could feel the large group of critics at the screening I attended sitting on their hands, resisting the uncouth impulse to applaud.",
      "author": "CJ Johnson"
    },
    {
      "text": "Even with all the awards and Oscars hype, it still won't do enough justice to one of the decade's most magical masterpieces.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Chazelle's deep and spacious romanticism includes the city and its dreamers and music and movies and love itself.",
      "author": "Nell Minow"
    },
    {
      "text": "The movie comes off as a well-intended tribute to the fabulous MGM musicals of the great Vincente Minnelli, made by people who have never seen one.",
      "author": "Rex Reed"
    },
    {
      "text": "The swooning, cotton-candy, luxuriantly pastel vibe...has a rather effortful feel, but for those old enough to remember the halcyon days of film musicals, it will be a treat.",
      "author": "Frank Swietek"
    },
    {
      "text": "LA LA Land joins the ranks of other great, hard-working musicals that sit on the periphery of the cinema landscape ... a refreshing reminder that superheroes aren't the only people jumping around in spandex on screens these days.",
      "author": "Patrick Kolan"
    },
    {
      "text": "This is one crowd-pleaser worth getting behind.",
      "author": "Scott Marks"
    },
    {
      "text": "It's simply wonderful.",
      "author": "Richard Roeper"
    },
    {
      "text": "La La Land is more than just a chance to bask in the warm nostalgia of Hollywood musicals. Chazelle captures a feeling reminiscent of the jazz Sebastian so admires: He takes what's familiar, tinkers with it, and creates something new and alive.",
      "author": "Sean P. Means"
    },
    {
      "text": "The transition isn't always smooth; the movie sags in the center as the songs grow sparse. But there are virtues, too -- chiefly the proven screen chemistry between Stone and Gosling. (Their song-and-dance chops aren't half-bad, either.)",
      "author": "Jim Lane"
    },
    {
      "text": "Chazelle's vision to too candied to dismiss, but this extravagance demands more judicious editing, keeping the picture tight and tender. Its current slackness only emphasizes troubling casting faults and dramatic limitations.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Techs are first rate from choreography to production design that creates the perceived fantasy of what LA represents to the young and eager.",
      "author": "Robin Clifford"
    },
    {
      "text": "It's a shame about the rough start to La La Land, but does it really matter when the rest of the film is as assured and, at times, exhilarating as it is?",
      "author": "Mark Dujsik"
    },
    {
      "text": "I believe people when they say they are moved or enchanted by the film; it just didn't move or enchant me.",
      "author": "Robert Horton"
    },
    {
      "text": "La La Land suffers from what it endeavors to celebrate: Hollywood's flair for artifice and self-congratulation.",
      "author": "Jeffrey Edalatpour"
    },
    {
      "text": "Despite his tender years, Chazelle is a master of composition, color and camera movement, and there are shots here so drop-dead gorgeous you wonder how he and cinematographer Linus Sandgren pulled them off.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Working together for the third time, Stone and Gosling quickly establish an easy rapport with one another, their surpassingly attractive physical features the perfect foils for Chazelle's aesthetic approach of naturalism and extreme stylization.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Chazelle is a born filmmaker, and he doesn't settle for rehashing familiar bits from musicals we already love. He's too busy giving us reasons to fall for this one.",
      "author": "Michael Phillips"
    },
    {
      "text": "At a time when musicals seldom grace the big screen, \"La La Land\" is practically a miracle.",
      "author": "Calvin Wilson"
    },
    {
      "text": "Throughout the entirety of its running time, the film is alive like no other I have seen this year, reveling in its heightened reality and a pure love of cinema.",
      "author": "Greg Maki"
    },
    {
      "text": "(Director Damien) Chazelle has interwoven the innocence and idealism that permeated films in the genre with a contemporary, albeit, realistic vibe that skirts cynicism without passing over the line.",
      "author": "Bob Bloom"
    },
    {
      "text": "The breathless 5 1/2-minute opening musical number in Damien Chazelle's La La Land is worth the price of admission all by itself.",
      "author": "Dann Gire"
    },
    {
      "text": "The musical numbers are distinctly Minnellian in their sense of lovers being swept away by the whirlwind of their mutual regard.",
      "author": "J. R. Jones"
    },
    {
      "text": "It's almost criminal to have to stay in your seat when the contact high of La La Land is goosing you to grand jeté in the aisle. The heart, at least, is at liberty to swell to bursting.",
      "author": "Kimberley Jones"
    },
    {
      "text": "During one musical number, when fireworks start going off in the sky, you can feel them going off in your head too.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "The (Hollywood) Hills are alive again with the sound of (new) music, and it's impossible to not be swept up and away in the sweet sunshine of its movie magic.",
      "author": "Neil Pond"
    },
    {
      "text": "Chazelle creates a realm that suspends disbelief, forestalls cynicism and lets us open our hearts to emotion that's as real in this setting as in any naturalistic drama.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "It's a film for those who feel a little out of step with the 21st century, as Mia does with her love of classic cinema and Sebastian does with his angry jazz certainty. A lot of us can relate. If you can't, we don't really want to hear about it.",
      "author": "Ty Burr"
    },
    {
      "text": "It may not be a masterpiece, but it's a refreshing and unabashed joy-filled escape, and after such a woeful year, there is nothing wrong with that.",
      "author": "Tara Watson"
    },
    {
      "text": "If you have friends who say they don't make good movies anymore, drag them to this.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "A deft blend of long-gone filmmaking style with decidedly modern sensibilities, it's the kind of film you'll watch with a permanent smile plastered to your face.",
      "author": "Mike Scott"
    },
    {
      "text": "As genres go in and out of style, the movies occasionally forget some of the wonderful things they can do. Luckily, \"La La Land\" remembers.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Never have the glory days of Hollywood been reimagined quite like they are in the new film by writer-director Damien Chazelle.",
      "author": "Cameron Meier"
    },
    {
      "text": "That not every note or dance step is perfect isn't the point; it's that the actors find perfection - and magic - in the moment, in that flight.",
      "author": "Moira MacDonald"
    },
    {
      "text": "La La Land is hopeful, even giddy. And Chazelle directs with heaps of style and charm.",
      "author": "Max Weiss"
    },
    {
      "text": "Relentlessly stunning and possibly life-altering.",
      "author": "Phil Villarreal"
    },
    {
      "text": "We don't generally think of musicals in these terms, but, following the impersonal splashiness of the opening number, \"La La Land\" slowly dawns as a film of great intimacy. It's as if it were whispering to us.",
      "author": "Mick LaSalle"
    },
    {
      "text": "It's nostalgic in the same way a hipster combing through vinyl records in a record shop coffee house is nostalgic. It picks and chooses what it wants to remember about the past and puts a decidedly modern spin on the treasures it decides to keep.",
      "author": "Rebecca Cusey"
    },
    {
      "text": "The one thing that Chazelle seems to have little interest in is life. He turns Mia into an absolute cipher, giving her nothing whatsoever to talk about.",
      "author": "Richard Brody"
    },
    {
      "text": "An absolutely top-tier musical and glossy valentine to the simple, blunt-force emotions of classical Hollywood cinema.",
      "author": "Tim Brayton"
    },
    {
      "text": "A spectacular, breathtaking, pulse-racing work of pop art.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Buoyed by the charm and charisma of its talented stars Ryan Gosling and Emma Stone, the film is a whirlwind of unbridled happiness that sweeps us away with music and colour.",
      "author": "Louise Keller"
    },
    {
      "text": "I am a product of the big musicals of the '50's and '60's like \"Carousel\", \"Singin' in the Rain\", \"South Pacific\", \"West Side Story\", etc. and for me, \"La La Land\" doesn't come close.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "The two A-Listers have so much on-screen magnetism --- and they make a nice couple --- I'm willing to overlook their singing shortcomings.",
      "author": "David Kaplan"
    },
    {
      "text": "It's a picture filmmakers have propagated since time immemorial, a valentine to show business itself, and yet filmmaker Damien Chazelle renders it anew in La La Land, an original musical that pays tribute to the city and all it represents.",
      "author": "Robert Levin"
    },
    {
      "text": "A lovely, old-fashioned ode to dreamers and their dreams, the sacrifices they make to go after them, and the poignant regret of what could have been.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "La La Land always feel emotionally direct and natural, rather than cloying, playful or cute. If it's meta, it's also millennial.",
      "author": "Tom Gliatto"
    },
    {
      "text": "A modern love story filmed in a style reminiscent of glorious classic musicals, 'La La Land' emerges as a bittersweet treat for the eyes, the ears and the heart.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Heartfelt and ambitious, it won't make you think, but it will put a smile on your face.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "I loved this movie, a sparkling homage to vintage Hollywood musicals, particularly An American in Paris, '50s Hollywood films, like Rebel Without a Cause, Astaire & Rogers dance movies of the '30s, and the City of Los Angeles, just to name a few.",
      "author": "Tony Medley"
    },
    {
      "text": "[Chazelle] is able to maintain enough distance from his influences to infuse the story with touches of realism that ground it while at the same time maintaining a sense of playful whimsy that made its forebears so successful.",
      "author": "Aakash Karkare"
    },
    {
      "text": "La La Land extends a hand to anyone scarred by a barrage of two-steps, jazz hands, and glitter costumes -- and bets are, you'll grab hold.",
      "author": "Matt Patches"
    },
    {
      "text": "As good as La La Land is throughout, the last act elevates the movie considerably. And while everything here has roots elsewhere, the way Chazelle strings these notes together somehow looks and sounds fresh and new.",
      "author": "Brian Lowry"
    },
    {
      "text": "Writer/director Damien Chazelle, whose last film was Whiplash, has made a movie that's visually amazing, awash in vibrant colors, while the camera magnificently swirls around the stars as they sing and dance.",
      "author": "Neil Rosen"
    },
    {
      "text": "The movie ends with a what-might-have-been fantasia that is one of the most emotionally moving passages I've ever seen in a musical. It's like a bluesy jazz piano chord, full of hurt and healing, that slowly fades to silence.",
      "author": "Peter Rainer"
    },
    {
      "text": "Spectacular song-and-dance scenes rise up out of the story like exhalations of pure joy.",
      "author": "Kurt Loder"
    },
    {
      "text": "Profound, beautiful film about love and creativity.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "For all its borrowing and bricolage, La La Land never feels like a backward-looking or unoriginal work. Even when not every one of its risks pays off the way that first song does, this movie is bold, vital, funny, and alive.",
      "author": "Dana Stevens"
    },
    {
      "text": "Peppy, smart, and almost intolerably romantic, this is the finest movie musical since John Carney's 'Once.'",
      "author": "Chris Barsanti"
    },
    {
      "text": "... a musical so in love with love - and the movies - that only a stone cold heart will fail to get swept up in its glorious romance...The production is a marvel",
      "author": "Laura Clifford"
    },
    {
      "text": "Visually gorgeous and deliciously colorful, La La Land is a romantically fueled, comically fun, and symphonically sublime treasure. You are guaranteed to leave with a smile on your face.",
      "author": "Chris Sawin"
    },
    {
      "text": "It's more vibrant than Chicago, more heartfelt than Les Miserables, and more successfully staged than a chorus of other contenders.",
      "author": "James Berardinelli"
    },
    {
      "text": "\"La La Land\" is as delightful and magical as you've heard -- a big, joyful celebration of old-school Hollywood musicals -- but it's also smarter, tougher, and sadder than its moonstruck trailer might suggest.",
      "author": "Tim Grierson"
    },
    {
      "text": "La La Land fills your soul with joy and happiness. A dazzling work that you want to see again the very second its over.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Long live the musical. Bring enough Kleenex.",
      "author": "Jocelyn Noveck"
    },
    {
      "text": "La La Land is a full-service throwback to the Golden Age musical, transposed with lashings of romantic melancholy to a contemporary Los Angeles decked out in primary-colored plumage.",
      "author": "Ella Taylor"
    },
    {
      "text": "Chazelle has assembled a vibrant, infectiously hummable pastiche of musical and cinematic styles - an entrancing ode to the glories of cinema past as well as a heartfelt expression of faith in the medium's future.",
      "author": "Justin Chang"
    },
    {
      "text": "Rejuvenating two tired genres, the romcom and the musical, La La Land amounts to an extravagant and improbable act of resistance against Hollywood convention.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "I'm hoping that La La Land will be a hit for the ages, for all ages. It's a film that re-enacts, with rare originality, a classic role for the movie medium -- escapist entertainment in troubled times.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "As a candy-hued musical valentine to Los Angeles, \"La La Land\" is both a crowd-pleaser and a locals-only inside joke.",
      "author": "Katie Walsh"
    },
    {
      "text": "Romantic, inventive, visually dazzling - and yet, Damien Chazelle's ambitious movie promises slightly more than it delivers.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Song and dance in the key of life: That's the irresistible appeal of La La Land.",
      "author": "A.A. Dowd"
    },
    {
      "text": "It doesn't so much look back longingly at past masters like Vincente Minnelli, Nicholas Ray, Stanley Donen and Jacques Demy (to name a few) as tap into their mojo, insisting on their modernity and its own classicism in the same gesture.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's stunningly ambitious and thrillingly alive the way the best movies are.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "It isn't merely that Chazelle has made a film with eye-popping color and bold lighting, fantastical sets and characters showing their souls in movement and rhyme. He's made it feel revolutionary and brand new, even when it's as old as the hills.",
      "author": "Stephen Rebello"
    },
    {
      "text": "La La Land is a romance, and everyone is in love with everything -- most of all, old Hollywood dreams. It is, quite simply, magic.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "This unabashed mash note to the mind-melting majesty of the best movie musicals of yesteryear -- particular those from MGM's golden run in the 1950s -- is nothing less than the best movie of this year.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "I wish La La Land felt more like Chazelle's personal vision - that he tap-danced his own path - instead of this eager-to-please mash-up, the movie equivalent of samba tapas.",
      "author": "Amy Nicholson"
    },
    {
      "text": "One of the fizziest, dizziest, most delightful movie musicals to come around since Fred Astaire spun Ginger Rogers across soundstages.",
      "author": "Josh Larsen"
    },
    {
      "text": "La La Land is probably going to win Best Picture at next year's Oscars.",
      "author": "John Lui"
    },
    {
      "text": "\"La La Land\" deserves credit for high spirits even if it's essentially a collection of glamorous throwback music videos for so-so songs.",
      "author": "Kyle Smith"
    },
    {
      "text": "For a movie about chasing your dreams in a town known for crushing them, La La Land is surprisingly optimistic up until its bittersweet end.",
      "author": "Jason Zingale"
    },
    {
      "text": "Again and again La La Land cuts to some vibrant vision, and it's often funnier about its outsize old-school ambitions than any cutting critic could be.",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "If you only see one movie this year, you need to get out more. That being said, this endlessly enchanting, panoramic homage to the Hollywood musical is the picture to catch!",
      "author": "Kam Williams"
    },
    {
      "text": "La La does nothing less than jolt the movie musical to life for the 21st century. You leave exhilarated by Damien Chazelle's nonstop inventiveness, dazzled by Emma Stone and Ryan Gosling, and thrilled how they made movies magic again.",
      "author": "Peter Travers"
    },
    {
      "text": "Perfectly acceptable, sometimes overly strained, generally way too basic and, yes, periodically delightful, even at times devastating.",
      "author": "Matt Prigge"
    },
    {
      "text": "More than just a thoroughly modern musical, Damien Chazelle's love story leaves us walking, well, dancing on air.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Just when we were getting ready to write off Hollywood for solely producing noisy, cumbersome and soulless blockbusters, comes this aching, witty and unabashedly romantic musical.",
      "author": "Tomris Laffly"
    },
    {
      "text": "The closest thing since Cherbourg to a unified-field theory of music and film.",
      "author": "David Edelstein"
    },
    {
      "text": "Both old-fashioned and contemporary, the movie understands and celebrates what makes musicals tick. People sing because they feel so much. Emotions have to come out.",
      "author": "Joe Dziemianowicz"
    },
    {
      "text": "La La Land is cute, sometimes gorgeous, but not good.",
      "author": "Kristy Puchko"
    },
    {
      "text": "The film looks good, sounds good and, if you're not too fussy, it might make you feel good too.",
      "author": "Derek Malcolm"
    },
    {
      "text": "For viewers weaned on lifeless Broadway adaptations, there's a good chance La La Land will be unlike any movie they've ever seen.",
      "author": "Scott Tobias"
    },
    {
      "text": "A fabulous old-school Hollywood musical in modern-day Tinseltown with joyous tunes, exceptional choreography, a feel-good love story and a hint of bittersweetness to keep all that wonder grounded.",
      "author": "Brian Truitt"
    },
    {
      "text": "Of the many fantasy spectacles in theaters this December, none are as marvelous as Ryan Gosling and Emma Stone dancing cheek to cheek.",
      "author": "David Crow"
    },
    {
      "text": "Every element of La La Land is bound up in a referentiality that largely precludes the outpourings of emotion we come to musicals for.",
      "author": "Christopher Gray"
    },
    {
      "text": "Catch the film on the largest screen you can find, with a sound system to match, even if that means journeying all day.",
      "author": "Anthony Lane"
    },
    {
      "text": "La La Land is a joyous filmgoing experience, a musical brimming with optimism that never becomes treacly, ably directed by Whiplash's Damien Chazelle and featuring fantastic performances by leads Emma Stone and Ryan Gosling.",
      "author": "Terri Schwartz"
    },
    {
      "text": "Damien Chazelle's musical love letter to Los Angeles manages to be old-fashioned and newfangled at the same time, to thrilling effect.",
      "author": "Kevin Lally"
    },
    {
      "text": "A big, old-fashioned, toe-tapping, earworm-sowing extravaganza. If Gosling and Stone aren't Fred Astaire and Eleanor Powell, well, neither has anyone else been for 70 years.",
      "author": "Bill Newcott"
    },
    {
      "text": "A gorgeous homage to the golden age of Hollywood musicals in the 1950s, the film has the power to make audiences laugh, weep and feel as if they can float on air.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Damien Chazelle's La La Land is majestic, sweeping, and romantic. A beautiful movie musical about our dreams.",
      "author": "Alan Cerny"
    },
    {
      "text": "Unabashedly twinkly and entrancing, affectionately recalling the Golden Era of Hollywood musicals.",
      "author": "Susan Granger"
    },
    {
      "text": "LA LA LAND La La Lavishes with joy and warmth. This is a movie I want to live in.",
      "author": "Chase Whale"
    },
    {
      "text": "We've seen much dumber takes on that stuff in a million showbiz movies, but you'd have to go back to \"Singin' in the Rain\" to find one that dances around it with the poise that \"La La Land\" does.",
      "author": "Bob Strauss"
    },
    {
      "text": "The opening and closing dance numbers are so brilliant and uplifting that they are probably the best sequences in cinema all year.",
      "author": "Fred Topel"
    },
    {
      "text": "Giddily ambitious but perhaps more bittersweet than some will be expecting, this melodic love story proves fanciful but rooted, emotionally, in a reality where happily ever afters are not certainties.",
      "author": "Dustin Putman"
    },
    {
      "text": "Stylishly directed and beautifully acted ... this is a gorgeously romantic modern-day musical that will have you grinning from ear to ear.",
      "author": "Matthew Turner"
    },
    {
      "text": "If you haven't succumbed to the joyous magic of La La Land by the end of the Fred-and-Ginger-flavored \"A Lovely Night,\" well, then, pick up your Official Curmudgeon badge and head for the exit.",
      "author": "Steven Rea"
    },
    {
      "text": "A wondrous, magical film that pays constant tribute to a century of musicals and Hollywood films about Hollywood, without ever succumbing to cliché. (Broad Street Review)",
      "author": "Stephen Silver"
    },
    {
      "text": "With a risky method of storytelling, this film fully envelops the viewer in an audiovisual experience that demands an emotional response. [Full review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "La La Land works as a musical, as a romance, as a love letter to old-school Hollywood, and as a thoughtful meditation on the sacrifices that creative people must make in order to share that creativity with us.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Your heart gets tightened, the frog enters your throat, and as soon as you know it, the single tear streams down your face. Stone sums up not just the film's underlying message, but the hopes and dreams of ourselves.",
      "author": "Clayton Davis"
    },
    {
      "text": "Go ahead, try not to fall in love with La La Land. I dare you.",
      "author": "Travis Hopson"
    },
    {
      "text": "La La Land is ultimately a sunshine-filled breath of fresh air which will leave you giddy with nostalgia and happiness.",
      "author": "Amy West"
    },
    {
      "text": "From the set design to direction, the film has a big heart on for golden-age Hollywood.",
      "author": "Kent Turner"
    },
    {
      "text": "La La Land has us with our eyes glued, feet tapping and hearts pounding with anticipation of just what wonder it's going to produce next.",
      "author": "Allyson Johnson"
    },
    {
      "text": "It navigates a delicate line between all of that stylized jazz and an honest-to-God relationship drama, with scenes of conflict and disappointment that are utterly raw and exposed.",
      "author": "Jason Bailey"
    },
    {
      "text": "Chazelle has crafted that rare thing, a genuinely romantic comedy, and as well, a rhapsody in blue, red, yellow and green.",
      "author": "Tom Charity"
    },
    {
      "text": "You won't be able to stop yourself from falling helplessly in love with this over-the-top rom-com.",
      "author": "Tina Hassannia"
    },
    {
      "text": "People complain they don't make em like they used to. Well, they can't say that, anymore.",
      "author": "Stephen Mayne"
    },
    {
      "text": "A film with marvelous musical numbers and a bittersweet tone that sticks in the viewer's memory after leaving the movie theater. [Full review in Spanish]",
      "author": "Oscar Uriel"
    },
    {
      "text": "La La Land is gorgeous, often delightful, and quite satisfying. Its very existence is a triumph, given that an unabashed throwback A-list musical could not have been an easy sell, even for someone coming off of such significant hype.",
      "author": "Sarah Kurchak"
    },
    {
      "text": "The craft of La La Land is impeccable, from the energetically active camera to the staging and production design that re-creates the past without feeling dated. But there's a reckless cockiness to the production as well.",
      "author": "Tasha Robinson"
    },
    {
      "text": "Chazelle creates something absolutely unforgettable. Few people will be able to see this movie only once.",
      "author": "Edward Douglas"
    },
    {
      "text": "La La Land is a technicolor fantasy you have to see on a big screen. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "There is no way for me to explain this movie's pleasures in a way that makes sense.",
      "author": "Stephen Marche"
    },
    {
      "text": "La La Land serves to remind us that movies can still be magical, and they can still provide the channel for us to see magic in the world around us.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Restores the movie musical to its former glory.",
      "author": "Matt Singer"
    },
    {
      "text": "Working as something of a love letter to classic Hollywood, and celebration of cinema in its purest form - this feature somehow manages to avoid feeling imitative, nor like a mere pastiche - which is of huge commendation to the director.",
      "author": "Stefan Pape"
    },
    {
      "text": "La La Land isn't mere homage. It captures the soul of the genre, creating a bright, colorful portrait of love and art that miraculously retains its optimism in the face of reality.",
      "author": "Noah Gittell"
    },
    {
      "text": "My goodness is La La Land magical.",
      "author": "Emily St. James"
    },
    {
      "text": "La La Land is what they call a \"humdinger\" of a movie.",
      "author": "Mike Ryan"
    },
    {
      "text": "A dazzling, magical film.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Not once do you feel like you're watching red-blooded characters, so much as you are the good-natured, tirelessly committed actors playing them.",
      "author": "Keith Uhlich"
    },
    {
      "text": "An enchanting composition, a magical musical indeed.",
      "author": "William Bibbiani"
    },
    {
      "text": "A wooning, glorious tribute to the risky pursuits of fame, art and love, not necessarily in that order.",
      "author": "Norman Wilner"
    },
    {
      "text": "La La Land begins with such an ecstatic rush of joy -- and ends with such a gloriously bittersweet flourish -- that you kinda can't blame the film for sagging a bit in the middle.",
      "author": "Richard Lawson"
    },
    {
      "text": "Arguably one of the best romantic films made since cult favorite Amélie.",
      "author": "Kaleem Aftab"
    },
    {
      "text": "Step Up 6: Awards Season",
      "author": "Walter Chaw"
    },
    {
      "text": "The journey has some fits and starts, but the destination is pure movie magic.",
      "author": "Brian Formo"
    },
    {
      "text": "Most cinema-goers are already madly in love with at least one of them, and that love will hit stratospheric new heights when they see how skilfully Gosling and Stone balance their absurd attractiveness with goofy self-deprecation in La La Land.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Breaking into song and dance can be both deadly serious and a whole lot of fun.",
      "author": "Dave Calhoun"
    },
    {
      "text": "La La Land isn't perfect, but it's still a joy.",
      "author": "Brian Viner"
    },
    {
      "text": "The lion's share of the kudos must go to Chazelle, who's achieved something truly extraordinary here: an achingly romantic movie-musical that makes the old new again.",
      "author": "Marlow Stern"
    },
    {
      "text": "Damien Chazelle's La La Land is a wildly ambitious widescreen musical drama that, at its best, hits some very high notes indeed.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "A heavenly musical filled with down-to-earth humour.",
      "author": "Kate Muir"
    },
    {
      "text": "La La Land feels like a throwback and also like something we've never seen before, resulting in a dreamy musical that hits just about every note.",
      "author": "Darren Ruecker"
    },
    {
      "text": "La La Land is a monster musical, embracing every cliche about the hopes and frustrations of young talent in Hollywood as if they were all newly minted.",
      "author": "David Sexton"
    },
    {
      "text": "It has its head in the stars, and for a little over two wonderstruck hours, it lifts you up there too.",
      "author": "Robbie Collin"
    },
    {
      "text": "It's a movie with the potential to make lovers of us all. All we have to do is fall into its arms.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Technicolor escapism doesn't come much better than this.",
      "author": "John Bleasdale"
    },
    {
      "text": "A celebration of nostalgia and heartbreak. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A beautiful, audacious, aesthetically vibrant, and enchanting contemporary musical.",
      "author": "Rory O'Connor"
    },
    {
      "text": "A gorgeous romantic fever dream of a movie musical. La La Land is one for this age - and the ages. Stunning in every way.",
      "author": "Pete Hammond"
    },
    {
      "text": "\"La La Land\" is magically in tune with its reference points even as falls a few notes short of their greatness.",
      "author": "Eric Kohn"
    },
    {
      "text": "An absolute triumph. 'La La Land' is a film you simply never want to stop watching.",
      "author": "Jessica Kiang"
    },
    {
      "text": "For Chazelle to be able to pull this off the way he has is something close to remarkable.",
      "author": "Todd McCarthy"
    },
    {
      "text": "The most audacious big-screen musical in a long time, and - irony of ironies - that's because it's the most traditional.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Chazelle's dream-like follow-up to Whiplash is as la-la-light as its title, tap-dancing its way into the hearts of incurable romantics everywhere.",
      "author": "Fionnuala Halligan"
    },
    {
      "text": "La La Land is such a happy, sweet-natured movie - something to give you a Vitamin D boost of sunshine.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The musical is as malleable and eclectic a genre as any other, and Chazelle reminds us how effectively it can be applied to intimate moments as well as huge ones.",
      "author": "Alonso Duralde"
    }
  ],
  "release_year": 2016,
  "duration": 128,
  "genres": [
    "Musical",
    "Romance",
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Sebastian (Ryan Gosling) and Mia (Emma Stone) are drawn together by their common desire to do what they love. But as success mounts they are faced with decisions that begin to fray the fragile fabric of their love affair, and the dreams they worked so hard to maintain in each other threaten to rip them apart.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/uDO8zWDhfWwoFdKS4fzkUJt0Rf0.jpg"
}