{
  "movie_name": "Lawrence of Arabia",
  "movie_id": "lawrence_of_arabia",
  "total_reviews": 126,
  "reviews": [
    {
      "text": "As much larger-than-life character study as war drama, the film made a star of Peter O’Toole, whose intense performance brings T.E. Lawrence alive as the blue-eyed desert warrior and obsessive dreamer ...",
      "author": "Sean Axmaker"
    },
    {
      "text": "It may be said that the weary melancholy underlying Lawrence of Arabia stems from the stupefying apprehension that, whereas England may have been doomed to civilize the world, no power under heaven can civilize England.",
      "author": "James Baldwin"
    },
    {
      "text": "As the larger-than-life, controversial, and complicated titular T.E. Lawrence, Peter O’Toole gives one of the singular performances in the history of film. His immense onscreen presence is a worthy juxtaposition for the man he portrays.",
      "author": "Mark Johnson"
    },
    {
      "text": "The second half isn’t quite as compelling as the first, but to paraphrase a comment I once read regarding another film: The first half is pure perfection, and then it devolves into one of the best movies ever made.",
      "author": "Matt Brunson"
    },
    {
      "text": "I mean, c’mon, what do you want me to say? It’s a classic.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Lawrence of Arabia taken as a whole is a genuine, sometimes even a profound interpretation of character. And that alone, even without the great aesthetic beauties, would make the film unique in the cinema of historical reconstruction.",
      "author": "Dilys Powell"
    },
    {
      "text": "They don't make movies like this anymore.  [Full review in Spanish]",
      "author": "Rene Jordan"
    },
    {
      "text": "While not originally considered to play Lawrence, O’Toole was eventually offered the part which became his breakthrough role earning him the first of eight Academy Award Nominations",
      "author": "Allison Rose"
    },
    {
      "text": "Sixty years after its 1962 theatrical release, Lawrence of Arabia remains one of the greatest films ever made from an epic standpoint but it isn't without flaws.",
      "author": "Danielle Solzman"
    },
    {
      "text": "This is an epic, not just because it runs nearly four hours, but because of the measured and deliberate pacing, tangible sets and action sequences, and the willingness to explore humankind’s folly due to pride and greed.",
      "author": "Douglas Davidson"
    },
    {
      "text": "The film is impeccably designed from every element on the screen, and words can often fail to accurately describe the elegance that is crafted.",
      "author": "Josh Parham"
    },
    {
      "text": "This motion picture is unlike any epic because after enduring so many perils in an enormous journey, the size of which had never been seen in a Hollywood production, the questions about T.E. Lawrence remain.",
      "author": "Brian Eggert"
    },
    {
      "text": "The film’s real protagonist is the Arabian Desert -- a state of physical oppression and a state of mind made as compelling for the moviegoer as it must have been for Lawrence himself.",
      "author": "Jay Jacobs"
    },
    {
      "text": "\"Lawrence of Arabia\" is an intensely captivating biographical portrait of a brilliant and controversial figure whose character develops over the backdrop of World War I.",
      "author": "Ian Kane"
    },
    {
      "text": "An undeniable technical achievement with its breathtaking scenery, epic score & gorgeous cinematography. The story isn't its strongest suit, but it can be overlooked by its visuals.",
      "author": "Rosa Parra"
    },
    {
      "text": "All in all, however, I would say that Mr. Spiegel and his associates have done a creditable job with an almost impossible subject.",
      "author": "R.H. Gardner"
    },
    {
      "text": "From the early shots laid on the sun-hot sands there is grandeur and awe-inspiring, stark splendor, against which men fight and die, battle for their ambitions and then see their dearest ideals crushed by uncaring, mercenary politicians.",
      "author": "Marjory Adams"
    },
    {
      "text": "Peter O'Toole s blond, Irish amd a captivating personality. He brings the character of T. K. Lawrence into splendid focus in the film.",
      "author": "Jane Corby"
    },
    {
      "text": "Whatever Lawrence was, he makes an intriguing subject for dramatization. In the role, Peter O'Toole is most effective in conveying the many facets of the man's personality.",
      "author": "Sandra Saunders"
    },
    {
      "text": "Spiegel and Bolt and David Lean have run into an old problem with biographical art: they have invented too much to please biographers, and yet they have not taken the bolder liberties that make art.",
      "author": "Penelope Gilliatt"
    },
    {
      "text": "The script is taut and expressive and the musical score deftly attuned to the tale. Director David Lean has molded his massive material with skill, but personally I felt the film was too long,",
      "author": "Mae Tinee"
    },
    {
      "text": "A supremely engrossing film, Lawrence of Arabia makes one forget that it runs nearly three and three-quarter hours: and sends one out haunted and shaken.",
      "author": "Josephine O'Neill"
    },
    {
      "text": "The supporting cast can only be described as unbeatable. Jack Hawkins' Gen. Allenby, Alec Guinness's Prince Feisal, Anthony Quinn's Auda abu Tayi, Jose Ferrer's Turkish Bey and Omar Sharif's Arab warrior, are all outstanding pieces of acting.",
      "author": "Harold Whitehead"
    },
    {
      "text": "The cast, skillfully chosen and directed with intelligence, ' performs as a polished unit.",
      "author": "Giles M. Fowler"
    },
    {
      "text": "In leaving the theater Wednesday night I felt not so much an admiration for Mr. O'Toole as for the photography of Fred Young.",
      "author": "Lee McInerney"
    },
    {
      "text": "Peter O'Toole, an Irish actor new to films, makes an effective Lawrence, his skills putting much shading into a many-sided and contradictory character, and his support from an impressive cast is uniformly excellent.",
      "author": "John Bustin"
    },
    {
      "text": "It's a good movie -- a long movie, but not a minute too long. It's one you will enjoy thinking about afterward, and perhaps plan to see again.",
      "author": "Dick Banks"
    },
    {
      "text": "he film touches all the bases in blood and thunder, photographs the Arabian desert in all its limitless desolation and yet fails somehow to shed much insight into the legend that was Lawrence.",
      "author": "David Hale"
    },
    {
      "text": "It is hard to recall any film that has put the wide screen to such impressive use.",
      "author": "Bob Thomas"
    },
    {
      "text": "It has faults, Including an un necessarily long length of almost four hours, but there is no doubt that it is bound to be one of the \"glamour films\" of the season.",
      "author": "Jack Gaver"
    },
    {
      "text": "One of the most magnificent pictures, if not the most magnificent, and one of the most exasperating.",
      "author": "Philip K. Scheuer"
    },
    {
      "text": "The honours, then, go to OToole, to Bolt, and to the director, Sir David Lean. The film is technically superb, and the desert photography, in Technicolor, is memorable for its beauty. My only great grief is its length.",
      "author": "Yorwerth Davies"
    },
    {
      "text": "Seldom have the resources of the movie medium been used with more striking skill or to more dramatic effect.",
      "author": "Gordon Stoneham"
    },
    {
      "text": "In Peter O'Toole, we have an actor who can employ the flawless rhythm of a Shakespearean player as well as the argot of his day.",
      "author": "Henry T. Murdock"
    },
    {
      "text": "The awesome majesty of the desert landscapes, with the camel brigades always sweeping the horizons, linger long after the sated viewer has cause to continue being astonished.",
      "author": "Elston Brooks"
    },
    {
      "text": "At last, a film has arrived to justify and even compliment the wide screen -- a spectacle with an intelligent purpose and, in many respects, the most exciting and beautiful movie ever made.",
      "author": "Stanley Eichelbaum"
    },
    {
      "text": "There has never been another motion picture quite like Lawrence of Arabia.",
      "author": "George Bourke"
    },
    {
      "text": "The big screen has frequently proved to be only too big; here it hardly seems big enough, and the implied compliment to Mr. Lean and his camera crew is considerable.",
      "author": "Times (UK) Staff"
    },
    {
      "text": "[O'Toole] looks a good deal like Lawrence's portraits and he rides a camel with great authority. But he cannot project a sense of magic and, in moments of alleged spiritual agony, he merely looks dazed.",
      "author": "Robert Hatch"
    },
    {
      "text": "This marvelous picture, whose photography is like a series of paintings on a great canvas, never diminishes its worth by using spectacle for spectacle's sake.",
      "author": "Irene Corbally Kuhn"
    },
    {
      "text": "By adding subtle character exploration to high adventure, fine acting to poetic photography of incredible sandscapes, this strange film grips attention for almost four hours.",
      "author": "Janet Graves"
    },
    {
      "text": "Lawrence of Arabia is... big, and often beautiful. But it satisfies few of the demands of real drama.",
      "author": "Louis Cook"
    },
    {
      "text": "With this film, David Lean has further entrenched himself as one of the top directors in the industry and heir-apparent to the still vacant boots of Cecil B. deMille.",
      "author": "Leonard W. Stone"
    },
    {
      "text": "I have to give a lot of credit to director of photography Freddie Young for the gorgeous cinematography in the film. The desert scenes in particular were beautifully shot.",
      "author": "Sarah Brinks"
    },
    {
      "text": "They definitely don't make them like this anymore. David Lean's grand film was an enormous and impressive accomplishment back then, and with time, it's legend keeps getting stronger. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Lawrence of Arabia is the most literate and intelligent and tasteful and the most beautiful of the modern expensive spectacle films. And I wish it had never been made.",
      "author": "Pauline Kael"
    },
    {
      "text": "In a recent viewing of Lawrence of Arabia at a local independent moviehouse, I found myself more in awe than ever.",
      "author": "Richard Propes"
    },
    {
      "text": "Regardless of the historical inaccuracies and contestable portrayals, the film is a flourishing masterpiece of storytelling prowess.",
      "author": "Mike Massie"
    },
    {
      "text": "Allowances for changing tastes and styles must be made for many a film from decades past; that is not the case with Lawrence, which remains as invigorating as the night it was first shown.",
      "author": "Kyle Smith"
    },
    {
      "text": "Lawrence, as portrayed by Peter O'Toole with a career-making and career-defining performance, is one of cinema's most fascinatingly complex characters.",
      "author": "Matt Neal"
    },
    {
      "text": "Seldom if ever in motion-picture history has a long-delayed, big-budget \"epic\" so fully measured up to expectations.",
      "author": "Clyde Gilmour"
    },
    {
      "text": "No special effects are front and center here, simply the way a master creator of images pulls us into a dramatic story of great psychological complexity.",
      "author": "Kenneth Turan"
    },
    {
      "text": "David Lean and his cinematographer, Fred A. Young, have given us something really spectacular to look at; the desert, in all its austerity and grandeur, is the star.",
      "author": "Dwight MacDonald"
    },
    {
      "text": "It drew me in and earns it's 3.5 hour running time.",
      "author": "Rachel Wagner"
    },
    {
      "text": "The definitive David Lean movie.",
      "author": "Josh Larsen"
    },
    {
      "text": "Robert Bolt's intelligent screenplay captures a portrait of a fiendishly complex, hopelessly idealistic individual and explores the politics at play.",
      "author": "Allan Hunter"
    },
    {
      "text": "It combines an astute character study with some of the most jaw-dropping images captured on film.",
      "author": "Neil Smith"
    },
    {
      "text": "Lean and photographer Fred A. Young have combined their artistic talents in an evocation of the Arabian desert that makes it both terrifying and deeply moving in its lonely grandeur.",
      "author": "Kate Cameron"
    },
    {
      "text": "It has an epic hero whom it doesn't hero-worship...[O'Toole] brings flawlessly to life the film's vision of a flawed warrior who is corrupted by pride, soured by empty victories and betrayed finally by the jubilant jump of his heart every time he kills.",
      "author": "Alexander Walker"
    },
    {
      "text": "[VIDEO ESSAY] Celebrated British director David Lean's \"Lawrence of Arabia\" is a textbook example of \"epic\" cinema.",
      "author": "Cole Smithey"
    },
    {
      "text": "This is movie-making on the grandest scale.",
      "author": "Adrian Turner"
    },
    {
      "text": "Despite the film's technical wizardry, the seven Academy Awards and the expansive budget, this time-honored epic is ultimately a testament to something elemental: the ability to make an audience gasp as a story is told.",
      "author": "People Staff"
    },
    {
      "text": "If epics are your thing, they don't come much grander.",
      "author": "Philip Kemp"
    },
    {
      "text": "Of all miracles readily apparent on screen, perhaps the greatest is that the film even got made in the first place.",
      "author": "Matthew Thrift"
    },
    {
      "text": "How did David Lean and star Peter O'Toole achieve such perfection? If we could define and distil it, we wouldn't need a special category for those flicks we call 'classics.' Lawrence of Arabia is that, and then some.",
      "author": "Simon Miraudo"
    },
    {
      "text": "This is a movie with the excitement of a cavalry charge.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "To appreciate the film fully, Lawrence must be seen in a cinema, in 70mm on the widescreen and in stereophonic sound, and the present theatrical revival is not to be missed.",
      "author": "Philip French"
    },
    {
      "text": "This seven-Oscar wonder remains exhilarating thanks to Freddie Young's majestic desert lensing, Maurice Jarre's gorgeous score and Peter O'Toole's career-defining portrayal of the feted but flawed protagonist.",
      "author": "William Parker"
    },
    {
      "text": "There are no superlatives which can adequately describe the sheer unadulterated joy of watching David Lean's 1962 classic on the silver screen.",
      "author": "Graham Young"
    },
    {
      "text": "Deathless, and looking as good as new.",
      "author": "Tim Robey"
    },
    {
      "text": "You'll need to dedicate half a day to it - but this deserves to be seen again on the big screen.",
      "author": "Dave Calhoun"
    },
    {
      "text": "It may be legend, and it may be romanticized, but \"Lawrence of Arabia\" feels authentic. It's as stirring an epic as Hollywood has ever produced-one reason why the American Film Institute has named it the Number 1 epic of all time.",
      "author": "James Plath"
    },
    {
      "text": "O'Toole, all piercing blue eyes and steadfast idealism, buzzes with charisma in the role of a lifetime.",
      "author": "Simon Reynolds"
    },
    {
      "text": "...an overlong yet watchable epic...",
      "author": "David Nusair"
    },
    {
      "text": "Mature teens will appreciate this gripping epic.",
      "author": "M. Faust"
    },
    {
      "text": "The performances, the script, the directing, the cinematography, the musical score is all memorable and hasn't aged much, though at 3.5 hours there are some times (especially in the last hour) that the story begins to drag.",
      "author": "Garth Franklin"
    },
    {
      "text": "It is O'Toole who continually dominates the screen, and he dominates it with professional skill, Irish charm and smashing good looks.",
      "author": "TIME Staff"
    },
    {
      "text": "One of the cinema's grandest spectacles, Lawrence of Arabia is at turns exhilarating, devastating, and puzzling as it ponders the mystery of a man who was a mystery to himself.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "David Lean's epic combination of physical deeds and mental agony.",
      "author": "Sky Staff"
    },
    {
      "text": "Spell-binding cinema.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Sweeping, epic, majestic, awesome, sumptuous, you name the grandiose superlative and you'll be right, with amazing performances and gorgeous visuals, although very, very long.",
      "author": "Kim Newman"
    },
    {
      "text": "It was a big bold project and has turned out a big bold film.",
      "author": "Variety Staff"
    },
    {
      "text": "It's probably heresy to suggest it's overlong, but if Lean's epic outstays its welcome, there are more than enough magical moments to explain why it enjoys its lofty reputation.",
      "author": "Film4 Staff"
    },
    {
      "text": "[It] remains one of the most intelligent, handsome, and influential of all war epics.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "A gorgeous epic with an outstanding performance from Peter O'Toole.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Lean's epic biography of the enigmatic and complex British hero is visually mesmerizing, even if it omits crucial aspects of Lawrence's life, and it boasts a radical, riveting performance from Peter O'Toole.",
      "author": "Emanuel Levy"
    },
    {
      "text": "The passage of time has only proved how difficult it is to run ideas, history, characterisation and landscape in harness on this sort of scale.",
      "author": "Brian Case"
    },
    {
      "text": "The only way to properly see Lean's overstuffed epic is on the big screen, the better to appreciate the glorious desert vistas, Maurice Jarre's soaring score and the glowing performance by then-unknown Peter O'Toole as a messianic T.E. Lawrence.",
      "author": "Thomas Delapa"
    },
    {
      "text": "Elegant and literate.",
      "author": "Paul De Angelis"
    },
    {
      "text": "It's a truly magnificent film.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "For all the stunning shots of windswept dunes and battle sequences featuring a cast of hundreds, this is the study of a man in deep conflict.",
      "author": "Michael Dequina"
    },
    {
      "text": "Lawrence of Arabia is a stunning 'classic.'",
      "author": "Marco Lanzagorta"
    },
    {
      "text": "The English-language cinema's exemplary historical drama, gorgeous, complex, passionate, vivid and engrossing a full four decades after its premiere.",
      "author": "Shawn Levy"
    },
    {
      "text": "The chief fault is that the picture doesn't come close to explaining the complex and enigmatic character that was Lawrence.",
      "author": "Myles Standish"
    },
    {
      "text": "It reduces a legendary figure to conventional movie-hero size amidst magnificent and exotic scenery but a conventional lot of action-film clichés.",
      "author": "Bosley Crowther"
    },
    {
      "text": "Both the man and the movie, are treated with a detached reverence that keep them essentially unknowable...as glorious but inscrutable as the dunes.",
      "author": "Nick Davis"
    },
    {
      "text": "Best appreciated on the big screen.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Stirring historical biography is epic, intimate and awe-inspiring.",
      "author": "James Rocchi"
    },
    {
      "text": "An epic achievement in filmmaking.",
      "author": "Janice Page"
    },
    {
      "text": "A movie with scope, tremendous clarity of vision and purpose; simply put, it is a film for the ages, an epic in every sense.",
      "author": "Brent Simon"
    },
    {
      "text": "A shining example of a vanished breed of epic filmmaking.",
      "author": "David Sterritt"
    },
    {
      "text": "A cracking good adventure yarn, as well as a disturbing psychological profile of a man destined to become a great leader but an even greater dupe.",
      "author": "Glenn Lovell"
    },
    {
      "text": "Released in 1962, it was pretty clearly the most intelligent spectacular within living memory. On its 40th anniversary, it's even better.",
      "author": "Andy Klein"
    },
    {
      "text": "It's an astonishing, unrepeatable epic.",
      "author": "Michael Wilmington"
    },
    {
      "text": "A film in which grandeur of conception is not up to grandeur of setting.",
      "author": "Penelope Houston"
    },
    {
      "text": "In the power, sweep and realism of its story dealing with the legendary war hero, the picture has rarely been equalled.",
      "author": "Frank Leyendecker"
    },
    {
      "text": "Riveting from beginning to end, featuring stellar performances, amazing cinematography, and a story without a trace of fat, the film does everything an epic is supposed to do -- and more.",
      "author": "James Berardinelli"
    },
    {
      "text": "One of the rare instances of \"Oscars\" ending in right hands.",
      "author": "Dragan Antulov"
    },
    {
      "text": "Grand in every sense, David Lean's film is an example of an established director full of confidence and ambition.",
      "author": "Martyn Glanville"
    },
    {
      "text": "Still looks awesome and packs a tremendous punch.",
      "author": "Brian Webster"
    },
    {
      "text": "...the best epic the screen has ever seen. In terms of sheer sweep, intelligence, and star power, nothing much comes close.",
      "author": "John J. Puccio"
    },
    {
      "text": "I am convinced that it is simply one of the finest works of cinematic genius to ever illuminate the big screen.",
      "author": "Robert Marley"
    },
    {
      "text": "Lawrence of Arabia (1962) is the filmic retelling of T. E. Lawrence's heroic, autobiographical account of his own Arabian adventure, published in \"The Seven Pillars",
      "author": "Tim Dirks"
    },
    {
      "text": "At the center of Lean's superbly sun-drenched, 70mm canvas is Peter O'Toole's eccentric but magnificent portrayal of the erudite, Oxford-educated lieutenant.",
      "author": "TV Guide Staff"
    },
    {
      "text": "Lawrence is too emotionally overpowering for critical reservations.",
      "author": "Desson Thomson"
    },
    {
      "text": "To see the 221 minutes of Lawrence of Arabia in a theater, in all its widescreen glory, is to fall in love.",
      "author": "Donna Bowman"
    },
    {
      "text": "A very good film.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "One of those rare films that runs on all cylinders.",
      "author": "John A. Nesbit"
    },
    {
      "text": "If ever there was a movie worthy of restoration and reissuing it is Lawrence of Arabia.",
      "author": "Chris Hicks"
    },
    {
      "text": "Lawrence luxuriates in the tremendous.",
      "author": "Stanley Kauffmann"
    },
    {
      "text": "This is that rare film whose weaknesses are not only swallowed up by its vast, disturbing ambition, but somehow become part of its strengths.",
      "author": "Gary Kamiya"
    },
    {
      "text": "The only thing that really dates it is the awful makeup, orangey pancake for Lawrence, a gray-green nose for Quinn and cordovan shoe polish for Guinness.",
      "author": "Rita Kempley"
    },
    {
      "text": "This is a film for the ages.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "If one can continue to see a work such as this 35 years later and still remain entranced by its spectacle and its drama, then surely, that is a classic indeed.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "We remember the quiet, empty passages, the sun rising across the desert, the intricate lines traced by the wind in the sand.",
      "author": "Roger Ebert"
    },
    {
      "text": "There are great action scenes, and the photography by Lean regular Freddie Young is, I believe, is the best ever put on film.",
      "author": "Matt Easterbrook"
    }
  ],
  "release_year": 1962,
  "duration": 222,
  "genres": [
    "Biography",
    "History",
    "Drama",
    "Adventure"
  ],
  "age_rating": "PG",
  "synopsis": "Due to his knowledge of the native Bedouin tribes, British Lieutenant T.E. Lawrence (Peter O'Toole) is sent to Arabia to find Prince Faisal (Alec Guinness) and serve as a liaison between the Arabs and the British in their fight against the Turks. With the aid of native Sherif Ali (Omar Sharif), Lawrence rebels against the orders of his superior officer and strikes out on a daring camel journey across the harsh desert to attack a well-guarded Turkish port.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/AiAm0EtDvyGqNpVoieRw4u65vD1.jpg"
}