{
  "movie_name": "Logan",
  "movie_id": "logan_2017",
  "total_reviews": 427,
  "reviews": [
    {
      "text": "James Mangold’s Logan is one of the greatest superhero films ever made, telling a tragic, mature story about one of cinema’s most iconic characters.",
      "author": "Tom Spoors"
    },
    {
      "text": "Logan is a must see film. The film is a finale to two of the actors that have made this series so special and while it is arguable that the story doesn’t do their characters justice Jackman and Stewart do both step up to plate",
      "author": "David Griffiths"
    },
    {
      "text": "For my money, Logan is the best superhero film of 2017, and one of the best we’ve seen to date.",
      "author": "JD Duran"
    },
    {
      "text": "Logan remains a monumental work in the genre.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Fortifying a film with references to another can definitely be worthwhile, but to define a film with another limits the experience.",
      "author": "Benedict Seal"
    },
    {
      "text": "I love how the film transcended the superhero genre to become a tragic western. The most emotional superhero film ever made.",
      "author": "Joseph Garcia"
    },
    {
      "text": "There are no punchy jokes or one-liners. There are no colorful, larger than life characters. Mangold’s tone remains intensely serious and his characters are broken and struggling.",
      "author": "Keith Garlington"
    },
    {
      "text": "An uncommon comic book film that transcends its label, Logan engages through its harmony of post-modernism and serious treatment of complex characters.",
      "author": "Brian Eggert"
    },
    {
      "text": "This is the film fans have been waiting for, the antidote to the noisy, messy superhero films of (the previous) year. Its the perfect goodbye to a beloved character.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Jackman delivers a career performance as Logan.",
      "author": "David Gonzalez"
    },
    {
      "text": "A fantastic evolution of where these kinds of stories and characters can go.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Logan, the last of the Wolverine films, shows an aging hero, bitter towards the world but with a heart in the right place that motivates his defining moments.",
      "author": "Hosea Rupprecht"
    },
    {
      "text": "It's Stan Lee by way of Cormac McCarthy, but the end result -- basically, No Country for Old X-Men -- suffers from its own sense of self-importance.",
      "author": "Matt Brunson"
    },
    {
      "text": "Logan is confident enough to mark the end of the road and know it's said all it needed to say.",
      "author": "Kip Mooney"
    },
    {
      "text": "Logan took a hero long familiar to film-goers and turned the tropes of a superhero film into a Western that comments on universal themes like aging and the human condition in the process.",
      "author": "Nathan Mattise"
    },
    {
      "text": "Logan as a black sheep that future audiences will wonder what factors ever allowed it to be made. You can appreciate it being the pariah of Marvel's superhero output too ...",
      "author": "Jim Rohner"
    },
    {
      "text": "Logan presents us with a dark, devastating final journey for one of cinema's most enduring comic book characters. Though it is undoubtedly bleak, there are also moments of much-needed warmth, and ultimately a sense of hope resonates.",
      "author": "Mark Cassidy"
    },
    {
      "text": "It's raw, emotional and brutal - and a beautiful final film for Wolverine.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "It doesn't help that the villain is ridiculous, especially as he manages invincibility in the face of Wolverine's inseparable weaponry.",
      "author": "Mike Massie"
    },
    {
      "text": "...not just another superhero movie...",
      "author": "Tony Asankomah"
    },
    {
      "text": "James Mangold keeps the movie as grounded in realism as possible. Unlike the other films in the franchises, it doesn't feel overly CGI and effects heavy.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "A dark, fascinating character study that treats its characters with an intelligence and maturity that has been lacking in the X-Men films practically since their inception.",
      "author": "Leigh Monson"
    },
    {
      "text": "Logan is just about everything you could possibly want from a film that is said to be the end of the road for both Jackman and Stewart.",
      "author": "Richard Propes"
    },
    {
      "text": "Not only is this film superb but serves as a fantastic and fitting end to Marvel's celebrated character.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Brash and pulpy, desolate but hopeful, violent and touching, Logan is a fitting culmination of the Wolverine saga.",
      "author": "Brent McKnight"
    },
    {
      "text": "Jackman portrays Wolverine with a hint of drama that seems trustworthy, but along the way his latest journey becomes boring, repetitive, with ephemeral pleasurable moments ending in a cheeky climax trying to be sentimental. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "This is probably the best superhero movie I've seen in years.",
      "author": "Avaryl Halley"
    },
    {
      "text": "The thing that I liked the most about it was that it was a human story.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Logan works best if you have a history with the Wolverine character, but it's also remarkably impactful as a standalone film.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Logan is a solid ending for its title character and could easily be a high point for the X-Men series or a solid high to end on.",
      "author": "Emilie Black"
    },
    {
      "text": "Logan is a powerful, excellent film - a fitting farewell to what turned out to be one (or two) of the most enduring character portrayals in film history.",
      "author": "Dan Scully"
    },
    {
      "text": "When presented with a superior script, the cast stepped up.",
      "author": "Tim Brennan"
    },
    {
      "text": "LOGAN is the best use of a superhero property in years by doing what so many neglect to do - tell a story, and tell it well. If this film is to be the final appearance of Hugh Jackman and Patrick Stewart then they truly have left on a high.",
      "author": "Jim Ross"
    },
    {
      "text": "Logan elevates itself beyond superhero tropes by examining the man well known for his healing ability, sharp claws, and short temper through themes of finality and family.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Logan is the tenth X-Men movie . . . and might just be the best.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Stewart and Jackman give a pair of brilliant performances, and Keen shows dazzling range for a girl younger than the franchise itself.",
      "author": "Chris McCoy"
    },
    {
      "text": "Podcast Review",
      "author": "Julian Lytle"
    },
    {
      "text": "The ending of \"Logan\"... works in a bold and poignant way, providing the kind of closure that any story could be proud of.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "This could now be the best X-Men film in the franchise. It's a huge relief to have a fitting end to a great character and even better actor.",
      "author": "Ben Ashelford"
    },
    {
      "text": "Logan deals with regret, ageing, and familial love (maladjusted though that family might be) with the nuance and conviction of an arthouse movie from a hungry newcomer who's got something to say.",
      "author": "Rhys Tarling"
    },
    {
      "text": "Logan is the best X-Men movie made to date.",
      "author": "Kate Rodger"
    },
    {
      "text": "This is Hugh Jackman's movie all the way and he carries it home with the strength and dignity that fans of the X-Men hope to see.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Logan is the mercilessly barbaric Wolverine film you have always wanted chock full of blood, gore, and extreme vulgarity even South Park would be proud of. Beautifully bleak and faithful to the source material.",
      "author": "Chris Sawin"
    },
    {
      "text": "A strong ending to Hugh Jackman's tenure as Wolverine, Logan isn't quite a masterpiece but it definitely set a benchmark which the rest of this year's superhero movies may struggle to beat.",
      "author": "Josh Wilding"
    },
    {
      "text": "While it would have been nice if these themes had been more thoroughly explored, they still resonate. Besides, nerds have waited almost 20 years for uncensored slice and dice from the ol' Canucklehead. Sometimes, compromise is necessary.",
      "author": "Dominic Griffin"
    },
    {
      "text": "It often comes close to superhero greatness but ultimately falls just short, working much better as a character study.",
      "author": "David Bax"
    },
    {
      "text": "Sacrilege though it may be to fellow comic aficionados, facts are still facts: As a character, Wolverine kind of sucks. Moody and hairy, the murder-happy brute is all pouting and brooding; he's like a stabbier Morrissey.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Even if the dire tone gives off the whiff of calculation, its violence and profanity are liberating, a closing of the gap between comic book fantasy and life as we recognize it.",
      "author": "Mark Keizer"
    },
    {
      "text": "A vulnerable Logan delivers an indestructible Wolverine movie",
      "author": "Jeff Mitchell"
    },
    {
      "text": "In an age where superhero films blindly follow the doctrine that more is more, Logan simplifies.",
      "author": "Matt Oakes"
    },
    {
      "text": "An elegiac modern western, a simple, powerful, straightforward thriller that totally redefines what it means to be a superhero",
      "author": "Mattie Lucas"
    },
    {
      "text": "Logan is a bloody good time and gives fans and audiences alike the Wolverine movie we've been craving since 1999.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Logan is one of the first times where we get to revel in all of the hallmarks of superhero storytelling-the action, the suspense, the reckless abandon-in a movie that, ultimately, doesn't feel much like a comic book film.",
      "author": "Khal Davenport"
    },
    {
      "text": "Logan is fan-servicing, bloody, and a rather beautiful epitaph to Jackman's work.",
      "author": "Christopher Preston"
    },
    {
      "text": "This is the saddest X-Men film ever. And it's also the best. Ever.",
      "author": "Amie Simon"
    },
    {
      "text": "It's bleak but brilliant and has some great scenes and a fitting ending. If this truly stands as Hugh Jackman's last stand as Wolverine, then that's a hell of a way to go out!",
      "author": "David Hogan"
    },
    {
      "text": "The world may be aching, Logan creaky, Charles losing his mind and Caliban a latter day Mrs Mop, but the film itself is anything but tired and broken - as extreme violence is offset by thoughtful questions about family, sacrifice and the end of the line.",
      "author": "Sarah Cartland"
    },
    {
      "text": "I loved the idea of Logan. My problem is the execution.",
      "author": "Jourdain Searles"
    },
    {
      "text": "By stripping back the theatrics and spectacle of the previous chapters, we're delivered with a powerfully moving and captivating character piece.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Logan is a fitting ending to Wolverine's story.",
      "author": "Amanda Greever"
    },
    {
      "text": "This presumed final trip for Jackman has more in common with Unforgiven than anything that's appeared between the covers of a Wolverine comic.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Destruction in the face of death - the superhero Western we've all been waiting for.",
      "author": "Evan Dossey"
    },
    {
      "text": "Brutal and bittersweet.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Hugh Jackman is no longer weighed down by the unnecessary melodrama of the previous Wolverine films.",
      "author": "Emmet Asher-Perrin"
    },
    {
      "text": "Jackman can rest easy knowing that he has left the Wolverine's legacy on a high, providing fans with the violent and emotionally rich character piece they craved and delivering a great piece of suspenseful film-making and an original superhero flick.",
      "author": "Lewis Knight"
    },
    {
      "text": "Without question, Logan is an instant classic and one of the most intriguing, impactful performances in (Hugh) Jackman's career.",
      "author": "Matt Ward"
    },
    {
      "text": "LOGAN is a film that's all about family, letting go and moving on, and a heartfelt last ride for Jackman, who has given so much of himself to the role of Wolverine over the many years.",
      "author": "James Clay"
    },
    {
      "text": "I plan to revisit (it) in the future, even if not often. (That's not) dismissive critique, but (preparation) for a bold, harsh look at characters you've loved for years.",
      "author": "Colby Bryant"
    },
    {
      "text": "The film's depiction of violence plays into its subversive intentions, as Logan essentially abandons much of the convoluted timeline(s) within the X-Men film series...",
      "author": "Joel Mayward"
    },
    {
      "text": "At some point, we need to stop glorifying the deaths of saintly, self-sacrificial minorities and women who die to save white male heroes.",
      "author": "Li Lai"
    },
    {
      "text": "\"Logan\" is one of the best comic book adaptations of all time",
      "author": "Joey Magidson"
    },
    {
      "text": "Jackman has been defined as a screen presence by almost two decades of playing this character across the various X-Men movies... and yet, the X-Men movies themselves have ultimately been a succession of average-to-forgettable films.",
      "author": "Bob Chipman"
    },
    {
      "text": "Director James Mangold has crafted a superhero movie that examines the demands of being a superhero in rather dark and refreshing ways.",
      "author": "Micheal Compton"
    },
    {
      "text": "Blissfully free of giant robots and blue beams shooting into the sky, the story instead claws drama from the essential tragedy of a man whose longevity curses him with seeing people he cares about constantly ripped away.",
      "author": "Zaki Hasan"
    },
    {
      "text": "This is the Wolverine story fans have wanted to see on screen all along, and the filmmakers are to be commended for taking the character to this difficult but necessary place.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Over 17 years, Hugh Jackman has played Wolverine through all sorts of highs and lows. If this is definitely his final turn as the character, he's going out on the highest note yet.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Raw, stripped-down, and vulnerable, it's a razor-sharp, surprisingly effective study of characters we thought we knew well.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "17 years after his introduction into the \"X-Men\" franchise, Fox has finally made a Wolverine movie that will truly satisfy fans of the character.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Logan is the film that Wolverine so rightfully deserved.",
      "author": "Rosalie Kicks"
    },
    {
      "text": "If I had a special connection to the X-Men franchise, and if Wolverine had been one of my all-time favourite characters, I would've appreciated this far more.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Bless director James Mangold and crew ... [for understanding that] for Logan's journey to end on an appropriately high note, all leashes must be taken off.",
      "author": "Nguyên Lê"
    },
    {
      "text": "Stark. Bleak. Honest. Fulfilling. These are the words I would use to describe James Mangold's Oscar-worthy Logan.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Drops the ball with a lackluster third quarter that results in the film to a disappointingly underwhelming sendoff to Hugh Jackman's portrayal of the iconic character.",
      "author": "Rendy Jones"
    },
    {
      "text": "[Logan] keeps itself away from another 'saving the world' trope, and crafts a uniquely personal and tragic story that will leave many choked up.",
      "author": "Akhil Arora"
    },
    {
      "text": "Logan manages to be about Logan and Charles while simultaneously building a mutant world with broader representation. It's a bloody, crushing battle to get there, but there could be a better future.",
      "author": "Molly Templeton"
    },
    {
      "text": "It's a great send-off for Hugh Jackman.",
      "author": "Achara Kirk"
    },
    {
      "text": "I'd put it up there with First Class as my favorite X-Men movies.",
      "author": "Jaby Koay"
    },
    {
      "text": "Neither Mangold or his cast are messing around here, with all concerned determined to deliver a final, hugely satisfying, one-way trip for this A-list member of the X-Men. As for what might come next, one fancies fans will like that too.",
      "author": "Alison Rowat"
    },
    {
      "text": "Aside from being a great film, [\"Logan\"] speaks to bigger themes that will make it relevant far longer than most other superhero movies.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "Logan moves from self-loathing lush to reluctant protector to impassioned avenger... For the first time, he's not the hero we want but, rather, the one we need.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "Dafne Keen plays Laura and hot diggity dog, she's actual perfection.",
      "author": "Stephanie Cooke"
    },
    {
      "text": "Jesus this movie was fantastic,i think part of the reason why this movie was so amazing was because, we knew it would be Hugh Jackman's last movie.",
      "author": "Dorian Parks"
    },
    {
      "text": "[It's] a very good, very violent action movie, with a sense of stakes that modern blockbusters rarely have.",
      "author": "Joshua Rivera"
    },
    {
      "text": "This is the grown up version of these films and given the history of the movies, its absolutely earned.",
      "author": "William Evans"
    },
    {
      "text": "Logan's dark tone and desperate violence work well. This is a character study, and the only rough patches are when we deviate from Logan and Laura's journey.",
      "author": "Annalee Newitz"
    },
    {
      "text": "It's jaw-droppingly good at the things it does and, uncannily, what it does is join the ranks of the greatest superhero movies of all time.",
      "author": "Damian Levy"
    },
    {
      "text": "Logan is a fascinating film.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Mangold's film is undoubtedly overlong and some stretches do drag, but Jackman and Stewart's superb, nuanced performances ensure that it's not just the fight scenes but also the emotionally charged ones that really pack a punch.",
      "author": "Jason Best"
    },
    {
      "text": "Logan gamely bats away most of the genre's perceived narrative mold and \"fatigue\", jettisoning a previously de-clawed, 12A-rated Wolverine in favour of a full-fat, crimson-soaked final outing for the iconic mutant.",
      "author": "Shaun Munro"
    },
    {
      "text": "An harsh testament... to an enduring icon. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "The movie is tough and unyielding before overexposure to these kids sets it. The warning in Logan's trailer should have mentioned that it's not mayhem you have to worry about. Saccharin will get you in the end.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "After some nine X-Men movies of various stripes and styles including a couple of previous stand-alone Wolverine films, I had little hope that the best was yet to come. But indeed it has come in the form of Logan...",
      "author": "Pete Hammond"
    },
    {
      "text": "One has taken Jackman for granted in this role, but there's something grandly Shakespearean too about the Wolverine's rage against the dying of the light.",
      "author": "Paul Whitington"
    },
    {
      "text": "Whether or not you think Superhero Movies is a genre in itself, [Logan] proves that you can have other genres, other types of films that you're familiar with, but add the element of superheroes, or in this case, mutants.",
      "author": "Andre Meadows"
    },
    {
      "text": "Logan does take worthwhile risks and breaks some good ground in superhero storytelling.",
      "author": "Megan Basham"
    },
    {
      "text": "Hugh Jackman's final adventure as Wolverine is not just the best film in the franchise, but the fondest farewell Logan could hope for.",
      "author": "Rick Marshall"
    },
    {
      "text": "The best comic-book-inspired offering this year - and maybe ever - was the weighty, somber, ultra-violent final chapter in the X-Men's Wolverine saga.",
      "author": "Kiko Martinez"
    },
    {
      "text": "At over two hours, the movie drags a bit towards its finish, but still remains a strong tribute to Jackman as Logan, bidding him a fond farewell as he exits the series.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "An amazing way to end Logan's saga.",
      "author": "Steph Cozza"
    },
    {
      "text": "Mangold has crafted a movie that sends its hero off in great feeling and style. Logan has a great emotional depth and Jackman is terrific.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "Logan would absolutely deserve a Best Picture Oscar nomination, even more than Christopher Nolan's hailed yet arguably snubbed Batman masterpiece The Dark Knight.",
      "author": "Robert Kojder"
    },
    {
      "text": "You mean this is the Wolverine we could have always had? Of course this would be the last one. Logan is a fantastically dark and satisfying story ending for this Hugh Jackman's Wolverine.",
      "author": "Alachia Queen"
    },
    {
      "text": "If indoctrinating child audiences into accepting, and enjoying, brutal deadly violence was the intent of the filmmakers responsible for making \"Logan,\" then their mission is accomplished.",
      "author": "Cole Smithey"
    },
    {
      "text": "Logan is a melancholic paen to the Western with enough blood and gore to redefine what a comic book movie can and should be.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Inspired by Old Man Logan, this film is very grounded and it's not the typical superhero action film.",
      "author": "Danielle Solzman"
    },
    {
      "text": "The despair is compensated with certain optimism by a new generation with retractable claws. [Full review in Spanish]",
      "author": "Nazareno Brega"
    },
    {
      "text": "The film does have a generous amount of gore and splatter. But the whole blood soaked approach is what makes this movie such a dark and fascinating experience.",
      "author": "Rachit Gupta"
    },
    {
      "text": "If this is some sort of a farewell, then, sad to say, it's too nasty for me.",
      "author": "Matthew Bond"
    },
    {
      "text": "\"Logan\" is not only the most violent Marvel movie ever made, but also one of the very best",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Logan is well made, though, with SUPERB acting across the board, including franchise-best performances from Jackman and Stewart.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Logan, Hugh Jackman's ninth and final outing as the Wolverine, is really a profoundly hopeful film.",
      "author": "Melissa Leon"
    },
    {
      "text": "Heartbreaking yet touching, Logan is a fitting farewell to an icon.",
      "author": "Joanne Soh"
    },
    {
      "text": "[Hugh] Jackman is up to the task, as usual. But he, the character, and the fans might have wished for the saga to go out with a little less bang, and a lot more heart.",
      "author": "Lisa Jensen"
    },
    {
      "text": "The superhero movie is a major American genre, and one that is malleable for the silly and the profound. And Logan is the most profound one yet.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "And so the curtain comes down on the Wolverine series. Logan isn't so much a fitting finale for the series as a fitting finale for one of the most beloved superhero characters in the Marvel universe.",
      "author": "Harry Readhead"
    },
    {
      "text": "[Logan] puts a period at the end of a 17-year sentence.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "One of the most gripping Marvel-inspired movies yet.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Logan isn't just a great superhero movie, it's a great movie.",
      "author": "Erik Henriksen"
    },
    {
      "text": "Logan ventures to all the places superhero movies have tended not to go.",
      "author": "K. Austin Collins"
    },
    {
      "text": "I will not tell you about the final scene, but suffice to say there was not a dry eye in the theatre that day. I never thought I would cry in a Wolverine movie, but there it is.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "In his final round as Wolverine, Jackman's iconic portrayal ultimately shows the man coming around.",
      "author": "Brooke Corso"
    },
    {
      "text": "In Logan, Laura kicks the most ass, saves the most lives, and possesses the biggest heart. It's all about the unbridled force of good old-fashioned girl power.",
      "author": "Morgan Baila"
    },
    {
      "text": "At its best, really does feel like it's making a strong play for that title [of Best Comic Book Movie of the '10s].",
      "author": "Tim Brayton"
    },
    {
      "text": "How Marvel and Fox can ever top this I don't know. But there's going to be some great nights at the multiplex in the next couple of years watching them try.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "\"Logan\" proves there's nothing wrong with mindless entertainment - especially when the people making said entertainment have put their minds to making the best movie they can.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Absolutely bloody brilliant. Brutal, foul-mouthed and tragic.",
      "author": "Jamie East"
    },
    {
      "text": "True to the spirit of the Marvel comics the character was ripped from, this is a splatter fest of bone splitting, brain skewering violence. And it's all the more fun for it.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "These are things that I wish Logan had done better, but that in itself says something. I wish it had done these things better precisely because it is a very good movie, and a very, very good Wolverine story.",
      "author": "Susana Polo"
    },
    {
      "text": "The plotting is a bit too blockbuster-pulpy for the movie to be the cleansing back-to-basics art it seems to want to be. Still, I must be honest and say I got misty a couple of times.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Imagine a superhero film that feels more realistic than most war dramas.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Can a comic book superhero movie tell a human story? Logan makes the case that the genre is not limited to spectacle, end of the world stakes, or world-building chapters in a massive franchise.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Jackman find the humanity in \"Logan.\"",
      "author": "Charles Koplinski"
    },
    {
      "text": "A moving tribute to a beloved character.",
      "author": "Priscilla Page"
    },
    {
      "text": "Come for the adamantium claws but bring a box of tissues; you knew this was going to happen sooner than later.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Logan is not just the latest but the greatest Wolverine movie.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "While Mangold grants the gruesome, R-rated dreams of X-fans, Logan stands as one of the best comic book movies of all time by slicing through fatalistic philosophy",
      "author": "Matt Patches"
    },
    {
      "text": "'Logan' delivers a savage, powerful tale.",
      "author": "Linda Cook"
    },
    {
      "text": "A vast improvement over The Wolverine...",
      "author": "David Nusair"
    },
    {
      "text": "'Logan' is definitely good news for those looking for more visceral stories in comics. [Full review in Spanish]",
      "author": "Mario P. Székely"
    },
    {
      "text": "An ultra-violent drama about time and loss, an emotional final journey of a hero in conflict with himself. [Full review in Spanish]",
      "author": "Uriel Barco"
    },
    {
      "text": "Logan when, in the aftermath, our heroes navigate a battleground littered with non-combatants. For all the wrestling in the Marvel Universe with collateral damage, this is the best, most devastating representation of it.",
      "author": "Walter Chaw"
    },
    {
      "text": "Logan is one of the best of the entire X-Men franchise.",
      "author": "Diane Pershing"
    },
    {
      "text": "Logan/i> is everything we complain comic book movies aren't: It's contemplative and poignant, and there are depths to these characters only hinted at in earlier films.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "A very good and often compelling action film, warts and all.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "You don't need to like superheroes to enjoy this film, you just need to know that it will leave you welling up with tears and clutching your loved ones, which is a momentous achievement for any blockbuster indeed.",
      "author": "Alex Casey"
    },
    {
      "text": "a gritty, bloody, and ultimately heartfelt paean to both the sanctity and the temporality of life",
      "author": "James Kendrick"
    },
    {
      "text": "It's the film that many expected. If it were true that Jackman will not return to the role, we can say that he said goodbye in a dignified manner. [Full review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "The movie is exhilaratingly vicious (those claws are made to order for R-rated bloodshed) but also elegiac, thanks to Stewart's gravitas, Jackman's weary charisma and the quixotic-quest storyline...",
      "author": "John Beifuss"
    },
    {
      "text": "Concerned with the here and now rather than with what will come, it's the cinematic equivalent of a long life brought to its natural conclusion and given a meaty, meaningful send off.",
      "author": "Sarah Ward"
    },
    {
      "text": "Marvel fans that moonlight as undiscerning gorehounds just might find Valhalla in \"Logan,\" but the project goes out of its way to give everyone else the cold, dead shoulder.",
      "author": "J. Olson"
    },
    {
      "text": "Fans who come to see Wolverine in brutal, bloody, R-rated combat will get their fill. But Mangold alternates those battles with quieter scenes that establish even supporting characters as people whose deaths matter.",
      "author": "Margot Harrison"
    },
    {
      "text": "In its look at human frailty and death, James Mangold's Logan is unlike any superhero film ever produced -- and it just may change the genre for good.",
      "author": "Wade Bearden"
    },
    {
      "text": "A compelling, overlong, grown-up, 21st-century Western with a tinge of sci-fi. It's good, but it can be grueling.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Jackman gets to play the role the way it always should've been played.",
      "author": "Bob Grimm"
    },
    {
      "text": "Logan is a deliberately scuffed up work of comic adaptation art, and Jackman and Stewart could not have chosen to end their X careers on a higher note.",
      "author": "Alex Doenau"
    },
    {
      "text": "A film that will leave you exhausted in your seat, with tachycardia and excited on the verge of tears. [Full review in Spanish]",
      "author": "Hugo Lara"
    },
    {
      "text": "Make no mistake, Logan earns its tears. If Jackman and Stewart are serious about this being their mutual X-Men swan song, they could not have crafted a more heartfelt valedictory.",
      "author": "Peter Travers"
    },
    {
      "text": "Unlike any of its predecessors, Logan feels organic and, despite being loaded with plenty of references and Easter eggs, manages to work well as a standalone film.",
      "author": "Marija Djurovic"
    },
    {
      "text": "Logan, and Jackman, know you can't secure a legacy by leaving a door open.",
      "author": "Ali Gray"
    },
    {
      "text": "This is Death Wish Wolverine, with spring-loaded self-loathing action and retractable claws he can hide, but never discard. Comes complete with sadness, depression and existential darkness.",
      "author": "John Serba"
    },
    {
      "text": "For Jackman, Logan is a triumph: a vulnerable portrayal of a tortured character coming to terms with his plight & humanity. As a gritty western about redemption, the film is also effective...",
      "author": "Louise Keller"
    },
    {
      "text": "The women do not suffer their deaths with any less violence. Three important men, named, with histories and layers, die too. The movie pauses and allows each of their passings a solemn grace, as dictated by its audience, single-minded and insatiable.",
      "author": "Tara Thorne"
    },
    {
      "text": "The film and the latest incarnation of Jackman as Wolverine is entertaining and meets expectations. [Full review in Spanish]",
      "author": "Oswaldo Betancourt Lozano"
    },
    {
      "text": "Logan's virtue is that it distances itself completely from previous films. There are no superheroes, impressive costumes or big demonstrations of mutant power. Without a doubt, the best of the genre. [Full review in Spanish]",
      "author": "Lucero Solórzano"
    },
    {
      "text": "Offering a touch of Mad Max, some tense humour, a glimpse of the classic Western Shane for obvious reasons and Hugh's most glowering performance in X-Men history, this is a fitting and surprisingly moving... finale to the Wolverine saga.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "This is a well-acted film with decent action scenes. It isn't really my cup of tea, but that doesn't take away from the fact this movie is well made. I just wish they had made it less depressing.",
      "author": "Robert Roten"
    },
    {
      "text": "Jackman and Stewart are why Logan works-why the film doesn't feel like a cheap exercise in bloody violence, and its subversion of typical superhero-movie tropes feels organic.",
      "author": "David Sims"
    },
    {
      "text": "Another expensive throwaway aimed at milking money out of people who still read comic books. Color it stupid.",
      "author": "Rex Reed"
    },
    {
      "text": "Logan is a perfect bookend to Hugh Jackman's years of playing the role. To see him go out on such an exuberant high is much more than anyone could have asked for.",
      "author": "David Fontana"
    },
    {
      "text": "An intimate story of few characters, without exaggerated digital effects, and focused on the mortality of its protagonists and the consequences of their violent acts. Logan definitely couldn't have had a better goodbye. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Logan is a sign that it's possible to make mature films with superheroes, with themes of real emotional resonance. [Full review in Spanish]",
      "author": "Rafael Paz"
    },
    {
      "text": "Strips away the spandex, the posse and the chaos, distilling the story down to the essence of the man, Logan. What's left is the agony and the ecstasy of mutanthood.",
      "author": "Katie Walsh"
    },
    {
      "text": "A film with adult themes such as illness, death wish, contradictions between longings and reality, and confronts them in a cruel and visceral way with a tender, memorable and heartbreaking ending. [Full review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "Maybe it has 20 minutes more, but the pieces are placed to, within its genre, have an anthology film for the character, the closing of this saga manages to leave a mark on the viewer. [Full review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "A story with little action that lacks the epic brilliance of the character. Finally the worst happens: the film becomes long and boring. [Full review in Spanish]",
      "author": "Pilar Ayuso"
    },
    {
      "text": "A dark, tragic and hopeful story that leaves us with a bittersweet feeling because it's best solo film of the character, and even within the X-Men universe. [Full review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "Before it settles down as a cross between 'Mad Max Beyond Thunderdome' and 'Shane' it's a pretty joyless slog, one CG-enhanced battle after another ... Dafne Keen as Wolvie's ward goes full feral.",
      "author": "Glenn Lovell"
    },
    {
      "text": "The tonal shift for Marvel, however, is welcome, and no character from its stable better suits the Western mould (the 1953 classic Shane is referenced heavily). Conventional as it is, overall Mangold finds room for more strikingly inventive set pieces.",
      "author": "Hilary A White"
    },
    {
      "text": "The super-violent Logan is just slashed brisket.",
      "author": "Camilla Long"
    },
    {
      "text": "After the 140-minute running time I felt as exhausted as Wolverine.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "Full of grainy light and bloody violence that is shadowed by sorrowful regret, James Mangold's movie creates a sober and deeply satisfying finale for Hugh Jackman's Wolverine, the snarling centrepiece of so many X-Men movies.",
      "author": "Craig Mathieson"
    },
    {
      "text": "It's as if Quentin Tarantino took the reigns of the X-Men franchise and offered his own perspective on Wolverine and Professor Xavier.",
      "author": "John Hanlon"
    },
    {
      "text": "Jackman's last and best turn as Wolverine shows us something new: a superhero, aging and past his prime. (Splice Today)",
      "author": "Stephen Silver"
    },
    {
      "text": "For fans of the \"X-Men,\" this is easily the best entry in the series in some time, a film that's more interested in the characters than in the special effects.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Tightly plotted and ruthlessly bloodthirsty, this is an impressive return to form for the X-Men franchise.",
      "author": "Wendy Ide"
    },
    {
      "text": "It's the heartfelt performance by Jackman that keeps this last Logan superhero film on the right track.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Elegiac conclusion to Wolverine's solo trilogy...",
      "author": "Susan Granger"
    },
    {
      "text": "On this rich and emotionally satisfying evidence, lower budget, intimate and psychological takes on the incredible just might be the way forward.",
      "author": "Ed Whitfield"
    },
    {
      "text": "\"Owing to its agitated hero's misfortunes through the ages, this is a film that's acutely aware of the dangers of emotional exploitation, and it spares its audience a similar fate.\"",
      "author": "Fiona Williams"
    },
    {
      "text": "The Dark Knight of the X-Men film universe.",
      "author": "Matt Neal"
    },
    {
      "text": "Gives Hugh Jackman's Wolfie a smoothly-executed but hard-R sendoff that arguably represents the high point of the actor's nearly two-decade run in the role.",
      "author": "Frank Swietek"
    },
    {
      "text": "Drawing from the pages of comics written in 2008 and 2009, Mangold and his team have created a script that more about human connection than silly, over-the-top fighting.",
      "author": "Matthew Toomey"
    },
    {
      "text": "The morose nihilism and all-around joylessness come to stink of adolescent posturing. This \"comic book movie for adults\" feels like one of the genre's most juvenile entries.",
      "author": "Sean Burns"
    },
    {
      "text": "Stripped of their pen and ink testosterone, we can see them as human. It's not as sexy as ripped muscles and lycra tights, but it's as real as the genre can get without sacrificing our inner child on the cold altar of hard facts and undeniable mortality.",
      "author": "Katherine Monk"
    },
    {
      "text": "...eschews invincibility in favor of human frailty.",
      "author": "Josh Larsen"
    },
    {
      "text": "There's much to like in Logan, despite the bumpy landing. It reminds us that comic book franchises can aspire to deeper emotions and more complex relationships.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "The best adaptation ever made of the X-Men universe and the best Wolverine film. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "A great action film, hard but penetrable, rigid but anti-static, violent but entertaning. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Jackman's solemn performance matches perfectly with the surprises Mangold has in store during the emotional and action-packed farewell to an iconic hero.",
      "author": "John Urbancich"
    },
    {
      "text": "Jackman gives Logan a withering rage that seems heartfelt, not hammy; Stewart is touching in his enraged befuddlement; and Keen, who resembles here what Katie Holmes might look like if she were Carrie, has a feral intensity.",
      "author": "Peter Rainer"
    },
    {
      "text": "Whenever the filmmakers have a choice between cruelly slaughtering characters and letting them live, they almost always choose the cruel path.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "[Director] Mangold drags [Wolverine] - much older, if not much wiser - into a Western, and ends up with the best superhero movie in recent memory.",
      "author": "Matthew Lickona"
    },
    {
      "text": "When is the last time you walked out of a superhero film and was just speechless?",
      "author": "Gabi Zietsman"
    },
    {
      "text": "With Logan, Fox has cornered the market on R-rated superhero movies, following Deadpool with another adults-only comic-book flick. (Your move, DC.)",
      "author": "Annlee Ellingson"
    },
    {
      "text": "Mangold gives us a lean, focused story that doesn't involve any convoluted plots about evil global plans. Instead it's an elegiac tale about a man coming to terms with his life.",
      "author": "Beth Accomando"
    },
    {
      "text": "Logan gets its strength from its heartpounding action scenes and its heart-breaking personal moments.",
      "author": "Rick Bentley"
    },
    {
      "text": "A down-to-earth title for a movie that holsters comic book camp and draws instead on classic Westerns.",
      "author": "Sharon Eberson"
    },
    {
      "text": "If the previous films focussed on Wolverine's superior healing abilities and fighting skills, Mangold has finally cracked the code with the third film -- it's the humane side of Wolverine/Logan that was always the most interesting thing about him.",
      "author": "Aakash Karkare"
    },
    {
      "text": "Logan does go defiantly against the grain by favouring melancholic mood and themes of mortality and deterioration over inflated, end-of-the-world stakes or grandiose action pyrotechnics.",
      "author": "Jessica Kiang"
    },
    {
      "text": "Did I get closure? No! I don't think I could ever say goodbye to Wolverine and Jackman (sorry, I can't separate the two).",
      "author": "Debashine Thangevelo"
    },
    {
      "text": "Logan's superb depiction of sorrow, of deadening dejection, of the awareness of mortality on multiple planes, rises far above Mangold's ready embrace of influence.",
      "author": "Ray Pride"
    },
    {
      "text": "In the way it explores the inescapable nature of violence and its long-term effects, Logan is the Unforgiven of superhero cinema.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Dark, darkly funny farewell to the Wolverine. Stewart steals scenes left and right. Caliban and the kid are terrific. Come back, Wolvie.",
      "author": "James Verniere"
    },
    {
      "text": "This is one of the finest comics-to-screen adaptations ever.",
      "author": "Rashid Irani"
    },
    {
      "text": "This isn't just a great comic book movie, isn't just a superb X-Men adventure, it's a fantastic motion picture, period, and Mangold, Jackman and everyone else involved with its creation should be more than proud of what it is they've accomplished.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Fans of Marvel, X-Men, and the Wolverine character should be pleased with Logan-it's a strong finale and arguably the best in this highly uneven spin-off series.",
      "author": "Leonard Maltin"
    },
    {
      "text": "The result is easily the most varied, earnest and interesting take on a comic book character since The Dark Knight.",
      "author": "Andy Hoglund"
    },
    {
      "text": "[Logan is] really just another exercise in violence featuring Logan's adamantium claws - a trait shared with teenage Laura (Dafne Keen) in overblown action scenes that recall the sickeningly sadistic kiddie assassin movie Kick-Ass.",
      "author": "Armond White"
    },
    {
      "text": "No doubt, a reboot is on the way for the X-Men franchise, and the Wolverine character in particular, but make no mistake, Jackman has left big boots to fill and an indelible impression where X marks the spot.",
      "author": "Jeremy Aspinall"
    },
    {
      "text": "Jackman is, once more, superb, holding down the whole film: no matter how battered, gnarled and shrubby he looks, you always root for him. A bit of a beast - but our beast.",
      "author": "David Sexton"
    },
    {
      "text": "A film that, maybe more than anything else, showcases what a fine actor Jackman is. He gives a performance of genuine depth and poignancy.",
      "author": "Brian Viner"
    },
    {
      "text": "Logan establishes a new beachhead in comic book cinema wars, somewhere between hectic Avengers spectacle and Deadpool irreverence, a somberness that Batman and Superman haven't mastered.",
      "author": "Steve Persall"
    },
    {
      "text": "While Logan finds a mature tone to carry this final chapter of Wolverine's story, it doesn't come to a conclusion with any more meaning to it than this: People, in general, don't change; more violence will be necessary.",
      "author": "Michael Smith"
    },
    {
      "text": "Well, they are sure sending Wolverine out in style. And a big, oozing blaze of glory.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Raising the stakes on superhero movies by a significant margin, \"Logan\" could be the cinematic equivalent to Frank Miller's legendary comic book \"The Dark Knight Returns.\"",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Logan elevates itself from a superb superhero film to a superb film, period, one that all superhero films to come should strive to emulate.",
      "author": "Kanin Srimaneekulroj"
    },
    {
      "text": "Hugh Jackman goes out in R-rated style with Logan.Just don't buy into the 'Best Superhero Movie Ever' hype. Not even close.",
      "author": "Christian Toto"
    },
    {
      "text": "There will doubtlessly be other superhero movies to follow this sort of tragic trajectory, but they won't have the luxury of utilizing an actor we've been watching for nearly two decades in the role, finally closing it out his way.",
      "author": "Piers Marchant"
    },
    {
      "text": "Simply put, \"Logan\" is arguably the best \"X-Men\" movie of the bunch. (Full Content Review for Parents - Violence, Profanity, Nudity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Logan is a fine example of the superhero film where fantasy is tame and reality is wild.",
      "author": "Stephen Romei"
    },
    {
      "text": "It's the Wolverine movie some fans have been waiting for for nearly two decades.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "Credit where it's due: this is a grown-up movie that's a drama first and superhero story second. Maybe you shouldn't give points for effort, but maybe you should when you're talking about a subset of films as locked-in to their formulas as these.",
      "author": "Jason Bailey"
    },
    {
      "text": "For those who want to see their superheroes grow up, Logan is a satisfying vision of what that real-world mutant would be.",
      "author": "Kirk Baird"
    },
    {
      "text": "Hugh Jackman and Patrick Stewart take the opportunity to go into far more depth and weight to characters they have played umpteen times over the past two decades.",
      "author": "Phil Villarreal"
    },
    {
      "text": "\"Logan\" is one heck of a movie, easily rating as the best X-Men-related movie to come along.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Jackman twists the pain at the centre of the hero's struggle into remarkably uncomfortable places for a blockbuster.",
      "author": "Barry Hertz"
    },
    {
      "text": "While there are action sequences, the quiet moments work best . One gets a \"Shawshank\" vibe as the men longingly look into one another's eyes expressing platonic love as only two original X-Men can. Yes, fanboy, this movie is for you, and count me in.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "The picture sounds a deep human note that might be what you'll remember most fondly when looking back on it.",
      "author": "Kurt Loder"
    },
    {
      "text": "Jackman's performance is Clint Eastwood-esque, and the lines in Jackman's face tell the story of his worn character; he plays Wolverine as a man at the end of his line, adding at least a decade to his 48 years.",
      "author": "Adam Graham"
    },
    {
      "text": "The film pulls out all the stops to deliver an emotionally and viscerally satisfying experience. It works so well it easily qualifies as the best movie of the entire X-Men franchise as well as one of the best in the increasingly tired superhero genre.",
      "author": "Jim Schembri"
    },
    {
      "text": "A fitting finale for Jackman that sometimes falters in its urge to please.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Combining these two blade runners, working side by side, is a recipe for stunts, special effects, and big box office.",
      "author": "Steve Crum"
    },
    {
      "text": "Logan is not a superhero movie. It's a neo-western with a tragic, reluctant anti-hero",
      "author": "Willie Waffle"
    },
    {
      "text": "It is uncompromising in its brutality and fearless in its reverence of these iconic characters. It's a testament to the power of storytelling, and what creative freedom can produce. Goodbye bub. You've changed superhero movies forever.",
      "author": "Rohan Naahar"
    },
    {
      "text": "The best superhero movie ever is more about the curse of super powers than super powers. Maybe that's why it's the best superhero movie ever.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Nobody needs to call Logan a masterpiece. But it's heartening to see a blockbuster-minded movie this well made, one that ticks all its genre boxes and delivers a potent emotional punch.",
      "author": "Robert Horton"
    },
    {
      "text": "I can't think of another superhero film where the main subject is the heroes getting old and losing their powers, nor of one that opens with their world apparently coming to an end.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Logan is as understated a masterpiece as there's ever been, delivering the Wolverine film we've all been waiting for, and if this truly is Hugh Jackman's final time playing him, he has definitely left the series on a high note.",
      "author": "Ryan Pollard"
    },
    {
      "text": "Well-made and thoughtful, and it pays off so splendidly in the final fifteen minutes one wishes what preceded this climax could have been its equal. Where \"Logan\" leads is inevitable and necessary, but it doesn't make it any easier.",
      "author": "Dustin Putman"
    },
    {
      "text": "A film of rare power and tension in this subgenre and a farewell to the measure of that iconic character called Wolverine. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "It's as if its director, in his effort to be profound, ends up being annoying. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "The bloodiest Marvel movie ever. It's by no means a despicable work, by far the best X-men film. [Full review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "Director James Mangold shoots and orchestrates action with an appreciable clarity, and when he synchs up with the pounding drums of Marco Beltrami's score, the mayhem has a lively intensity.",
      "author": "James Robert Douglas"
    },
    {
      "text": "Logan is a beautiful send-off for the proud, tormented warrior who was so recognizably human underneath his claws.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Slow and depressing, and not in a good way.",
      "author": "Nell Minow"
    },
    {
      "text": "It strikes a sombre, gritty tone from the start to take the audience on a dark and rather brutal road trip. So while it feels rather long and repetitive, the movie also has a strong emotional kick.",
      "author": "Rich Cline"
    },
    {
      "text": "Unlike any other comic book movie made so far, but for all that ambition and gratuitous violence, Logan is a taxing and overindulgent experience.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "With dignity and grace, Jackman says sayonara to this signature role. It's clear how much physicality and humor he passed on to this mashup of comic book action and political allegory, in his portrait of the ronin with six swords.",
      "author": "Richard von Busack"
    },
    {
      "text": "It's not often that a film embedded in a franchise is allowed to break from its shackles to offer something genuinely different... which makes Logan, the final outing for Hugh Jackman's Wolverine, even more remarkable.",
      "author": "Rob Carnevale"
    },
    {
      "text": "Logan is a superhero movie like no other.",
      "author": "Chris Knight"
    },
    {
      "text": "With its mix of neo-Western and quasi-samurai tropes, Logan isn't just the best X-Men movie in forever; it's one of the best comic-book-sourced movies we've seen in some time.",
      "author": "Joe Gross"
    },
    {
      "text": "Jackman, who first starred as Logan/Wolverine 17 years ago, turns in a great performance. He's clearly relishing the chance to play the character one last time in a project that's not just a good superhero movie, but a good movie, period.",
      "author": "Scott D. Pierce"
    },
    {
      "text": "Finally, 17 years since it all began, we get the payoff.",
      "author": "Kevin Maher"
    },
    {
      "text": "Through one simple, emotionally satisfying revelation late in the movie, Logan argues that stories like this - like the Westerns before them - can be culturally crucial because they give us hope when we need it the most.",
      "author": "Eric Melin"
    },
    {
      "text": "The darkest and arguably the best of the Wolverine adventures is an emotional journey that's marked by bursts of bloody violence.",
      "author": "Roger Tennis"
    },
    {
      "text": "Logan was written by Scott Frank, Mr. Mangold and Michael Green. Their script is the crucial ingredient of this impressive production, a model of ambition, complexity and old-fashioned showmanship that's matched by Mr. Mangold's direction.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The fight scenes are entertainingly brutal, but the consequences are bloody and the emotional stakes high. It's an elegiac superhero movie that understands there's no living with killing.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Ultimately, it's not just a movie for adults because of the death toll, it's one for the grown-ups because it actually engages the emotions. No small feat for a superhero movie.",
      "author": "Tim Evans"
    },
    {
      "text": "Logan, the third Wolverine spinoff from an X-Men movie empire that has grown terribly long in the tooth (or is that claw?), does a nice job of righting the ship with this elegiac closing chapter.",
      "author": "Tom Meek"
    },
    {
      "text": "The only problem with calling it the boldest and most affecting superhero flick in many years is that it's barely a superhero movie at all.",
      "author": "Chris Klimek"
    },
    {
      "text": "The film celebrates the medium by taking itself seriously, with an added hint of apology for the genre's earlier sins. Best of all, there's an element of risk.",
      "author": "Peter Hartlaub"
    },
    {
      "text": "The film is, above all else, a refreshing change of pace from the usual, comic-book superhero fodder. It's melancholy and introspective...",
      "author": "Mark Dujsik"
    },
    {
      "text": "Provides the tough, adult version of Wolverine that fans have been wanting for a long time...",
      "author": "Tony Stamp"
    },
    {
      "text": "Even as the formulaic plotline of government/corporations versus the disenfranchised that X-Men have used for seventeen years now begins to surface, it fails to diminish from the intensity and excitement rampant throughout every scene.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "The startling trick here is to turn Wolverine into a self-destructive and fed-up old man... And director Mangold, incredibly, makes you buy Wolverine's \"where are the mutants of yesteryear\" melancholy.",
      "author": "Jeff Simon"
    },
    {
      "text": "Logan is a family drama, an action thriller and an epic superhero story. If this is indeed Jackman's last Wolverine film, he's going out in heartfelt, high-class style.",
      "author": "Sandy Cohen"
    },
    {
      "text": "Like Rogue One: A Star Wars Story, the flicker of hope Logan offers is so fragile, it's hard to believe it won't be snuffed out... Superhero movies, it seems, can no longer be counted upon as a cinematic escape.",
      "author": "Vicky Roach"
    },
    {
      "text": "Logan is kind of a special superhero movie, in a good way, and if Jackman holds to his stated intention to make it his Wolverine swan song, he's going out not with a whimper but a bang.",
      "author": "Peter Howell"
    },
    {
      "text": "On its own terms, Logan is a crackerjack piece of work: The dialogue is crisp, the staging snappy, and the action scenes really pop.",
      "author": "David Edelstein"
    },
    {
      "text": "The gloomiest and grisliest of the X-Men franchise is expertly crafted in detail but overlong, dreary and dispiriting as a whole.",
      "author": "Jim Lane"
    },
    {
      "text": "For what it is, Logan is strong stuff, and a classy sendoff to Wolverine. Let's just hope that Marvel and Jackman let sleeping wolves lie.",
      "author": "Stephen Rebello"
    },
    {
      "text": "A tale that is as psychically violent as it is physically so, it is a sharp descant to the earlier films in the franchise as it presents a brooding, aging Logan very near the end of his existential rope.",
      "author": "Andrea Chase"
    },
    {
      "text": "Jackman and Stewart are at the top of their game, and Dafne Keen as Laura makes the most of her watchful, silence-laden role.",
      "author": "Rich Heldenfels"
    },
    {
      "text": "Hugh Jackman sharpens his claws in every sense of the word and delivers killer work.",
      "author": "Richard Roeper"
    },
    {
      "text": "For once, a film derived from a Marvel source gives you something solid to hang on to.",
      "author": "Donald Clarke"
    },
    {
      "text": "This is the collapse of the sprawling X-Men family that Wolverine only begrudgingly joined in the first place.",
      "author": "Amy Nicholson"
    },
    {
      "text": "... It boldly blazes its own trail, refusing to be reined in by what has come before.",
      "author": "Greg Maki"
    },
    {
      "text": "Logan offers an element of completion, and an intriguingly different take on the material. It is also, along with the FX series Legion, a sign of the maturation of comics on screen, for better or worse.",
      "author": "Brian Lowry"
    },
    {
      "text": "Director James Mangold, returning after the second installment, The Wolverine, orchestrates several jaw-dropping action sequences, heightened by Jackman's and Keen's intense performances and by Marco Beltrami's taut and plunky score.",
      "author": "Leah Pickett"
    },
    {
      "text": "If this is indeed Jackman's final appearance as Logan, he's going out in style.",
      "author": "Calvin Wilson"
    },
    {
      "text": "In erratic, passionate bursts, I loved Logan, for the tenderness of Wolverine and Xavier's long goodbye to each other, and to us.",
      "author": "Kimberley Jones"
    },
    {
      "text": "\"Logan\" is good enough that you might forget it's a comic-book movie.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Two and a quarter hours of lycanthropic hokum with fun moments.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Jackman and Stewart's fond, easy dynamic helps to balance some very provocative brutality, as the movie pushes Wolverine's berserk nature to graphic new extremes.",
      "author": "Tom Russo"
    },
    {
      "text": "It runs long and has a bit more action than it really needs, but Logan will likely find a spot among the best comic book adaptations to grace a movie theater.",
      "author": "Britton Peele"
    },
    {
      "text": "\"Logan\" is a serious take on the comic-book genre, the Marvel Cinematic Universe in particular, and it's a good one.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "It wants its stand-alone story of Wolverine and Professor Xavier to be taken seriously as authentic drama. And, to a surprising extent, it succeeds.",
      "author": "Kenneth Turan"
    },
    {
      "text": "While the relationship among the central trio is strong, the lengthy plot heads off on too many detours, and the serious tone, while refreshing, gets a bit numbing over time.",
      "author": "Josh Bell"
    },
    {
      "text": "A violent, gritty and soulful tribute to the character behind so much of this franchise's enduring popularity.",
      "author": "Tom Glasson"
    },
    {
      "text": "With his glimpse into what superhero movies can be, James Mangold has given us something sadly lacking in recent genre entries: hope.",
      "author": "James Berardinelli"
    },
    {
      "text": "Logan provides a fitting finale to the Wolverine franchise. It isn't often a Marvel superhero gets to saddle up, tip his hat and ride off into the proverbial sunset.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The finest Marvel film so far since Stan Lee's empire moved into the multiplexes, and it's almost up there with Christopher Nolan's Dark Knight trilogy",
      "author": "John Byrne"
    },
    {
      "text": "The last of Logan is also the best of Logan.",
      "author": "Adam Sweeting"
    },
    {
      "text": "Mangold's direction helps to take this particular genre to another level that is poignant and, at times, tragic.",
      "author": "George M. Thomas"
    },
    {
      "text": "Logan is not really asking us to consider the plight of vulnerable children, it's encouraging us to get off on it.",
      "author": "Gary Thompson"
    },
    {
      "text": "Logan is the violent, brutal and gory R-rated Wolverine movie 40-something fanboys have always wanted. It's most definitely for grown-ups. It's also very, very good.",
      "author": "David Frese"
    },
    {
      "text": "If this really is Jackman's last big-screen adventure as Wolverine, it's an excellent and fitting finale.",
      "author": "Julie Washington"
    },
    {
      "text": "Jackman's performance is likably physical, with Logan on the verge of dying throughout. He takes a ton of punishment.",
      "author": "Paul Byrnes"
    },
    {
      "text": "You don't have to be a comic superhero fan to enjoy this movie -- watch it for the outstanding performances by Jackman, Stewart and Keen. This one's a gripping finale to Wolverine's indomitable journey.",
      "author": "Zeenia Baria"
    },
    {
      "text": "Logan is deadly serious, and while its gamer-style killing sprees are meant to be excitingly brutal, I found them numbing and, in the climax, borderline offensive.",
      "author": "Michael Phillips"
    },
    {
      "text": "This is the Wolverine movie that unlocks the explosive violence that was always inside the Marvel character but, frustratingly, never let out.",
      "author": "John Lui"
    },
    {
      "text": "Of the three Wolverine movies, this is the best. I'm glad I saw it and glad it's over.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Logan makes for a better character study than superhero adventure.",
      "author": "Dann Gire"
    },
    {
      "text": "Jackman, who's always been remarkably human in this superhuman role, is as good as he's ever been at finding the beating heart underneath all that adamantium. I will miss the hell out of him.",
      "author": "Norman Wilner"
    },
    {
      "text": "Despite tonal missteps, a major one serving as the film's transition to the third act, Logan is a thinking man's superhero flick: the best \"gritty\" offering we've had since The Dark Knight Returns.",
      "author": "Walker MacMurdo"
    },
    {
      "text": "Here, at last, was a Wolverine story that felt like the comics I remembered. And not just that: it's a comic-book superhero movie that genuinely pushes the form forward",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "I never thought I'd say this about a superhero movie, but bring a hankie.",
      "author": "Rob Vaux"
    },
    {
      "text": "Overall, this is a surprisingly strong entry in the X-Men canon, radically different where it counts, but always respectfully honouring Wolverine's hard-earned heritage as a character.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It's just as much an arthouse drama, or a prestige picture, as it is a big-budget, action-fantasy movie starring Wolverine. And how many other superhero movies can you say that about?",
      "author": "Germain Lussier"
    },
    {
      "text": "It's difficult to imagine how this could be improved upon. An unmissable treat for comic fans, but a thoroughly enjoyable thriller in its own right.",
      "author": "Matthew Turner"
    },
    {
      "text": "Easily the best entry in the sprawling X-Men franchise, and arguably the best superhero film since The Dark Knight offered a similar sense of refreshing thoughtfulness.",
      "author": "Mike Scott"
    },
    {
      "text": "Logan makes sadism fun!",
      "author": "Damien Straker"
    },
    {
      "text": "Discarding the spandex and playful camaraderie of the X-Men for a grizzled, dustball future where mutants are all but extinct, it is also the series' most nihilistic chapter.",
      "author": "James Marsh"
    },
    {
      "text": "It's Unforgiven, with claws.",
      "author": "Jonathan L. Fischer"
    },
    {
      "text": "The action scenes are visceral and raw, however those are few, far between and spoiled by the trailers. The movie is too small, insular and grim to be completely enjoyable. Worth a watch once, but won't hold up on repeat viewings.",
      "author": "Michelle Alexandria"
    },
    {
      "text": "Easily the best Wolverine film, Logan is violent, vicious and ruthless, but with heart and hope at its center, and probably the best X-Men film. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Logan is the best argument in years for making movies out of comic books.",
      "author": "Daniel Eagan"
    },
    {
      "text": "Don't be put off by the slow beginning. Don't be deterred by Logan's incessant bitterness. At some point the film builds to a thoroughly satisfying ending.",
      "author": "Dwight Brown"
    },
    {
      "text": "Logan deserves praise for its action scenes, delivering R-rated violence with enough blood to feel weighty without being an egregious gore-fest.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "The superhero category has gotten more boring as it's gotten more popular, but \"Logan\" suggests an escape from escapism, a restoration of the human element in blockbusters, a stripped-down return to the feel of 1970s Clint Eastwood pictures.",
      "author": "Kyle Smith"
    },
    {
      "text": "What's special about Logan is that it manages to deliver the visceral goods, all the hardcore Wolverine action its fans could desire, while still functioning as a surprisingly thoughtful, even poignant drama-a terrific movie ...",
      "author": "A.A. Dowd"
    },
    {
      "text": "Just because a comic book flick takes the dirt road less traveled doesn't mean it's a cinematic work of art.",
      "author": "Mara Reinstein"
    },
    {
      "text": "This is the X-Men movie - and the Wolverine - I've been waiting for. Violent, thrilling, funny, heartbreaking; everything's up for grabs and it leaves us breathless. Logan inflicts emotional wounds on the audience, yet keeps us wildly entertained.",
      "author": "Diva Velez"
    },
    {
      "text": "After a while, with all that relentless drudgery and all the maimings, it becomes a bit much.",
      "author": "Will Leitch"
    },
    {
      "text": "Let's cut straight to the chase and not mope around the point. \"Logan\" - the final chapter in the saga of the X-Men's Wolverine - is the best superhero-related movie since \"The Dark Knight\" nearly a decade ago.",
      "author": "Cary Darling"
    },
    {
      "text": "Instead of putting the emphasis on superhero superpowers, Mangold delves deeply into these characters' human-scale vulnerabilities.",
      "author": "Soren Andersen"
    },
    {
      "text": "\"Logan\" synthesises comic book characters into the real world in a way that's only been reached in what Roger Ebert called the \"engrossing tragedy\" of the \"The Dark Knight.\"",
      "author": "Blake Howard"
    },
    {
      "text": "One of the best superhero movies, definitely the best from X-Men. More importantly, the first great film of the year. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "The X-Men series - the entire superhero genre - has never seen a film like Logan before: raw, rageful, tormented, human. Best of the series yet.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Hugh Jackman has been Wolverine for over 17 years, and yet he found a way to deliver a [new] version of the character...in quite possibly the best performance of his career.",
      "author": "Jacqueline Coley"
    },
    {
      "text": "Logan is the rare blockbuster that could be a game-changer. It will certainly change the way we look at other superhero movies and how history judges the entire MCU and DC Universe of films.",
      "author": "Brian Tallerico"
    },
    {
      "text": "When Logan and Laura unleash their furious scythes nothing feels settled or satisfied. The world grinds on, fruitlessly weary and wild.",
      "author": "Anthony Lane"
    },
    {
      "text": "One of next year's nominees for Best Actor must go to Jackman. His Logan is as moving and complex as dramatic characters demand. Boyd Holbrook is a charismatic villain.",
      "author": "Victoria Alexander"
    },
    {
      "text": "Mangold and Jackman bring integrity and ability to an increasingly stale and pandering genre, closing out Jackman's Wolverine with dignity and poise. That's more that most of us can hope for when we're 170-plus years old, right?",
      "author": "Patrick Kolan"
    },
    {
      "text": "This is NOT your father's Wolverine!\"",
      "author": "Michael A. Smith"
    },
    {
      "text": "Logan is not just a great superhero film, it's a great film, period.",
      "author": "Travis Johnson"
    },
    {
      "text": "A bruisingly good elegy",
      "author": "Alison Willmore"
    },
    {
      "text": "A truly affecting and gritty human story.",
      "author": "Amy West"
    },
    {
      "text": "Jackman's is a revelatory performance that paradoxically works as a worthy send-off yet leaves us wishing for more.",
      "author": "Gary Dowell"
    },
    {
      "text": "Legitimate character drama that happens to include bouts of gratuitous murder and mayhem.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "Jackman taps into the darkest elements of the character but never loses the humanity, and if this is his last outing, he's gone out with a perfect, heart-breaking portrayal full of rage and grief.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "It's not a film calculated to be a people-pleaser, but it is an appropriately intense end to a character defined by the tenacity and ferocity of a wolverine.",
      "author": "Jim Vorel"
    },
    {
      "text": "I feel the third act is not nearly as strong as the first two, but the climax is damned near perfect and a great send off for Jackman and the Wolverine character.",
      "author": "Anthony Ray Bench"
    },
    {
      "text": "It doesn't look like a superhero movie, but rather a good \"American\" film, where the important thing is the construction of the internal bonds that are tying the protagonists. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "The poisonous political climate of 2017 and persecution of a 2029 comic book world collide with devastating force.",
      "author": "Matthew Anderson"
    },
    {
      "text": "director James Mangold has wrapped the trilogy with R-rated violence and gore while also giving his protagonist that which has always eluded him...what's so refreshing about \"Logan\" is how divorced it is from the genre that spawned it.",
      "author": "Laura Clifford"
    },
    {
      "text": "Logan is a punch in the gut in all the right ways.",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "Hugh Jackman says goodbye to Wolverine in a more than dignified way and exceeding everyone's expectations. Maybe even his own. [Full review in Spanish]",
      "author": "Carlos Jesús González"
    },
    {
      "text": "A sensational film worthy of having a special place next to titles as 'Unbreakable', 'The Incredibles' and 'The Dark Knight'. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "An interesting meditation on life and death, periodically interrupted by excessive, skin-slashing, bone-snapping ultraviolence.",
      "author": "Brian Orndorf"
    },
    {
      "text": "At the end of the day it's still just a comic book movie bragging about how it's no typical comic book movie. Yes, and?",
      "author": "Matt Prigge"
    },
    {
      "text": "Logan is a dark and thrilling finale for Wolverine. Director James Mangold brings stark realism to the comic genre.",
      "author": "Julian Roman"
    },
    {
      "text": "Mangold has open-heartedly embraced the use of violence, but this is light years away from the tongue-in-cheek gore-fest of Deadpool",
      "author": "Joseph Walsh"
    },
    {
      "text": "It's hard to fathom that we will no longer see the buff Jackman preening with those shiny steel claws, but he is getting older, so I suppose we should let him retire this character from his repertoire.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "There's a good reason to see \"Logan\", and also some good reasons not to see \"Logan\".",
      "author": "David Kaplan"
    },
    {
      "text": "Although it's a \"super-hero movie\", Logan is not about action, but about characters and their relationships. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "It's something no-one could have expected: a creatively risky superhero movie. And it deserves to pay off.",
      "author": "Robbie Collin"
    },
    {
      "text": "Logan is full of juicy surprises. But what impresses most is how, for once, this is a comic-book film that has the guts to wrap things up.",
      "author": "James Mottram"
    },
    {
      "text": "If you're open to seeing a new, previously unknown Wolverine, Logan is going to stay with you for a long time.",
      "author": "Lauren O'Callaghan"
    },
    {
      "text": "Logan is a Marvel movie with a bit of soul and some true grit. Presumed to be the final outing for Wolverine, it plays more like a late period John Wayne western than it does like a conventional superhero film.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Jackman does his usual gruff protagonist as well as expected, but it's other performances that really stand out; mostly notably Stewart -- haggard, vulnerable but never skipping out on his humour.",
      "author": "George Simpson"
    },
    {
      "text": "The best X-Men movie since 2003's X2.",
      "author": "Emily St. James"
    },
    {
      "text": "This is the Wolverine movie fans have always wanted to see; period.",
      "author": "Travis Hopson"
    },
    {
      "text": "The grim side of human nature is all over James Mangold's Logan. But that doesn't necessarily make it a good movie.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "The weight of graphic, grotesque violence hangs over the entire movie. But the daring emotional violence lingers longer, well after the lights go down on the final shot.",
      "author": "Tasha Robinson"
    },
    {
      "text": "When it comes to playing a properly magnetic anti-hero with a gruff '70s-cinema exterior and a dark reservoir of inner depth, Jackman really is the best at what he does.",
      "author": "Dan Jolin"
    },
    {
      "text": "Star Hugh Jackman isn't just giving us the definitive X-Men movie; it could just be the definitive comic book movie.",
      "author": "Mark Daniell"
    },
    {
      "text": "Operatic and also deeply personal, Logan is one of the true great films of the superhero genre, among the best films of 2017 to date, and a rousing send-off for the old guard while ushering in the future of the X-Men franchise.",
      "author": "Mark Hughes"
    },
    {
      "text": "From the very first shot to the very last, every frame feels perfectly rendered and absolutely necessary to the narrative trajectory.",
      "author": "Allyson Johnson"
    },
    {
      "text": "There's a resonant motif in Logan that times have changed for the worst, but this dystopian world revives the humanity in these characters, a development that's all for the best.",
      "author": "Peter Canavese"
    },
    {
      "text": "If you remove the graphic violence, it's not all that different from 'The Wolverine,' with Logan again finding someone to protect after turning his back on life.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Logan is way bloodier than Deadpool, yet still artful in the way The Raid movies turn rhythmic stabbing into a brutal ballet.",
      "author": "Fred Topel"
    },
    {
      "text": "Mangold confidently places the film in the context of a neo-Western, painting Logan and Professor X as two men who have been left behind by the world they once defined.",
      "author": "Matt Goldberg"
    },
    {
      "text": "It's an amazing swan song for the Wolverine character, and for Jackman, and perhaps the best X-Men movie yet.",
      "author": "Scott Collura"
    },
    {
      "text": "Jackman clearly adores the character, and he embraces the chance to essentially reinvent the mutton-chopped slayer for one final hurrah. It's strange to think that this might stand as one of his greatest performances, but so it goes.",
      "author": "David Jenkins"
    },
    {
      "text": "Easily the best Wolverine outing, Logan is The Dark Knight of the mutant-filled X-franchise, a gripping film that transcends the comic-book genre by saying something important ...",
      "author": "Brian Truitt"
    },
    {
      "text": "A rather brilliant mesh of dystopian and superhero tropes that proves to be as entertaining as it is timely.",
      "author": "Rory O'Connor"
    },
    {
      "text": "I'm not speaking hyperbolically when I say that Logan is the best, most exciting X-Men film to have made it to the big screen.",
      "author": "Keisha Hatchett"
    },
    {
      "text": "This is honestly one of the best comic book movies of all time.",
      "author": "Kyle Anderson"
    },
    {
      "text": "\"Logan\" self-consciously aspires to retire the steel-clawed hero with epic grandeur, and the results are often rousingly bleak. And yet, the risks taken only make the formulaic redemption story and cliched emotional underpinnings increasingly frustrating.",
      "author": "Tim Grierson"
    },
    {
      "text": "Mangold gives our grumpy old friend quite a send-off, a blood-drenched stab-a-thon that frequently hits bone.",
      "author": "Richard Lawson"
    },
    {
      "text": "X-Men movie franchise connections aside, Logan is a grisly and somber character drama that sends off Hugh Jackman's Wolverine on a high note.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Logan is a searing, claws-out action drama that hits hard, chews grit and leaves an everlasting impression.",
      "author": "Matt Donato"
    },
    {
      "text": "What Deadpool awakened in audiences a year ago, this thirst for blood, can be credited as paving the way for Logan, which picks up the cause of violence and accelerates it considerably.",
      "author": "Neil Miller"
    },
    {
      "text": "By grounding the film's action, and painting on a relatively small-scale canvas, 'Logan' raises the bar on the types of stories you can tell with superheroes -- thereby redefining what the term Superhero Movie even means in the year 2017.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Seamlessly melding Marvel mythology with Western mythology, James Mangold has crafted an affectingly stripped-down standalone feature, one that draws its strength from Hugh Jackman's nuanced turn as a reluctant, all but dissipated hero.",
      "author": "Sheri Linden"
    },
    {
      "text": "Logan is a forthright, muscular movie which preserves the X-Men's strange, exotic idealism.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "It's both the most violent film in the series and the most sentimental one. When it's not showering you in blood, it's trying to make you spill tears.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "The analog pace and elemental story work for it. Each time the violence explodes, it's slashingly satisfying, because it's earned, and also because Mangold knows just how to stage it.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "The violence in \"Logan\" isn't played for kicks, like it was in \"Deadpool.\" It's grave and serious and sometimes hard to watch, which fits in with the overall tone of this grim, surprisingly downbeat movie.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Logan is the movie that finally satisfies the wish fulfillment of those superhero movie conversations that that speculate on what a hard R-rated superhero movie would look like with a major established character.",
      "author": "Mike Ryan"
    },
    {
      "text": "Perhaps it's just the novelty, but that explicit violence and salty language (Professor X turns out to be quite the potty-mouth as well) adds a bit of much-needed fizz to the Wolverine sub-franchise.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Logan is a great addition to the X-Men films and it should please adult fans of the series.",
      "author": "Scott Chitwood"
    },
    {
      "text": "Hugh Jackman's last Wolverine story ends on a grim, gritty and ultra-violent note that wins points both for being cinematic and for being so different.",
      "author": "Edward Douglas"
    },
    {
      "text": "James Mangold has re-teamed with Jackman for an intense Western that re-introduces the brutish X-Men as a cowboy, wracked with remorse and reckoning with redemption.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Logan is Hugh Jackman's finest work as Wolverine, and a movie full of ambition, emotion, and drama.",
      "author": "Alan Cerny"
    },
    {
      "text": "Hugh Jackman is all growl and gristle, Logan's lovable grouchiness turned to outright rage.",
      "author": "Tom Huddleston"
    },
    {
      "text": "Better as an agitated Western than as a fading superhero movie (or a listless cross-country chase), the most cantankerous X-Man's final outing is a scaled-back affair that nevertheless knows how to swing for the fences.",
      "author": "David Ehrlich"
    },
    {
      "text": "It looks like a small production but really, it feels like the biggest X-Men movie. It has more to say than any other installment. It leads to meaningful conclusions. It is brutal and bold and it shouldn't be missed.",
      "author": "William Bibbiani"
    },
    {
      "text": "Easily the best Wolverine movie.",
      "author": "Matt Singer"
    },
    {
      "text": "The movie fans have been asking for ever since Hugh Jackman first put on his claws.",
      "author": "Chris Bumbray"
    },
    {
      "text": "\"Logan\" is the bleakest vision of Wolverine yet, but also hands down the best treatment the character has received on the big screen in the fifteen plus years Hugh Jackman has inhabited the role.",
      "author": "Kevin Jagernauth"
    },
    {
      "text": "Logan is without question the best superhero movie in years, and certainly the most ambitious one since Christopher Nolan hung up the cape.",
      "author": "David Crow"
    },
    {
      "text": "Logan is a mighty swan song for Hugh Jackman's Wolverine, a tour de force for Patrick Stewart and an amazing debut from young Dafne Keen. Don't bring your kids. Do bring your hankies.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Logan is a total anomaly. James Mangold turns the key on the tawdry, predictable superhero formula, delivering both his best film to date and one of the most game-changing comic book adaptations to ever leave the pages.",
      "author": "Michael Roffman"
    },
    {
      "text": "Brutal, raw & emotionally satisfying. Logan is up there with the best comic book movies ever made.",
      "author": "Jon Lyus"
    },
    {
      "text": "It recognizes that the thinly veiled secret of Wolverine's loner act is that he's always been a cog of some kind.",
      "author": "Jake Cole"
    }
  ],
  "release_year": 2017,
  "duration": 137,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "age_rating": "R",
  "synopsis": "In the near future, a weary Logan (Hugh Jackman) cares for an ailing Professor X (Patrick Stewart) at a remote outpost on the Mexican border. His plan to hide from the outside world gets upended when he meets a young mutant (Dafne Keen) who is very much like him. Logan must now protect the girl and battle the dark forces that want to capture her.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg"
}