{
  "movie_name": "Love, Simon",
  "movie_id": "love_simon",
  "total_reviews": 238,
  "reviews": [
    {
      "text": "A film that reinforces its nature by diving into classics from the eighties by John Hughes for some references and transferring them to the present with an effective soundtrack and a healing message... [Full review in Spanish]",
      "author": "Rolando Gallego"
    },
    {
      "text": "Thanks to director Greg Berlanti and his talented team, Simon gets a great love story and gets to share it with us.",
      "author": "Brian T. Carney"
    },
    {
      "text": "The best thing Love, Simon did for queer media was pave the way for Love, Victor, its superior spinoff series...nevertheless, the latter wouldn’t exist without the former, and for that, I will always hold a soft spot in my heart for Berlanti’s adaptation.",
      "author": "Michael Cuby"
    },
    {
      "text": "A timeless teen comedy that could not be more inclusive, diverse or air-punchingly, smile-inducing saccharine feel-good mulch with heart. And a giant beating heart at that.",
      "author": "Ben Turner"
    },
    {
      "text": "Strolls in confidently like it's been here before, telling a story that's been told plenty of times before, just not like this, and rarely this well.",
      "author": "Kip Mooney"
    },
    {
      "text": "This movie's biggest strength is its heart and emotional moments, both of which are extremely genuine and impactful.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "This LGBTQ-themed teen movie isn't just important; it's also very entertaining.",
      "author": "Nick Levine"
    },
    {
      "text": "Love, Simon works because it feels like a love letter to a specific queer internet borne of staying up late, sweaty and paranoid, on the family computer.",
      "author": "Li Sian Goh"
    },
    {
      "text": "Love, Simon is not only an adorable high school rom-com but also made history as the first major Hollywood studio film about a gay teenage romance.",
      "author": "Nicole Ackman"
    },
    {
      "text": "A romantic comedy drama about an everyday teenager's angst over fitting in and coming out as gay; entertaining, engaging and important.",
      "author": "Alix Turner"
    },
    {
      "text": "Love, Simon isn't just a film for movie lovers: it's a film for everyone.",
      "author": "Dan Buffa"
    },
    {
      "text": "It's fun to see Simon's inner thoughts play out as he tries to connect the dots with each guy.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The story of a teen figuring out his sexuality may provide familiarity but director Greg Berlanti and screenwriters Isaac Aptaker and Elizabeth Berger do attempt to create something unique out of it by subverting cliches within the \"teen movie\" genre.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "It's a film filled to the brim with hopefulness and heart, laughter and love, authenticity, and a sense of wonder at this thing called love.",
      "author": "Richard Propes"
    },
    {
      "text": "There are moments where the dialogue feels entirely inauthentic and calculated, but there are moments where it feels organic -- and luckily, it's in the moments that really count.",
      "author": "Matt Cipolla"
    },
    {
      "text": "While 'Love, Simon' is only one, small glimpse into a diverse and wide-ranging community filled with different stories to tell, it's a good start. And it's something that mainstream audiences need to see more of.",
      "author": "Raffy Ermac"
    },
    {
      "text": "An authentic story about acceptance and friendship. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "On the one hand this is a blandly suburban middle-class mainstream film, but on the other, it has made an effort to have a diverse cast and of course, crucially, it is a major studio release tackling a young gay love story. It's also really enjoyable.",
      "author": "Fiona Underhill"
    },
    {
      "text": "This is a sweet and moving film that is built for all, but I'm guessing it will make a lot of gay teens see the world as a safer, more compassionate place for them.",
      "author": "Steven Prokopy"
    },
    {
      "text": "It was very convoluted.",
      "author": "Avaryl Halley"
    },
    {
      "text": "I had a lot of problems with this movie.",
      "author": "Andrew Galdi"
    },
    {
      "text": "This beguiling romantic comedy offers a fresh take on the familiar premise of a high-schooler trying to fit in.",
      "author": "Andrea Gronvall"
    },
    {
      "text": "At its heart, this is simply a story about love and tolerance and honesty, and told with a perfect dose of each of those things.",
      "author": "Kate Rodger"
    },
    {
      "text": "It's a sincere coming-of-age tale with an accomplished cast that brings teens to life realistically and emotionally.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "The movie is idealistic and corny, but by the end, I was laughing and crying along with it.",
      "author": "Karl Delossantos"
    },
    {
      "text": "What really makes this film a feat of queer cinema is how ordinary it is. It's a love story between two men, but without tragedy and angst, seeming quite radical for how sweet it is.",
      "author": "Amelia Harvey"
    },
    {
      "text": "It is a good romantic comedy, and it is mainly achieved by having a protagonist one can easily connect with. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Love, Simon is a movie that every single parent should watch -- no matter how accepting you are",
      "author": "Tessa Smith"
    },
    {
      "text": "This is a special film, a lovely and deeply human romance with a killer cast and a truly funny and engaging script by Elizabeth Berger and Isaac Aptaker.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Love, Simon usually for better, but occasionally for worse, is indebted to the conventions it's borne out of.",
      "author": "Andrew Kendall"
    },
    {
      "text": "A comedic heartfelt story that is suspenseful, hilarious, engaging, and relevant.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Simply a film that says that everyone, no matter who they love, deserves a love story.",
      "author": "Dan Murrell"
    },
    {
      "text": "A sweet, sincere and attentive film about young love and friendship that passes the Howard Hawks test and deserves a longer shelf life than most teen comedies are allowed these days.",
      "author": "Francis X. Friel"
    },
    {
      "text": "Simon never gives his friends the chance to rally around him, instead tricking them into situations that benefit only him.",
      "author": "Cate Young"
    },
    {
      "text": "A well acted, well written film that will help a lot of young people so I'm a fan.",
      "author": "Rachel Wagner"
    },
    {
      "text": "A welcome step towards all-encompassing cinema. It's not the whole journey, because Simon carries other types of privilege, but that's okay; one film can't represent everybody.",
      "author": "Sophie WIng"
    },
    {
      "text": "Part of what makes Love, Simon remarkable is how, well ... unremarkable it is.",
      "author": "Allen Adams"
    },
    {
      "text": "It's a powerful film but also a truly enjoyable one.",
      "author": "Amanda Greever"
    },
    {
      "text": "Played below my expectations, exclusively delivering the expected as the story develops with a crowd-pleasing, soap opera-ish comportment.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Overall, Love, Simon is a sweet and likable comedy/drama with lovable characters, a truthful if flawed script, a gay protagonist worth cheering for and a huge stepping stone of inclusivity for the LGBT community on film.",
      "author": "Harris Dang"
    },
    {
      "text": "The first studio wide release gay coming of age film tries so hard to get audiences to identify with the main character that he ends up being too ordinary. However, the characters around him are fully developed and help us grow to care about him.",
      "author": "Julia Swift"
    },
    {
      "text": "A pleasantly sweet story about a teen coming out that feels for all the world like many other pleasantly sweet stories about teens.",
      "author": "Tim Stevens"
    },
    {
      "text": "Love, Simon is a fun and surprisingly deep film that sets a new standard for the teen comedy genre while also breaking new ground in its portrayal of coming out.",
      "author": "Kt Schaefer"
    },
    {
      "text": "Love, Simon insists on audiences dropping their preconceived notions of what love is and who it's meant for, reminding us all that being different isn't a bad thing.",
      "author": "Matt Ward"
    },
    {
      "text": "No matter how much mainstream Hollywood talks about inclusion, Love, Simon proves that its primary concern is the status quo.",
      "author": "Armond White"
    },
    {
      "text": "Love, Simon is a leap forward for representation on the screen that is highly entertaining and surely to infuriate many of the most regressive voices within the religious right.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Just the fact this film exists in the first place is something we need to celebrate, even if the end result is a little too safe.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A teen drama for this generation.",
      "author": "Grethe Kemp"
    },
    {
      "text": "A joy to watch and will have you beaming by the conclusion.",
      "author": "Matt Hudson"
    },
    {
      "text": "Love, Simon harbors no creatives of color behind the camera, yet Greg Berlanti and writers Isaac Aptaker and Elizabeth Berger succeed in tapping their powers of empathy to portray non-white characters with depth.",
      "author": "Li Lai"
    },
    {
      "text": "A hopeful and positive film like this, while playing it safe on the surface, actually can do a whole world of good, and for that, its importance is self-evident. This is cinema that people will owe their lives to.",
      "author": "Tomas Trussow"
    },
    {
      "text": "It's inescapably conventional filmmaking, with a crowd pleasing narrative that's as charming, heartwarming and predictable as you'd expect. And yet, I found myself getting won over by it regardless.",
      "author": "Alistair Ryder"
    },
    {
      "text": "Without making a fuss as a ham-fisted issues film, this is a quietly important Hollywood movie that should hopefully lead the way for more diverse mainstream stories to come.",
      "author": "Ross Miller"
    },
    {
      "text": "Love, Simon is rife with cliché, which isn't exactly a bad thing considering the film uses the clichés to drive a more progressive point.",
      "author": "Oggs Cruz"
    },
    {
      "text": "The message is equality and acceptance and it comes through by refusing to conform to archaic ideas of what a gay man should be.",
      "author": "Jared Mobarak"
    },
    {
      "text": "While not necessarily queer cinema's most revelatory offering, Love, Simon is more charming than anticipated, with some truly heartwarming moments.",
      "author": "Amanda Jane Robinson"
    },
    {
      "text": "Love, Simon is a breath of fresh air in so many ways.",
      "author": "Terence Johnson"
    },
    {
      "text": "He's smart and sincere as the closeted, gay teen protagonist who just wants to find love and come out on his own terms. As an actor, Robinson could be the next Ansel Elgort.",
      "author": "Glynis Costin"
    },
    {
      "text": "A revolutionary teenage comedy that works for both moviegoers and people of the LGBTQ community-and boasts an outstanding star-turning performance by Nick Robinson.",
      "author": "Rendy Jones"
    },
    {
      "text": "In a world of depression and negativity, this is a fun, optimistic and positive film. It is an emotional, feel-good movie with a solid message. Be who you are. Love yourself.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "Boasted by great performances, emotionally effective story beats, and an overall heartwarming nature, Love, Simon will make you cry and cheer by the end.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "It's a sweet high school romantic comedy with a blue ribbon pedigree for the genre.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "This film successfully does what it sets out to do: Be a great love story.",
      "author": "Ferdosa Abdi"
    },
    {
      "text": "...this movie is just as important as \"Black Panther\" or \"Wonder Woman\" in that it shows a true hero, the likes of which we don't see all that often on the big-screen.",
      "author": "Tom Santilli"
    },
    {
      "text": "While it may be a Gen-Z era coming out story, it easily resonates for older generations.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Director Greg Berlanti does a great job of balancing the tone of the film with a coming-of-age film. This film is funny, heartbreaking, enduring and a really does move along at a great pace.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "Love, Simon takes this mission to a new neighborhood, aiming to occupy a space so long understood, from both sides of the equation, to have no room for queer stories.",
      "author": "Michael Arbeiter"
    },
    {
      "text": "Loving a stranger is not fully convincing... but it is better than most high school movies. [Full Review in Spanish]",
      "author": "Francisco Marinero"
    },
    {
      "text": "Love, Simon is one of those rare works in which its conventional aspects play to its favor due to the fact that its greatest virtue is normalizing the homosexual protagonist. [Full Review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "The fresh and witty script by Isaac Aptaker and Elizabeth Berger seems like a contemporary heir to those eighties initiatory comedies that John Hughes dominated so well. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "It provides laughter, emotion and just the right dose of reality. [Full Review in Spanish]",
      "author": "Antonio Trashorras"
    },
    {
      "text": "Simon is the best gay protagonist that [a] post-Hughes teen comedy could give us. [Full review in Spanish]",
      "author": "Janire Zurbano"
    },
    {
      "text": "Love, Simon succeeds best when it's letting its teen characters - particularly these teen characters - sprawl out... The cast is full of promising young performers.",
      "author": "Joe Reid"
    },
    {
      "text": "The constant wondering, the yearning for a connection, the endless comparing of your own experience to what you're observing, the quest to find someone, anyone who understands what you're going through-Love, Simon nails all of this.",
      "author": "Rich Juzwiak"
    },
    {
      "text": "The only sad thing about this film is that it has to break taboos in the first place in this increasingly conservative society... [Full Review in Spanish]",
      "author": "Marcos Gandía"
    },
    {
      "text": "I've heard this film described as a \"John Hughes\" - type film. Barely. Though Hughes did spend a lot of his time writing about teenagers, their problems and how they dealt with them, his characters were a hell of a lot more believable.",
      "author": "Michael A. Smith"
    },
    {
      "text": "A film that will connect with the public... [Full Review in Spanish]",
      "author": "Lucero Calderón"
    },
    {
      "text": "A gentle and emotional movie; frequently hilarious and consistently honest. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "It has the spirit of a classic, John Hughes film from the eighties, but imprinted with the new millennium. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "A charming, witty and wholly generic high school romcom, the film succeeds thanks to its smart script and sympathetic performances.",
      "author": "James Marsh"
    },
    {
      "text": "There's no questioning the sincerity or the worthy pro-tolerance sentiments of Love, Simon...but, whoa, does this film brim with bad direction.",
      "author": "Jim Schembri"
    },
    {
      "text": "Maybe it's a familiar formula, but it works on multiple levels. [Full Review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "...a somewhat erratic drama that nevertheless packs a punch at several key moments.",
      "author": "David Nusair"
    },
    {
      "text": "Love, Simon is sweet, relatable and funny. It's witty and accessible, and also conventional and very normal.",
      "author": "Roe McDermott"
    },
    {
      "text": "It's a funny movie, but not an uproarious one. It's not overstated or understated, but clearly and honestly stated, and anchored by strong performances from its young cast.",
      "author": "John Serba"
    },
    {
      "text": "Robinson adeptly manages to capture the anxiety of being a gay teenager with even more dexterity than Timothée Chalamet in Call Me By Your Name.",
      "author": "Teo van den Broeke"
    },
    {
      "text": "Simple and bland. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "It probably won't be nominated for awards, but surely it will become a classic among teens. [Full Review in Spanish]",
      "author": "Rafael Rosales Santos"
    },
    {
      "text": "This movie has this same charisma and intelligent comedy as the Hughes films. [Full review in Spanish]",
      "author": "Amanda Adame"
    },
    {
      "text": "The film is a landmark in LGBTQ representation, but succeeds on its own merits.",
      "author": "Tara Brady"
    },
    {
      "text": "The most remarkable thing about Love, Simon is how comfortable it feels with just being what it is: an ordinary teen romantic comedy. And yet, it feels so very special. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "The mainstream rom-com genre is vanilla to the core. Love Simon isn't interested in changing the formula, it's just throwing rainbow sprinkles on top.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "A must-see romantic comedy that evokes the late John Hughes but traces its own path of inclusion, maturity and self discovery. -[Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Indeed, this is where Love, Simon succeeds; in telling a small story about how hard it can be to declare who you are and who you want to be.",
      "author": "Jay Bamber"
    },
    {
      "text": "Sweet and moving as it often manages to be, the film is comfortingly average, in its way - the point of it not to stand out, but fit in.",
      "author": "Tim Robey"
    },
    {
      "text": "The film captures, as do the Hughes films it nakedly wants to be, something pleasantly casual about the rhythms of teenage life.",
      "author": "Tim Brayton"
    },
    {
      "text": "When this film works... it works! It does a skillful job capturing the mindset of a teenager coming to grips with his sexuality.",
      "author": "Matthew Toomey"
    },
    {
      "text": "This tale of a teenager coming out is at once old fashioned and cutting edge.",
      "author": "Alison Rowat"
    },
    {
      "text": "A fresh take on the teen rom-com, this film harks back to vintage John Hughes movies with its smart, self-aware characters and realistic situations that are both amusing and thoughtful.",
      "author": "Rich Cline"
    },
    {
      "text": "An instant classic for the high school teen romantic comedy genre. Funny, charming and impactful. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Love, Simon is filled with love and recognition as it takes the high school rom-com template into new Hollywood territory, and it charms in the process.",
      "author": "Sarah Ward"
    },
    {
      "text": "Thankfully, it's nicely made... well acted, as funny as it is gently moving, and genuinely intriguing, as we watch Simon respond to online posts by the mysterious 'Blue', who admits that he is gay but won't reveal his identity.",
      "author": "Matthew Bond"
    },
    {
      "text": "The plot has a few glitches, but generally the film is funny, sweet and thoughtful.",
      "author": "Edward Porter"
    },
    {
      "text": "It sticks to the rules of its genre, right down to the cloying music and obligatory schmaltzy climax, and uses them to demonstrate a truth that should be obvious: all love stories are essentially the same.",
      "author": "Paul Whitington"
    },
    {
      "text": "It's highly unlikely you'll read a review of this film that doesn't contain the word \"adorable\". It's equally unlikely that you'll be able to watch it without grinning from ear to ear.",
      "author": "Wendy Ide"
    },
    {
      "text": "The high school teen romcom is reborn for 2018. Funny, sentimental and smart: John Hughes would be proud.",
      "author": "Terri White"
    },
    {
      "text": "Despite...strangely misjudged moments, Love, Simon succeeds in navigating most of the pitfalls of the gay coming-of-age narrative and is ultimately moving and genuine.",
      "author": "Elena Lazic"
    },
    {
      "text": "It's more like a John Hughes film than a Sundance circuit piece, squarely in the middle, just like Simon. That doesn't make it any less special.",
      "author": "Tara Thorne"
    },
    {
      "text": "A sweetly old-fashioned romance about a young man who falls in love over email... with another young man. Tender, funny, sometimes heartbreaking, enormously human and honest.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Why did we have to wait until 2018 to see a funny, big-hearted drama on this important topic?",
      "author": "Grant Rollings"
    },
    {
      "text": "Accessible and inclusive, this is a major pop-culture breakthrough, offering authentic validation for LGBT teens, worthwhile insights for hetero viewers, and crowd-pleasing entertainment for everyone.",
      "author": "Trevor Johnston"
    },
    {
      "text": "Love, Simon is sweet, funny and immensely likeable and should persuade even the hardest heart that everyone deserves a great love story.",
      "author": "Allan Hunter"
    },
    {
      "text": "Robinson is an immensely engaging lead, and Simon's tricky predicament, while rendered rather simplistically at times, rings true.",
      "author": "Brian Viner"
    },
    {
      "text": "How heartening that a mainstream studio flick could have a gay protagonist. How disappointing that said flick is as twee and anodyne as this.",
      "author": "Ed Potton"
    },
    {
      "text": "Love, Simon - I really did.",
      "author": "Josh Withey"
    },
    {
      "text": "Often funny in a decidedly wry and even dark fashion, this isn't sexually explicit but instead proves to be more about the pain and uncertainty of coming-out at a time when people think they're so accepting - but aren't really.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Wisely, [Greg] Berlanti leaves A-listers Jennifer Garner and Josh Duhamel in the background for most of the film and allows his young cast to carry the film in style - even though the ending is all a little too neatly wrapped.",
      "author": "Harry Guerin"
    },
    {
      "text": "An uneven but ultimately winning coming-out story. It's one of those films where I can point out lots of flaws but then of them especially bother me",
      "author": "Stephen Silver"
    },
    {
      "text": "With its sheer warmth, openness, likability and idealism, Love, Simon won me over.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "With a modern soundtrack and a diverse cast, Love, Simon is the kind of movie many people wish they had growing up.",
      "author": "Laurence Lerman"
    },
    {
      "text": "Sweet, funny and touching.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Simon's fears, feelings, relationships and traumas are all real and feel true, and are portrayed in an entertaining, infectious and charming way.",
      "author": "Jo Berry"
    },
    {
      "text": "Beneath the glossy visuals and the power-pop soundtrack there's something quietly radical about Love, Simon.",
      "author": "Jamie Dunn"
    },
    {
      "text": "Pure magic.",
      "author": "J. Olson"
    },
    {
      "text": "Far too many contemporary teen comedies anoint themselves as 'Hughes-ian', desperate to align...with the smart, sweet, insightful teen movies of the genre's golden years, the 80s. Finally, a film earns the accolade.",
      "author": "Simon Foster"
    },
    {
      "text": "Simon and his friends are likeable kids and their romantic problems are affectionately explored.",
      "author": "David Stratton"
    },
    {
      "text": "You'll 'Love, Simon.'",
      "author": "Linda Cook"
    },
    {
      "text": "Simply by being a typical, if entertaining, high school movie, it may be making its most important statement of all.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "As a sociological milestone, this is not quite in the Black Panther class, but the difference lies only in the size of the film's financial ambitions.",
      "author": "Sandra Hall"
    },
    {
      "text": "Like Me and Earl and the Dying Girl, The Edge of Seventeen and Easy A, Love, Simon is proof that there is still plenty of life, fun and intelligent storytelling to be had in the high school movie genre.",
      "author": "James Croot"
    },
    {
      "text": "While it is not a work that will change the world, Love, Simon will indeed mean the world to any viewers living through the same trials, tribulations and unnecessarily solitary soul-searching as its teen protagonist.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "By adhering to coming-of-age formula and relying on plot contrivances, it downplays the internal struggles of its closeted protagonist, and thus reduces the emotional impact.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Love Simon is up there with your first kiss or first pancake on a Saturday morning; it's not perfect, but it's still sweet as hell.",
      "author": "Amelia Navascues"
    },
    {
      "text": "Love, Simon is an earnest coming-of-age story, gentle and generous, with a captivating performance from Nick Robinson as the titular Simon.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "It's a terrific movie with a great, star-making performance by Nick Robinson.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "As bland as vanilla pudding. But unless you're completely vanilla-phobic, the movie's unforced good feelings are easy to enjoy.",
      "author": "Robert Horton"
    },
    {
      "text": "Abundantly heartfelt and consistently funny, Love, Simon has a unique place in the canon of LGBTQ cinema, in part for how sweetly ordinary this coming-out story plays out. Oh, and the fact that it's a slick, big studio release.",
      "author": "Brad Keefe"
    },
    {
      "text": "Love, Simon is extraordinary in a very ordinary way.",
      "author": "Sarah Marrs"
    },
    {
      "text": "This is a film that believes everyone deserves a sweet, sappy movie love story, especially people who are often denied them.",
      "author": "Abby Olcese"
    },
    {
      "text": "The film is as sweet as bubble-gum-flavored medicine; it arrives as if without cinematic lineage-unburdened by cinema's history of equating gayness with death. It just stops short of producing a picture of gay attraction.",
      "author": "Doreen St. Felix"
    },
    {
      "text": "Love, Simon does ultimately succeed at making a gay coming-of-age film broadly accessible, but hopefully we'll get more nuanced takes going forward.",
      "author": "Emily Wheeler"
    },
    {
      "text": "How nice it is to see that representation is presented as so normal.",
      "author": "Karen Han"
    },
    {
      "text": "Love, Simon is a charming and affecting movie that has one foot planted firmly in the past while pushing this genre into the new millennium",
      "author": "Juanma Fernández París"
    },
    {
      "text": "It's too sanded down to ever truly snag on something like a real, specific, visceral emotion, but it's got the pop-chorus bombast that will get you to some kind of objective sense of fireworks, one way or another.",
      "author": "Emily Yoshida"
    },
    {
      "text": "Sweetly sincere and sensitive, it's a timely, yet different coming-of-age story.",
      "author": "Susan Granger"
    },
    {
      "text": "One of my favorites of the year so far, without a doubt.",
      "author": "Mark Ellis"
    },
    {
      "text": "A really effective coming-of-age movie that I adored...this movie can and will connect with anyone who has been searching for love, particularly in high school.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "... it's good that Love, Simon is as accomplished and likable as it is.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Unless you don't buy into Jennifer Garner (from those dreadful 'what's in your wallet?' commercials), portraying a former valedictorian mom, 'Simon' likely will grab you from the get-go.",
      "author": "John Urbancich"
    },
    {
      "text": "Thanks to a dynamic, emotionally astute script from Berger and Aptaker, that coupled with Berlanti's unobtrusive direction helps make this movie an agreeable revelation I likely couldn't have resisted even if I had wanted to.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "As a piece of filmmaking craft, it's competent, if unremarkable...if Love, Simon helps even one gay teen come to terms with their sexuality, in the friendly confines of familiar movie formulas, hey, it was probably worth it.",
      "author": "Emily St. James"
    },
    {
      "text": "While things get a bit Dawson's Creek-y at times, director Greg Berlanti never allows the narrative's melodrama to overtake the more significant themes that make a film like Love, Simon a milestone for mainstream gay movies.",
      "author": "Kiko Martinez"
    },
    {
      "text": "An engaging, entertaining and thought-provoking film. (Full Content Review for Parents - Profanity, Sexual Content, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "It's a premise that understands a the key takeaways of the closet, which is that sexuality is a valuable piece of intel. It's also a nice springboard for a few valuable life lessons about friendship and integrity, and a handful of strong performances.",
      "author": "K. Austin Collins"
    },
    {
      "text": "A complex balancing act with a perfectly executed payoff that might not have had the same impact without Robinson's heartwarming breakout performance.",
      "author": "Frank Wilkins"
    },
    {
      "text": "This particular take on a major studio teen comedy is long overdue, but director Greg Berlanti seems intent on keeping his movie attuned to mainstream sensibilities.",
      "author": "Randall King"
    },
    {
      "text": "Greg Berlanti's groundbreaking gay romcom is an exuberant gift, a John Hughes movie for audiences who just got woke and the first mainstream studio release to put a closeted teen front and center.",
      "author": "Peter Travers"
    },
    {
      "text": "As the romantic mystery develops, the light comedy keeps us amused.",
      "author": "Richard Roeper"
    },
    {
      "text": "Every kid out there can determine whether or not they need this film, but each of them absolutely deserves a confection this sweet, thoughtful, and sincere.",
      "author": "Allison Shoemaker"
    },
    {
      "text": "Affecting, lovable romcom about gay teen has a little edge.",
      "author": "Joyce Slaton"
    },
    {
      "text": "The story's lightness is, in a sense, the source of its charm.",
      "author": "Brian Lowry"
    },
    {
      "text": "Love, Simon is an adorable addition to the teen movie canon.",
      "author": "Jenna Dorsi"
    },
    {
      "text": "An overrated John Hughes version of distinctive art house entries Call Me by Your Name and Moonlight.",
      "author": "James Verniere"
    },
    {
      "text": "Love, Simon has a few sad moments as Simon's mistakes come crashing down around him, but mostly it's a sweet, funny, warm-hearted film.",
      "author": "Max Weiss"
    },
    {
      "text": "A little bit sanitized for such a serious subject. Coulda been deeper. Wonderful performances - especially from Nick Robinson - make this one a winner.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Love, Simon is filled with humor-in its characters, dialogue, and situations-but it doesn't sacrifice emotional depth. The two work in tandem.",
      "author": "Sheila O'Malley"
    },
    {
      "text": "Love, Simon succeeds because it rarely plays like grown-ups talking down to viewers.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Love, Simon proves to be a new exception to the rom com genre, bringing Simon's coming out story to life with heart, nuance and the ever-integral message of acceptance.",
      "author": "Gabrielle Bondi"
    },
    {
      "text": "...finely tuned situations and sharp dialogue delivered by a thoroughly charming cast that makes this \"Simon\" something special.",
      "author": "Laura Clifford"
    },
    {
      "text": "It's a warm-but-thin rom-com that isn't particularly noteworthy outside of its trailblazing subject matter. Its heart is in the right place, however, which gives it a light stamp of approval.",
      "author": "Adam Graham"
    },
    {
      "text": "Witty, warm and wise in spite of its contrivances and schmaltz. It's one of the best romantic teen comedies in recent memory. It deserves to become a sleeper hit and a cult classic.",
      "author": "Avi Offer"
    },
    {
      "text": "I can't remember when I've heard an audience respond with cheers and applause as joyous as they did here when the big kiss moment finally arrived.",
      "author": "Nell Minow"
    },
    {
      "text": "As a consumer, it is simply your responsibility to see it, just so that many more Love, Simons can be made.",
      "author": "Chandler Levack"
    },
    {
      "text": "Love, Simon suffers from some of those coming-of-age clichés, but they're certainly worth sitting through in enjoying this journey to adulthood as a whole.",
      "author": "George M. Thomas"
    },
    {
      "text": "Young and old, jocks and nerds, geeks and freaks, and everyone in between should be able to find something to adore in Love, Simon.",
      "author": "Brian Truitt"
    },
    {
      "text": "The movie is enjoyable enough, despite the callow gloss of a 1970s after-school TV special preaching to us about tolerance.",
      "author": "Jim Lane"
    },
    {
      "text": "With a slight adjustment for gender, the lyrics of a classic Gershwin song could sum up the plot of \"Love, Simon.\"",
      "author": "Joe Morgenstern"
    },
    {
      "text": "While the romance elements of Love, Simon will earn it headlines and, perhaps more importantly, butts-in-seats, it's the film's quieter, deeper coming-out storyline that forms its true emotional center.",
      "author": "Glen Weldon"
    },
    {
      "text": "The charming and compassionate Love, Simon feels revolutionary.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It is immediately apparent that \"Love, Simon\" is long overdue.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "...among the best representations of a gay love story depicted on screen.",
      "author": "Travis Hopson"
    },
    {
      "text": "Love, Simon diversifies the canon of gay coming-of-age movies, wherein protagonists are often alienated, and offers an undeniably satisfying, cheesy and often hilarious teen romance.",
      "author": "Chris Knight"
    },
    {
      "text": "The casting is high quality, the script - with a tantalizing mystery at its heart - is particularly well-crafted and the story hits all the right emotional notes in delivering a funny, warm-hearted and life-affirming tale.",
      "author": "Bruce DeMara"
    },
    {
      "text": "The emotional resonance may be surprising given the movie's relentless gloss, but it's real.",
      "author": "Glenn Kenny"
    },
    {
      "text": "It really does get better - at the movies anyway.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "A good-hearted but exceptionally bland 'coming-out-of-age' movie modeled after the John Hughes high school pictures of the eighties.",
      "author": "Frank Swietek"
    },
    {
      "text": "It's undeniably a good thing that it exists, that we have a wide-release movie that treats homosexuality as normal and natural, is about a gay kid, and even directed by a gay man. I just hope that it paves the way for better such movies down the line.",
      "author": "Dan Schindel"
    },
    {
      "text": "\"Love, Simon\" is a sweet, modern romantic comedy that manages to channel the teen movie classics of the late John Hughes, but only the good stuff.",
      "author": "Meredith Goldstein"
    },
    {
      "text": "Doesn't everybody deserve a great love story?",
      "author": "Maren Longbella"
    },
    {
      "text": "Robinson's Simon is a revelation, his hooded eyes suggesting they see a lot more than they let on, while the charismatic Shipp steals all of her scenes as a student with her own demons.",
      "author": "Glenn Sumi"
    },
    {
      "text": "The movie is well-made and likable, without any major missteps. It's also just a little bland.",
      "author": "Mark Jenkins"
    },
    {
      "text": "The movie ... speaks to another, more precious kind of privilege, one that straight kids have had since movies began: the right to a romantic fantasy served up like ice cream, tart and sweet.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "For the most part, this film is as affable and amiable as its title character.... It may wear its good intentions on its sleeve, but this feel-good film has no reason to feel ashamed about doing that.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "Love, Simon is FANTASTIC, and regardless of whether you've read the book, you should see it IMMEDIATELY.",
      "author": "Erik Henriksen"
    },
    {
      "text": "It takes what could have been a teen-movie cliché stacked on top of a coming-out cliché like stale wedding cake and turns them into something that feels fresh, even while not saying anything particularly revelatory.",
      "author": "Cary Darling"
    },
    {
      "text": "There may be little in this movie that you haven't seen before, but the perspective through which you're seeing it can make all the difference.",
      "author": "Justin Chang"
    },
    {
      "text": "This kid makes Ferris Bueller look like a dangerous radical.",
      "author": "Gary Thompson"
    },
    {
      "text": "There's plenty to admire here, and any sort of gentleness at the multiplex is something to be treasured, but it's hard to ignore the film's general unwillingness to confront cruelty.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Fortunately, characters like Simon have \"the character\" to make the right choices.",
      "author": "tt stern-enzi"
    },
    {
      "text": "\"Love, Simon\" exists on a spectrum between \"Lady Bird\" and \"Mean Girls.\" It has the warm winsomeness of \"Lady Bird\" and the crackling humor of \"Mean Girls,\" playing with the high school archetypes that film captured so well.",
      "author": "Katie Walsh"
    },
    {
      "text": "It's an engaging enough film that even a person long out of high school like myself found it amusing.",
      "author": "Al Hoff"
    },
    {
      "text": "This movie simply refuses to \"normalize\" bigotry, hatred and xenophobia. And does it with a kind, understanding and forgiving heart.",
      "author": "Dann Gire"
    },
    {
      "text": "It's cathartic to see stories we can relate to told with a degree of love and compassion that we can hardly imagine.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Nick Robinson crafts an immensely likeable Simon - as appealing as any of the teenage protagonists in a John Hughes comedy.",
      "author": "James Berardinelli"
    },
    {
      "text": "Faults aside, there's something truly revolutionary about this big-screen Romeo and Romeo romance, as Simon courts an anonymous closeted schoolmate he's met online in the hope of one day meeting him.",
      "author": "Steve Davis"
    },
    {
      "text": "It's hard for find fault with any film that addresses a changing teenage world with such compassion and decency. An unexpected delight in more ways than one.",
      "author": "Rex Reed"
    },
    {
      "text": "Though it tells an emotional story about identity and coming out, it's an easygoing movie, glossy and kind and cozily corny. And yet, for me, it was also a fraught experience, both pained and giddy, cheering and dismaying. It's a lot, this little movie.",
      "author": "Richard Lawson"
    },
    {
      "text": "This film treats 17-year-old Simon Spier's quest for love and self-acceptance with the tender, timeless, Hollywood touch of John Hughes: It's a classic story of a first crush made groundbreaking by centering on a closeted gay kid.",
      "author": "Sandy Cohen"
    },
    {
      "text": "The element that keeps \"Love, Simon\" from fully realizing its potential is that it feels like something you'd see on TV. And not on TV in 2018 - TV you'd see in the 1980s.",
      "author": "David Wiegand"
    },
    {
      "text": "If what teens watch on their screens shapes future teen behavior, Love, Simon's utopian society is a gift to the teens of the future who may grow up on it - and to anyone who has to deal with teens.",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "A surefire sleeper hit.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Love, Simon isn't a subtle movie by any means, but it ought to be praised for normalizing something that should have been normal from the start.",
      "author": "Emma Stefansky"
    },
    {
      "text": "How refreshing to see a teen boy on a big screen that's not a sleepy-eyed, monosyllabic jerk just hoping to get laid.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Love, Simon is the kind of movie you could easily catch up with on cable TV years later and forget just as quickly-but even that's a kind of step forward.",
      "author": "David Sims"
    },
    {
      "text": "If this heartwarming teen-oriented bildungsroman is any indication of how Hollywood plans to handle homosexuality in the future, the culture has truly turned a corner in terms of teaching tolerance of sexual preferences.",
      "author": "Kam Williams"
    },
    {
      "text": "The perfect high school movie for 2018.",
      "author": "Fred Topel"
    },
    {
      "text": "The beauty of \"Love, Simon\" is in its astute, slice-of-life observances about family, friendship, and that delicate moment in every LGBTQ person's life when he or she must gather the courage to begin living as their authentic self.",
      "author": "Dustin Putman"
    },
    {
      "text": "This winning comedy about a gay high schooler looking for love hits you right in the heart.",
      "author": "Pete Hammond"
    },
    {
      "text": "Kids like Simon, in 2018, already have a good shot of fitting in. They don't need this movie.",
      "author": "Daniel D'Addario"
    },
    {
      "text": "Love, Simon has the same endearing quality as the John Hughes teen comedy classics of the 1980s.",
      "author": "Kevin Lally"
    },
    {
      "text": "The dialogue didn't feel forced; it was charming, witty and extremely relatable.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "An unapologetically joyous experience, rich with dramatic stakes, but also wickedly funny and intently designed to leave the audience with great feelings leaving the theater.",
      "author": "Leigh Monson"
    },
    {
      "text": "Love, Simon is so full of heart and emotion that you can't help but fall in love with it.",
      "author": "Ashley Menzel"
    },
    {
      "text": "Indie dramas routinely tackle coming-out issues far better; in 2018 there's no reason or excuse for a commercial film to be so unwilling to honestly engage with the sexuality of its protagonist.",
      "author": "Eddie Harrison"
    },
    {
      "text": "Love, Simon is a funny, heartfelt, and truly touching teen romantic comedy that instantly becomes a modern classic for today's generation.",
      "author": "Molly Freeman"
    },
    {
      "text": "\"Love, Simon\" never feels like it exists merely because it should; its endearing charm makes it a film that viewers will watch regardless of its valuable social impact.",
      "author": "Kimber Myers"
    },
    {
      "text": "But Love, Simon's greatest triumph is that it manages to highlight the small ways in which even the most accepting and open-minded among us can make coming out difficult, even in 2018.",
      "author": "Anne Cohen"
    },
    {
      "text": "The film focuses on the one thing it does differently... and it can't be denied that it does make the tired formula feel ever so slightly fresh for having done so.",
      "author": "Dirk Libbey"
    },
    {
      "text": "From a romantic standpoint, the most beautiful aspect of Love, Simon is that through nothing but emails it's believable that these two students could fall for one another; it's not about physical appearances or social status or anything superficial",
      "author": "Robert Kojder"
    },
    {
      "text": "Greg Berlanti's charmingly heartfelt film is a remarkably successful attempt to give shape to the experience of the closet by drawing an incredibly intimate portrait of a teenage boy about to leave it behind.",
      "author": "Richard Larson"
    },
    {
      "text": "Love, Simon is touching as a gesture. As entertainment, it's nothing Degrassi hasn't done better.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "It's too bad that the movie isn't as vibrant, funny, and entertaining as the community it wishes to represent - but it's a start.",
      "author": "Jude Dry"
    },
    {
      "text": "Love, Simon won't be short of critics (and many of them will be adamant that its story is either unimportant or, gasp, amoral) but within its sleek studio skeleton, there's genuine heart.",
      "author": "Benjamin Lee"
    },
    {
      "text": "At a cultural moment when it matters so much for audiences to see themselves represented on screen, \"Love, Simon\" broadens the spectrum to include those who are questioning their sexuality.",
      "author": "Peter Debruge"
    },
    {
      "text": "It's an expertly carved chunk of cheese. But taken on its own, limited terms, Love, Simon is also a charmer - warm, often funny and gently touching, tickling rather than pummeling your tear ducts.",
      "author": "Jon Frosch"
    },
    {
      "text": "Not only would this make John Hughes stand up and cheer, its honesty and tenderness are destined to leave a lasting legacy.",
      "author": "Courtney Howard"
    },
    {
      "text": "There's a place in the culture for adolescent gay kids to enjoy the shiny, shallow coming-of-age stories that their straight peers consume on a daily basis. The first one out of the gate always plays it safe; the trick now is to keep the gate open.",
      "author": "Alonso Duralde"
    },
    {
      "text": "There's something about Love, Simon that feels like a bona fide event...It's a film that we swooned and winced and cringed and grinned through, the journey the best coming-of-age movies take their audiences on.",
      "author": "Kevin Fallon"
    }
  ],
  "release_year": 2018,
  "duration": 110,
  "genres": [
    "Romance",
    "Comedy",
    "Drama",
    "LGBTQ+"
  ],
  "age_rating": "PG-13",
  "synopsis": "Everyone deserves a great love story, but for 17-year-old Simon Spier, it's a little more complicated. He hasn't told his family or friends that he's gay, and he doesn't know the identity of the anonymous classmate that he's fallen for online. Resolving both issues proves hilarious, terrifying and life-changing.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/snIsqVPmlu4LPjvToHpDotxa7Eh.jpg"
}