{
  "movie_name": "Me Before You",
  "movie_id": "me_before_you",
  "total_reviews": 176,
  "reviews": [
    {
      "text": "Ableism as Romance makes disabled partners look like burdens and erasure look like love.",
      "author": "Carrie"
    },
    {
      "text": "The ultimate treatment of the heart of this story leaves us with a more bitter than sweet taste.",
      "author": "Therese Lacson"
    },
    {
      "text": "Sigh. Folks. It's 2016. I mean, seriously. Aren't we past these pathetic stereotypes by now? Can't we move away from these ridiculous disability as tragedy storylines?",
      "author": "Richard Propes"
    },
    {
      "text": "It doesn't have anything interesting to say about its themes or characters - they all exist within a generic and simplified love story.",
      "author": "Allen Almachar"
    },
    {
      "text": "I didn't get it.",
      "author": "Avaryl Halley"
    },
    {
      "text": "I didn't approve of it. I think it's a bad message to be sending.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Through sheer force of charm alone, Claflin puts the audience into his moneyed and manicured corner, to wish him whatever happiness he and his chipper miss can muster.",
      "author": "Leslie Combemale"
    },
    {
      "text": "The necessary dramatic 'crescendo' does not proceed naturally as it should, but in a completely automatic way, following each and every one of established clichés. [Full Review in Spanish]",
      "author": "Alberto Abuín"
    },
    {
      "text": "Sure it looks glossy and has pretty people in it but the message is horrible.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Unfortunately, a handful of quality performances isn't nearly enough to salvage Me Before You.",
      "author": "Allen Adams"
    },
    {
      "text": "The film unintentionally comes off more cynical than romantic. [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "While I expected too much of Me Before You, I still enjoyed it.",
      "author": "Amanda Greever"
    },
    {
      "text": "Me Before You is one of the most refreshing romance movies to hit the big screen in a long while.",
      "author": "Amanda Sink"
    },
    {
      "text": "Although a stereotypical story with type-cast characters, the subjects depict the human experience and appeal to sympathetic audiences and romantics, its simplicity giving it the ability to connect to audiences on a universal level.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "A film adaptation of a much loved book always comes with great expectations, and Shakespearean director Thea Sharrock did not let us down. This is an excellent maiden effort.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Simply put, this is escapism at its worst. But who cares? Some tear ducts are in need of cleaning, and if it takes a possibly offensive and badly directed melodrama to do the job, then let it do it.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Leaving aside the complex issue of assisted dying, one of the film's biggest problems is how much Me Before You shields the audience. For a supposed romance, it's surprisingly prudish.",
      "author": "Eli Glasner"
    },
    {
      "text": "How awful ... the moment you realize that everything about their relationship -- gooey, romantic junk food that it is -- is merely the lead-up to a much grander emotional manipulation.",
      "author": "Megan Basham"
    },
    {
      "text": "You cannot change who people are, but you can accept them for who they are, giving and taking to do everything in your power to make both lives special while they last",
      "author": "Robert Kojder"
    },
    {
      "text": "It is hard to appreciate a narrative that can only skim the surface but then again Emilia and Sam's chemistry makes you buy into their cozy world.",
      "author": "Mohar Basu"
    },
    {
      "text": "Apparently unaware of the old film-acting adage that \"less is more\", she (Emilia Clarke) over-acts from scene-setting beginning to would-be tear-jerking end. Her eyebrows almost deserve a credit of their own.",
      "author": "Matthew Bond"
    },
    {
      "text": "Me Before You is like a two-hour SNL skit parodying a bad romantic drama starring a baby-person and a sociopath.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Hopefully this film will open the door to many more stories that explore-and through increased representation, normalise-having a disability.",
      "author": "Keeva Stratton"
    },
    {
      "text": "It would be useful if the filmmakers allowed Lou (and the viewer) to actually witness some of the crippling pain everyone tells her Will experiences when she's not around to see it, or the courage it takes him to face another day.",
      "author": "Lisa Jensen"
    },
    {
      "text": "It'll give you a good cry.",
      "author": "Abigail Chandler"
    },
    {
      "text": "One day we will perhaps see more films treat physical impairment as a fact of life instead of constant tears and plaintive piano chords. Until then, we're stuck arguing the Kleenex-worthiness of Me Before You.",
      "author": "Andrew Lapin"
    },
    {
      "text": ". . .the ending is coated with such a layer of sugar that it removes us once again from true empathy for both characters.",
      "author": "Brooke Corso"
    },
    {
      "text": "Me Before You the movie, as directed by Thea Sharrock, is better than the book because it dispenses with the idea of understanding anyone's internal motivations.",
      "author": "Haley Mlotek"
    },
    {
      "text": "Solid performances don't balance out the problematic parts of Me Before You, which are many.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Yes, it's very stodgy in places, but its warmth and charm shine through sporadically enough to let you overlook the rough hewn edges and social class connotations. But only just.",
      "author": "Chris Lavery"
    },
    {
      "text": "Another prime example of a film you've already seen even before you've seen it...the film hits home thanks to the key performances by Sam Claflin (Hunger Games) and Emilia Clarke (Game of Thrones).",
      "author": "Jim Schembri"
    },
    {
      "text": "For those who have ever wondered what might happen if the sadistic billionaire Christian Grey broke his back during an acrobatic sex session and ended up in a wheelchair, a new romcom, Me Before You, bizarrely provides the answer.",
      "author": "Camilla Long"
    },
    {
      "text": "An unabashed tearjerker of a movie, but it's been put together with such charm that you probably won't mind the assault on your heartstrings and tear ducts.",
      "author": "Jason Best"
    },
    {
      "text": "Schmaltzy when it should be moving, phoney when it should be sincere, and borderline offensive when it should be thought-provoking, the high-profile rom-com Me Before You is almost a perfect cinematic calamity.",
      "author": "Kevin Maher"
    },
    {
      "text": "Bilious, twee Brit-tedium that tops itself by reducing a disabled man's potential suicide to heartstrings-twanging hokum. What should have died with dignity was this horrid flick, in pre-production.",
      "author": "Brian Gibson"
    },
    {
      "text": "Bring a tissue to this intelligent weeper.",
      "author": "Linda Cook"
    },
    {
      "text": "Me Before You has no interest in the realities of life with disability; it is, rather, yet another variant on a threadbare formula.",
      "author": "Tara Brady"
    },
    {
      "text": "One of those pretty films that fans of the genre will love. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "In other words, if you've ever wanted your romance with a side of disability and chronic pain, Me Before You is perfect for you - as long as you don't actually want a realistic depiction of any of those things.",
      "author": "Aja Romano"
    },
    {
      "text": "Despite offering a relatively engaging storyline, [Me Before You] might as well have been another Nicholas Sparks-inspired sob-fest, thanks to its inescapably sugary and formulaic structure.",
      "author": "Marija Djurovic"
    },
    {
      "text": "I haven't cried in the cinema as much as I did during Me Before You in a long, long time.",
      "author": "Sinead Brennan"
    },
    {
      "text": "The overbearing lack of subtlety and nuance is accentuated by Emilia Clarke's tone-deaf performance - a far cry from her commanding presence in Game of Thrones.",
      "author": "James Marsh"
    },
    {
      "text": "The best thing about this romantic drama is that it takes risks and doesn't play it safe, and also a magnificent and endearing performance by Emilia Clarke. [Full review in Spanish]",
      "author": "Edgardo Reséndiz"
    },
    {
      "text": "A very conventional love story that stands out thanks to the incredible amount of charisma and chemistry between its leads. [Full review in Spanish]",
      "author": "Eduardo Molina"
    },
    {
      "text": "Everything in this film is wrong, it's predictable, feels like a soap opera and the actors are poorly directed. A shame really. [Full review in Spanish]",
      "author": "Alberto Luchini"
    },
    {
      "text": "A chick flick by the book that wastes an opportunity to explore a controversial subject, but makes up for it with the chemistry between the leads and Emilia Clarkes charismatic performance. [Full review in Spanish]",
      "author": "Mariana Fernández"
    },
    {
      "text": "Me Before You might have been a profound movie, but it instead goes for an easy marketing niche, copying a template that has previously proven successful with female moviegoers of a certain age range.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Despite the numerous cliches that plague the feature's first half, this romantic drama has enough charm and warmth to recommend it.",
      "author": "John Hanlon"
    },
    {
      "text": "The best part of the film is Emilia Clarke's performance. [Full review in Spanish]",
      "author": "Horacio Bilbao"
    },
    {
      "text": "It will make you tear up and not because of Emilia Clarke's eyebrows. [Full review in Spanish]",
      "author": "Irene Crespo"
    },
    {
      "text": "The film's objective is accomplished as a fairy tale about the beauty of life and love. [Full review in Spanish]",
      "author": "Natalia Velázquez Luna"
    },
    {
      "text": "A film that will make you laugh and cry with great chemistry between the protagonists, but the ending brings the whole film down a little bit. [Full review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "It's understandable that disabled activists have protested, given that this clumsy English romantic melodrama suggests the loss in quality of life for a quadriplegic is such that euthanasia is the only course of action.",
      "author": "Craig Mathieson"
    },
    {
      "text": "...the film accumulates an emotional momentum that grows more and more difficult to resist...",
      "author": "David Nusair"
    },
    {
      "text": "Emilia Clarke steals this romantic drama. [Full review in Spanish]",
      "author": "Jessica Oliva"
    },
    {
      "text": "The movie delivers and it's much better than you would think from the trailers. [Full review in Spanish]",
      "author": "Oswaldo Betancourt Lozano"
    },
    {
      "text": "If you want to see a bumblebee-stocking-wearing Khaleesi chip away at the prickly exterior of a rich, handsome, wheelchair-bound former banker, here's your movie.",
      "author": "Aaron Yap"
    },
    {
      "text": "Me Before You follows the same narrative as \"disease of the week\" films such as The Intouchables, The Fault in our Stars, and You're Not You -- but in a lovely, British kind of way.",
      "author": "Francesca Rudkin"
    },
    {
      "text": "It's an entertaining enough film, buoyed by the chemistry between good-looking stars Emilia Clarke and Sam Claflin.",
      "author": "Stephen Romei"
    },
    {
      "text": "Me Before You is also to some degree a Serious Issue Film, and it's here that viewers may feel a certain unease.",
      "author": "Jake Wilson"
    },
    {
      "text": "Take me back to before I witnessed the train wreck that is Me Before You.",
      "author": "Amy Wolfe"
    },
    {
      "text": "...surprisingly classy...",
      "author": "Julian Wood"
    },
    {
      "text": "The film's lack of ardour in sufficiently addressing or exploring the nature of Will's immovable despair sends out a garbled message that only insensitively diminishes the value of a disabled life.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Too often, Me Before You dodges the dark complexity of its premise.",
      "author": "Roe McDermott"
    },
    {
      "text": "Fairy tale stuff, yes, but with several redeeming features as well as some darned flaws.",
      "author": "Andrew L. Urban"
    },
    {
      "text": "From tears to laughter, Me Before You is a wonderful weepie that makes you glad you took the trip.",
      "author": "Louise Keller"
    },
    {
      "text": "It's a fairly shallow, formulaic love story -- albeit it one that is slickly told.",
      "author": "Max Weiss"
    },
    {
      "text": "Claflin has a nice chemistry with his leading lady, and there's a good supporting cast (Janet McTeer, Charles Dance, Brendan Coyle) but it's Clarke's show all the way.",
      "author": "Jim Lane"
    },
    {
      "text": "This question of who comes \"before\" is likely unanswerable. In another movie, that might be a grand, provocative notion... But this movie does answer it, makes clear whose before matters.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "Me Before You isn't going to win any awards for sophistication in storytelling or direction, but it tenderly reproduces the book's most iconic scenes, and their tearjerking effect.",
      "author": "Kimberley Jones"
    },
    {
      "text": "This adaptation of Jojo Moyes's best-seller (scripted by the novelist herself) might have the structure of a comfort-food weepie, but it's a rom-com with brains.",
      "author": "Kate Lloyd"
    },
    {
      "text": "Touching but manipulative romantic drama about life, death.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "A Journey of Heart and Humanity",
      "author": "Diana Saenger"
    },
    {
      "text": "Isn't that romantic? No, it's really not.",
      "author": "Alison Willmore"
    },
    {
      "text": "Just because the film manages to evoke a reaction doesn't mean it's good -- just that its actors have done a fine job conveying a connection the script lacked.",
      "author": "Allyson Johnson"
    },
    {
      "text": "All the obvious ingredients are plonked on the table of this adaptation of Jojo Moyes chick-lit bestseller. The result is the dramatic equivalent of an English crumpet drowning in sugary whipped cream.",
      "author": "Hilary A White"
    },
    {
      "text": "Is there anything more frustrating than a movie that wants to make you cry but fails to finish the job?",
      "author": "Eric D. Snider"
    },
    {
      "text": "Rather than truly exploring the outgrowth of a devastating injury or finding out what love and respect means, Me Before You is happy to skip along from one moment to the next.",
      "author": "Josh Lasser"
    },
    {
      "text": "As far as weepy summer romantic dramas go, Me Before You may be a tad more predictable and not quite a three-hankie tearjerker, but it still achieves the requisite feels, buoyed by an effervescent performance from Emilia Clarke.",
      "author": "Kit Bowen"
    },
    {
      "text": "Bittersweet tearjerker, wallowing in the throes of simplistic melodrama.",
      "author": "Susan Granger"
    },
    {
      "text": "It's corny as hell, and pretty tasteless too, ruthlessly building up to its final hashtag hankie moment.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Me Before You is old-fashioned and cosy. It's also part of a highly-charged and very 21st-century debate.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "The stars have to work overtime to compensate for underwritten characters but there are some nice comic moments and the climax is undeniably touching.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "Has an undeniable, if somewhat chintzy charm.",
      "author": "Wendy Ide"
    },
    {
      "text": "\"Me Before You\" is a feast for the eyes, whether our doomed lovers are vacationing in Mauritius or trading banalities in Will's castle quarters. But it's the ugliness of the film's message that a life without limbs is not worth living that galls you.",
      "author": "Al Alexander"
    },
    {
      "text": "I find it astounding that I actually like a film that should have triggered a gag reflex in me.",
      "author": "Robin Clifford"
    },
    {
      "text": "Clarke and Claflin shine in this mostly enjoyable tearjerker, though the filmmakers leave many of the story's most interesting themes and ideas largely unexplored.",
      "author": "Bernard Boo"
    },
    {
      "text": "While the film itself is pretty bearable in parts -- Claflin and Clarke are good, and work well together -- it's all rather pat and manufactured.",
      "author": "Paul Whitington"
    },
    {
      "text": "There are plenty of 'inspirational' speeches and cloying montages, but no real depth or drama. It's also a tad offensive in its handling of the subject of euthanasia and, um, let's be honest, some of the dialogue is unintentionally hilarious.",
      "author": "Chris Wasser"
    },
    {
      "text": "Yet thanks to its two leads, it is a film that should score with its intended audience even if it doesn't get much respect.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Fans of the best-selling novel by Jojo Moyes will be heartened to hear that she wrote the screenplay, too, and that she has preserved all the lines that - when read aloud - will provide much mirth at your next dinner party.",
      "author": "David Edelstein"
    },
    {
      "text": "Clarke will break your heart and help you recognize Daenerys Targaryen is just the beginning for a brilliant actress who's going to have a very long and distinguished career.",
      "author": "David Blaustein"
    },
    {
      "text": "I haven't read the book and would imagine that the material's multiple irritations, both large-scale and small, might be somewhat more tolerable not blown up into celluloid dimensions.",
      "author": "Matt Wolf"
    },
    {
      "text": "Me Before You's reliance on formula prevents it from being as compelling as it could have been.",
      "author": "Chris Agar"
    },
    {
      "text": "Such a wonderfully uncynical movie that it almost doesn't matter that it isn't very good.",
      "author": "David Ehrlich"
    },
    {
      "text": "Claflin plays it straight, and Clarke comes to be the strength of Me Before You, which will make you laugh, it will make you cry, and you'll probably be better for having done both.",
      "author": "Michael Smith"
    },
    {
      "text": "Me Before You is so much more enjoyable than it could have -- and probably should have -- been. Amid the patronizing writing and perfectly timed Ed Sheeran songs are some truly entertaining moments between the leads.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "With the author as screenwriter and a couldn't-be-better teaming of its photogenic star-crossed pair, MB4U should be a bit more polished than it is.",
      "author": "Stephen Schaefer"
    },
    {
      "text": "A first-rate tearjerker in the tradition of The Notebook and Ghost...the movie moves briskly enough to earn its tears without wallowing. It even provides some hearty laughs along the way.",
      "author": "Bill Newcott"
    },
    {
      "text": "It's not perfect - there are times when the pacing is off and the epilogue tries too hard to end things on a positive note - but it's effective and affecting.",
      "author": "James Berardinelli"
    },
    {
      "text": "The only real acting in this movie comes from Janet McTeer and Charles Dance as Will's aggrieved parents. They bring some ballast to this blubberfest.",
      "author": "Peter Rainer"
    },
    {
      "text": "One thing it's not - thank God - is another Nicholas Sparks adaptation",
      "author": "Chris Bumbray"
    },
    {
      "text": "As weepy-romances go, 'Me Before You' is about as good as you can hope for.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Manages to find a degree of dramatic care, with the production also aided by two strong lead performances from Emilia Clarke and Sam Claflin.",
      "author": "Brian Orndorf"
    },
    {
      "text": "\"Me Before You\" is a chaste love story, a true rarity these days. It's a film you can see with the entire family, and one that you can watch --- and will be watching --- over and over again.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Tugs at your emotions without being sentimental, mushy, maudlin or corny. It's a beautifully conceived story, wonderfully acted and well written.",
      "author": "David Kaplan"
    },
    {
      "text": "[Emilia] Clarke and [Sam] Claflin elevate the material which, although adapted by Moyes, barely scratches the surface of the book.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Me Before You seems blinkered on one thing and one thing alone - making audiences cry whatever means necessary, whether there's any authenticity to it or not.",
      "author": "Jamie Neish"
    },
    {
      "text": "A good-cry, bring-your-own-Kleenex romantic melodrama with appealing leads, great locations, and handsome production values. (Full Content Review for Parents - Sexual Content, Profanity, etc. - Also Available)",
      "author": "Teddy Durgin"
    },
    {
      "text": "Turns out to be a semi-predictable, sappy movie with a dark turn that kind of makes it more of a bummer than you expect.",
      "author": "Willie Waffle"
    },
    {
      "text": "This film cost $20-million to make and, at its heart, is a glossy, live-action Beauty and the Beast, with a quadriplegic in the role of non-human animal.",
      "author": "Julia Cooper"
    },
    {
      "text": "Clarke's sparkle is similar to when Julia Roberts graced the screen in \"Pretty Woman.\" Get used to her, she'll be around for awhile.",
      "author": "Adam Graham"
    },
    {
      "text": "With a story that links together every cliche from the weepy chick-flick library, this movie uses its doomed romance premise to reduce every woman in the audience into floods of tears.",
      "author": "Rich Cline"
    },
    {
      "text": "Clarke and Claflin sell this romance fully and add depth to characters that could have easily felt like caricatures.",
      "author": "Gabrielle Bondi"
    },
    {
      "text": "Clarke and Claflin have palpable chemistry, and we are no more able to resist Lou than Will is.",
      "author": "Nell Minow"
    },
    {
      "text": "It's successful in its aims and will ably bring the book's readers and romance fans both joy and tears.",
      "author": "Kimber Myers"
    },
    {
      "text": "It's not a cop out and the final scenes reach an emotional intensity that cheery chappy Nicky Sparks could only dream of.",
      "author": "Tim Evans"
    },
    {
      "text": "Sharrack picks the perfect wistful final shot, Craig Armstrong's score swells with ache and possibility, and everything is bathed in the golden light of bittersweet resolve. It's potent stuff.",
      "author": "Richard Lawson"
    },
    {
      "text": "This adaptation of Jojo Moyes's bestseller isn't great filmmaking, but it does capture most of what made the book so affecting.",
      "author": "Glenn Sumi"
    },
    {
      "text": "Me Before You is a beautifully filmed and well-intentioned weeper marred by an unfortunate performance from one of the leads, and a plot development that leaves us more angry and frustrated than moved in the final act.",
      "author": "Richard Roeper"
    },
    {
      "text": "I can't recommend this movie to anyone older than high school age.",
      "author": "J. R. Jones"
    },
    {
      "text": "A recent screening of \"Me Before You\" concluded with audible sniffles and even a sob or two. Why not gales of laughter or quiet snores? These are the mysteries that trouble a critic's uneasy mind.",
      "author": "A.O. Scott"
    },
    {
      "text": "Not everyone will be rooting around for a fresh supply of tissues.",
      "author": "Linda Barnard"
    },
    {
      "text": "Shameless in every way imaginable, Me Before You milks the pathos for all it's worth, but milks the comedy, too.",
      "author": "Steven Rea"
    },
    {
      "text": "There's a distasteful brand of insincerity that pervades Me Before You.",
      "author": "Mark Dujsik"
    },
    {
      "text": "For most of its runtime, Sharrock is able to trick her audience into falling for this love story, but the seriousness of quadriplegia is too heavy for this soft-serve romance.",
      "author": "Matt Goldberg"
    },
    {
      "text": "To call it formulaic would be an insult to the actually formulaic entries in this genre. Those movies, for better or worse, are designed to bring you to tears. They earn those tears. Me Before You is more akin to a stick-up.",
      "author": "Allison Shoemaker"
    },
    {
      "text": "It's intriguing to see the bits of ambitious ethical weightiness mingled with the movie's gloss.",
      "author": "Tom Russo"
    },
    {
      "text": "This romantic rejigger of \"The Intouchables\" works on its own cliched terms for a while, even ending with a hopeful coda, but the film's climax, which may have even worked had its reasons and ramifications been explored, feels like a cheap shock tactic.",
      "author": "Laura Clifford"
    },
    {
      "text": "Unfortunately, this ultra-glossy romantic drama derived from a best seller twists into very dark territory - a drastic tonal shift that neither its stars nor debuting director, Thea Sharrock, a respected stage veteran, manage with dramatic credibility.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Emilia Clarke has more than her share of charisma... but it's not enough to save Me Before You, a cloying and predictable romantic drama.",
      "author": "Don Kaye"
    },
    {
      "text": "A well-crafted script, deft direction and an excellent cast [...] keep this from being just another romantic weeper. It's a weeper, alright, but a darn good one.",
      "author": "Simi Horwitz"
    },
    {
      "text": "Me Before You will jerks some tears, maybe even from cynics.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "I walked into Me Before You with some trepidation: Would this be like a Nicholas Sparks adaptation? Good news -- or, depending on your film preferences, bad news: It isn't.",
      "author": "Chris Knight"
    },
    {
      "text": "Glossy but curiously uninvolving...viewers are being advised to bring boxes of tissues with them to the theatre, but that's advice you need take to heart only if you have a cold.",
      "author": "Frank Swietek"
    },
    {
      "text": "Jojo Moyes adapted her own best-selling book, which helps give Me Before You a singular inviting vibe instead of feeling like The Fault in Our Stars 2.",
      "author": "Brian Truitt"
    },
    {
      "text": "Me Before You is not without punishment, but it's so well made that it survives every drawback.",
      "author": "Rex Reed"
    },
    {
      "text": "Many times in life, we let our hearts overrule our minds. Such is the case with Thea Sharrock's \"Me Before You,\" a slick piece of treacle that manages to charm as it flirts with insulting the audience's intelligence throughout.",
      "author": "Charles Koplinski"
    },
    {
      "text": "A sob story that averts its eyes when things get uncomfortable about the tangle of sex and frustration. Still, you can't blame audiences for being seduced by two shining young stars.",
      "author": "Peter Travers"
    },
    {
      "text": "Me Before You is calculated and shameless, and it steamrolls its way over some pretty complex issues.",
      "author": "Stephen Rebello"
    },
    {
      "text": "The filmmakers seem to have missed an opportunity to deal in a sophisticated way with a thorny, important subject. Still, you'll probably cry anyway. It's that kind of film.",
      "author": "Jocelyn Noveck"
    },
    {
      "text": "In this truncated tale, it is ultimately hard to muster any tears for a character we never really know and whose actions we find difficult to understand.",
      "author": "Kathleen Rizzo Young"
    },
    {
      "text": "Transferring from theatre, director Thea Sharrock ramps up the property porn, while failing to fill this space with anything like recognisable human activity or emotion.",
      "author": "Mike McCahill"
    },
    {
      "text": "Clarke is endearing, but verges on mugging. Claflin is at his best when Will gives in to his competitive urges, which happens exactly once.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "The plot is filled with clichés and the attempt at the bigger picture - the value of a life - is muddy at best. You may find the film courageous, but you're more likely to find it ... sad.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "The gloss has a certain appeal: whenever rain falls, it comes down with a forceful elegance that befits the onscreen drama.",
      "author": "Abbey Bender"
    },
    {
      "text": "It punks its impressionable audience into believing a lie, then punishes them for their foolishness.",
      "author": "Eric Henderson"
    },
    {
      "text": "There's gentle manipulation, and then there's having your arms manacled to a freight train of weepy catharsis, which is roughly the experience awaiting viewers of Me Before You.",
      "author": "Tim Robey"
    },
    {
      "text": "Luckily, many of the plot's maudlin pitfalls are greatly mitigated by the film's utterly infectious leading lady.",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "A harmless enough entry in the \"adorable mite tames surly masculine beast\" romantic-weeper genre, hitting all the right beats with the clink of an expertly struck cowbell.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Overall, the film is sweet but often loses impact in its most serious moments by blasting a happy pop soundtrack.",
      "author": "Kate Clark"
    },
    {
      "text": "Louisa and Will's inevitable romance takes far too long to get going, and Clarke's overstated performance is more exhausting than endearing.",
      "author": "Josh Bell"
    },
    {
      "text": "Me Before You is toe-curling in the extreme, a glossy romantic drama that skims over complex issues to do with disability and assisted suicide in a frivolous and manipulative way.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Clarke has loads of talent, but in Me Before You she's undermined by director Sharrock's technique, and an endless slew of overeager reaction shots.",
      "author": "Michael Phillips"
    },
    {
      "text": "A sort-of romance, liberally sprinkled with moments of corniness and emotional dishonesty.",
      "author": "Mick LaSalle"
    },
    {
      "text": "As a romantic weepie, not bad. As a drama about a disabled man, possibly offensive.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Moyes and director Thea Sharrock kept the love story too shallow to be really intriguing. They seem to have forgotten that great romantic films don't have to be pretty, and have skimmed the story of any real human ugliness ...",
      "author": "Tony Hicks"
    },
    {
      "text": "The fault is not in our stars. In breakout performances, Emilia Clarke and Sam Claflin are magnetic as soulmates doomed by a Dire Medical Prognosis.",
      "author": "Mara Reinstein"
    },
    {
      "text": "No surprises here, except for the fact that this melodrama plays as winningly as it does.",
      "author": "Joanna Langfield"
    },
    {
      "text": "For a genre that's been full of cynicism and sarcasm in recent years, Me Before You is a breath of fresh air. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "This miscalculated romantic dramedy is pathetically simplistic about morally complicated issues, and kind of offensive to those living with disabilities.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "It has an ace up its sleeve: It's British. That's to say: It's able to temper the melodrama, be humorous as often as it is romantic, and generally give off an air of primp restraint.",
      "author": "Matt Prigge"
    },
    {
      "text": "The film becomes a testament to the transcendent power of love - but not in the way you expect.",
      "author": "Joe Dziemianowicz"
    },
    {
      "text": "Clarke is the Mother Of Dragons on television's Game Of Thrones. Here, she is also the master of stealing the scene.",
      "author": "John Lui"
    },
    {
      "text": "The story has a purity when it comes to love. It is definitely the kind of movie that should be seen with someone special.",
      "author": "Rick Bentley"
    },
    {
      "text": "Flaws aside, Me Before You is quietly funny and sexy and, above all else, feels real. It's the rare movie where your tears are actually earned.",
      "author": "Lauren Chval"
    },
    {
      "text": "Me Before You is a juicy, ripe red apple of a romance with a razor blade embedded under its skin.",
      "author": "Connie Ogle"
    },
    {
      "text": "It's hard to hold back the tears for a story that has the courage of its convictions.",
      "author": "James Mottram"
    },
    {
      "text": "The sort of film to starkly divide audiences: hard cases will wince at the clichés and Clarke's performance; starry-eyed weepie fans will get what they came for.",
      "author": "Peter Canavese"
    },
    {
      "text": "Predictable but still affecting, Me Before You is wonderfully elevated by an enchanting Emilia Clarke.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "It may not quite rise to the level of a classic three-hankie tearjerker, but it's proof that sometimes one or two hankies is more than enough to get the job done.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "A saccharine, but quite watchable British romantic drama with a goofy principal character",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Forget art, or even craft: This is the kind of movie that can't even get its shameless audience-pandering in order.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Far too much of this high-gloss tearjerker proceeds as a by-the-numbers romantic fantasy, nudging the viewer every step of the way.",
      "author": "Sheri Linden"
    },
    {
      "text": "These are deep, complicated issues the film wades into, and it quickly winds up out of its depth.",
      "author": "Andrew Barker"
    },
    {
      "text": "Resistance to this delirious romantic tragedy is futile, save for that nagging voice in our head wondering if it really has to be this way.",
      "author": "Charles Gant"
    }
  ],
  "release_year": 2016,
  "duration": 110,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Young and quirky Louisa \"Lou\" Clark (Emilia Clarke) moves from one job to the next to help her family make ends meet. Her cheerful attitude is put to the test when she becomes a caregiver for Will Traynor (Sam Claflin), a wealthy young banker left paralyzed from an accident two years earlier. Will's cynical outlook starts to change when Louisa shows him that life is worth living. As their bond deepens, their lives and hearts change in ways neither one could have imagined.",
  "popularity": 7.3,
  "poster_url": "https://image.tmdb.org/t/p/original/Ia3dzj5LnCj1ZBdlVeJrbKJQxG.jpg"
}