{
  "movie_name": "Midsommar",
  "movie_id": "midsommar",
  "total_reviews": 411,
  "reviews": [
    {
      "text": "Part fairytale, part break-up movie, Ari Aster’s twisted cult horror will surely stand the test of time.",
      "author": "Wael Khairy"
    },
    {
      "text": "Midsommar is ambitious, well-acted, meticulously crafted, and thematically strong, but it fails at being what it’s supposed to be: a scary movie.",
      "author": "Justin Kim"
    },
    {
      "text": "All you need to know going into this transgressive (if surrealistic) film is that it covers: animal abuse, cannibalism, incest, suicide, matricide, homicide, and some serious fucking.\n\nMy work here is done.\n\nGet thee thinking cap on.",
      "author": "Cole Smithey"
    },
    {
      "text": "Midsommar is packed with reminders that if a film succeeds in depicting the darkness within vividly, then a sunshine-y environment can make the experience even more unnerving. Because viewers have nowhere to hide.",
      "author": "Jai Arjun Singh"
    },
    {
      "text": "In this immersive, subtle and unsettling horror master-work, Ari Aster takes his audience by the hand, and slowly and surely introduces the disturbing beneath the festive, relaxing and innocent.",
      "author": "Diana Tuova"
    },
    {
      "text": "If you’re searching for a memorable breakup film—summer love rarely lasts—look no further than what Ari Aster offers here. Better yet, Midsommar would also make for quite a bonding experience when watched with a date…",
      "author": "Chase Hutchinson"
    },
    {
      "text": "Sure, it has just as much to say about our ignorance toward other cultural rituals (using Swedish folklore), but as a horror film about a failing relationship, Midsommar kind of broke me.",
      "author": "Brendan Cassidy"
    },
    {
      "text": "…’Get on with it’ would be a more appropriate title for Ari Aster’s glacially slow horror film, a follow up to Hereditary that repeats many of the same dread-inducing tropes but with a remarkable drop-off in terms of effect….",
      "author": "Eddie Harrison"
    },
    {
      "text": "The performances from Florence Pugh and Jack Reynor are extraordinary, with both carrying two halves of Asters heart and reality.",
      "author": "Ryan McQuade"
    },
    {
      "text": "As in his previous film, the familiar, spiritual and ritual outside the social canons of normativity will be present, as well as the horror genre fused with drama and mystery in that peculiar poetics that seems to characterize this autor.",
      "author": "Denise Pieniazek"
    },
    {
      "text": "Whether you love it or hate it, Midsommar is memorable. Florence Pugh carries the story on her shoulders with an astonishingly compelling performance, but her supporting cast didn't do much with their underdeveloped characters.",
      "author": "Manuel São Bento"
    },
    {
      "text": "What’s particularly remarkable is the feeling of dread that Aster is able to sustain over most of Midsommar’s two-hour-plus running time. This despite the fact that virtually the entire story unfolds under sunny skies.",
      "author": "Paul Kanieski"
    },
    {
      "text": "Midsommar is all steak, no sizzle, and no real lessons are learned other than, maybe, ‘Screw your mansplaining boyfriend.'",
      "author": "John Brhel"
    },
    {
      "text": "Oh my god. What a movie. Unforgettable.",
      "author": "Mark Serrels"
    },
    {
      "text": "I did not like MidSommar as much as I appreciated its audacity and the skill that clearly went into making it. This was a stunning work of art that embraced excess with a few positive results.",
      "author": "Norman Gidney"
    },
    {
      "text": "Is it a movie about grief, emasculation, mental health, spiritual awakening? The movie seems to inadvertently ask “Who cares? Just watch another unnerving scene where the creepy Swedish cult does something else bizarre.”",
      "author": "Keith Garlington"
    },
    {
      "text": "Aster wields a two-pronged setup that pokes at feelings of anxiety about remote communities and their link to an untamed wilderness, while also presenting characters whose interpersonal drama underscores every potently disturbing situation in the film.",
      "author": "Brian Eggert"
    },
    {
      "text": "Episode 42: Crawl / The Last Black Man in San Francisco / Chernobyl / Midsommar",
      "author": "Taylor Baker"
    },
    {
      "text": "One dizzying, hilarious trip into hell.",
      "author": "Kip Mooney"
    },
    {
      "text": "Midsommer is a tasty treat for horror fans.",
      "author": "Robin Holabird"
    },
    {
      "text": "Ari Aster's Hereditary follow-up is a genuinely disturbing tale of nature-worshiping pagans.",
      "author": "James McMahon"
    },
    {
      "text": "Bizarre is the main course in Midsommar, which serves as Florence Pugh's tour de force. A daylight horror movie that succeeds because of the efficiency of its first act. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "It's difficult to imagine Midsommar satisfying true horror fans, but if you're interested in witnessing some ultra-strange cult rituals, it more than fits that bill.",
      "author": "Alex Bentley"
    },
    {
      "text": "... what it does to you is undeniable.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Proof positive that not all scary stuff happens under the cover of darkness. Sometimes daylight can illuminate the true horror of a situation in even more terrifying ways.",
      "author": "Richard Crouse"
    },
    {
      "text": "[Ari] Aster turns everyday living on its head...[Midsommar] offers up catharsis via grotesque apotheosis.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "Florence Pugh is strong in this sophomore effort from Ari Aster. While not as accomplished as his first film, his attention to detail, tone, and cinematography are superb.",
      "author": "Wesley Lovell"
    },
    {
      "text": "A vast improvement over the wildly overrated \"Hereditary,\" director Ari Aster gives us a slow-burn of a horror film that gradually gets under the viewer's skin and proves hard to shake, even after the credits role.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Ends up being more unsettling than Hereditary and is proof that Aster is a potential horror master.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "An interesting mixture of scenes that touch on the absurd and the real, the intellectual and the banal in a constant state of terror [Full Review in Spanish]",
      "author": "Gisela Savdie"
    },
    {
      "text": "This is a descent into the seventh circle of a very particular kind of hell -- one designed by a malignant creator playfully twisting the knife.",
      "author": "Tom Beasley"
    },
    {
      "text": "One woman's journey to a remote Swedish village helps reveal to her an existence outside of American patriarchy and toxic men.",
      "author": "C.H. Newell"
    },
    {
      "text": "A film which splices its incredibly graphic gore and creeping horror with overblown, definitely-allowed-to-laugh sequences. For all of that, it's still an effective horror story.",
      "author": "Keri O'Shea"
    },
    {
      "text": "If this was maybe 40 minutes shorter, it might have worked. As is, everything you think is going to happen happens and it's not worth the wait.",
      "author": "Doug Walker"
    },
    {
      "text": "You feel the need to see every frame for fear of missing a single thing, even to the point of testing your bladder's resolve.",
      "author": "Damond Fudge"
    },
    {
      "text": "It's a film that is not fully illuminated. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "A meticulous, artsy, fastidious take on what's essentially a seedy pulp story.",
      "author": "Brent McKnight"
    },
    {
      "text": "Ari Aster's flower-draped folk-horror followup to 'Hereditary' was not everybody's cup of menstrual blood tea, but I loved it.",
      "author": "John Beifuss"
    },
    {
      "text": "Midsommar is an exquisitely visceral cinematic experience that leaves you both physically and emotionally exhausted as the credits begin to wash over you.",
      "author": "Dan Tabor"
    },
    {
      "text": "I didn't enjoy watching it, but it had its validity.",
      "author": "Avaryl Halley"
    },
    {
      "text": "A little too serious, not campy enough.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Aster proves what a formally accomplished director he is, and how he totally understands that the medium is all about aesthetic and spectacle.",
      "author": "PJ Nabarro"
    },
    {
      "text": "While it may frustrate some viewers, and present an absolute affront to the tastes of others, for the discerning fan of screen horror it is an absolute must-see.",
      "author": "Grant Watson"
    },
    {
      "text": "Combines the nightmare paganism of The Wicker Man with the stately, painterly elegance of The Shining.",
      "author": "Kyle Smith"
    },
    {
      "text": "You will enjoy a superb performance by the great Florence Pugh, one of today's best young actresses. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Add to that the insidiously haunting score from The Haxan Cloak and you've got yourself the most desirable 2.5 hour tummy ache in existence.",
      "author": "Dan Scully"
    },
    {
      "text": "Much of the film is keenly attuned to human failure and the ugliness of bad relationships, making for a magnetic but continually cringe-inducing ride.",
      "author": "Dan Schindel"
    },
    {
      "text": "As symbolically rich as a Jodorowsky hippie acid trip with the pagan matriarchal horror of The Wicker Man, Midsommar feels like a nightmare that started off as a dream.",
      "author": "Laura Di Girolamo"
    },
    {
      "text": "There's a scary beauty in the themes and plot of Midsummer...",
      "author": "Shawn Edwards"
    },
    {
      "text": "This isn't just a movie about death or grief . . . It's about the horrors of human empathy -- how feeling less alone means losing your individuality.",
      "author": "Matt Cipolla"
    },
    {
      "text": "It's the humour that gives the film its edge, making sure that viewers can never quite be certain of anything and enhancing the sense of creepiness on which it depends.",
      "author": "Jennie Kermode"
    },
    {
      "text": "A filmic visit to how the external, the strange things to us are more similar than we think. A beautifully terrorific movie [Full review in Spanish]",
      "author": "Guillem Martinez Oya"
    },
    {
      "text": "Midsommar is both much funnier and a lot more \"fun\" than I expected. It's actually a great date movie, provided your relationship is healthy and both of you share a certain morbid sense of humor.",
      "author": "Scott Mendelson"
    },
    {
      "text": "It's really just not my cup of tea, not to say it's a bad film, but I would never watch it again...",
      "author": "Sharronda Williams"
    },
    {
      "text": "...the novelty of high-noon horror wears ripely thin and risible over an overlong running time.",
      "author": "David Aldridge"
    },
    {
      "text": "After a while, an unproductive restlessness sets in as you wait for the characters to matter as much as the silky moves and painstaking details. Horror",
      "author": "Manohla Dargis"
    },
    {
      "text": "Incredible beauty that contrasts with gruesome, realistic violence...",
      "author": "Michael Rougeau"
    },
    {
      "text": "...extraordinary performance of such immense pain that it virtually leaves a stain on your sub-conscious.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Midsommar loves to play with complacency. It thrives on innocence, then offers an unforgettable 30-minute rush to the end.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Aster is one of our most original filmmakers, especially for horror, in that he discards traditional tropes and opts for a headlong journey into existentialist sickness and anxiety.",
      "author": "Chad Byrnes"
    },
    {
      "text": "Florence Pugh gives a gut-wrenching turn as a grieving student who follows her turd of a boyfriend to Sweden, only to find terrors beyond comprehension.",
      "author": "Daniel Barnes"
    },
    {
      "text": "Tense and stylish, with rounded performances and a tragic twist, Midsommar's opening 15-minute prologue is an absolute masterclass, and could even work as a standalone short.",
      "author": "Matt Maytum"
    },
    {
      "text": "Midsommar is a waking nightmare and I mean that in the best possible way.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "Despite the way Midsommar is being talked about as an 'extreme', disturbing cinemagoing experience, I found it joyful and uplifting.",
      "author": "Mel Campbell"
    },
    {
      "text": "But beyond the high-gore kills and self-hating political circumspection, Midsommar is a movie about ignoring what's right in front of you...",
      "author": "Sean Fennessey"
    },
    {
      "text": "Aster's latest contribution truly earns the title by showing how manic joy can be just as terrifying as the dark, dank depressing places we usually associate with horror.",
      "author": "Jess Joho"
    },
    {
      "text": "As a stamina test, the movie is as exciting as it is startling.",
      "author": "David Keyes"
    },
    {
      "text": "A slow burn that eats away at you. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "The talented scriptwriter and director is interested in creating a universe that is as fascinating as it is macabre, with its own codes, rules, and esthetic. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Aster built a visually stunning micro-world. [Full review in Spanish]",
      "author": "Gaspar Zimerman"
    },
    {
      "text": "\"Midsommar\" feels like a hard shot from the source of terror -- an allusive work of art.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "...I would absolutely recommend Midsommar...a great horror film.",
      "author": "May Leitz"
    },
    {
      "text": "In Midsommar, grief is accompanied by an unnerving hum: the confluence of hundreds of mourners collectively putting anguish out into the ether, as if to open up emotional veins and make the act of sharing pain almost too vulnerable an affair.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Ari Aster seems dedicated to creating experiences that are difficult to forget and he accomplishes that. [Full Review in Spanish]",
      "author": "Rafael Rosales Santos"
    },
    {
      "text": "Ari Aster did it again. Midsommar is a symmetric representation of fears around individualism and community life. A truly visionary and creative take on contemporary social horror. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "I was never, even for one second, feeling the length... I found it so unsettling and sinister. At moments it was a little uneven, but it's so watchable and gets under your skin in a really creepy way.",
      "author": "Claudia Puig"
    },
    {
      "text": "Aster is good at creating environments, but he seems more concerned with projecting himself as an intelligent filmmaker with messages full of symbols and intellectuality, than for telling a story that touches the public.",
      "author": "Fausto Ponce"
    },
    {
      "text": "The film - unlike Hereditary - leaves no reverberations on the audience, that leaves the theater quite indifferent. [Full Review in Spanish]",
      "author": "Leonardo Garcia Tsao"
    },
    {
      "text": "Throughout most of Midsommar, you won't know whether to laugh or cry. Instead, you'll erupt into a giddy mania, exactly like what Christian and Dani do.",
      "author": "Stephen Porzio"
    },
    {
      "text": "[T]his is next level horror film-making, the kind of scary movie that seeps into your bones and makes you feel cold,",
      "author": "Joey Keogh"
    },
    {
      "text": "Florence Pugh... delivers an astounding, emotional performance within a single phone call. You will realise she is likely destined for awards.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "Ari Aster manages to present a folk horror, which in reality is a story of loneliness, of internal rupture and of the despair it feels to lose the world that sustains you. [Full Review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "As if that were not enough, the pain management proposed by the film also leaves the director / screenwriter's point of view unbalanced. [Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Where Hereditary felt like two souls at odds with each other in one body, Midsommar is a work of cathartic camp.",
      "author": "Juan Barquin"
    },
    {
      "text": "The entire cast's organic performances and Florence Pugh's masterful work of in the role of Dani makes the film one that you will never forget... Although the plot seems to stagnate at times. [Full review in Spanish]",
      "author": "Daniela Sagastegui Avilés"
    },
    {
      "text": "From the premise, the movie traps viewers and locks them in unsettling spaces through its careful form and obsessive attention to geometrical compositions and symmetries. [Full Review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "Midsommar is a slow burn, a ruminating and sinister film that ratchets tension with a vice-like grip.",
      "author": "Toby Woollaston"
    },
    {
      "text": "Enhanced by some pointedly weird and gorgeous production design, Midsommar's meandering descent into crazy town makes for a deftly disturbing viewing experience for at least two-thirds.",
      "author": "Aaron Yap"
    },
    {
      "text": "The restrained approach pays off and the revelations that follow make quite a shocking impact.",
      "author": "Boon Chan"
    },
    {
      "text": "A bad editing that leaves loose ends and simplifies the story, is compensated with the formidable production design and the ambitious intention to scare in the morning. [Full Review in Spanish]",
      "author": "Alonso Díaz de la Vega"
    },
    {
      "text": "The culture surrounding festivals is an area ripe for horror - and MIDSOMMAR makes Fyre Festival look like a picnic.",
      "author": "Hannah Lodge"
    },
    {
      "text": "Perhaps only slightly let down by a certain inevitability about the character's fates... Midsommar is nonetheless proof of the emotional and visceral power of a well-made horror movie.",
      "author": "James Croot"
    },
    {
      "text": "What Midsommar lacks in originality, it more than makes up for with offbeat moments adorned with gut-wrenching eccentricities.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Strap in for a cruel, slow ride and you'll be thinking about Midsommar long after the credits roll.",
      "author": "Matt Hudson"
    },
    {
      "text": "Where were we going with this thing? I felt trapped, and it was way too long...",
      "author": "Justin Brown"
    },
    {
      "text": "The performances saved the movie, as did the amazing cinematography...it was pretty good until the third act, when it falls off the rails really fast.",
      "author": "Brandon Collins"
    },
    {
      "text": "Indeed, it's cultural sensitivity that lies at the heart of this movie. It is not about serial killers, aliens or supernatural beings. It is about the ordinary humans we know as the Other because they come from somewhere else.",
      "author": "Stephen Romei"
    },
    {
      "text": "A disturbing and dark tale of manipulation, alt-religion, bizarre rituals and debauchery that might just leave you aghast...Fans of 1973's classic The Wicker Man will appreciate Midsommar's respectful nods in the manner it delivers its deepest frights.",
      "author": "Jim Schembri"
    },
    {
      "text": "Don't be fooled by its gorgeous sun-scorched scenery, Midsommar is here to ruin your relationship",
      "author": "Jay Krieger"
    },
    {
      "text": "Throws enough at the wall to convince that Aster's gestures towards the super-feminine might be real, or at least really well researched.",
      "author": "Luke Goodsell"
    },
    {
      "text": "It's crafted by people with unique visions who never fear to offer something different.",
      "author": "Tatat Bunnag"
    },
    {
      "text": "A deeply disturbing and powerfully atmospheric slice of horror that laces its ever-sickening sense of dread with a jet-black streak of humour.",
      "author": "Matthew Turner"
    },
    {
      "text": "Ari Aster's approach to horror filmmaking seeps into your subconsciousness with great effect, lingering like an uninvited guest.",
      "author": "Wenlei Ma"
    },
    {
      "text": "While Midsommar doesn't hit the highs of Ari Aster's previous film, it is still a journey worth taking.",
      "author": "Alan Cerny"
    },
    {
      "text": "...a sun-drenched, hallucinatory nightmare that doesn't know when to end, or quite what it's trying to say, but is enormously effective (albeit inconsistently) and a giddily uneasy ride into hell.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "One of those films that makes the whole world outside the cinema seem creepy and weird when you emerge.",
      "author": "CJ Johnson"
    },
    {
      "text": "Appreciators of complex horror will be rewarded with another genre stand-out that addresses the fearfulness within relationships, the sound mind-frame of ritualistic practices, and the terror behind a masked religion.",
      "author": "Peter Gray"
    },
    {
      "text": "Midsommar is a mood. The coherence of the story doesn't matter as much as the morbid sensation that permeates every scene. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Even more than Hereditary, Midsommar lives on the edge where horror meets absurdity, prompting the kind of laughter that comes from not knowing how else to respond.",
      "author": "Jake Wilson"
    },
    {
      "text": "Midsommar starts off strong then devolves into a muddled mess. The filmmaker hopes you're too distracted by pretty visuals, solid acting, and violence to notice that this isn't a very good movie overall.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "A mind-wringing, sense-zinging threat to the psyche, Midsommar marks just the second work of filmmaking prodigy Ari Aster.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A quick heads-up: if you're reeling from the murder-suicide of your parents and sister, it's probably not the brightest idea to take off to a drug-fuelled cult festival.",
      "author": "Andiee Paviour"
    },
    {
      "text": "Aster has found the ultimate back-channel into our primal terrors, making us suspicious of the people we would otherwise run to in a tragedy. And damn if it doesn't work every time.",
      "author": "Simon Miraudo"
    },
    {
      "text": "A compelling piece of folk horror.",
      "author": "Brian Lloyd"
    },
    {
      "text": "A slow-moving descent into a deeply layered hellscape, loaded with subtextual meanings and evocative imagery. 'Midsommar' is both deeply disturbing and strangely exhilarating.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A surrealist drama based on heartbreak and psychotic unraveling, Midsommar is 'edge of your seat' horror at its best.",
      "author": "Morgan Rojas"
    },
    {
      "text": "Maybe one day Aster will decide to tell us a horror story rather than turning B-series arguments into melodramas. [Full Review in Spanish]",
      "author": "Jesús Palacios"
    },
    {
      "text": "It is half a cruel fable about intimate relationships between the ancestral and the millennial, and half a social metaphor as bleak as pointedly burlesque. [Full Review in Spanish]",
      "author": "Antonio Trashorras"
    },
    {
      "text": "Midsommar is a dark horror (though shot in bright sunlight), full of disturbing images that will follow you home and possibly inhabit your nightmares.",
      "author": "Chris Knight"
    },
    {
      "text": "Ari Aster is drunk on his own self-importance. [Full Review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "Midsommar is not only the best horror film... of 2019, but also one of those groundbreaking contributions that dignifies the genre. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "It disquiets and disarms. It bursts with bizarre beauty, blending it with the odd and the absurd, enunciating that the world and the humans that inhabit it are more mysterious and complex, and that is scary.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Midsommar is an extraordinary folk-horror that ratifies Ari Aster as one of the essential filmmakers of the genre. [Full Review in Spanish]",
      "author": "John Tones"
    },
    {
      "text": "Ari Aster's sophomore film is a disturbing and hallucinating experience about letting go. Florence Pugh deserves to be crowned queen of summer 2019 for her extraordinary performance. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Ari Aster masterfully delivers a solid follow-up that will disturb, hypnotize and test viewers. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Midsommar mostly takes place in Sweden, but at its core is a particularly American sense of rootlessness.",
      "author": "Alison Willmore"
    },
    {
      "text": "Regardless of how you choose to interpret the ending, you probably still feel f---ed up about it, so, uh... good work, guys!",
      "author": "Emma Baty"
    },
    {
      "text": "The pace is slow-burn, the mood is ominous and the hallucinatory imagery will give you nightmares.",
      "author": "Theresa Smith"
    },
    {
      "text": "Not as sharp and steely as [Ari Aster's] previous film but... quite possibly conceals a cynical look about the violent and pure nature that lies under the superficial layers of [a] purported and hypocritical civilization. [Full review in Spanish]",
      "author": "Felipe Rodríguez Torres"
    },
    {
      "text": "While Midsommar may have thematic failings, as a piece of visceral cinema, it is exemplary, impressively provoking an extreme, physical reaction from his audience.",
      "author": "Orla Smith"
    },
    {
      "text": "Ari Aster's follow-up to Hereditary is everything I want in a fucked-up, fantastical, creepy cult horror film - and also more than that (but I can't tell you what that more is without spoiling everything for you ...",
      "author": "Amie Simon"
    },
    {
      "text": "A rich and unnerving mood piece and mental horror picture. Then why insist on foregrounding the non-starter of a relationship drama?",
      "author": "Tim Brayton"
    },
    {
      "text": "I want my time back. Do you know what I could've done in two hours and 27 minutes...I left the theater unfulfilled.",
      "author": "Tony Baker"
    },
    {
      "text": "Visually and sonically, it's perhaps the most beautiful horror movie since Argento's Suspiria.",
      "author": "Oscar Goff"
    },
    {
      "text": "Powerful exploration of the stages of a breakdown. [Full review in Spanish]",
      "author": "Daniel de Partearroyo"
    },
    {
      "text": "A motion picture so bleak that it makes the auteur's earlier film, Hereditary, seem almost as cheerful and lighthearted as Mamma Mia! by comparison.",
      "author": "Matt Brunson"
    },
    {
      "text": "This is a film meant to be examined from every angle, but first you just have to let it wash over you like a weird, violent waterfall.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Ari Aster honestly might be the next Kubrick. He pushes the limits of the medium in almost every way, and the results are stunning.",
      "author": "Kent Garrison"
    },
    {
      "text": "'Midsommar' is superlative film making with disturbing horror.",
      "author": "Linda Cook"
    },
    {
      "text": "The film highlights all that there is to be afraid of in broad daylight. And it leaves audiences deeply rattled, if not utterly reeling.",
      "author": "Jay Graham"
    },
    {
      "text": "\"Midsommar\" isn't just a great horror movie... It is also one of the best movies ever made about living with mental illness.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "\"Midsommar\" is a deeply unsettling and, ultimately, truly terrifying piece. The pace is intentionally slow, which only helps the horror build. Plus, Aster isn't without a wicked sense of humor.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "One of the most original and challenging genre films in recent years, owing a clear debt to the folk horror cinema of the 1970s, yet resisting the pull of pastiche.",
      "author": "Christopher Machell"
    },
    {
      "text": "Florence Pugh carries the movie, and her wryly matter-of-fact commitment to the character's tenuous subjectivity is what allows Aster's storytelling to vacillate between blistering satire, broken-in psychological realism, and straight-faced ominousness.",
      "author": "Madeline Whittle"
    },
    {
      "text": "Ari Aster is undoubtedly a master of his craft",
      "author": "Marianna Neal"
    },
    {
      "text": "Ahhhh!!!! I say AAAAAAHHHHHHH!!!! This scared the hell out of me.",
      "author": "Bob Grimm"
    },
    {
      "text": "Midsommar is more than your standard issue spook-a-blast. It's an art film, a depraved travelogue, and a psychological assault rolled into one.",
      "author": "Tim Brennan"
    },
    {
      "text": "This film attempts to tackle too many serious topics while giving the audience a memorable horror experience (and I cannot be sure it is even providing good horror)\"",
      "author": "Stephanie Chapman"
    },
    {
      "text": "The mix of hallucinogens, graphic deaths and the inevitable fertility ritual is very nasty at times, but for those who like that sort of thing, this is one of the must-sees of the summer.",
      "author": "Matthew Bond"
    },
    {
      "text": "Midsommar will leave audiences looking cockeyed at flower crowns all summer long.",
      "author": "Dominic Griffin"
    },
    {
      "text": "Midsommar is a cool, coy, and self-conscious movie, less an overt horror work than a young man's art film with some vivid gore splashed throughout it.",
      "author": "George Elkind"
    },
    {
      "text": "[This] thriller was one descent into sunshine-filled pagan madness I could have done without.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "As the film sways drunkenly towards its inevitable conclusion, Aster fails to conjure a sense of dread or even tension - essential qualities of the horror genre.",
      "author": "Simran Hans"
    },
    {
      "text": "I found that it's in those absurd and sometimes confusing moments that Midsommar found its footing",
      "author": "Steven Prokopy"
    },
    {
      "text": "Ultimately...feels too familiar and on the rails which takes away any sort of elements of surprise or real ingenuity. Aster remains an impressive talent...but may be more successful for him to...hand off script duties to someone else",
      "author": "Rob Dean"
    },
    {
      "text": "Midsommar again makes the case for Aster as a brilliant craftsman, with skill nearly unparalleled in his field, held at arm's length from meaning by his hollowness as a storyteller and maker of meaningful art.",
      "author": "Nick Johnston"
    },
    {
      "text": "An awesome unsettling psychological high-brow horror film.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "A full-length rendering of Harold Ramis' stock answer when young men asked what advice he would give a young filmmaker: \"Dump her, she's no good for you.\"",
      "author": "Ray Pride"
    },
    {
      "text": "If you want to be terrified and overly anxious about the arbitrary nature of our cultural rituals, which include watching scary movies that reflect our world back at us (through a glass, in this case, brightly), then go see Midsommar at any time of day.",
      "author": "Rich Smith"
    },
    {
      "text": "Those excited to be confused, shocked, and utterly disgusted all over again should expect to be thoroughly satisfied.",
      "author": "Katy Moon"
    },
    {
      "text": "This isn't the package under which I want to explore these ideas.",
      "author": "Sean Chandler"
    },
    {
      "text": "It is a completely unique experience with obvious style and gut-punching substance and extremely funny as well.",
      "author": "Jonathan Dean"
    },
    {
      "text": "Good actors create listless characters as the plot fiddles while the barn burns.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Ari Aster's dread-drenched Midsommar, a masterpiece of folk horror, proves that the scariest monsters don't need to lurk in the shadows. How can they, in the land of the midnight sun?",
      "author": "Stephen Garrett"
    },
    {
      "text": "One of 2019's essential films.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Ari Aster's newest film is a beautiful and frightening fever dream, featuring a killer performance from Florence Pugh.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "The implication that an audience's emotions should be wrenched out rather than coaxed out is as arrogant as 'Midsommar' is self-indulgent.",
      "author": "Angela L. Harmon"
    },
    {
      "text": "This is a film that lives or dies on its artistry and atmosphere - and for me, it lived.",
      "author": "Margot Harrison"
    },
    {
      "text": "Aster's ability to get under the viewer's skin is testament to his grasp of the genre and how it can work in so many different ways",
      "author": "James Kendrick"
    },
    {
      "text": "Midsommar is one of the weirder wide releases that we've gotten in quite some time, a bizarre and occasionally gruesome puzzle box of a movie rendered all the darker by the fact that it never actually gets dark.",
      "author": "Allen Adams"
    },
    {
      "text": "Sadistic and all-too-derivative of Robin Hardy's 'The Wicker Man,' this pastoral/pagan horror film is filled with sinister, nightmarish rituals.",
      "author": "Susan Granger"
    },
    {
      "text": "Grim, grisly and downright sickening, Midsommar is a feel-bad horror film about suicide, mercy killings, insanity, graphic nudity, religious hysteria, and the kind of grotesque imagery that exists for no other reason than shock value.",
      "author": "Rex Reed"
    },
    {
      "text": "With her scared eyes, alert line-readings and Lillian Gish looks, Miss Pugh, late of Lady Macbeth, ensures it is much better than it might have been anyway.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Don't let the studio-manufactured hype fool you; this is a midsummer's matinee bore.",
      "author": "Scott Marks"
    },
    {
      "text": "Even at 147 minutes, Midsommar, unlike its hapless protagonists, never outstays its welcome.",
      "author": "Brian Viner"
    },
    {
      "text": "Ari Aster fulfills the potential he showed intermittingly in Hereditary and cements himself as a rising filmmaker worth watching.",
      "author": "Stephen Silver"
    },
    {
      "text": "Much like Darren Aronofsky's 'mother!', this will not be for everyone. It is gross, it is shocking, it's trippy and it's divisive. I loved it - in the worst possible way.",
      "author": "Jamie East"
    },
    {
      "text": "Midsommar has that sort of staying power, which makes it a better choice for horror aficionados than the other midsummer garbage currently being dumped into theaters.",
      "author": "James Berardinelli"
    },
    {
      "text": "Pugh's performance is nuanced, sympathetic and completely believable.",
      "author": "Thaddeus McCollum"
    },
    {
      "text": "I would watch this again, in fact, I need to watch it again. So many subtleties in this film... the performances from everyone were incredible.",
      "author": "Steph Cozza"
    },
    {
      "text": "It's a world that you absolutely believe in, aided by really really brilliant performances.",
      "author": "Mark Kermode"
    },
    {
      "text": "\"Midsommar\" is an upsetting movie, and I mean that word in pretty much every way you can think of... But the truth is that he's just two movies into his career, and it's probably only a matter of time before he figures out how to stick the landing.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Ari Aster's folk-horror flick is frightening, beautiful, and just a little unhinged.",
      "author": "Jo Livingstone"
    },
    {
      "text": "It's a gradually gnawing, unhinged terror that simply feels wrong on a variety of levels. And it's thoroughly entertaining.",
      "author": "Rich Cline"
    },
    {
      "text": "It may not be entertainment per se, but as a work of art, and as a second step forward in a promising career, it's absolutely cinema that's worth engaging with.",
      "author": "Abby Olcese"
    },
    {
      "text": "Memorable, certainly. Enjoyable? Hardly.",
      "author": "Alison Rowat"
    },
    {
      "text": "Midsommar is a sun-soaked exploration of grief.. and one helluva horror film.",
      "author": "Kimberley Elizabeth"
    },
    {
      "text": "It's as haunting as a nightmare, and lingers like that relationship that ended badly, but stays nestled in your subconscious.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Ari Aster's Midsommar spooks its audiences not with what they don't know is about to happen, but what they can clearly see is about to happen, and can do nothing to stop. It's like being in a locked car rolling slowly towards a cliff.",
      "author": "Tom Shone"
    },
    {
      "text": "Midsommar is an incredibly inventive, smart, and thoughtful horror film.",
      "author": "Rosie Knight"
    },
    {
      "text": "Midsommar is another perfect entry into the growing filmography of Ari Aster who is quickly becoming a true tour-de-force in the world of abnormal horror and can already be considered a modern auteur of the genre.",
      "author": "James Perkins"
    },
    {
      "text": "With a story that expands Aster's abilities, both as a visual director and in the grandiosity of his storytelling, he steps up to meet the challenge of his second feature.",
      "author": "Alan French"
    },
    {
      "text": "Destined to become the go to movie for women disgruntled with their men everywhere.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Even though the film is hard to love, Ari Aster's direction and Florence Pugh's acting are very easy to appreciate. [Full review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "How can an audience feel anything close to the catharsis of tragedy when Aster observes the characters within his story with such thinly veiled contempt?",
      "author": "Andrew Kendall"
    },
    {
      "text": "(Aster's) confidence in his cleverness can overwhelm Midsommar, but his fearlessness is also captivating to watch explored on screen.",
      "author": "Michael Ward"
    },
    {
      "text": "Midsommar is a mesmerizing experience, solidifying Aster as one of the most compelling directors currently making films.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "Florence Pugh is outstanding in this gorgeous, gruesome revenge comedy, all about family.",
      "author": "Sarah Cartland"
    },
    {
      "text": "[The film sees] the full blossoming of a visual style that can loosely be described as a less baroque Wes Anderson, obsessed with symmetry, artificiality, and angular camera movements.",
      "author": "Nathanael Hood"
    },
    {
      "text": "Ari Aster pulls no punches with this mighty sophomore effort, which trades the operatic power of his debut for a looser yet more ambitious form.",
      "author": "Shaun Munro"
    },
    {
      "text": "All in all, Midsommar is less akin to the classic Wicker Man and more like the Nicolas Cage remake, and not just because both of them feature a bear costume.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "A stunning, unexpected nightmare for a group of grad students without a clue. Doesn't leave much room for sympathy for the victims. It's a clever film worth seeing twice.",
      "author": "Victoria Alexander"
    },
    {
      "text": "The more time you spend thinking about Midsommar, the more power you give it to continue its dig into your already damaged psyche.",
      "author": "Frank Wilkins"
    },
    {
      "text": "In Ari Aster's sophomore follow-up to last year's brilliant Hereditary, the horror moves from the claustrophobic space of personal grief and madness to the brightly lit, never ending smiles of well-intentioned Swedish pagan cult members in Midsommar.",
      "author": "Katey Stoetzel"
    },
    {
      "text": "Aster paces Midsommar languidly, but he doesn't waste the film's long running time.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Without the running time, Midsommar wouldn't have its madly epic quality. And make no mistake: This movie is epic. Also completely mad.",
      "author": "Robert Horton"
    },
    {
      "text": "It's strange and distressing at times, even a little punishing to audiences, but it's filled with ideas, images, and feelings that will stay with you long after the credits roll. And it's worth every second.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Imagine an Ingmar Bergman film with moments of graphic violence and freaky sexuality thrown in and you can begin to approximate what this extraordinary work is like.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Worth seeing; not worth falling out over.",
      "author": "Harry Guerin"
    },
    {
      "text": "In common with its predecessor, Midsommar is rooted in the sobbing, shrieking, Bergmanesque horrors of grief.",
      "author": "Tara Brady"
    },
    {
      "text": "This setup is positively brilliant.",
      "author": "Max Weiss"
    },
    {
      "text": "An intriguing idea for a movie that is more moody than scary, with long dull stretches where you feel like you've entered a cult of somnambulists.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "[\"Midsommar\"] is a movie that isn't so much traditionally scary as it is maddeningly unsettling and punctuated with shock.",
      "author": "Brad Keefe"
    },
    {
      "text": "The hills are alive with the sound of mayhem as Florence Pugh delivers a stirring performance in this unconventional odyssey that borrows elements from The Wicker Man, and Ti West's The Sacrament. Make no mistake, this is visionary horror.",
      "author": "Joe Friar"
    },
    {
      "text": "\"Midsommar\" is no slouch on chills, but they creep up slowly, like a bad trip from one of the Swedes' festive glasses of hallucinogenic tea, and are leavened with an occasional dash of humor.",
      "author": "Sara Stewart"
    },
    {
      "text": "It's hard to escape the sense that Ari Aster is getting off on Florence Pugh sobbing and screaming as he fetishizes her terror and torment. And none of it is in the pursuit of any meaning or message.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Ari Aster masterfully cultivates a horror film dressed as a relationship drama, centered on the cultural and societal thematics of death, mental illness, and survival with powerful performances from all cast.",
      "author": "Amanda Sink"
    },
    {
      "text": "...an outlandish imagining of the effects of personal trauma, especially for someone who already struggles with an unsteady mind.",
      "author": "Josh Larsen"
    },
    {
      "text": "[Midsommar's] the feel-mad movie of the decade.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "An ambitious but not entirely successful movie...",
      "author": "Kurt Loder"
    },
    {
      "text": "Technically, Midsommar is sound and Aster utilises all the same flourishes that made Hereditary so compelling, but the uninspired characters, simplistic plot and overlong run time drag the film from greatness to merely average.",
      "author": "Kat Hughes"
    },
    {
      "text": "Ari Aster is back with Midsommar, and his unique approach and vision to suspenseful horror that he started with Hereditary continues to evolve and for those receptive to his approach, improve.",
      "author": "Bill Watters"
    },
    {
      "text": "Sick but also beautiful, the film gets away with an impressively audacious running time, simply because it can. It dazzles you with dread.",
      "author": "Tim Robey"
    },
    {
      "text": "For decades, horror films have conditioned us to believe that bad things only happen in the shadows, but that's not the case here, and the knowledge that daylight is no longer a safe space makes Midsommar even more disturbing.",
      "author": "Brent Hankins"
    },
    {
      "text": "Aster's heroes start knocked off-balance by grief. This makes them more open to new experiences and ideas, but also susceptible to whatever evil lurks in the vicinity.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "Midsommar is a damn good horror movie, maybe even a great one. And, it's one of the funniest movies of 2019.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "There are horrors, but this is still a good horror film for those who don't like horror films as it's as much about the disturbing, menacing rhythm.",
      "author": "Deborah Ross"
    },
    {
      "text": "Midsommar specializes in dread rather than the genre's usual cheap tactics, building tension through fascination with and fear of the unknown.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "a tale of bucolic splendor, ecological harmony, and psychic terror, it's a wholly discomfiting, deliciously macabre experience",
      "author": "Andrea Chase"
    },
    {
      "text": "The cracks and inconsistencies are mostly erased by Pugh, a performer of alarming power, who possesses a face, indecently expressive, for which cinema was made.",
      "author": "Kevin Maher"
    },
    {
      "text": "Immersive, psychedelic menace is not the only reason Midsommar is one of the best films of 2019, but it's up there like a sun that never sets.",
      "author": "Sherilyn Connelly"
    },
    {
      "text": "(Ari) Aster has again put a fresh and gory bow on a genre that we know too well.",
      "author": "Tom Meek"
    },
    {
      "text": "Midsommar dives headfirst into the psychological terrors of codependency and the fear of being alone. The film is not scary in the traditional sense, but it's frightening in the fact that it sheds a light on the darkness of the human mind.",
      "author": "Adriana Gomez-Weston"
    },
    {
      "text": "If Aster's Hereditary was grief told in the style of The Conjuring, Midsommar is a mystic Swedish Beyoncé video.",
      "author": "Ryan Syrek"
    },
    {
      "text": "The sound design of Hereditary had your heart pounding with anxiety. Aster employs the same trick here in the opening scenes with significant effect, amplified by Pugh's harrowing howls of grief.",
      "author": "Joseph Walsh"
    },
    {
      "text": "A beautiful daymare that certifies Aster as cinema's next great master of horror.",
      "author": "Cameron Frew"
    },
    {
      "text": "[Its] blueprint is very tidy and yet the pieces within are too messy to hide their artificiality. The imagery is effectively unsettling, but too much feels inconsequential.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Oh, those wacky Swedes with their pagan death cults!",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "If I can't have all of you, then I don't want any of you.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Midsommar proves Ari Aster to be a director of masterful strength, you can't help but be in absolute awe of the beauty captured in this psychological nightmare-inducing vision unlike no other.",
      "author": "Ben Rolph"
    },
    {
      "text": "At a time where the studios play it safe with lot of pre-sold sequels, Midsommar takes a chance on something different.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Although it's unsettlingly effective and downright perversely weird, Midsommar, in all its taboo Swedish folklore glory could have the power to tip the scales regarding an abused partner finally leaving and moving on from a toxic relationship for good",
      "author": "Robert Kojder"
    },
    {
      "text": "It's a sort of cathartic ritual, in which the characters and the audience are equally unwitting participants.",
      "author": "Josh Bell"
    },
    {
      "text": "Forget the Chucky and Annabelle crap that passes itself off as horror. Ari Aster's sophomore effort is the real deal & so disturbing. Want to see real horror? This is it.",
      "author": "Gary Wolcott"
    },
    {
      "text": "No matter what, there's usually something going on in Midsommar worth unpacking, but with the film so stretched, a lot of the individual scenes, especially the transitional ones, don't feel as rich as they could.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "Set in broad daylight, during the time of Northern Europe's midnight sun, this horror movie isn't about getting the creeps so much as it is about the slow, methodical unmasking of horrors most human.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "All the tools that Ari Aster used in Hereditary are on display in Midsommar. However, it lacks the same compelling plot and strong core themes. Still, the movie has all the creeps and disturbing imagery you'd expect - plus an incredible sense of humor.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Midsommar succeeds, through the quiet force of Aster and his cohorts' craft, in sustaining an off-kilter mood that keeps you intrigued and engrossed.",
      "author": "Michael Gingold"
    },
    {
      "text": "A sunlit pagan nightmare that is (deliberately) less scary than 'Hereditary' but almost as disturbing.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Be cautious about inhaling the steam from a potion or eating the Swedish pot pie.",
      "author": "Michael Calleri"
    },
    {
      "text": "What makes [Midsommar] so enjoyable is Ari Aster's awareness of just how much our most beloved fairy tales have in common with our darkest nightmares.",
      "author": "Andrea Thompson"
    },
    {
      "text": "You laugh at its audacity, or maybe just to keep from losing your own grip on reality.",
      "author": "Sam Adams"
    },
    {
      "text": "You won't relate to anyone in the barmy bunch, and even Aster's ironic use of \"The Sun Ain't Gonna Shine Anymore,\" a '6os classic by the Walker Brothers, falls flat as delivered over the closing credits by Frankie Valli, of all people.",
      "author": "John Urbancich"
    },
    {
      "text": "Horrific it is. And also thrillingly weird and beautiful.",
      "author": "Peg Aloi"
    },
    {
      "text": "As in Shirley Jackson's story \"The Lottery,\" Aster hints that the price of paradise is not dreaming; it is blood.",
      "author": "Rick Levin"
    },
    {
      "text": "Ari Aster's second feature debut is hurt by the inherent lack of originality in the story now that we know his style, obsessions, and interests, despite a strong performance by Florence Pugh and appealing visuals",
      "author": "J. Don Birnam"
    },
    {
      "text": "There's no doubt that Aster is an artist of considerable gifts; the question is whether he's an artist of ideas deeper than turning the smiles of a summer night into sinister rictus grins.",
      "author": "Ann Hornaday"
    },
    {
      "text": "\"Midsommar\" gets it right. This twisted daylit nightmare is a masterpiece of mood, all the more disturbing since it's set entirely underneath the bright, beating sun. Anyone can be scared of the dark. Ari Aster makes you scared of the light.",
      "author": "Adam Graham"
    },
    {
      "text": "The ensuing narrative is expansive, a bit funny, full of elaborate invented culture, and overall less exhausting (and exhilarating) than Hereditary.",
      "author": "Joule Zelman"
    },
    {
      "text": "Through the force of her complex, engrossing performance, Pugh brings Dani's many ambiguities to light.",
      "author": "Lindsay Zoladz"
    },
    {
      "text": "The key dichotomy in Midsommar's network of contradictions is the one between humor and horror, which also informs many of the genre classics that Aster admires.",
      "author": "Adam Nayman"
    },
    {
      "text": "In his second feature, director Ari Aster shows he has a limited number of tricks up his sleeve.",
      "author": "Ben Sachs"
    },
    {
      "text": "The realness is there, even if it's masked by freaky, made-up Scandi folklore.",
      "author": "Brooke Bobb"
    },
    {
      "text": "As a bleak comedy of romantic deterioration, it can be wittily incisive.",
      "author": "Nick Schager"
    },
    {
      "text": "This is a film wherein textiles and tapestries and secret tomes tell us the truth even as people of all affiliations shakily lie.",
      "author": "Jason Shawhan"
    },
    {
      "text": "Midsommar is a horror movie for people who have lived idyllic lives free of horror movies.",
      "author": "Peter Howell"
    },
    {
      "text": "The saving grace of Midsommar is a spectacular visual design.",
      "author": "Jenna Stoeber"
    },
    {
      "text": "Plenty of times Midsommar barges past metaphor into a glaringly incomplete storyline. But as a cathartic effigy to bad boyfriends, so-called sanity and the American way, Midsommar earns its flower crown.",
      "author": "Chance Solem-Pfeifer"
    },
    {
      "text": "For all the grisly images we see, it's moments of emotional violence that have most stuck with me.",
      "author": "Adam Lubitow"
    },
    {
      "text": "Much of Midsommar's two-and-a-half-hour runtime is cushioned with trippy sequences, sun-bleached images, and drawn-out pagan rituals-a feel rather than a story.",
      "author": "Audra Schroeder"
    },
    {
      "text": "Midsommar will work best for those who are fans of fairytale art, folklore and horror altogether.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Superbly creepy.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Midsommar is far from perfect and isn't even the most twisted film of the year ... but there's something about [writer/director Ari] Aster allowing so much misery to take place in broad daylight that makes his film tough to behold.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Aster's follow-up is another daring entry into the horror genre -- a film that disturbs its audience and will stay with you long after you leave the theater.",
      "author": "Micheal Compton"
    },
    {
      "text": "My hope is that in the end, it will prove to be just another uneven second feature from a talented newcomer who needed to clear the deck of some bad ideas before going on the make the kind of knockout film that takes full advantage of their talents.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "It's a vanity project stretched to the gills with overcooked camera shots that conspicuously blur the boundaries between fantasy and reality.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "Alongside the demonstrations of exceptional bloodshed and ritual sacrifice in Midsommar is a complex web of imagery and world-building that hints at customs that have thrived in isolation.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Okay, it doesn't quite reach the heights -- or plunge the depths -- of Hereditary, but Midsommar cements Aster as one of the most exciting and disturbing voices in horror cinema today.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Midsommar is a disappointing experience that hides its shortcomings with pretty pastels and a lot of gore.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Ambitious and sprawling, there are the bones of a richer movie in here if only they'd reduced the 147-minute run time.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Ari Aster's version of a breakup movie is fascinating and horrifying. The score/ visuals, plus a fantastic Florence Pugh, make it compelling and haunting in equal measure.",
      "author": "Joey Magidson"
    },
    {
      "text": "Midsommar brings terror into the light in this shocking pastoral horror film.",
      "author": "Molly Henery"
    },
    {
      "text": "This \"Midsommar\" trip feels a bit like a wasted opportunity. (Full Content Review for Parents - Violence, Profanity, Nudity, Sex, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "At two hours and 20 minutes in length, Midsommar takes too much time getting to the point, whatever the point might be.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Another ambitious undertaking from Ari Aster who has once again managed to bring us a thrilling and truly inspired modern horror. Not for the faint hearted.",
      "author": "Linda Marric"
    },
    {
      "text": "... a substance-induced descent into the madness of strangers, viewed in plain sight under a bright sun instead of hidden in shadow... this time providing a unique light at the end of a blood-drenched tunnel.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Aster has a real knack for showcasing the horror resulting from large groups of white people getting together.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Pugh goes beyond scream-queen expectations as Dani, as her vulnerability turns into a type of armor, her personal pain transmuted to a dance of death.",
      "author": "Sean P. Means"
    },
    {
      "text": "Colorful, well written, messed up, and disturbing - but also visually fascinating, which is what Ari Aster does best.",
      "author": "Rendy Jones"
    },
    {
      "text": "There isn't much to Midsommar beyond the shock value, and that has diminishing returns.",
      "author": "Steve Katz"
    },
    {
      "text": "Midsommar, much like the festival at the center of the plot, is a rare experience that is not to be missed.",
      "author": "Caitlin Kennedy"
    },
    {
      "text": "Aster leaves the audience with a devilishly funny and despairing experience of mind, body, and spirit...",
      "author": "Chris Feil"
    },
    {
      "text": "Ari Aster continues on as filmmaking's ringleader of grief in Midsommar, an unsettling, often shocking portrayal of cultic life that's rich with both ambition and beauty.",
      "author": "Luke Parker"
    },
    {
      "text": "Another groundbreaker in horror from Hereditary's Ari Aster who mixes a modern breakup story with pagan rituals in Sweden. If you're looking for the scariest movie ever shot in blinding sunlight, the raw and riveting Midsommar is it.",
      "author": "Peter Travers"
    },
    {
      "text": "There's a reckoning coming for everyone in Midsommar, and it's as cold, harsh, and unforgiving as the light of a northern sun.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Emotionally raw and garishly demented, Midsommar uses the markers of European folk-horror to critique the miserably human compulsion to cling to bad relationships.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "\"Midsommar\" understands that the scariest things sometimes happen in broad daylight.",
      "author": "Ty Burr"
    },
    {
      "text": "Midsommar tests our patience more than once before delivering some seriously grisly and wonderfully twisted material in the final act.",
      "author": "Richard Roeper"
    },
    {
      "text": "If your favorite part of Hereditary was its crazy ending and you didn't think it was crazy enough, then Midsommar is the movie for you!",
      "author": "Edward Douglas"
    },
    {
      "text": "A kind of waking nightmare that reaches down into the darkest corners of the human soul where few horror films ever dare to go.",
      "author": "Mattie Lucas"
    },
    {
      "text": "...there is so much to ponder and enjoy in his filmmaking that maybe it doesn't matter that the plot never delivers the emotional or intellectual punch the film needs.",
      "author": "Marisa Carpico"
    },
    {
      "text": "High-art horror that won't suit all tastes, or stomachs.",
      "author": "Rafer Guzman"
    },
    {
      "text": "An underwhelming, insipid and pretentious bore. It doesn't work as a horror film, comedy, drama, romance, psychological character study nor as a satire. What's the deal with the random Austin Powers reference?",
      "author": "Avi Offer"
    },
    {
      "text": "A lugubrious exercise in self-indulgence...ambitious but predictable, moody but sluggish, only sporadically creepy and sometimes deliberately repulsive, and, ultimately, rather dull.",
      "author": "Frank Swietek"
    },
    {
      "text": "As disturbing as it is, it's impossible not to watch Midsommar and revel in its madness.",
      "author": "Tom Santilli"
    },
    {
      "text": "Its emotional realism is important since what ultimately happens is so unseemly and appalling.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Aster crafts a vengeful breakup story that will haunt your dreams.",
      "author": "Victor Stiff"
    },
    {
      "text": "Midsommar musters no such productive uncertainty of feeling, nothing in the way of genuine horror. There is only cruelty and coldness, draped in billowy peasant gowns and wreathed in radiant garlands.",
      "author": "John Semley"
    },
    {
      "text": "This film is undoubtedly one deliciously dark experience.",
      "author": "EJ Moreno"
    },
    {
      "text": "Indiana Jones' Temple of Doom's got nothing on the Attestupan in Midsommar.",
      "author": "Fred Topel"
    },
    {
      "text": "I'm thrilled that an original story like Midsommar exists.",
      "author": "Taylor Antrim"
    },
    {
      "text": "But I found it impossible to appreciate the plot being predictable throughout, especially when this is supposed to be suspenseful.",
      "author": "Michael Smith"
    },
    {
      "text": "Midsommar takes the mundane misery of a disintegrating relationship and renders it as a Technicolor thriller.",
      "author": "David Sims"
    },
    {
      "text": "Midsommar is a lot of things worth talking about, but forgettable certainly isn't one of them.",
      "author": "Andrew Parker"
    },
    {
      "text": "Horror is a fragile thing. Suspension of disbelief is key to its effectiveness... In \"Midsommar,\" the spell breaks at the end and the picture collapses.",
      "author": "Soren Andersen"
    },
    {
      "text": "Visually innovative and unequivocally curious, despite wholly disappointing.",
      "author": "Dustin Chase"
    },
    {
      "text": "A deeply unnerving disturbia that scorches dark recesses of the imagination with savage, searing grotesqueries that linger long after the credits roll.",
      "author": "Neil Pond"
    },
    {
      "text": "It's a film that amounts to a group therapy session for many viewers, including me.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Gorgeous, expansive photography and a folksy choreography make up for the movie's convoluted plot.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "The difference between Ari Aster's two films is that Midsommar is not scary, not in the slightest.",
      "author": "Sarah Ksiazek"
    },
    {
      "text": "Aster's control is startling: With diabolical suggestiveness he keeps widening the chasm between Dani and Christian, placing visual and emotional space between two people whose souls have long since drifted apart.",
      "author": "Justin Chang"
    },
    {
      "text": "Aster is a filmmaker still defining his voice, and despite the growing pains, \"Midsommar\" is an intriguing step in its evolution.",
      "author": "Barbara VanDenburgh"
    },
    {
      "text": "The dreamy, color-drenched aesthetic combined with body horror and humor makes for a tonal roller coaster that leaves audiences with a kind of dissonant stomach-churning disturbance that's not easy to shake.",
      "author": "Katie Walsh"
    },
    {
      "text": "In place of plot surprises, Aster tries surprising you with repulsive sights, hitting you unexpectedly with some new revolting close-up at regular intervals.",
      "author": "Mick LaSalle"
    },
    {
      "text": "While not as unpredictable or unforgettable an effort as \"Hereditary,\" Aster's follow-up is similarly hard to shake as you ponder its metaphors and meanings.",
      "author": "Brian Truitt"
    },
    {
      "text": "The story drags and wobbles. But still, Aster's strengths as a director show themselves.",
      "author": "Karen Gordon"
    },
    {
      "text": "The film is brimming with seriously dedicated world-building, including creepy illustrated histories dotting the village's interiors that feel ripped from a Henry Darger book, but all the exposition doesn't actually make for an engaging horror film.",
      "author": "Hazel Cills"
    },
    {
      "text": "There is a way to marry horror with real experience and emotion, but Aster has yet to crack that formula.",
      "author": "Jourdain Searles"
    },
    {
      "text": "[Florence] Pugh, who, like Toni Collette in Hereditary, is a tour de force and worthy of all the praise that she will surely receive, is fantastic. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "A film that I think people should see, especially when considering the craft on display, master work in just about every aspect...however, the most important part was forgotten about: telling a compelling story.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Implacable but slight, Midsommar leaves us grasping at straws.",
      "author": "Elena Lazic"
    },
    {
      "text": "Midsommar can fascinate or horrify a viewer by constantly twisting genre tropes. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "A droll comedy of manners, an irresistible revenge fantasy and a warning to bad boyfriends everywhere. It's the best breakup movie I've seen in ages.",
      "author": "Sean Burns"
    },
    {
      "text": "A terrifically juicy, apocalyptic cinematic sacrament that dances around a fruitless relationship in dizzying circles.",
      "author": "Tomris Laffly"
    },
    {
      "text": "The movie revels in sadistic gore and lurid sex, and its main ideas-anti-ethnographic skepticism and American cultural self-sufficiency-are petty and narrow.",
      "author": "Richard Brody"
    },
    {
      "text": "Bring the kids.",
      "author": "Asher Luberto"
    },
    {
      "text": "Viewers thirsting for an imaginative complex plot open to interpretation will appreciate the direction Aster has taken his sophomore film; others may call it a convoluted mess",
      "author": "Jason Escamilla"
    },
    {
      "text": "While its artistic and thematic audacity are undeniable, Midsommar is sure to be one of 2019's most divisive films.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "This bloated, boring exercise squanders the goodwill generated by the director's outstanding 'Hereditary.'",
      "author": "Christian Toto"
    },
    {
      "text": "With hype so high the only way is down and Midsommar (that's mid-so-MAR) hits the wall with a fizzle, not a bang.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Meandering and underwhelming. One bad trip.",
      "author": "Hannah Strong"
    },
    {
      "text": "Midsommar is distressing not because of the bizarre cult rituals on display, but because Aster's film is all style with little substance.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "At two hours and 20 minutes, Midsommar is ponderously slow, giving us plenty of time to simply watch Aster's script hit its marks and wonder why his characters take so long to figure out what's happening around them.",
      "author": "Norman Wilner"
    },
    {
      "text": "Midsommar is very much its own beast, a folk-horror film in the tradition of The Wicker Man that also mines existential dread from the raw anguish felt by its main character.",
      "author": "Cheryl Eddy"
    },
    {
      "text": "A harrowing and hypnotizing descent into madness, despite landing at an expected destination for the genre.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "Florence Pugh is incredible and Ari Aster is a masterful filmmaker - whether his stories are for you or not.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "This is a movie that is designed to overwhelm your senses and to stay with you afterward and it very much succeeds in both of those things.",
      "author": "Vivian Kane"
    },
    {
      "text": "What did Sweden ever do to anyone to deserve this?",
      "author": "Kelly Vance"
    },
    {
      "text": "Midsommar plays like a slow and inevitable train wreck. It may not surpass Aster's previous film, but it does show us that not all horrors live in the dark.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "It takes a LONG time for all this to unfold, and its predictability is almost as discomfiting as some of the more gruesome scenes.",
      "author": "Chuck Yarborough"
    },
    {
      "text": "The studios have been treating audiences like newborns (formula, round the clock). So when a movie like Midsommar comes along, and goes out of its way to so flamboyantly flout convention, it deserves credit just for being undefinable.",
      "author": "John Anderson"
    },
    {
      "text": "Midsommar is a millennial nightmare through a Lynchian lens.",
      "author": "Spencer Perry"
    },
    {
      "text": "Aster makes your brain feel flayed or your eyes have popped out then injected with poisoned quills, or like someone slid a snake in your skull. For Midsommar is both a warped but gorgeous masterpiece and retina searing freak-out.",
      "author": "Daniel Goodwin"
    },
    {
      "text": "Pugh's performance and Aster's filmmaking demand attention, even if they don't necessarily hold up to much scrutiny.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "As in his debut, Hereditary, writer-director Ari Aster casts Midsommar as a conflagration of grief and no ounce of nuance will keep his characters from gasping, choking and hollering all the way to their bleakly inevitable ends.",
      "author": "Dom Sinacola"
    },
    {
      "text": "The entire film feels like a slow descent into frenzied, ritualized madness - you don't realize what's happening until it's too late to stop it.",
      "author": "Anne Cohen"
    },
    {
      "text": "Midsommar is the horror movie to beat in 2019. Caution: contains distressing amounts of folk music.",
      "author": "Nick De Semlyen"
    },
    {
      "text": "Visceral paroxysms of grief--that sort of hyperventilating wail over the phone telegraphing Dani's state of mind--indelibly linger in ours.",
      "author": "Rubin Safaya"
    },
    {
      "text": "If you're seeking another original, disturbing experience that won't allow you leave the theater with a peaceful mind, Midsommar is the perma-sunny nightmare for you.",
      "author": "Alexandra August"
    },
    {
      "text": "Ari Aster's movies feel like an entirely novel experience in a way few others do.",
      "author": "Vincent Mancini"
    },
    {
      "text": "While Midsommar never bores or truly overstays its welcome, its languor wobbles into meandering tonal shifts, with unlikely intrusions of absurdist humor.",
      "author": "Richard Whittaker"
    },
    {
      "text": "Midsommar is a mixed bag that blends unsettling horror with bizarre comedy, resulting in a film that's equal parts fascinating and frustrating.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "A \"Wicker Man\" riff that's extremely long and terribly light with crucial psychological details.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Aster's sophomore film is a bit like the writing on the walls in his first - intriguing and unsettling, begging for further analysis, yet probably offering nothing more than we see on the surface.",
      "author": "Laura Clifford"
    },
    {
      "text": "The movie works best, I think, as a black-comic treatise on what can befall a garden-variety passive-aggressive mixed blessing of a boyfriend if he's not careful.",
      "author": "Michael Phillips"
    },
    {
      "text": "Beware the filmmaker who's exercising, when just making films will do.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "A renaissance of the macabre, a cinematic symphony of lulling, twisted goodbyes and portentous shadows in the blistering light of day. Once it latches on, there's no breaking away.",
      "author": "Dustin Putman"
    },
    {
      "text": "Midsommar is worth its weight in flowers, an echoed scream into the daylight.",
      "author": "Robert Daniels"
    },
    {
      "text": "Beautiful, devastating and thoroughly unpleasant, Midsommar is destined to become a horror classic, one that we discuss and break apart for years to come.",
      "author": "Adam Patterson"
    },
    {
      "text": "Via divine intervention, or more likely Aster's sharp grasp on the genre, Midsommar basks you in sunlight and dread to present something far more fun to unpack than Hereditary.",
      "author": "Conor O'Donnell"
    },
    {
      "text": "Sweden may be one of the happiest places on Earth, but Australian Writer/Director, Ari Aster(Hereditary), shows us the most disturbing bunch of blondes you could ever imagine.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Messy, intense, and singular. There is no other movie out there like Midsommar...Cements Ari Aster as a director who I will go see, no matter what he does next.",
      "author": "Dan Murrell"
    },
    {
      "text": "Aster seems to make films in which the end of the world might just come as a comfort, as something to be celebrated.",
      "author": "Clint Worthington"
    },
    {
      "text": "[Midsommar] takes its time, finds plenty of ways to inject comedy, and doesn't skimp out on the brutality horror fans are looking for.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Midsommar is as much a fairytale as it is a nightmare...The film causes you to cover your face, move in your seat, giggle, and ultimately question what you thought the happiest ending was for the story.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Unsettling and manic at almost every turn, Ari Asters sprawling sophomore effort proves he's no fluke, \"Midsommar\" is one gonzo acid-trip worth taking.",
      "author": "Nate Adams"
    },
    {
      "text": "An outstanding depiction of a broken relationship that turns into a so-so gorefest.",
      "author": "Matt Singer"
    },
    {
      "text": "Midsommar is truly a masterful work of art that only comes around every 90 years or so.",
      "author": "Shannon McGrew"
    },
    {
      "text": "Midsommar is a mind-blowing trip into complete lunacy that hides a positive message about empathy and self-actualization.",
      "author": "Michelle Kisner"
    },
    {
      "text": "Midsommar is an emotionally harrowing and slowly insidious journey, languidly forcing dread on the viewer, wrapping them in a weird nightmare summer camp of sunlight and cheer.",
      "author": "Witney Seibold"
    },
    {
      "text": "It's unkind to audiences at times, growing and maintaining a level of dread so intense you might glance at the closest exit. Commit to staying to the end, though...",
      "author": "Sarah El-Mahmoud"
    },
    {
      "text": "For all the trembling it inspires, Midsommar is unexpectedly hilarious.",
      "author": "Luke Hicks"
    },
    {
      "text": "'Midsommar' is the cult-fueled horror film for everyone out there who never learned to take the end of a relationship in stride.",
      "author": "Matthew Monagle"
    },
    {
      "text": "Once again carried by a commendably attenuated lead performance, this time from Florence Pugh, it's a bit of summertime sadness at turns foreboding and laugh-out-loud uncomfortable as a ferociously formulated analysis on sacrifice...",
      "author": "Nicholas Bell"
    },
    {
      "text": "Hårga is such a rich tapestry of terror, designed to envelope you in its creepy embrace, that it's a perverse pleasure to spend time traipsing through its grass. You may even want to put on a flower crown.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "Midsommar is an impressive, albeit flawed, sophomore effort from Aster, who once again demonstrates just why he's one of the most interesting filmmakers working today.",
      "author": "Heather Wixson"
    },
    {
      "text": "'Midsommar' feels as if a satanic eye sits at Aster's shoulder, nudging him further into the dark. It's a devilish horror feast about codependency. Florence Pugh gives a performance that absolutely slays.",
      "author": "Preston Barta"
    },
    {
      "text": "This is, in other words, a less perfectly crafted nightmare than Aster's last one. But there's a deranged integrity to its sprawl, and to the filmmaker's willingness to embrace the darkest, most unsparing aspects of human desire.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Midsommar presents a ruthless take on the rituals of processing grief and letting go, excavating the caverns of broken relationships and the nauseous truths of why we stay in them.",
      "author": "Haleigh Foutch"
    },
    {
      "text": "The skin-pricking pleasures of Midsommar aren't rational, they're instinctive: a thrilling, seasick freefall into the light.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Aster's blend of beauty, violence, horror and humor leads to a climax that is both disturbing yet exhilarating.",
      "author": "Kristy Puchko"
    },
    {
      "text": "By the end of its breathless two hours and 20 minutes, Midsommar has its dirty hooks in you. It's pure, guttural horror of the demonically human kind.",
      "author": "Lindsey Romain"
    },
    {
      "text": "There's no cutting away from the disturbing in Midsommar (in fact, the camera prefers to push into the worst of it); you will look at this, and you will see the violence that is life and death, the movie says.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Perhaps Midsommar doesn't jell because its impulses are so bifurcated.",
      "author": "David Edelstein"
    },
    {
      "text": "A savage yet evolved slice of Swedish folk-horror, Ari Aster's hallucinatory follow-up to Hereditary proves him a horror director with no peer.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Midsommar is a warm invitation into subtle ritualistic madness decked out in the reassurance of pastel colors. Striking, unsettling, and surprisingly humorous.",
      "author": "Matt Donato"
    },
    {
      "text": "A horror movie that, at times, almost feels like a surreal comedy, Aster's sophomore effort hits unlikely bumps along the way, but is powered by his considerable visual framing talents and a very strong performance from Florence Pugh.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "\"Midsommar\" is its own kind of cautionary tale, a floral, psychedelic, \"He's Just Not That Into You\" for movie-going culture.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "While his previous feature offered an unwavering look at the splintering of one family, Midsommar compartmentalizes Dani's grief (and refuses even to bother explaining the murders) as it pivots away from it both tonally and narratively.",
      "author": "Candice Frederick"
    },
    {
      "text": "What's most unnerving about this oversaturated, leafy green hell is that if you spend enough time with them, their traditions are more than inviting to contemporary eyes; they're intoxicating.",
      "author": "David Crow"
    },
    {
      "text": "An intermittently impressive and frustrating film, but worth watching for every single one of its flaws.",
      "author": "William Bibbiani"
    },
    {
      "text": "Though it's not outright scary, Midsommar will no doubt unsettle even the most steeled of viewers. It will also satiate those who may have feared a sophomore slump from Aster.",
      "author": "Trace Thurman"
    },
    {
      "text": "Not quite a revelation, Midsommar is still a damn good film.",
      "author": "J Hurtado"
    },
    {
      "text": "Aster's latest, the folk-horror extravaganza Midsommar, is unquestionably a scary movie. And yet, it's also surprisingly hilarious.",
      "author": "Chris Evangelista"
    },
    {
      "text": "All in all, I liked Midsommar a lot.",
      "author": "Scott Wampler"
    },
    {
      "text": "Midsommar is a shocking piece of filmmaking-unnervingly competent even when the film yaws into silliness, even when it risks tedium.",
      "author": "Richard Lawson"
    },
    {
      "text": "What a blast to watch this emerging auteur mess around.",
      "author": "Eric Kohn"
    },
    {
      "text": "More unsettling than frightening, it's still a trip worth taking.",
      "author": "John DeFore"
    },
    {
      "text": "Once the real fireworks start to ignite, you realize how powerfully the film's themes resonate when they're given room to breathe. It's just a shame it takes so long to bring them into focus.",
      "author": "Andrew Barker"
    },
    {
      "text": "You will be shocked, you will be devastated, and you will think about it long after the credits roll.",
      "author": "Jonathan Barkan"
    },
    {
      "text": "Sometimes hypnotic, sometimes overcooked, always intriguing, \"Midsommar\" occasionally falls flat, but Florence Pugh holds the film together -- especially when its plotting stumbles or its shocks grow predictable.",
      "author": "Tim Grierson"
    }
  ],
  "release_year": 2019,
  "duration": 145,
  "genres": [
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "A young American couple, their relationship foundering, travel to a fabled Swedish midsummer festival where a seemingly pastoral paradise transforms into a sinister, dread-soaked nightmare as the locals reveal their terrifying agenda.",
  "popularity": 6.3,
  "poster_url": "https://image.tmdb.org/t/p/original/7LEI8ulZzO5gy9Ww2NVCrKmHeDZ.jpg"
}