{
  "movie_name": "Pan's Labyrinth",
  "movie_id": "pans_labyrinth",
  "total_reviews": 237,
  "reviews": [
    {
      "text": "A few of the tales are a bit of a stretch, but the scope of the Pan's Labyrinth universe comes out feeling much larger than ever before.",
      "author": "Rachel Bellwoar"
    },
    {
      "text": "Tremendously profound... [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Those who seek fizzier, stomach-calming seltzer at the movies are advised to look elsewhere. Others, like me, will surrender gratefully to the black and bloody enchantment.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The script is undoubtedly better than the movie. Majestic production design in what remains as one of the fantasy classics. Del Toro's eternal beginnings. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Del Toro's finest work to date, beautifully blends magical worlds and fairy tales with grim, real-world evilness. The results are profound and moving. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Guillermo Del Toro returns fairy tales back to their deathly origins.",
      "author": "Brian Eggert"
    },
    {
      "text": "Pan's Labyrinth proved that del Toro's most intimate and imaginative stories are also his most resonant and beautiful...",
      "author": "Jim Rohner"
    },
    {
      "text": "Insert list of superlatives here - I just love this film so so so so much.",
      "author": "Charlotte Harrison"
    },
    {
      "text": "It's rare to see a production of such breathtaking magnitude, with an absolutely singular vision and spellbinding fantasy components.",
      "author": "Mike Massie"
    },
    {
      "text": "To date Guillermo Del Toro's most provocative accomplishment, Pan's Labyrinth is a beautifully realized but brutal fairy tale.",
      "author": "Nicholas Bell"
    },
    {
      "text": "PAN'S LABYRINTH harks back to a time when fairytales were dark and filled with life lessons prior to the tales being taken up by Disney's more family-friendly hands.",
      "author": "Sarah Musnicky"
    },
    {
      "text": "His (Toro's) incredible visual style, uncanny CGI world, and gift for a particular style of storytelling knock this out of the park.",
      "author": "Maria-Christina Villaseñor"
    },
    {
      "text": "I'm not sure if \"Labyrinth\" is a film that will appeal to everyone, but if you are looking for a movie that will challenge as well as amaze, then this is the one to see.",
      "author": "Micheal Compton"
    },
    {
      "text": "Del Toro is a magnificent story teller and this labor of love is one of his many masterpieces.",
      "author": "Allison Rose"
    },
    {
      "text": "A modern-day fable for the ages - one that will live in the hearts of all who see it for years to come.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Guillermo del Toro's brutal, breathtaking and magical finest hour is not kid-friendly.",
      "author": "Nguyên Lê"
    },
    {
      "text": "Although Pan's Labyrinth ends in tragedy, it does so to show us that, regardless of what we are told, there are no happy endings in war.",
      "author": "Hannah Ryan"
    },
    {
      "text": "This is a wildly creative film that plays on your heart and your head, stunning in its rich imagery and ambitious in its themes.",
      "author": "Giovanni Fazio"
    },
    {
      "text": "The film is one of those rare beasts, with a sense of genuine permanency. It beds down in your mind, like it is preparing to live there for a while. It is not pretty, but it is, sometimes, very beautiful.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "...all the shivering intensity and satisfying denouement of the darkest Grimm's fairy tale.",
      "author": "Chris Barsanti"
    },
    {
      "text": "Bewitchingly bonkers.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Pan's Labyrinth isn't a total success, but it confirms that del Toro is one of the few genuinely visionary directors working today. And his best may still be to come.",
      "author": "Christopher Tookey"
    },
    {
      "text": "It's so audacious and so technically accomplished, and arrives here garlanded with so many radiant superlatives, that I wish I liked it more.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "[del Toro's] creatures are just wondrous!",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "The story is a compelling and deeply involving one, and the film is both beautiful, exciting, and sometimes horrifying. The creature effects are superbly handled.",
      "author": "David Stratton"
    },
    {
      "text": "The cinematography and creature effects are terrific, while the subtitles never get in the way of the story which follows young girl Ofelia (Ivana Baquero) into a nether world which will test her to the limit with a series of dangerous tasks.",
      "author": "Graham Young"
    },
    {
      "text": "Haunting and visually spectacular, this Spanish fable is not a story for children so much as an illustration of the blurred line between reality and daydreams that manifests with such resonance in childhood.",
      "author": "Marta Jary"
    },
    {
      "text": "In this magical and immensely moving film del Toro presents both the narrative strands as equally real, equally plausible.",
      "author": "Philip French"
    },
    {
      "text": "This is an amazing work of cinema by any estimation, and is by far one of the most original and memorable films in recent memory.",
      "author": "Filip Vukcevic"
    },
    {
      "text": "It's less of a labyrinth than a forest path, one that takes you through wonderful scenery but doesn't lead anywhere.",
      "author": "Nicholas Barber"
    },
    {
      "text": "We are never allowed to get truly lost in Pan's Labyrinth. The fantasy sequences are fetching when they should be intoxicating, while the scenes above ground are largely prosaic.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "Watching the unique explosions of Guillermo del Toro's mind realise themselves on screen is truly astounding.",
      "author": "Helen Cowley"
    },
    {
      "text": "With strong performances by much of the cast, particularly the young Baquero, and almost-seamless special effects, the praise is well earned.",
      "author": "Angelina Conti"
    },
    {
      "text": "It sinks deep into your soul and surprises you with its bravery and warmth. As harsh as it is human, filmmaking doesn't get any more enlightened than this.",
      "author": "Bill Gibron"
    },
    {
      "text": "We are left with the unsettling knowledge that, in the universe crafted by Guillermo del Toro as well as in our own, we are always surrounded by monsters.",
      "author": "Aaron Mesh"
    },
    {
      "text": "I feel as if I've seen not only the best fantasy movie for ages but also probably the best horror film.",
      "author": "Matt Holmes"
    },
    {
      "text": "Pan's Labyrinth seems as if it has a direct, unfiltered link to the horrors that can haunt a child's mind. It'll likely lurk in yours for weeks to come.",
      "author": "Matt Soergel"
    },
    {
      "text": "Grotesque and macabre thrills here, but not a fantasy-masterpiece. There's a drawn-out-ness to the plot that extends to the time-period being overdrawn. Captain Vidal's an overstated fatherland fascist; the political history becomes morbid melodrama.",
      "author": "Brian Gibson"
    },
    {
      "text": "This remarkable film spins a yarn about a little girl trapped between a dream world of ghouls and real-life monsters during the Spanish Civil War, and it works remarkably well, simultaneously enchanting and horrifying with almost every frame.",
      "author": "Corey Hall"
    },
    {
      "text": "This grim spin on Alice in Wonderland is del Toro's finest work to date.",
      "author": "Alan Jones"
    },
    {
      "text": "Pan is clearly not for kids. But it is an eye-popping political fable filled with magic realism -- and real magic.",
      "author": "Leah Rozen"
    },
    {
      "text": "A stark, disturbing fairy story for adults. Its provocative vision of the monsters of fascism and childhood packs chilling power.",
      "author": null
    },
    {
      "text": "This darkly attractive film has a painterly quality to its visual look and some impressively elaborate animatronic effects that will delight genre fans.",
      "author": "Allan Hunter"
    },
    {
      "text": "Guillermo del Toro has crafted a masterpiece, a terrifying, visually wondrous fairy tale for adults that blends fantasy and gloomy drama into one of the most magical films to come along in years.",
      "author": "David Germain"
    },
    {
      "text": "This is a fantasy realm so fully and elegantly realized, it might be the adaptation of a classic novel. Yet the source is Del Toro's own capacious imagination.",
      "author": "Mary Corliss"
    },
    {
      "text": "The close-out of Pan's Labyrinth not only underlines its status as one of the great fantasy films of all time, but also its importance as a work of refined social and historical commentary.",
      "author": "Simon Foster"
    },
    {
      "text": "a captivating, albeit unstable, blend of anti-Fascist social commentary and a visually sumptuous childhood fable",
      "author": "Jay Antani"
    },
    {
      "text": "Fully deserving of its place in a distinguished political-fabulist lineage",
      "author": "Fernando F. Croce"
    },
    {
      "text": "Ofelia's smock is swiped from Alice, her faun from Narnia, and her magic book from Harry Potter, Del Toro sets her fairytale apart with its unrelenting gore and misery.",
      "author": "Amy Nicholson"
    },
    {
      "text": "One of the best films made in the last ten years...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Arresting though they may be, these mind-boggling effects, shot with limpid mystery by Guillermo Navarro and accompanied by chitinous whirs and crackles on the uncanny soundtrack, don't disrupt the double narrative but intensify it.",
      "author": "Peter Keough"
    },
    {
      "text": "Pan's Labyrinth us that such fantasy offers no real escape from dreadful reality.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "...a dark and wonderful fairy tale for grown-ups...",
      "author": "Brandon Fibbs"
    },
    {
      "text": "It's an odd mixture, and one which many prospective viewers may feel uncertain about, but it's very much worth watching.",
      "author": "Jennie Kermode"
    },
    {
      "text": "Pan's Labyrinth suggests that fairy-tale violence helps the vulnerable process and overcome real-life conflicts and that real-life violence permanently smashes the soul and the heart.",
      "author": "Carrie Rickey"
    },
    {
      "text": "[A] beautiful but relentlessly bleak fairytale.",
      "author": "Joe Lozito"
    },
    {
      "text": "A film with vision...",
      "author": "Jason Gorber"
    },
    {
      "text": "We feel pity, terror, disgust, wonder, astonishment, shock, and, ultimately, hope. It does everything we could ask ....",
      "author": "John J. Puccio"
    },
    {
      "text": "I saw better films in 2006 -- but none more imaginative than Guillermo del Toro's communal masterpiece. Bring a friend, and you'll have plenty to talk about.",
      "author": "Jonathan R. Perry"
    },
    {
      "text": "\"Pan's Labyrinth\" is impeccable filmmaking; it alone might be enough to seal del Toro's reputation as a master of cinema.",
      "author": "Beverly Berning"
    },
    {
      "text": "It contains both incredible beauty and horrific violence.",
      "author": "Beth Accomando"
    },
    {
      "text": "... An exquisite picture with equal doses of the fantastic and horrific.",
      "author": "Greg Maki"
    },
    {
      "text": "It is excellently made, and I am very glad I saw it, but I could never see it again, no matter how cool the faun was.",
      "author": "Karina Montgomery"
    },
    {
      "text": "A fantasy for adults that will make you feel both the intense wonder and fear of childhood more than any film in years.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Del Toro parallels the horror of two civilizations (one real, one imagined, each with their own monsters), crafting a rich and violent film for grownups who haven't lost touch with their childhood resources.",
      "author": "Mark Palermo"
    },
    {
      "text": "It is not my cup of grim ...",
      "author": "Lori Hoffman"
    },
    {
      "text": "Guillermo del Toro's excellent new film, \"Pan's Labyrinth,\" is a violent, enthralling children's movie made for adults.",
      "author": "Christopher Smith"
    },
    {
      "text": "Del Toro has an unmistakable aesthetic -- his movies bear the stamp of an auteur.",
      "author": "Randy Shulman"
    },
    {
      "text": "...\"Pan's Labyrinth\" is an outstanding film and, along with fellow multiple Oscar nominee \"Babel,\" a true testament to the talent that exists outside America.",
      "author": "Michael A. Smith"
    },
    {
      "text": "In the British newspaper, Guardian Unlimited, del Toro credited British illustrator Arthur Rackham and the works of Goya...Guillermo del Toro has joins their ranks with this film.",
      "author": "Uri Lessing"
    },
    {
      "text": "Is Pan's Labyrinth a war movie with fantasy elements? Or is it a fantasy film laced with political allegory? The beauty of del Toro's story is that it could be read either way.",
      "author": "Sean P. Means"
    },
    {
      "text": "When was the last time a fantasy flick brought to mind Schindler's List?",
      "author": "Matt Brunson"
    },
    {
      "text": "A gorgeously executed and disturbingly violent moving picture poem that bravely flies in the face of genre convention and stands alone in its purpose.",
      "author": "Jovanka Vuckovic"
    },
    {
      "text": "Pan's Labyrinth is bold and original, a mini-masterpiece of fantasy filmmaking that deserves to be seen by a wide audience.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Pan's Labyrinth, a masterpiece of fantasia by Mexican director Guillermo del Toro, is at turns exquisitely beautiful, horrifying, and heart-wrenchingly sweet.",
      "author": "James Kendrick"
    },
    {
      "text": "Blending fantasy and reality, Pan's Labyrinth is an engaging film about a young girl looking to escape the horrendous environment in which she finds herself.",
      "author": "Wesley Lovell"
    },
    {
      "text": "A woman's revolutionary fearlessness, with a touch of magic.",
      "author": "Prairie Miller"
    },
    {
      "text": "Del Toro's film reveals a sad truth. With each life experience, one gets further and further from the naivete that makes pure imagination possible.",
      "author": "Eric Melin"
    },
    {
      "text": "In no way can one mistake this for a children's film.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Un ambicioso y no del todo convincente cuento de hadas para adultos, que reivindica el poder de la imaginación como vía de escape ante la adversidad y como arma frente a la intolerancia.",
      "author": "Enrique Buchichio"
    },
    {
      "text": "... told both from the numb, accepting view of an adult... and from the eyes of a child where even the tiniest glimmer of hope pierces the darkness like a shard of starlight.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "So breathtaking in its artistic ambition, so technically accomplished, so morally expansive, so fully realized that it defies the usual critical blather. See it, and celebrate that rare occasion when a director has the audacity to commit cinema.",
      "author": "Ann Hornaday"
    },
    {
      "text": "the most beautiful and redemptive film of 2006",
      "author": "John A. Nesbit"
    },
    {
      "text": "This one has mind-blowing visuals that employ many 'organic' effects (del Toro prefers to use makeup prosthetics and other devices, eschewing computer graphics).",
      "author": "Jeff Vice"
    },
    {
      "text": "An uneasy mix of childlike, Tim Burton-esque imagination and brutal Spanish war-torn drama.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Employing elegance, tension, fright and invention, Pan's Labyrinth holds court with rapture and awe from start to finish, with an invigorating conclusion solidifying it as the stuff of stories-turned-legends. It's one of the best films of 2006.",
      "author": "Nick Rogers"
    },
    {
      "text": "Although it's a story of a child's fantasy world, Pan's Labyrinth is not for children.",
      "author": "Linda Cook"
    },
    {
      "text": "Unlike many other popular fantasists, del Toro is brave and honest enough to acknowledge that if fantasy is a refuge, it's not necessarily a shield.",
      "author": "John Beifuss"
    },
    {
      "text": "A dark fairy tale that only Guillermo del Toro could bring to life. The screenwriter/director can do no wrong.",
      "author": "Alex Sandell"
    },
    {
      "text": "A film of great visual imagination, depicting a child's dream world on one hand, and man's inhumanity to man in the real world.",
      "author": "Robert Roten"
    },
    {
      "text": "Guillermo del Toro's Pan's Labyrinth brilliantly melds the realms of fairy tale and brutal 20th-century history. Beautiful, horrible and deeply affecting, it's the 21st century's first film masterpiece.",
      "author": "John Wirt"
    },
    {
      "text": "The fantasy segments are splendidly spooky and full of memorable images... a haunting heartbreaker... that dares to enter a troubled child's mind to sympathetically sort out the contents.",
      "author": "James Sanford"
    },
    {
      "text": "Del Toro has realized a work of art that's too terrifying and politically motivated for young audience members who should be swept up in Ofelia's royal dreams.",
      "author": "Sean O'Connell"
    },
    {
      "text": "An imaginary garden with real toads.",
      "author": "Louis Proyect"
    },
    {
      "text": "A gorgeous film that ought to be seen on the largest screen possible -- try to catch it in a theater.",
      "author": "Jette Kernion"
    },
    {
      "text": "Holy ruby slippers, is this one grim film. Enthrallingly spooky, appropriately frightful, but grim. Grim like it might make the Brothers Grimm say, \"Well, it's a bit dark, isn't it?\" in an accusatory tone.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Films this extraordinary don't come along every day -- or even every decade.",
      "author": "Ken Hanke"
    },
    {
      "text": "The dual story threads merge seamlessly in del Toro's elegant style.",
      "author": "Rich Cline"
    },
    {
      "text": "... a maze of naive politics and gruesome brutality. It's no more about Franco's Spain than a can of Franco-American spaghetti is about Italian food.",
      "author": "Thomas Delapa"
    },
    {
      "text": "A dazzling masterpiece. Cannot be seen just once.",
      "author": "Victoria Alexander"
    },
    {
      "text": "The movie is a visual marvel, with a depth that goes beyond storybook effects. Del Toro creates a tenebrous visual undertow that pulls Franco's Spain and Pan's labyrinth together.",
      "author": "Michael Sragow"
    },
    {
      "text": "It's as if Lewis Carroll's Alice had wandered into a Francisco Goya painting, particularly the famously gruesome Saturn Devouring His Son, in which an ancient demon has ripped the head off his progeny.",
      "author": "Paul Byrnes"
    },
    {
      "text": "The film is impressively acted all around.",
      "author": "Shawn Levy"
    },
    {
      "text": "Pan's Labyrinth is an astonishing tale in which a child employs her vivid imagination to keep herself sane in a world gone mad.",
      "author": "Jack Garner"
    },
    {
      "text": "A haunting, but beautifully conceived mix of fantasy and reality that is like no other film released in 2006 - or any other year.",
      "author": "Pete Hammond"
    },
    {
      "text": "[Del Toro's] stories have the haunting persistence of repressed memories filtered through history and folklore that can make audiences tremble with recognition, and is the hallmark of fantasy as social, sexual and psychological allegory.",
      "author": "Duane Dudek"
    },
    {
      "text": "In its supremely confident and effortless blend of the fantastic and the grittily realistic, Pan's Labyrinth not only compares favorably with Terry Gilliam's best work (Brazil), it also exceeds it.",
      "author": "Robert W. Butler"
    },
    {
      "text": "It explores the connection between fantasy and reality, with eyes wide open to the dangers of giving either too much credence. That it works on both levels is impressive; that it makes them so clearly one is the stuff of art.",
      "author": "Tom Long"
    },
    {
      "text": "It is an adult fairy tale that will lead grown-ups to eagerly await the day that their own children will be old enough to understand.",
      "author": "Terry Lawson"
    },
    {
      "text": "This backdrop of intrigue creates violent scenes that may have you turning away from the screen. Beautifully designed and full of its own strange poetry, Pan's Labyrinth is nonetheless not a children's movie. Take its 'R' rating seriously.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Ofelia, you break our hearts. But you also restore our confidence in human decency.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Triumphs both as allegory and riveting adventure tale.",
      "author": "Donald Munro"
    },
    {
      "text": "...a powerful, haunting film replete with phantasmagorical visions and inexorable dread. Painted in shadows and lit by a moon the color of a frog's belly, Pan's Labyrinth is an emotional cousin to David Lynch's creepy puzzle films.",
      "author": "Philip Martin"
    },
    {
      "text": "Mexican filmmakers are having a good year, in whatever language they film... However with Pan's Labyrinth, Del Toro may have topped them all.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Budgets are not an issue for del Toro - his imagination is nearly endless, which plays out beautifully on screen.",
      "author": "Alex Billington"
    },
    {
      "text": "Pan's Labyrinth resembles a cross between Alice in Wonderland and H.P. Lovecraft, with some Buñuel thrown in for good measure. It's a tribute to -- as well as a prime example of -- the disturbing power of imagination.",
      "author": "Peter Rainer"
    },
    {
      "text": "In coming up with one of the finest modern fantasies to date, del Toro seamlessly blends two stories, one set in the aftermath of the Spanish Civil War and the other in a parallel realm of fairies and fauns.",
      "author": "Bill Muller"
    },
    {
      "text": "Mexican writer-director Guillermo del Toro couches his allegory about fascism in a tale as cruelly fascinating as any from the Brothers Grimm.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Pan's Labyrinth is del Toro's home run. He's delivered a film full of power, beauty, horror and, ultimately, sadness.",
      "author": "Bob Longino"
    },
    {
      "text": "Labyrinth director Guillermo Del Toro is a master at making the otherworldly seem this-worldly and vice versa.",
      "author": "Chris Hewitt"
    },
    {
      "text": "With Pan's Labyrinth, director Guillermo del Toro taps the same magical vein that made his Devil's Backbone so memorable.",
      "author": "Cole Haddon"
    },
    {
      "text": "\"Pan's Labyrinth\" is one of those films that's so moving, heartbreaking and wonderfully haunting, you sigh when the end credits roll.",
      "author": "Phil Villarreal"
    },
    {
      "text": "The movie is that original, and that attuned to the power of myth. I don't see why it shouldn't sit on the same altar of High Fantasy as the Lord of the Rings trilogy -- it's that worthy.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "Guillermo del Toro gives us one of the masterpieces of the fantasy film.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "The acting is superb, and Baquero steals the movie.",
      "author": "Michael Black"
    },
    {
      "text": "The sets, the sights and the sounds are original and imaginative, but the dirty little secret is that a little of it goes a long, long way.",
      "author": "Steve Rhodes"
    },
    {
      "text": "The magic that many films promise actually works in Pan's Labyrinth.",
      "author": "Stuart Klawans"
    },
    {
      "text": "If you are prejudiced against fantasy, put those prejudices aside. If you see one film this year, make it this one.",
      "author": "Michelle Thomas"
    },
    {
      "text": "There are lessons to be taken from Pan's Labyrinth -- the value of belief, hope and courage, for example -- but the whole is such a dingy downer that despite the fine performances on display, it is impossible to recommend it.",
      "author": "Jean Lowerison"
    },
    {
      "text": "Del Toro's gratifying surreal and fantastical instincts now have an unstinting moral eye on the world. Saying a filmmaker has matured suggests that he's forgone what made him so entertaining in the first place.",
      "author": "Wesley Morris"
    },
    {
      "text": "Pan's Labyrinth works on several levels. It boldly captures the horror of war, the bloody violence as well as the emotional stifling of the soul, and juxtaposes it with the enchantment of a nether land bathed in hope and eternity.",
      "author": "Mario Tarradell"
    },
    {
      "text": "Pan's Labyrinth plays with dark magic, a hideous enchantment spun with grief and torment. It is emotionally devastating and sensuously rich: Details are as sharp as the ching of a straight-edge razor, as strange as the squeal of a magic root.",
      "author": "Amy Biancolli"
    },
    {
      "text": "This isn't kids' stuff, though adventuresome teens would find plenty here to engage them. It's dark poetry set to startling images, a one-of-a-kind nightmare that has a soaring, spiritual center. It's not to be missed.",
      "author": "Glenn Whipp"
    },
    {
      "text": "It's pitch-perfect, impeccably conceived and replete with subtext and meaning. It is, in other words, a masterpiece.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "It all adds up to what many regard as the year's best film (a National Board of Review best picture), a work of imagination that is thrilling and feels like something completely new.",
      "author": "Gary Thompson"
    },
    {
      "text": "Technically magnificent and flawlessly acted, the picture incorporates 20th century Spanish history and classic fairy-tale elements in a way that seems completely new.",
      "author": "Carla Meyer"
    },
    {
      "text": "Pan's Labyrinth, like del Toro's previous and related The Devil's Backbone, is a saturated vision, an artist's work. What it lacks is successful unity.",
      "author": "David Elliott"
    },
    {
      "text": "The dark violence of the film (parents, note: Pan's Labyrinth is not for children) is leavened by its invention -- by the way it pushes the limits of reality and fantasy, each world overlapping with the other.",
      "author": "Moira MacDonald"
    },
    {
      "text": "A magical, frightening and heartbreaking movie for adults who want to take the journey, and read the subtitles.",
      "author": "Willie Waffle"
    },
    {
      "text": "...as repellently fascinating as watching a snake devour a rabbit.",
      "author": "Jim Lane"
    },
    {
      "text": "Fairytales are seeded in the darkest of forests, and Pan's Labyrinth emanates as one of the most enticing.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "... an elemental Alice in Wonderland amidst the horrors of Francisco Franco's reign of terror in 1944 Spain.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Pan's Labyrinth catapults del Toro to the top ranks of international filmmakers. His fertile imagination appears to have no limit, and all his previous work is hopefully a mere warm-up for a fecund future.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "The creator of such pulp prodigies as Hellboy and Blade II, del Toro mingles myth and history in Pan's Labyrinth, and produces a masterpiece of magical realism.",
      "author": "Bruce Newman"
    },
    {
      "text": "Pan's Labyrinth, with its unblinking sense of the baroque, may be a tough sell for anyone generally not interested in fantasy. But the film is one of the most original and spectacular of the year.",
      "author": "Phoebe Flowers"
    },
    {
      "text": "A dark, creepy, sad tale of incorruptible innocence and ultimate sacrifice.",
      "author": "Mark Dujsik"
    },
    {
      "text": "One of the most fascinating, imaginative yet darkly disturbing political fables of our time.",
      "author": "Susan Granger"
    },
    {
      "text": "...a finely crafted film of Ofelia's two distinctive worlds where the humans can be the real monsters and the creatures beneath the earth showing humanity.",
      "author": "Robin Clifford"
    },
    {
      "text": "Del Toro's made a lot imaginative films. I think this is his masterpiece to date.",
      "author": "Richard Roeper"
    },
    {
      "text": "I've seen this film three times and cannot claim to know whether its fantasy characters and events are meant to exist solely in the imagination of the 12-year-old girl at the center of the story, or if she is the only human aware of them.",
      "author": "Jack Mathews"
    },
    {
      "text": "His palette here is deep-toned, with bottomless blacks and supersaturated oranges and blues -- as if the Walt Disney of Pinocchio had collaborated with Goya.",
      "author": "David Edelstein"
    },
    {
      "text": "[Pan's Labyrinth] isn't really a movie about one person or one historical moment; it's about the larger question of how history judges what we do.",
      "author": "Noel Murray"
    },
    {
      "text": "Adeptly [blends] magic realism, fairytale trappings and special effects for a film charged by the unrest that lingers in the aftermath of the war.",
      "author": "Michael Dwyer"
    },
    {
      "text": "Pan's Labyrinth artfully fuses a war film with a family melodrama and a fairy tale. The result is visually stunning and emotionally shattering. Though graphically violent in parts, it still manages to be enchanting.",
      "author": "Claudia Puig"
    },
    {
      "text": "The horrors of both the realistic and surrealistic worlds are woven into the beautifully aligned narrative structure of del Toro's story. This is fabulous filmmaking in every sense of the word.",
      "author": "Gene Seymour"
    },
    {
      "text": "The childhood desperation that permeates his dramatic sensibility is elevated by del Toro's sincere devotion to imaginary belief systems rooted in cycles of nature.",
      "author": "Cole Smithey"
    },
    {
      "text": "[The film is] distinguished by another in a long line of recent child performances that are nothing short of astonishing in their accomplished matter-of-factness.",
      "author": "Andrew Sarris"
    },
    {
      "text": "A fantasy film definitely not made for children, Guillermo del Toro's \"Pan's Labyrinth\" is a strange but enchanting voyage into the hellish imagination of a young girl as she comes to terms with the infernal reality of her life.",
      "author": "Angela Baldassarre"
    },
    {
      "text": "It's both blissfully naïve and emotionally heartbreaking, a movie which calls on fantasy not to distort reality, but to enhance it.",
      "author": "Steven Snyder"
    },
    {
      "text": "The kind of familiar that astonishes with our inability to imagine it better than the way del Toro has.",
      "author": "Walter Chaw"
    },
    {
      "text": "An engrossing feat of craft and imagination, 'Pan's Labyrinth' is among the best films of 2006 and would stand out in any year.",
      "author": "John P. McCarthy"
    },
    {
      "text": "It is, I suspect, a film to return to, like a country waiting to be explored: a maze of dead ends and new life.",
      "author": "Anthony Lane"
    },
    {
      "text": "...a solid film, though del Toro fans won't find many surprises in store.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Though not for the squeamish or fans of Fascism, this morbidly bewitching fantasy is an enchanting, escapist fairy tale, even if one designed strictly with adults in mind.",
      "author": "Kam Williams"
    },
    {
      "text": "One of the most dazzling fairy tales to hit the big screen in a long time.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "A fairy tale without the Disneyfication",
      "author": "Scott Nash"
    },
    {
      "text": "A brilliant juxtaposition of truth and imagination guaranteed to lay waste to every emotion.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "In a year filled to the brim with magnificent visual achievements Pan's Labyrinth might be the most spectacular of the bunch.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "It's like watching Alice in Wonderland while tripping on LSD.",
      "author": "Jason Zingale"
    },
    {
      "text": "It would probably have delighted Tolkien and Lewis, who believed that fairy tales help us apprehend the reality of grace as it glimmers through a screen, darkly.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "Pan's Labyrinth is one of those underdog films that needs to be seen and I encourage anyone who likes movies of any kind to check it out.",
      "author": "Don R. Lewis"
    },
    {
      "text": "As each turn of events proves more menacing than the last to the young heroine of Pan's Labyrinth, her mother admonishes her: \"Life isn't like your fairy tales.\" But it is. That's the secret at the center of Guillermo del Toro's magnificent film.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Ranks with the best examinations of children's inner lives, but be warned: Its haunting insights are best left to adults.",
      "author": "Maitland McDonagh"
    },
    {
      "text": "It's not every day that you see a movie that not only references both Victor Erice's creepy modernist classic Spirit of the Beehive and Ray Harryhausen's Seventh Voyage of Sinbad with equal reverence.",
      "author": "Geoff Pevere"
    },
    {
      "text": "Although Pan's Labyrinth relies heavily on special effects, including the computer-generated kind, you're never aware of them. Del Toro, who wrote the story, has created a special universe. The spell it casts lingers long after the final reel.",
      "author": "Ruthe Stein"
    },
    {
      "text": "Pan's Labyrinth, horrific and heartfelt in the way it sees the trauma of war through the eyes of a little girl, is some kind of great movie.",
      "author": "Peter Travers"
    },
    {
      "text": "Pan's Labyrinth represents a quantum leap in del Toro's storytelling, drawing on Alice in Wonderland, Pinocchio and many other inspirations to create something quite new and wonderful.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Because the violence is used not for titillation but to create a world we can be fearful about, because the film lives up to its tagline that \"Innocence has a power evil cannot resist,\" we see it all without wishing we were somewhere else.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Unlike most horror movies, this chiller gives equal prominence to reality and fantasy, though the reality is far more frightening.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "Pan's Labyrinth is a political fable in the guise of a fairy tale. Or maybe it's the other way around.",
      "author": "A.O. Scott"
    },
    {
      "text": "It's like being in a labyrinth, you never know what's going to be around the next corner.",
      "author": "Cherryl Dawson and Leigh Ann Palone"
    },
    {
      "text": "Is (1) a victim of its own hype, and (2) nothing like what it's being marketed as, but there is an audience involvement writer-director Guillermo del Toro manages to work up all the same.",
      "author": "Dustin Putman"
    },
    {
      "text": "...a precious chance to feel the wonder and fear of childhood once again.",
      "author": "Josh Larsen"
    },
    {
      "text": "A fresh opportunity to revel in the darkly beautiful dreamscapes unleashed by the increasingly masterful del Toro.",
      "author": "Peter Canavese"
    },
    {
      "text": "The dream horrors of the labyrinth mirror the human horrors of the world above in the way that classic fairy tales, in their unexpurgated form, always have.",
      "author": "Kurt Loder"
    },
    {
      "text": "Whole worlds open before our eyes and then fold back upon themselves; dimensions of time and space are creased into shape as if the movie was an elaborate origami creation.",
      "author": "Jim Emerson"
    },
    {
      "text": "The film is the announcement of the complete arrival of a major filmmaker, and we can only hope that the qualities del Toro brings to this work do not get lost in the maze of Hollywood for future films.",
      "author": "Scott Huver"
    },
    {
      "text": "An awesome movie, but not for little kids. At all.",
      "author": "Dave White"
    },
    {
      "text": "Del Toro's obvious strength here is his forceful vision of a night-time fantasy and his ability to bring that vision to pulsating life.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "This morbid, visually stunning fairy tale gives you plenty to think about and plenty to be entertained by.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The only part where Pan errs is in its marketing, via a top-of-the-poster blurb that proclaims it a \"fairy tale for grown-ups.\"",
      "author": "Kevin Biggers"
    },
    {
      "text": "Like his terrific 2001 The Devil's Backbone, Mexican horrormeister Guillermo del Toro's new movie offers us both real-life and fantastical monsters, and if you know his work, you won't waste time figuring out which to root for.",
      "author": "Ella Taylor"
    },
    {
      "text": "An achievement. Many films with 'split personalities' invest all their creative energy into one aspect of the story, causing the other one to founder and feel obligatory.",
      "author": "James Berardinelli"
    },
    {
      "text": "Literally and figuratively marvelous, a rich, daring mix of fantasy and politics.",
      "author": "J. Hoberman"
    },
    {
      "text": "Pan succeeds both as a spectacular special-effects fantasy and as a psychological drama, with superb actors.",
      "author": "Michael Wilmington"
    },
    {
      "text": "An escape from everyday dreariness of which you'll want more than the film will offer.",
      "author": "Matt Pais"
    },
    {
      "text": "An astonishingly inventive portrait of childhood fears and hopes, an eerily beautiful modern fairy tale that truly merits the overused adjective magical.",
      "author": "Frank Swietek"
    },
    {
      "text": "He's managed to create one of those unexpected masterpieces that both touches both our inner child and our inner cynic, something that not too many people can do.",
      "author": "Eric Lurio"
    },
    {
      "text": "...a startling, idiosyncratic combination of children's fantasy and brutal political realism that switches effortlessly from early Fascist-era Spain to the fairytale world of a young girl's imagination.",
      "author": "Andy Klein"
    },
    {
      "text": "For adults who remember those long-ago nights under the covers... its temptations prove almost too much to resist.",
      "author": "Rob Vaux"
    },
    {
      "text": "Guillermo del Toro's vision has created a film that will last: an enduring fairytale that resonates and offers new interpretations with every viewing.",
      "author": "Marcy Dermansky"
    },
    {
      "text": "Visually, this is del Toro at his most fearless, effortlessly shaping a lurid realm of magic for Ofelia, and a stark, cold-blooded fear factory for the Captain.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Easily one of the most gorgeous films this year.",
      "author": "Edward Douglas"
    },
    {
      "text": "Rarely in film history has such elaborate fantasy been put in the service of such a profound and serious treatment of reality. But Pan's Labyrinth is an extraordinary film made by an exceptional visionary.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "[Del Toro's] newest film is arguably his most accomplished to date.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Guillermo Del Toro creates an alternate reality where danger is a constant state and where fantasy and reality are equally vivid.",
      "author": "Andrea Chase"
    },
    {
      "text": "Too adult for children and too simplistic for most adults, it ultimately leaves us with some of the prettiest cinematic pictures of the year. And nothing more.",
      "author": "Gabriel Shanks"
    },
    {
      "text": "Pan's Labyrinth unfolds with the confidence of a classical fable, one that paradoxically feels both timeless and startlingly new.",
      "author": "David Ansen"
    },
    {
      "text": "An irresistible and affecting mixture of horror, fantasy, history, and drama.",
      "author": "Pam Grady"
    },
    {
      "text": "Triste como A Espinha do Diabo, esta é uma obra de força inegável e de poética melancolia, encerrando-se com uma nota ambígua que levará o espectador a refletir profundamente sobre o que acabou de testemunhar.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Pan's Labyrinth is another jewel in a fast-expanding line of movie gems.",
      "author": "Kevin Lally"
    },
    {
      "text": "Dark, twisted and beautiful, this entwines fairy-tale fantasy with war-movie horror to startling effect.",
      "author": "Kim Newman"
    },
    {
      "text": "Dark, dreamlike and dangerous, Guillermo del Toro's Pan's Labyrinth is a fairytale every bit as scary and moving as they were always meant to be.",
      "author": "Jonathan Trout"
    },
    {
      "text": "Superbly acted and beautifully directed, this is a bewitching tale that will stay with you long after you leave the cinema. One of the best films of the year.",
      "author": "Matthew Turner"
    },
    {
      "text": "Maybe Del Toro wanted to make two different movies and decided to merge them together.",
      "author": "Marty Mapes"
    },
    {
      "text": "...offers escapism of the highest level, transporting the viewers to an entirely different world altogether that holds you in its clutches until the very end.",
      "author": "Paul Salfen"
    },
    {
      "text": "By juxtaposing inhuman military brutality with the idealism and imagery of a fairy tale, del Toro integrates the two, creating a credible tension between both.",
      "author": "Jules Brenner"
    },
    {
      "text": "Has a sumptuous visual creepiness that contributes to its affecting portrait of shattered childhood innocence.",
      "author": "Nick Schager"
    },
    {
      "text": "Pan's Labyrinth does speak to the poetic and the brutal in man.",
      "author": "Donald J. Levit"
    },
    {
      "text": "This magnificent and moving horror-fantasy for adults has already been raking in nearly unanimous acclaim... I'm not only on the bandwagon, I'm proudly riding shotgun for one of the richest films of 2006.",
      "author": "Aaron Hillis"
    },
    {
      "text": "A relentlessly grim and violent film that blends a redemptive fairy tale with a glimpse of the horrors of war in 1944 Spain.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "It's not only one of the great fantasy pictures but one of the great end-of-childhood elegies.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Unsweetened fantasy without sweetened moralism. [Full review in Spanish]",
      "author": "Alex Ramirez"
    },
    {
      "text": "Best picture of 2006: This vividly aesthetic, poignantly haunting, densely rich fable for adults represents the maturation of del Toro as a director of the first rank, raising the bar of the fantasy genre; the most visionary film in Cannes Fest this year.",
      "author": "Emanuel Levy"
    },
    {
      "text": "[Guillermo] del Toro is a master at this type of film, going beyond the realm of mere fantasy to create a fable wrapped within a carefully crafted drama.",
      "author": "Kim Voynar"
    },
    {
      "text": "It's a brutal karate chop to the head.",
      "author": "Lexi Feinberg"
    },
    {
      "text": "Del Toro's latest is a darkly enchanting adult fairy tale, flecked with gore and terrifying creatures, both human and fantastical.",
      "author": "Jennie Punter"
    },
    {
      "text": "An adult fairy tale mixed with brutal reality, the product of an exquisite imagination.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "A filmmaker blossoming into true greatness... Pan's Labyrinth is a film of breathtaking emotional, thematic and visual depth.",
      "author": "Devin Faraci"
    },
    {
      "text": "If Tim Burton and Jan Svankmejer had teamed up to make The Chronicles of Narnia, the result probably would have looked something like this picture.",
      "author": "Jon Popick"
    },
    {
      "text": "Unlike The Devil's Backbone, Pan's Labyrinth's allegories are not particularly rich, but the film's fantasy sequences remain seductive pageants of spiritual and cultural nuance.",
      "author": "Ed Gonzalez"
    },
    {
      "text": "Stunningly beautiful and movingly honest, this is one of best films of the year and another notch on the belt of one of the today's most exciting filmmakers.",
      "author": "Joe Utichi"
    },
    {
      "text": "A disjunction remains between the story's childlike form and its gruesome execution, but few directors are so adept at conveying both the uncanny in the real and the recognisable in the fantastic.",
      "author": "Ben Walters"
    },
    {
      "text": "In his highly atmospheric film, Del Toro also extracts some excellent performances, especially Lopez, who makes his character a monster with some human qualities, and Maribel Verdú as Ofelia's ailing mother.",
      "author": "Richard Mowe"
    },
    {
      "text": "I only wish more people in Hollywood would take chances on films with this kind of imagination behind it!",
      "author": "JoBlo"
    },
    {
      "text": "The girl's adventures are as real to her as the surrounding horrors, and Del Toro's great accomplishment is in weaving the two together so convincingly.",
      "author": "Ray Bennett"
    },
    {
      "text": "A richly imagined and exquisitely violent fantasy from writer-director Guillermo del Toro.",
      "author": "Justin Chang"
    }
  ],
  "release_year": 2006,
  "duration": 120,
  "genres": [
    "Fantasy",
    "Drama",
    "War"
  ],
  "age_rating": "R",
  "synopsis": "In 1944 Spain young Ofelia (Ivana Baquero) and her ailing mother (Ariadna Gil) arrive at the post of her mother's new husband (Sergi López), a sadistic army officer who is trying to quell a guerrilla uprising. While exploring an ancient maze, Ofelia encounters the faun Pan, who tells her that she is a legendary lost princess and must complete three dangerous tasks in order to claim immortality.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/s8C4whhKtDaJvMDcyiMvx3BIF5F.jpg"
}