{
  "movie_name": "Parasite",
  "movie_id": "parasite_2019",
  "total_reviews": 482,
  "reviews": [
    {
      "text": "It's a wonderfully sneaky film that, before you know it, will have worked its way right under your skin.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Fundamentally, Parasite aims to make us reflect on today's society, where the gap between the rich, the middle class and the poor is increasing.The spatial construction that the film proposes is a metaphor for the cruel social pyramid system.",
      "author": "Denise Pieniazek"
    },
    {
      "text": "Parasite is both darkly hilarious and delightfully shocking, setting a new sky-high standard for black comedy – the style of Bong Joon-ho.",
      "author": "Diana Tuova"
    },
    {
      "text": "“Parasite” does not put a foot wrong in either of its thematic or narrative capabilities. Via suspenseful drama, dark comedy, and an ingenious script and set design, the film offers commentary worthy of Ken Loach.",
      "author": "Calum Cooper"
    },
    {
      "text": "It’s a tricky balancing act, much like Bong’s abrupt shifts in tone, as Parasite is arguably the best film of the year at genre manipulation...",
      "author": "Brendan Cassidy"
    },
    {
      "text": "Parasite is the movie we will look back on as the movie of 2019. It crosses over to every culture because it’s simply about human beings struggling to survive in an unfair system.",
      "author": "Ryan McQuade"
    },
    {
      "text": "It is sadistic, angry and dark and has a lot to say about the system. This is the world we live in.",
      "author": "Jillian Chilingerian"
    },
    {
      "text": "\"Parasite\" has already made history for South Korea as the country's first film to win a Best Picture Academy Award. There are some moments I can't wrap my head around though, and one of them was the inclusion of Illinois State into the dialogue.",
      "author": "Jae-Ha Kim"
    },
    {
      "text": "Cinematography, score, editing… everything’s absolutely perfect. Nothing is placed without purpose. Not a single line of dialogue is wasted. It would be a shame if anyone fails to watch this magnificent movie just because it’s in a foreign language.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Radically different films such as Knives Out, Us and Joker ... have all expressed the same social criticism. Parasite is perhaps the most pointed, explicitly showing how economic inequality brings out the worst in everyone, rich and poor alike.",
      "author": "Paul Kanieski"
    },
    {
      "text": "Bong Joon Ho’s many-sided, dark social satire is a cunning and resourceful commentary on South Korea’s economic inequality. Why it works is the relevance of that system across societies of every nation.",
      "author": "Mark Johnson"
    },
    {
      "text": "These tiny details underline the inherent horror, and concur with the genre-defying essence of the story...",
      "author": "Elle Haywood"
    },
    {
      "text": "Parasite will move you like nothing else.",
      "author": "Patricia Puentes"
    },
    {
      "text": "It is the last good thing that has happened since the shutdown...",
      "author": "Brian Susbielles"
    },
    {
      "text": "Visually stunning and searing satire...",
      "author": "Brian T. Carney"
    },
    {
      "text": "Incredible storytelling and examination of the class structure in Korea... Strong characterisation and performances create empathy from audiences, themselves becoming parasites to the film as host. Clinging on for dear life until the thrilling conclusion.",
      "author": "Dallas King"
    },
    {
      "text": "Delicate directing and immaculate production design make Parasite the masterpiece it is. Its social-study script belongs in a lab, as it comes with storytelling lessons that transcend language. Reason why it became universal. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "With a delicious black comedy edge, some surprising jolts of heartfelt emotion, and a violent throat punch when you’re least expecting it, “Parasite” is a movie that keeps you engaged and guessing.",
      "author": "Keith Garlington"
    },
    {
      "text": "Here is a dark comedy from the great Bong Joon-Ho about class warfare that, depending on your mood, you may find to be a work of genius or too self-indulgent. One thing is certain, you’ve never seen anything quite like it.",
      "author": "M.N. Miller"
    },
    {
      "text": "Bong Joon-ho's Parasite is a wryly detailed and superbly scripted portrait of contemporary class rage.",
      "author": "Rahul Desai"
    },
    {
      "text": "This is a filmmaker working at the top of his game, aided by brilliant satirical writing that feels as culturally relevant as it is emotionally resonant. It is a flawless knockout in every sense of the word.",
      "author": "Tom O'Brien"
    },
    {
      "text": "Though Bong calls Parasite a \"tragicomedy\" and layers the material with lively humor and his signature tonal playfulness, it's also his most furious and most fatalistic picture to date.",
      "author": "Brian Eggert"
    },
    {
      "text": "Bong Joon-ho has created something with Parasite thats darkly humorous, compelling, dramatic, poignant, and bittersweet all at the same time.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "Episode 52: Jojo Rabbit / The Lighthouse / Parasite",
      "author": "Taylor Baker"
    },
    {
      "text": "A twist-laden narrative that effortlessly shapeshifts from comedy to drama to thriller with liquid ease.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "My respect for Bong Joon-Ho is up in the sky, because he and everyone else involved in this movie pretty much knocked it out of the park on multiple fronts.",
      "author": "Nicholas Oon"
    },
    {
      "text": "A bonkers, beautiful, radical, and drop-dead intelligent dark satirical tale of social inequality [and the] mock egalitarian weirdness of late capitalism.",
      "author": "Milana Vujkov"
    },
    {
      "text": "Like Ki-Jung, Park So-dam is the standout in a film filled with strong performances.",
      "author": "Carolyn Hinds"
    },
    {
      "text": "Parasite finds a way to be visually stunning, thematically resonant, horrifyingly tragic and fantastically gripping while fooling the audience into thinking they are having the time of their life.",
      "author": "Catherine Springer"
    },
    {
      "text": "It is such a clash of different genres and moods that it may as well be considered genreless, and yet it all somehow comes together in such a masterful way that you cannot help but leave the theater in a state of awe.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Parasite is a master class in storytelling, providing one of the finest examples of how to entertain the masses while still telling a deep and meaningful story.",
      "author": "Alex Bentley"
    },
    {
      "text": "I'll just come out and say it. Parasite is a masterpiece.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "The film feels too insincere and hypocritical to take genuinely seriously on its theme of social injustice.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Boon Joon Ho keeps us thoroughly enthralled as the story unfolds, deftly calibrating shifts in tone between satire, screwball farce, black comedy and horror, and also nimbly balancing our sympathies between the two families.",
      "author": "Jason Best"
    },
    {
      "text": "A splendid take on class inequalities that force the audience to question who is the parasite, the rich or the poor.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Not content with a basic premise of crime and punishment, director Bong Joon Ho goes a step further, eventually corkscrewing off on a tangent that drags out the running time.",
      "author": "Mike Massie"
    },
    {
      "text": "Precisely controlled and drolly ironic in tone even as its events grow more and more berserk, Parasite is always entertaining, foremost.",
      "author": "Dennis Harvey"
    },
    {
      "text": "Every actor brings different nuances to their respective portrayals and is completely in sync with the picture's seriocomic tone.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "Bong's work was leading to this galvanizing movie which has really shocked people into further questioning the wealth gap and understanding the precariousness of the urban underclass in an era of climate change...",
      "author": "A.S. Hamrah"
    },
    {
      "text": "One of the best films of the decade and of Korean cinema (a nation that, by the way, has one of the most interesting filmographies of contemporary times). Its greatest strength is telling a story small but so powerful... [Full review in Spanish]",
      "author": "Luis Bond"
    },
    {
      "text": "Bong's film is one which reveals itself in layers and it's almost impossible to categorise - it's at once a black comedy, thriller, horror, family drama and an allegory about class.",
      "author": "Niall Browne"
    },
    {
      "text": "An unusual director with his antenna attuned to social class...Bong has emerged over the past decade as a globally significant filmmaker.",
      "author": "Joanne Laurier"
    },
    {
      "text": "Parasite was the single best film I saw in 2019.",
      "author": "Scott Phillips"
    },
    {
      "text": "The most impressive part? That even though this is a crowd-pleaser, it somehow manages to be marvelously depressing in ways that don't hit until after the credits roll.",
      "author": "Matt Cipolla"
    },
    {
      "text": "It's important to go in as fresh as possible to enjoy the film's juicy surprises, which are unraveled with the craft of a master, steadily building characters into the scheme, inviting our complicity, then yanking out the rug.",
      "author": "Jason Fraley"
    },
    {
      "text": "What starts off as a light-hearted comedy ends up becoming a bloody thriller as Bong intertwines slapstick comedy scenes and tense artful schemes.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "The fallout of socio-economic disparities that pit one class of people against another has rarely been put on the big screen with the kind of savage candour and devastating intensity that Bong brings.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "Bong Joon-ho masterfully sets the table, and then delivers a raw, brutal critique to society. A masterpiece and one of 2019 best films. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "Parasite is a stunning achievement. It's a work that is as keenly prescient as it is superbly crafted.",
      "author": "Allen Almachar"
    },
    {
      "text": "I can say, without fear of being wrong, that this is one of the best movies of the year. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Parasite is a masterful piece of social satire and dark comedy, a scathing portrait of both the upper and lower classes.",
      "author": "Damond Fudge"
    },
    {
      "text": "In the movie's most vivid set piece, Bong demonstrates that water (to use a euphemism) rolls downhill: A downpour that is picturesque at the level of the mansion becomes a flood by the time it washes into the poor family's vulnerable neighborhood.",
      "author": "John Beifuss"
    },
    {
      "text": "Settling in for a narrative about a family trying to keep it together by overpowering the capitalistic battle, Bong Joon-ho has constructed a low-key tragic comedy that insists on being more than just that.",
      "author": "Shikhar Verma"
    },
    {
      "text": "PARASITE is Bong Joon Ho's masterpiece.",
      "author": "Sarah Musnicky"
    },
    {
      "text": "It's very rare a film makes a step-change in what is going on and the dynamics of the characters, and makes that work as well it does here.",
      "author": "Jim Ross"
    },
    {
      "text": "...director Bong is also working on other levels, not only making all of its characters relatable - the Parks are really quite sweet people, if a little lacking in self-awareness - but telling his story with a healthy dose of uproarious slapstick.",
      "author": "Damon Wise"
    },
    {
      "text": "A picture that audaciously devours the force of convention and transforms it into a feverish undercurrent, driving what can only be described as an engine through the odyssey of mayhem.",
      "author": "David Keyes"
    },
    {
      "text": "Kudos go to Bong's sleight-of-hand narrative approach, as he seamlessly defying genres by alternating from drama to comedy to thriller and back again over the course of its 131-minute running time.",
      "author": "Casey Chong"
    },
    {
      "text": "Some satire but not at its best. And ugliness filled in the rest.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "A film that is genre-defying and free of the restraints of conventional storytelling.",
      "author": "Micheal Compton"
    },
    {
      "text": "With each passing day, Bong Joon-ho's class-conscious thriller about a family that lives in a sub-basement-and the blissfully naïve rich family they wind up working for-becomes even more prescient.",
      "author": "Laura Bradley"
    },
    {
      "text": "Get ready for thrills and laughter. As the credits roll, all the layers of meaning in every shot, character and object become clear and you can't wait to spread the word. This is what cinema does best -- entertain, provoke, create discussion.",
      "author": "Julia Swift"
    },
    {
      "text": "Everything is superbly controlled and nailed to the point at which you begin to question, how is this possible?",
      "author": "Ben Rolph"
    },
    {
      "text": "Parasite surprised me over and over. I constantly had no idea what was going to happen next. But what did happen, was amazing and extremely well done.",
      "author": "Tessa Smith"
    },
    {
      "text": "When the history of this moment in world cinema is written, Parasite will take its place as the movie that got the moment right.",
      "author": "Robert Koehler"
    },
    {
      "text": "A monumental achievement in film and the rare film that goes from \"very good\" to \"historically great\" in its final act.",
      "author": "Brian Gill"
    },
    {
      "text": "The smartest mainstream film about class made in many years, Bong Joon-ho's Parasite lays bare the lie that hard work can bring anyone closer to their dreams.",
      "author": "Dan Schindel"
    },
    {
      "text": "Never let the audience off the hook, Hitchcock once said. Ho achieves this in spades and with more than one hook.",
      "author": "Paul Farren"
    },
    {
      "text": "[A] funny, inventive, scary film.",
      "author": "Michael Wood"
    },
    {
      "text": "From his opening shots, Bong Joon-Ho establishes the upstairs/downstairs dynamic of his razorsharp, bleakly funny, unmistakably furious skewering of capitalism and class divides.",
      "author": "Roe McDermott"
    },
    {
      "text": "Bong hoped to give his film a classic sheen by creating a 'b&w' version. He needn't have done this: with or without color, Parasite will certainly be classic enough.",
      "author": "Ard Vijn"
    },
    {
      "text": "It is bracing, audacious, jarring, challenging and exciting, a devastating social satire realized with precision and intelligence in every perfectly constructed frame.",
      "author": "Asia Frey"
    },
    {
      "text": "It's a very good story.",
      "author": "Achara Kirk"
    },
    {
      "text": "The acting's amazing.",
      "author": "Jaby Koay"
    },
    {
      "text": "I think it's a career peak for [Bong Joon-ho].",
      "author": "Tim Robey"
    },
    {
      "text": "Watching that drama -- the bricks sort of build and then topple -- is so satisfying.",
      "author": "Simran Hans"
    },
    {
      "text": "Thinking very metaphorically may not lead to our salvation, but the consciousness it induces just might.",
      "author": "Rebecca Liu"
    },
    {
      "text": "Parasite provides a potential turning point for international films in America. Bong Joon-Ho's mystery drama will capture the hearts and minds of audiences worldwide",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "The movie itself - message aside - is remarkably entertaining.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "It conveys very clear messages about classism and discrimination, [all through] an entertaining and visually arresting story. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "It's a splendid film, beautifully acted and realised, which manages to be both entertaining and profound.",
      "author": "Paul Whitington"
    },
    {
      "text": "A breath-taking cinematic accomplishment that will have you talking for days",
      "author": "Deirdre Molumby"
    },
    {
      "text": "[Bong Joon-ho]'s work is as playful as it is sincere and revelatory. He'll make you feel at home, and then rip the rug out from under you.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "This is what a true masterpiece looks like.",
      "author": "Linda Marric"
    },
    {
      "text": "Bong delivers a stunning return to form with this newest venture.",
      "author": "Ben Croll"
    },
    {
      "text": "What's to be said about this film that hasn't already been said? ... because there is so much to take in, like a Da Vinci painting, the film reveals secrets and hidden meanings until you're left breathless...",
      "author": "Sucharita Tyagi"
    },
    {
      "text": "Cinema of the highest form. No headline will ever convey the power of Parasite - it's a masterpiece that has to be seen to be believed.",
      "author": "Cameron Frew"
    },
    {
      "text": "What makes Parasite such a good film is that it tells a story first and foremost, so the social commentary whilst ever present isn't so overpowering that you cannot just enjoy the story being told.",
      "author": "Rosalynn Try-Hane"
    },
    {
      "text": "Ingeniously written and directed, plus faultlessly acted, this is one of the great movie experiences of this or any year.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Despite the occasionally slow pace, an impressively strong finish means you'll enjoy finding out.",
      "author": "Matthew Bond"
    },
    {
      "text": "An impeccable script. [Full review in Spanish]",
      "author": "Juan José Beteta"
    },
    {
      "text": "Plugging into our universal disquiet about the inequality between the haves and have-nots, Bong has fashioned a darkly enjoyable class-war thriller in which the real monster is global capitalism itself, but there is nothing heady or didactic about it.",
      "author": "Tom Shone"
    },
    {
      "text": "One's left to wonder who's parasitically living off whom? The Kims off the Parks, or the Americans off their anti-communist allies?",
      "author": "Ed Whitfield"
    },
    {
      "text": "Parasite is a completely gripping and utterly entertaining masterpiece in which writer-director Bong Joon Ho has poured all his craft and vision into.",
      "author": "Nicola Austin"
    },
    {
      "text": "A tragicomic masterclass that will get under your skin and eat away at your cinematic soul.",
      "author": "Mark Kermode"
    },
    {
      "text": "This serpentine, unclassifiable piece stands as a highlight among the director's already glittering career.",
      "author": "Kevin Wight"
    },
    {
      "text": "Far from hiding, the film's beguiling charm stokes the deeply dystopian vision of its maker. In Bong's world, despite tokens like a cell phone or pizza dinners, social mobility doesn't quite exist.",
      "author": "Namrata Joshi"
    },
    {
      "text": "[I]ts delivery - mixing social satire, twisty plotting and Hitchcockian tension - a masterclass in serious-minded but accessible mainstream filmmaking.",
      "author": "Demetrios Matheou"
    },
    {
      "text": "[A]s a filmmaker [Bong's] less interested in finger-wagging admonishments than he is in taking us to uncomfortable places with outré plot twists that deepen and reframe what we think we know about the characters.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Using industrial-strength social satire, [Bong Joon Ho] strips the veneer off the myth of classlessness, giving an outrageously entertaining instant classic.",
      "author": "Cath Clarke"
    },
    {
      "text": "While Parasite has won critical acclaim worldwide, seeming to strike a chord with audiences for its raw class commentary, the movie's message is not clear cut. It's a dark comedy, but by the end you're not sure if the joke is on you after all.",
      "author": "Jennifer Clark"
    },
    {
      "text": "It works on every level which is, perhaps, fitting for a film about levels and whether you are at the top or bottom in life.",
      "author": "Deborah Ross"
    },
    {
      "text": "Parasite is quite simply a supreme feat of film-making, a tense and hilarious jewel box of a film that draws you deeper and deeper into its wicked, absurdist satire.",
      "author": "Tom Duggins"
    },
    {
      "text": "Parasite works as entertainment and analysis, treat and treatise.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "An imaginative comedy-thriller with darkness at its core.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The word masterpiece is often too easily used... But you can easily understand why Parasite has been given that label by so many because finding a reason to disagree feels just as redundant.",
      "author": "Steven Sheehan"
    },
    {
      "text": "Though we largely root for the Kims, Bong doesn't allow anything as simple as rich versus poor, good versus bad. No wonder this movie speaks to global audiences - it's a parable about our capitalist world.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "A film that always has two thoughts in its head at once, a spectacular epic and tightly wound chamber piece, chicly sophisticated, brutal as a hammer.",
      "author": "Danny Leigh"
    },
    {
      "text": "extraordinary",
      "author": "Chris Hunneysett"
    },
    {
      "text": "It takes a while to get there, but it sticks its landing.",
      "author": "Richard Bonaduce"
    },
    {
      "text": "A miracle of a film. It feels like Bong Joon-ho's already extraordinary career has been building to this: a riotous social satire that's as gloriously entertaining as it is deeply sardonic.",
      "author": "John Nugent"
    },
    {
      "text": "Bong builds the rocambolesque plot of Parasite from a solid architectural skeleton. [Full Review in Spanish]",
      "author": "Manu Yáñez"
    },
    {
      "text": "It's a gripping, existential, horrifying study of a nightmarish world - except that it is true.",
      "author": "Poulomi Das"
    },
    {
      "text": "We see what we want. We want what we see. Woe unto the collateral damage we leave. There may be no more original schemes, but the best movie of 2019 is more fascinated by original sins and the shapes they take in the here and now.",
      "author": "Nick Rogers"
    },
    {
      "text": "Intrigue, violence, gore and humor show us a Korea in which not everything that shines is gold. [Full review in Spanish]",
      "author": "Fernando E. Juan Lima"
    },
    {
      "text": "Parasite is staggeringly good, a remarkable piece of filmmaking that immerses and unnerves. Bong Joon Ho's direction is that of a maestro, of an auteur unleashed.",
      "author": "Allen Adams"
    },
    {
      "text": "A masterful genre chronicle of savage injustice and a master-class in genre filmmaking from Bong Joon-ho, Parasite is a classic must-see for anyone who loves film.",
      "author": "Neal Pollack"
    },
    {
      "text": "Quite simply put, Parasite is a thrilling masterpiece from Bong Joon-ho, a director at the height of his powers offering a film that is profoundly entertaining, wonderfully realised, and thought-provoking.",
      "author": "Lewis Knight"
    },
    {
      "text": "In Parasite, Bong doesn't appear to be expressing empathy for the poor. Nor does he seem to be pointing fingers at the rich. He is, instead, questioning the very nature of mankind; its self-centred ingratitude and its propensity to create divisions.",
      "author": "Rohan Naahar"
    },
    {
      "text": "It really is a must-see.",
      "author": "Alexa Dalby"
    },
    {
      "text": "Very few movies in recent years have left you unsure what's going to happen next, but even when you do, it's still a compelling watch. Quite simply, Parasite is a masterpiece.",
      "author": "Ian Sandwell"
    },
    {
      "text": "Stunning and intricate, it is simply brilliant.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "A deep and complex narrative, rich in social commentary, is intricately wrapped within layer upon layer of different complementary genres and tones.",
      "author": "Kat Hughes"
    },
    {
      "text": "It plays like a brilliant con job comedy in the first half, before switching to total wacko mode at the end, with knives out and bloody. I liked the first half of this Jekyll and Hyde film a lot. The second half, not so much.",
      "author": "Robert Roten"
    },
    {
      "text": "Bong Joon-Ho here constructs a powerful and intense hybrid of genres, themes, and observations that grow and acquire sense as the story, which is full of rich details, unfolds. [Full Review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "Humiliation is transformed into resentment and fantasy into reality. [Full Review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "Parasite is true to itself even when it stops being palatable.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "As with his previous features such as Snowpiercer and The Host, Bong has created an intense drama laced throughout with scathing commentary.",
      "author": "Matt Brunson"
    },
    {
      "text": "Bong Joon Ho has delivered one of the most well-assembled and compelling films of all time, which flawlessly navigates humor, despair, satire, and elements of thrilling horror to create an experience I won't soon forget.",
      "author": "Kent Garrison"
    },
    {
      "text": "\"Parasite\" flips through about ten different genres and takes the best bits of each; it feels like a relaxing buffet that expresses and sparks a love of cinema.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Parasite is a major accomplishment and a must-see film for anyone who loves cinema.",
      "author": "Mina Takla"
    },
    {
      "text": "Bong builds the smallest moments into something monumental.",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "No doubt Asian capitalist interests are well-served in the end, there won't be rioting in the streets on the back of this one. A film is hardly effective satire if it doesn't point up a route to radical change.",
      "author": "Paddy Kehoe"
    },
    {
      "text": "... playful until it becomes diabolical... only then does (writer/director) Bong Joon Ho show exactly the cards he's holding.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The only real question is how high you'll rank it in your top films of 2019 or the 2010s decade list.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Unexpected, quirky, funny, horrific, dramatic - all of these things, but also just a bit tedious in parts. Not your average movie for sure.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Somewhere, the ghost of Alfred Hitchcock is smiling with glee.",
      "author": "Don Shanahan"
    },
    {
      "text": "Parasite deserves to take its rightful place as one of the decade's finest films.",
      "author": "Michael Ward"
    },
    {
      "text": "Parasite is one of those beautiful rarities in cinema, a clever art-house title with much to say that is riotously entertaining and easily accessible.",
      "author": "Lou Thomas"
    },
    {
      "text": "We are facing a remarkable degree of narrative skill. [Full Review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Things get darker still... But Bong never lets the movie's dramatic tonal shifts derail the narrative momentum...",
      "author": "Randall King"
    },
    {
      "text": "A splendid movie. [Full Review in Spanish]",
      "author": "Carlos Bonfil"
    },
    {
      "text": "A revolutionary film. [Full Review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "Parasite makes us see a landscape of injustice that we normally don't want to see. It feels uncomfortable, but it offers us plenty of material for reflection. Bravo! [Full Review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Bong Joon-ho succeeds in showing us that the worst monster of our reality is the system that we have built. [Full Review in Spanish]",
      "author": "Arturo Magaña"
    },
    {
      "text": "Bong is crude, direct, ruthless, and at the same time refined. The director doesn't deliver a moralizing discourse. On the contrary, he offers a crescendo where suspense and the grotesque come together. [Full Review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "an elaborate thriller that at first seems to pit the have's against the have-not's, but is ultimately about how the have not's are forced to turn against each other in the mad clamor for whatever dwindling social and economic crumbs they can find",
      "author": "James Kendrick"
    },
    {
      "text": "We are before a remarkable degree of narrative skill. [Full review in Spanish]",
      "author": "Alonso Díaz de la Vega"
    },
    {
      "text": "a parable about two families in Korea-one rich but dim, one poor but clever-and what happens when the poor household decides to scam the rich.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Just when we think we know where the narrative is headed, Bong pulls the rug out from under us via turns that are occasionally dazzling, yet always organic, thanks to meticulous foreshadowing and his knack for slowly building an atmosphere of dread.",
      "author": "Phil Guie"
    },
    {
      "text": "Bong Joon-ho delivers something really special: the best film of 2019. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Parasite was too on the nose too often for me to give it my full heart. However, I loved an ambiguity at its core...",
      "author": "Rich Juzwiak"
    },
    {
      "text": "This is a mature, beautifully crafted piece of work and much cleverer than it initially appears.",
      "author": "Jennie Kermode"
    },
    {
      "text": "[A] fantastic film. [Full review in Spanish]",
      "author": "Alberto Sáez Villarino"
    },
    {
      "text": "The conversation about the gap between social classes is cynical, fun, and exasperating, because Bong doesn't simply talks about rich versus poor, but things that few people dare to talk about. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "I haven't seen another film that pinned down the essence of the year, wriggling and squirming, with such eviscerating precision. It's not just a film; it's a vivisection.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "The only thing that you should expect is the unexpected.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "This isn't just a killer picture on all of the standard levels, however. Contemplating society's growing class collisions and inequities, Parasite also makes a killer statement.",
      "author": "Sarah Ward"
    },
    {
      "text": "Parasite is cinema at its very best, and will continue to be lauded as a timeless masterpiece.",
      "author": "Wilson Kwong"
    },
    {
      "text": "It's the perfect mix of the director's penchants for tidy symbolism and unhinged tonal shifts, with a strong ensemble cast led by longtime Bong favorite Song Kang-ho.",
      "author": "Daniel Barnes"
    },
    {
      "text": "Parasite is a well-designed kick down the stairs that you cannot see coming. Rarely does a movie take you on the kind of trip this one does.",
      "author": "Frantz Jerome"
    },
    {
      "text": "If the movie is a Rorschach of who you identify as parasite and host, it's a test you're just as likely to fail; a filmgoing experience that refuses to fit into any box, and forces viewers to breathe the dangerous air outside of it too.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Let's just say that by \"Parasite's\" conclusion, what started out as a comedy of manners has become a furious snarl of rage and his most arresting social satire yet.",
      "author": "Bob Mondello"
    },
    {
      "text": "Obviously, these are not new themes or issues unheard of within the global economy, but it's not often a filmmaker finds a way to portray it in such unique shades of grey.",
      "author": "Gregory Ellwood"
    },
    {
      "text": "Even if its social message about culture and class (Alfred-Hitchcock-by-way-of-Karl-Marx) is laid on too thick in the end, this Parasite slithers most agreeably.",
      "author": "Nathaniel Bell"
    },
    {
      "text": "Parasite is a triumph by a director who still hasn't really made a misstep.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "It isn't an easy ride, and as with life in the non-metaphorical world, the destination is uncertain. You'll see strange and wonderful things along the way.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "The entertainment this combination of crime thriller and social drama offers is undeniable.",
      "author": "Panos Kotzathanasis"
    },
    {
      "text": "It's so easy for otherwise good and normal people to do terrible things, and it's never entirely possible for them to escape their sins.",
      "author": "Emma Stefansky"
    },
    {
      "text": "[Parasite] has so much to offer, you'll want to see it more than once.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Impeccable, sustaining shocking plot twists and tonal shifts between suspense, poignant family drama and slapstick farce without ever sacrificing its visual flair and impudent sense of humour.",
      "author": "Mel Campbell"
    },
    {
      "text": "This movie is scary and funny and utterly beguiling. If you haven't seen it, you must.",
      "author": "Sean Fennessey"
    },
    {
      "text": "Has other, more interesting, uncomfortable things on it's mind - and the most uncomfortable of all is [when] you start to realize none of these people are as bad as you want them to be.",
      "author": "Bob Chipman"
    },
    {
      "text": "Parasite is a mature and complex examination of the cyclical nature of the haves and have-notes. It's probably the best film I've seen this year.",
      "author": "Terry Mesnard"
    },
    {
      "text": "This is a movie about messages, codes and plans, subterranean communications and misperceptions. Parasite may even be a \"message movie,\" though it has an artistry that term conceals.",
      "author": "Eve Tushnet"
    },
    {
      "text": "Parasite ups the ante by presenting the (sometimes literal) moral depths of the dream of class mobility.",
      "author": "Malik Adán"
    },
    {
      "text": "Bong drags human greed and its consequences into the light with his lacerating wit, unabashed brutality and heart-wrenching tragedy, turning \"Parasite\" into an audacious and explosive parable for our times.",
      "author": "Loren King"
    },
    {
      "text": "a savage and spectacular social satire",
      "author": "Eli Glasner"
    },
    {
      "text": "Parasite is a well-made, engaging, and memorable film exploring class disparity in Korea. With its darkly comedic tone, Parasite manages to entertain, while crafting a surprising and socially relevant experience.",
      "author": "Amanda Mazzillo"
    },
    {
      "text": "While the off-beat nature of the narrative surely will not appeal to everyone, those with a desire to be taken on a thrilling ride of many twists and turns will be rewarded with an unpredictable and unsettling sharp class dissection.",
      "author": "Nick Boyd"
    },
    {
      "text": "I was just glued to the screen...amazing.",
      "author": "Justin Brown"
    },
    {
      "text": "I tried to predict what was happening, and I was wrong every time. I like that...the acting was a bit different, and it took some time to get up to speed, but I really enjoyed it.",
      "author": "Brandon Collins"
    },
    {
      "text": "Bong effortlessly blends the horrific and the comic en route to the icebox talk that has viewers questioning their own attitudes and beliefs through the unanswered mysteries of the story.",
      "author": "Greg Carlson"
    },
    {
      "text": "It is a difficult task to review films like Parasite, because in the end you have almost certainly run out of superlatives with which to apply to it.",
      "author": "Grant Watson"
    },
    {
      "text": "The cast is great in this film, the performances are really dope and l you really get into both families.",
      "author": "Tony Baker"
    },
    {
      "text": "In a demonstration of masterful filmmaking director Bong Joon Ho's (Snowpiercer, The Host) latest film is uncategorizable and that is a great thing.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "Parasite is at once a comedy and a Hitchcockian thriller with shades of mid-period Cohen Bros thrown in for good ironic measure. This film is a solid must-see for anyone who values quality filmmaking with something to say.",
      "author": "Chris McCoy"
    },
    {
      "text": "Bong Joon-ho's magnificent genre-bending movie Parasite is a funny, deeply satirical look at class divisions, told through the intersecting lives of three families in Seoul.",
      "author": "Kathryn Reklis"
    },
    {
      "text": "Parasite is a carnivorous and ferocious feat of filmmaking, bloodsport framed with a formal brilliance and brutally comic verve. It's one of the year's best.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "Bong knows better than to deliver a lecture. Instead, he wants nails chewed to the cuticle and armrests bent, achieving such reactions with magnificent editorial flow.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Parasite attests to a filmmaker at the peak of powers, telling precisely the story he wants to tell in a way that showcases his distinctive virtuosity.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "It is a sitcom with teeth and haunting moral echoes, no small amount of vulgarity and a smart streak of comedy.",
      "author": "John Anderson"
    },
    {
      "text": "Bong packs his frames with visual symbolism that speaks to contemporary times and writes characters on both sides of the economic divide that feel relatable and well-rounded.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "There's little doubt that Parasite earns the title of masterpiece, and will only grow in the public consciousness for decades to come.",
      "author": "Alan French"
    },
    {
      "text": "Bong Joon-ho's suspenseful, timely thriller that's perhaps one of the best movies of the year.",
      "author": "Susan Granger"
    },
    {
      "text": "The film is sarcastically brilliant, hysterical, clever, and frenzied. The cinematography is glorious! My advise, go in not knowing the details!",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "There's not a doubt in my mind that Parasite is one of the best films of 2019, if not the best film of the year.",
      "author": "Tim Brennan"
    },
    {
      "text": "I'm still in considerable pain from watching Parasite, days later. It's that great of a film.",
      "author": "Eileen Jones"
    },
    {
      "text": "With Parasite, Bong Joon-Ho has produced a brilliant social commentary, and what might well be the best film of 2019.",
      "author": "Monica Reid"
    },
    {
      "text": "As with his earlier works... [director Joon-ho Bong] embeds a biting social critique in a dynamic narrative with unexpected risks and satisfying surprises.",
      "author": "Diane Carson"
    },
    {
      "text": "South Korean director Bong Joon-Ho's \"Parasite\" contains everything that's exciting about his films: a grand fluidity of camera movements and a framing of shots that makes you look into corners just in case something's lurking. B",
      "author": "Michael Calleri"
    },
    {
      "text": "A twisty and uproarious thriller, \"Parasite\" packs a ton of entertainment around some sharp and timely social satire.",
      "author": "Brad Keefe"
    },
    {
      "text": "A scathing satire-farce-tragedy-horror... You might not like where it goes, but you certainly won't forget it.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Bong leads us into this realm slowly and expertly, often relying on an eclectic soundtrack - opera one moment, a jazzy all-drums set the next - to carry us forward.",
      "author": "Chris Knight"
    },
    {
      "text": "Parasite is a great film all right. It is not, I think, to be missed by anyone who seriously cares about movies.",
      "author": "Jeff Simon"
    },
    {
      "text": "Filmmaker Bong does a superb job of immediately drawing the viewer into the deliberately-paced proceedings...",
      "author": "David Nusair"
    },
    {
      "text": "One of the most intriguing, intelligent, and disturbing films of the year.",
      "author": "Louisa Moore"
    },
    {
      "text": "Parasite exudes cultural specificity, with deep cuts to Korean headlines and reality TV shows.",
      "author": "Elaine Cho"
    },
    {
      "text": "It's difficult to find a recent movie that defines in such a visual way, through domestic architecture, the perverse mechanisms of domination of neoliberal capitalism. [Full Review in Spanish]",
      "author": "Sergi Sánchez"
    },
    {
      "text": "Bong Joon Ho has not only delivered one of 2019's very best movies, but the symbolism he's woven throughout the picture is some of the finest placed on film in years.",
      "author": "Jeff York"
    },
    {
      "text": "The writing is fantastic, as well as the acting, production design and score",
      "author": "Rachel Wagner"
    },
    {
      "text": "A trenchant commentary on the economic divide that exists in today's South Korea, one made all the keener by Bong's ability to meld elements of comedy, satire, suspense and horror...one of the year's best films.",
      "author": "Frank Swietek"
    },
    {
      "text": "Parasite very much takes place in our world. Perhaps a slightly heightened version of it, but ours nonetheless. Mixing that with his usual dark humor and oddly specific characters, Bong Joon-ho has created an experience like no other.",
      "author": "Karl Delossantos"
    },
    {
      "text": "That's not \"savage commentary.\" That's condescension. This is by far the filmmaker's most commercially successful work to date...",
      "author": "Rick Kisonak"
    },
    {
      "text": "Parasite is unique in its treatment of class and solidarity and is a singular cinematic experience.",
      "author": "Cate Young"
    },
    {
      "text": "A meticulously crafted, satirical thriller that proves to be [Bong Joon] Ho's most thematically rich project to date.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Parasite is a beautiful movie, wonderfully acted, impeccably shot.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "A bit overlong at 132 minutes, but generally so kinetic and vivacious that it never once feels boring.",
      "author": "Tim Brayton"
    },
    {
      "text": "Bong Joon-ho's wild 'Parasite' is 2019's first real masterpiece",
      "author": "Nate Adams"
    },
    {
      "text": "A contender for the best film of the decade, Parasite is a thrilling, absolute masterpiece from one of the world's greatest auteur directors.",
      "author": "Matt Ward"
    },
    {
      "text": "Do not miss this movie, it's a love song to the cinema. [Full Review in Spanish]",
      "author": "Marta Sanz"
    },
    {
      "text": "It's a fitting movie for our times, and Joon-ho delivers with uncompromising clarity and vision. See it before the inevitable American remake sands down all its razor sharp edges.",
      "author": "Adam Graham"
    },
    {
      "text": "Just as many of the director's previous efforts have defied pigeonholing, Parasite delights in ping-ponging from one genre to another, defying expectations along the way.",
      "author": "James Berardinelli"
    },
    {
      "text": "Joon-ho makes it all increasingly funny at first, until an out-of-nowhere twist sends both families into a sparkling but serious assortment of genre-mixed rides and wrinkles.",
      "author": "John Urbancich"
    },
    {
      "text": "A once-a-decade social satire masterpiece.",
      "author": "Evan Dossey"
    },
    {
      "text": "A thriller of the domestic variety -- with a playful sense of humor, startling twists and turns, and keen examination of class.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "Parasite is a brilliant film and one of the best films of the year, and not just best foreign films. It's heartfelt and funny. Mean spirited and sad.",
      "author": "Don R. Lewis"
    },
    {
      "text": "Just when you thought a Bong Joon-ho movie couldn't get more weird or wonderful, he delivers a masterpiece.",
      "author": "Paula Farmer"
    },
    {
      "text": "The bassline of modern art is thumping and pulsating with a fury about inequality. Often, that sound gets understandably but simplistically distilled into \"rich bad, poor good\" messaging. Parasite absolutely defies a quick synthesizing of its message.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Which family is the real parasite, feeding off the other, is a provocative question that lingers long after the movie's ended and our heart rates have returned to normal.",
      "author": "Rob Thomas"
    },
    {
      "text": "Funny, disturbing, and heartbreaking all at once, Parasite finds Joon-ho in top form as a storyteller, delivering a film like no other this year.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "\"Parasite\" is entertaining and shocking, a thought=provoking examination of class differences that shifts effortlessly from comedy to social commentary to something approaching horror.",
      "author": "Sean P. Means"
    },
    {
      "text": "Bong Joon Ho's Cannes winner Parasite is a fantastically dark, horrendously bleak portrait of classist indoctrination.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Wild-ride entertainment that's by turns funny, squirmy, horrifying, and poignant, all in service of a zeitgeist-y story of working-class frustration...boiling over in ways the blithely wealthy can no longer ignore.",
      "author": "Peter Canavese"
    },
    {
      "text": "Seals a serious case for Bong Joon-ho as one of the great filmmakers of all time.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "The latest film from Bong Joon Ho is funny, thrilling and poignant, and is a must-see for anyone looking to fill out their Best of 2019 scorecards.",
      "author": "Tom Santilli"
    },
    {
      "text": "A movie about how the capital invades our lifes and our private spaces. [Full Review in Spanish]",
      "author": "Guillem Martinez Oya"
    },
    {
      "text": "A wild ride [where] privilege and exploitation prove to be traits that are at once synonymous and adversarial depending on who wields which and upon whom.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Parasite is a must-watch in order to get a full picture of the world cinema scene in 2019.",
      "author": "Dan Murrell"
    },
    {
      "text": "Perhaps the greatest compliment one can pay \"Parasite\" is you're never sure what's going to happen next.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "The con is on in this masterful tale from South Korean director Bong Joon-ho. Filled with twists and turns executed to a tee by the superb cast. Bong and co-writer Han Jin-won easily deliver the best original screenplay of the year. Flawless.",
      "author": "Joe Friar"
    },
    {
      "text": "For a good while, you think that you are in a rare comedy and in the end you discover that it has become a bitter parable. [Full Review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "It is breathtaking to observe how Bong juggles the many different tones and themes in one, masterful piece of screenwriting.",
      "author": "Zhuo-Ning Su"
    },
    {
      "text": "A single piece that touches deep into the heart, exciting, marveling, and shivering as only masterpieces can do. [Full review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Bong designs a structure where the targeted layers are not so much the final objective... but the wrapping of a story of intrigue where the details of the sequences and the rhythm with which they happen are more important. [Full review in Spanish]",
      "author": "Ignacio Navarro"
    },
    {
      "text": "Parasite is stuffed with everything-gorgeous architecture, beautiful people, shocking violence, ingenious twists, wicked humor, and clear-eyed social commentary.",
      "author": "Max Weiss"
    },
    {
      "text": "We are all trapped by the system, though some of us are trapped in gilded cages, whiles others live among the rats.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "With \"Parasite,\" Bong Joon-ho gives the \"Upstairs, Downstairs\" premise a long-overdue update.",
      "author": "Martin Tsai"
    },
    {
      "text": "Timely in its class divide critique, Parasite balances dark satire with heartwarming family dynamics.",
      "author": "Michelle Kisner"
    },
    {
      "text": "\"Parasite\" is a timely commentary about our era of the classist \"gig\" economy, in which the transactional overcomes decency and humanity.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Parasite boasts one of the most pitch-perfect ensembles of recent memory.",
      "author": "Lisa Trifone"
    },
    {
      "text": "The fact that it manages to blend dark comedy and suspense while also being accompanied by unforgettable crisp visuals makes it stand out from most films released within years.",
      "author": "Andrew J. Salazar"
    },
    {
      "text": "A standing ovation to cinematographer Kyung-pyo Hong, who also lensed the visually impressive Snowpiercer, for setting the perfect tone.",
      "author": "Julie Crawford"
    },
    {
      "text": "Bong Joon Ho shifts style from one genre to the next throughout the film, but always finds the universal humanity that brings the audience in for more than just laughs and thrills.",
      "author": "David Poland"
    },
    {
      "text": "It's just so rare to get a movie that actually surprises you these days...",
      "author": "Martin Thomas"
    },
    {
      "text": "There was so much going on, and all of it came together for one sensible thing...this is the kind of stuff Hollywood makes because they can't make it for themselves.",
      "author": "Korey Coleman"
    },
    {
      "text": "A masterful commentary on class, Parasite issues a new guideline for contemporary horror.",
      "author": "Sadaf Ahsan"
    },
    {
      "text": "There's no doubt that the idea is interesting and brings about ingenious and really funny scenes. [Full review in Spanish]",
      "author": "Jaime Fa de Lucas"
    },
    {
      "text": "[The Park's] garage door is the curtain, the grand window looking out from the living room onto the yard is the proscenium, and everything that occurs within its reflection is this symbiotic tragicomedy...",
      "author": "Adam Kempenaar"
    },
    {
      "text": "You don't want to know too much about it in advance. Parasite unfolds in such a surprising way that watching it work on an audience - through levels of delight, shock and disbelief - is part of the fun.",
      "author": "Robert Horton"
    },
    {
      "text": "Parasite plumbs the depths of class divisions and personal delusion, as well as the fragility of a social order that seems secure.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Taking on the disturbingly universal issue of class disparity, the filmmaker has crafted not just a brilliantly sharp and cutting satire, but also what unfurls as a shocking and dramatic thriller with more than a few surprises up its sleeve.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "Bong Joon-Ho's Lunatic Must-See New Film is His Best and Most Bonkers",
      "author": "Chase Whale"
    },
    {
      "text": "The resulting film offers an at turns hilarious and deeply unsettling look at class and survival, its essence echoed in the environments the characters inhabit.",
      "author": "Jas Keimig"
    },
    {
      "text": "A condescending, pessimistic portrayal of human nature, bereft of class consciousness or ideology...",
      "author": "Prairie Miller"
    },
    {
      "text": "It's a nearly perfect film, from Bong's masterful use of framing and visual language and control of a wildly shifting tone to the performances (all terrific) to the commentary on class division.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "The entire cast is prepared to make the family unlikable at some level, but this should be a starmaking turn for Park So-dam. Her performance as Ki-jeong and her alter ego, Jessica the art student from Chicago, is raw, caustic genius.",
      "author": "Richard Whittaker"
    },
    {
      "text": "The cleverness of PARASITE unfolds in slight deviations from what we expect... Mistakes, misperceptions, and misunderstandings accumulate, like heavy rains at the bottom of a long staircase-a drip, a drizzle, a torrent, a deluge.",
      "author": "Rubin Safaya"
    },
    {
      "text": "A crazy game of poker. It'll keep you on your toes and will have you hunkering down like a moth to a flame.",
      "author": "Preston Barta"
    },
    {
      "text": "It's a film specifically about false surfaces (both figurative and literal), confidence games, and lies.",
      "author": "Nathanael Hood"
    },
    {
      "text": "Like Joker, Parasite brilliantly explores the haves vs the have nots and how it's becoming an explosive situation. A masterful piece of filmmaking by Bong Joon Ho.",
      "author": "Grace Randolph"
    },
    {
      "text": "Fun and unsettling. [Full Review in Spanish]",
      "author": "Quim Casas"
    },
    {
      "text": "Parasite is deliciously mischievous and a masterwork of pure and utter deceit with a mesmerizing conclusion that leaves you breathless and reflective.",
      "author": "Chris Sawin"
    },
    {
      "text": "Parasite radically shifts tones over its wildly entertaining two-hour-plus running time.",
      "author": "Ken Eisner"
    },
    {
      "text": "\"Parasite\" may be the work that makes (Bong Joon-ho) more of a household name. Many of the best elements from his previous films are on display here, and if there's one film that should serve as an introduction to his style, it's this one.",
      "author": "Cary Darling"
    },
    {
      "text": "Bong Joon Ho makes genre movies about ideas. His films turn ideology into action, and every shot in 'Parasite' is some sort of argument.",
      "author": "Sean Burns"
    },
    {
      "text": "Parasite is an appropriately enigmatic title for a satire that cuts both ways.",
      "author": "Kelly Vance"
    },
    {
      "text": "Beautiful! Brutal! and Brilliant! This Korean comedy thriller is more like two films in one. Director Bong Joon-Ho (Snowpiercer) has carefully thought out this clever take on the haves and have-nots that we'll call US Plus!",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "...like Shoplifters' ugly twin brother, who's kept hidden in the basement.",
      "author": "Josh Larsen"
    },
    {
      "text": "A deliciously twisted thriller-comedy akin to a home invasion flick, filled to the brim with meaning and dripping with directorial mastery.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "It gives you a lot to think about, with no clear heroes and extreme moral ambiguity.",
      "author": "Reuben Baron"
    },
    {
      "text": "[Joon-ho]'s a master of his craft, accounting for the most minute of details while making it look like almost no work at all. His films exert a cool casualness despite their often complicated webs of plots and chameleon-esque tone.",
      "author": "Matt Oakes"
    },
    {
      "text": "Economic disparity may be the greatest subject of the twenty-first century for intimate horror.",
      "author": "Ray Pride"
    },
    {
      "text": "Joon-ho is an excellent filmmaker and this might just be his piece-de-resistance.",
      "author": "Jazz Tangcay"
    },
    {
      "text": "This is the best movie of the year... A tonal marvel.",
      "author": "Christy Lemire"
    },
    {
      "text": "An absolutely extraordinary achievement on every conceivable level, even though I think it's a bit of a cheat.",
      "author": "Wade Major"
    },
    {
      "text": "It's an ingenious satire of class that goes to some shockingly dark places. But it's also so, SO funny, finding humor in all sorts of places that the movies rarely do",
      "author": "Stephen Silver"
    },
    {
      "text": "You'll watch knowing you're in the hands of a master filmmaker...",
      "author": "Moira MacDonald"
    },
    {
      "text": "It's pure-strain Bong all the way through, surprising and unsubtle in all his appealing glory.",
      "author": "Clint Worthington"
    },
    {
      "text": "Surprising in its observations and developments, the film is has all the makings of one destined for rewatch and deeper examination in perpetuity - a film with the power to continue to reveal things about how we interact and how we survive.",
      "author": "Chris Feil"
    },
    {
      "text": "\"Parasite\" expresses consequential ideas that matter to the filmmaker about the way we live today, and the prejudice and malice we create for ourselves and others.",
      "author": "Michael Phillips"
    },
    {
      "text": "Let's just get this out of the way: Parasite is the best film of 2019.",
      "author": "Marianna Neal"
    },
    {
      "text": "Throughout, the director's camerawork and mise en scene are impressively subtle, carefully parsing out information about characters and setting to force viewers to stay alert to the tiniest details.",
      "author": "Ben Sachs"
    },
    {
      "text": "One of the best movies of 2019, Bong Joon Ho's latest is a film of dramatic power, innovative comedy, romantic poetry and melancholy beauty.",
      "author": "Richard Roeper"
    },
    {
      "text": "One of the year's best, Bong Joon Ho's Parasite is an absurdly masterful dissection of division and greed, and a thunderously assorted filmgoing experience.",
      "author": "Luke Parker"
    },
    {
      "text": "Scathingly brilliant, satirical and exquisitely frenzied.",
      "author": "Anne Brodie"
    },
    {
      "text": "By returning to familiar themes and family values, Bong has again latched on to the collective mindset with a touch and a tease of the outré.",
      "author": "Tom Meek"
    },
    {
      "text": "\"Parasite\" isn't really a monster movie. Yet on at least one of its nearly infinite levels it is - and the monsters are us.",
      "author": "Ty Burr"
    },
    {
      "text": "Having dramatized the struggle of rich versus poor in wildly lurid terms, he brings the conflict to its dreadful conclusion with the simplest, smallest, most everyday gesture possible.",
      "author": "Stuart Klawans"
    },
    {
      "text": "Parasite is a marvelously tense, propulsive film of sharp angles, smells, and cold light.",
      "author": "E. Tammy Kim"
    },
    {
      "text": "Like a blood-sucking creature that can't let go, the movie is patient and relentless, but unlike its namesake, this \"Parasite\" is hilarious, gory and, in the end, moving.",
      "author": "Pat Padua"
    },
    {
      "text": "The hilarious, thrilling, and thought-provoking Parasite is a master class of tone control.",
      "author": "Mark Dujsik"
    },
    {
      "text": "All of its elements-the natural performances, dense plotting, and staggering political implications-coalesce into an undeniably provocative whole.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Few films tap into the cultural zeitgeist as brilliantly and originally as Parasite does.",
      "author": "Pat Mullen"
    },
    {
      "text": "As we watch both families act in different, but intersecting, pieces of social/anthropological theatre, Bong [Joon-ho] cuts through their mutual hunger, and what ultimately and tragically separates them, with a jaundiced eye and an acidic sense of humor.",
      "author": "Kyle Turner"
    },
    {
      "text": "A one-of-a-kind combination of keenly felt drama and sly social satire that is already a master class in contemporary filmmaking before it shifts narrative gears in ways that need to see to be believed.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Expect some blood and a surprisingly poignant ending.",
      "author": "Jana Monji"
    },
    {
      "text": "Bong... harnesses the precise anxieties everyone of us is currently sharing-top of that list, the growing income gap and the crumbling planet-and uses them to make every scene in this blackhearted comic thriller crackle with energy and purpose.",
      "author": "Oliver Jones"
    },
    {
      "text": "Bong Joon-ho's latest masterpiece and the best film I've seen so far this year...",
      "author": "Mick LaSalle"
    },
    {
      "text": "Gloriously amoral tale of an unscrupulous poor family that connives its way into the mansion of a rich, gullible clan is very funny and very dark. Sure-handed and sly, with a moral compass that wavers as the tables turn",
      "author": "Jim Slotek"
    },
    {
      "text": "Bong takes this battle between classes and one family's attempt to take that much craved next step up the economic ladder, and twists it into a fun house thrill ride.",
      "author": "Joshua Brunsting"
    },
    {
      "text": "Much like the Kims, a viewer can get lulled into luxuriating in the superficial details of the film. But it's what's lurking below the surface that will stay with you long after the movie is over.",
      "author": "Hau Chu"
    },
    {
      "text": "Bong harnesses the torment that capitalist greed, deregulation, and gaping inequality have unleashed across the world, making Parasite's dystopian vision ring universally true.",
      "author": "Ela Bittencourt"
    },
    {
      "text": "Parasite is the most powerful, most important, most essential film of 2019, a perfect distillation of style and substance, an ideal conclusion for such an amazing decade for Asian cinema.",
      "author": "Manzanares de la Rosa"
    },
    {
      "text": "Bong [Joon-ho] plays merrily with the narrative, spinning it in ways that add clever observations on the themes while deepening characters and keeping the audience both amused and unnerved.",
      "author": "Rich Cline"
    },
    {
      "text": "\"Parasite\" combines dark humor, social commentary and domestic thriller elements to explore the vicious class divisions in South Korea. Like few recent films it not only captures social relations in its country of origin, but anywhere in the world.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Bong Joon Ho dazzles your senses and infects your mind with a delicious concoction of artful entertainment that delivers a poignant cinematic experience. [Full review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Bong builds the tension with sequences that could be worthy of Hitchcock, with their sharp tension and biting outcomes. But the filmmaking always exerts a moral awareness on the increasingly rushed and angry bodies.",
      "author": "Craig Mathieson"
    },
    {
      "text": "An unmistakable crowd pleaser ... featuring a linear steel trap of a script.",
      "author": "Kent Turner"
    },
    {
      "text": "A triumph of directing, writing, cinematography and acting. It's destined to become an all-time classic that will be discussed and analyzed for many years to come. Believe the hype.",
      "author": "Avi Offer"
    },
    {
      "text": "Cinematographer Kyung-pyo Hong's (\"Mother\") camera often pans in a vertical motion, emphasizing the upstairs downstairs elements of Bong's story... one of the year's most entertaining movies.",
      "author": "Laura Clifford"
    },
    {
      "text": "What starts out as a fantasy becomes a family's struggle with their place in a global framework designed to keep them down. They realize that getting out of the basement will require more than a few agile maneuvers.",
      "author": "Rachel Syme"
    },
    {
      "text": "Bong Joon-ho's latest film is virtually everything one could desire in a contemporary film.",
      "author": "Scott Nye"
    },
    {
      "text": "There's not many movies this year as sleek and polished as Parasite. An absolute delight to watch with Bong Joon Ho proving himself to be a masterful director again.",
      "author": "EJ Moreno"
    },
    {
      "text": "Parasite is a brilliant film and for a thriller, it's absolutely unpredictable...",
      "author": "Alan Ng"
    },
    {
      "text": "Bong masterfully blends these divergent genre elements into one wildly original whole, crafting an incisive indictment of income inequality and the wide gulf between the classes that is as bitterly funny as it is achingly sad.",
      "author": "Mattie Lucas"
    },
    {
      "text": "South Korean filmmaker Bong Joon-ho already has an impeccable track record, but he's stepped up his game with this brilliant, powerfully revealing social satire.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A very wild ride, and maybe Bong's best...",
      "author": "Kurt Loder"
    },
    {
      "text": "Bong Joon-ho has crafted one of the funniest comedies, most bristling class takedowns, creepiest thrillers, and contemplative films of the year.",
      "author": "Terence Johnson"
    },
    {
      "text": "Bong is an unfunny extremist. In Parasite, he annihilates the concept of the nuclear family by setting a brood of lower-class con artists against an upper-class family unit.",
      "author": "Armond White"
    },
    {
      "text": "Parasite may just be the most entertaining genre-bender of the year but more than this, the film brings a fascinating approach to class.",
      "author": "Danielle Solzman"
    },
    {
      "text": "What keeps you rapt in Parasite is the visual wit - every shot distills the movie's themes - and the richness of the characters and performances...",
      "author": "David Edelstein"
    },
    {
      "text": "Bong, in short, is a merchant of stealth.",
      "author": "Anthony Lane"
    },
    {
      "text": "This is the best movie I've seen this year. What begins as a clever social satire about the haves and have-nots in our world morphs into an ingenious (and violent) thriller with endless story twists.",
      "author": "Leonard Maltin"
    },
    {
      "text": "There may not be such a thing as a perfect film, but Parasite comes incredibly close.",
      "author": "Rob Dean"
    },
    {
      "text": "It's exhilarating, unexpected and, frankly, wild.",
      "author": "Anne Cohen"
    },
    {
      "text": "Imagine a high-wire act where the acrobat suddenly leaps to a higher wire, then to another that's higher still. It's the best way I can think of to describe the giddy thrill of watching Parasite, a masterpiece of serial surprises.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Nimble, funny, complex and heartbreaking, Parasite is a stinging indictment of economic inequality.",
      "author": "Thelma Adams"
    },
    {
      "text": "Bong's trademark slapstick is still here but the rough edges of his often too-loud lessons are shaved down nicely and his actors step forward",
      "author": "Mark Kennedy"
    },
    {
      "text": "An arthouse masterpiece, a strong contender for the best film of 2019.",
      "author": "Morgan Rojas"
    },
    {
      "text": "Maybe the best film Bong has yet made...",
      "author": "Dana Stevens"
    },
    {
      "text": "This is a dazzling work, gripping from beginning to end, full of big bangs and small wonders.",
      "author": "Dave Calhoun"
    },
    {
      "text": "In terms of sheer enjoyment alone, Parasite delivers. The movie is as darkly funny as its director, and even with a runtime just on the far side of two hours, it never loses its momentum.",
      "author": "Jeva Lange"
    },
    {
      "text": "A light farce that gradually transforms into an urgent class parable, getting exponentially more compelling moment by moment. Possibly Bong's best, and certainly one of the best of the year.",
      "author": "Vincent Mancini"
    },
    {
      "text": "All the viewer knows is that Bong is telling a story about humans, which means it can be a perfect comedy until it becomes a tragedy.",
      "author": "David Sims"
    },
    {
      "text": "As I left the theater, the first words that were uttered under my breath was, \"Oh, so this is what Cinema feels like?\"",
      "author": "Rendy Jones"
    },
    {
      "text": "Bong has some ideas in \"Parasite,\" but the movie's greatness isn't a matter of his apparent ethics or ethos... but of how he delivers truths, often perversely and without an iota of self-serving cant.",
      "author": "Manohla Dargis"
    },
    {
      "text": "This is a uniquely entertaining movie --- one that you can't stop thinking about long after leaving the theater.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "The ever-suspenseful PARASITE keeps us guessing throughout. ..one of 2019's best-conceived movies.",
      "author": "David Kaplan"
    },
    {
      "text": "It tells a story you could probably follow without subtitles, or any dialogue at all: the faces of these actors show with piercing clarity how it feels to be outsiders in a world of wealth and privilege.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Cinematic perfection doesn't come around often. When it does, it's essential to take notice. \"Parasite,\" from top to bottom, is a perfect film.",
      "author": "Joey Magidson"
    },
    {
      "text": "[Parasite] is a crazy, intense, twisted, and dark movie.",
      "author": "John Nguyen"
    },
    {
      "text": "\"Parasite\" is Bong's most sophisticated film to date, expertly plotted with breathtaking reveals, and shot with a smooth, slippery sheen, each frame and camera movement communicating a subconscious plot twist or theme.",
      "author": "Katie Walsh"
    },
    {
      "text": "Let's just say it: the South Korean auteur Bong Joon Ho is some kind of genius and he tops himself with 'Parasite'-it's explosive filmmaking on every level and one of the cinema high points of 2019 . You won't know what hit you.",
      "author": "Peter Travers"
    },
    {
      "text": "Class warfare among two South Korean families is treated with both comedy and horror in Bong's latest picture.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Bong Joon Ho's Cannes Film Festival winner is a flat out masterpiece.",
      "author": "Pete Hammond"
    },
    {
      "text": "Brilliantly crafted film delving full on into social class, racism within the race with a delicious twist in the final act make Parasite a must-see!",
      "author": "Carla Renata"
    },
    {
      "text": "Parasite is loaded with good performances and memorable characters that go from anecdotal to social radiography. [Full Review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "\"Parasite\" attaches to you and doesn't let go.",
      "author": "Brian Truitt"
    },
    {
      "text": "Parasite is a real gem",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Parasite navigates human morality in an interesting way that is not dissimilar to Patricia Highsmith's stories.",
      "author": "Juan Barquin"
    },
    {
      "text": "If anything, Parasite is a condemnation of choosing to ignore the inconvenient suffering of your fellow human beings, presented in a seres of accomplished visual metaphors that'll make you rethink all sorts of ordinary household objects.",
      "author": "Katie Rife"
    },
    {
      "text": "Best Movie of 2019; Parasite has a unique creative story, characters that feel real, and an underlying message about high and low classes, conveyed thrillingly.",
      "author": "Jason Escamilla"
    },
    {
      "text": "How Bong gets me to gasp, shriek, and laugh within the span of seconds is beyond me. It's a film that you would want to rewatch the second it's over.",
      "author": "Kevin L. Lee"
    },
    {
      "text": "Bong Joon-ho, who has consistently played with what the class system means in a modern day South Korea, has finally reached his pinnacle with his latest film, Parasite.",
      "author": "Jenny Nulf"
    },
    {
      "text": "At the core of this film is an us-vs-them solidarity that makes even its most contrived narrative payoffs reverberate with emotional authenticity.",
      "author": "Andrew Chan"
    },
    {
      "text": "Parasite is, in fact, a stunning work from one of the cinema's most reliable masters, and it's a film best seen with virgin eyes and ears, knowing as little as possible about its plot, themes or characters.",
      "author": "Nick Johnston"
    },
    {
      "text": "Far from being melodramatically schematic, it leaves some ambiguity around the edges, raising questions it doesn't necessarily claim to be able to answer.",
      "author": "Kyle Smith"
    },
    {
      "text": "By turns hilarious, harrowing, and horrifying, Parasite may well be Bong Joon-ho's best film since Memories of Murder.",
      "author": "Lauren Humphries-Brooks"
    },
    {
      "text": "A tragedy of epic proportions that should scheme, con, and scam its way into many \"best of\" lists by the end of the year.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "This is a darkly amusing masterwork about the never-ending tale of two cities. All in one.",
      "author": "David Crow"
    },
    {
      "text": "Another fantastically outrageous and weird film ... that continues to show the glory of [Korean] cinema and Director Bong as its master.",
      "author": "Edward Douglas"
    },
    {
      "text": "Bong Joon-ho's Parasite is a masterpiece, and essential viewing for our times.",
      "author": "Alan Cerny"
    },
    {
      "text": "[A] stylish, exquisite knife to the heart of capitalism's cruelties.",
      "author": "Eric Webb"
    },
    {
      "text": "What Bong presents with \"Parasite\" is a scenario provoking the imaginary. The bottom line could well be just the wild wide of pure entertainment.",
      "author": "Diana Cheng"
    },
    {
      "text": "It's another of Bong's brilliant but hard to label movies.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The work of a... true filmmaker. [Full review in Spanish]",
      "author": "Jonay Armas"
    },
    {
      "text": "Parasite is one of the best films you'll see this year, and certainly the most insane.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Parasite's horror lingers in the memory, for sure, but it's the intricately crafted and universal social commentary that truly resonates in our modern times.",
      "author": "Tom Beasley"
    },
    {
      "text": "Bong Joon-ho's pitch-black comedy Parasite might his masterpiece.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Not being openly fantastical, Parasite first engages us in a basement that could be part of any science fiction movie.[Full Review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Parasite conjures up images of a creature which takes from a victimized host without a thought of giving or the consequences thereof, but as Joon-ho Bong's latest bit of brilliance unfolds, it's unclear just whom is feeding on whom.",
      "author": "Andrea Thompson"
    },
    {
      "text": "An exhilarating rollercoaster ride that keeps you guessing at every sharp turn, and by the end, leaves you a bit paralyzed by its magnificence.",
      "author": "Oliver Whitney"
    },
    {
      "text": "A masterpiece in storytelling. Parasite is a dark, twisted and unexpected fable about social injustice. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "While it's hugely entertaining, Parasite is also thought-provoking. By the time the catharsis arrives, you think you're at the end of the film, but a coda adds a new wrinkle to the whole thing.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Parasite is many things rolled into one: a sharply observed satire, black comedy, thriller, tragedy.",
      "author": "Shubhra Gupta"
    },
    {
      "text": "One of those cases where it's easy to use the qualifier \"masterpiece\". [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "What Parasite does best is highlight the symbiotic relationship between the rich and the poor. Joon-ho has constantly shown the contrast between the social classes in his work, but Parasite takes the commentary a step further.",
      "author": "Adriana Gomez-Weston"
    },
    {
      "text": "Parasite... is a clever, dark comedy and social commentary about the invisible working poor who will do anything to survive.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "Satire morphs into a savage underclass morality lesson that recalls the home invasion tales of Michael Haneke and Jordan Peele.",
      "author": "Peter Howell"
    },
    {
      "text": "There's no way to predict Parasite, one of those few movies that reinvent themselves at every corner. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Parasite inveigles its way into our consciousness. We laugh, at first, at its skewing of reality and the sheer temerity of its main characters. But laughter soon gives way to fright and then to despair.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Parasite goes from Shoplifters to Get Out to Sorry to Bother You in a breakneck way so unsettling you don't notice it happening.",
      "author": "Walter Chaw"
    },
    {
      "text": "Joon-ho's assured direction, partnered with his passionate and mesmerizing ensemble, \"Parasite\" emerges as one of the year's most vital and entertaining pieces of filmmaking, perhaps one of the most lively to bookend the decade.",
      "author": "Clayton Davis"
    },
    {
      "text": "Joon-ho's film straddles multiple genres, with comedy rubbing shoulders alongside drama, thriller, and eventually horror to tell a story that's as entertaining as it is socially incendiary.",
      "author": "Chris Tilly"
    },
    {
      "text": "It's a hell of a ride - and one of the year's best films.",
      "author": "Norman Wilner"
    },
    {
      "text": "All and all, this is a film with a razor-sharp edge. It's angry, it's joyous, and - to keep it simple - it's a ton of fun.",
      "author": "James Clay"
    },
    {
      "text": "Parasite likely works better as a discovery film or severely managed expectations rather than something that's guaranteed to blow audiences away.",
      "author": "Dustin Chase"
    },
    {
      "text": "Delicious social satire from a master of the genre.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Parasite is unquestionably one of the best films of the year.",
      "author": "Brian Tallerico"
    },
    {
      "text": "An exhilarating and furious indictment of class struggle, Parasite might be the masterpiece South Korea's Bong Joon-ho has been working toward his entire career.",
      "author": "Barry Hertz"
    },
    {
      "text": "There are at least three perfectly good films squeezed into Parasite's 131 minutes. The way Bong Joon-ho weaves them together, without ever slipping into self-indulgence or excess, is nothing short of masterful.",
      "author": "Sarah Kurchak"
    },
    {
      "text": "The speed and ferocity with which things fall apart-and with which Parasite mutates from a sly upstairs-downstairs satire into something more literally and tonally multileveled-is something to behold.",
      "author": "Adam Nayman"
    },
    {
      "text": "The success of Parasite is not merely marked by great filmmaking and an intriguing storyline, but deep within its foundations lies an overwhelming understanding on Bong's part of how bigotry operates at an almost molecular level.",
      "author": "Alexandra Heller-Nicholas"
    },
    {
      "text": "Effortlessly mixing genres, Parasite is a brilliant work that emphasizes that the stairway to financial freedom is rarely accessible to those who need it the most.",
      "author": "Courtney Small"
    },
    {
      "text": "A brilliant, biting, chilling, and darkly hilarious bit of social commentary from Korean master filmmaker Bong Joon-ho that's as entertaining as it is unsettling.",
      "author": "Andrew Parker"
    },
    {
      "text": "A scathing social satire that fuses raucous comedy with deep despair...",
      "author": "Amy Taubin"
    },
    {
      "text": "A dark, deeply funny, searingly relevant tale which will remain embedded in my subconscious for my lifetime.",
      "author": "Kate Rodger"
    },
    {
      "text": "Parasite offers a lot of wicked pleasures, providing you with a delightfully insane cinematic experience. This is pretty strong filmmaking admittedly and one of the best films of the year in its genre.",
      "author": "Filipe Freitas"
    },
    {
      "text": "The journey from the first scene to the end is perhaps the most intricate, most scathing, and surprisingly most accessible portrayal of class struggle put into film.",
      "author": "Oggs Cruz"
    },
    {
      "text": "I certainly won't give away any spoilers here, but suffice it to say that you won't guess any of the secrets, and once the story goes down the rabbit hole, it stays very dark till the end.",
      "author": "Hannah Brown"
    },
    {
      "text": "Parasite is weird, funny and unforgettable.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Bong uses everything in his bag of cinematic tricks to craft a dazzling and devastating movie that is part modern-day parable and part family drama. Parasite will variously shock you, make you laugh (guiltily) and make you think.",
      "author": "Wenlei Ma"
    },
    {
      "text": "Twists and turns aside, this surprise comes more from Parasite's very make-up: the formal strategies, tonal malleability, and sheer density of the film's intricate construction.",
      "author": "Adam Cook"
    },
    {
      "text": "Parasite is Bong Joon-ho at his very best. A masterpiece of storytelling and a captivating dissection of class struggles, it is cinema at its finest.",
      "author": "Jonathan Barkan"
    },
    {
      "text": "Parasite is director Bong in top form; a sadistically funny and dramatically sound cinematic experience that is sure to shock, provoke and linger due to its wonderful performances, audacious storytelling, pitch-black humour and incisive social critique.",
      "author": "Harris Dang"
    },
    {
      "text": "It is surprising, humorous, completely disturbing, and a thoroughly entertaining addition to this golden age of Asian cinema.",
      "author": "Damien Straker"
    },
    {
      "text": "While Ki-taek's family toast their good fortune, catastrophe lies just around the corner. For the Parks, the fairy-tale of their lives proves too good to be true.",
      "author": "John McDonald"
    },
    {
      "text": "Bong has crafted a modern classic... a gripping, frequently funny and often nerve-wracking film...",
      "author": "Steve Newall"
    },
    {
      "text": "Parasite is a subversive delight, and despite its hefty 2 1/4-hour running time is never dull because Bong keeps shifting the goalposts...",
      "author": "David Stratton"
    },
    {
      "text": "Just when you think you have a handle on Joon-ho's film, however, and you mistakenly assume you know why this is called Parasite, it takes a turn though, and becomes an even richer and more profound study.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Devotees of world cinema should make tracks for this right away.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Out of work like the rest of his hard-up South Korean family, Ki-woo has his world seriously rocked when he scams a job with the loaded Park family.",
      "author": "Andiee Paviour"
    },
    {
      "text": "Social satires rarely come as funny, unpredictable or as generous to its characters as this.",
      "author": "John Lui"
    },
    {
      "text": "It's a rollickingly, grim dispatch from a society chowing down on its own entrails, where the underclass are clawing at each other, the rich get twisted up by their own malaise, and everyone's losing their goddamn minds.",
      "author": "Luke Goodsell"
    },
    {
      "text": "Funny, real, gritty and well-supported by a solid cast, the Palme d'Or winner at this year's Cannes Film Festival is a breath of fresh air after the onslaught of Hollywood blockbusters.",
      "author": "Joanne Soh"
    },
    {
      "text": "A ripping good yarn.",
      "author": "Vicky Roach"
    },
    {
      "text": "Parasite benefits from crisp, rich cinematography, a deep back-bench of brilliant performers, and a script of clockwork-like precision.",
      "author": "Tom Augustine"
    },
    {
      "text": "The inspired Parasite can't precisely be labelled a comedy, a thriller, nor a socially conscious drama about the class divide in South Korea, although it contains elements of all three.",
      "author": "Jake Wilson"
    },
    {
      "text": "Parasite is a masterclass in writing and narrative control.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Extremely well crafted and scripted ... Fun, propulsive, ingenious and quite loveable.",
      "author": "CJ Johnson"
    },
    {
      "text": "It's a weird but maybe era-appropriate coincidence that the two best films of the year so far-Us and now Parasite-are searing black comedies about class, featuring two rival families whose differences in wealth are largely the result of chance.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Coming away from this film will leave you with empathy for those less privileged, and yet the film toys with the idea that even if you do fake your way to the top, you still may ultimately end up back in the basement.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "Survivalism ain't pretty, but then that's why all the characters in Parasite rich and poor alike have to dress it up as something more noble.",
      "author": "William Schwartz"
    },
    {
      "text": "A masterful portrait of inequality and imbalance, 'Parasite' latches on and never once lets go.",
      "author": "Doug Jamieson"
    },
    {
      "text": "...the work of a director intoxicatingly in his element.",
      "author": "Andrew Blackie"
    },
    {
      "text": "This dark, dark comedy straddles several genres and is very satisfying.",
      "author": "Lisa Nesselson"
    },
    {
      "text": "The hilariously inventive story has so many unexpected moments of out-there mayhem that it's hard to keep count. And the ways in which Bong turns the screws on the clan of grifters is absolutely riveting.",
      "author": "Stephen Garrett"
    },
    {
      "text": "A riveting and hilarious look at the serious subject of class inequality. Immensely fun and beautifully made.",
      "author": "Jo-Ann Titmarsh"
    },
    {
      "text": "Parasite puts a wickedly literal spin on the notion that there is always someone lower on the socioeconomic ladder.",
      "author": "Dennis Lim"
    },
    {
      "text": "It may seem far-fetched and absurd, but when you think about it, it is freakishly grounded in reality. This makes it not only the director's story, but each viewer's story as well.",
      "author": "Min-sik Yoon"
    },
    {
      "text": "A film so full of provocative and stimulating ideas that each of its twists could be a new movie. [Full review in Spanish]",
      "author": "Juanma Ruiz"
    },
    {
      "text": "Only a creator as free and as original as Bong Joon-ho can succed in turning out an adventure so unorthodox and as stimulating, as unpredictable and as devastating as Parasite. [Full review in Spanish]",
      "author": "Carlos F. Heredero"
    },
    {
      "text": "An excellent film about the 'others'. [Full review in Spanish]",
      "author": "Àngel Quintana"
    },
    {
      "text": "A work with impeccable narrative rigor. [Full Review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "Parasite is a complex, thrilling and audacious social satire, and an instant contender for film of the year.",
      "author": "Tom Bond"
    },
    {
      "text": "Parasite flits between dark comedy, thriller, horror and farce with such ease that the boundaries become indistinguishable.",
      "author": "Iana Murray"
    },
    {
      "text": "Bong is very happy to indulge in farcical satire and by the midpoint of his movie, it seems that we're settling in for a modern take on the contrasts between two players in the class struggle.",
      "author": "Luiz Oliveira"
    },
    {
      "text": "The film has a power, a vertigo, a virtuosity, a disgrace and an uncomfortable picardy that make the Korean filmmaker one of the most impious observers of the deep inequalities that wild capitalism generates. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "It is exciting to see Bong Joon Ho's facility to pass the most devastating messages about the world that we tread almost without being noticed. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "'Parasite' is all I can ask of a film. Surprising, hilarious, exciting and, above all, a masterful lesson in staging. [Full Review in Spanish]",
      "author": "Luis Caviaro"
    },
    {
      "text": "You expect the whole enterprise to come crashing down around his ears, but this is a film-maker in total control of his craft.",
      "author": "Ed Potton"
    },
    {
      "text": "As the third act grinds to a grim conclusion, the yawning social divisions cause the laughter to curdle into unease. It's an extraordinary performance.",
      "author": "Donald Clarke"
    },
    {
      "text": "The social commentary is almost as powerful as the plot itself.",
      "author": "Emma Jones"
    },
    {
      "text": "Be prepared to burst into compulsive applause throughout the movie as holding in your excitement will feel unthinkable.",
      "author": "Luke Hicks"
    },
    {
      "text": "The director's fiercely intelligent voice is unmistakable in Parasite, but the playfulness keeps an audience irretrievably invested.",
      "author": "Ella Kemp"
    },
    {
      "text": "Parasite is a vital, extraordinary slice of blood-boiling entertainment, surveying human ambition to piece together exactly why a class system is failing an entire country.",
      "author": "Gus Edgar"
    },
    {
      "text": "To say more about Parasite and spoil its secrets would be to ruin the fun, but rest assured, as Bong's class satire is one of his finest films to date.",
      "author": "Alistair Ryder"
    },
    {
      "text": "A brilliantly written satirical-suspense comedy. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "There are other similarities with his twisted 2013 sci-fi. Joon-Ho's use of contained spaces once again allows the director to navigate his subject matter very effectively.",
      "author": "Joseph Walsh"
    },
    {
      "text": "Shifts tonal gears in total service of its class politics, infecting the film's breezy dark-comedy with notes of rage and melancholy.",
      "author": "A.A. Dowd"
    },
    {
      "text": "\"Parasite\" begins in exhilaration and ends in devastation, but the triumph of the movie is that it fully lives and breathes at every moment, even when you might find yourself struggling to exhale.",
      "author": "Justin Chang"
    },
    {
      "text": "It grips from first frame to last.",
      "author": "Jamie Graham"
    },
    {
      "text": "You'd be hard-put to find anything with the acerbic brilliance of Bong Joon-ho's Parasite, a masterful dissection of social inequality and the psychology of money.",
      "author": "John Bleasdale"
    },
    {
      "text": "To say much more would be to give away too many delicious surprises, but the film unfolds like a warped blend of Jordan's Peele's Us and Hirokazu Kore-eda's Shoplifters in its blazingly brutal, smart and heartfelt messaging.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "Ever the sui generis genre-switcher, Bong this time has his class struggle play out in a con-family comedy. And it's a riot.",
      "author": "Isabel Stevens"
    },
    {
      "text": "Melts Buñuel with Hitchcock. [Full review in Spanish]",
      "author": "Daniel de Partearroyo"
    },
    {
      "text": "The impotent rage he feels about that spills into every frame of this incredible film, and leaves us all a little richer as a result.",
      "author": "David Ehrlich"
    },
    {
      "text": "A wonder of an allegory.",
      "author": "Richard Lawson"
    },
    {
      "text": "A demented and often-uproarious class-conscious satire, \"Parasite\" falls slightly short of Bong's greatest work.",
      "author": "Bradley Warren"
    },
    {
      "text": "Imagine the premise and empathy of Hirokazu Koreeda's Shoplifters, but with the genre-defying tone and brash ambition of Jordan Peele's Us. Such is Parasite, a work of maniacal cinematic genius.",
      "author": "Joel Mayward"
    },
    {
      "text": "[Parasite is] transcending dramatic comedy, and even social satire. [Full review in Spanish]",
      "author": "Clarín Staff"
    },
    {
      "text": "There is absolutely nothing subtle about Bong Joon-ho's \"Parasite.\" It feels like Kore-eda on steroids.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Despite wearing its central conspicuous messages blatantly on its sleeve, this is another piquant pleasure from Joon-ho -- a hostile dramedy with something new to say about families who stay together.",
      "author": "Nicholas Bell"
    },
    {
      "text": "A nerve-racking masterpiece whose spell lingers long after its haunting final image.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Pivoting from hysteria to grotesque on a moment's notice, it's a bloodthirsty farce.",
      "author": "Hannah Strong"
    },
    {
      "text": "Parasite is bravura filmmaking at its finest. Heavenly.",
      "author": "James Mottram"
    },
    {
      "text": "Bong is back and on brilliant form, but he is unmistakably, roaringly furious, and it registers because the target is so deserving, so enormous, so 2019: \"Parasite\" is a tick fat with the bitter blood of class rage.",
      "author": "Jessica Kiang"
    },
    {
      "text": "It's a film that burrows under your skin and sinks in its teeth.",
      "author": "Robbie Collin"
    },
    {
      "text": "Parasite gets its tendrils into you.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Parasite is generally gripping and finely crafted, standing up well as Bong's most mature state-of-the-nation statement since Memories of Murder in 2003.",
      "author": "Stephen Dalton"
    },
    {
      "text": "A vigorous and tightly controlled comedy that sees [Bong] back on top form, with a story that's both rigorously achieved and very specifically Korean.",
      "author": "Jonathan Romney"
    }
  ],
  "release_year": 2019,
  "duration": 132,
  "genres": [
    "Comedy",
    "Mystery & Thriller",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "Greed and class discrimination threaten the newly formed symbiotic relationship between the wealthy Park family and the destitute Kim clan.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/7IiTTgloJzvGI1TAYymCfbfl3vT.jpg"
}