{
  "movie_name": "Psycho",
  "movie_id": "psycho_therapy_the_shallow_tale_of_a_writer_who_decided_to_write_about_a_serial_killer",
  "total_reviews": 13,
  "reviews": [
    {
      "text": "Thankfully the ends justify the means once Karaçelik goes full speed into the metaphor that marriage is similar to murder. Or, more specifically, that the adrenaline rush of one just might be the jump start necessary to reinvigorate the other.",
      "author": "Jared Mobarak"
    },
    {
      "text": "... a compelling, darkly comedic, thriller worth spending some time on. All this, plus the combined communication breakdown that results in fascination and affection to regret and (murderous?) rage leads to several humorous turns from the able cast.",
      "author": "Douglas Davidson"
    },
    {
      "text": "With deliciously specific tones and a commendable ambition, Psycho Therapy is a twisted black comedy, at least worth the introductory session.",
      "author": "Tania Hussain"
    },
    {
      "text": "The characters work well...but there’s never quite enough energy to events.",
      "author": "Jennie Kermode"
    },
    {
      "text": "Psycho Therapy is a comedy thriller with some dynamic performances, brought down by a wonky script and incredibly abrupt conclusion.",
      "author": "Jim Vorel"
    },
    {
      "text": "a blackly comedic twist on Hitchcockian marital suspense",
      "author": "Laura Clifford"
    },
    {
      "text": "Psycho Therapy plays out like a dark indie noir comedy from the 90s, which we don't see often nowadays. Tolga Karaçelik's writing is brimming with absurdist humor, keeping unnecessary expositions to a minimum.",
      "author": "Dustin Chang"
    },
    {
      "text": "While it certainly won’t work for everyone, this black-as-pitch comedy has real personality and plenty of it to spare.",
      "author": "Dan Bayer"
    },
    {
      "text": "Clunky but still laden with laughs, an odd specimen that at times does prove truly entertaining.",
      "author": "Abe Friedtanzer"
    },
    {
      "text": "While most movies have a particular section reserved for fun and games, Karaçelik's tale is engaging in its entirety, with captivating performances from its cast that will make parting ways with Keane, Suzie, and Kollmick a difficult thing to do.",
      "author": "Emily Cappello"
    },
    {
      "text": "The movie mutates beyond recognition, refusing to stick to any one idea for longer than a couple of scenes.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "The film adds its main character into a growing list of ‘self-absorbed struggling writer’ movie tropes, but doesn’t provide more dimension to its characterization that helps leave a distinct mark.",
      "author": "Paul Emmanuel Enicola"
    },
    {
      "text": "I can't recommend the film enough—it should be immensely entertaining, especially for those looking for dark humor, confusion, violence, and a premise that's practically impossible to waste. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    }
  ],
  "duration": 102,
  "genres": [
    "Comedy",
    "Mystery & Thriller"
  ],
  "age_rating": "G",
  "synopsis": "Masquerading as a marriage counselor, a serial killer teaches his methods to a desperate writer trying to find inspiration and save his marriage."
}