{
  "movie_name": "Raiders of the Lost Ark",
  "movie_id": "raiders_of_the_lost_ark",
  "total_reviews": 150,
  "reviews": [
    {
      "text": "Cementing Steven Spielberg’s place as the greatest blockbuster director ever, Raiders of the Lost Ark well deserves its spot as the jewel of action cinema.",
      "author": "Harry Solomons"
    },
    {
      "text": "More spectacular and intricate action sequences may have been devised since, but it’s rare to find one with this level of bone-crunching realism and intensity.",
      "author": "Tom Huddleston"
    },
    {
      "text": "Raiders of the Lost Ark is a movie so well-made and confident it didn’t need to have a sequel, but we’re sure glad it did.",
      "author": "Germain Lussier"
    },
    {
      "text": "One of the all-time greats. Harrison Ford is perfection-plus as Indiana Jones, so iconic a character that the AFI cited him as the second greatest movie hero of all time (just under Atticus Finch and just above James Bond).",
      "author": "Matt Brunson"
    },
    {
      "text": "Raiders of the Lost Ark is still the ideal mold for action movies for the generation that followed.",
      "author": "Don Shanahan"
    },
    {
      "text": "From the moment we meet the iconic adventurer all the way to its glorious finale, it remains one of the most fun times one could have at the movies. One only wishes modern action-adventure films had one iota of the craft and creativity of this one.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "To get to the point immediately, Raiders of the Lost Ark is one of the most deliriously funny, ingenious and stylish American adventure movies ever made.",
      "author": "Vincent Canby"
    },
    {
      "text": "[Raiders of the Lost Ark] grabs you in the first shot, hurtles you through a series of incredible adventures, and deposits you back in reality two hours later -- breathless, dizzy, wrung-out, and with a silly grin on your face.",
      "author": "Roger Ebert"
    },
    {
      "text": "A glorious mixture of spectacular, fast-paced action and sly humor.",
      "author": "John Brosnan"
    },
    {
      "text": "There was the almost exhausting excitement of the film itself. And at the same time a second emotion, a rush of gratitude which almost brought tears for the contagious joy and -- not to be corny about this -- the strength of the film's positive vision.",
      "author": "Sheila Benson"
    },
    {
      "text": "Raiders is the most fun to hit the screen since movies came in chapters. Reportedly, there are further adventures of Indiana Jones in the works. Let's hope so. Something this good deserves To Be Continued.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "It is, in short, a reminder of the very reason we go to movies. With its larger-than-life, wide screen images, the rich stereo sound, films such as Raiders of the Lost Ark are what will save the movie theater business from the video invasion.",
      "author": "Patrick Taggart"
    },
    {
      "text": "It is a transcendent blend of heroic exploits, cliffhangers and chases distilled with nostalgia and wit from the pulp thrillers, comic books and Republic serials of the World War II era.",
      "author": "Gary Arnold"
    },
    {
      "text": "It's all done with such a great spirit of high adventure and good humor that you don't even begin to count the corpses... The finale suggests that Ford's Indiana Jones character will soon be back with further adventures, and I'm all in favor of it.",
      "author": "Arthur Knight"
    },
    {
      "text": "Yes, it's as entertaining as you have heard. Maybe more so. Raiders of the Lost Ark is, in fact, about as entertaining as a commercial movie can be.",
      "author": "Gene Siskel"
    },
    {
      "text": "After watching just the first five minutes of Raiders of the Lost Ark, you’re hooked. You’re held captive in a action-packed world of adventure and romance and you can’t turn away because the thrills keep coming faster and faster, bigger and better.",
      "author": "Vern Stefanic"
    },
    {
      "text": "Harrison Ford, who was Han Solo in Lucas' Star Wars, plays Jones in a hat and a generally unshaven condition that makes him look a great deal like the late Humphrey Bogart in Casablanca.",
      "author": "Joe Pollack"
    },
    {
      "text": "To say the Raiders of the Lost Ark is action-packed is to understate the case. There is hardly a scene that does not take your breath away.",
      "author": "Terry Orme"
    },
    {
      "text": "Raiders is as snappy as the crack of a whip, as daring as a leap over a snake-infested ravine, as rowdy as a fistfight in a grimy bar in Nepal, and as much fun as you could ever want in a film.",
      "author": "Jack Garner"
    },
    {
      "text": "[Raiders of the Lost Ark] is destined for some kind of popcorn immortality. Rare in this world of one-shot communication, it makes one want to see it again and again. Without question, it's the best film of the summer.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Raiders of the Lost Ark is a heady mixture of high adventure, street-smart humor and hardboiled romance in the midst of nonstop lethal battles between the forces of -- yes -- good and evil.",
      "author": "Joseph Gelmis"
    },
    {
      "text": "John Williams, who wrote the atmospheric musical backgrounds for Star Wars and Empire, has succeeded again for Raiders.",
      "author": "Sumner Rand"
    },
    {
      "text": "The moviegoing majority those of us who, for two hours at least, want to live and die with the characters up there on the screen can leave the theater satisfied with the special kind of escapist fun that people want from summer movies.",
      "author": "Kelly Scott"
    },
    {
      "text": "A terrific amount of novelty and gut-busting hard work might have gone into Raiders of the Lost Ark, for example, but much of it is cold and mechanical.",
      "author": "Joe Baltake"
    },
    {
      "text": "...Pretends to be nothing more than sheer entertainment, and it delivers with a voltage that keeps the movie crackling with tension. It is not what one would call an actor's movie, but both Ford and Allen make the most of what they are given to work with.",
      "author": "Desmond Ryan"
    },
    {
      "text": "Only true children of the movies, like Lucas and Spielberg, could have brought such zest and conviction to Raiders of the Lost Ark. But the wide-eyed kid in all of us can thrill to their work.",
      "author": "George Anderson"
    },
    {
      "text": "Incredibly enough, \"Raiders\" packs more fun and excitement onto the screen than either [Jaws or Star Wars].",
      "author": "Malcolm Johnson"
    },
    {
      "text": "Given the state of the motion-picture industry, perhaps Raiders of the Lost Ark is the most we can hope for this summer, or this year: well-made escapism, dripping with opulence.",
      "author": "Terry Kelleher"
    },
    {
      "text": "\"Raiders\" is masterful in its peak-and-valley pacing, with exposition crisply placed within action. It is, without question, the year's most satisfying entertainment.",
      "author": "Wayne Harada"
    },
    {
      "text": "Raiders of the Lost Ark has the texture of a film bursting with influences, and Lucas and Spielberg have managed to get them in without strain.",
      "author": "Burl Burlingame"
    },
    {
      "text": "In the main, it's not acting or acting direction that makes \"Raiders\" such a fascinating attraction. It's action and action direction. It never abates.",
      "author": "Elston Brooks"
    },
    {
      "text": "The most exhilarating movie entertainment since Star Wars. I'd go back even father than that, but I don't want to sound crazy. I'll just say that if they were trading cards, I wouldn't take two Star Wars and a Superman for one \"Raiders.\"",
      "author": "Jack Mathews"
    },
    {
      "text": "This movie should make major heartthrobs out of Harrison Ford and Karen Allen. The electricity generated between [them] is reminiscent of the current that used to jump between Humphrey Bogart and Lauren Bacall.",
      "author": "Bruce Bailey"
    },
    {
      "text": "What Lucas has done, by creating the altogether splendid character of Indiana Jones, adventure-archeologist, is to provide us with a reminder of what the old Saturday morning adventure serials were all about.",
      "author": "Noel Taylor"
    },
    {
      "text": "Raiders of the Lost Ark is fizzy and decadent like a glass of lemonade; good, home-made lemonade with only the best ingredients, but lemonade nonetheless. It isn't trying to pass itself off as vitamin-fortified vegetable juice. This honesty is refreshing.",
      "author": "Geraldine Brooks"
    },
    {
      "text": "As Indiana Jones, Harrison Ford performs with a nice balance of exuberance and calculation, seriousness and tongue-in-cheek. He assumes a deadpan that doesn't quite mask lively intelligence. He never loses his head, or the snapped-brim hat that crowns it.",
      "author": "Neil Jillett"
    },
    {
      "text": "What really lifts Raiders of the Lost Ark to the level of escapist entertainment it attains is the sheer film-craft of its producer and director.  The result is something one might describe as \"new-improved nostalgia.\"",
      "author": "John Lapsley"
    },
    {
      "text": "To tell the truth, there is so much that it might grow a little wearisome were it not for the playful complicity it cunningly establishes with us filmgoers.",
      "author": "Alexander Walker"
    },
    {
      "text": "Without the tempo and the contrasting characters, about two hours of continual hanging from cliffs in \"Raiders\" leaves you with sore arms.",
      "author": "JoAnn Rhetts"
    },
    {
      "text": "It sends your mind on vacation, allowing you to submit without a care to the sensual. That sensuality, surrounding its audience in a way that the visual and aural puniness of TV never can, is as big and busy as the circus, and as grand as opera.",
      "author": "Lawrence O'Toole"
    },
    {
      "text": "It lacks unity of aim, time, place and action. Worst of all, it lacks thrills... And to think that Mr. Spielberg was once rated as a director of talent. Sad, really.",
      "author": "Eric Shorter"
    },
    {
      "text": "The casual plotting that might have passed muster in the ramshackle context of an old Republic serial just won't support a two-hour super-production, and the disproportion between means and ends becomes increasingly tiresome and ultimately exasperating.",
      "author": "Tim Pulleine"
    },
    {
      "text": "Raiders is not merely an accurate updating of those Saturday afternoon serials about archaeological derring-do in the lost cities of the world. Without ever descending to mere camp, it's also a genuinely witty tribute to a more innocent age of moviegoing.",
      "author": "Richard Freedman"
    },
    {
      "text": "Raiders of the Lost Ark, you see, is the real lalapalooza, a slam-bang, rock-'em-sock-'em adventure film that's as smart and witty as it is comic-book thrilling and exciting.",
      "author": "Terry Lawson"
    },
    {
      "text": "Spielberg has directed it all brilliantly, finding his own way to tell a 1930s story in 1981's visual language. To my mind, It's the best movie he has ever made.",
      "author": "Bernard Drew"
    },
    {
      "text": "[Ford's] is the most pleasing kind of hero, simultaneously wised up and aw shucks, someone who treats the whole picture as a sly joke he is sharing with the audience... This feeling of freshness is the one thing Raiders could use a bit more of.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Through most of Raiders, the lost ark is just the pretext for a lot of slam-bang action... There's literally a thrill a minute. Yet the climax is shot through with the strange uneasiness that's crept onto the movie scene.",
      "author": "David Sterritt"
    },
    {
      "text": "The actors intentionally overplay their lines, and it takes a little getting used to, but that's part of the fun. Miss Allen is especially good.",
      "author": "James Calloway"
    },
    {
      "text": "Spielberg and producer George Lucas have combined the conventions of the 1930s Saturday afternoon serials with the grandeur of a DeMille epic, without stumbling into the pitfalls of either.",
      "author": "Hank Burchard"
    },
    {
      "text": "For all of its fantastic leaps of the imagination... there is an attention to detail that makes Raiders as cinematic as it is exciting.",
      "author": "Rick Chatenever"
    },
    {
      "text": "Raiders of the Lost Ark is everything that Lucas and Spielberg set out to make it -- a forget-your-troubles globe-trotting serial made for modern sensibilities. You know from the start how it’s gonna end, yet you still leave the theater exhilarated. Whew!",
      "author": "Michael Lasky"
    },
    {
      "text": "[Raiders] is at once comfortably familiar-and absolutely new, a wild assemblage of bric-a-brac and spare parts that suddenly, unexpectedly takes off into the stratosphere.",
      "author": "Stephen Schiff"
    },
    {
      "text": "[Raiders is] poised with monstrous delicacy on the cusps between so many pairs of worlds -- childhood and adulthood, anxiety and giddiness, religious miracles and special effects, studies of old movie classics and the primal moviegoing experience.",
      "author": "F.X. Feeney"
    },
    {
      "text": "You could fit its ambitions in an unbuttered popcorn box but it is made with state-of-the-art Hollywood craftsmanship and it has a true Peter Pan sweetness and innocence.",
      "author": "Jeff Simon"
    },
    {
      "text": "The film glories in this deadpan humor and its wacky, improbably escapes and situations.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Raiders of the Lost Ark is terrific. Furiously fast-paced, full of wit, spectacle and cheerful gore, the collaboration between [Spielberg and Lucas] represents what can occasionally go right in the American motion picture business.",
      "author": "Stephen Hunter"
    },
    {
      "text": "The combination of Steven Spielberg and George Lucas is like heaping a banana split atop a baked Alaska. If your movie appetite is ready, prepare to digest Raiders of the Lost Ark.",
      "author": "John Stark"
    },
    {
      "text": "Children may well enjoy its simple-mindedness, untroubled by the fact that it looks so shoddy and so uninventive; in which case the calculated violence seems miscalculatedly excessive.",
      "author": "Tom Milne"
    },
    {
      "text": "Raiders makes for a very entertaining summer afternoon, but it's ultimately a junk-food movie that will be forgotten long before either man's previous work.",
      "author": "Lou Lumenick"
    },
    {
      "text": "The sense of awe the director effortlessly conjured up in the best parts of Close Encounters of the Third Kind is nowhere in evidence... The end result seems more like an exercise in logistics than a piece of personal film-making.",
      "author": "Geoff Brown"
    },
    {
      "text": "With great direction, Spielberg makes the best out of a simple screenplay... [Full review in Spanish]",
      "author": "Emilio Luna"
    },
    {
      "text": "Raiders of the Lost Ark is what the business of making film entertainment is all about.",
      "author": "Andy Adams"
    },
    {
      "text": "Still the gold standard of 80s action, this is the perfect blend of strong storytelling and nostalgia.",
      "author": "Kevin Carr"
    },
    {
      "text": "A classic action movie if ever there was one.",
      "author": "Edward Porter"
    },
    {
      "text": "For this hyped-out adventure packs in as many hairbreadth and “with one leap our hero was free” escapes as a dozen of those escapist serials that once had Saturday matinee audiences agape with horror and delight.",
      "author": "Roland Smith"
    },
    {
      "text": "[Spielberg] has produced a work that is like a thirties serial, only grander, funnier, and blessedly free of interruptions.",
      "author": "David Denby"
    },
    {
      "text": "For Ford, portraying Indiana Jones offered some similarities to his role as Hans Solo while one major glaring difference was the addition of formal schooling.",
      "author": "Allison Rose"
    },
    {
      "text": "Raiders of the Lost Ark is rousing action-adventure fun with a perfectly cast Harrison Ford keeping viewers enthralled for two hours.",
      "author": "Frank J. Avella"
    },
    {
      "text": "From scene to scene the picture surges with nonstop energy and craft.",
      "author": "Brian Eggert"
    },
    {
      "text": "Forty years since its release, Raiders of the Lost Ark remains one of cinema's true masterpieces while spawning a worldwide phenomenon.",
      "author": "Alan French"
    },
    {
      "text": "Sensational... Under Steven Spielberg's witty and brisk direction, \"Raiders\" depicts more hair's-breadth escapes than would seem possible in a two-hour movie. This is a terrific moviegoing experience.",
      "author": "Scott Cain"
    },
    {
      "text": "The popular action pic was a great commercial success despite its lunatic plot.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "To quote the man himself in one of his sequels, 'It belongs in a museum.'",
      "author": "Zaki Hasan"
    },
    {
      "text": "For me, it's not the boulder, it's the book. Anyone who loves Raiders of the Lost Ark can probably name the moment early in the movie when they realized what they were watching.",
      "author": "Brian Phillips"
    },
    {
      "text": "One of the best action-adventure films of all time. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Archeology has never been so cool.",
      "author": "Mike Massie"
    },
    {
      "text": "A rose of a film - a dusty, blood splattered, face melting rose.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Raiders is a cliffhanger in every sense of the word; the action and suspense never let up, aided by a clever script and the exhilarating directorial hand of Spielberg.",
      "author": "Larry Vitacco"
    },
    {
      "text": "Indiana Jones and the Raiders of the Lost Ark isn't just one of the greatest films of the 1980s but one of the all-time classics.",
      "author": "Danielle Solzman"
    },
    {
      "text": "There's not much to do but to sit and wait, laugh and let oneself be carried away by the dizzying array of images that will please all kinds of people. [Full Review in Spanish]",
      "author": "Jesús Fernández Santos"
    },
    {
      "text": "Entertainment that propels the audience inexorably from one excitement to the next.",
      "author": "Bob Thomas"
    },
    {
      "text": "If you've only seen the more recent films and find them somewhat wanting, you owe it to yourself to check out the original to see how fresh and original these blockbuster films once felt.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Raiders is a film which looks far from dated, and is now part of that pantheon of timeless, escapist Hollywood action cinema that can be enjoyed over and over again.",
      "author": "Adam Lowes"
    },
    {
      "text": "Raiders is an assured, relaxed, impressive work. It's almost impossible to resist. It's no more substantial than cotton candy -- but it's easily the best piece of entertainment Hollywood has produced in 1981.",
      "author": "Bruce McCabe"
    },
    {
      "text": "This bullwhip-cracking action-adventure launched the series starring Harrison Ford.",
      "author": "Kate Muir"
    },
    {
      "text": "The script Lawrence Kasdan constructed from Lucas and Philip Kaufman's original treatment built a real structure for those breathless set pieces, and populated it with characters that moved far beyond the cardboard cutouts of the originals.",
      "author": "Jason Bailey"
    },
    {
      "text": "Raiders of the Lost Ark could be a silent film at times, because Spielberg favors actions over words, telling his story with great camerawork. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Raiders of the Lost Ark has more size than substance but nevertheless it's a delightful special big surprise package of a movie that should turn Indiana Jones into a national figure.",
      "author": "Ernest Leogrande"
    },
    {
      "text": "It is intensely watchable, with the relentless accumulation of effects used here for the purposes of eliciting suspense rather than provoking comedy.",
      "author": "Peter Ackroyd"
    },
    {
      "text": "Raiders of the Lost Ark is my favorite movie. I don't have to tell you why it's great. You know why it's great. Instead, what follows is a list of very personal moments.",
      "author": "Alexander Huls"
    },
    {
      "text": "There is a charm and vitality to Raiders of the Ark, which Spielberg later admitted was \"the first movie where I actually shot the movie without thinking\".",
      "author": "Martin Chilton"
    },
    {
      "text": "Harrison Ford embodies the persona of Indiana Jones with perfection and paves him as an iconic hero.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "This film is a volcano of creative ideas in full eruption -- the modern high action adventure against which all others must now be measured.",
      "author": "Ralph Novak"
    },
    {
      "text": "Hold on tight, because it starts at full throttle and never lets up.",
      "author": "Alan Jones"
    },
    {
      "text": "Raiders finds the right balance between reverence and wit, and the sight of Ford outrunning that giant boulder thrills as much on the 14th viewing as the first.",
      "author": "Keith Phipps"
    },
    {
      "text": "Impossibly good.",
      "author": "Walter Chaw"
    },
    {
      "text": "As action adventure goes, it's about the best there is.",
      "author": "Derek Malcolm"
    },
    {
      "text": "Steven Spielberg's rollicking adventure yarn still looks buoyant and dashing after 30 years.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The first and finest Indiana Jones adventure.",
      "author": "Robbie Collin"
    },
    {
      "text": "The boulder has never looked bigger, the guns have never sounded louder and Indy's whip has never cracked sharper than they do here.",
      "author": "Neil Smith"
    },
    {
      "text": "If Lucas is Raiders' guts and Kasdan its head, then Spielberg is its beating heart. Little wonder Part IV is still on the cards.",
      "author": "Mark Dinning"
    },
    {
      "text": "Raiders is a classic and repeated viewings, especially when presented properly on the big screen, only reinforce this further.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "Breathtakingly efficient, immaculately constructed... This is the ne plus ultra of blockbuster filmmaking.",
      "author": "Tim Brayton"
    },
    {
      "text": "Raiders of the Lost Ark has it all -- or, anyway, more than enough to transport moviegoers back to the dazzling, thrill-sated matinee idyls of old.",
      "author": "Richard Schickel"
    },
    {
      "text": "It is the classic film [by] Lucas, Spielberg...back before they were replaced by automatons put here by aliens.",
      "author": "Widgett Walls"
    },
    {
      "text": "Indy's first adventure is a rip-roaring action masterpiece.",
      "author": "Randy White"
    },
    {
      "text": "The thrills are fully consumed while you're seeing this movie, and it's totally over when it's over. It's a workout. You feel as if you'd been to the desert digs: at the end your mind is blank, yet you're parched, you're puffing hard -- you want relief.",
      "author": "Pauline Kael"
    },
    {
      "text": "Justifiably one of the most indelible adventure films in cinematic history...",
      "author": "David Nusair"
    },
    {
      "text": "It's the perfect vacation-time movie: not a serious moment in its whole two hours but so crammed with laughter, thrills and cinematic sleight of hand that audiences will be sorry when it's over.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Lost Ark holds up for many reasons, not least of which is because of Spielberg's consummate skill as a visual storyteller and his ability to draw charged performances from his actors.",
      "author": "Jeremiah Kipp"
    },
    {
      "text": "The postmodern heir to North By Northwest...Like any deathless classic, Raiders is a perfect marriage of star and material.",
      "author": "Peter Canavese"
    },
    {
      "text": "...despite the fast pace, the movie is never frenetic or tiring, just pure, unadulterated fun throughout. (Blu-ray edition)",
      "author": "John J. Puccio"
    },
    {
      "text": "The most purely fun movie ever made.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "...lets us indulge in childish thrills without feeling silly about it.",
      "author": "Josh Larsen"
    },
    {
      "text": "Vastly entertaining, Spielberg's adventure herladed a new breed of Hollywood blockbuster (and event film), a tale that combines classic Hollywood story-telling, playful postmodern sensibility and spectacular stunts presented in rapid-fire pacing.",
      "author": "Emanuel Levy"
    },
    {
      "text": "Unrivalled entertainment.",
      "author": "Film4 Staff"
    },
    {
      "text": "With an unforgettable opening sequence in which our hero flees through a trap-filled tunnel from a great ball of rock, Raiders Of The Lost Ark is a film which wastes no time and never lets go of our attention.",
      "author": "Jennie Kermode"
    },
    {
      "text": "[Raiders of the Lost Ark is] a crackerjack fantasy-adventure that shapes its pulp sensibilities and cliff-hanging serial origins into an exhilarating escapist entertainment that will have broad-cased summer audiences in the palm of its hand.",
      "author": "Stephen Klain"
    },
    {
      "text": "One would think that a collaboration between Steven Spielberg and George Lucas would produce something better than this giggly pastiche of a Republic serial...",
      "author": "Dave Kehr"
    },
    {
      "text": "What follows is one breathtaking action sequence after another, each one surpassing the next in thrills.",
      "author": "Andy Kurtz"
    },
    {
      "text": "The picture is offering you a pact: you agree to be a kid again, in return for which Raiders will give you old-time movie thrills expressed in slick modern cinematic terms. No, thanks.",
      "author": "Stanley Kauffmann"
    },
    {
      "text": "New Hollywood moguls Spielberg and Lucas teamed up to create the first -- and best -- of their extremely popular plunderings of old adventure serials ... In retrospect, it also appears as a precise pop-culture inauguration of Reagan-era retro Americanism.",
      "author": "Thomas Delapa"
    },
    {
      "text": "Whether you swallow it or not, see it for a handful of totally unexpected visual jokes, worth the price of admission alone.",
      "author": "Rod McShane"
    },
    {
      "text": "Classic action set pieces, Harrison Ford at his swashbuckling best, Old Testament spirituality, and a satiric jab at Nazi anti-Semitism.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "This is the kind of movie that, even today, audiences immediately fall in love with. It has all the right ingredients: a smart script, a likable hero, a dash of romance, more than a touch of comedy, and a lot of fast-paced action.",
      "author": "James Berardinelli"
    },
    {
      "text": "Throughout the film, Spielberg evokes the kind of armchair-clutching action sequences that remind us why they're called motion pictures.",
      "author": "James Kendrick"
    },
    {
      "text": "You'd have to be a heathen to argue with the fact that Raiders of the Lost Ark stands as the best action-adventure movie ever made.",
      "author": "Christopher Null"
    },
    {
      "text": "Most viewers are powerless to resist the kinetic pleasures of this endlessly inventive action adventure.",
      "author": "TV Guide Staff"
    },
    {
      "text": "Imaginitive set pieces and a quick pace make this a wonderful debut for the series.",
      "author": "Dan Lybarger"
    },
    {
      "text": "The flavor of serials in superabundance, a rapid tempo announced in the introductory set-piece with a profusion of gags like the gargantuan marble run and the snake in the cockpit.",
      "author": "Fernando F. Croce"
    },
    {
      "text": "I have nothing against the film for what it is. I'm just not wild about what it is.",
      "author": "Ken Hanke"
    },
    {
      "text": "One of the best films -- if not THEE best film -- ever made!",
      "author": "Alex Sandell"
    },
    {
      "text": "My big complaint: Take Indiana Jones out of the story, and nothing changes. The Nazis still find the Ark, still open it, still die.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "Allows for a certain worldliness, cautiousness, and darkness in Indy's character. He's far from reckless or noble.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The film that enchanted a generation and made Ford an action hero.",
      "author": "Brian Mckay"
    },
    {
      "text": "The purpose of the exercise. If you can't love this film, you have no business loving movies at all.",
      "author": "Rob Vaux"
    },
    {
      "text": "Spielberg can never top this. Period.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "One of the all-time great films.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Raiders of the Lost Ark is a wonderful movie. The good news for exhibitors is that it's also one of those rollercoaster-like movies that people will be lining up for again and again.",
      "author": "Jimmy Summers"
    },
    {
      "text": "Spielberg's and Lucas's collaborative rip-roaring adventure story with a hero of epic proportions makes this film one of the best screen entertainments of 1981.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Watching Raiders of the Lost Ark again on the big screen I was again reminded how summer films were once thoroughly entertaining and fulfilling.",
      "author": "John A. Nesbit"
    },
    {
      "text": "Raiders Of The Lost Ark was the first in the Indiana Jones trilogy, and it can be argued that it changed the course of filmmaking for the better part of a decade.",
      "author": "Matt Easterbrook"
    },
    {
      "text": "Think of it as a high quality version of one of the old movie serials that kids used to get every Saturday at the theater before the double feature.",
      "author": "Steve Rhodes"
    },
    {
      "text": "Spielberg brings his signature blend of action/adventure and humor to the film, celebrating its 19th anniversary with this re-release.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Highly enjoyable globehopping adventure that will leave you feeling as breathless as hero Harrison Ford looks.",
      "author": "Liverpool Echo Staff"
    },
    {
      "text": "Astounding movie packed with non-stop action, stunts galore, an interesting story line, great one-liners, a solid cast, a catchy musical score, and all the fun and adventure that you could squeeze into a two-hour thrill ride.",
      "author": "JoBlo"
    },
    {
      "text": "Ford, in a career-minting performance, plays what would've been a cardboard cut-out in the 1930s as grubby, coy, impertinent, imperfect, phobic of snakes and agnostic (describing the Ark's magic as \"the power of God or something\").",
      "author": "Andrew Collins"
    },
    {
      "text": "This film was also not only the subject of my very first movie review, but also the reason why I started reading movie reviews in newspapers and paying attention what the critics actually think about movies.",
      "author": "Dragan Antulov"
    },
    {
      "text": "Raiders of the Lost Ark (1981) is the spectacular, cliff-hanger, breathlessly-paced, non-stop action/adventure film of the early 1980s. It was an immensely successful summer box-office hit. The film was conceived by producer George Lucas",
      "author": "Tim Dirks"
    },
    {
      "text": "It has the perfect blend of action, humor, and suspense. And Harrison Ford defined the action hero for the new decade.",
      "author": "Scott Nash"
    }
  ],
  "release_year": 1981,
  "duration": 115,
  "genres": [
    "Adventure",
    "Action"
  ],
  "age_rating": "PG",
  "synopsis": "Dr. Indiana Jones, a renowned archeologist and expert in the occult, is hired by the U.S. Government to find the ark of the covenant, which is believed to still hold the Ten Commandments. Unfortunately, Hitler's agents are also after the ark. Indy and his ex-flame Marion escape from various close scrapes in a quest that takes them from Nepal to Cairo.",
  "popularity": 9.6,
  "poster_url": "https://image.tmdb.org/t/p/original/ceG9VzoRAVGwivFU403Wc3AHRys.jpg"
}