{
  "movie_name": "Raya and the Last Dragon",
  "movie_id": "raya_and_the_last_dragon",
  "total_reviews": 304,
  "reviews": [
    {
      "text": "This animated visual treat feels bold and escapist.",
      "author": "Francesca Steele"
    },
    {
      "text": "Gorgeously animated with superb acting, RAYA AND THE LAST DRAGON suffers from a messy narrative that can’t decide what it wants to say.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Raya and the Last Dragon welcomes a reflection on its Asian-fusion design because western adaptations of Asian culture, even with visible and vocal creative Asian input, will come with a spectrum of orientalism…",
      "author": "Caroline Cao"
    },
    {
      "text": "The diversity is great, it's visually pleasing, the score is catchy, and the awesome characters turn this into a really likeable watch with a positive overall message.",
      "author": "Rebecca Johnson"
    },
    {
      "text": "A SPECTACLE, Beautiful, exhilarating, & A fantastic story that brought a tear to my eye! With a great message wrapped around its incredible action & characters, Raya has cemented itself as one of my new favorite DISNEY ANIMATED FILMS",
      "author": "Zach Pope"
    },
    {
      "text": "Boasting a predominantly Asian-American cast delivering exceptional voice work, Raya and the Last Dragon follows a partially disappointing, formulaic narrative but compensates it with stunning animation, a chill-inducing score, and quite a nice ending.",
      "author": "Manuel São Bento"
    },
    {
      "text": "A mess both in ideals and execution, the film fails to have the charm and poignance it presents and has to be seen as a rare failure for modern Disney animated features.",
      "author": "Carson Timar"
    },
    {
      "text": "Not a bad movie, but doesn't take any risks. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "A beautifully heart-swelling put a lump in your throat kind of family film that doesn’t come around too often.",
      "author": "M.N. Miller"
    },
    {
      "text": "Raya and the Last Dragon is a visually striking spectacle with equally effective emotional resonance and a lively lead – in short, another win for Walt Disney Animation Studios.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "Disney films are no stranger to heavy stuff, but this film really seemed willing to grapple with some more complicated ideas even if it doesn’t quite have the nerve to see it through to the end.",
      "author": "Chase Hutchinson"
    },
    {
      "text": "“Raya” has a story pulsating with urgency. It uses its fantastical setting, cultural inspirations, and enormous heart to encourage us to keep our faith in humanity, to trust one another, and to come together as a people.",
      "author": "Keith Garlington"
    },
    {
      "text": "The animation work is interesting, drawing on shadow puppetry, classical Asian figures and symbols, alongside thoroughly modern animation.",
      "author": "Cris Kennedy"
    },
    {
      "text": "The film has a message, but its biggest win is accomplishing old Walt Disney's trademark quote that prevailed in his work: 'For every laugh, there should be a tear...' and a kung fu kick. [Full review in Spanish]",
      "author": "Roger Salvans"
    },
    {
      "text": "RAYA AND THE LAST DRAGON creates a pretty adventure world and a nice, colorful group of heroes. Overall, however, the film is a bit too stuck in familiar patterns to really excite more.",
      "author": "Jimmy Cage"
    },
    {
      "text": "With stunning visuals, energetic and kinetic action sequences and an expansive world rich with lore and details, this was Disney's most exciting film in years.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "...a distressingly ineffective misfire thats rarely as engaging (or entertaining) as one mightve anticipated.",
      "author": "David Nusair"
    },
    {
      "text": "Raya and The Last Dragon hums along to a familiar rhythm, but its what it does in between these beats that makes it so entertaining.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Raya and the Last Dragon is an epic adventure that brings Disney to a new and exciting direction, all while taking advantage of their strongest assets.",
      "author": "Mat Brunet"
    },
    {
      "text": "It's a film with a clunky first half but finds more of a groove later in the second. Raya and the Last Dragon displays a cornucopia of amazing visuals, and the animators have created a lavish fantasy world inspired by Southeast Asian culture and folklore.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "The adventure of this new Disney princess is told with grace, simplicity and animation as fickle as water that makes me have a pretty pleasant time. Full review in Spanish",
      "author": "Yasser Medina"
    },
    {
      "text": "In the vast body of Disney's output, this is a minor effort, disappointingly so given the production's rather incredible artistry.",
      "author": "Brian Eggert"
    },
    {
      "text": "Raya and the Last Dragon is one such work, taking bits and pieces of Southeast Asian culture and lore, then infusing them into an organic whole with an inventive and creative story filled with fascinating details.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Never anything but captivating. A visual beauty and a new kick-ass princess for fans of Disney too.",
      "author": "Matt Hudson"
    },
    {
      "text": "While Disney has been getting slowly better about including a variety of characters and cultures, they are still stuck far in the past on creative storytelling. 'Raya' reads like an '80s-era video game.",
      "author": "Witney Seibold"
    },
    {
      "text": "It matters that, in a region with so much diversity, the movie itself depicts this diversity in its landscapes, the people that live in them, and the subcultures they live with.",
      "author": "Nicholas Oon"
    },
    {
      "text": "Highly enjoyed its message of teamwork & the importance of forgiveness & trust. I had plenty of fun, particularly with its side characters.",
      "author": "Rosa Parra"
    },
    {
      "text": "It's so similar to pretty much everything Disney has put out in the last decade that it feels awfully repetitive.",
      "author": "Kip Mooney"
    },
    {
      "text": "The motivations and agendas of the warring characters were nicely complex which is rare for an animated feature. Awkwafina does quite funny if anachronistically contemporary voice work as the dragon. Yet something about it felt soulless.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "Raya finds inspiration in all the right places, and imbues it with the emotional weight and bright, fantastic aesthetic we've come to expect with Disney's big-screen adventures.",
      "author": "Rick Marshall"
    },
    {
      "text": "\"Raya and the Last Dragon\" gives us a glimmer of hope and unity during this time of division.",
      "author": "Susan Kamyab"
    },
    {
      "text": "The story feels like more of a means to an end to show off some flashy animation rather than giving us anything to really care about.",
      "author": "Kent Garrison"
    },
    {
      "text": "...top drawer Disney, it's a thoughtful, nimble riposte to the brainless slug-fests that most family films descend into, and it's a self-aware, open-minded slice of world-building that should open the doors for a new franchise...",
      "author": "Eddie Harrison"
    },
    {
      "text": "You won't be able to take your eyes off of \"Raya and the Last Dragon' with the beautiful palette of colors that make this Disney film pop off screen. The storyline doesn't break ground but women as the heroes and villains make it all the more interesting.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "The great thing about this film is that Raya isn't your conventional Disney Princess.",
      "author": "Kathia Woods"
    },
    {
      "text": "The story, the dialogue, the voicework and animation are all of the highest caliber. Not only are the visuals imaginative and gorgeous but there are life lessons to be learned about trust and selflessness and taking chances.",
      "author": "Diane Pershing"
    },
    {
      "text": "Something amazing was created in spite of everything working against it, both mirroring and informing Raya's story, a plea for trust and an inclusive celebration of differences... emotional, entertaining, and powerful.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "\"The animation was beautiful, the storyline set in place, telling a tale of how traditions and cultures can work presently to unite us all.\"",
      "author": "Vincent Schilling"
    },
    {
      "text": "A triumph of design held back by a lackluster story...",
      "author": "Josh Larsen"
    },
    {
      "text": "Awkwafina makes the film worthwhile. Out of all the voice work in the film, including Benedict Wong and Gemma Chan, it's the comedian-actress that shines the most.",
      "author": "Dan Buffa"
    },
    {
      "text": "\"You'll enjoy yourself, even if you might find yourself asking for something more [from Raya].\"",
      "author": "Max Covill"
    },
    {
      "text": "In the fusion between animators and actors, can the keys to success be traced. [Full review in Spanish]",
      "author": "José Amador Pérez Andújar"
    },
    {
      "text": "The Disney paradigm is hard at play again here, its familiarity offset by its inspiration in Southeast Asian culture and mythology. Sweepingly told, gorgeously animated, and audaciously optimistic.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "While Raya and the Last Dragon may not have the staying power of past Disney princess films, it does offer beautiful scenery and a chance to point out to children the truths of Proverbs.",
      "author": "Megan Basham"
    },
    {
      "text": "In its more fantastical moments ... [it] hits the same flights of fancy as Studio Ghibli, but its separate elements never quite combine in the right way to make it a true Disney gem.",
      "author": "Tori Brazier"
    },
    {
      "text": "I may be more forgiving of a few missteps due to the limited large-scale cinematic experiences allowed by this last year, but \"Raya and the Last Dragon\" was a delight.",
      "author": "Brad Keefe"
    },
    {
      "text": "As an overall throwback, and as a return to the streamlined storytelling upon which Disney built its supremacy, Raya and the Last Dragon is a welcome expansion of the Disney universe.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Disney princesses ain't what they used to be, which is a good thing.",
      "author": "Matt Neal"
    },
    {
      "text": "It is more interested in appealing to today's kids than transporting us all to another place and time. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Raya is a great film that teaches lessons such as friendship, trust, and the importance of hope.",
      "author": "Monique Jones"
    },
    {
      "text": "Filled to the brim with an excellent Asian-American voice cast, you're guaranteed to feel all the feels, especially as we gallop towards an end that delivers a colourful burst of heartfelt cries of unity.",
      "author": "Zehra Phelan"
    },
    {
      "text": "Even if the ground splinters underfoot during a cluttered climax, a Disney-grade message of unity against division firmly anchors the stirring aftermath.",
      "author": "Kevin Harley"
    },
    {
      "text": "Filled with cool Tik-Tok dialogue and social media-approved political messaging.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "The real-life parallels woven into the high fantasy couldn't ring louder or truer.",
      "author": "Don Shanahan"
    },
    {
      "text": "My thanks to Disney for continuing to write strong female characters that are no longer waiting for a Prince to save them. Nope, they are the ones saving the world.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "It's impossible to not be stunned by the beauty of the different scenes that Raya travels [to]. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "It's pure formula, but on the whole, it's a reasonably diverting family-friendly showcase for Disney's characteristic blend of humor, heart and artistry.",
      "author": "Mike Scott"
    },
    {
      "text": "Certainly pitched well within the Disney formula - a princess-based tale of heroism - but it's also a monster step up in epic scale and action spectacle.",
      "author": "Tom Beasley"
    },
    {
      "text": "Creating a better world is not a solo venture; it takes a village. Raya and the Last Dragon is freshly inclusive, lush and adventurous.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Raya isn't groundbreaking; she's even better. Raya is the new norm.",
      "author": "Lindsey McGinnis"
    },
    {
      "text": "[I]ts tale of a young woman (voiced by Kelly Marie Tran) going on a quest is blandly formulaic, although the action scenes are lively.",
      "author": "Edward Porter"
    },
    {
      "text": "Raya's storyline is beat-for-beat, a traditional Disney story, but its nuances are what make it stand out.",
      "author": "Yasmin Kleinbart"
    },
    {
      "text": "Unlike Disney's dreary live-action update of Mulan, the studio's latest animation epic Raya and the Last Dragon makes a virtue of its female-fronted cast of characters...",
      "author": "Alistair Harkness"
    },
    {
      "text": "It's simplistic in its depiction of \"heroes\" and \"villains\" to the point where it feels more like a cheap Saturday morning cartoon than a rich animated feature.",
      "author": "Matthew Toomey"
    },
    {
      "text": "...merely serviceable...",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "The combination of action, drama, sentimentality and wackiness isn't always smooth, but the film looks so good, and the characters are so vivid, that it's easy to enjoy the ride.",
      "author": "Rich Cline"
    },
    {
      "text": "Albeit messy, Raya is a wonderment, most notably in its quieter observed moments that touch on grief, determination and companionship.",
      "author": "Allyson Johnson"
    },
    {
      "text": "\"Raya and the Last Dragon\" has the laughs and tear-jerker moments we've come to expect and love but tries for more and succeeds on a supremely fun scale.",
      "author": "Alci Rengifo"
    },
    {
      "text": "A compelling enough story with well crafted, conceived and staged action sequences. Thematically, reminiscent of 'Star Trek' in that it's about a kind of future you want to believe in.",
      "author": "Peter Canavese"
    },
    {
      "text": "A fun and epic adventure full of magic that's effective thanks to its dazzling animation and its powerful and touching message. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Raya and the Last Dragon might be conventional in its storytelling, but the stunning animation, lovely characters, beautiful music, and heartfelt messages won me over in the end.",
      "author": "Kevin L. Lee"
    },
    {
      "text": "Raya and The Last Dragon provide spectacular performances from Kelly Marie Tran and Awkwafina, but will encourage conversations about trust, forgiveness, courage and fear,. Global leaders could take notes form this animated lesson for sure",
      "author": "Carla Renata"
    },
    {
      "text": "It proves to be a joyful fantasy adventure.",
      "author": "Shawn Edwards"
    },
    {
      "text": "The message is that you have to put aside differences and learn to trust and find common ground. It feels like it's hitting the right notes, with spectacular visuals.",
      "author": "Mark Kermode"
    },
    {
      "text": "The movie's trust-your-enemies theme is so insipid I'm surprised Woodrow Wilson isn't credited as one of the writers, although just about everybody else is (it took eight people to come up with this sludgy story).",
      "author": "Kyle Smith"
    },
    {
      "text": "There's a darkness here that I think is lacking in a lot of modern Disney films, and I respect that its message isn't just \"believe in yourself.\"",
      "author": "Amy Nicholson"
    },
    {
      "text": "It has a lot of great and touching moments, wonderful animation and some great performances, but it's derivative as can be... When it's not working, it is exasperating. But when it gets back on track, it's very rewarding.",
      "author": "Wade Major"
    },
    {
      "text": "It stumbles on and on and on with a lot of things you've seen before... It struck me more as a corporate product than a story that someone really wanted to tell.",
      "author": "Charles Solomon"
    },
    {
      "text": "Disney's animators once again create a stunning, detailed world of magical creatures and engaging characters.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "With Awkwafina taking on the role of the 'last dragon,' this sweet and sour mix of Mulan, Lassie and Avengers finds a wackiness that lets it float over the sea of cliche that washes over the screen from the first few computer-generated frames.",
      "author": "Katherine Monk"
    },
    {
      "text": "This is a hopeful adventure, accompanied by absolutely beautiful visual power, bursting with splendid animated style and colourful absorbing spirit.",
      "author": "Jack Bottomley"
    },
    {
      "text": "Seeing it on screen cracked something in me that needed cracking, especially after this last year. I hope it does the same for you.",
      "author": "Molly Templeton"
    },
    {
      "text": "Moments into the film we are reminded of Disney's consistent ability to produce stellar animation...",
      "author": "Michael Ward"
    },
    {
      "text": "\"Raya and the Last Dragon,\" is so affecting and candid about failure and the faith required for second chances that you could be forgiven for forgetting that it's a movie about a girl attempting to save her mystical realm by locating a dragon.",
      "author": "Blake Howard"
    },
    {
      "text": "The latest feature from Walt Disney Studios Animation is a rousing quest picture, somehow riffing on both Avengers: Endgame and Mulan...",
      "author": "Norman Wilner"
    },
    {
      "text": "I left the cinema thinking that the world is not quite like it is at the end of this movie, but we might all be happier if it was.",
      "author": "Stephen Romei"
    },
    {
      "text": "Awkwafina leads a lively voice cast in a visually arresting adventure.",
      "author": "Richard Roeper"
    },
    {
      "text": "Raya and the Last Dragon boasts an all-Asian cast, breathtaking visuals, and a beloved Star Wars icon at its center.",
      "author": "Melissa Leon"
    },
    {
      "text": "It is a complete package with something for everyone. It's a spirited fantasy adventure for the children, an inspiring young warrior princess, who defines women empowerment and a universally binding emotional fabric.",
      "author": "Ronak Kotecha"
    },
    {
      "text": "Raya and the Last Dragon is fun, it's action-packed, it's visually stunning, and it has a beautiful message of trust and community.",
      "author": "Kristen Maldonado"
    },
    {
      "text": "The film draws you into its exciting spell, as well as its heroine, from the beginning. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Kelly Marie Tran brought a strong heroine to life so wonderfully as a multi-layered character. There is something universal about Raya and her purposeful journey that should appeal to anyone of all ages, regardless of ethnicity and background.",
      "author": "Ruth Maramis"
    },
    {
      "text": "The animation in this film is exquisite, using light and vivid colors to create an almost photo-like quality. Plus, it delivers a message of trust and cooperation that resonates today.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "This is easily Disney's most adult movie since its first renaissance, often evoking the bleaker spirit of Mulan and The Hunchback of Notre Dame...",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Raya works so well because of its success in the world-building department ... We are transported on a quest of mythical proportions, one that moves quickly, but still allows us plenty of moments to soak in the message and appreciate the details.",
      "author": "Candice McMillan"
    },
    {
      "text": "There is an incandescence and a buoyancy to the animation that elevates the formula.",
      "author": "Simran Hans"
    },
    {
      "text": "The movie crosses the finish line on the strength of its cast, style and music; you won't have a bad time.",
      "author": "Sean Collier"
    },
    {
      "text": "Raya and the Last Dragon is watchable and surrounded in rich traditions and intriguing folklore, but mediocre in its execution...",
      "author": "Chris Sawin"
    },
    {
      "text": "It's a fun, if slightly derivative, fantasy story with gorgeous animation.",
      "author": "Josh Bell"
    },
    {
      "text": "Raya and the Last Dragon is a truly stunning piece of animation.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Raya and the Last Dragon reminds us how memories of those we've lost still strengthen and guide us in times of need.",
      "author": "Victor Stiff"
    },
    {
      "text": "\"Raya and the Last Dragon\" is another gem in the Disney canon.",
      "author": "Russ Simmons"
    },
    {
      "text": "With the always funny Awkwafina offering her rock-solid vocal accompaniment, Sisu becomes the genuine scene-stealing star of this pretty piece.",
      "author": "John Urbancich"
    },
    {
      "text": "It more than qualifies itself as a new Disney masterpiece, a surprisingly mature exploration of grief and loss that's also a total sensory experience.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "The vocal characterizations courtesy of Awkwafina and Tran lend so much skillfully wrought feeling to the material, the movie's occasional bumps don't much matter.",
      "author": "Michael Phillips"
    },
    {
      "text": "The most acutely neither-here-nor-there, going-through-the-motions mediocrity that [Disney is] capable of... it is, at least, sublimely gorgeous.",
      "author": "Tim Brayton"
    },
    {
      "text": "The sparky characters, slick animation and breezy (and entirely bloodless) fight scenes transport us to a beautifully realised fantasy realm.",
      "author": "Andy Lea"
    },
    {
      "text": "\"Raya and the Last Dragon\" is Disney through-and-through.",
      "author": "Adam Graham"
    },
    {
      "text": "Kumandra is coloured with the arts, myths and cultures of various Southeast Asian countries. But it's a love letter to the region more interested in summarising them through a Hollywood lens, rather than depicting an authentic version of any one country.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Such sorrowful yearning dominates, even obscuring the colorful, dangerous, and always stunningly beautiful world.",
      "author": "Andrea Thompson"
    },
    {
      "text": "It is street food, dressed up restaurant-style. It is cleaner and less likely to cause offence, but it is no longer street food.",
      "author": "John Lui"
    },
    {
      "text": "Raya and the Last Dragon is full of fun action, humor, and creativity that's unlike anything Disney has produced up until now.",
      "author": "Abby Olcese"
    },
    {
      "text": "This beautifully drawn feature film has strong storytelling and delightful characters that are as detailed as the exquisite animation. It's a film that will play well to children and adults alike.",
      "author": "Micheal Compton"
    },
    {
      "text": "Raya and the Last Dragon proved that it was more than just an adventure film by being able to bring weighty themes and fun action beats together in a fun way.",
      "author": "Terence Johnson"
    },
    {
      "text": "Raya herself is a wonderful protagonist, easily one of my favorite Disney princesses by a mile... By the time I was near the end, however, the film's innumerable borrowed tropes really began to get to me.",
      "author": "Aja Romano"
    },
    {
      "text": "It's also the best kind of feminist film in that it's one that doesn't clobber you with the message. Raya is allowed to be awesome without the script shouting about it all the time and it's better for it.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "Like Sisu, Raya and the Last Dragon's heart is absolutely in the right place, even if that's one of the few perfect parts. It could have been great. Instead, it's fine.",
      "author": "Richard Whittaker"
    },
    {
      "text": "'Raya and the Last Dragon' borrows from Disney's vast universe, applies it well.",
      "author": "Preston Barta"
    },
    {
      "text": "Forgettable and frustrating, despite its beauty and charms.",
      "author": "Evan Dossey"
    },
    {
      "text": "The animation is gorgeous... It's got a great story... It's something the whole family can enjoy.",
      "author": "Kevin Carr"
    },
    {
      "text": "The dialogue has more to do with 2021 than any mythical past, but Raya emerges as a visually imaginative and involving piece of animated entertainment.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Raya and the Last Dragon isn't great because it's a glittery story of female empowerment that shows young girls that they can grow up to be heroes, too. It's great simply because it never expected them to be anything else.",
      "author": "Jeva Lange"
    },
    {
      "text": "The deeper message, however, involves the toll that division and distrust inflicts on a mythical kingdom, which gives the otherwise pretty-good movie a rather timely hook.",
      "author": "Brian Lowry"
    },
    {
      "text": "The whole film is gorgeous to revel in with how they brought a fantasy world to life while honoring Asian culture and tradition.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Raya and the Last Dragon\" is a lot of fun -- it is visually impressive, viscerally exciting (the action sequences are genuinely thrilling), often quite funny and even genuinely moving at certain points.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Inconsistent, but the good moments are incredibly good moments.",
      "author": "Doug Walker"
    },
    {
      "text": "\"Raya\" is a good film with a few holes that ultimately gets by on the strength of its grand finale.",
      "author": "Courtney Lanning"
    },
    {
      "text": "The absolute strength of Raya and the Last Dragon comes from gorgeous, lush animation that Walt Disney Studios' animators have conjured to fill the screen.",
      "author": "George M. Thomas"
    },
    {
      "text": "There are some pretty fantastic battle sequences, however, with the (virtual) camera roving around in a way I can't remember seeing in an animated movie.",
      "author": "Chris Knight"
    },
    {
      "text": "A magnificent achievement in animated entertainment, one of the best of the recent slate of Disney films",
      "author": "Damond Fudge"
    },
    {
      "text": "This is a thoughtful film, and an exciting one.",
      "author": "John Serba"
    },
    {
      "text": "The talented voice cast brings this mystical journey to life in true Disney fashion...",
      "author": "Kevin Brackett"
    },
    {
      "text": "This rousing saga of bravery and determination provides a winning mix of familiar elements while conveying a timely social message of putting aside grudges and petty ideological differences for the greater good.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "In this case, I'll take an argument about how a story should be told over no story at all. Hopefully, it opens up room for more stories to surface.",
      "author": "Justine Calma"
    },
    {
      "text": "Because this is a Disney animated film, the visuals and the story are top-notch. Is it a completely perfect movie? No ... Any of the movie's minor flaws are far outweighed by this captivating story that is sure to inspire repeat viewings.",
      "author": "Carla Hay"
    },
    {
      "text": "Timely and timeless like the best of them, \"Raya and the Last Dragon\" is another animated classic from Disney. (Full Content Review for Parents - Violence, Scary Scenes, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Gorgeous, and enormously refreshing.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Raya and the Last Dragon is a magnificent feast for the eyes, with a heartwarming message that is much needed for these trying times.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "A charming animated quest that goes more or less exactly where we'd expect.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "A grand family movie about love, hope and trust.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Mostly successful, with standout animation, outstanding world building, and engaging characters. It's not a Disney classic by any means, but it works.",
      "author": "Stephen Silver"
    },
    {
      "text": "As full of action and derring-do as the movie is, the film's message is less about conflict and more about conflict resolution, with a refreshingly contemporary focus on female friendships.",
      "author": "Rob Thomas"
    },
    {
      "text": "It isn't quite the top tier of Disney, but it's a fascinating character study, a thrilling adventure, and a feast for the eyes.",
      "author": "Jeff York"
    },
    {
      "text": "The elements are present, but the cohesion is not.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Raya's only downside is Disney's self-imposed limitations.",
      "author": "Emily Wheeler"
    },
    {
      "text": "Get off Twitter and write a better movie.",
      "author": "Ian Simmons"
    },
    {
      "text": "The sisters are doing it for themselves and one of them is a dragon in a wild, animated wonder ride from Disney that radiates female empowerment and comes at you in a whoosh of creative ideas in full eruption.",
      "author": "Peter Travers"
    },
    {
      "text": "The only way out of this plague is for brave folks to cross partisan lines and establish trust in their perceived enemies. Plenty of decent Americans share the dream of Raya's father, bringing harmony back to our warring factions to reunite as Kumandra.",
      "author": "Jason Fraley"
    },
    {
      "text": "It's her flawed nature that makes Raya the most compelling, most sympathetic and most layered Disney princess in the company's long history - and what makes Raya and the Last Dragon the best Disney animated feature in many years.",
      "author": "Glen Weldon"
    },
    {
      "text": "\"Raya and the Last Dragon\" could have been a new Disney classic-in-the-making if not for the movie's lack of originality and decision of playing safe with the formula.",
      "author": "Casey Chong"
    },
    {
      "text": "The animation is both gorgeous and flawless, the characters are perfectly designed, the story barrels through memorable locations like the best fantasy tourism video you could ask for and the action is always thrilling to watch",
      "author": "Anthony Morris"
    },
    {
      "text": "Judging something based on its most obvious traits is ill-advised within this touching tale, and when it comes to the film as a whole as well.",
      "author": "Sarah Ward"
    },
    {
      "text": "A remarkably poignant and exquisitely animated adventure that delivers the thought of something foreign to all of us lately: hope.",
      "author": "Rendy Jones"
    },
    {
      "text": "Everything to love about great animation ... spectacular scenery, memorable characters & a heart-filled lesson about empathy and unity ... oh yes, and kid-hilarious fart jokes.",
      "author": "Patrick McDonald"
    },
    {
      "text": "Though there is ... an excessive amount of exposition, this Disney movie delivers stunning visuals and a rich narrative, guaranteeing unforgettable entertainment for all.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "The real star is the stunning animation especially with the five distinct lands. The combination of simple story with dazzling visuals results in a movie designed to entertain one and all.",
      "author": "Rick Bentley"
    },
    {
      "text": "Movies of this caliber don't come often, but when they do, cinema is made better because of it.",
      "author": "Allen Almachar"
    },
    {
      "text": "There's an admirable complexity to this story's characters and politics, meaning it works as a smart and surprisingly affecting fable...",
      "author": "Mark Dujsik"
    },
    {
      "text": "I have to say that if the film falls short of my expectations, it's still a unique piece of work that's easily the best thing to take the kids to if you're craving a night out at the movies.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Trust, redemption, and hope are at the center of Raya, which powerfully reminds us of the danger of living in a broken world.",
      "author": "Charles Koplinski"
    },
    {
      "text": "A story about the importance of trust that spends nearly all its running time establishing that trust is for chumps... It's about redemption without work and reconciliation without reckoning.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Raya and the Last Dragon transcends formulaic storytelling with its heart and eye-popping visuals.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Raya and the Last Dragon has the type of story to make it fit right in with other Disney classics, but it will be interesting to see what the reception is from members of the Asian community at large.",
      "author": "Alex Bentley"
    },
    {
      "text": "Disney's CGI work, independent from Pixar, has finally found consistency, and \"Raya\" joins \"Frozen,\" \"Zootopia\" and \"Moana\" on their roster of high-quality, enjoyable films.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "What we have here is really a by-the-book hero's journey-but it's the interplay between the warrior and the wiseacre that makes a stock storyline snap, crackle and pop",
      "author": "David Fear"
    },
    {
      "text": "I was always going to be a complete and total patsy for this movie since it combines a lot of things I like such as fantasy and Asian mythology.",
      "author": "Edward Douglas"
    },
    {
      "text": "One is left with a mixture of admiration for the film's astonishing visual achievement and regret that it hasn't been matched by equally imaginative narrative choices...it feels more studiously manufactured than genuinely magical.",
      "author": "Frank Swietek"
    },
    {
      "text": "The film highlights the best of Disney Animation Studios with gorgeously detailed visuals, an engaging story, and characters that connect on an emotional level.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "One of those really good films that will probably be viewed even more favorably upon repeated viewing.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "This beautiful blend of traditional Disney adventure and almost shockingly timely themes makes this animated adventure terrific and vital entertainment.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Raya and the Last Dragon is chock full of martial arts combat, swashbuckling sword duels, and a mischievous con baby that nearly steals the show. The well-written plot teaches valuable lessons about trust, friendship, and the divisive nature of tribalism.",
      "author": "Julian Roman"
    },
    {
      "text": "[The dragon] is funny character, who does not get to be the Genie, but isn't silly like Mushu. Still, as a dragon, I'll stick with Toothless. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Even for a studio that is decidedly dependable in terms of plot and narrative, Raya and the Last Dragon still feels like an effort that is noticeably of a kind.",
      "author": "Matt Oakes"
    },
    {
      "text": "Nothing is especially original in \"Raya and the Last Dragon,\" but in a way, everything is.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Raya and the Last Dragon does a great job of balancing the classic Disney formula while pushing it forward.",
      "author": "Tom Santilli"
    },
    {
      "text": "Raya and the Last Dragon is a reminder of the things that Disney has always been capable of doing so well at its heights, a marvel of character design, world-building, and canny choices.",
      "author": "Alison Willmore"
    },
    {
      "text": "[Raya and the Last Dragon] is the sort of awe-inspiring adventure that captures both the imagination and the heart.",
      "author": "Steve Katz"
    },
    {
      "text": "...the amount of healing and offering of redemption and atonement contained here is exactly the kind of story we all need to open ourselves up to.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "You will watch the last 30 minutes of the movie on the verge of tears.",
      "author": "Kevin Maher"
    },
    {
      "text": "Call it an act of repentance on Disney's part for throwing Kelly Marie Tran under the bus, or call it another excuse for Alan Tudyk to make animal noises for a couple of hours in exchange of equity, but Raya is a step in the right direction.",
      "author": "Rohan Naahar"
    },
    {
      "text": "\"Disney princess\" may eventually just become another word for \"superhero,\" but at least she won't need saving.",
      "author": "Beatrice Loayza"
    },
    {
      "text": "Raya and the Last Dragon is meant for kids, so the main character's journey isn't overly complicated, but it does contain poignant, joyful messages of the importance of togetherness and trust.",
      "author": "Richard Crouse"
    },
    {
      "text": "Disney taps into the rich YA market with this action-packed Southeast Asian adventure that is one of their very best animated features.",
      "author": "Randy Myers"
    },
    {
      "text": "Raya and the Last Dragon should entertain children but adults may fidget from time-to-time and the overall impression is of something that, like many middling Disney titles, will quickly be forgotten.",
      "author": "James Berardinelli"
    },
    {
      "text": "[Ever] timelier in a world where isolationism is the new normal, where people make little effort to understand each other, and nearly every country seems to be practising an \"us first\" policy.",
      "author": "Akhil Arora"
    },
    {
      "text": "Raya and the Last Dragon is a wonderland of visually engaging scenery, with some impressive action and memorable characters to boot.",
      "author": "Jon Negroni"
    },
    {
      "text": "Kelly Marie Tran and Awkwafina make a delightful and dynamic duo.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Raya and the Last Dragon is a lot like Sisu herself; warmly approachable, slightly off-putting, eager to please, beautifully majestic, enjoyably vibrant and honest at heart. It is a boisterously entertaining fantasy adventure for the whole family.",
      "author": "Harris Dang"
    },
    {
      "text": "With its visual majesty, rollicking pace and winning voice performances from Kelly Marie Tran and Awkwafina, Raya and the Last Dragon is another feather in Disney's cap.",
      "author": "Wenlei Ma"
    },
    {
      "text": "It's pretty obvious to anybody who's paying attention that Disney will soon engulf what's left of the entertainment industry before taking over the entire world. And that is perfectly fine so long as it keeps making films like Raya and the Last Dragon.",
      "author": "Jim Schembri"
    },
    {
      "text": "Although borrowing from superior stories, Raya mixes the ingredients for its own recipe for a fantastic action adventure that I loved from start to finish. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "My heart was touched, and all I wanted to do when this picture came to an end was watch it again from the beginning.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Part delightful romp fueled by Awkwafina's spot-on delivery and part riveting adventure with beautifully captured fight sequences with a strong core focused on the power of unity.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "The tone is a lot lighter than in Mulan or Frozen and the design has great ingenuity, as well as being remarkably beautiful. It's fun but predictable.",
      "author": "Sandra Hall"
    },
    {
      "text": "Young-teen girls will devour it, and that certainly is a good thing because, like many female-empowerment stories, this one has a strong message of hope as all semblance of humanity seems to be falling by the wayside.",
      "author": "Pete Hammond"
    },
    {
      "text": "Raya's story may not be much, but in the end the characters make it worthwhile.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "The wisdom of [the film] is that it doesn't lean in too hard on its most familiar elements, allowing its more unique thematic terrain and smartly textured worldbuilding to hold the spotlight.",
      "author": "Chris Feil"
    },
    {
      "text": "Disney's gorgeously animated, entertainingly told fantasia \"Raya and the Last Dragon\" is a visual feast.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "Echoing films such a Moana, Lord of the Rings and How To Train Your Dragon, Disney's latest replaces epic songs for more action and adventure in this entertaining film that touches on trust, family and teamwork. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Exhilarating from an action perspective... I found myself moved a lot over the course of this story.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Raya and the Last Dragon is a gorgeous piece of modern animation from the studio that still does it better than anyone.",
      "author": "Joshua Starnes"
    },
    {
      "text": "The film is a lot of fun, yet its rich and heart-warming themes go pretty deep for a \"kiddie flick\".",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "A brilliantly animated odyssey across fantasy lands, with rich color and exact detail, giving family audiences a proper odyssey with an important message of hope in our increasingly divided world.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A rollicking adventure filled with colourful characters, exciting action sequences, a fabulous heroine and a timely message for us all.",
      "author": "James Croot"
    },
    {
      "text": "A medium-good entry in the Disney animation tradition, filled with bright colors, zippy martial arts action and a touch of tragedy.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "Funny and heart-warming, Raya and the Last Dragon is a must-see for the family ... it might just inject a bit of magic back into life.",
      "author": "Therese Lacson"
    },
    {
      "text": "This Raya and the Last Dragon review is kind of harping on the subversion of tropes, but it is truly unlike many Disney or animated movies.",
      "author": "Shah Shahid"
    },
    {
      "text": "'Raya and the Last Dragon' is an entertaining lesson about hope, healing and redemption. It is also a fable about leaning on others for help and again seeing the best in people.",
      "author": "Bob Bloom"
    },
    {
      "text": "From its amazing animation and visual effects, its universal themes of friendship, family values and trust, and its sweeping cinematography, RAYA AND THE LAST DRAGON is a marvel to behold.",
      "author": "David Kaplan"
    },
    {
      "text": "Feels fresh not just for the mere fact of its female-forward and predominately Asian cast, but for the breeziness with which it bears the weight of Disney history...",
      "author": "Leah Greenblatt"
    },
    {
      "text": "Raya and the Last Dragon would have made a bundle if it had opened traditionally last year. Now, it'll be on Disney+ and will bring in its own huge numbers there.",
      "author": "Joey Magidson"
    },
    {
      "text": "The film is an action-adventure tale. And a pretty good one. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "Raya and the Last Dragon is a beautifully animated, action-packed hero's journey, and a great next evolution of Disney's modern-day princess films.",
      "author": "Nicole Clark"
    },
    {
      "text": "A gorgeously animated fairy tale with thrilling action, irresistible characters, a heartwarming message, and Disney's magic touch to lift the hearts of all ages.",
      "author": "Nell Minow"
    },
    {
      "text": "[I]t offers Southeast Asian audiences a chance to see themselves on the screen - though without the specificity they may prefer.",
      "author": "Clint Worthington"
    },
    {
      "text": "Raya is a charming, captivating tale ... Its themes of championing hope and unity over fear and dissension may seem simplistic, but strong, well-defined characters ensure that the the message is no less powerfully delivered.",
      "author": "Mark Cassidy"
    },
    {
      "text": "While 'Raya and The Last Dragon' might be a little too familiar, there's a good intent behind it. The art styles and the diverse voice cast give representation to characters, voices, and places that have been absent from animated movies until now.",
      "author": "Brian Lloyd"
    },
    {
      "text": "A charming, sweet-natured YA-leaning adventure that acts as proof that Disney needs to focus on moving forward rather than continuing to look back.",
      "author": "Benjamin Lee"
    },
    {
      "text": "Sure to be an instant animated classic... it expertly balances emotion, humor and social politics amid a backdrop of surreal, eye-popping visual beauty.",
      "author": "G. Allen Johnson"
    },
    {
      "text": "Raya and the Last Dragon sits at my top third tier of Disney animated features. It has excellent replay value, fun, marketable characters, and it's downright fun.",
      "author": "Alan Ng"
    },
    {
      "text": "With gorgeous animation, every inch filled with vibrant colors, rich texture, and a vast array of characters, Raya and the Last Dragon is an adventure with a great spirit.",
      "author": "Leo Brady"
    },
    {
      "text": "Disney's message of unity, inclusion, harmony, and most importantly trust, hits its mark.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Disney has made a stunning animated film loaded with adventure and heart for the whole family.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Rewatchable adventure films like this - animated or otherwise - are hard to find. You want to go on this journey over and over again.",
      "author": "EJ Moreno"
    },
    {
      "text": "Awkwafina gives the most energetically creative animation performance in a Disney movie since Robin Williams played the genie in \"Aladdin.\"",
      "author": "Sean P. Means"
    },
    {
      "text": "Raya and the Last Dragon embodies a potent marriage between its world-building and performances, but its use of Southeast Asian culture to craft its universe isn't flawless.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "Raya and the Last Dragon is a beautifully animated fantasy/action epic full of exciting adventure & entertaining world-building.",
      "author": "Nicola Austin"
    },
    {
      "text": "Raya and the Last Dragon's lovely visuals, action and humor keep the story moving along at an entertaining clip while the relatable plot and moving climax should make the movie an agreeable diversion for both kids and their parents.",
      "author": "Cynthia Vinney"
    },
    {
      "text": "Raya and the Last Dragon is not just a wonderful animated film - it is a voyage I can place myself and my heart in to the fullest extent.",
      "author": "Nguyên Lê"
    },
    {
      "text": "It seems to be the heartfelt and enchanting tonic audiences need after a long, mostly miserable 2020.",
      "author": "Grant Watson"
    },
    {
      "text": "Raya and the Last Dragon is a thrilling action-packed adventure that will entertain all ages.",
      "author": "Courtney Small"
    },
    {
      "text": "Raya and the Last Dragon shows that Disney is taking steps to highlight representation in its features...its compelling heroine and gorgeous visuals will win audiences over.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Raya and the Last Dragon has a message as profound and powerful as Frozen.",
      "author": "Fred Topel"
    },
    {
      "text": "Time will go on and technologies and processes will continue to evolve, but it's hard to fathom how future animated films will look better than this one.",
      "author": "Mark Meszoros"
    },
    {
      "text": "Raya has a live-action sensibility about it as it leans heavily into the adventure genre over more traditional family friendly fare.",
      "author": "Peter Gray"
    },
    {
      "text": "A true epic Disney Action-Adventure, cut straight from the mould of Renaissance-era favourites. With dazzling, breathtaking animation and an incredible cast of eclectic characters, Raya is an instant Disney classic!",
      "author": "Dave Lee"
    },
    {
      "text": "An animated feature with a positive, sincere message, lively action scenes, and a sweet tale of friendship that can be enjoyed by the entire family.",
      "author": "Louisa Moore"
    },
    {
      "text": "With all the hallmarks of classic Disney animation, it's a dazzling, entertaining delight that gifts the world a courageous new Disney heroine for the ages.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Accidentally or not, this lavish animated production resonates with the collective grief of the world it's being released into, inviting everyone to sit with that pain, even as it hints at brighter days to come.",
      "author": "Danette Chavez"
    },
    {
      "text": "Raya's chords of loss and melancholy blend well with its more fanciful elements, all given vibrant body in achingly gorgeous animation.",
      "author": "Richard Lawson"
    },
    {
      "text": "Most importantly, it serves as a fine balm for parents who have seen Frozen and Moana 200 times and need something new to throw into the rotation.",
      "author": "Kyle Pinion"
    },
    {
      "text": "A giant and splashy animated splendor that only Disney knows how to manufacture, \"Raya and the Last Dragon\" fires on all cylinders despite some convoluted missteps.",
      "author": "Nate Adams"
    },
    {
      "text": "Daring to base an entire animated feature around trust is a gutsy move that proves to be rewarding. The story is told effectively with imagination, an important theme, and artistic splendor",
      "author": "Robert Kojder"
    },
    {
      "text": "Though the animation is exceptional, the visuals alone aren't enough to save a project from such colossal storytelling mediocrity.",
      "author": "Mike Massie"
    },
    {
      "text": "It's Amazing! One of Walt Disney Animations Best, from score, animation, choreographed action, the message, and talented voice cast, it hits every note.",
      "author": "Samuel Leggett Jr."
    },
    {
      "text": "A sweeping fantasy epic for the whole family. I went in with high expectations, and the movie delivered on almost all of them.",
      "author": "Sean Chandler"
    },
    {
      "text": "...a rousing adventure featuring a most untypical dragon...The Southeast Asian inspired mythical land of Kumandra...is stunningly realized with such wonders as rolling dunes and a strikingly abstract red maple forest.",
      "author": "Laura Clifford"
    },
    {
      "text": "Offers plenty of sword-swinging, high-flying dragon action that the entire household can enjoy for as long as they want.",
      "author": "Travis Hopson"
    },
    {
      "text": "This movie had me laughing, crying, cheering all in a span of its 114-minute run. Even now, I get emotional just thinking about this movie, its message, and its impact.",
      "author": "Josephine L."
    },
    {
      "text": "Raya and the Last Dragon is the most exciting Disney Princess story since the animated Mulan.",
      "author": "Kayti Burt"
    },
    {
      "text": "Disney's latest is, in many ways, a film that fits the mold of what's come before, but Raya and the Last Dragon is also an overdue step in a new direction.",
      "author": "Rob Hunter"
    },
    {
      "text": "A gorgeous piece of work that features elaborate and ambitious world-building, stunning visuals and an A-team of impressive voice actors. It's a film with plenty of plot and character plates to spin, but the results are both impressive and exciting.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Visually dazzling and surface-level entertaining, but also formulaic to a fault, sometimes playing like a rival studio mimicking the post-PRINCESS AND THE FROG Disney formula.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Stunning. Kill Bill meets Avatar The Last Airbender meets Aladdin, yet still manages to be its own thing. Under Jennifer Lee, Disney Animation is entering a new renaissance.",
      "author": "Grace Randolph"
    },
    {
      "text": "Young audiences will likely be dazzled by the often jaw-dropping animated action on display, but its overly-complicated world building doesn't give it a firm enough foundation to rise above the much stronger players in Disney's recent canon.",
      "author": "Mattie Lucas"
    },
    {
      "text": "A tepid recommendation. Lacks the strength and focus of Disney's better films.",
      "author": "Dan Murrell"
    },
    {
      "text": "Raya and the Last Dragon might be telling a very familiar story, but between the stunning animation, a cast of lovable characters, and a fresh outlook that is well overdue more than makes up for it being a little predictable.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Awkwafina's rat-a-tat-tat patter (something of an equivalent to Robin Williams' Genie in Aladdin) brings the story alive, adding another memorable character to the Disney canon.",
      "author": "James Mottram"
    },
    {
      "text": "Let it entertain while planting the seeds of acceptance and understanding so our children can be better than the insular generations that failed before them.",
      "author": "Jared Mobarak"
    },
    {
      "text": "The warmth shaking the ash from this well-worn story is the gift of family. The family we are born with. The family we make.",
      "author": "Robert Daniels"
    },
    {
      "text": "Raya and the Last Dragon has it all -- rousing adventure, a breathtaking look, appealing characters, and wonderful moments of comedy. This is peak Disney.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Raya and the Last Dragon is a love letter to southeast Asian cultures, backed with a strong cast performance and stunning action-packed animation.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "After living with the pandemic for the past year, we could all use a bit of Disney magic in our lives. The film's central themes feel especially resonant, the laughs are (mostly) well-earned and the big emotional beats are hugely effective.",
      "author": "Brent Hankins"
    },
    {
      "text": "A very good, exciting, funny, joyous animation about the power of coming together, truth beyond the legends, and learning to trust when that's the most dangerous thing you can do. I've watched it a few times (no shame) I'm about to watch it again.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Sometimes the best films don't have characters that break into song, and Raya and the Last Dragon proves you don't have to. I'm here for the butt-kickery.",
      "author": "Tania Lamb"
    },
    {
      "text": "An epic, funny adventure with heart. Kumandra is one of Disney's best recent locations. Sisu steals the show. Namaari it's a surprise. [Full review in Spanish]",
      "author": "Jesus Agudo"
    },
    {
      "text": "The latest Disney Animation film is an entertaining albeit slight entry into the studio's filmography.",
      "author": "Matt Goldberg"
    },
    {
      "text": "A triumph; overwhelmingly delightful and imaginative",
      "author": "Larry Carroll"
    },
    {
      "text": "The greatest testimony to \"Raya and the Last Dragon\" being an exciting adventure is that I wanted to watch it again as soon as it ended immediately.",
      "author": "Nicole Ackman"
    },
    {
      "text": "Raya and the Last Dragon is packed with gorgeous animation, interesting characters, and a heartfelt story built around trusting in one another.",
      "author": "Austin Burke"
    },
    {
      "text": "Raya and the Last Dragon offers up everything viewers could want in not just a Disney film, but a film in general. With culture, nuance, beautiful animation, stellar performances, and a message of trust and hope that feels more timely than ever,",
      "author": "Nicole Drum"
    },
    {
      "text": "Boasting real wow factor, Raya and the Last Dragon is the latest in Disney's long line of animated adventures and it's certainly one of the most spectacular.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Humorous and heart-filled, containing compelling heroes' journeys, engrossing stakes, thrilling action and breathtaking animation, it's got a deeply resonant drive.",
      "author": "Courtney Howard"
    },
    {
      "text": "There's enough heart and style to make Raya and the Last Dragon come alive when it needs to and work overall as a consistently entertaining animated feature.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Raya and the Last Dragon is just a well-made, enjoyable movie across the board. Not every animated film leaves you thinking about it after the fact. Raya does.",
      "author": "Germain Lussier"
    },
    {
      "text": "A batch of familiar ideas winds up feeling relatively fresh.",
      "author": "Matt Singer"
    },
    {
      "text": "It's neither much of a step forward or back [for Disney] in terms of overall quality or ambition, but the filmmakers manage to finesse enough small pleasures from the familiar.",
      "author": "Luke Gorham"
    },
    {
      "text": "Disney has done it again as the cast and crew of Raya and the Last Dragon take viewers on another heartwarming adventure.",
      "author": "Danielle Solzman"
    },
    {
      "text": "RAYA AND THE LAST DRAGON has so much heart. It's almost sheer perfection and will be an instant classic. Guaranteed!",
      "author": "Sarah Musnicky"
    },
    {
      "text": "An ambitious family film that will work for all ages, and one that never talks down to its audience while presenting them with an entertaining, thought-provoking story.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Maybe it's just the state of the world that we are in right now, but Raya and her band of friends offer a little balm for the soul.",
      "author": "Aparita Bhandari"
    },
    {
      "text": "...There is no denying that Raya and the Last Dragon is a powerful and beautiful film...The film offers strong characters, a vibrant world, gorgeous action sequences, and a truly unmatched voice cast.",
      "author": "Kate Sánchez"
    },
    {
      "text": "Disney delivers a vibrant action-fantasy epic with another heroine who feels legitimately revolutionary. Raya rules - bring on the next step in the princess evolution.",
      "author": "Ben Travis"
    },
    {
      "text": "... Raya and the Last Dragon is at once a tears-inducing, hope-rich narrative and a frustrating, rage-creating affair aggravating those who already believe too much in the trust of others and inciting not an ounce of self-awareness from those with none.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Though Raya and the Last Dragon is a visual and audible spectacle anchored by an all-star cast, the film's lack of originality and paper-thin characters leave it on the less memorable end of Disney animated films.",
      "author": "Lauren Coates"
    },
    {
      "text": "Fortunately, the journey isn't all that much less enjoyable for being somewhat predictable - if anything, there's satisfaction in its tidiness, like clicking together the pieces of a jigsaw puzzle.",
      "author": "Angie Han"
    },
    {
      "text": "The pleasing range of faces, skin tones and body types on display helps offset the anonymous quality that plagues even the most sophisticated three-dimensional character design.",
      "author": "Justin Chang"
    },
    {
      "text": "With Kelly Marie Tran voicing the sharp-tongued title character and Awkwafina... the film wrestles with tonal inconsistencies but features fantastic action scenes to go with a touching underlying narrative about the power of trust.",
      "author": "Brian Truitt"
    },
    {
      "text": "Raya and the Last Dragon is an admirably mature tale in a rich and vibrant world that parents and kids alike won't mind trekking across over and over again.",
      "author": "Jacob Oller"
    },
    {
      "text": "Hall and Estrada's jaunty direction pairs nicely with Nguyen and Lim's wonderfully smart script to add plenty of humor to an otherwise dark story.",
      "author": "Kate Erbland"
    },
    {
      "text": "En route to a swelling emotional finale that may elicit tears or eyerolls depending on your point of view (definitely the former for me), Raya and the Last Dragon reveals itself to be a briskly paced action adventure fantasy.",
      "author": "Brandon Katz"
    },
    {
      "text": "This is a film that knows how to soar.",
      "author": "Inkoo Kang"
    },
    {
      "text": "The film is crammed with so much transporting spectacle and visual invention, it feels epic even at living-room size.",
      "author": "Robbie Collin"
    },
    {
      "text": "On its own gorgeously depicted terms, this film sticks the landing as a celebration of hope, a manifestation of what unfettered trust in our shared humanity could look like.",
      "author": "Dan Rubins"
    },
    {
      "text": "Disney's Raya and the Last Dragon stumbles a bit to get going, but manages to stick the landing of a heartfelt and hope-filled animated movie.",
      "author": "Molly Freeman"
    },
    {
      "text": "A thrilling romp with a strong emotional core...with breathtaking and hard-hitting fight sequences that are easily some of the best things Disney Animation has ever done.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "Raya and the Last Dragon is an absolutely dazzling visual feast of animated brilliance.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "A lot of the storytelling is clumsy, rushed or inelegant, but the movie's timely message of unity and trust still resonates...",
      "author": "Peter Debruge"
    },
    {
      "text": "Raya may feel instantly at home with Jasmine, Elsa, Tiana, and co, but that familiarity always feels in danger of slipping into the formulaic.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "If any film can restore faith in humanity, this is it. A heartfelt, rare \"dragon\" gem of a movie with a timely message for a broken world.",
      "author": "Christie Cronan"
    },
    {
      "text": "A visually stunning, action-packed, and hilarious adventure that brings serious girl power and representation to the screen. A truly heartwarming story with valuable lessons.",
      "author": "Tessa Smith"
    },
    {
      "text": "Raya and the Last Dragon offers a terrific cast, a few laughs, beautiful visuals and audio, and a subconscious message of trust and inclusivity that will be enjoyed by audiences of any age.",
      "author": "Allison Rose"
    },
    {
      "text": "Raya and the Last Dragon is a near-perfect mix of delightful visuals and fantasy storytelling, and this vibrant, exciting world is brought to life perfectly by Kelly Marie Tran and Awkwafina's can't-miss performances.",
      "author": "Josh Wilding"
    },
    {
      "text": "While Raya doesn't reach any revelatory heights, the film does extenuate the allures of Disney's enduring magic and creativity.",
      "author": "Matt Conway"
    }
  ],
  "release_year": 2021,
  "duration": 108,
  "genres": [
    "Kids & Family",
    "Fantasy",
    "Adventure",
    "Animation"
  ],
  "synopsis": "Long ago, in the fantasy world of Kumandra, humans and dragons lived together in harmony. But when sinister monsters known as the Druun threatened the land, the dragons sacrificed themselves to save humanity. Now, 500 years later, those same monsters have returned and it's up to a lone warrior, Raya, to track down the last dragon in order to finally stop the Druun for good. However, along her journey, she'll learn that it'll take more than dragon magic to save the world--it's going to take trust as well.",
  "popularity": 9.7,
  "poster_url": "https://image.tmdb.org/t/p/original/5nVhgCzxKbK47OLIKxCR1syulOn.jpg"
}