{
  "movie_name": "Ready Player OneThe Godfather",
  "movie_id": "ready_player_one",
  "total_reviews": 440,
  "reviews": [
    {
      "text": "Ready Player One is perfectly entertaining and enticing, but the sum of its parts ends up significantly less realized than its full potential.",
      "author": "Justin Kim"
    },
    {
      "text": "While the first half of [Ready Player One] is all trivia is the superior form of geekdom and awkward geekboy somehow managing to get the geekgirl interested the second half shows how you can form real communities online.",
      "author": "Maia Rose"
    },
    {
      "text": "Steven Spielberg delivers the ultimate expression of why we digest media, and possibly a glimpse into a world we could all be heading towards.",
      "author": "Tony Black"
    },
    {
      "text": "With Ready Player One, you can feel director Steven Spielberg pushing to reclaim his status as Hollywood's crowned head of spectacle as he pours his considerable talent into another memorable science-fiction fantasy.",
      "author": "Brian Eggert"
    },
    {
      "text": "What Ready Player One does through its story is never quite as interesting as what it means, but its a Spielberg science-fiction pop culture souffle...",
      "author": "Cory Woodroof"
    },
    {
      "text": "An ugly FX monstrosity that misunderstands the misguided message of the book & fails to address its antiquated notions of race, gender and capitalism. Abysmal fan service from Spielberg, who should be able to shoot and edit a climax better than this",
      "author": "Joe Lipsett"
    },
    {
      "text": "A heckin fun movie, full of stunning action sequences and laughs and winks at the kids who grew up watching Back to the Future and Jurassic Park and E.T. and Indiana Jones.",
      "author": "Heather Hogan"
    },
    {
      "text": "Steven Spielberg has basically made the best possible version of this material with the serviceable-at-best script he was given.",
      "author": "Kip Mooney"
    },
    {
      "text": "If you go to the movies to watch big blockbusters with big explosions and effects, or to just have an enjoyable time with family and friends, then this is the movie for you.",
      "author": "Nicholas Oon"
    },
    {
      "text": "It's not nostalgia so much as a hyperactive computer algorithm.",
      "author": "Fletcher Powell"
    },
    {
      "text": "The setting of the film allows for some truly spectacular action set pieces and these are the strongest parts of the film",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "It's a film to watch and enjoy once, but probably not to return to again and again, like Spielberg's best. It's fixated on easter eggs and it's like an easter egg itself: shiny and pretty, inducing a brief sugar high, but ultimately hollow.",
      "author": "Olly Richards"
    },
    {
      "text": "Pure escapism that begs the question, Will there ever be a video game movie that really works?",
      "author": "Richard Crouse"
    },
    {
      "text": "While the video game preoccupation is adequately and thoroughly visualized, the real world has plenty of missing details.",
      "author": "Mike Massie"
    },
    {
      "text": "A kid at heart until his end, Spielberg's renegade sensibilities turns Ready Player One into a true treasure.",
      "author": "Dan Buffa"
    },
    {
      "text": "The film asks the viewer to find their purpose in life, like Wade has, so there isn't always this instant urge to run off to a different reality as found in video games, movies, or television.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "While Ready Player One is an entertaining thrill ride, its storytelling still feels rather empty.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "Most filmmakers fail miserably when trying to meld together both real and fantasy worlds, yet this is truly where Spielberg reminds us of his extraordinary talent.",
      "author": "Richard Propes"
    },
    {
      "text": "Even the most hardened of cynics can appreciate the take-away message: it's important to live in reality because it's the only thing that's real and the only place you can get a decent meal.",
      "author": "Jason Fraley"
    },
    {
      "text": "Ready Player One won't be remembered as Spielberg's worst film but it's not his best either. It's a purgatory state of a film that understands the appeal of the book but fails to convey those aspects in a satisfactory manner.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "[I]t's a montage, an audiobook, and a love letter to the art that fuels us. But does it actually emulate the wonder of nostalgia itself? No, not even close.",
      "author": "Matt Cipolla"
    },
    {
      "text": "The character development and emotional stakes may be undercooked, but it's such a thrill to watch a filmmaker of Spielberg's pedigree unrestrained and having fun.",
      "author": "Allen Almachar"
    },
    {
      "text": "Ready Player One has found a way to bring a difficult-to-accurately-adapt book to the big screen in a way that fashions it into something new and exciting on its own.",
      "author": "Damond Fudge"
    },
    {
      "text": "It ultimately feels like a fan fiction gatekeeping exercise, saying loud and clear that if you don't love the right movies or comics or games, or don't appreciate them in the right way, you're not a real fan.",
      "author": "Brent McKnight"
    },
    {
      "text": "Like Thomas More making his case in Utopia, the example is so good it distracts from the point, leaving a lot of people scratching their heads at what it all means.",
      "author": "CJ Sheu"
    },
    {
      "text": "It's a film that, in addition to being prophetic, is very entertaining, but, above all, it reminds me of those movies and video games that have allowed me to daydream to travel to other realities. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "The film is overkill, it's in your face, and it's sensory overload; but it's also a great deal of fun.",
      "author": "Steven Prokopy"
    },
    {
      "text": "While it's doubtful the film will ever occupy a sacred place in the pantheon of its influences and it occasionally struggles to evoke that same feeling you had watching one of the many films it channels.",
      "author": "Dan Tabor"
    },
    {
      "text": "If escapism is what you're looking for in a popcorn movie, then Ready Player One is worth the price of admission.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Ready Player One is a lot of fun, but it also feels like the end of something. Now that Spielberg is filming his own fanfic, maybe postmodernism has reached its final form.",
      "author": "Chris McCoy"
    },
    {
      "text": "Steven Spielberg used his talents to make a movie with a cotton candy heart, and without the emotion his films usually have any good feelings won't last.",
      "author": "Julian Lytle"
    },
    {
      "text": "It's not just electronic. It's expressive. It's deep.",
      "author": "Lonita Cook"
    },
    {
      "text": "While it won't blow you away with its plot, Ready Player One delivers enough fun and adventure to more than justify the price of admission.",
      "author": "Kieran McLoone"
    },
    {
      "text": "The imperfect yet highly watchable Ready Player One will be something movie lovers will go back to again and again to find comfort in [Spielberg's] particular brand of escapist cinema.",
      "author": "Leslie Combemale"
    },
    {
      "text": "The kids loved it, the adults had their moments of fun. My favorite bit is the race. BUT... I will never love this film, and the reason is a very simple one: I couldn't help but be constantly reminded of a far better film.",
      "author": "Ard Vijn"
    },
    {
      "text": "A cinematic theme park ride of quite epic proportions.",
      "author": "Kate Rodger"
    },
    {
      "text": "Less about a nerd's worship of his hero than the loneliness of being worshipped by nerds ... In Ready Player One, finding mastery and satisfaction in reiterating the past is inherently melancholy.",
      "author": "Mel Campbell"
    },
    {
      "text": "This is eye candy at the extreme with so much detail you may want to see it again to catch all the references. But there are also many messages and issues that come up and make you think.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "No characters, lead or supporting, feel fully drawn out or have complete arcs.",
      "author": "Karl Delossantos"
    },
    {
      "text": "It doesn't bring us back to that Spielberg that gave us pure entertaining cinema at that time... but what he gives us here is so enjoyable that thinking about the negative points does not make much sense. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Its fantastic characters, its overwhelming musical selection, its incontestable performance, and, of course, an exciting sense of spectacle. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "If the book is basically Fifty Shades of Grey for guys who have yet to discover their peckers, the film is a diverting slice of entertainment, offering enough surface thrills to justify its existence in a world already overloading on nostalgic feints.",
      "author": "Matt Brunson"
    },
    {
      "text": "Even though it runs over two hours long, You become so engrossed in the story and the visuals that you don't notice the length - which says a lot about Ready Player One.",
      "author": "Allison Rose"
    },
    {
      "text": "To call Ready Player One superficial is irresponsible because that adjective has the word \"super\" in it. So Ready Player One is, at best, \"ficial.\"",
      "author": "Ryan Syrek"
    },
    {
      "text": "A potent reminder that Spielberg is perhaps the greatest cinematic storyteller of our time.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Tons of fun references, but not a lot of depth.",
      "author": "Erin Carson"
    },
    {
      "text": "If you are looking for a movie that reminds you why you fell in love with movies in the first place, get prepared for Ready Player One.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "A return of [Spielberg's] ability to...paint a picture cinematically that he knows is going to impress an audience.",
      "author": "Dan Murrell"
    },
    {
      "text": "Flawed though it may be, Ready Player One still has quite a bit to offer, especially for those with even the most rudimentary knowledge of pop culture.",
      "author": "Brent Hankins"
    },
    {
      "text": "If you enjoy gaming, wax lyrical about 80s entertainment... and appreciate action above under-developed personae, you will love Steven Spielberg's interpretation of Ready Player One.",
      "author": "Wendy Shreve"
    },
    {
      "text": "Ready Player One is a visual spectacle and Spielberg's most fun film in decades. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "There are definitely seeds of an interesting premise here, but unfortunately, they degenerate into a bundle of clichés overloaded with pop culture allusions.",
      "author": "Sameen Amer"
    },
    {
      "text": "This is a highly-entertaining movie that pays homage to tech gurus as well as pop culture, and should appeal to a wide audience of film fans, not just gamers.",
      "author": "S. Indra Sathiabalan"
    },
    {
      "text": "So in the end, my opinion on Ready Player One- the movie was good, fun ride that especially kids will love... But the book was great. That's my story and I'm sticking to it.",
      "author": "Rachel Wagner"
    },
    {
      "text": "If you're willing to enjoy Ready Player One superficially you'll have a good time. If you spend longer than five minutes thinking about it you'll consider it a crime against cinema.",
      "author": "Tom Bond"
    },
    {
      "text": "It's a repetition of the old bugaboos we know so well, packaged in a slick, CGI-heavy wrapping that is not as interesting as it wants to be.",
      "author": "Tomas Trussow"
    },
    {
      "text": "Ready Player One is a bit like catnip laced cocaine sprinkled atop crack filled Girl Scout Cookies. You probably can't live on it. It may even kill you. But it will be worth it.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "Ready Player One isn't a transcendent piece of cinema. That's OK. It IS a well-made piece of popcorn entertainment that also manages to be an odd ouroboros of layered Spielbergian nostalgia-ception.",
      "author": "Allen Adams"
    },
    {
      "text": "[Steven] Spielberg chooses to embrace a more optimistic approach, and it's a change that's both refreshing and engaging in a way few directors could pull off.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Ready Player One is a no-brainer, must-see in theaters. It's such a fun movie that you'll probably want to see it again.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "... sensorially exhausting pyrotechnics.",
      "author": "Filipe Freitas"
    },
    {
      "text": "It's a movie with a storytelling approach that feels as old and cliched as some of the inspirations it's trying to evoke.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Dishes out a liberal serving of memberberries piled-high atop a generic, hollow bowl.",
      "author": "Louisa Moore"
    },
    {
      "text": "An old-fashioned, though state-of-the-art, frolic ... Viewers need not be cut-throat Trivial Pursuit players to know Blondie from Buckaroo Banzai, though it wouldn't hurt.",
      "author": "Kent Turner"
    },
    {
      "text": "The story is fairly conventional ... the cast is only mostly successful ... but the relevance of it all and complete sense of wonder ... make it a trip worth taking ...",
      "author": "Colby Bryant"
    },
    {
      "text": "Ready Player One, despite its pedigreed director, amiable cast, and eye-popping visuals, mistakes tired references and slick action sequences for personality",
      "author": "Di Golding"
    },
    {
      "text": "READY PLAYER ONE proves a canny surprise. It is rare that movies triumph over their source material, but this is one such case.",
      "author": "Tim Stevens"
    },
    {
      "text": "Pop culture fans will find something to love in this fun thrill ride.",
      "author": "John Hanlon"
    },
    {
      "text": "Ready Player One might not be Spielberg's worst film, but it is his most impersonal.",
      "author": "Alistair Ryder"
    },
    {
      "text": "There's a touch of Spielbergian magic that transcends the choppy, patchwork narrative. It's very difficult not to have an immense amount of fun with Ready Player One in spite of its flaws.",
      "author": "Brian Gill"
    },
    {
      "text": "Perhaps the most compelling thing Ready Player One and the OASIS provides is the glimpse at our inevitable future.",
      "author": "Kent Garrison"
    },
    {
      "text": "Despite its many issues, Ready Player One is still an enjoyable ride that ticks all the boxes of a big summer blockbuster.",
      "author": "Kt Schaefer"
    },
    {
      "text": "The dazzling visual flurry on screen is both amazing and emotionally draining, often to the point of excess.... Ready Player One elevates itself beyond genre fodder.",
      "author": "Matt Ward"
    },
    {
      "text": "Far from perfect but almost obnoxiously entertaining.",
      "author": "Matt Oakes"
    },
    {
      "text": "A once-great filmmaker has taken on a new avatar less heroic than Parzival. It is the avatar of a pandering crowd-pleaser.",
      "author": "Armond White"
    },
    {
      "text": "Spielberg's dreamy love letter to pop culture is a pure joy to take in, hypnotic and grin-inducing in its references, with an unadulterated sense of magic.",
      "author": "Cameron Frew"
    },
    {
      "text": "It's certainly a far more nutritious experience than the book...and I certainly wouldn't begrudge anyone wanting to escape the depressing world we live in for a few hours to enjoy it.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "[It's] almost like you can feel Spielberg on autopilot, thinking about more interesting, challenging projects he'll be working on when this is done re-affirming his box-office credentials.",
      "author": "Bob Chipman"
    },
    {
      "text": "As a focus for our own nostalgia-based serotonin triggers, it's a complete success. As a stand-alone story, not so much. But hey! Pretty shiny things!",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "It delivers on every level fans have been hoping. It may even be better than its sometimes problematic source material.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "Although there are some fun sequences and genuine wonder to behold, the film is a pandering, noisy, visual mess with a thin plot and even thinner characters.",
      "author": "Harris Dang"
    },
    {
      "text": "It's Spielberg's sloppiest film since Hook, but still has enough moments that transcend simple nostalgia to make it worthwhile even if it is an uneven thrill ride.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "If you're impressed by a wave of nostalgic nods to the past, at the expense of anything remotely interesting itself, this is really the film for you.",
      "author": "Doug Jamieson"
    },
    {
      "text": "A lot of Ready Player One feels like the audience is watching a video game, but this is one time when I didn't mind not playing.",
      "author": "Micheal Compton"
    },
    {
      "text": "There are literally no creative decision-makers of color who helped bring Ready Player One into being. And it shows.",
      "author": "Li Lai"
    },
    {
      "text": "READY PLAYER ONE is the prime example of just how hollow big budget filmmaking has become and ranks as one of the worst movies Spielberg has ever made, even though it represents an amalgamation of what has made his movies so iconic.",
      "author": "Alex Maidy"
    },
    {
      "text": "The silver screen has rarely felt so lacking in allure, which is either the complete opposite of the point that Spielberg is trying to make or the absolute epitome of it.",
      "author": "Aaron Leggo"
    },
    {
      "text": "\"Ready Player One\" is an engrossing thrill ride that feeds off of your pop culture nostalgia.",
      "author": "Joey Magidson"
    },
    {
      "text": "RPO is a movie with a tsunami of these moments from about 40 years of film, T.V and gaming. If you're a collector, you may relish trying to catch them all.",
      "author": "Blake Howard"
    },
    {
      "text": "There is a beating heart behind the glossy technical craft here, a real respect for the pop culture that so dictates everything about the film's universe.",
      "author": "Ross Miller"
    },
    {
      "text": "At one point it might simply be too much. But that's part of the experience. Like some rides you're left dazed by the end, but you might just want to go back for another round.",
      "author": "Alci Rengifo"
    },
    {
      "text": "It's definitely not the book-and that's good. Unfortunately, however, it's not a great movie either.",
      "author": "Jared Mobarak"
    },
    {
      "text": "If Spielberg had found a way to inject even a bit of the warmth, wonder, and intelligence we associate with some of his best-loved films, this might have been something special.",
      "author": "Adam Lubitow"
    },
    {
      "text": "It's a win across the board...when Spielberg decides to use a piece of pop culture or nostalgia, he uses it as an integral part of the story.",
      "author": "John Campea"
    },
    {
      "text": "Ready Player One feels empty when you explore its characters, and tries to have its cake and eat it too with the climactic message, which feels downright incongruous with everything thrown at us during the previous two hours.",
      "author": "Akhil Arora"
    },
    {
      "text": "It's pure entertainment, and gives Spielberg an easel to prop his sentimental painting on, and all the colors on his palette to do so.",
      "author": "Robert Daniels"
    },
    {
      "text": "There are so many times that Ready Player One could have wrestled with its nostalgia love or more problematic elements, but instead it's just a movie with no there there.",
      "author": "Terence Johnson"
    },
    {
      "text": "Definitely a film worthy of your quarters.",
      "author": "Rendy Jones"
    },
    {
      "text": "Ready Player One is literally a gamer's paradise, a dazzling film that never seems to slow down.",
      "author": "Annie Banks"
    },
    {
      "text": "A fun film that can be enjoyed whether you read the book or not.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "Creating escapism is what Spielberg is all about, and he nails it with \"Ready Player One.\"",
      "author": "Pamela Powell"
    },
    {
      "text": "Nerds and gamers are more than simply white men of a certain age, guys. Give us all characters we can enjoy and embrace.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "Ready Player One is weighed down by so much nostalgia and pop culture references while being devoid of everything else.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "For all of the fun that \"Ready Player One\" thinks it is having, if you look behind the curtain of its stratagems you'll find a ho-hum young adult sci-fi movie.",
      "author": "Tom Santilli"
    },
    {
      "text": "A stunning piece of popcorn cinema... one big budget blockbuster worth immersing yourself in ASAP.",
      "author": "Andrew Pollard"
    },
    {
      "text": "A juicy wad of bubblegum entertainment, visually antic and immersive without feeling assaultive, fast-paced without feeling rushed.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The movie is cynical and manipulative because the '80s it exploits means nothing to Spielberg. He uses items from that decade because he noticed that's what kids are into...",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Ready Player One isn't the Spielberg home run that fans of the book may have hoped it would be, but it's a solid double and a good time that is almost perversely suited for home viewing.",
      "author": "Joe Reid"
    },
    {
      "text": "A fantastic, mind blowing amalgam of \"Willy Wonka and the Chocolate Factory,\" \"Tron,\" and \"The Matrix\"...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Under the barrage of 1980s macho-nerd pandering, the whole thing is just more exhausting than it should be.",
      "author": "Chelsea Phillips-Carr"
    },
    {
      "text": "Not a lot of attention is paid to the troubling implications of living your life in a make-believe space, but the adventure moves fast enough to prevent the viewer from worrying too much about it.",
      "author": "Dominic Corry"
    },
    {
      "text": "The movie doesn't understand what it means to turn the Iron Giant into a weapon, and worse, neither do the characters. There's no actual nostalgia in this nostalgic epic.",
      "author": "Lindsay Ellis"
    },
    {
      "text": "Tailor made for Spielberg with an adventurous heart and an accessible screenplay.",
      "author": "Wesley Lovell"
    },
    {
      "text": "...just another ill-conceived and executed endeavor from a director well past his prime.",
      "author": "David Nusair"
    },
    {
      "text": "The end result is a a confusing and muddled message about the \"purity\" of fandom.",
      "author": "Meg Downey"
    },
    {
      "text": "A $175 million, effect-laden sci-fi epic that's pitched at the level of a Tonight Show With Jimmy Fallon sketch- it's \"hey, remember that thing: The Movie\" (Living Life Fearless)",
      "author": "Stephen Silver"
    },
    {
      "text": "A cross between a thrill ride and a particularly satisfying video game... it's the kind of movie you need to see over and over again.",
      "author": "Rich Cline"
    },
    {
      "text": "[The film] serves as testament to Spielberg's gift as a pulse-riding, intuitively cinematic entertainer....a film full of grandly staged cyber battles and real-world intrigue. And thankfully it's one of the few long films to warrant its running time.",
      "author": "Jim Schembri"
    },
    {
      "text": "the film improves as it goes on, especially in the second half, where Spielberg generates a successful tension in juxtaposing action taking place simultaneously within the real world and the OASIS",
      "author": "James Kendrick"
    },
    {
      "text": "Being brave enough to take the leap is the theme of Steven Spielberg's visually dazzling fantasy that seamlessly morphs from its apocalyptic reality into a world limited only by our imagination.",
      "author": "Louise Keller"
    },
    {
      "text": "Even though these heroes are simplistic... Spielberg makes sure their motives and goals are transparent, the force driving us breathlessly to the movie's climax.",
      "author": "John Serba"
    },
    {
      "text": "Wow, what a massive cluster...um...you know... the film is. This would-be player tried her best to be ready, but sometimes - sorry, Hamlet - the readiness isn't all.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Ready Player One dares to redo nostalgia. [Full review in Spanish]",
      "author": "David Tejero Nogales"
    },
    {
      "text": "Spielberg demonstrates the impact pop culture has had on people's lives - an effect for which he is largely responsible. [Full review in Spanish]",
      "author": "Cristina Vales"
    },
    {
      "text": "Steven Spielberg's inner child has given us untold worlds of wonder. Now, it seems, the time has come to pay the piper.",
      "author": "J. Olson"
    },
    {
      "text": "The important thing is that the story is absorbing and the characters endearing, so the plot is still exciting despite being predictable, pure Spielberg style. [Full Review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "Ready Player One is a joy, wherever you see it. [Full Review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Even though I'm not the target audience, and even though it went on too long and sagged somewhat in the last half, I was carried away by the gorgeous special effects, the energy and Spielberg's sheer joy in filmmaking.",
      "author": "Diane Pershing"
    },
    {
      "text": "There will be many who jump for joy over this new invention of Spielberg. How I envy their ecstasy. [Full Review in Spanish]",
      "author": "Carlos Boyero"
    },
    {
      "text": "With its narrative slight and familiar, and its sense of drama and threat muted, it relies upon its roster of recognisable properties - and the affection everyone has for them, especially off-screen - to provide interest.",
      "author": "Sarah Ward"
    },
    {
      "text": "Ready Player One is popcorn entertainment that everyone can enjoy.",
      "author": "Oggs Cruz"
    },
    {
      "text": "Sputters out after a fast start.",
      "author": "Bob Grimm"
    },
    {
      "text": "More high nostalgia than high art, it is what it wants to be: an on-screen feel-good easily digestible celebration of beloved fandoms.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Ready Player One is a feast of nostalgia, action and visual style, which more than makes up for its fairly minor narrative shortfalls.",
      "author": "Tim Martain"
    },
    {
      "text": "The years go by and the most famous American director is still the best at what he does. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "There is nothing to recommend the film itself, which may as well have been assembled by the soulless corporate drones that it purports to hold in such contempt.",
      "author": "Alex Doenau"
    },
    {
      "text": "Few 21st century American films are as intertwined with the culture we live in as Ready Player One.",
      "author": "Jeff Simon"
    },
    {
      "text": "It's a clever, stylish, entertaining blockbuster designed to give one's inner child the cinema equivalent of a sugar rush.",
      "author": "Gary Dowell"
    },
    {
      "text": "As you would expect from a Spielberg film, the production values are first rate, with great special effects and great visuals, especially the stunning way the digital world of Oasis appears. The acting, and of course the direction, are both solid.",
      "author": "Robert Roten"
    },
    {
      "text": "Ready Player One is the first Spielberg film I can remember that feels contemptuous.",
      "author": "Walter Chaw"
    },
    {
      "text": "For all its ferocious energy, Ready Player One strikes me as the product of a cinema of exhaustion-it's a film about having come too far and being at the end of something, where extraordinary things no longer mean much, or have become toxic.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Floods the senses with dazzling imagery but it reaches overload. Its about not being happy with yourself. Then something extraordinary happens. A scene so unique, so bizarre that it knocks off being eaten by Godzilla.",
      "author": "Victoria Alexander"
    },
    {
      "text": "An overlong, meandering mess, and a stain on Spielberg's CV; it's certainly the least satisfying film of his I can remember seeing.",
      "author": "CJ Johnson"
    },
    {
      "text": "...it's just so hollow, and the characters so shallow, and the world so unexamined that Ready Player One never gets off the ground.",
      "author": "Sarah Marrs"
    },
    {
      "text": "It is, despite Spielberg's claims, neither a purehearted popcorn flick nor a Paul Verhoevenesque subversion, but something uneasily in between, cowed by the idea of the fanboy demographic.",
      "author": "Alison Willmore"
    },
    {
      "text": "But more often than not, it falls into the same trap, preferring to throw reference after reference at the screen without exploring why the sources of those references resonate with the characters, or the audience.",
      "author": "Abby Olcese"
    },
    {
      "text": "It's an effective cinematographic exercise in which nostalgia plays a key role and more proof that there is no one better than Steven Spielberg to make commercial films. [Full review in Spanish]",
      "author": "Jonathan Eslui"
    },
    {
      "text": "I enjoyed it enough to feel as if I'd gotten a real theatrical experience out of it - but I also felt exhausted by the experience and a little bit sad for what it represented...",
      "author": "Wade Major"
    },
    {
      "text": "Ready Player One captures the gee-whiz youthful triumphalism of the Reagan era, all right, but it never explores the deeper question of whether all that is worth rehashing - over and over.",
      "author": "Margot Harrison"
    },
    {
      "text": "It's a film that evokes pure nostalgia...it should be enjoyed with loved ones. [Full Review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "Turns out that treating the movies entirely as a jungle gym brings out Peter Pan's inner brat. He's made a movie for lost boys.",
      "author": "Adam Nayman"
    },
    {
      "text": "Ready Player One is a pageant of now-dated pop culture references, an elaborate feat of CGI and copyright clearance, with images from games and movies speeding past, to the tune of Van Halen and A-Ha.",
      "author": "Pamela Hutchinson"
    },
    {
      "text": "Ready Player One might be the best film of 2018 so far. At the very least, it's the most fun you'll have at the movies anytime soon.",
      "author": "Cameron Meier"
    },
    {
      "text": "Spielberg's message about not losing touch with reality and corporate takeovers may be too obvious, but the glorious visuals will captivate you to the end.",
      "author": "Joanne Soh"
    },
    {
      "text": "I was locked in from the beginning. They got me into the world...really good movie.",
      "author": "Kristian Harloff"
    },
    {
      "text": "It's a lot to take in, but it doesn't feel overwhelming...you enjoy what this movie does to you.",
      "author": "Mark Ellis"
    },
    {
      "text": "Ready Player One becomes a reflection on the very meaning of fantasy cinema, of movies in general. [Full Review in Spanish]",
      "author": "Fausto Fernandez"
    },
    {
      "text": "This is an adventure movie from the all-time master of them, Steven Spielberg.",
      "author": "Andy Howell"
    },
    {
      "text": "See it on the biggest screen possible. [Full Review in Spanish]",
      "author": "Rafael Rosales Santos"
    },
    {
      "text": "Remarkable. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "But, once this sucker gets rolling, it becomes a visual thrill ride that is simultaneously a celebration and condemnation of the entertainment industrial complex.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "The fact that Ready Player One's best scene has little to do with video games feels like it means something.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "In fact, it appears, for a moment, to be barreling toward a potent critique of the book and the broader culture of the privileged, young white millionaire men of Silicon Valley. Unfortunately, it stumbles at the finish line.",
      "author": "Chris Plante"
    },
    {
      "text": "Pop-culture references are no substitute for brains in this overly frenetic, poorly written blockbuster.",
      "author": "Tom Glasson"
    },
    {
      "text": "This film is pure joy and the epitome of what we hope for when we go to the movies.",
      "author": "Danny Minton"
    },
    {
      "text": "Self-indulgent and far too long, but plenty of retro fun here for pop culture geeks, with Spielberg casting off the recent seriousness of The Post to become what he does best.",
      "author": "Alison Rowat"
    },
    {
      "text": "A visual spectacle so overwhelming as joyful that it does not give the viewer respite in his uninterrupted succession of adventures. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "As long as you're willing to ask little in the way of intellectual or emotional stimulation, Ready Player One is a great day out.",
      "author": "Imogen West-Knights"
    },
    {
      "text": "The visuals of Ready Player One really are ingenious, though the conglomeration of homages do not always mix well and it becomes a bit of a hodgepodge. [Full Review in Spanish]",
      "author": "Paula Arantzazu Ruiz"
    },
    {
      "text": "It's vibrant, it's colorful, and it was a lot of fun...this movie is all about the celebration of geek culture.",
      "author": "Andre Meadows"
    },
    {
      "text": "The film is necessarily derivative, but hardly ever witty...It's entertaining by and large, but left me wanting less.",
      "author": "Paul Whitington"
    },
    {
      "text": "[Steven Speilberg's] still got the old magic.",
      "author": "Tom Shone"
    },
    {
      "text": "It's a pop culture geek out, but also visually stunning and good fun even for non-gamers.",
      "author": "Aine O'Connor"
    },
    {
      "text": "Emotionally it's completely flat - the main characters struggle to make it out of two dimensions, the linear storyline is a far-from-thrilling treasure hunt, and any potential romance feels formulaic, forced and rather feeble.",
      "author": "Matthew Bond"
    },
    {
      "text": "It says here you'll at least consider going back to watch \"Player One\" again to find more tidbits you missed the first time.",
      "author": "John Urbancich"
    },
    {
      "text": "It's official - Ready Player One is Steven Spielberg's worst film.",
      "author": "Chris Evangelista"
    },
    {
      "text": "I saw the film in IMAX, and a week later I'm still waiting for the safe return of my optic nerves, but it was the meagre emotional charge that shocked me most.",
      "author": "Anthony Lane"
    },
    {
      "text": "Underwhelming, overlong and breezy sci-fi blockbuster. It's an ironic ode to pop culture, geeks and virtual reality.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "'Ready Player One' is an exemplary blockbuster, a film that conveys fun in a way only Spielberg can achieve. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A boring, vapid and tedious video game that lacks a heart, mind, soul, personality or anything else that's part of the spectrum of humanism. It's yet another addition to Hollywood's \"bread and circuses.\"",
      "author": "Avi Offer"
    },
    {
      "text": "Ready Player One is the dream of every geek and pop culture aficionado. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "An adventure tale whose plot revolves around the pleasures of losing yourself in fantasy worlds, Ready Player One is ... a giddy rush of a movie that zips along on a tide of breathless action and boundless pop-culture trivia.",
      "author": "Jason Best"
    },
    {
      "text": "The movie cares more about all the nostalgia and easter eggs than and actual story. It beats you over the head and forces you to look at it. All the visual flair in the world can't disguise an empty experience",
      "author": "Michelle Alexandria"
    },
    {
      "text": "This is fun while it lasts but I would have liked a little more humour and a lot more soul. I pray the retro revival has now hit its peak.",
      "author": "Andy Lea"
    },
    {
      "text": "This is hardly Spielberg's most creative genre work - but...it does speak to the joyful, unapologetic classicism of his film-making style.",
      "author": "Simran Hans"
    },
    {
      "text": "Bright, shiny, packed to the brim with detail, and totally without passion.",
      "author": "Tim Brayton"
    },
    {
      "text": "The anti-Matrix, celebrating obeisance to random yet tethering nostalgia within a river of brands and platforms and delusions from the 1980s, critiquing lightly but eventually embracing the machine: any machine.",
      "author": "Ray Pride"
    },
    {
      "text": "Overstuffed, escapist action adventure, brimming with flashy eye candy and fantastic fanboy ferocity.",
      "author": "Susan Granger"
    },
    {
      "text": "Ready Player One does what it sets out to do: it entertains, it flatters, it moves. Hard to ask for much more than that from a big budget blockbuster.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Escapist fun made for mandatory repeat viewings to try to catch all the characters and icons hidden throughout. With READY PLAYER ONE, Spielberg has crafted an electronic Wonderland that is a love song to fandom and pop culture itself.",
      "author": "Diva Velez"
    },
    {
      "text": "With Spielberg, one has come to expect much, and so when presented with is flick that is only intermittently fun, and never buoyant, one comes away disappointed, and feeling just a little bit cheated.",
      "author": "Andrea Chase"
    },
    {
      "text": "Another disappointment from Steven Spielberg. He has come a long way down from the heart warming charm of \"E T\" to this cold and brassy virtual reality escapade.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "It hums with Spielberg's unmatched formal elasticity. But it's also a shrill, soulless piece, lacking the sense of wonder - or even an interrogation of such - essential to its director's best work.",
      "author": "Luke Goodsell"
    },
    {
      "text": "An exhilarating ride as good as or better than most other films of its type.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The offering is quite a fun and frenetic blast, and is far, far better than that initial movie trailer suggested. (Full Content Review for Parents - Violence, Profanity, Nudity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Ready Player One may be a movie about the future, but it is damningly a product of our present.",
      "author": "K. Austin Collins"
    },
    {
      "text": "Spielberg's film, which could have done so much more, does not improve on the novel. It's a missed opportunity.",
      "author": "Aakash Karkare"
    },
    {
      "text": "A one-of-a-kind thrill ride that provides an abundance of fun.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "I'm here to report that you can still have a good time at Ready Player One even if you don't get most of the references.",
      "author": "Lili Loofbourow"
    },
    {
      "text": "[Filled] with some truly wondrous sequences that confirm the director can still craft thrilling popcorn entertainment better than anyone on the planet.",
      "author": "Simon Foster"
    },
    {
      "text": "At its core, Ready Player One does embody the emotional and nostalgic side of Spielberg and celebrated pop culture like only someone who was creating it at the time could have.",
      "author": "Tyler Carlsen"
    },
    {
      "text": "It's a little hard not to feel like the emperor isn't wearing any clothes.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "The challenges are exciting, extensive, and surprising, and few if any directors are better at staging these kinds of action set pieces than Spielberg.",
      "author": "Kirk Baird"
    },
    {
      "text": "Just like Halliday's contest, Ready Player One is designed to reward the nerdiest among us.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "It's a premise that could have been so much more, but instead it's a narrative that's more of a generic video game plot within a generic video game plot within a relatively basic movie",
      "author": "Matt Miller"
    },
    {
      "text": "Ready Player One feels long played out.",
      "author": "Tom Meek"
    },
    {
      "text": "Spielberg's adaptation is a improvement from Cline's novel, repairing its flaws and embracing nostalgia in the right ways to make one of his finest blockbusters in years.",
      "author": "Ross Bonaime"
    },
    {
      "text": "But with unruffled confidence and youthful velocity, the 71-year-old gambles that the thrills would override the insincerity -- that nobody would mind the self-defeating scruples as long as the breakneck ride keeps us glued.",
      "author": "Kong Rithdee"
    },
    {
      "text": "Spielberg has a frighteningly plausible vision of our near future, but he lacks the courage to follow through on its implications.",
      "author": "Kyle Smith"
    },
    {
      "text": "... features a playful sense of adventure likely to unite gamers past and present without sacrificing mainstream appeal.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Ready Player One needs to throw as many shiny things with nostalgic value at you as it can to cover up how boring the entire affair is.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Ready Player One is more like a seven-course banquet made up entirely of Pixie Stix and Pop Rocks-you certainly get a rush from it for a little while but once the initial effect, there is not much of anything else going for it but overindulgence.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "It may be impossible to separate Ready Player One from its references, and without the Easter eggs, inside jokes, and endless homages, Ready Player One doesn't offer much that is unique to itself.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "To quote from yet another famous '80s reference, go ahead and gag me with a spoon.",
      "author": "Piers Marchant"
    },
    {
      "text": "Spielberg wants us to drop the techno-gadgets and join hands, but it's the VR world that really juices him. He's the ultimate fanboy making a movie about the need to move beyond being a fan.",
      "author": "Peter Rainer"
    },
    {
      "text": "Intense virtual reality adventure will dazzle '80s fans.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "I'm sure that some will be more receptive to the avalanche of nostalgia than others... but I don't think one can deny the [film's] comment on the place of popular culture in our lives. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "Busy and hectic but not cohesive, a game that's nothing more than a game.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Those who haven't read the book will love this fantasy trip down 1980s memory lane. Fans of the novel will be horrified.",
      "author": "Gary Wolcott"
    },
    {
      "text": "A fun, imaginative take on Ernest Cline's novel. So why does it leave us wanting more?",
      "author": "Christian Toto"
    },
    {
      "text": "Really is fun in some ways. But there's a suffocating abundance of digital imagery, and after a while, you feel as if you're staring at nothingness made manifest.",
      "author": "Kurt Loder"
    },
    {
      "text": "It's a fitting summation of Spielberg's career: occasional nods to the real world, but really preferring a world of fantasy and eternal adolescence.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Spielberg has created an experience so enthralling you will want to watch it again and again.",
      "author": "Jamie East"
    },
    {
      "text": "Where the old Spielberg magic comes into play are the points at which the virtual game world starts spilling into real world.",
      "author": "Alistair Harkness"
    },
    {
      "text": "It's a whole lot of CGI fun going along for the ride, even one that lasts two hours and 19 minutes.",
      "author": "Brian Viner"
    },
    {
      "text": "It's a fun romp but lacks any real sense of menace or consequence.",
      "author": "Stefan Kyriazis"
    },
    {
      "text": "So much of Ready Player One is assembled from the detritus of our past that it is less a film and more an overstuffed cultural recycling bin.",
      "author": "Barry Hertz"
    },
    {
      "text": "A fantasy about rejecting fantasy that's built on movie fantasy clichés.",
      "author": "Ed Whitfield"
    },
    {
      "text": "A blast of pure childlike amusement.",
      "author": "Adam Graham"
    },
    {
      "text": "Ready Player One is a two-hour joyful pop culture celebration, a non-stop but not exhausting visual extravaganza that feels fresh and old-school at the same time.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Fans of Ernest Cline's book are already grumbling about the changes and omissions in this expansive, expensive adaptation. I enjoyed the film more than I expected to--but felt that it went on too long and squandered its potential in the process.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Mainly a computer generated animation extravaganza, the character development of the novel is jettisoned in favor of a chase narrative that compresses so much story that the entire affair seems rushed and over-labored.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Spielberg's \"Ready Player One\": Pop Culture 101",
      "author": "Charles Koplinski"
    },
    {
      "text": "The good news is, it's Steven Spielberg. The not-so-good news: The Spielberg sci-fi magic is missing in this adaptation of Ernest Cline's young-adult novel...all in all, Spielberg would do well to return to the real world.",
      "author": "Rashid Irani"
    },
    {
      "text": "Life in the OASIS is exciting and wondrous to behold through your avatar's oversized anime eyes, but it doesn't mean much without some real-world stakes, and that's where the film stumbles, badly.",
      "author": "Matthew Lickona"
    },
    {
      "text": "The film does a good job balancing and, in a few cases, overlapping the virtual and real worlds - though anyone from the future will tell you that you don't run down a street wearing VR goggles.",
      "author": "Chris Knight"
    },
    {
      "text": "RPO is sort of Philip K. Dick-lite.",
      "author": "Paul Chambers"
    },
    {
      "text": "Sensory overload with a heart.",
      "author": "Dustin Putman"
    },
    {
      "text": "A nightmare of nothingness, of empty, soulless w*nkery, that serves only to reassure male dorks that their pop-culture obsessions make them special, and will make cute girls like them.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "...this failed the watch test miserably as I didn't know if I would actually survive almost 2 1/2 hours of watching all this nonsensical gobbledygook. But it will probably gross a billion dollars.",
      "author": "Tony Medley"
    },
    {
      "text": "Cline's world and Spielberg's vision of it mesh as well as John Ford and the Old West.",
      "author": "Bob Bloom"
    },
    {
      "text": "A pop-culture smorgasbord with eerily prescient themes.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "There's still something a little icky about a movie that data-mines the pop culture past of middle-aged men so shamelessly. Instead of us having to put away childish things, they're starring in a movie.",
      "author": "Rob Thomas"
    },
    {
      "text": "While Spielberg revels in this stuff, he's also playing the role of concerned elder, cajoling these crazy kids to go outside and get some fresh air. Maybe that's why the movie's relentless fun feels just a little conflicted.",
      "author": "Robert Horton"
    },
    {
      "text": "Of course, splendid visual effects would be nothing without good composition and Spielberg's control of the camera and expertise in crafting an action sequence is nonpareil, ultimately making Ready Player One the greatest movie to see in 3D since Avatar.",
      "author": "Musanna Ahmed"
    },
    {
      "text": "Visually sophisticated and full of invention, the movie harkens back to one of Spielberg's career sweet spots: the 1980s.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Spielberg's skillful pacing keeps the visual stimulation focused, such as in a thrilling car chase early on where Wade races the time-traveling Delorean from Back to the Future against a fleet of competitors.",
      "author": "Josh Terry"
    },
    {
      "text": "Ready Player One is big fun, to be sure. But its chances of enduring into 22nd-century pop consciousness seems improbable.",
      "author": "Randall King"
    },
    {
      "text": "In the hands of Spielberg, much of the pop culture junk that would feel gratuitous in other hands have a certain emotional resonance in his.",
      "author": "Will Leitch"
    },
    {
      "text": "As it stands, the movie is, like its central conceit, just a place to forget our problems and have fun for a couple of hours. But at least, for once, it's fun the whole country can have together.",
      "author": "Megan Basham"
    },
    {
      "text": "In 100 years, when film scholars are looking back at the career of Steven Spielberg... Ready Player One will be used as the primary piece of evidence to showcase the best and worst of the director.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "If a film could collapse in on itself, due to its slavish devotion to a specific subset of 1980s entertainment, Ready Player One would be that black hole.",
      "author": "Al Hoff"
    },
    {
      "text": "Haptics weren't needed to feel the emotional pull of his best films; they aimed for the heart and hit much more often than they missed. \"Ready Player One\" aims for the adrenal gland.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Ready Player One certainly isn't just a film, it's an experience. It's a game... and we all win.",
      "author": "Tonja Renée Stidhum"
    },
    {
      "text": "Ready Player One is Spielberg's gigantic love letter to his alternate world inhabited by all cinema. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "It's all blind, superficial adoration devoid of the very sort of adult perspective it so desperately requires.",
      "author": "Nick Schager"
    },
    {
      "text": "The VR world feels like watching someone play a multiplayer game, but it's action-packed, incredibly skillfully done, and often wonderful, as when the hero finds himself in 1980's The Shining.",
      "author": "Tim Appelo"
    },
    {
      "text": "By jettisoning pretty much everything but the bare skeleton of the plot and characters while expanding the scope beyond the 1980s, Steven Spielberg's film adaptation climbs its way up to exhausting, headache-inducing mediocrity.",
      "author": "Sherilyn Connelly"
    },
    {
      "text": "It's the decade in which Spielberg shaped so many of our pop-culture ideals, and with Ready Player One, he is masterfully back in the game, and that makes us all winners.",
      "author": "Michael Smith"
    },
    {
      "text": "Many of the book's references to Spielberg's cultural artifacts have been stripped away, but he imbibes the movie with flashes of colour and heart that rekindle a sense of wonderment that will transport many viewers back to their childhoods.",
      "author": "Mark Daniell"
    },
    {
      "text": "Why does Steven Spielberg always make the same mistake? Every time he tries to make technology and artificial reality the guts of the story, instead of the means of telling a story, he makes a great big-budget mess.",
      "author": "Katherine Monk"
    },
    {
      "text": "Amid this special-effects maelstrom, Wade Watts never emerges as a character, and the taciturn Sheridan is in constant danger of being out-acted by his own avatar. Who can connect with a hero when he's just watching the story?",
      "author": "J. R. Jones"
    },
    {
      "text": "For all of its many flaws, Ready Player One is hugely entertaining without ever coming close to the masterpiece status of Spielberg's earliest and genre-defining work.",
      "author": "Rob Carnevale"
    },
    {
      "text": "Ready Player One is a pure nostalgia bath for a generation. The '80s soundtrack sets the tone for spotting more pop-culture references than you can imagine, and spotting them is a lot of fun. But it's also pure Spielberg magic.",
      "author": "Brad Keefe"
    },
    {
      "text": "Just as Ready Player One moves back and forth between fantasy and reality, it's difficult not to admire the facility with which Spielberg oscillates between this sort of sprawling, popcorn-munching exercise and a character-driven historical drama.",
      "author": "Brian Lowry"
    },
    {
      "text": "The film excels in its hectically brilliant action sequences, where the screen seethes with energy, anarchy and in-jokes.",
      "author": "Adam Sweeting"
    },
    {
      "text": "Worth the hype and is definitely one of the appointment films worth seeing so far in 2018.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "The beauty, the variety and the universality of this gigantic adventure, which firmly aspires to the ideals of contemporary cinema, surprises. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "A lively and agreeable work of fanboy art - a first-rate film fashioned from secondhand materials.",
      "author": "David Edelstein"
    },
    {
      "text": "Ready Player One is a celebration of popular culture... [Full review in Spanish]",
      "author": "Erick Ortiz"
    },
    {
      "text": "Spielberg is a filmmaker with an acute narrative skill. [Full review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "The mesmerizing 'Ready Player One' is a game-changing treasure.",
      "author": "Roger Tennis"
    },
    {
      "text": "Back to the Future, indeed. Fanboy-pandering, CGI-driven, rehash of pop culture faves. That DeLorean was a lemon, folks.",
      "author": "James Verniere"
    },
    {
      "text": "What a thrill ride Spielberg has created!",
      "author": "Linda Cook"
    },
    {
      "text": "The film is stuffed with 80's nostalgia - look there's the Teenage Mutant Ninja Turtles, Hello Kitty, Batman and Beetlejuice! - but the film is so visually busy it overloads our senses and cast in such murk it fails to please the eye.",
      "author": "Laura Clifford"
    },
    {
      "text": "For all its faults, the movie has a sense of fun that is hard to ignore, and it's clear that it comes from a place of genuine affection for the referenced material.",
      "author": "Britton Peele"
    },
    {
      "text": "Ready Player One will have you hooting if you did grow up in the 1980's or '90's. And if you didn't, it might make you wish you did.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Spielberg wouldn't be Spielberg if he didn't know how to make this galaxy of pixels alluringly strange, a wow-machine jampacked with cool stuff.",
      "author": "Richard von Busack"
    },
    {
      "text": "Approximately 15 parts fun escapism and one part reflection. In a culture that's obsessed with unearthing obscure references, it will be interesting to see how the movie's fans-and I think there will be many-process the conflicting messages, if at all.",
      "author": "Eric Melin"
    },
    {
      "text": "The movie provides a fun time at the theater, but it's also a wildly uneven ride that runs the gamut from boring to inspiring.",
      "author": "Rob Dean"
    },
    {
      "text": "That's what Ready Player One ends up feeling like: a decent meal with tantalizing hints of something more complex, a Big Mac with Roquefort sprinkled on top.",
      "author": "David Sims"
    },
    {
      "text": "Popular songs from days gone by interspersed into the soundtrack will bring back a lot of memories for most. It's a tremendous feat by Spielberg.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "References to iconic films of the past to satisfy the most demanding of cinematic historians --- Much more entertaining than \"Avatar\".",
      "author": "David Kaplan"
    },
    {
      "text": "An eye-popping, nostalgia-fuelled thrill ride to make any nerd explode with delight.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "The plot's not going to tax anyone over the age of 12, but Spielberg crams the screen with visuals eye-popping enough to make viewers not care .",
      "author": "Bob Mondello"
    },
    {
      "text": "I'm now convinced there isn't any kind of movie Steven Spielberg can't master.",
      "author": "Michael Heaton"
    },
    {
      "text": "And yet, for all those weaknesses, this is a Steven Spielberg film, of the kind only Steven Spielberg can make. Big, raucous, heartfelt, referential, and unabashed in celebrating the culture he has always loved.",
      "author": "Richard Whittaker"
    },
    {
      "text": "For those looking for Ready Player One to condemn the digi-verse as a destructive force against human connection, find another movie. Spielberg's mindbending joyride won't quit even when the head-spinning spectacle hits sensory overload. Game on.",
      "author": "Peter Travers"
    },
    {
      "text": "It's nostalgia for the sake of nostalgia, and by the time its end credits roll, one wonders if there was anything worth being nostalgic about in the first place.",
      "author": "Erik Henriksen"
    },
    {
      "text": "[A] heaping helping of exhilarating summer popcorn spectacle delivered ahead of schedule for springtime... Steven Spielberg at the top of his game...",
      "author": "Mark Hughes"
    },
    {
      "text": "Steven Spielberg shakes off his pop cinema cobwebs with a spectacle that combines state-of-the-art CGI with breakneck action and heartwarming characters.",
      "author": "Jamie Dunn"
    },
    {
      "text": "This is fanboy fellatio and I found it all almost unbearably depressing.",
      "author": "Sean Burns"
    },
    {
      "text": "Rylance infuses \"Ready Player One\" with the warmth and spark of humanity it needs to transcend its VR roots and become something meaningful.",
      "author": "Greg Maki"
    },
    {
      "text": "Une adaptation libre du roman qui en suit les grandes lignes et qui en capture l'essence, mais qui sait aussi s'en éloigner afin de devenir une uvre de cinéma à part entière. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "Filled with intense action scenes leavened by humorous interludes, it's an entertaining ride from start to finish.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "A bountiful, overflowing buffet of just about everything a movie lover would ever want, served up by a superstar director who loves movies just as much as we do.",
      "author": "Neil Pond"
    },
    {
      "text": "The scenes of millions of things happening at once are skillfully made, to be sure, but they're still visually busy to the point of numbness instead of energization. The action has verve but no soul.",
      "author": "Dan Schindel"
    },
    {
      "text": "It's unlikely to find its way in to a Spielberg top 10, but nonetheless it's another crowdpleaser from the master.",
      "author": "Matt Neal"
    },
    {
      "text": "It overuses '80s nostalgia as shorthand for genuine emotional involvement, and it presents us with a rapturous digital wonderworld only to sternly lecture us that reality is the better value.",
      "author": "Ty Burr"
    },
    {
      "text": "What the film lacks in substance, it makes up for in style.",
      "author": "Calvin Wilson"
    },
    {
      "text": "With Ready Player One, Spielberg finally gets into self-spoofing, tackling his dominant era-the 1980s-with a sense of humour, while remaining plenty reverent to the pop culture universe he wrought.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Gamers will get a kick out of this nearly non-stop racing movie loaded with familiar pop culture images.",
      "author": "Steve Crum"
    },
    {
      "text": "A pop culture banquet, Spielberg's latest may fail to thrill, but it sure does please the eye.",
      "author": "Joanna Langfield"
    },
    {
      "text": "A nostalgic thirst trap with no reverence for the pop culture moments it deploys haphazardly.",
      "author": "Cameron Williams"
    },
    {
      "text": "Ready Player One has no obligation to be a rigorous intellectual exercise, even if it amounts to a wasted opportunity...it doesn't have to be so facile, either. Maybe next time the screenwriters shouldn't set the difficulty mode to easy.",
      "author": "Inkoo Kang"
    },
    {
      "text": "Ready Player One is a tender tribute to gamers from a filmmaker who doesn't really appear to understand or empathise with them.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "A thrill-a-minute, virtual reality roller coaster ride riddled with allusions to pop culture and classic computer games.",
      "author": "Kam Williams"
    },
    {
      "text": "The action scenes are thrilling and there is just enough poignant self-critique and meta-commentary to make it more than just empty nostalgia.",
      "author": "Scott Mendelson"
    },
    {
      "text": "There has never been a director better at the craft of cinematic storytelling, and there has never been a story more suited to that craft than this one.",
      "author": "Nell Minow"
    },
    {
      "text": "Conjures plenty of empty spectacle...but doesn't underpin it with characters that move beyond the generic or, more crucially, the productively sharp satire that just maybe could have saved this ain't-it-cool story from itself.",
      "author": "Peter Canavese"
    },
    {
      "text": "Electrifying visuals and state-of-the-art showmanship can't mask the fact that Steven Spielberg's latest is essentially a hollow vehicle.",
      "author": "Anna Storm"
    },
    {
      "text": "Its plot is complexity itself, but its \"kids save the world\" soul is simple and earnest as opposed to earth shattering. With apologies to Bill and Ted, it's an excellent adventure, and let's leave it at that.",
      "author": "Kenneth Turan"
    },
    {
      "text": "For every obscure sci-fi nod, there's a crowd-pleasing Spielbergian trope: Scrappy hero crushing on an independent gal? Check. Friends banding together? Got 'em. Greedy corporate villain? Yep.",
      "author": "Sara Stewart"
    },
    {
      "text": "It's been a while since I've had such a good time watching a movie at the cinema. [Full Review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "Ready Player One won't ever be confused with one of Spielberg's best, but it's a fascinating, frustrating, and entertaining microcosm of his artistic acumen.",
      "author": "J.R. Kinnard"
    },
    {
      "text": "The movie is wall-to-wall pop culture references, and while that's exhausting and tedious, it's also inevitable that you it will manage to push your own specific nostalgia buttons.",
      "author": "Vivian Kane"
    },
    {
      "text": "Confusing exhaustion with exhilaration, after awhile 'Ready Player One' becomes more an assault on the senses than a pleasant diversion.",
      "author": "Frank Swietek"
    },
    {
      "text": "There is never a genuine sense of wonder or excitement to these sights, mainly because there is rarely a real sense of exploration or discovery within this virtual world.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It's a theme park ride but not the rollercoaster Spielberg hopes. More like It's a Small Virtual World, careening through gamer nirvana, jerking viewers to and fro among everything Gen X retro.",
      "author": "Steve Persall"
    },
    {
      "text": "Aside from its sci-fi adventure essence, Player poses semi-significant questions of identity, and the pros and cons of remaking oneself in a digital dimension.",
      "author": "Barry Paris"
    },
    {
      "text": "Ready Player One is like a two hour serving of Frosted Flakes with every toy in the box. The pop culture references are hurled nonstop.",
      "author": "Julian Roman"
    },
    {
      "text": "Competent, occasionally rousing entertainment that nonetheless left me a little bummed.",
      "author": "Gary Thompson"
    },
    {
      "text": "Mr. Spielberg navigates this warehouse with his usual dexterity, loading every frame with information without losing the clarity and momentum of the story.",
      "author": "A.O. Scott"
    },
    {
      "text": "It is boring with an almost nuclear boringness.",
      "author": "Nigel Andrews"
    },
    {
      "text": "The special effects team create technical marvels, which are as thrilling as going on a theme-park ride.",
      "author": "Randy Myers"
    },
    {
      "text": "Steven Spielberg's dizzying, dazzling VR fantasia of pop culture is something to behold. Movie fans will be in hog heaven.",
      "author": "Pete Hammond"
    },
    {
      "text": "In some sense, this is the ultimate development of the fast, smooth, virtuosic style Spielberg has honed over the decades, which borrows heavily from advertising and depends on our instant recognition of fleeting visual cues.",
      "author": "Jake Wilson"
    },
    {
      "text": "Ready Player One is entertaining enough, and it's certainly well-made, but what truly stands out is the filmmaker's prevailing-present sense of bemused disgust at the way his offspring are spending their time.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "A fun popcorn flick and a great free-for-all of pop culture that only someone with Steven Spielberg's muscle could pull together.",
      "author": "Scott Chitwood"
    },
    {
      "text": "Ready Player One should make fans of 80s movies, music and video games geek out, but it - and the convoluted way the story's unveiled - might alienate others.",
      "author": "Glenn Sumi"
    },
    {
      "text": "Frenetic and dense action sequences engage, but seldom thrill. And threats to the heroes' lives don't feel convincing...While Sheridan and Cooke create personable characters, they lack the sizzling chemistry needed to punch through the artifice.",
      "author": "Dann Gire"
    },
    {
      "text": "While Ready Player One will probably never be called a Spielberg classic, watch this movie for the classic feeling that only Spielberg can provide: the simple joy of being swept away at the movies.",
      "author": "Shyama Krishna Kumar"
    },
    {
      "text": "A sci-fi film with a heart, it revolves around true love, friendship and loyalty. Not once does Spielberg's passion for creating spectacular cinematic movie-going experience, overshadow his story's underlying message.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "[Steven] Spielberg delivers this charm that has been missing from film in the digital age and I love that.",
      "author": "Steph Cozza"
    },
    {
      "text": "Ready Player One is enjoyably diverting and speaks to the nerd in all of us in some shape or form.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "The action is breathless and non-stop, both in the virtual reality and the reality reality, but wallowing in '80s nostalgia is only so much fun for so long.",
      "author": "Christy Lemire"
    },
    {
      "text": "What extraordinary visuals this films conjures up, with images that appear and disappear like quicksilver memes.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "An impressive work of technical showmanship, Ready Player One nevertheless falls short of recapturing that old-school Spielberg blockbuster magic.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Extraordinarily entertaining for the most part, with its numerous charms only capable of shining brightest while in the hands of the man who inspired Cline's imagination to begin with.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Spielberg's celebration of the '80s pop culture maelstrom he helped to create is a bizarre, energetically vibrant piece of dystopian science fiction that's as fascinating as it is exasperating.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Spielberg fights mightily to keep that randomness under control, and usually succeeds. He's made a good movie. But the malleability of the story prevents it from being something more.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Ready Player One is a movie designed to be embraced by the geekiest among us, and on that level it earns a high score.",
      "author": "Travis Hopson"
    },
    {
      "text": "It may be just a roller coaster, but it respects itself enough to be the best rollercoaster it possibly can.",
      "author": "Rob Vaux"
    },
    {
      "text": "Like watching high-speed drone footage, flying over a flea market, filled with outdated game consoles, posters, forgotten DVDs and CDs. It should be fun in a geeky way, but there's little humour and character engagement",
      "author": "Liam Lacey"
    },
    {
      "text": "Steven Spielberg has delivered a perfect blockbuster for our nostalgia-driven times.",
      "author": "James Mottram"
    },
    {
      "text": "Spielberg creates two distinct worlds - the brightly-coloured, neon lit OASIS and the dull, bleak 'real world' - and has tremendous fun playing in both of them.",
      "author": "Jo Berry"
    },
    {
      "text": "Ready Player One is vintage Spielberg - a noble hero with good intentions on a quest against the bad guy who just doesn't get it. It's fun, it's entertaining and it's good. It's just not amazing.",
      "author": "Wenlei Ma"
    },
    {
      "text": "Ready Player One feels like a culmination of the era of pop-culture that we live in, a carnival-like celebration of geekdom that only Steven Spielberg could have made.",
      "author": "Rohan Naahar"
    },
    {
      "text": "If \"Ready Player One\" is tedious at times, it's also oodles of fun at others ...",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "By a whisker, Spielberg wins the race against his own material.",
      "author": "Michael Phillips"
    },
    {
      "text": "It's a boldly attempted strike against the monolithic corporatization of fan service, and arguably one of the few films that defines dystopia as nothing less than a marketplace of trademarked, cross-promotional intellectual property.",
      "author": "Eric Henderson"
    },
    {
      "text": "I've seen \"Ready Player One,\" and now my eyeballs need a vacation.",
      "author": "Soren Andersen"
    },
    {
      "text": "It's clear Spielberg is intrigued by VR only in the context of cinematic spectacle; any interesting observations about the virtual realm are incidental.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "This is a hugely entertaining thrill ride that opens up further the more times you press play.",
      "author": "Courtney Howard"
    },
    {
      "text": "Again and again, the movie's setting - and Spielberg's practiced craftsmanship - help turn some of its manifold potential bugs into features.",
      "author": "Glen Weldon"
    },
    {
      "text": "No drama or tension, but in terms of bold, brash, unashamed blockbusting popcorn munchers, Ready Player One entertains.",
      "author": "Adam Fresco"
    },
    {
      "text": "Might mark the beginning of a new era in filmmaking or the end of an old one, but either way it feels like a failed experiment in building a new story on the carcasses of old movies, TV shows and video games.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Ready Player One is a grand act of stage management, but it lacks the clean narrative punch of Spielberg's early masterpieces.",
      "author": "Donald Clarke"
    },
    {
      "text": "It's basically a pop culture lover's dream come true, a film that pays homage to a time that gave us some incredible films, games, and music, all wrapped up as a gift to us from one of the greatest directors of all time.",
      "author": "Jeff Beck"
    },
    {
      "text": "It's good to see Spielberg, at 71, still finding new forms of cinematic language with which to express his humanism.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Spielberg deftly switches between the blinking, bleeping world of the OASIS and the grayer, grittier reality outside. Meanwhile, there's a touch of innocence that never lets us forget this dazzling spectacle is still basically a fairy tale.",
      "author": "Rafer Guzman"
    },
    {
      "text": "So how does it all come together? Pretty marvellously from a visual point of view, maybe less so from one a narrative one.",
      "author": "Peter Howell"
    },
    {
      "text": "So buckle up, take a deep breath and enjoy the ride. It's sensational.",
      "author": "Garry McConnachie"
    },
    {
      "text": "It's The Matrix meets everything!",
      "author": "Fred Topel"
    },
    {
      "text": "Demonstrating his enduring ability to entertain while embracing the latest technology and remaining relevant to a modern audience, Spielberg proves he's still Hollywood's number one player.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "At its best, Ready Player One unfolds like unstructured free time for Hollywood's biggest kid, unleashed in a playground he helped construct, one Amblin entertainment at a time.",
      "author": "A.A. Dowd"
    },
    {
      "text": "It is without a question one of the year's most energetic, visually rewarding, and ultimately exhausting motion pictures.",
      "author": "James Berardinelli"
    },
    {
      "text": "It's bittersweet seeing Spielberg reach the apex of his visual craft in a vapid love letter to consumer culture.",
      "author": "Vincent Mancini"
    },
    {
      "text": "While I'm not sure READY PLAYER ONE stands on its own as a distinct work, it can't be denied that it is what it is and is the best possible version of Cline's novel that could have been realistically done.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Ultimately, a likeable cast, [Mark] Rylance's performance is especially memorable, an imaginative story and Spielberg's ability to meld mirth, mystery and pop culture ensure that Ready Player One is a must-see.",
      "author": "George M. Thomas"
    },
    {
      "text": "Spielberg has pulled off this marketing stunt of a movie without appearing cynical. The story takes place half in the VR world and half in reality, but the characters are, surprisingly, both likeable and accessible.",
      "author": "Chris Newbould"
    },
    {
      "text": "A fun nostalgia bomb, and a great adventure.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "If Ready Player One had been directed by a 26-year-old, the movie world would be flipping out over the new visionary on the map.",
      "author": "Richard Roeper"
    },
    {
      "text": "For those who get their fix through pop nostalgia, \"Ready Player One\" is - for better or worse - an indulgent, dizzying overdose.",
      "author": "Jake Coyle"
    },
    {
      "text": "Steven Spielberg's sci-fi popcorn fantasia Ready Player One feels like a movie made by someone in his 20s rather than his 70s.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "The most enjoyable Steven Spielberg movie in over 15 years",
      "author": "Jason Guerrasio"
    },
    {
      "text": "Steven Spielberg doesn't age. He just levels up.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Ready Player One's an entertaining nostalgia trip that wears its influences proudly but throws them at such dizzying force that sometimes you feel like you're buried under Chuck E. Cheese tokens.",
      "author": "Brian Truitt"
    },
    {
      "text": "Ready Player One is visually pleasing but at the end of the day, it's just another film heavy on Easter eggs and short on character development.",
      "author": "Danielle Solzman"
    },
    {
      "text": "It's a love letter to the things we love by someone who is responsible for some of the things we love most",
      "author": "Robert Kojder"
    },
    {
      "text": "It tricks you into thinking it has the stakes, distracting with the old razzle dazzle and hoping you don't pop open the hood and kick the tires on this story, which turns out to be a lemon.",
      "author": "Katie Walsh"
    },
    {
      "text": "Ready Player One is first and foremost an action adventure movie, and Spielberg's filmmaking instincts wisely sense that audiences will be fascinated by the rich and relentlessly shape-shifting world of OASIS above all else.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Eye-catching images, forgettable development. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "Despite some sensory overload, there's no denying Steven Spielberg is a master at crafting mind-blowing action sequences. Might as well jump to it.",
      "author": "Mara Reinstein"
    },
    {
      "text": "The classic young hero quest, 21st century style.",
      "author": "Angie Errigo"
    },
    {
      "text": "The amount of fun you'll have while watching this is mostly dependent on your skills at playing \"Spot the pop culture reference\". [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "Ready Player One is a love letter to '80s pop culture, jam packed with references... Beneath its retro glad rags, however, the story is deceptively layered.",
      "author": "Vicky Roach"
    },
    {
      "text": "Ready Player One is a pleasurable, fun ride filled with nostalgic references that will bring back the kid in you and make you wish you can stay young like Peter Pan.",
      "author": "Wilson Morales"
    },
    {
      "text": "There's a lot to like about Ready Player One and, at times, it shows glimmers of the kind of fantasy adventure that made the words \"A Steven Spielberg Film\" so sacred to movie fans in the 80s.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Ready Player One is the jazzy, flashy, tripped-out, super-caffeinated kid version of the director many of us grew up loving, and many subsequent directors grew up aping.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Ultimately Ready Player One is like being in a movie-themed pinball machine, as Spielberg delivers an optimistic human story with effects heavy nostalgic referential spectacle on top.",
      "author": "Jack Bottomley"
    },
    {
      "text": "Ready Player One works in different layers and levels, and even if you don't know each of the elements that appear on the screen, the complexity in each of the action sequences is enough to enjoy it. [Full review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "Ready Player One is a thrilling adventure, not a nostalgia parade.",
      "author": "Matt Goldberg"
    },
    {
      "text": "It's dazzling stuff. Recently, a generation of directors has been paying homage to Spielberg's popcorn films, but with Ready Player One he proves with stunning aplomb that no one does Spielberg quite like Spielberg.",
      "author": "Nicholas Barber"
    },
    {
      "text": "The winning factor that binds the film together is the friendship aspect with the players meeting up to deal with IOI's real life maniacal behaviour.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "You're left with the overriding sensation of a master playing someone else's greatest hits.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "This film, and the virtual reality it's set in, is a visual and aural bombardment.",
      "author": "Joseph Walsh"
    },
    {
      "text": "Steven Spielberg brings Ernest Cline's bestselling, nostalgia-fueled sci-fi novel Ready Player One to the big screen, and offers up a beautiful homage with a lot of heart.",
      "author": "Rick Marshall"
    },
    {
      "text": "A magic carpet ride whose trailer (deliberately?) doesn't do it justice, Ready Player One is Steven Spielberg having the most fun in decades as the curator-in-chief of all our yesterdays. And it's contagious.",
      "author": "Harry Guerin"
    },
    {
      "text": "For movie lovers this particular fusion of all of Spielberg's artistic sensibilities provides them with 140 of pure cinematic delight-Full Review in Spanish",
      "author": "Juanma Fernández París"
    },
    {
      "text": "This may be the worst film of Spielberg's career...",
      "author": "Travis Johnson"
    },
    {
      "text": "A love letter to pop culture, movies and fans, filled with that classic Spielberg blockbuster magic. A hell of a ride at the movies! [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "RP1 may not be perfect, but it places Spielberg back at his best.",
      "author": "Jo-Anne Rowney"
    },
    {
      "text": "How much do you really want to think about Back To The Future when you're having a pretty mediocre present watching Ready Player One?",
      "author": "Fionnuala Halligan"
    },
    {
      "text": "Some solid whizz-bang material, but feels like cod roe when it should be caviar.",
      "author": "David Jenkins"
    },
    {
      "text": "Its vision of a world fixated on cultural nursery food has a spiky topicality and an occasionally piercing satirical bite.",
      "author": "Robbie Collin"
    },
    {
      "text": "It's a paean to pop culture, a love letter to the '80s and a glorious, good-hearted adventure that will please kids and remind grown-ups how they felt watching Spielberg's early works the first time around.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "A thrilling joy ride that encompasses every Spielberg trope you can think of and throws them back out at you through some of the most gorgeous scenes you may see on screen all year.",
      "author": "Rebecca Lewis"
    },
    {
      "text": "Ready Player One reminds us yet again of Spielberg's extraordinary versatility. It is made with his customary fluency and shows an offbeat humour you wouldn't normally associate with him.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "... a bumper pack of cinematic Viagra for a film that surges forward improbably for the first wildly propulsive hour, before inevitably collapsing into a flaccid heap, long before its epic, overlong running time is done.",
      "author": "Kevin Maher"
    },
    {
      "text": "Spielberg balances sugar-rush nostalgia with an involving story to create a pure, uncynical, cinematic ride that recaptures the magic of his early films.",
      "author": "Jonathan Pile"
    },
    {
      "text": "Ready Player One is a wild thrill ride that takes pop culture nostalgia to dizzying new heights.",
      "author": "Matthew Turner"
    },
    {
      "text": "It's a tale gloriously steeped in nostalgia, and marks an ambitious undertaking for Spielberg, but it simply couldn't have been left in more reliable hands.",
      "author": "Stefan Pape"
    },
    {
      "text": "Spielberg gets his game face on with spectacular results. One extended scene - no spoilers! - is as fun as cinema gets.",
      "author": "Jamie Graham"
    },
    {
      "text": "Ready Player One is just one big bowl of spectacular popcorn fun. Another Steven Spielberg classic.",
      "author": "Kit Bowen"
    },
    {
      "text": "A fun romp that reinforces Spielberg's reputation as a master of his craft.",
      "author": "Conner Schwerdtfeger"
    },
    {
      "text": "A remarkable crowd pleaser that immeasurably improves upon the book, full of wacked-out dazzling visuals but still easy to follow and enjoy, even for non-gamers.",
      "author": "Leonardo Faierman"
    },
    {
      "text": "[Spielberg] loves pop culture, loves film, loves video games and misfit kids and the 1980s, and Ready Player One is his good-natured tribute to all of those things and, yes, even to himself.",
      "author": "Meredith Borders"
    },
    {
      "text": "Ready Player One, for better or worse, opens with Van Halen's \"Jump\" and never looks back (up to you if that's a good or bad sign).",
      "author": "Matt Donato"
    },
    {
      "text": "You want total immersion into a fantasy world? Spielberg is definitely your guy.",
      "author": "Joe Gross"
    },
    {
      "text": "It isn't so much a movie about loving old video games and other cultural artifacts. It's about loving to love those things, which makes Steven Spielberg's film adaptation of the bestselling novel feel hollow.",
      "author": "Evan Narcisse"
    },
    {
      "text": "Spielberg's dizzying foray into '80s pop culture fandom is a return to pure pop escapism.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "The cultural references crammed in everywhere should have given the movie heart, but instead they feel like contractual obligations.",
      "author": "Matthew Razak"
    },
    {
      "text": "While it's not particularly emotional and I was disappointed by how many questions are left open by its shallow visits to the real world, it's still a lot of fun.",
      "author": "Alanah Pearce"
    },
    {
      "text": "The adaptation of the Ernest Cline novel is a supremely entertaining crowd-pleaser, and a film that brings something to the table everyone should be wistful for: that classic Spielberg touch.",
      "author": "David Crow"
    },
    {
      "text": "There is a heart beating at the center of The Goonies, E.T., Raiders of the Lost Ark, and more-but in Ready Player One, audiences will instead find a gleaming, digital, golden Easter egg... for many, that will be enough.",
      "author": "Joanna Robinson"
    },
    {
      "text": "Ready Player One is a nostalgic trip back to all things 80's and like the Oasis, the film gives the audience a chance to escape reality for a few hours.",
      "author": "Ashley Menzel"
    },
    {
      "text": "When you're watching Ready Player One, you can almost feel the legendary director sitting next to you, laughing at the references, thrilled with the action, and eating his popcorn. You definitely need popcorn for this one.",
      "author": "Brian Tallerico"
    },
    {
      "text": "The human frailties behind the game avatars is a reliable well of humor for Ready Player One, and the script takes full, hilarious advantage.",
      "author": "Tasha Robinson"
    },
    {
      "text": "A groundbreaking visual spectacle that combines all types of popular media and rolls them into one massive and must-see motion picture experience.",
      "author": "Scott Menzel"
    },
    {
      "text": "The cinematic equivalent of a pop-culture mashup tee.",
      "author": "Britt Hayes"
    },
    {
      "text": "Ready Player One is one of the most egregiously set piece-driven slices of pop cinema we've seen in a long while.",
      "author": "Jacob Knight"
    },
    {
      "text": "It is without question the most entertaining film Spielberg has made since Catch Me If You Can.",
      "author": "Marlow Stern"
    },
    {
      "text": "While the movie is visually whimsical with its design and neon colors, the weakness of the source material still pokes out.",
      "author": "Monica Castillo"
    },
    {
      "text": "At a certain point, though, Ready Player One wants to be appreciated as a film as well as a movie, no matter what Spielberg says. And that's where it begins to falter.",
      "author": "Dan Caffrey"
    },
    {
      "text": "An overabundance of pop culture references can't save Ready Player One from its own mediocrity",
      "author": "Jonathan Barkan"
    },
    {
      "text": "It's an accomplished and intermittently hypnotic movie. Yet you may feel like you're occupied more than you are invested.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "A rollicking adventure through worlds both bleak and fantastic, Steven Spielberg's Ready Player One makes big changes to the specifics and structure of Ernest Cline's best-selling novel but keeps the spirit and level-up thrills intact.",
      "author": "John DeFore"
    },
    {
      "text": "It does not exist to stretch your mind (it does stretch your time, running a bit too long in the third act) but like the OASIS, it's a wonderful piece of escapism. Sometimes, a vacation from anything meaningful does make for an interesting ride.",
      "author": "Joi Childs"
    },
    {
      "text": "Eventually, \"Ready Player One\" becomes the very thing its characters admire, a preponderance of commercial entertainment smashed together into a singularity of blockbuster chaos.",
      "author": "Eric Kohn"
    }
  ],
  "release_year": 2018,
  "duration": 140,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "age_rating": "PG-13",
  "synopsis": "In 2045, the planet is on the brink of chaos and collapse, but people find salvation in the OASIS, an expansive virtual reality universe created by James Halliday. When Halliday dies, he promises his immense fortune to the first person to discover a digital Easter egg that's hidden somewhere in the OASIS. When young Wade Watts joins the contest, he finds himself becoming an unlikely hero in a reality-bending treasure hunt through a fantastical world of mystery, discovery and danger.",
  "popularity": 7.7,
  "poster_url": "https://resizing.flixster.com/Xs0venIQaQluFsejeoPx8hRsE4s=/68x102/v2/https://resizing.flixster.com/sULTgSQCALfb2of-x_A1_grhxb8=/ems.cHJkLWVtcy1hc3NldHMvbW92aWVzLzMwN2EyNzk3LWY1OTAtNGU4OS1hYmE3LWM4ODMyNWI0YTVkZi53ZWJw"
}