{
  "movie_name": "Red Notice",
  "movie_id": "red_notice",
  "total_reviews": 175,
  "reviews": [
    {
      "text": "Netflix’s biggest investment ever in a film absolutely pays off.",
      "author": "Branyan Towe"
    },
    {
      "text": "The worst thing that can be written about Red Notice is that it is just fine when viewed from a laptop and a bigger screen would have added nothing to it.",
      "author": "Zach Youngs"
    },
    {
      "text": "The biggest surprise of 2021 for me… none of the trailers really grabbed my attention but damn does the movie work. With its charm, great humor, & excellent chase sequences that add some amazing adrenaline ! Give me more of The Rock, Gal, & Ryan!!",
      "author": "Zach Pope"
    },
    {
      "text": "If you want some substance to your fun that calls to memory Spielberg’s Indiana Jones films or even the weaker, but still engaging, National Treasure movies, then this isn’t your movie.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Red Notice is an enjoyable action diversion.",
      "author": "M.N. Miller"
    },
    {
      "text": "Red Notice is one of those absurd Abbas-Mustan-style campfests with so many random twists and double-crosses that only great actors or terrible actors can pull them off.",
      "author": "Rahul Desai"
    },
    {
      "text": "Efficiently kills a couple of hours without stealing our hearts.",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Red Notice is vastly less than the sum of its parts, with the central trio saving it from mediocrity. It's a perfectly acceptable and decently entertaining 200 million action epic, but nothing more.",
      "author": "Scott Campbell"
    },
    {
      "text": "The most expensive and successful Netflix original film yet, watching Red Notice is like watching the feature-length version of a fake movie inside another movie; its cliched, over-the-top, and plays out like a parody of itself.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "This blatantly silly movie is the absolute best possible version of itself  it's funny, has some exciting chase scenes, and is altogether the Platonic ideal of a 7/10 movie.",
      "author": "Alex Hudson"
    },
    {
      "text": "The cheesy elements combined with the flat characters, that were brought to life by extraordinary talent, left Red Notice struggling from the very start.",
      "author": "Lyra Hale"
    },
    {
      "text": "Theres a cold, almost algorithmic quality to the film and its performances, to the extent that calling Red Notice an original conceit feels disingenuous.",
      "author": "Miles Surrey"
    },
    {
      "text": "it is definitely entertaining and hits a few high notes here and there, especially when Reynolds's banter runs headlong into Dwayne Johnson's straight-man stoicism",
      "author": "James Kendrick"
    },
    {
      "text": "Red Notice delivers on its promise; good action, charm, absurd journey. A film worth watching for a goofy good time.",
      "author": "Rosa Parra"
    },
    {
      "text": "As mindless entertainment built on silly jokes, a thin plot, visual effects and window dressing, Red Notice is a 117-minute distraction, easily forgotten in half that time.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Red Notice is proof that one can hire the best talent and put them in a room, but the effort amounts to wasted potential without a good script or strong direction.",
      "author": "Marriska Fernandes"
    },
    {
      "text": "...a relentlessly slick endeavor that's rarely, if ever, as engrossing or exciting as one might've anticipated...",
      "author": "David Nusair"
    },
    {
      "text": "Escapist fun is rarely smart and doesn't carry much depth, but the nice thing here is that the humor outweighs the mindless action.",
      "author": "Dan Buffa"
    },
    {
      "text": "I also have already forgotten it, and I bet you do, too, ten minutes after seeing it.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Rawson Marshall Thurber's clever script is a shell game of plot twists and head fakes which keeps daring you to notice, or care, that you're watching a scam, a forgery and a fiction. It",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Perfectly cast and perfectly balanced between comedy and thrills. Sign me up for the sequel.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "After about 30 minutes of this overblown, under-baked product, I decided that life's too short and hit the off button.",
      "author": "Steve Murray"
    },
    {
      "text": "Red Notice appears to have all the right ingredients for a franchise-ready adventure, yet something's notably off when the pieces are mixed together, which makes it a real downer.",
      "author": "Yvonne Bohwongprasert"
    },
    {
      "text": "I watched this 117-minute movie on a rainy afternoon and it was just about perfect for the time and place. The final scene suggests a sequel. I hope it happens.",
      "author": "Stephen Romei"
    },
    {
      "text": "Three of my very favorite actors in the business. And by the end of this, I hated all three...the plot is lazier than their performances...",
      "author": "Shawn Edwards"
    },
    {
      "text": "Frequently feels like three distinct \"brands\" being brought together, rather than three actors falling in love with a script.",
      "author": "Larry Carroll"
    },
    {
      "text": "Gadot seems to be having the most fun here, letting out the evil side that we never see her display as Wonder Woman. But even with her wrapping a sensuous leg around Johnson on a dance floor, there's no chemistry on view.",
      "author": "Sean P. Means"
    },
    {
      "text": "The three stars -- and the audience -- deserve better.",
      "author": "Micheal Compton"
    },
    {
      "text": "The three leads have chemistry to burn, but even that fails to justify the somewhat presumptuous ending suggesting a sequel.",
      "author": "Al Alexander"
    },
    {
      "text": "What should have been a guaranteed hit turns out to be a disposable dud.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Everyone knows [the film is] all about having a good time. For someone to remember what happened during that time may still be asking a lot. [Full review in Spanish]",
      "author": "Alberto Corona"
    },
    {
      "text": "A movie with three major movie stars, which is utterly forgettable in just about every way.",
      "author": "Stephen Silver"
    },
    {
      "text": "A high gag quotient (mostly curse-free, thankfully) and zippy pacing from writer/director Rawson Marshall Thurber mark Red Notice as a pleasing assembly-line time killer that upshifts when the action kicks in and the camera takes on a life of its own.",
      "author": "Jim Schembri"
    },
    {
      "text": "It's fun for a while, but goes on too long for its own good.",
      "author": "Tom Meek"
    },
    {
      "text": "Only undemanding fans will enjoy this hyper-twisting romp and return for the sequel that's set up at the end.",
      "author": "Rich Cline"
    },
    {
      "text": "In terms of authenticity, \"Red Notice\" isn't even a passable fake.",
      "author": "Blake Howard"
    },
    {
      "text": "Generic in every way, Red Notice isn't a film you want to give notice to.",
      "author": "Natasha Alvar"
    },
    {
      "text": "Red Notice has never pitched itself as anything other than a fun treasure hunt put together by pals. It's an easy, non-taxing watch. It isn't particularly memorable though.",
      "author": "Jonathan Roberts"
    },
    {
      "text": "A slick, entertaining action comedy romp that's definitely worth checking out. The Johnson-Gadot-Reynolds trio is awesome. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "One senses that instead of a script, the filmmakers worked off a binder containing reams of Netflix data and instead of storyboards there were pie charts.",
      "author": "Mark Keizer"
    },
    {
      "text": "Not quite the success Netflix would have been banking on even if it isn't entirely awful. It isn't far off though, and it can thank its lead trio for barely keeping it afloat.",
      "author": "Matt Hudson"
    },
    {
      "text": "Largely works because of the charisma of its stars, not because of their acting. [Full review in Spanish]",
      "author": "Juan Pablo Russo"
    },
    {
      "text": "[Dwayne 'The Rock' Johnson] seems caught up in these projects for the whole family... that are as anabolic as they are aimless. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Only benefits slightly from Reynold's ingenious humor. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "[H]its all the notes of an action blockbuster, but each note rings just a bit false. And as those false notes pile up, things get cacophonous...Red Notice might be a heist movie, but in the end, the most valuable thing stolen might be your time.",
      "author": "Allen Adams"
    },
    {
      "text": "Red Notice is entertaining enough, thanks to its leads, but there is no originality. Not particularly kid friendly for the younger crowd due to sexual innuendos.",
      "author": "Tania Lamb"
    },
    {
      "text": "Red Notice is uninspired, uninteresting, and unforgivably bland. Its only redeeming quality is its stars and, even then, their talents are underutilized",
      "author": "Caitlin Kennedy"
    },
    {
      "text": "The mere idea of our biggest movie stars using their hard-earned clout to push boundaries seems like something that would get you slapped for uttering in a Hollywood agency these days. To experience that sensation, all you need to do is watch Red Notice.",
      "author": "Rohan Naahar"
    },
    {
      "text": "Say what you will about Red Notice - a chemistry-free, egocentric, poorly written, cartoonishly dull, CG backdrop-filled flick - but it's currently on Netflix.",
      "author": "Rob Hunter"
    },
    {
      "text": "A nondescript action movie. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A lifeless, impersonal movie with three great stars at their most lifeless and impersonal",
      "author": "Aurora Amidon"
    },
    {
      "text": "A-list Hollywood stars have zero chemistry in an utterly tiresome and contrived heist flick. Red Notice ends up looking like nothing more than flashy costume jewelry.",
      "author": "Julian Roman"
    },
    {
      "text": "Red Notice lacks depth when it comes to the story, but still an enjoyable movie for the stellar cast alone.",
      "author": "Shah Shahid"
    },
    {
      "text": "Despite its ostentatious budget, or perhaps precisely because of it, Red Notice is a film that takes all the easy paths. [Full review in Spanish]",
      "author": "Luis Angel H. Mora"
    },
    {
      "text": "I don't expect every movie to be award-worthy, but even 'brainless' movies ought to still offer some kind of entertainment value. Red Notice is such an exorbitant waste of talents and resources.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Tepid and tedious - it's a total waste of time and talent.",
      "author": "Susan Granger"
    },
    {
      "text": "It's funny, action-packed, and fun, which is exactly as it should be.",
      "author": "Kyle Bain"
    },
    {
      "text": "It's the kind of forgettable, cookie-cutter comic adventure likely to be viewed with half-a-smile and half-a-grimace throughout its entire runtime.",
      "author": "Mike Massie"
    },
    {
      "text": "There's turn off your brain and enjoy movies, and then there's this.",
      "author": "Kristy Puchko"
    },
    {
      "text": "What's fascinating about Red Notice is that it's a film that thinks that just by tossing these three megastars into situations together, magic will result.",
      "author": "Steven Prokopy"
    },
    {
      "text": "...this Nazi memorabilia frolic through meaningless landscapes spanning different continents seems as frivolous as Netflix's bigger films have ever been.",
      "author": "Taylor Baker"
    },
    {
      "text": "If the director and actors don't seem engaged in trying to make a movie that does anything but hit a bunch of buddy comedy marks, there's no reason for an audience to bother.",
      "author": "Robert Levin"
    },
    {
      "text": "...it's not that Red Notice is done badly, it's just so vanilla that it leaves no taste whatsoever...",
      "author": "Eddie Harrison"
    },
    {
      "text": "There's no personality here, no unique traits or artistry that would make it the least bit interesting. It's the equivalent of cotton candy.",
      "author": "Allen Almachar"
    },
    {
      "text": "\"Red Notice\" should pass without much notice.",
      "author": "Russ Simmons"
    },
    {
      "text": "Every single complaint you're gonna have is absolutely 100% true. But I had a fun time. In this day and age, it's nice to just be able to watch a movie and enjoy it.",
      "author": "Kevin Carr"
    },
    {
      "text": "Red Notice is limp and dull, and does more to showcase the shortcomings of each of its marquee idols than it does to highlight their bankable charisma.",
      "author": "Richard Lawson"
    },
    {
      "text": "The problem is that this movie is built on nothing but making references to [its influences].",
      "author": "Amy Nicholson"
    },
    {
      "text": "I liked it in spite of myself... The chemistry between these stars is amazing.",
      "author": "Wade Major"
    },
    {
      "text": "Witless, lifeless, shameless, hopeless, useless - pointless.",
      "author": "John Serba"
    },
    {
      "text": "It's not called Red Notice (Taylor's Version), all descriptive and emotional and important. Red Notice needs few words: Action good. Lines funny. Movie fun enough.",
      "author": "Matt Pais"
    },
    {
      "text": "[A] witless, bombastic stab at a globe-trotting comic adventure...which-appropriately, given its MacGuffins-lays one huge egg.",
      "author": "Frank Swietek"
    },
    {
      "text": "Reynolds does his silky-voiced sarcasm thing, Johnson counters with bullet-headed seriousness, and Gadot sidles between them, charming and dangerous. They look like they're having a blast.",
      "author": "Chris Knight"
    },
    {
      "text": "I love me a solid throwback, and for me, I was like, \"Whoa, it's like 1999 all over again!\"",
      "author": "Jeremy Jahns"
    },
    {
      "text": "I just wish I could cite a single moment that made me laugh out loud, or surprised me, or got my heart racing the way any of the movies Red Notice has digested...",
      "author": "Norman Wilner"
    },
    {
      "text": "Like the plot of the film itself, none of the many bullets that whizz around ever seem to find their targets.",
      "author": "Adam Mullins-Khatib"
    },
    {
      "text": "Red Notice looks slick and boasts attractive A-list actors pulling fantastic stunts in gorgeous locations around the globe. It will find its audience.",
      "author": "Jennifer Green"
    },
    {
      "text": "The film ends up coming off like tasty comfort food in that you know what you're getting, it all goes down easily, and you'll likely feel satisfied after consuming it.",
      "author": "Jim Judy"
    },
    {
      "text": "Ocean's Eleven meets National Treasure. Not one of my favorite movies of the year, but I enjoyed it.",
      "author": "Dan Murrell"
    },
    {
      "text": "Do you know how little a movie has to do to succeed with [this] cast and premise? If they just stood around quipping for two hours, I'd still give it a positive rating.",
      "author": "Sean Collier"
    },
    {
      "text": "It's one of the most insufferable and empty things you could ever hope to avoid.",
      "author": "Matt Lynch"
    },
    {
      "text": "The Red Notice cocktail of Johnson, Gadot and Reynolds may look delicious from a distance, but an ounce of originality is the missing ingredient that might have made it go down a bit smoother.",
      "author": "Tom Santilli"
    },
    {
      "text": "The utterly lifeless, disposable, and bland, \"Red Notice\" doesn't feature a lot of personality and hardly registers a pulse.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Destined to be the most-watched, least-remembered film of our age.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Overall, Red Notice is pretty much a forgettable big-budget Netflix film.",
      "author": "Casey Chong"
    },
    {
      "text": "Action movies are supposed to be fun, but Red Notice delivers nothing but overwhelming disappointment at every turn.",
      "author": "Louisa Moore"
    },
    {
      "text": "Everything that can be seen as what's wrong with Netflix's original films can be found in Red Notice, an awful adventure movie.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "This is the potential straight A student settling for Bs simply because it requires less work. It still gets the job done, but the payoff could be even greater.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Red Notice is not a movie. It is a $200 million existential crisis in light.",
      "author": "Scott Tobias"
    },
    {
      "text": "For Netflix, it's all about the number of subscribers they can pull in, with the combined might of Deadpool, The Rock, and Wonder Woman. Red Notice is a criminal waste of money and everyone's time-except those who got paid $20 million.",
      "author": "Akhil Arora"
    },
    {
      "text": "The two-hour runtime feels almost short for a big-budget blockbuster, but that doesn't mean that it's time well spent.",
      "author": "Steve Katz"
    },
    {
      "text": "It's ok for what it is, perfect for spending a couple of hours watching these three doing what we like to see them doing, without expecting more than that. [Review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "Only Gadot has enough star quality to make Red Notice sparkle for a few moments, but to be honest, had I not been reviewing the film, I would have flicked it off long before she made her first entrance.",
      "author": "Hannah Brown"
    },
    {
      "text": "Red Notice is carried solely through star power, as our three leads deliver on some great banter. The film fun enough.",
      "author": "Austin Burke"
    },
    {
      "text": "An action crime caper with barely an original bone in its body, Red Notice is made palatable, even watchable, by the easy charm of its stars.",
      "author": "Paul Whitington"
    },
    {
      "text": "Red Notice is potentially one of the most formulaic and bland - yet surprisingly fun - action-comedies Netflix has churned out yet",
      "author": "Nicola Austin"
    },
    {
      "text": "A classic of either the heist or action-comedy genre it is not, but, it works as a forgettable, unchallenging watch.",
      "author": "Aine O'Connor"
    },
    {
      "text": "To describe Red Notice as a whole lot of nothing could be understood as praise, up to a point. By design, there are no ideas worth mentioning in Rawson Michael Thurber's strenuously breezy caper.",
      "author": "Jake Wilson"
    },
    {
      "text": "It's a derivative flick that relies too much on Reynolds' incessant barrage of sarcastic one-liners to keep the audience entertained.",
      "author": "Melody McCune"
    },
    {
      "text": "There's something incredibly deflating about all of this, from the waste of precious screen-talent resources to the sense that you're watching the last gasp of an age-old formula. It is like staring at a bright, shiny epitaph for two hours.",
      "author": "David Fear"
    },
    {
      "text": "When the story winks at Raiders of the Lost Ark, the effect is to remind you of other, older spectaculars made in better faith.",
      "author": "Danny Leigh"
    },
    {
      "text": "Uninterested in world building or creating any sense of stakes, \"Red Notice\" is merely an expensive brandishing of star power - only the stars haven't got it in them.",
      "author": "Beatrice Loayza"
    },
    {
      "text": "You can have The Rock, Wonder Woman, and Deadpool, but it doesn't mean much if they don't have clever things to say and meaningful things to do.",
      "author": "James Berardinelli"
    },
    {
      "text": "The trio brings just enough charm and good times to the story to make it a check your brain at the door old fashioned fun and that's why I gave Red Notice three stars, one star each for each of its stars, Reynolds, Gadot and Johnson.",
      "author": "Richard Crouse"
    },
    {
      "text": "Turn off your brain, and you might have at least some fun with Red Notice. However, this brawny, bloated blockbuster is too short on new ideas and wastes its A-List cast for a cookie-cutter action flick that makes your Netflix subscription feel criminal.",
      "author": "Josh Wilding"
    },
    {
      "text": "It's all too appropriate that Netflix's biggest blockbuster to date offers mediocre pleasures that feel wholly algorithm-driven. It's never less than watchable, but shoots so broadly for every conceivable demographic as to shirk creativity entirely.",
      "author": "Shaun Munro"
    },
    {
      "text": "Red Notice skims by without trying anything new. Johnson, Reynolds, and Gadot have all made better films showcasing each of their strengths if that's what you're in the mood for.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Johnson is one of the few stars who actually gets expensive, original action films made, but of late he's tended toward disappointingly safe material. Red Notice is his most generic effort yet.",
      "author": "David Sims"
    },
    {
      "text": "The cinematic equivalent of driving with your window rolled down while chugging a Red Bull, it's worth bumping all the way to the top of your queue.",
      "author": "Phil Villarreal"
    },
    {
      "text": "While Ryan Reynolds is doing everything he can to keep us paying attention, Dwayne Johnson has never been more late-stage Bruce Willis in a film that plunks together scenes with all the verve of an SNL bulletin board announcing the next show.",
      "author": "Erik Childress"
    },
    {
      "text": "I gave Red Notice my full attention, and all it gave me back was a headache. As far as I'm concerned that says it all.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "A lot of fun! Dwayne Johnson & Ryan Reynolds are a great team. The movie is very fun and energetic. One of Netflix's best films.",
      "author": "Grace Randolph"
    },
    {
      "text": "Enjoy Red Notice as pure eye-candy entertainment but don't expect any more than that.",
      "author": "Trevor Johnston"
    },
    {
      "text": "Reportedly the most expensive Netflix original production to date, Red Notice would have benefited if some of its $200m budget had been spent on untangling the screenplay.",
      "author": "Wendy Ide"
    },
    {
      "text": "A non-sensical and dull but glossy heist action/comedy.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Its characters may be cookie-cutter, but the charisma of Johnson, Reynolds, and Gadot oozes off the screen...",
      "author": "Michael Ahr"
    },
    {
      "text": "Red Notice may be the biggest movie Netflix has ever backed, but its blockbuster budgets and intense action sequences can't cover the lack of chemistry between its stars or the influence of other films on its screenplay.",
      "author": "Collier Jennings"
    },
    {
      "text": "Red Notice doesn't quite coalesce into something that could become a timeless classic of its own, but it provides plenty of entertainment.",
      "author": "Rachel LaBonte"
    },
    {
      "text": "What makes Red Notice stand out, as a heist tale, is Reynolds' comic touch that injects new life into what could've been just another dull by-the-books Netflix original.",
      "author": "Ben Rolph"
    },
    {
      "text": "Pretty standard jet setting heist mixed with action movies, but Red Notice is often lacking in charisma, big action set pieces, and genuine fun.",
      "author": "Leo Brady"
    },
    {
      "text": "The three megastars carry the entire film on their shoulders and end up buried alive under the weight of it all.",
      "author": "Valerie Complex"
    },
    {
      "text": "Red Notice doesn't try to reinvent the action/comedy genre and it's all the better for it. It's a breezy and confident crowd-pleaser totally lacking in pretense which nods and winks at the camera the entire time. It's a total blast from start to finish.",
      "author": "Michael Clark"
    },
    {
      "text": "Dwayne Johnson, Gal Gadot and Ryan Reynolds are barely acting in this over-the-top action movie.",
      "author": "Richard Roeper"
    },
    {
      "text": "Red Notice embraces a typical banter-chase-banter-fight-banter-explosion formula, and its script is split evenly between Reynolds smart-assery and functional exposition.",
      "author": "Nick Schager"
    },
    {
      "text": "Red Notice spins enough breezy escapism out of its aggressively by-the-book design.",
      "author": "Matt Conway"
    },
    {
      "text": "Feels like a throwback to big-screen blockbusters from at least a generation ago.",
      "author": "James Croot"
    },
    {
      "text": "It's a series of set pieces flimsily bolted together with Reynolds doing the Reynolds thing, Johnson doing the Johnson thing, and Gadot doing the Gadot thing.",
      "author": "Richard Whittaker"
    },
    {
      "text": "The net effect is mildly enjoyable, creating a throwback caper film that showcases its stars doing what they do best, or rather for which they're best known.",
      "author": "Brian Lowry"
    },
    {
      "text": "Together the trio have good chemistry, riffing on a number of well-worn action movie tropes and checking all the boxes most of us look for in our popcorn escapism.",
      "author": "Keith Garlington"
    },
    {
      "text": "​​Looking for an escape with action, adventure, international locales, snarky comments and snappy comebacks? Look no further than Rawson Marshall Thurber's ridiculously fun caper.",
      "author": "Thelma Adams"
    },
    {
      "text": "Elaborate gags and one-liners up the fun in this hokey, old-school wanna-be from writer-director Rawson Marshall Thurber.",
      "author": "Anne Brodie"
    },
    {
      "text": "Doughy, but easy to digest.",
      "author": "Brian Viner"
    },
    {
      "text": "Rawson Marshall Thurber's lightweight romp is a charming tale of cons and double-crosses and witty quips that relies heavily on the easy chemistry between its three stars.",
      "author": "Jana Monji"
    },
    {
      "text": "Feels less like a caper than a live-action cartoon, a grab bag of strenuously madcap shenanigans loosely gathered into movie form.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "The relentless bickering between Reynolds and Johnson is wearisome rather than hilarious.",
      "author": "Kevin Maher"
    },
    {
      "text": "While the film's playful tone and charisma of its stars try to carry this particular heist movie, the story is unengaging, and at times cringey.",
      "author": "Nicole Ackman"
    },
    {
      "text": "Red Notice is one of those movies that mistakes continual surprise plot twists for actual storytelling.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Johnson seems to have prepped for Red Notice by indulging in a diet completely devoid of charisma. As for Reynolds, he delivers his signature quips with all the conviction of someone still rubbing the sleep from their eyes after waking from a coma.",
      "author": "Brent Hankins"
    },
    {
      "text": "Coasts entirely on the charm of its stars. A wafer thin clone of much better movies.",
      "author": "Chris Bumbray"
    },
    {
      "text": "The very definition of mediocre Netflix blockbusters prioritizing A-Hollywood talent and explosions above all else. There's nothing glaringly terrible here, just decidedly formulaic proceedings without a voice",
      "author": "Robert Kojder"
    },
    {
      "text": "Something about the film feels almost already too old-fashioned for this post pandemic era.",
      "author": "Linda Marric"
    },
    {
      "text": "A depressing reminder of what Hollywood considers \"original\" material these days, \"Red Notice\" plays one of those self-consciously convoluted, ultimately derivative long cons that strain so hard to seem breezily insouciant they wind up wearing you out.",
      "author": "Justin Chang"
    },
    {
      "text": "Red Notice is an obnoxious, desperately unfunny bore that wastes a trio of talented leads. Dumb movies can be entertaining, but sometimes they're just flat-out bad.",
      "author": "Mark Cassidy"
    },
    {
      "text": "As for big-budget Netflix originals, it's better than \"Bright\" and \"6 Underground,\" though considering how awful those entries were, I'm not sure \"Red Notice\" should take that as a complement.",
      "author": "Nate Adams"
    },
    {
      "text": "Art heist movies should be glam and sexy ... but this is dull and tedious.",
      "author": "James Mottram"
    },
    {
      "text": "Enjoy it for what it is, because it doesn't aspire to be anything other than a reason to keep your Netflix subscription active a couple more hours.",
      "author": "Travis Hopson"
    },
    {
      "text": "Red Notice isn't just serious fun, it's also quite silly fun, and all the better for it.",
      "author": "Edward Douglas"
    },
    {
      "text": "The movie star isn't dead. It just seems that way from the exhaustion of propping up disposable material like Red Notice.",
      "author": "Mark Dujsik"
    },
    {
      "text": "So much money, so much charm, so much movie, and yet it adds up to so very little.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Featuring a trio of supposed movie stars who lack the panache or charisma of true marquee headliners, Red Notice is another visually ghastly bid at building a franchise on the back of breathtakingly boring action sequences.",
      "author": "Robert Daniels"
    },
    {
      "text": "The winks, the nudges, the stunts and the surprises come in such a barrage that at some point the charm leaks out of Red Notice, leaving only exhaustion behind.",
      "author": "Alonso Duralde"
    },
    {
      "text": "RED NOTICE is an expensive but lifeless approximation of a Hollywood blockbuster banking on viewers trading quality for convenience.",
      "author": "Scott Mendelson"
    },
    {
      "text": "It's not that the movie is an insult, because insults at least require effort, and that's more than \"Red Notice\"is willing to offer. And an insult has the potential to be memorable, which is more than anything in \"Red Notice\" has going for it.",
      "author": "Adam Graham"
    },
    {
      "text": "This isn't rocket science and, to Thurber's credit, no attempts are made to make Red Notice anything more than it is or should be. It's the best kind of stay-home-and-watch-Netflix movie you could hope for.",
      "author": "Charlie Ridgely"
    },
    {
      "text": "Red Notice is nothing more or less than exactly what you'd expect - a sequence of loosely tied together action scenes, smart aleck (but not particularly intelligent or original) dialogue, and three stars playing to type.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "A gargantuan doohickey of digitally shiny nothingness with all the grit of a cleanroom. It plays like a nine-figure experiment in re-targeting viewers' recollections of every other popular movie Dwayne Johnson, Ryan Reynolds and Gal Gadot have made.",
      "author": "Nick Rogers"
    },
    {
      "text": "This may have been Netflix's largest investment in a movie ever, but in the end, it's the viewer who gets what they paid for.",
      "author": "Matt Singer"
    },
    {
      "text": "What can $200 million get you these days? How about an ultra-glossy, ultra-derivate action-adventure designed solely to launch a franchise?",
      "author": "Chris Evangelista"
    },
    {
      "text": "Johnson, Gadot, and Reynolds are basically making a Jackie Chan movie with \"Red Notice,\" which isn't advanced filmmaking by any means, but has a candied appeal for fans of nonstop quipping and large-scale stunt set pieces.",
      "author": "Brian Orndorf"
    },
    {
      "text": "There are certain things that money can't buy. As it turns out, an infectious sense of fun is one of them.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "Something is broken in Hollywood.",
      "author": "Barry Hertz"
    },
    {
      "text": "A derivative action film that should be much smarter and sexier than it ends up being.",
      "author": "Tara Bennett"
    },
    {
      "text": "Exactly what you'd expect from a crime-caper action-comedy pairing Dwayne Johnson and Ryan Reynolds. Nothing more, nothing less.",
      "author": "Dan Jolin"
    },
    {
      "text": "The leads deliver to order in this flimsy but playful frolic. A tankful of banter keeps the engine ticking nicely.",
      "author": "Kevin Harley"
    },
    {
      "text": "\"Red Notice\" works surprisingly well for what it is.",
      "author": "Peter Debruge"
    },
    {
      "text": "\"Red Notice\" is a lot of fun, if often in spite of itself.",
      "author": "David Ehrlich"
    },
    {
      "text": "Writer-director Rawson Marshall Thurber's busy crime caper has more glossy industrial sheen than unique personality. But it's diverting enough to justify the sequel so clearly set up in its final scenes...",
      "author": "David Rooney"
    },
    {
      "text": "It has a certain clomping, smart-alecky entertainment value, wedded to the meta appeal of watching three A-listers juggle all the twists with ease, before walking off into the sunset with silly money.",
      "author": "Tim Robey"
    },
    {
      "text": "It almost plays like a pastiche of a Hollywood blockbuster, like a bot consumed the last 20 years of studio fare and spat out a facsimile as an experiment.",
      "author": "Benjamin Lee"
    },
    {
      "text": "A pleasantly lousy movie that some people, if they look at the screen and squint really hard, might mistake for something decent.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The final product never quite lives up to that powerhouse trio. What should be a rollicking round-the-world adventure turns into a bit of a dull trudge.",
      "author": "Ian Sandwell"
    },
    {
      "text": "Reynolds and Johnson have great comedic chemistry but Gadot never really finds her footing. That said, this movie is a lot of fun thanks to the action & buddy comedy feel.",
      "author": "Tessa Smith"
    },
    {
      "text": "The film is a lifeless pastiche of various blockbuster action-movie styles from the past four decades.",
      "author": "Keith Watson"
    },
    {
      "text": "[Red Notice} is a globe-trotting affair on par with Mission: Impossible, James Bond, and Indiana Jones.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Red Notice ends up being far more fun and exciting than you might expect heading into it.",
      "author": "Sean O'Connell"
    }
  ],
  "release_year": 2021,
  "duration": 117,
  "genres": [
    "Action",
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "In the world of international crime, an Interpol agent attempts to hunt down and capture the world's most wanted art thief.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/lAXONuqg41NwUMuzMiFvicDET9Y.jpg"
}