{
  "movie_name": "Shrek",
  "movie_id": "shrek",
  "total_reviews": 212,
  "reviews": [
    {
      "text": "What's not to love about Dreamworks' long-awaited digital delight? It's a hip, fresh and deliciously subversive spin on classic fairy tales.",
      "author": "Michael D. Reid"
    },
    {
      "text": "Smart, funny, deliciously hip, irreverent and just plain lovable, it's for everyone from pre-school to post retirement.",
      "author": "Dan DiNicola"
    },
    {
      "text": "Too much of \"Shrek\" seems like gags dreamed up by jaded adults.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Everything about Shrek is good. It’s all at once such an oddball movie and a towering achievement in animation; I think one fuels the other. Hot take: Shrek is a great movie!",
      "author": "Cory Woodroof"
    },
    {
      "text": "Turning the fairy-tale genre on its head was a clever, if not totally novel, notion at the time, and Shrek still retains much of its ironic charm 20 years later.",
      "author": "Rachel Klein"
    },
    {
      "text": "...Shrek has a positive message about accepting yourself for who you are.",
      "author": "Danielle Solzman"
    },
    {
      "text": "20 years later, Shrek remains a timeless animated classic thanks to its exceptional, highly-entertaining story, which comes packed with a multitude of amusing moments, and marvelous, fleshed-out characters that have you engaged every step of the way.",
      "author": "Jeff Beck"
    },
    {
      "text": "Classic fairy tale fantasy. (In some ways this 20th Anniversary Special Edition 4K HD blu-ray release sharpens the relatively early [2001] CGI animation highlighting the processes flaws).",
      "author": "Peter Canavese"
    },
    {
      "text": "The most effective moments arrive in the form of clever visual gags related to well-known fairy tales.",
      "author": "Mike Massie"
    },
    {
      "text": "Shrek is unashamed of its modern flourishes. At the same time, especially for young viewers, it works very well as a straightforward and quite funny fable. The animation, coordinated by directors Andrew Adamson and Vicky Jenson, is impressive.",
      "author": "Kathi Maio"
    },
    {
      "text": "With the perfect blend of storytelling, animation, and music this is one movie (Shrek) the whole family can enjoy!",
      "author": "Allison Rose"
    },
    {
      "text": "Unfortunately when you take out the humor there isn't that much going for it.",
      "author": "Rachel Wagner"
    },
    {
      "text": "The first Oscar for Best Animated Feature went to Shrek, an absurd choice to those of us who believe that Pixar's Monsters, Inc. was that year's best toon flick. Still, this is nevertheless a snappy comedy that manages to stick it to the entire genre.",
      "author": "Matt Brunson"
    },
    {
      "text": "Murphy steals every scene he's in with equal parts bounce and warmth.",
      "author": "Paul Malcolm"
    },
    {
      "text": "Here is a movie of the times, funny, enjoyable, perfect-looking, and altogether original in a way that might cause us to look again at the meaning of the word.",
      "author": "Andrew O'Hagan"
    },
    {
      "text": "Adults will find plenty to laugh at. Children will love it.",
      "author": "Christopher Tookey"
    },
    {
      "text": "Shrek is alive, and with dark, sly and absolutely hilarious irreverence lampooning every once-sacred characteristic of the nursery kingdom. Shrek is a subversive joy..",
      "author": "Alexander Walker"
    },
    {
      "text": "With improbable finesse it buffs up some of the oldest tropes of storytelling and then gives them a mischievous tilt, so that we appear to be watching a celebration of a genre and a sneaky subversion of it at the same time.",
      "author": "Anthony Quinn"
    },
    {
      "text": "Even more amazing, for a movie with its share of flatulence gags, it also has a real heart. Few films have had their cake and eaten it so gleefully.",
      "author": "Mark Steyn"
    },
    {
      "text": "The best jokes in Shrek spoof Disney tradition; the villain's lair looks suspiciously like a certain theme park's Main Street USA, and a bluebird of happiness explodes during a sugary crescendo.",
      "author": "Steve Persall"
    },
    {
      "text": "Shrek qualifies as a classic animated movie, and one of the more charming films to grace screens in a long time.",
      "author": "Bob Grimm"
    },
    {
      "text": "The story's simple, the quest not that complicated. But the joy of Shrek is in the telling, in the details along the way.",
      "author": "Matt Soergel"
    },
    {
      "text": "The sarcastic, nasty tone of smug hipness clashes mightily with the film's shrill attempts at sincerity and lesson-learning.",
      "author": "Tim Brayton"
    },
    {
      "text": "A a computer-animated burlesque fairy tale that generates more belly laughs than any live-action comedy since Best in Show.",
      "author": "Michael Sragow"
    },
    {
      "text": "The animation, with its dimensional verisimilitude, is beguiling and the whole package ends with a noncloying dash of uplift.",
      "author": "Richard C. Walls"
    },
    {
      "text": "What the film lacks is the faintest glimmer of charm.",
      "author": "Anthony Lane"
    },
    {
      "text": "Shrek may not have the class of Buzz Lightyear, but he's a lovable great lunk, and you could do a lot worse this summer than see this.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "There's no denying that the monster-as-hero device has 90-odd-minutes worth of entertainment mileage, and the delivery of the story's moral is handled well enough to avoid tweeness.",
      "author": null
    },
    {
      "text": "This animated fantasy comedy from DreamWorks is an irreverent, occasionally scatological fairy tale with state-of-the-art computer-generated images that almost steal a march on Toy Story.",
      "author": "Andrew Collins"
    },
    {
      "text": "No matter which level of the movie a viewer responds to, anyone past the age of 5 who doesn't laugh repeatedly while seeing Shrek needs to have his funny bone examined.",
      "author": "Leah Rozen"
    },
    {
      "text": "The brilliance of the voice work, script, direction and animation all serve to make Shrek an adorable, infectious work of true sophistication.",
      "author": "Jami Bernard"
    },
    {
      "text": "The story has rollicking moments and the visuals are amazingly realistic.",
      "author": "David Sterritt"
    },
    {
      "text": "Shrek's ability to fit in a number of touching, funny moments says much about the intelligence and wit behind it. It's just a shame that the film is never as clever or as hip as it so desperately feels the need to be.",
      "author": "Nathan Rabin"
    },
    {
      "text": "After a 90-minute onslaught of in-jokes, here's the real punch line: Shrek strives to have a heart. Supposedly there's a message about beauty coming from within, but somehow it rings hollow.",
      "author": "Christy Lemire"
    },
    {
      "text": "The charms of Shrek, which is based on the children's book by William Steig, go far beyond in-jokes for adults.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "This romantic fantasy complicates the roles of beauty and beast, making it hard to guess what form a sensitive resolution will take.",
      "author": "Lisa Alspector"
    },
    {
      "text": "Animation is hardly groundbreaking",
      "author": "John A. Nesbit"
    },
    {
      "text": "Gross-out laughs meet a marvelous fairytale mix.",
      "author": "Nell Minow"
    },
    {
      "text": "Though imperfect, \"Shrek\" offers enough diversions from animation's go-go-go that it's been sad - after lackluster third and fourth installments - to see the lovable green guy turn the way of impersonal franchise cash-grabbing.",
      "author": "Nick Rogers"
    },
    {
      "text": "It doesn't take long to figure out that Shrek is not going to be your ordinary animated fairy tale.",
      "author": "David Ansen"
    },
    {
      "text": "A real highlight of the year, certainly the one to beat this summer.",
      "author": "Garth Franklin"
    },
    {
      "text": "The only things it takes seriously are the notions of true love and beauty-is-only-skin-deep, good things for kids to soak up after they've had their fill of flatulence.",
      "author": "Kelly Vance"
    },
    {
      "text": "A very good and weird animated comedy adventure...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "It's one of the best fairytale films ever made, right up there with The Princess Bride.",
      "author": "Jennie Kermode"
    },
    {
      "text": "No one has ever made a funnier jackass of himself than Murphy.",
      "author": "Richard Schickel"
    },
    {
      "text": "Hugely entertaining, sassy and great-looking.",
      "author": "Daniel Etherington"
    },
    {
      "text": "Unique brand of entertainment: Simple and straightforward in its textal surface, but sophisticated and witty in subtextual connotations, including racy barbs addressed at Disney, which until recently had monopoly on animation fare, but not anynmore.",
      "author": "Emanuel Levy"
    },
    {
      "text": "What gives Shrek its special artistic distinction is its witty and knowingly sassy dialogue, delivered by vocally charismatic performers whose voices remind us of their stellar screen personae in live-action movies.",
      "author": "Andrew Sarris"
    },
    {
      "text": "Shrek is amusing and charming and it stands on it's own, but it does not rival Disney's best and I'm not saying it needs to, but that simply is the bar.",
      "author": "Jordan Hiller"
    },
    {
      "text": "A well-cast, well-made movie in which the spectacular animation, while impressive, definitely plays second fiddle to the strong story and engaging characters.",
      "author": "Betsy Bozdech"
    },
    {
      "text": "Gag by gag -- and there's a stream -- it's merrily irreverent, visually and vocally. The bigger picture, though, is rather more conventional.",
      "author": "Nick Bradshaw"
    },
    {
      "text": "I seem to be the only one in the world unimpressed by this so-so animated feature.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Absolute perfection!",
      "author": "John Venable"
    },
    {
      "text": "Bottom line: the story satisfies and the jokes avoid juvenile cliches.",
      "author": "Chris Gore"
    },
    {
      "text": "What saves this movie are the performances by the actors, particularly Murphy and Myers.",
      "author": "Scott Nash"
    },
    {
      "text": "Truth be told, it's damn enjoyable.",
      "author": "Philip Martin"
    },
    {
      "text": "Shrek's pros outweigh its cons, making this overall a delightful and fun entertainment with a refreshingly honest message.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "A solid second outing by DreamWorks/PDI, with truly biting entertaining moments scattered throughout the film.",
      "author": "Alex Keen"
    },
    {
      "text": "The animation...is amazing.",
      "author": "Andrea Chase"
    },
    {
      "text": "Excelente fábula que encanta tanto crianças quanto adultos graças ao seu humor ácido e ao seu visual impressionante.",
      "author": "Pablo Villaça"
    },
    {
      "text": "Not coincidentally, most of the really good stuff here will go over young kids' heads.",
      "author": "Eugene Novikov"
    },
    {
      "text": "...Altogether hip and clever, and the computer-generated 3-D animation is impeccably crisp and colorful.",
      "author": "John R. McEwen"
    },
    {
      "text": "A fresh twist on the fairytale humor genre.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Shrek isn't even as good, much less good-willed, than the more mediocre output of the Disney dynasty it wants so thirstily to topple.",
      "author": "Nick Davis"
    },
    {
      "text": "This is one of the funniest movies I've seen in years.",
      "author": "Rebecca Murray"
    },
    {
      "text": "There is something for everyone here.",
      "author": "Matthew Turner"
    },
    {
      "text": "A delightful computer-generated romp that's every bit as much fun for adults as it is for kids.",
      "author": "Jean Lowerison"
    },
    {
      "text": "Big-hearted, silly, wicked and loaded with laughs.",
      "author": "Margaret A. McGurk"
    },
    {
      "text": "A wickedly delightful animated parody about fairy tales and all those characters that we cut our teeth on.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "Shrek is one of the best films of 2001.",
      "author": "Joshua Tyler"
    },
    {
      "text": "The importance of friendship and true love are explored with unusual sensitivity in scenes between Shrek and Fiona and between Donkey and Shrek.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "A movie that adults will easily enjoy every bit as much as the kids, maybe even more so.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "A funny, well-paced, and satisfying twisted fairy tale.",
      "author": "Brian Webster"
    },
    {
      "text": "If \"Beauty and the Beast\" and \"The Little Mermaid\" were banquets for the eyes and ears, \"Shrek\" is an out of control food fight that's so invigorating to watch you wish it could go on forever.",
      "author": "James Sanford"
    },
    {
      "text": "I think Shrek sucks.",
      "author": "Jimmy O"
    },
    {
      "text": "A contemporary, yet sophisticated, concoction that throws almost every cliché...yet casts a spell over us with its charm and inventiveness.",
      "author": "Collin Souter"
    },
    {
      "text": "Sort of like The Princess Bride, if André the Giant had been the hero, and had worn Lou Ferrigno body paint.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "At least half a dozen flatulence and poop jokes percolate through the opening credits alone. Far be it from me to poo-poo a good fart joke, but there is an art to these things, and in Shrek they just sit there.",
      "author": "Peter Keough"
    },
    {
      "text": "There are numerous faults in Shrek, enough to addle the brain. Chief among these are the narrative infirmities, which begin with the attempt at creating a fairytale that subverts the storytelling conventions of tradition.",
      "author": "Jon Lap"
    },
    {
      "text": "Forget Pinocchio or Snow White: children will want their parents to read them the adventures of Shrek when it's time to pick a bedtime story.",
      "author": "Robert Sims"
    },
    {
      "text": "There is really something for everyone in this movie.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "Has a diabolical sense of humor and a really big heart.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It delivers what the founders of DreamWorks Pictures originally promised -- alternative yet accessible entertainment.",
      "author": "Ian Mantgani"
    },
    {
      "text": "It's the story itself that makes the film so endearing -- we actually start to care for the characters, even though we know from the start how it will all end.",
      "author": "Rich Cline"
    },
    {
      "text": "Nothing in the world of fairy-tale cartoons appears to have been sacred.",
      "author": "John J. Puccio"
    },
    {
      "text": "A fun movie that should elicit smiles from even the most jaded of moviegoers.",
      "author": "Sabadino Parker"
    },
    {
      "text": "Smart, funny, technically proficient... and taking no prisoners. Bless its twisted little heart.",
      "author": "Rob Vaux"
    },
    {
      "text": "There is so much to enjoy all the way along that you'd have to be an ogre not to have a good time.",
      "author": "Jay Stone"
    },
    {
      "text": "Mother Goose meets Mad Magazine in easily one of the year's most entertaining movies.",
      "author": "Scott Weinberg"
    },
    {
      "text": "...one of the most delightful, charming, imaginative and superlative endeavors that computer animation has offered since the original 'Toy Story'...",
      "author": "David Keyes"
    },
    {
      "text": "Whether or not you love Shrek or find it to be only a pleasant diversion depends on how much of a purist you are when it comes to fairly tales.",
      "author": "Carlo Cavagna"
    },
    {
      "text": "A funny, sweet, snappy fairy tale about misfits, for misfits -- or anybody who's ever felt like a misfit.",
      "author": "Glenn Kenny"
    },
    {
      "text": "The movie is a constant delight for its exuberant simplicity, its avoidance of sensational effects, its wit and a true feeling that transcends sentimentality.",
      "author": "Philip French"
    },
    {
      "text": "Shrek is fun, entertaining and colorful, and their's nothing wrong with that.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "La más jocosa, mágica y deslumbrante experiencia fílmica del año",
      "author": "Jorge Avila Andrade"
    },
    {
      "text": "Beautifully written, gloriously animated and tastily subversive.",
      "author": "Ian Nathan"
    },
    {
      "text": "It's too bad about the computer animation, which works at cross-purposes to the characterization.",
      "author": "Bryant Frazer"
    },
    {
      "text": "If you have any sense of humor, you won't leave the theater disappointed.",
      "author": "Alex Sandell"
    },
    {
      "text": "This fable structure is allied to both a witty cynicism and sense of fun, which pervades the entire movie in equal measure.",
      "author": "Ben Falk"
    },
    {
      "text": "This movie is like a donkey eating a waffle.",
      "author": "Andrew Manning"
    },
    {
      "text": "At the heart of it lies a little story about love and acceptance that is actually rather bonny.",
      "author": "Jason Anderson"
    },
    {
      "text": "An extremely funny movie.",
      "author": "Joe Leydon"
    },
    {
      "text": "\"Shrek\" is more than just a dazzling technical achievement in digital animation, it is a witty, clever, charming romantic comedy about heroism, love and friendship.",
      "author": "Robert Roten"
    },
    {
      "text": "A clever and adventurous combination of The Princess Bride and Beauty and the Beast.",
      "author": "David Forsmark"
    },
    {
      "text": "\"SHREK was good. SHREK was funny. SHREK kept me entertained. I had a blast.\"",
      "author": "Matt Easterbrook"
    },
    {
      "text": "There are so many in-jokes and general mirth in \"Shrek,\" you need to view it more than once for the full effect.",
      "author": "Robin Clifford"
    },
    {
      "text": "A delightfully irreverent fairy tale.",
      "author": "James Kendrick"
    },
    {
      "text": "The new technology is opening up entire worlds for moviegoers. Shrek is a prime example of this new movie magic.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "A genuinely funny film with a lot of heart that is also visually amazing",
      "author": "Marshall Fine"
    },
    {
      "text": "The script's details are gleefully impish, constantly poking fun at Disney",
      "author": "Laura Clifford"
    },
    {
      "text": "\"Fresh, funny, irreverent with the message that there's something wonderful in all of us.\"",
      "author": "Susan Granger"
    },
    {
      "text": "The animation? Superb, stunning, gorgeous, Pixar-quality, fantastic, wow, man...I myself am totally surprised at how much I laughed - both times I saw it!",
      "author": "Karina Montgomery"
    },
    {
      "text": "There was some violence that might be considered over-the-top for young viewers along with the usual flatulence humor, but the little kids sitting next me seemed to be having the time of their lives.",
      "author": "Gary Brown"
    },
    {
      "text": "A wonderfully funny and touching film.",
      "author": "Tony Toscano"
    },
    {
      "text": "The script, instead of being what we tolerate in order to savor the visuals, is a delight all by itself.",
      "author": "Peter Rainer"
    },
    {
      "text": "A sly comic gem, combining a genuinely clever, very well-written story with definitive computer animation and a subversive spin.",
      "author": "Marc Savlov"
    },
    {
      "text": "The characters are so three-dimensional you forget you're watching painted digital creatures thought up by animation wizards.",
      "author": "Emily Blunt"
    },
    {
      "text": "The millennium's first great animated classic has been born. Long live Shrek!",
      "author": "Elias Savada"
    },
    {
      "text": "A visually stunning animation masterpiece - Shrek is one heck of a movie.",
      "author": "Kamal  'The Diva' Larsuel"
    },
    {
      "text": "A clever, amusing little film, but its smugness about being more politically correct than Disney is misplaced.",
      "author": "Scott Renshaw"
    },
    {
      "text": "You may not want young, impressionable kids seeing it and reveling in the gross stuff, but everyone else should find it a wickedly funny diversion.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The best animated movie to hit the big screen since Toy Story.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "It's still a squabble over money and reputation that matters very little to most of us.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "There's enough for the whole family to enjoy.",
      "author": "BeatBoxBetty Staff"
    },
    {
      "text": "The total package is magical to behold, clever and hugely entertaining for all ages.",
      "author": "Bob Aulert"
    },
    {
      "text": "The story wasn't absolutely magical, but it was interesting, quite funny, and different, which is just what the doctor ordered.",
      "author": "Jim Chastain"
    },
    {
      "text": "The humor -- much of it slyly adult -- never overwhelms.",
      "author": "Donald Munro"
    },
    {
      "text": "This is beautiful work.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Too long on slick, too short on magic.",
      "author": "David Elliott"
    },
    {
      "text": "An effort that deserves to be lumped in with the modern day classics of animation.",
      "author": "Jim Judy"
    },
    {
      "text": "An exuberant Eddie Murphy gives the comic performance of his career.",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "Isn't so much a fractured spoof of everything Disney, but actually a Monty Python flick for kids -- kids of all ages.",
      "author": "Joe Baltake"
    },
    {
      "text": "A movie that appeals to the eye, mind, heart and funny bone.",
      "author": "Desson Thomson"
    },
    {
      "text": "Despite all its high-tech weirdness, is really that most perdurable of human constructions, a tale told well and true.",
      "author": "Stephen Hunter"
    },
    {
      "text": "Funny, irreverent and moving, the unconventional Shrek may mock fairy tales, but in the process, creates its own.",
      "author": "Kim Morgan"
    },
    {
      "text": "Any of TV animator Jay Ward's five-minute Fractured Fairy Tales has more laughs than you get here.",
      "author": "Dave White"
    },
    {
      "text": "As low as some of the humor stoops, it can't spoil this imaginative, often clever film.",
      "author": "Jeff Vice"
    },
    {
      "text": "Jolly and wicked, filled with sly in-jokes and yet somehow possessing a heart.",
      "author": "Roger Ebert"
    },
    {
      "text": "In the end, Shrek is just as warm and fuzzy as any of the Disney films that it mocks, playing both sides of the fence without necessarily tearing the fence down.",
      "author": "Wade Major"
    },
    {
      "text": "In an era when much on film seems old, Shrek seems new and fresh and clever.",
      "author": "Jay Carr"
    },
    {
      "text": "Combines superb storytelling with state-of-the-art animation.",
      "author": "Peter Howell"
    },
    {
      "text": "The movie is helped immensely by its cast, who carry it through some of the early, sluggish scenes. But this is Murphy's movie. Donkey gets most of the good lines, and Murphy hits every one.",
      "author": "John Zebrowski"
    },
    {
      "text": "Its characters are delightful enough and the film is just sweet-natured and visually sophiscated enough to avoid sinking into the swamp.",
      "author": "Paula Nechak"
    },
    {
      "text": "Am I alone in thinking that computer animation is the work of the antichrist?",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "An animated gem, on a par with the best of the modern era.",
      "author": "Jack Garner"
    },
    {
      "text": "Not just a good 'kids' film,' but a genuinely funny comedy.",
      "author": "Mary Kalin-Casey"
    },
    {
      "text": "The kind of movie that will entertain everyone of every age and probably for ages to come.",
      "author": "John Anderson"
    },
    {
      "text": "A fat green ogre with a grouchy disposition and worse manners, Shrek is the sort of unlikely hero that nobody could love -- except just about everyone who sees this hip and hilarious animated delight.",
      "author": "Lou Lumenick"
    },
    {
      "text": "A brightly colored, fast-moving diversion.",
      "author": "Duane Dudek"
    },
    {
      "text": "A gleefully fractured fairy tale that never becomes cynical or crass.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Truly what a family film was meant to be -- a vehicle that has something for everyone.",
      "author": "Drew McAnulty"
    },
    {
      "text": "A subversive little delight which turns the whole notion of the classic fairy tale on end.",
      "author": "Louis B. Hobson"
    },
    {
      "text": "Our Beast is a beauty in his own right -- and in his own wonderfully entertaining movie.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "DreamWorks' first animated film to blow Disney out of the water.",
      "author": "Bruce Westbrook"
    },
    {
      "text": "Swift, sweet, irreverent, rangy and as spirited in the writing and voice work as it is splendid in design.",
      "author": "Susan Stark"
    },
    {
      "text": "It has the big green earmarks of a classic.",
      "author": "Bruce Newman"
    },
    {
      "text": "The rendering of the displaced fairy-tale gang is wonderfully done.",
      "author": "Mary F. Pols"
    },
    {
      "text": "One of those rare animated films that will delight and engage children while entertaining adults to no end.",
      "author": "Terry Lawson"
    },
    {
      "text": "DreamWorks Pictures again proves a name to trust for imaginative, funny animated movies that delight kids and adults equally.",
      "author": "Steven Rosen"
    },
    {
      "text": "A heck of a lot of fun -- even if you don't believe in fairy tales.",
      "author": "Paul Tatara"
    },
    {
      "text": "It's possible to groan, chuckle, wince and be moist-eyed, sometimes in a span of seven or eight minutes.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Much of it seems a little sad, a deconstructivist overlay of jaded irony.",
      "author": "Rick Groen"
    },
    {
      "text": "The lack of manipulative sentimentality in Shrek allows for the more serious moments to be genuinely touching and meaningful.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "Not quite as clever as the Toy Story films, but still features some first-rate vocal performances by Mike Myers, Eddie Murphy and John Lithgow.",
      "author": "Joe Lozito"
    },
    {
      "text": "A creative lark from start to finish.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Takes everything Disney and stands it on his head without being very condescending or particularly spiteful.",
      "author": "Eric Lurio"
    },
    {
      "text": "Peppered with the best fairytale spoofs since Jay Ward's Fractured Fairy Tales.",
      "author": "Sean P. Means"
    },
    {
      "text": "A work of art, destined to take its place alongside the classics that it playfully parodies.",
      "author": "Glenn Whipp"
    },
    {
      "text": "Fast, irreverent and magnificently animated and acted.",
      "author": "Frank Lovece"
    },
    {
      "text": "Points the way toward some new uses of enchantment.",
      "author": "Chris Hewitt"
    },
    {
      "text": "It's no classic, but it's cute.",
      "author": "Todd Anthony"
    },
    {
      "text": "A picture that truly is a perfect family film.",
      "author": "Desmond Ryan"
    },
    {
      "text": "Shrek is a charmingly ornery green crank, and Murphy makes a funny sidekick.",
      "author": "Gary Thompson"
    },
    {
      "text": "Spends so much time being cleverly hip and spoofing all things Disney that it struggles to find its own identity.",
      "author": "Cameron Meier"
    },
    {
      "text": "It's a pleasure to be able to report that the movie both captures and expands upon the book's playful spirit of deconstruction.",
      "author": "Jay Boyar"
    },
    {
      "text": "Shrek isn't clever or smart. It just wants you to think it is, through wink after wink after wink.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "Shrek's self-reflexive silliness is in nearly perfect counterpoint to its giddy spirit of adventure, friendship, and romance.",
      "author": "Cody Clark"
    },
    {
      "text": "A hoot, a flat-out laugh riot of equal parts charm and cheekiness.",
      "author": "Robert W. Butler"
    },
    {
      "text": "A kind of palace coup, a shout of defiance, and a coming of age for DreamWorks.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "Mischievous enchantment with something to titillate all ages.",
      "author": "Jane Sumner"
    },
    {
      "text": "The film's real qualities are its warmth and wit, developed without any digital assistance.",
      "author": "Dave Kehr"
    },
    {
      "text": "Toy Story 2 had a higher in-jokes/laughs ratio without straining to demonstrate its hipness or to evoke heartfelt emotions.",
      "author": "Mark Caro"
    },
    {
      "text": "When it's good, it's very, very good, but when it's bad, it's horrid.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "A drolly satirical but genuinely enchanting animated adventure.",
      "author": "Rob Blackwelder"
    },
    {
      "text": "A rollicking good time.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "Torturing the Gingerbread Man? I'm sold.",
      "author": "Max Messier"
    },
    {
      "text": "Summer's most lovable lug.",
      "author": "E! Staff"
    },
    {
      "text": "Desperately avoiding the risk of even a half-second of boredom, the movie is wall-to-window-to-door noise, babbling, and jokes (the first minute sees the first fart gag), and demographically it's a hard-sell shotgun spray.",
      "author": "Michael Atkinson"
    },
    {
      "text": "Shrek may very well be the first film I've seen that has failed to live up to expectations, and then go on to exceed them.",
      "author": "Jeffrey Huston"
    },
    {
      "text": "Beating up on the irritatingly dainty Disney trademarks is nothing new; it's just that it has rarely been done with the demolition-derby zest of Shrek.",
      "author": "Elvis Mitchell"
    },
    {
      "text": "The witty, fractured fairy tale Shrek has a solid base of clever writing.",
      "author": "Kenneth Turan"
    },
    {
      "text": "This is fairy tale deconstruction the whole family will get a kick out of.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Even though Shrek never enters Pixar's rarified league, it is an imaginative and side-splitting movie that is a treat for young and old.",
      "author": "Steve Rhodes"
    },
    {
      "text": "On its own merits, it's great fun.",
      "author": "Jim Lane"
    },
    {
      "text": "This isn't just a fractured fairy tale, it's a storybook vision in a mushroom cloud of imagination and fun.",
      "author": "Erik Childress"
    },
    {
      "text": "Big hit with kids AND adults but didn't gratify me.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Shrek turns dozens of fairy tales inside out and upside down to hilarious effect.",
      "author": "Mark Ramsey"
    },
    {
      "text": "Not to say that the film isn't amusing, but if you were looking for the Disney-killer, keep looking.",
      "author": "Widgett Walls"
    },
    {
      "text": "This isn't your grandmother's animated movie.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "A fresh fruitatious smorgasbord of laughter that has but one disappointing blemish.",
      "author": "Ross Anthony"
    },
    {
      "text": "The animation is absolutely incredible.",
      "author": "Scott Chitwood"
    },
    {
      "text": "Shrek is not a guilty pleasure for sophisticated movie-goers; it is, purely and simply, a pleasure.",
      "author": "James Berardinelli"
    },
    {
      "text": "A world-class charmer.",
      "author": "Peter Travers"
    },
    {
      "text": "This postmodern Dreamworks cartoon takes brilliant, albeit infrequenet, jabs at Disney's totalitarian control of the fairy tale genre.",
      "author": "Ed Gonzalez"
    },
    {
      "text": "Smart, sassy and chockablock with witty references to pop culture past and present.",
      "author": "Frank Swietek"
    },
    {
      "text": "Chalk this sucker up with Toy Story 2 and Chicken Run in the 'fun for the whole family' category.",
      "author": "JoBlo"
    },
    {
      "text": "However much Shrek might expand the visual palette of computer animation, much more important is the wit and compassion the CG animators at PDI/DreamWorks bring to this fractured fairy tale.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "An instant animated classic.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Fast-paced and filled with enough cheeky humor to keep parents as entertained as their kids.",
      "author": "Kevin Lally"
    },
    {
      "text": "A quality production, from its appearance to its voice work and even to its laughably predictable story.",
      "author": "Jon Popick"
    },
    {
      "text": "The same low-tech requirements hold in the high-tech world of digital cinema: it all starts with the script.",
      "author": "Michael Dequina"
    },
    {
      "text": "A new animated classic has been born.",
      "author": "Dustin Putman"
    }
  ],
  "release_year": 2001,
  "duration": 90,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Fantasy",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "Once upon a time, in a far away swamp, there lived an ogre named Shrek whose precious solitude is suddenly shattered by an invasion of annoying fairy tale characters. They were all banished from their kingdom by the evil Lord Farquaad. Determined to save their home, not to mention his, Shrek cuts a deal with Farquaad and sets out to rescue Princess Fiona to be Farquaad's bride. Rescuing the Princess may be small compared to her deep, dark secret.",
  "popularity": 9.0,
  "poster_url": "https://image.tmdb.org/t/p/original/EKERKucZeBrkrR8xLDTkr5FeDc.jpg"
}