{
  "movie_name": "Split",
  "movie_id": "split_2017",
  "total_reviews": 312,
  "reviews": [
    {
      "text": "Split would be an amazing film that could stand on its own even if it ended one minute sooner than it did.",
      "author": "Joseph Tomastik"
    },
    {
      "text": "It may not be as perfect as “Unbreakable,” [but] it dazzles and terrifies you enough to think about the many emotional implications of its three central characters.",
      "author": "Ankit Ojha"
    },
    {
      "text": "Split is Shyamalan's return to his early 2000's self (...) James McAvoy delivers his career-best performance.",
      "author": "Manuel São Bento"
    },
    {
      "text": "McAvoy's performance is most effective during the subtle changes in his body language as he shifts from one personality to the next...",
      "author": "Gena Radcliffe"
    },
    {
      "text": "Shyamalan sticks his ending with an insanely clever twist I never saw coming and that immediately compelled me to see the film again.",
      "author": "Keith Garlington"
    },
    {
      "text": "Delivers a tense and entertaining B-movie experience that seems to revel in its performers and the novelty of its plot, albeit in fun and not-so-self-serious ways.",
      "author": "Brian Eggert"
    },
    {
      "text": "An absence of the standard Shyamalan twist is notable... showing how much the director has matured over the last decade. In Split, hes created a film that rivals the films that once made him one of Hollywoods hottest young directors.",
      "author": "Victoria Luxford"
    },
    {
      "text": "McAvoy delivers one of the best performances ever. A psychological thriller that's aided by its score but the acting is the standout.",
      "author": "Rosa Parra"
    },
    {
      "text": "I do think the tension really builds in a very horrific way where it feels very conversational and then, yeah, the horror creeps.",
      "author": "Emma Wolfe"
    },
    {
      "text": "Wild and wooly, uniting, for the first time in a long time, Shyamalan's talent for keeping the audience on the edge of their seats and his ability to change the game in the final act.",
      "author": "Richard Crouse"
    },
    {
      "text": "Split departs from anything writer/director M. Night Shyamalan has done before, bringing an honestly thrilling story to life, with one of his best twists since The Sixth Sense.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "There's a slowness to the story, coupled with aggravating mistakes by supporting roles, which inspire the opposite of chills: exasperation.",
      "author": "Mike Massie"
    },
    {
      "text": "A B-movie masquerading as a Hollywood production.",
      "author": "Richard Propes"
    },
    {
      "text": "McAvoy is deliberately unnerving for such a challenging and difficult role. He sends your emotions into a chaotic disarray...There are no boundaries and that's terrifying to even contemplate.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "It's a slow burn, intelligent thriller that properly amps up its tension in the final act, and contains a standout performance from McAvoy.",
      "author": "Damond Fudge"
    },
    {
      "text": "This is old-school Shyamalan: great suspense, disturbing plot and fabulous protagonists. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "James McAvoy's phenomenal performance almost saves \"Split.\"",
      "author": "Brent McKnight"
    },
    {
      "text": "I had mixed feelings about this movie. I actually kind of really liked this movie for the first 80 percent of it and then the ending just really ruined it for me.",
      "author": "Andrew Galdi"
    },
    {
      "text": "It was like a really cool, interesting study about psychology and then it became a Grimm's fairytale.",
      "author": "Avaryl Halley"
    },
    {
      "text": "Split has a lot of issues, but they are manageable and are easily outweighed by a pair of sublime performances. I have mixed feelings about the work, but I'm leaning toward recommending it.",
      "author": "Steven Prokopy"
    },
    {
      "text": "While Split isn't exactly a thoughtful look at the struggle of a man plagued by mental illness, it's not really trying to be that. It sets out to be an entertaining genre exercise and a fun time at the movies, and it succeeds.",
      "author": "Tim Brennan"
    },
    {
      "text": "James McAvoy helps save M. Night Shyamalan from himself in Split...I'm disappointed by some of Shyamalan's choices in this film, but Split is still worth seeing in the theater for McAvoy's brilliance.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Shyamalan's greatest strength has always been building individual scenes; sprung from the puzzle movie trap, he is free to riff away.",
      "author": "Chris McCoy"
    },
    {
      "text": "In trying to make an intelligent and unique thriller, M. Night Shyamalan has instead created a film which is worth your time, but one which feels like it squanders an infinitely interesting premise.",
      "author": "Kieran McLoone"
    },
    {
      "text": "M. Night Shyamalan's 2016 film Split takes abuse-as-character to a logical and absurd extreme.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "One of the highlights in the promotion of the movie was the promise to see James McAvoy playing some of Kevin's 23 personalities, which never happens. [Full Review in Spanish]",
      "author": "Jorge Loser"
    },
    {
      "text": "McAvoy is masterful in his role as he takes on nine different characters all rolled into one heaping mess of a human being.",
      "author": "Allison Rose"
    },
    {
      "text": "Up until the last 20 or so minutes, Split is a tense, tightly directed thriller that would probably have ended up among my favorite movies at the end of the year.",
      "author": "Karl Delossantos"
    },
    {
      "text": "This is still not mint-condition Shyamalan, but he's heading in the right direction, with some help from McAvoy, who gives Kevin-and 23 other characters-all that he's got.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Split is deeply weird, cheerfully perverse, and way, way over the top. It's also a hell of a lot of fun.",
      "author": "Oscar Goff"
    },
    {
      "text": "So silly, so trashy, so unabashedly schlocky that one really can't resist being remarkably entertained while watching it.",
      "author": "Tyler Smith"
    },
    {
      "text": "One of the criticisms leveled against Split has been its use of a psychological condition as a villainous device. That's a fair criticism, but the silliness of this depiction prevents it from making any salient implication about real-world mental health.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Easily the director's best film since Unbreakable, returning the director to the kind of economical, straightforward suspense that he does so well.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Split squanders an excellent cast on a terrible script that is as offensive as it is stupid and tasteless.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "An outrageous yet somehow grounded film that sees Shyamalan return to form.",
      "author": "C.H. Newell"
    },
    {
      "text": "[M. Night Shyamalan] got me - and not only did he get me, I loved what he did.",
      "author": "Dan Murrell"
    },
    {
      "text": "As the film goes on, SPLIT begins to add more and more fascinating components. The final act is principally audacious, delving into a whole other level of reveals that are largely crowd-pleasing and bold.",
      "author": "Preston Barta"
    },
    {
      "text": "Although Split is fascinating, tense and creepy to the point of discomfort, its main issue is that it puts all its cards on the table too early.",
      "author": "Naomi Soanes"
    },
    {
      "text": "Split is a gripping film that manages to feel both expansive and suffocating, a well-crafted piece of genre fare that transcends its genre.",
      "author": "Allen Adams"
    },
    {
      "text": "Unfortunately, in Split, M. Night Shyamalan has created a film that sees the fine line between skin-crawling and revulsion and runs right past it.",
      "author": "Amanda Greever"
    },
    {
      "text": "McAvoy's performance is jaw-dropping. It manages to be both mesmerising and scarily unwatchable at the same time, then by turns terrifying and sympathetic, playful and murderous.",
      "author": "Sarah Cartland"
    },
    {
      "text": "There's something exciting about a filmmaker scribbling away at a movie comic in his own corner...",
      "author": "Josh Larsen"
    },
    {
      "text": "The latest written-directed Shyamalan film, Split, largely shatters expectations, becoming the most straight-forward thriller in his oeuvre and a showcase for all of the actors involved.",
      "author": "Douglas Davidson"
    },
    {
      "text": "McAvoy makes the entire film a tour-de-force of acting, and while the story is genuinely unsettling to witness, it's mesmerizing throughout.",
      "author": "Colby Bryant"
    },
    {
      "text": "Split surprises the most avid of Shyamalan watchers, presenting a well-made thriller, indistinguishable from the director's latest fair.",
      "author": "Ciaran Kerr"
    },
    {
      "text": "Shyamalan oddly builds toward a climax that ultimately finds a positive side benefit to incest, pedophilia, and physical abuse.",
      "author": "Matt Brunson"
    },
    {
      "text": "Split injects psychology into the modern thriller. You'll find yourself betrothed in the combination of reality and supernatural, impatiently waiting to meet the next personality.",
      "author": "Amanda Sink"
    },
    {
      "text": "Aunque Shyamalan puede pecar de incongruente, con Fragmentado el director replica lo que hizo en Los huéspedes al crear una película que es capaz de asustar y entretener en igual medida.",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "McAvoy accomplishes the impossible while providing depth and personality to each character from the mannerisms to the specific dialect of each different identity. His performance steals the show and provides some laughs, but also fear...",
      "author": "Sharronda Williams"
    },
    {
      "text": "In addition to being a platform for James McAvoy to display his considerable range in truly zany fashion, Split represents the once fallen M. Night Shyamalan solidifying his place as the king of twists in this unsettling and campy delight.",
      "author": "Matt Oakes"
    },
    {
      "text": "The Shyamalanaissance is real!",
      "author": "Bob Chipman"
    },
    {
      "text": "Split is not only an edge of your seat film, but it is also a film that shows the many interesting facets of the human brain. If nothing else this film is worth seeing just to watch James McAvoy playing numerous characters.",
      "author": "Molly Henery"
    },
    {
      "text": "If you have even the slightest fond memories of [Shyamalan's] early work ... you owe it to yourself to watch Split.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "I guess it's only fitting that Shyamalan's cameo is credited as \"Jai, Hooters lover.\"",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Shyamalan is at the top of his directing game, but he still hasn't learned to fine-tune his writing.",
      "author": "Trace Thurman"
    },
    {
      "text": "A solid three-star movie, Split is well worth a look, if only to see what a modern Thomasin looks like.",
      "author": "Kat Hughes"
    },
    {
      "text": "Smart and thoroughly thrilling with amazing performances from Taylor-Joy and McAvoy, \"Split\" is M. Night Shyamalan's redefined welcomed return to the thriller genre",
      "author": "Rendy Jones"
    },
    {
      "text": "[McAvoy] had taken time with each and every character he portrayed on-screen. You could see that inner life, behind his eyes and in the mannerisms specific to each character.",
      "author": "Achara Kirk"
    },
    {
      "text": "[Shyamalan] has a good understanding of where to put the camera, and tell the story he wants to tell...I have to give it to him, he knows how to create tension.",
      "author": "Jaby Koay"
    },
    {
      "text": "James McAvoy does an outstanding job of playing Kevin, a man who manifests unique physical attributes for each of his 24 personalities.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "There are moments of true artistry in \"Split.\" But it's uncomfortable to watch because then it falls apart and makes no sense...So sparing the obvious pun, I'm on both sides of the fence on this one.",
      "author": "Leah Sydney"
    },
    {
      "text": "Still, I wish I could've seen a film of this subject matter taken a bit more seriously. It's not the '80s anymore. Movies should be smarter than this.",
      "author": "Damian Levy"
    },
    {
      "text": "Supported largely by James McAvoy's extraordinary talent who, with modulations of voice, gestures and mannerisms, creates various characters that fall in perfect harmony with the director's purpose. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "The way that Shyamalan and Gioulakis emphasize close-ups and medium shots make for a taut, clean forcefulness that...give Split a leaner, hipper feel very different from the increasingly aestheticized studio polish of Shyamalan's earlier work.",
      "author": "Jonathan Romney"
    },
    {
      "text": "Split possesses a dark sexual undercurrent that's all the more unnerving because it stays beneath the surface.",
      "author": "Megan Basham"
    },
    {
      "text": "I didn't think it was possible. I didn't think he could do it. but M Night Shyamalan is back. M Night Shyamalan has made a good movie.",
      "author": "Steph Cozza"
    },
    {
      "text": "A solid thriller right up until the end, when the director decides to play to his fans and his own indulgences, rather than tying things up for viewers in a more satisfying way.",
      "author": "James Plath"
    },
    {
      "text": "Without a doubt McAvoy's performance is the highlight... [Full review in Spanish]",
      "author": "Erick Ortiz"
    },
    {
      "text": "Brilliantly made but morally conflicted, Split has me divided. For pure artistry, I'd give it an A. For its queasy morality, I'd give it a C. Put them together and you've got a solid B.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "Shyamalan created a film to remember with Split. In today's cinematic world of sub-par horror films and predictable thrillers, this film serves as a breath of fresh air",
      "author": "Tyler Carlsen"
    },
    {
      "text": "Cautiously recommended.",
      "author": "Donald Clarke"
    },
    {
      "text": "It's nevertheless impossible to deny that Split, though rarely engrossing, remains quite watchable throughout.",
      "author": "David Nusair"
    },
    {
      "text": "Still, [James] McAvoy, with shaved head and predatory grin, approaches his perverse task with obvious relish, and Shyamalan whips up plenty of tension -- even in the face of some predictable twists and turns.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Shyamalan hasn't goosed a crowd this successfully since Signs. As someone who'd written him off, it's fun to have been wrong.",
      "author": "Steve Persall"
    },
    {
      "text": "M. Night Shyamalan is one of the most consistently interesting auteurs in contemporary American cinema. Split is further evidence.",
      "author": "Mike Thorn"
    },
    {
      "text": "McAvoy likely had a blast playing these disparate characters and I'd watch his campy one-man show anytime, but his hard work can't save this mess.",
      "author": "Al Hoff"
    },
    {
      "text": "Shyamalan concocts a clever premise and delivers one of the most suspenseful thrillers this decade bolstered by an outstanding turn by McAvoy.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "The horror maestro directs McAvoy to a completely bonkers performance full of scares and laughs (but most of all, terrific acting, made even more apparent during a scene that sees just about all 23 identities fighting for control at once)",
      "author": "Robert Kojder"
    },
    {
      "text": "Split may not be to everyone's taste, but the story, craftsmanship, and excellent performances will haunt you for quite a while. As will some beastly bits.",
      "author": "Alexandra MacAaron"
    },
    {
      "text": "Split [is] a genre picture that's fascinating, audacious and just kooky enough to be a lot of fun.",
      "author": "Kristen Lopez"
    },
    {
      "text": "Regardless of all the film's obvious plot problems, there are some excellent performances in this film, and the story is compelling, especially the story about Casey's background, and her strange affinity to Crumb's personality disorder.",
      "author": "Robert Roten"
    },
    {
      "text": "This is Shyamalan laughing at his own joke: the idea that people who don't have to will watch this.",
      "author": "Jennie Kermode"
    },
    {
      "text": "A smart thriller that is more interested in provocative ideas than it is in simply scaring the audience.",
      "author": "John Hanlon"
    },
    {
      "text": "If Shyamalan continues to bring his A-game to the big screen, he's more than welcome to jump on the franchise bandwagon.",
      "author": "Neil Soans"
    },
    {
      "text": "McAvoy has an absolute ball, Betty Buckley is spot-on as his over-dedicated psychiatrist and Morgan star Anya Taylor-Joy definitely catches the eye as the most resourceful of the three girls.",
      "author": "Matthew Bond"
    },
    {
      "text": "Split is a solid return to form for M. Night Shyamalan, but it's really James McAvoy's movie. It's worth seeing for McAvoy alone.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The pleasures of Split are ultimately just those of an enormously satisfying B-movie, and God bless it.",
      "author": "Tim Brayton"
    },
    {
      "text": "\"Split\" takes a step in this direction by positing that \"mental sickness\" might not always be an actual illness - but then takes two steps back by exploiting moviegoers' fears that people with unusual mental conditions can be unpredictably violent.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "Just when you thought it was safe to go back to a M. Night. Shyamalan movie - last year's \"The Visit\" had hinted at a return to his \"The Sixth Sense\" glory days - along comes this mess.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "The latest from The Sixth Sense director M. Night Shyamalan, Split has as many fractured identities as its main character",
      "author": "Kirsty Leckie-Palmer"
    },
    {
      "text": "Split isn't a complete return to form, but it reminded me of what a Shyamalan film used to promise: heart-racing unpredictability and a story that winds into a towering structure of queasy horror.",
      "author": "Kaori Shoji"
    },
    {
      "text": "\"Split\" is a tight thriller with Shyamalan's usual mastery of mood, and with a dream role for any actor that McAvoy somehow - mostly - resists ramping up into camp; he finds the humanity, cracked or otherwise, in each of Kevin's personae.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "\"Split\" is further evidence of MNS' mastery fashioning maddening echo chambers for his characters.",
      "author": "Blake Howard"
    },
    {
      "text": "The movie completely stands on its own, and shows Shyamalan doing what he does best: Taking an original idea and twisting it in a new way to keep you guessing and riveted until the very end.",
      "author": "Germain Lussier"
    },
    {
      "text": "Shyamalan obviously understands the concept of suspense, but apparently doesn't know how to apply it anymore. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "Shyamalan doesn't do enough with the tired premise to make it truly memorable, not even bothering to give all three of the captive girls distinctive personalities of their own.",
      "author": "Rain Jokinen"
    },
    {
      "text": "It's shot well. Its ominous setting, nestled deep in the pit of a dark, multi-layered, multi-doored complex puts you on edge. But the narrative -- LORD, this narrative -- becomes a steaming hot mess.",
      "author": "Candice Frederick"
    },
    {
      "text": "A movie that you can't stop watching. All McAvoy's interpretations of its protagonist are enjoyable and the movie doesn't waste time in sequences or unnecessary explanations. [Full review in Spanish]",
      "author": "Daniel Bernal"
    },
    {
      "text": "Split is [Shyamalan's] most thoughtful film in years, and one that contains ideas and feelings that resonate on a deep, visceral level.",
      "author": "Britt Hayes"
    },
    {
      "text": "In the end, Split isn't close to being the best film that Shyamalan has ever directed. But it does show that his career may be again headed in the right direction.",
      "author": "Dan Webster"
    },
    {
      "text": "It's Shyamalan's courage that makes the film a work worthy of its repertoire and that can be cataloged as something more than a simple thriller. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "The slow-build suspense Shyamalan nurtured in his best work is intact, generating the kind of creeping dread that doesn't rely on cheap shock-cuts or sharp spikes on the soundtrack.",
      "author": "John Serba"
    },
    {
      "text": "The best that Shyamalan has done in fifteen years and is, without a doubt, the best geek surprise so far this year. A must-see film that will undoubtedly earn an intriguing cult status. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "A film divided in flashbacks, but mainly in points of view and that its central concern is, as in The Sixth Sense, the incapacity of psychiatry to help those who suffer very peculiar mental illnesses. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "There are scenes of true horror and gore to be worth the price of admission.",
      "author": "Aakash Karkare"
    },
    {
      "text": "M. Night Shyamalan makes a great comeback with this captivating movie about an extreme (and terrifying) case of multiple personalities. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "[Split] is a solid thriller highlighted by a career-defining performance from McAvoy.",
      "author": "Jacqueline Coley"
    },
    {
      "text": "I let out an audible gasp at the end. That has never happened.",
      "author": "Rohan Naahar"
    },
    {
      "text": "M. Night Shyamalan has returned to the quality of his most celebrated films, offering a very entertaining movie with a good direction. [Full review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "In a twist as sharp as the ending to each of his cinematic creations, M. Night Shyamalan returns to form with film that actually isn't terrible in Split.",
      "author": "Alex Casey"
    },
    {
      "text": "Split is the great return of M. Night Shyamalan. An exciting film worthy of the best of his work. [Full review in Spanish]",
      "author": "Arturo Magaña"
    },
    {
      "text": "A story with several dyes of suspense and serial killers' horror. Undoubtedly the best film of M. Night Shyamalan in years, or at least, the most interesting. [Full review in Spanish]",
      "author": "Emiliano Basile"
    },
    {
      "text": "Within the conventional that \"Split\" may seem (in its aesthetics and structure), there are good moments in it and it's an entertaining film. [Full review in Spanish]",
      "author": "Hugo Lara"
    },
    {
      "text": "Split creates dark, claustrophobic and almost asphyxiating atmospheres, and amazing dialogues. [Full review in Spanish]",
      "author": "Lucero Solórzano"
    },
    {
      "text": "Shyamalan returns with a story where the horror is facing the different faces of evil, where James McAvoy manages to be a memorable villain. [Full review in Spanish]",
      "author": "Mario P. Székely"
    },
    {
      "text": "A nod that demonstrates the sincere despair of the filmmaker: in order to provoke emotion, he is able to remind us that he once made good films. And yes, but it was a long time ago. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "A film in which its structure is designed with high dose of credibility to keep the tension and curiosity on. [Full review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "Maybe it can be confusing if you don't have any reference of this director, because we are before an expansion of Shyamalan's filmic world. For those who have the antecedent, it's a surprise, like watching two films in one. [Full review in Spanish]",
      "author": "Oswaldo Betancourt Lozano"
    },
    {
      "text": "A return to form for M. Night who offers up his most cerebral tale yet.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "In the end we have a staggering actoral work in a dramatic thriller which curiosity is plunged by crushing too much in what has already been seen and understood. [Full review in Spanish]",
      "author": "Pilar Ayuso"
    },
    {
      "text": "An enjoyable piece of B-movie silliness, Split supplies mystery, suspense and creepy trepidation, and boasts a tour-de-performance from James McAvoy in the leading role. Or rather roles.",
      "author": "Jason Best"
    },
    {
      "text": "While this is certainly a step up from the likes of The Last Airbender and After Earth, it's still miles off Shyamalan's magnum opus, The Sixth Sense.",
      "author": "Marija Djurovic"
    },
    {
      "text": "I've never wanted to walk out of any movie more so in my life.",
      "author": "Anthony Ray Bench"
    },
    {
      "text": "The film's most positive quality is the performance turned in by James McAvoy. It's a dream role given he plays so many different characters.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Split sees M. Night Shyamalan elevated back into the veil of the serious filmmaking contenders.",
      "author": "David Keyes"
    },
    {
      "text": "Split seems at first like a venture into torture porn, but evolves into a more philosophical thriller exploring the extent to which the human mind can affect the physical world.",
      "author": "Nick Dent"
    },
    {
      "text": "Split is a true return to form for Shyamalan, who delivers the kind of film here, we craved from him the last few years.",
      "author": "Jack Bottomley"
    },
    {
      "text": "Split's success is more due to the skills of McAvoy in the lead role than the directing or writing of Shyamalan.",
      "author": "Matt Neal"
    },
    {
      "text": "A tense, sickly and atmospheric kidnapping thriller that handles off-the-field action to create tension, and that strengthens Casey's character drawing through flashbacks from his childhood that impact his ruggedness. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "It's too weird and entertainingly trashy to write off.",
      "author": "Aaron Yap"
    },
    {
      "text": "The result is a stimulating and rewarding exercise of a director who continues as a guardian of the dignity of the unknown. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Shyamalan does something that, in other hands, would be an annoying narcissistic gesture: a self-citation that radically transforms the identity of Split. [Full review in Spanish]",
      "author": "Jordi Costa"
    },
    {
      "text": "A movie that will make you come out with shivers and will make you want to talk about it with your friends. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "Not a great film and neither one of the best from M. Night Shyamalan, but it's the definitive confirmation that he's back. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Violently superficial.",
      "author": "J. Olson"
    },
    {
      "text": "The movie's simultaneous evocation of both the depravity at work beneath society's deceptive surfaces and the inadequacy of the liberal technocratic order to defend against that depravity is the secret to its success.",
      "author": "Richard Brody"
    },
    {
      "text": "It might be outlandish but it's just as limp, and that's the kicker.",
      "author": "Conor Bateman"
    },
    {
      "text": "Split shows that the arc of Shyamalan's career may not necessarily be going in the direction everyone says it is. (Splice Today)",
      "author": "Stephen Silver"
    },
    {
      "text": "This suspenseful and unsettling thriller is a welcome return to form for writer-director M. Night Shyamalan.",
      "author": "Tom Glasson"
    },
    {
      "text": "If you remember M. Night's work prior to The Happening and wished for a return to the kind of cerebral thrillers that the world was introduced to through his efforts, you're in for a treat.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "While individual scenes are occasionally thrilling in the moment, they don't hold much weight, and it ends with a whimper that suggests the director [...] hadn't really thought much beyond its admittedly nifty high-concept premise.",
      "author": "Glenn Dunks"
    },
    {
      "text": "Taylor-Joy has a sense of self-possession so fierce it's frightening, and ... her performance here does a great deal to pull Split above its sometimes queasy use of unspeakable trauma as a plot point.",
      "author": "Craig Mathieson"
    },
    {
      "text": "Split isn't a disaster; it's just all over the place and not nearly as effective as it should be for something with such a good premise and performances.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "Tepid pace hobbles \"Split.\"",
      "author": "Charles Koplinski"
    },
    {
      "text": "Without a doubt, this film is tense, lean and sometimes mean.",
      "author": "Margot Harrison"
    },
    {
      "text": "shows that Shyamalan doesn't need a twist to make an intense, engaging thriller that satisfies our morbid inner cravings",
      "author": "James Kendrick"
    },
    {
      "text": "Regardless of how you feel about the ending, though, most will note a tour de force performance from McAvoy, who is often called to transition between characters on a dime and easily proves to be the highlight of the film.",
      "author": "Josh Terry"
    },
    {
      "text": "An armrest-clutching psychological thriller that is bound to render you breathless by the time the credits roll...with the spirit of Alfred Hitchcock watching over him, M Night Shyamalan seems to have recovered his bearings.",
      "author": "Jim Schembri"
    },
    {
      "text": "The competition for next year's Best Actor Oscar nominations begins here in January with this, the first truly good Shyamalan film in a long while.",
      "author": "Bob Grimm"
    },
    {
      "text": "The biggest surprise here isn't the premise itself, or how the accompanying tale unfolds... it's how effectively everything plays out.",
      "author": "Sarah Ward"
    },
    {
      "text": "With nothing remotely human menacing the girls, the horrors visited upon them become just so much nasty sadism. And it's Shyamalan himself, not McAvoy's supposed character(s), who inflicts it. A deeply unpleasant movie.",
      "author": "Jim Lane"
    },
    {
      "text": "Three teenage girls are held captive in a grimy building somewhere by a madman with 23 personalities, but at least they aren't trapped in a theater watching this exercise in tedium from vaunted master of surprise M. Night Shyamalan.",
      "author": "J. R. Jones"
    },
    {
      "text": "Shyamalan orchestrates all of this early dread beautifully, like an uncomfortable symphony, with McAvoy playing all of the parts while shifting in demeanor, posture, accent and more with each new personality.",
      "author": "Michael Smith"
    },
    {
      "text": "A gripping and suspenseful film with a troubling relationship to mental illness.",
      "author": "Sadhbh Ní Bhroin"
    },
    {
      "text": "The director's use of offscreen space to generate tension is particularly expert, as demonstrated in an opening abduction sequence that is a film class-ready gem of purposeful framing, cutting and sound design.",
      "author": "John Beifuss"
    },
    {
      "text": "The combination of James McAvoy's riveting performance as Kevin... and The Witch's Anya Taylor-Joy as a sullen teenager he kidnaps, make the perfect tinder for M. Night Shyamalan's take on the abduction thriller genre to ignite.",
      "author": "Lauren Terry"
    },
    {
      "text": "Featuring a villain whose personality disorder means he has 23 distinct identities inhabiting his body, Shyamalan immediately falls into well-worn and deeply problematic tropes.",
      "author": "Roe McDermott"
    },
    {
      "text": "This is a filmmaker with almost no real talent for coherence, originality or purpose and in spite of his insistence on audience secrecy, his overly contrived plots are easy to figure out before the beginning of the second reel.",
      "author": "Rex Reed"
    },
    {
      "text": "Split is a great psychological thriller with supernatural reach, that works thanks to an excellent return to form by M. Nigh Shyamalan and a spectacular turn by James McAvoy. Oh, and that ending! [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Lurid and squicky, Split treads water and keeps too many secrets on a dull path to the revelation of its self-satisfied cleverness.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "A suspenseful supernatural thriller that becomes a teasing origin story, perhaps propelling a sequel.",
      "author": "Susan Granger"
    },
    {
      "text": "Though Split still doesn't approach the quality of The Sixth Sense and Unbreakable, it is proof that the writer-director finally has something interesting to say again.",
      "author": "Cameron Meier"
    },
    {
      "text": "Shyamalan has returned to what he loves to do: use cheap horror tropes to create his own harebrained mythos.",
      "author": "David Edelstein"
    },
    {
      "text": "McAvoy is in his element mincing about and scaring Taylor-Joy, while Shyamalan channels Hitchcock at his deviant best.",
      "author": "Hilary A White"
    },
    {
      "text": "In short, we are watching an old-fashioned exploitation flick-part of a depleted and degrading genre that not even M. Night Shyamalan, the writer and director of \"Split,\" can redeem.",
      "author": "Anthony Lane"
    },
    {
      "text": "A terrifying psycho thriller, an acting showcase for James McAvoy, and a return to form for M. Night Shyamalan, whose body of work since his brilliant The Sixth Sense has otherwise been a mess",
      "author": "Louise Keller"
    },
    {
      "text": "In Split, James McAvoy faces his greatest challenge yet: being directed by M. Night Shyamalan. (Oh, and playing two dozen distinct personalities. But mainly the first thing.)",
      "author": "Simon Miraudo"
    },
    {
      "text": "A film so well-designed that it turns out to have a dissociative identity of its own.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Shyamalan has made a horror movie that's cleverer than most, though not nearly as mind-blowing as his fervent admirers will claim.",
      "author": "Frank Swietek"
    },
    {
      "text": "It's far from perfect, but where so many modern horror movies are anonymous, Split has personality and then some.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "Marks a definite return to form for Shyamalan.",
      "author": "Wendy Ide"
    },
    {
      "text": "Shyamalan has been biding his time in The Twilight Zone, mounting, if not a comeback, a tentative second beginning ... More ingenious than scary; it could have used a few more hardcore shocks.",
      "author": "Glenn Lovell"
    },
    {
      "text": "To all of the shocking developments of the last 12 months, we may now add yet one more: M. Night Shyamalan has made a good movie.",
      "author": "Christopher Orr"
    },
    {
      "text": "Watching McAvoy play his many parts with such commitment is fun to watch - like a drag artist twirling kitchen knives and live chickens instead of feather boas. There's plenty of suspense and danger, but there's even more camp.",
      "author": "Katherine Monk"
    },
    {
      "text": "Unpleasant and pointless kidnapping thriller.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "McAvoy clearly is having a blast as the conflicted main character, altering his voice and mannerisms to create his varied personas ...",
      "author": "Greg Maki"
    },
    {
      "text": "You don't need a sixth sense to know the latest discombobulation emanating from the singular mind of M. Night Shyamalan is -- if nothing else -- a hugely entertaining affair.",
      "author": "Al Alexander"
    },
    {
      "text": "Deranged thriller will certainly split audiences, but it's a daring piece of cinema.",
      "author": "Chris Alexander"
    },
    {
      "text": "A rare, straight-up horror film from Shyamalan, Split is a thrilling reminder of what a technical master he can be.",
      "author": "Christy Lemire"
    },
    {
      "text": "You can find your share of entertainment here, but the price it exacts is brutal indeed. Fairly warned thee be, says I.",
      "author": "Rob Vaux"
    },
    {
      "text": "McAvoy gives a master class in performance in the multiple roles, relying less on costume changes than on language, facial expressions and physicality to transform.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "What likely will rejuvenate the career of former A-list filmmaker M. Night Shyamalan becomes a genuine creepy-crawly thriller around a remarkable performance by James McAvoy.",
      "author": "John Urbancich"
    },
    {
      "text": "Shyamalan demonstrates a mastery over the form of the mean and lean psycho-thriller, aided in no small party by the performances of McAvoy, Taylor-Joy and Buckley, and smooth-yet-unsettling camera work by cinematographer Michael Gioulakis.",
      "author": "Katie Walsh"
    },
    {
      "text": "[McAvoy] invests each of his characters' personalities with dramatic shadings of mannerism. This might have elevated Kevin to the stature of Anthony Perkins' Norman Bates, if Shyamalan's script had been as good as McAvoy's acting. It is not.",
      "author": "Randall King"
    },
    {
      "text": "Though the last 20 minutes may disappoint, the majority of the film is genuinely thrilling and, to its credit, an incredibly interesting premise.",
      "author": "Shelbie Lynn Bostedt"
    },
    {
      "text": "When put against the already-existing acclaimed movies, how does The Sixth Sense director M Night Shyamalan's latest fare? Relatively well it turns out and commendably so.",
      "author": "Amy West"
    },
    {
      "text": "This movie, even with some interesting side tangents I still need to think about and ruminate on, is ferocious, and coupled with sensational performances from McAvoy and Taylor-Joy proves to be January spellbinder worthy of a viewer's undivided attention.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "... a mildly unsettling but never truly frightening puzzle of a thriller that develops only intermittent tension as it seeks to find a personality of its own.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The movie as a whole is not serious enough to work as a drama and not entertaining enough to qualify as escapism.",
      "author": "Robert Levin"
    },
    {
      "text": "It's classic Shyamalan... and given his former heights, that's an impressive achievement.",
      "author": "Mark Ellis"
    },
    {
      "text": "Split does a terrific job of keeping us guessing and never allowing the audience to relax for too long; there's also some of the best humor Shyamalan has ever put on screen.",
      "author": "Kristian Harloff"
    },
    {
      "text": "Director Shyamalan really gets his mitts on you with this one: It's wild and suspenseful, and without his trademark trick of pulling the rug out from under you at the end with such a vigorous tug that you end up on your backside and not terribly amused.",
      "author": "Tom Gliatto"
    },
    {
      "text": "Not that it isn't entertaining at times... But Split falls way short of his brilliant The Sixth Sense -- or even his uneven Signs and The Happening.",
      "author": "Barry Paris"
    },
    {
      "text": "The patented \"Shyamalan twist\" completely derails what is, for a time, a very well-crafted chiller.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Directed by M Night Shyamalan, the horror-thriller is full of plot holes, but McAvoy's joyful and menacingly lunatic performance papers over most of them.",
      "author": "Kate Muir"
    },
    {
      "text": "In his best film since The Sixth Sense, Shyamalan employs menacing close-ups to create a mood of threatening claustrophobia.",
      "author": "David Stratton"
    },
    {
      "text": "Free from the expectations of splendor, spectacle, and huge box office returns, Shyamalan leans on dialogue, characters, atmosphere, and mood to tell his story. And he's a better filmmaker because of it.",
      "author": "Frank Wilkins"
    },
    {
      "text": "Shyamalan juggles all these borrowed balls with grace and skill; it's only when he adds in some of his own that he falters.",
      "author": "Matthew Lickona"
    },
    {
      "text": "It is a measure of Shyamalan's success that he finds room for so many different moods and feelings. The director may never return to his place in the film canon, but here he makes a case for a unique, intriguing new niche.",
      "author": "Alan Zilberman"
    },
    {
      "text": "It's the sort of outlandish setup one might expect from The Sixth Sense mastermind M. Night Shyamalan, and thanks to inspired turns from Taylor-Joy and Scottish actor James McAvoy, Split is often as engrossing as it is implausible.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Shyamalan is a one-trick pony who needs to find a new rodeo.",
      "author": "Peter Rainer"
    },
    {
      "text": "Shyamalan is clearly having fun here and we're laughing with him. As I said, it's a big improvement on After Earth.",
      "author": "Andy Lea"
    },
    {
      "text": "McAvoy and Taylor-Joy immediately establish an engaging, fluid chemistry - and Betty Buckley pops up in a subplot... And it's all expertly shot by It Follows cinematographer Mike Gioulakis.",
      "author": "Norman Wilner"
    },
    {
      "text": "It's a genuinely freaky movie, packed with unsettling touches and wonderfully intense performances.",
      "author": "Rich Cline"
    },
    {
      "text": "Shyamalan's popcorn picture is head-scramblingly strange - a chiller where both the bad guy and his victims are, well, victims.",
      "author": "Amy Nicholson"
    },
    {
      "text": "There are moments of fear and loathing in the story, but at just under two hours the whole production overstays its welcome, and isn't really as clever as the director would have us believe.",
      "author": "Chris Knight"
    },
    {
      "text": "Dark and derivative. PG-13? Are you kidding me? Don't send kids to this .",
      "author": "James Verniere"
    },
    {
      "text": "Director/writer M. Night Shyamalan returns with a chilling and disturbing slice of psychological horror.",
      "author": "Roger Tennis"
    },
    {
      "text": "Shyamalan's distinct style - stiff, formal, sometimes ludicrous and operatic, pockmarked with comedy - is back in full bloom.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Perhaps the most charitable way to look at Split is that is a cry for help by its director. \"Stop me before I film again,\" he seems to be saying.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "M. Knight Shyamalan's movies often have plots that chase their tails. This one is no different but James McAvoy's playing eight different characters is a treat.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Split is the best M. Night Shyamalan creation in recent memory, as anchored by a great performance (or, rather, performances) by James McAvoy.",
      "author": "Sandy Schaefer"
    },
    {
      "text": "Shyamalan has made the straightest thriller of his career, nearly free of the misguided detours and bonkers twists that made him famous. You wish it were messier.",
      "author": "Jeffrey Bloomer"
    },
    {
      "text": "Yes, it's terrific. We have a new Hannibal. Extraordinary performance by McAvoy. It's his next franchise. Will the next 10 years going to be all about Shyamalan all the time? Does he remember his last films with shame like we do?",
      "author": "Victoria Alexander"
    },
    {
      "text": "Split has a few decent jump scares but it's [James] McAvoy's performance more than any single scene that makes this horror film such a wild ride.",
      "author": "Rebecca Murray"
    },
    {
      "text": "McAvoy is having a grand time, and watching him slide from person to person is like an acting class for our benefit.",
      "author": "Robert Horton"
    },
    {
      "text": "With apologies to Mr. Cool J, this is indeed a comeback for Shyamalan.",
      "author": "Christian Toto"
    },
    {
      "text": "You have to see Split on its opening weekend.",
      "author": "Sonny Bunch"
    },
    {
      "text": "...smaller narratives better fit Shyamalan's eye. And \"Split\" is a successful more confined project that fits remarkably well into his quirky canon.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "It's all too much, despite a bravura performance by McAvoy, who sinks his teeth into the rich and unusual opportunity to portray so many unhinged villains",
      "author": "Jay Stone"
    },
    {
      "text": "McAvoy is excellent, but, for pure squeals and entertainment, the film falls short of Shyamalan's The Visit from 2015.",
      "author": "Brad Wheeler"
    },
    {
      "text": "\"Split\" doesn't do enough to overcome its weaknesses, bouncing between a grungy horror exploitation flick, a psychological thriller and a supervillain origin story.",
      "author": "Adam Graham"
    },
    {
      "text": "Nicely shot by Mike Gioulakis, Split keeps us riveted, laughing, jumping out of seats and guessing right to the end. It's a nasty little piece of work, Shyamalan's best in forever, and a juicy, macabre pleasure to watch.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Those final 30 or so seconds do a lot of work to cover up what is otherwise a mostly engaging piece of hokum, a grim kidnapping tale that makes a silly hash of psychology.",
      "author": "Richard Lawson"
    },
    {
      "text": "The narrative is choppy, the tension is less pervasive than it should be, and there's no ending.",
      "author": "James Berardinelli"
    },
    {
      "text": "Split earns its unsettling sense of the creeps and is a pleasure to regard even when it's not springing surprises",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Shyamalan creates nail-biting tension and gives McAvoy room to create a vast array of interesting characters within a single body. But it's disgusting how Shyamalan treats the three young women as meat, literally and figuratively.",
      "author": "Sean P. Means"
    },
    {
      "text": "It's immensely silly and, for the most part, nowhere near scary enough, but with James McAvoy quite clearly having an absolute blast it's still a funhouse ride worth taking.",
      "author": "Andy Psyllides"
    },
    {
      "text": "Shyamalan gets his Hitchcock groove on in this deviously playful horror thriller that satisfies as a companion piece to his earlier, more successful works.",
      "author": "Alan Jones"
    },
    {
      "text": "It's hard to imagine that Split will be embraced by mental health professionals but it makes for a tense, heart-in-the-mouth cat-and-mouse thriller.",
      "author": "Allan Hunter"
    },
    {
      "text": "The main reason anyone should check out Split is to marvel at McAvoy's breathtaking performance.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Split represents the director's A-game, and showcases his talent for fantastical storytelling grounded in the everyday.",
      "author": "Martyn Conterio"
    },
    {
      "text": "The film contends that people are purified by suffering. Having suffered through the screening, I'm still waiting for my purer self to kick in.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "\"Split\" is lurid and ludicrous, and sometimes more than a little icky in its prurient, maudlin interest in the abuse of children. It's also absorbing and sometimes slyly funny.",
      "author": "A.O. Scott"
    },
    {
      "text": "An unpredictable, suspenseful little tale that comes together surprisingly satisfyingly, thanks to clever plotting and a truly committed performance from McAvoy.",
      "author": "Steve Rose"
    },
    {
      "text": "Shyamalan has managed to deliver a fiercely effective, ferociously funny and genuinely gory horror movie, all without relying on a last act rug-pull.",
      "author": "Ali Gray"
    },
    {
      "text": "An enjoyably stacked entertainment, equally crunchy and silky in its desire to be as appetizing a two hours as you could spend in suspended disbelief.",
      "author": "Robert Abele"
    },
    {
      "text": "M. Night Shyamalan's Split is a thriller with a perspective from a time when the stigmatization of mental illness was rarely, if ever, considered.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The director's fans will undoubtedly cheer the final form of the picture, but it's a big reach for a movie that doesn't have the wingspan to begin with.",
      "author": "Brian Orndorf"
    },
    {
      "text": "If \"Split\" were a drama released in the final months of the year, James McAvoy would be getting awards talk, but its \"lesser\" genre status means that he likely won't receive the attention the performance(s) deserve.",
      "author": "Kimber Myers"
    },
    {
      "text": "A solid encapsulation of what Shyamalan is all about.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Split is all about atmosphere and build-up, which Shyamalan renders suitably claustrophobic.",
      "author": "Jim Slotek"
    },
    {
      "text": "[McAvoy] is an actor at the top of his game, flipping all the switches when it comes to the audience's emotions.",
      "author": "Harry Guerin"
    },
    {
      "text": "The results aren't flawless, but Split is nevertheless a tense, exciting thriller anchored by a stunning performance by James McAvoy. And it may just restore Shyamalan fans' belief in the power of the twist ending.",
      "author": "Bryan Bishop"
    },
    {
      "text": "I went with it. I got back on that M. Night bandwagon, and the finish line in particular was just spectacularly fantastic.",
      "author": "Richard Roeper"
    },
    {
      "text": "His new movie, Split, brings a twist not even most Shyamalan fans could have seen coming: It's his best film since The Sixth Sense.",
      "author": "Brad Keefe"
    },
    {
      "text": "Filmmaker M. Night Shyamalan launches a full-fledged comeback with this tense, satisfying horror-thriller. Split is refreshingly infused with thoughtful ideas and sly suggestion, rather than gore or brutality.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Split is a movie worth taking a step out of your comfort zone for. It won't make you sorry you took the chance.",
      "author": "Michael Heaton"
    },
    {
      "text": "For all its genre trappings, \"Split\" comes from a cerebral perspective. Or at least one more concerned with psychology than gory physiology.",
      "author": "Jon Niccum"
    },
    {
      "text": "Shyamalan's skill as a filmmaker-his instincts for crisp editing, his knack for navigating shifting points of view-have always been stronger than his ideas. That's true here, too, yet Split is compulsively watchable.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Like the villain of Split, Shyamalan's worst enemy just might be himself.",
      "author": "Ryan Porter"
    },
    {
      "text": "When Shyamalan embraces his identity as a horror director with a knack for surprises, more fun is had by all.",
      "author": "Amy Rowe"
    },
    {
      "text": "For most of its nearly two-hour running time, \"Split\" is quite enjoyable, a clever one-up of \"Psycho\" with some interesting twists and several funny-creepy moments.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The movie falls oddly flat: less tantalizingly enigmatic \"et cetera\" than \"blah blah blah.\"",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "Split's giddy nonsense ultimately dissolves in a scrum of half-realized ideas, but maybe that's exactly Shyamalan's goal ...",
      "author": "Leah Greenblatt"
    },
    {
      "text": "James McAvoy plays 24 personalities in Split, and you can't be sure if M. Night Shyamalan intended this to be a suspense-diluted horror film or a professional resume reel showcasing the actor's astonishing versatility.",
      "author": "Dann Gire"
    },
    {
      "text": "James McAvoy is a one man show here. He gives a psychopathic tour de force performance. Split is M. Night Shyamalan's best film in fifteen years.",
      "author": "Julian Roman"
    },
    {
      "text": "Give James McAvoy an award (or 24) for his performance in Split.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Somewhere in [M. Night Shyamalan's head] is another killer story. But \"Split\" isn't it.",
      "author": "David Medsker"
    },
    {
      "text": "M. Night Shyamalan's story of a kidnapper with serious identity issues is an acting showcase for James McAvoy - and first-rate creepfest.",
      "author": "Peter Travers"
    },
    {
      "text": "Moodying with faux menace around the nutter's underworld, Shyamalan fails to develop his three-pack of vapid victims and pads his script with go-nowhere plot twists.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Shyamalan weaves a devilishly demented web of clues, and you never know where he's going until he gets there. And when he does, hang on. It gets wild, in more ways than one.",
      "author": "Neil Pond"
    },
    {
      "text": "Having weathered the ups and downs of more than 20 years in Hollywood, Shyamalan proves he's still capable of delivering a harrowing thriller, one smartly of a piece with his cinematic past, yet standing on its own as a diverting experience.",
      "author": "Preston Jones"
    },
    {
      "text": "Distressing, narratively convenient exploitation that gets by on the strength of McAvoy's fearless, electrifyingly adaptive performance.",
      "author": "Peter Keough"
    },
    {
      "text": "This measured, diligently crafted register feels like Shyamalan back on home turf.",
      "author": "Robbie Collin"
    },
    {
      "text": "Split is funnier, campier, and more freewheeling than anything its writer-director has done-slightly overlong, but reminiscent of Brian De Palma films like The Fury and Femme Fatale in its refusal to be boring.",
      "author": "Ignatiy Vishnevetsky"
    },
    {
      "text": "\"Split\" doesn't just revive Shyamalan's career; it resurrects his brand.",
      "author": "Justin Chang"
    },
    {
      "text": "Split is a deeply disturbing film that covers every evil human deed from kidnapping to cannibalism. But it's also wildly funny in parts.",
      "author": "Tirdad Derakhshani"
    },
    {
      "text": "M. Night Shyamalan has made a welcome return to form, handing James McAvoy one (or rather, some) of the best roles of his career.",
      "author": "Matthew Turner"
    },
    {
      "text": "It retains the same scrappy B-movie charm, telling a sometimes familiar horror story with confidence and a surprising amount of depth.",
      "author": "Josh Bell"
    },
    {
      "text": "Maybe it's not saying much to note this is M. Night Shyamalan's best film in years; what really seals the hey-this-is-good deal here is James McAvoy, who elevates this horror handily.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Except for a late Shyamalan-ish wink at the audience, \"Split\" is rarely fun or frightening.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Everything hangs together -- barely -- because of McAvoy's portrayal of the deranged captor",
      "author": "John Lui"
    },
    {
      "text": "After so many films that relied on [overwrought twist endings]... it seems like Shyamalan has finally gotten over the hump to make the kinds of stories he makes best: atmospheric, suspenseful potboilers.",
      "author": "Jim Vorel"
    },
    {
      "text": "A movie with drama elements that ends up being a horror film in an almost imperceptible narrative game, very well integrated by Shyamalan. [Full review in Spanish]",
      "author": "Israel Paredes"
    },
    {
      "text": "Unfortunately, you could probably improve \"Split\" by editing out everything around McAvoy and making it an experimental one-man show.",
      "author": "Sara Stewart"
    },
    {
      "text": "Split is personal and outlandish, with questionable themes, riveting plotting, somber storytelling, and elegant construction.",
      "author": "Henry Stewart"
    },
    {
      "text": "\"Split\" is always watchable, and occasionally great. And that's probably more than even the most forgiving former Shyamalan fan ever thought they'd see again.",
      "author": "Peter Hartlaub"
    },
    {
      "text": "For much of its running time, the film is tense and genuinely intriguing.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Split is never as clever or poignant as it thinks it is, but James McAvoy won't let it be forgotten, either.",
      "author": "Matt Donato"
    },
    {
      "text": "\"Split's\" biggest asset is James McAvoy...portraying 8 or 9 of his character's 24 alters, often within the same scene (in one scant minute or so near the end McAvoy runs through them all in a jaw dropping display).",
      "author": "Laura Clifford"
    },
    {
      "text": "This is no mere midnight movie. Shyamalan couldn't make one of those to save his life.",
      "author": "Matt Prigge"
    },
    {
      "text": "If anyone was hesitant to declare The Visit a sign that M. Night Shyamalan's pendulum career is back on the upswing, Split should do much to convince them.",
      "author": "Mike Scott"
    },
    {
      "text": "After that streak of deadly misfires it's nice to see Shyamalan enjoying himself again.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "M. Night Shyamalan's thrilling and satisfying return to form showcases an entertaining, multi-faceted role for James McAvoy.",
      "author": "Edward Douglas"
    },
    {
      "text": "Split feels rushed and careless, spectacularly bungling a premise that had potential.",
      "author": "Kristy Puchko"
    },
    {
      "text": "An eerie and intimate psychological thriller with Hitchcockian tones harkening back to the Shyamalan's early 2000s run that put him on the filmmaking map.",
      "author": "Brian Truitt"
    },
    {
      "text": "There's a tiny shiver of something in the final few seconds that doesn't exactly change what we've watched so much as say, \"I'm still M. Night Shyamalan, and I'm still crazy!\" He's become his own twist ending.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "In Shyamalan's inventive meta-psychodrama, it's 23 (or so) characters in search of an author.",
      "author": "Anton Bitel"
    },
    {
      "text": "There's a locked-room mystery going on inside Kevin's head. But Split shows too little of the individual selves for viewers to develop a stake in puzzling out who's up to what.",
      "author": "Alan Scherstuhl"
    },
    {
      "text": "Shyamalan papers over plot-holes with dry black humour and well-judged suspense, and - as always - holds back some surprises.",
      "author": "Kim Newman"
    },
    {
      "text": "Writer-director M. Night Shyamalan's low-budget treat savors its midnight-movie creepiness, and yet its gripping finale turns out to be more emotional than one might expect.",
      "author": "Tim Grierson"
    },
    {
      "text": "McAvoy's finest turn since Filth, is enough to turn this inane, absurd piece of cinema, into a rather good one.",
      "author": "Stefan Pape"
    },
    {
      "text": "This is a Shyamalan movie through and through. And it's his best in some time, thanks to a magnetic McAvoy.",
      "author": "Neil Smith"
    },
    {
      "text": "It's a sensational performance (or performances) from McAvoy, switching between many of these oddballs as they struggle to become the dominant force inside their host.",
      "author": "James Mottram"
    },
    {
      "text": "'Split' is thrilling in the moment but bungles the final stretch in a way that invalidates its arcs and subtexts.",
      "author": "Scott Mendelson"
    },
    {
      "text": "SPLIT is yet another step in the right direction for M. Night Shyamalan.",
      "author": "JimmyO"
    },
    {
      "text": "An engaging, stylish psychological thriller.",
      "author": "Alex Welch"
    },
    {
      "text": "Where Split lost me was when it shifted focus to Barry. He could be a captivating antagonist and certainly a bravura performance by McAvoy, but following him this closely robs him of mystery and just plain overestimates how interesting he is.",
      "author": "Fred Topel"
    },
    {
      "text": "James McAvoy gives a terrifying career-best performance in Shyamalan's best film since Signs.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "While Split takes dissociative identity disorder to a more ridiculous extreme than most other depictions, the movie has a sympathetic core.",
      "author": "Dan Schindel"
    },
    {
      "text": "...reminds you that suspense is his natural milieu, while also making clear that some of the aspects of his work that have been considered unintentional camp are in fact his deliberate, deadpan sense of humor in play.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "A welcome return to form from 'The Sixth Sense' director M. Night Shyamalan, whose unhinged new mind-bender is a worthy extension of his early work.",
      "author": "Peter Debruge"
    },
    {
      "text": "This is as straightforward a thriller as M. Night Shyamalan has delivered in years, and that works both to its advantage and detriment. And no, it's not an even split between the two.",
      "author": "Rob Hunter"
    },
    {
      "text": "The director ties themes together at the end with more finesse than usual, letting a couple of meaningful visuals speak for themselves where he might have thrown in a line or two of explanatory dialogue.",
      "author": "John DeFore"
    },
    {
      "text": "Split really is a movie for all sorts of personalities.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Only James McAvoy's multi-faceted performance saves the movie from complete mediocrity.",
      "author": "Jette Kernion"
    },
    {
      "text": "Split is a solid example of the type of elevated B-movie potboiler at which Shyamalan excels, and to which he thankfully seems to be re-committing his energies.",
      "author": "Katie Rife"
    },
    {
      "text": "Split is good, 'ole fashioned Shyamalan. It will greatly reward those who have still stuck with the filmmaker throughout his career and will hopefully introduce a new generation to his special brand of storytelling.",
      "author": "Peter Hall"
    },
    {
      "text": "Split is one further step for Shyamalan on the road to cinematic redemption. We can only hope he continues to work at this level of production.",
      "author": "Marten Carlson"
    },
    {
      "text": "M. Night Shyamalan's latest film is entertaining, scary, and full of surprises, with an amazing performance by James McAvoy.",
      "author": "Alan Cerny"
    },
    {
      "text": "M. Night Shyamalan is back, baby, and the best he's been in decades.",
      "author": "Haleigh Foutch"
    }
  ],
  "release_year": 2017,
  "duration": 117,
  "genres": [
    "Mystery & Thriller",
    "Horror",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Though Kevin (James McAvoy) has evidenced 23 personalities to his trusted psychiatrist, Dr. Fletcher (Betty Buckley), there remains one still submerged who is set to materialize and dominate all of the others. Compelled to abduct three teenage girls led by the willful, observant Casey, Kevin reaches a war for survival among all of those contained within him -- as well as everyone around him -- as the walls between his compartments shatter.",
  "popularity": 7.9,
  "poster_url": "https://image.tmdb.org/t/p/original/lli31lYTFpvxVBeFHWoe5PMfW5s.jpg"
}