{
  "movie_name": "Superbad",
  "movie_id": "superbad",
  "total_reviews": 206,
  "reviews": [
    {
      "text": "The best of all of that era’s comedies, and one of the funniest teen movies ever\" (25th anniversary)",
      "author": "Stephen Silver"
    },
    {
      "text": "The oftentimes outrageous dialogue and vulgar exchanges between stars Michael Cera and Jonah Hill are both wildly hilarious and genuinely portrayed.",
      "author": "Mike Massie"
    },
    {
      "text": "An intelligent and occasionally insightful look at the sometimes scary place we call the adolescent male mind.",
      "author": "Richard Propes"
    },
    {
      "text": "There are enough laughs to make it worth your time. It may not be super good, but it is good enough.",
      "author": "Micheal Compton"
    },
    {
      "text": "Hysterically funny and also strangely poignant and heartfelt.",
      "author": "Mattie Lucas"
    },
    {
      "text": "... \"Superbad\" isn't perfect. But it's super close.",
      "author": "Devin Gordon"
    },
    {
      "text": "Yes, Superbad is a boy's story, so a certain perspective should be expected, and it's not the cheerful filth that bothers me, nor even the conventional morality; it's the paternalism.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "... the love child of American Pie and Dazed and Confused.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Superbad is a movie about partying and getting wasted and getting the girl, but as the night wears on, much wisdom is gained too, about self, friendship and the end of teenage innocence in all its wondrous, terrifying splendor.",
      "author": "Scott Foundas"
    },
    {
      "text": "Beneath the swearing and the tampon jokes lies a sweet-hearted tale of three chums celebrating the end of their carefree high-school days.",
      "author": "Chris Knight"
    },
    {
      "text": "It's a simple tale about two horny kids not only on a quest for vodka, beer and sticky fumbling, but they're looking to find themselves in the process. I'll be damned if there's many people left in the cinema afterwards who won't relate to that.",
      "author": "Ali Gray"
    },
    {
      "text": "Honest goodwill, fond observational detail and Greg Mottola's exuberant direction make the picture nigh on irresistible, but there are some missteps.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "The affable trajectory covers enough guffaws to balance out the flattest visuals this side of The Computer Wore Tennis Shoes",
      "author": "Fernando F. Croce"
    },
    {
      "text": "Like all Apatow productions, it's far too long but it has a winning combination of cleverly crude humor and genuine sweetness.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "What makes the film so appealing is the disconnect between what comes from the mouths of these hormone-addled pups and what's going on in their heads, where they're still clinging desperately to the innocence they're leaving behind.",
      "author": "Bob Mondello"
    },
    {
      "text": "With Superbad, Rogen continues to show off his writing skills, delivering one of the most viciously funny movies since Super Troopers.",
      "author": "Brian Gibson"
    },
    {
      "text": "[Cera] has some of the best comic timing of anyone working in film today, a precocious sense of the awkward pauses and misread cues in which social panic resides.",
      "author": "Christopher Orr"
    },
    {
      "text": "The comic-duo of Jonah Hill and Michael Cera reminded me of an immature, foul-mouthed Laurel & Hardy.",
      "author": "Jeff Bayer"
    },
    {
      "text": "even if Superbad's not much more than a teen comedy, it's the best teen comedy to come out in at least a decade. There's no shame in that.",
      "author": "Sean Gandert"
    },
    {
      "text": "Thanks to Rogen and Apatow we can once again look forward to seeing R-rated comedies.",
      "author": "Adam Tobias"
    },
    {
      "text": "Raunchy enough, but it lacks some of the subtle wit and verbal sophistication that has always distinguished Apatow's finest comedies.",
      "author": "Rossiter Drake"
    },
    {
      "text": "Audiences who've laughed their asses off at Rogen's other work will be pleased to know that Superbad is not just another teen movie.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "The thing that saves Superbad from being a profane waste of time is its urbane intelligence and above all, bracing honesty.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "Although the cop characters run out of steam a bit towards the end, the metrosexual relationship between the leads stays fresh all the way through. Brilliant.",
      "author": "Simon Thompson"
    },
    {
      "text": "... a humanizing comedy built around the coming-of-age absurdity of actually getting whatever it is you think you want.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Maybe I would have been better off seeing Superbad before it became an instant cult classic.",
      "author": "Gabe Leibowitz"
    },
    {
      "text": "This is the funniest picture since Borat, and more emotionally nuanced than you would expect.",
      "author": "Tom Charity"
    },
    {
      "text": "be sure to stick it out through the closing credits. You'll thank me later.",
      "author": "Marlow Stern"
    },
    {
      "text": "So bad that it's good, Superbad takes talking dirty on screen to a new level that will serve as shock treatment for some, and leave the rest in stitches.",
      "author": "Prairie Miller"
    },
    {
      "text": "Yet another in a fine line of the coming of age buddy comedies...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Super bawdy, super profane -- and super funny.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "Solidifies Apatow's reputation as the guiding force behind a small but significant community of comic filmmakers. He is becoming to crude comedies what Steven Spielberg was to family-oriented fantasies in the 1980s.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "Superbad makes cultural statements that should be every bit as disturbing as blaxploitation's were.",
      "author": "Stephen Himes"
    },
    {
      "text": "Young though they may be, lead actors Hill and Cera are adept in two different schools of comedy.",
      "author": "Brian Marder"
    },
    {
      "text": "It will be a classic for years to come.",
      "author": "Greg Maki"
    },
    {
      "text": "By turns funny and charming, heartfelt and horny, Superbad is a teen comedy that understands the awesome power of awkward.",
      "author": "Sean P. Means"
    },
    {
      "text": "It's misogynistic, homophobic and only occasionally funny.",
      "author": "Philip French"
    },
    {
      "text": "Easily one of the funniest movies of the year.",
      "author": "Gary Thompson"
    },
    {
      "text": "Its keen sense of self-criticism makes it the superbaddest one of all.",
      "author": "Rob Humanick"
    },
    {
      "text": "If you can stand the predatory assumptions, which are that girls are mere sex objects to most teenage boys, there's much more to this movie than the usual teen comedy. You can't help laughing even as you wince.",
      "author": "Derek Malcolm"
    },
    {
      "text": "Bawdy, demented and gloriously feel-good, Superbad is as super as comedies get.",
      "author": "Neil Smith"
    },
    {
      "text": "The observation of their insecurity and antagonism is very accurate; my problem is that it's not all that funny.",
      "author": "Anthony Quinn"
    },
    {
      "text": "The film proves only that a Hollywood fixated on the slapstick potential of teenage growing pains is finding it harder than ever to say, \"Bye, bye, American Pie\".",
      "author": "Nigel Andrews"
    },
    {
      "text": "It's a film that makes American Pie seem sophisticated, and it will have cultural critics shaking their heads and muttering about the death of Western civilization. I loved it.",
      "author": "Sukhdev Sandhu"
    },
    {
      "text": "A knocked-down version of producer Judd Apatow's brand.",
      "author": "The Sneak"
    },
    {
      "text": "It's pretty crass and pretty silly, but only a puritanical grump would deny it's funny.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The highest gag-to-running-time ratio I can remember.",
      "author": null
    },
    {
      "text": "There are some excruciatingly funny moments but there are perhaps not as many laughs as you would hope for given the script's comedy pedigree.",
      "author": "Wendy Ide"
    },
    {
      "text": "Disappointment of the week.",
      "author": "Christopher Tookey"
    },
    {
      "text": "It's not for the easily offended, but look past the fabulously crude dialogue, and Superbad is one of the most consistently funny and enjoyable teen comedies in years.",
      "author": "Saxon Bullock"
    },
    {
      "text": "The funniest film since, um, Knocked Up. What it lacks in novelty it makes up for with consistency. Supergood.",
      "author": "Matthew Leyland"
    },
    {
      "text": "It's as if Mike Leigh decided to make a gross-out comedy.",
      "author": "Paul Arendt"
    },
    {
      "text": "Doesn't quite have the insight of a classic, but it'll have you smirking for weeks.",
      "author": "Matt Bochenski"
    },
    {
      "text": "'Superbad' at its best goes right through knockabout to land in deliciously obscene places - notably a staggering succession of doodles in which tumescent cocks take on various extraordinary guises.",
      "author": "Ben Walters"
    },
    {
      "text": "The main idea behind Superbad is to put all the stupid things boys and girls do into one night of mayhem. Most of it is fuelled by drink and hormones and nearly all of it is from life.",
      "author": "Paul Byrnes"
    },
    {
      "text": "A genuinely hilarious teen comedy with a fantastic script and wonderful comic performances from its three leads.",
      "author": "Matthew Turner"
    },
    {
      "text": "I find myself reflecting not upon the hilarity (of which there is more than enough here), but upon how desperately sad so much of the film is behind the booze and boob jokes.",
      "author": "Tim Brayton"
    },
    {
      "text": "Equally hilarious and heartfelt, this is the best teen movie since American Pie and should make stars of the fantastic Cera and Hill.",
      "author": "Olly Richards"
    },
    {
      "text": "Hill, who I predicted big things for in my review of \"Knocked Up,\" is perfectly cast.",
      "author": "Michael A. Smith"
    },
    {
      "text": "It does contain some funny moments and even a few, really funny moments, but overall I didn't find it to be nearly so good as it has been built up to be.",
      "author": "Scott Nash"
    },
    {
      "text": "Funny, with echoes of Revenge of the Nerds and believe it or not, a bit of heart.",
      "author": "Vic Holtreman"
    },
    {
      "text": "Ribald repartée is the engine that drives the script, and the lead duo are nimble with the often-foul one-liners and fearless with the go-for-broke comic situations.",
      "author": "Michael Dequina"
    },
    {
      "text": "Perfectly honest about the late adolescent male experience, in all its hilarious ugliness.",
      "author": "James Kendrick"
    },
    {
      "text": "For a comedy as anarchic and filthy as Superbad to end on such a convincing note of McLovin is an unlikely triumph.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "...subversively spry...one will come away with a strange sense of raunchy resonance that hasn't been quite felt before in aimless fratboy flatulent farces.",
      "author": "Frank Ochieng"
    },
    {
      "text": "Every teenage boy's fantasy is covered in this critic proof imbecile comedy that is crammed with gross-out humour, foul language and superbad taste.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "Absolutely filthy, but in an intelligent kind of way, \"Superbad\" storms onto the screen with chaos, profanity and hilarity.",
      "author": "Linda Cook"
    },
    {
      "text": "Whenever it centers on its teenage characters, Superbad is a likable coming-of-age comedy; whenever it focuses on the tedious antics of the cops, it turns into a bad SNL skit.",
      "author": "Matt Brunson"
    },
    {
      "text": "Superbad has one detail I've never seen in a teen movie before: The sight of kids drinking alcohol and gagging after every swig.",
      "author": "Mark Palermo"
    },
    {
      "text": "A critical mass of these kinds of flicks argues for a new subgenre: \"nerdsploitation.\"",
      "author": "Lisa Kennedy"
    },
    {
      "text": "In spite of the film's startling deluge of dirty dialogue and sight gags, tender notes are struck.",
      "author": "Christopher Smith"
    },
    {
      "text": "Superbad may not linger in the memory, but its often riotous comedy is engaging and the journeys that Evan, Seth and McLovin take are, believe or not, eventually heartfelt.",
      "author": "John Wirt"
    },
    {
      "text": "If Beaches was the ultimate chick flick, Superbad is one for all dudes, young and old.",
      "author": "Randy Shulman"
    },
    {
      "text": "The reassuring message of 2007's most uproarious film is there's no prefab, encompassing approach to life - just a hope that stumbled-upon strengths will work. On the way, barking at the moon can be a great temporary defense mechanism.",
      "author": "Nick Rogers"
    },
    {
      "text": "One of the best teen sex comedies ever made.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "This is the kind of comedy that causes you to throw your head back, stomp your feet, and pound on the armrest. The laughs are so big that your whole body reacts, not just your mouth.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Although Superbad often runs the risk of being a one-note joke, there's still enough heart to the story and appealing characters to highly recommend it. Superbad certainly isn't on par with other recent Apatow productions such as Knocked Up and The 40 Yea",
      "author": "Stax"
    },
    {
      "text": "High school virgins equipped with attitude and wit and resentment, they are, at the same time, kids who have no idea how to manage being high school virgins.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "It's the film's generous heart and its depiction of the end of the era of adolescence that wins out, making Superbad more of a joy than a chore.",
      "author": "Ken Hanke"
    },
    {
      "text": "American Graffiti, Sixteen Candles and Dazed and Confused, bow to your new master. It super freaking rocks.",
      "author": "Kyle Smith"
    },
    {
      "text": "Somehow, the unlikely combination of crass comedy and romance really works.",
      "author": "Robert Roten"
    },
    {
      "text": "Imagine American Pie and South Park blending into one film.",
      "author": "Ross Anthony"
    },
    {
      "text": "At its best it's naggingly and obscenely funny, but its 'heart' fails to convince.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Superbad is easily one of the funniest comedies of the year and one you wouldn't mind seeing again and again.",
      "author": "Michael Ferraro"
    },
    {
      "text": "Superbad is funny stuff for the young at heart.",
      "author": "Gary Brown"
    },
    {
      "text": "Superbad is inspired coming of age comedy for real, nerdy, mixed-up, uncertain people; it's uproariously funny coming of age for the rest of us.",
      "author": "Brian Webster"
    },
    {
      "text": "You'll have to take about 15 showers to get the taint of \"Superbad\" out of your system, but laughter is almost guaranteed.",
      "author": "Dan Lybarger"
    },
    {
      "text": "The film is rude and crude, but it's truthful about those elements, about its characters, and, above all, about the experience of being young and stupid.",
      "author": "Mark Dujsik"
    },
    {
      "text": "A relentlessly-raunchy cross between American Pie and Harold & Kumar Go to White Castle, a laugh out loud teensploit that's every bit as funny as either of those classics.",
      "author": "Kam Williams"
    },
    {
      "text": "Getting some good, hardcore laughs this summer, thanks to Apatow and friends.",
      "author": "Bob Grimm"
    },
    {
      "text": "Superbad is the perfect crude teen comedy to end the summer on. It's funny, a little bittersweet and it signals something coming to an end.",
      "author": "Beth Accomando"
    },
    {
      "text": "Jonah Hill and Michael Cera displayed some of the best on-screen chemistry I've seen all year, and newcomer Christopher Mintz-Plasse squeezed his shtick in there at just the right moments.",
      "author": "Erik Davis"
    },
    {
      "text": "Superbad... sometimes a title says all you need to know.",
      "author": "Cherryl Dawson and Leigh Ann Palone"
    },
    {
      "text": "Even though it takes the low road, this guided tour of Loserville offers as many belly laughs as Knocked Up -- and that's saying a lot.",
      "author": "Joe Williams"
    },
    {
      "text": "Superbad just might be one of the best teenage sex comedies ever made.",
      "author": "Jason Zingale"
    },
    {
      "text": "It's Booty Call for the Knocked Up generation.",
      "author": "Fred Topel"
    },
    {
      "text": "There's no denying it's pretty funny, although you may hate yourself for laughing.",
      "author": "Jim Lane"
    },
    {
      "text": "One can almost imagine the characters portrayed by Hill, Cera and Mintz-Plasse growing up to be the Lebowski unholy troika of Bridges, Turturro and Goodman.",
      "author": "Richard Horgan"
    },
    {
      "text": "Superbad is a funny, boozy, ramshackle party, but it's more likely to leave audiences with a tingly afterglow than a pounding hangover.",
      "author": "Nathan Rabin"
    },
    {
      "text": "Like attending a reunion or opening a yearbook, I know I'll be looking back fondly on Superbad for years to come, and laugh my ass off every time.",
      "author": "Brian Tallerico"
    },
    {
      "text": "[I] found the slapstick jokes silly but not funny; that the girls were just used as ciphers, representing temptation for the fellas; and that it ends with a gooey finish that fails to make the comedy as relevant as it seems to think it is.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "So is it funny? The best parts -- and there are many of them -- trigger fits of helpless, howling glee. Is it raunchy, depraved, filthy beyond all excuse or redemption? Only the best parts.",
      "author": "Kurt Loder"
    },
    {
      "text": "Superbad, essentially, is the filthiest episode of Freaks & Geeks ever.",
      "author": "Devin Faraci"
    },
    {
      "text": "A four-letter raunch-a-rama with a heart.",
      "author": "Roger Ebert"
    },
    {
      "text": "Contains laughs galore, so many that the last one may get in the way of next one coming. But it's also got moments where you may want to cover your eyes to shield yourself from the sheer, wince-inducing familiarity of the behaviour on display.",
      "author": "Geoff Pevere"
    },
    {
      "text": "An avalanche of d--- jokes and strenuous slapstick.",
      "author": "Richard Corliss"
    },
    {
      "text": "Every generation seems to have one iconic comedy that gets to a special place... and lives on forever as a true classic of its times. For this generation Superbad is going to be that film.",
      "author": "Pete Hammond"
    },
    {
      "text": "For pure laughs, for the experience of just sitting in a chair and breaking up every minute or so, Superbad is 2007's most successful comedy.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Its young actors are pitch perfect.",
      "author": "Carla Meyer"
    },
    {
      "text": "The soundtrack is, for some mysterious and yet immensely pleasurable reason, heavy on '70s funk. Like so many things in Superbad, it's a curious choice that manages, over time, to seem just right.",
      "author": "Shawn Levy"
    },
    {
      "text": "This hormonal answer to Reefer Madness is good, wacked-out fun.",
      "author": "Jack Mathews"
    },
    {
      "text": "As coarse as the movie gets, there is always an undertone of sweetness to accompany the toilet humor.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Coming to terms with inevitable changes to a deeply dependent friendship is at least as key an issue for the two boys, and it's presented here with great emotional intelligence and even grace.",
      "author": "Bob Strauss"
    },
    {
      "text": "Super-awesome -- a miracle of crudeness and charm that counters its coarseness with sincerity.",
      "author": "Kevin Williamson"
    },
    {
      "text": "Even this middle-age hausfrau can appreciate the zonkered comic force behind Superbad, whose rambling plot and profane bull sessions reminded me of Danny Leiner's Harold & Kumar Go to White Castle.",
      "author": "Amy Biancolli"
    },
    {
      "text": "The writers shoot often and copiously, and they're obviously in love with their ability. Now, if they could just get some sort of focused, confident rhythm going, they might make things more satisfying for the audience as well.",
      "author": "Liam Lacey"
    },
    {
      "text": "It isn't super, as it intersperses crudely funny gags with an equal number of dry spots.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "I wanted to find this as funny as audiences did. But it mostly made me understand the case for staying a virgin until you're 40.",
      "author": "Wesley Morris"
    },
    {
      "text": "Keenly observed, good-natured and funny.",
      "author": "Michael Sragow"
    },
    {
      "text": "I can't get over the misogynist undertones of yet another teenage sex comedy despite the presence of some very funny scenes.",
      "author": "Angela Baldassarre"
    },
    {
      "text": "If you ever wondered what Sixteen Candles...would look and sound like fashioned after the aesthetic mindset of someone like Kevin Smith, Superbad is the answer",
      "author": "Bill Gibron"
    },
    {
      "text": "The fun, misery, insecurity and idiocy of high school are depicted with vulgar, imaginative and almost heroic excess.",
      "author": "John Beifuss"
    },
    {
      "text": "His McLovin' (he's got another name but it isn't important) is an instant classic, and like Jeff Spicoli and Bluto Blutarsky his is a character we're going to remember for quite some time.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "I like the fact that this one-note comedy -- OK, two: sex and booze -- makes no pretense of being anything other than a titillation-entertainment ride for the young and those who still remember how to think that way.",
      "author": "Larry Ratliff"
    },
    {
      "text": "... crude and sweet, rife with vulgarity yet redeemed by its generous spirit and intelligence. However filthy it is, it is not misanthrophic or even misogynistic.",
      "author": "Philip Martin"
    },
    {
      "text": "Rogen and co-screenwriter Evan Goldberg are attempting to create a teen-angst comedy along the lines of 'Fast Times at Ridgemont High' and 'Risky Business'... In the best sections of 'Superbad,' Rogen and Goldberg hit their targets.",
      "author": "James Sanford"
    },
    {
      "text": "At the film's core is a poignant message about teen male friendships that smartly balances the bawdy nuttiness that surrounds it.",
      "author": "Gary Goldstein"
    },
    {
      "text": "Horny is as horny does in the sweetly absurd high school comedy Superbad.",
      "author": "Manohla Dargis"
    },
    {
      "text": "It's the film's consistent and creative humor that keeps this comedic motor chugging away, along with the palpable chemistry between all of the teenagers.",
      "author": "JoBlo"
    },
    {
      "text": "A crazed odyssey of booze, lust, thwarted sex and undying friendship.",
      "author": "Steven Rea"
    },
    {
      "text": "...this is one long dirty joke. In fact, at nearly two hours, it's a very long dirty joke. If only it was funny.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "This vein of realism underpins Superbad and, as with Knocked Up and The 40-Year Old Virgin, is what makes it ultimately more than just another gross-out comedy or a lame coming of age flick.",
      "author": "Coco Forsythe"
    },
    {
      "text": "If you can't deal with really dirty language and insanely filthy slapstick-ish comedy and lots of drawings of the male sexual organ, then you shouldn't see this movie. But you'll be sorry.",
      "author": "Dave White"
    },
    {
      "text": "Formulaically, Superbad is nothing you've never seen before: what makes it special is that wonderful and miraculous alchemy of the words, Apatow's craft, and 3 leads who are simply beyond compare.",
      "author": "Karina Montgomery"
    },
    {
      "text": "A guided tour of what it's like to live in the crucible of dealing with teenage hormones, impulses, desires, and curiosities while always having your self-esteem put at risk.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "This is why Hollywood mostly sucks: Corporate movies are getting made from scripts written by 13-year-olds who went on to drop out of high school.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Superbad winds up being the best single night comedy since Martin Scorsese's After Hours. You may just be compelled to stick around for the next showing because comedies this great are all too rare.",
      "author": "Erik Childress"
    },
    {
      "text": "a classic example of the movie that shows us one epic, lifechanging day or night in our characters' lives ... its generation's teen adventure of a lifetime.",
      "author": "Willie Waffle"
    },
    {
      "text": "Common to successful sex comedies is a developing sense of self-awareness and the painfully sweet camaraderie of misfits. The naughty but nice Superbad can be added to that list.",
      "author": "Duane Dudek"
    },
    {
      "text": "Superbad has raunchy charm, a fair amount of heart and a couple of nice performances.",
      "author": "Chris Vognar"
    },
    {
      "text": "The variety of complications thrown at the three pubescent heroes raises this a cut above most raunchy comedies.",
      "author": "J. R. Jones"
    },
    {
      "text": "What's most memorable, most striking about Superbad is the canny evocation of male friendship in all its richness and complexity.",
      "author": "Joanne Kaufman"
    },
    {
      "text": "It's mostly very crude, often very funny and a little bit smarter than you might otherwise think.",
      "author": "Ken Fox"
    },
    {
      "text": "Humiliation, fear and occasional elation are the dominant emotions for these bumbling but oddly likable young men. Side-splitting laughter, along with some powerful cringing, are likely to be audiences' dominant reactions.",
      "author": "Claudia Puig"
    },
    {
      "text": "It's only when the characters are split up during the film's episodic mid-section that one's interest starts to flag...",
      "author": "David Nusair"
    },
    {
      "text": "Clumsily falters when its leads are separated, but sparkles when vulgar Hill, deadpan Cera, and spastic Mintz-Plasse playfully improvise together.",
      "author": "Sean O'Connell"
    },
    {
      "text": "The movie doesn't need any superfluous redeeming qualities: Its pleasures and charms lie in its very crudeness, in the way the characters' thoughts begin in their dicks and spill out of their mouths, completely bypassing their brains.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "It is what it is.",
      "author": "Walter Chaw"
    },
    {
      "text": "...a teen sex comedy that finds funny in the low brow while being very smart about it.",
      "author": "Laura Clifford"
    },
    {
      "text": "It's Michael Cera (heretofore best known as Jason Bateman's son on Arrested Development) whose comic timing quietly steals the show.",
      "author": "Dana Stevens"
    },
    {
      "text": "Superbad is also something more important than the movie where Cera says the f-word. It's the movie that's going to make him a star.",
      "author": "Chris Hewitt"
    },
    {
      "text": "If you liked the raunchy dude conversations in 40-Year-Old Virgin, you'll think Superbad is the Lawrence of !@#$ Arabia of raunchy (adolescent) dude conversations.",
      "author": "Mark Rahner"
    },
    {
      "text": "I hope it's not damning the movie with the wrong kind of praise to say that for a film so deliriously smutty, Superbad is supercute.",
      "author": "Carina Chocano"
    },
    {
      "text": "Who knew that a raunchy teen sex comedy could be one of the most rambunctious and glorious movies of the year?",
      "author": "Natasha Vargas-Cooper"
    },
    {
      "text": "While the film's preoccupation with sex and teens will immediately turn off many, there's no denying that a lot of this material is funny. Some of it is laugh-out-loud funny.",
      "author": "Jeff Vice"
    },
    {
      "text": "All this foul talk is packaging for a central, completely sweet Apatowian premise: Friendship is precious. So, too, is any piece of entertainment that reminds us that this thought is more than just some Hallmark slogan.",
      "author": "Mary F. Pols"
    },
    {
      "text": "The point is that while Superbad is just as dumb as it looks in every way, there's also something fairly sophisticated going on, which is always a pleasant, and genuine, surprise.",
      "author": "Tim Cogshell"
    },
    {
      "text": "A lot of wit and inventiveness went into this production -- too bad it couldn't have been used constructively.",
      "author": "M. K. Terrell"
    },
    {
      "text": "What is required is a sense of humor. Bring that to the theater with you and you won't be disappointed.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "A riotous story of friendship, debauchery, and pizza bagels.",
      "author": "Peter Canavese"
    },
    {
      "text": "I've seen a few movies that were a little funnier, but I don't think I've ever seen so many individual performances that brought more laughs than these three do.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Captures the mysterious pit of erection-led shame that lies deep inside every self-conscious young man...the most truthful portrayal of uncut teenage thinking put to the screen since Fast Times at Ridgemont High.",
      "author": "Brian Orndorf"
    },
    {
      "text": "If only every comedy that comes out these days could be tinkered with for 12 years before it's released into theaters.",
      "author": "Eric Melin"
    },
    {
      "text": "a very funny, raunchy comedy that should clean up what's left of the summer box office",
      "author": "Sean McBride"
    },
    {
      "text": "Superbad is a successful laugher, no doubt about it, but what lingers afterwards is the poignancy of childhoods reaching an end.",
      "author": "Dustin Putman"
    },
    {
      "text": "Their almost Tourette-ish stream of endless obscenities, vivid and imaginative as they are, are less an expression of their actual interests and intentions than they are a sort of terrified incantation to ward off their greatest fear: humiliation.",
      "author": "Nell Minow"
    },
    {
      "text": "Superbad might be the most provocative teen sex comedy ever made; it is certainly one of the most convulsively funny.",
      "author": "David Edelstein"
    },
    {
      "text": "...there are some classic scenes and the cast is hilarious.",
      "author": "Lisa Rose"
    },
    {
      "text": "The comic peaks of Superbad deal in specific characters rather than easily pegged stereotypes. Their most outlandish verbal riffs -- none of which can be quoted -- give the edgiest stuff in Knocked Up a run for its money.",
      "author": "Michael Phillips"
    },
    {
      "text": "Greg Mottola executes Superbad with his characteristically light touch, even if it's used in the service of filthy sight gags, endless profanity and an inordinate obsession with bodily fluids.",
      "author": "Ann Hornaday"
    },
    {
      "text": "The decade's funniest movie ... nothing short of an instant classic.",
      "author": "Matt Pais"
    },
    {
      "text": "The best comedy of the summer.",
      "author": "Jon Popick"
    },
    {
      "text": "Superbad delivers some of the summer's biggest laughs.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Superbad falls short of teen classic status. What a super-shame.",
      "author": "Adam Graham"
    },
    {
      "text": "The unrelenting Judd Apatow stamp on movie comedy continues with Superbad, which is recognizably in the same hilariously vulgar vein.",
      "author": "Terry Lawson"
    },
    {
      "text": "This is pure 'situation comedy' in which the humor and the poignancy emerge from the situations rather than being imposed upon your senses. The bar for teen sex comedies in America has finally been raised -- and not a moment too soon.",
      "author": "Gene Seymour"
    },
    {
      "text": "Super-vulgar, ridiculously sophomoric, horribly nasty and so hilarious you'll probably squirt Diet Coke out of your nose within the first 20 minutes.",
      "author": "Linda Stasi"
    },
    {
      "text": "As much as it may scare a lot of parents out there, anyone who has been through the rigors and craziness of contemporary high school will find something to identify with.",
      "author": "Bill Clark"
    },
    {
      "text": "Seth (Jonah Hill) can only express a sexually aggressive form of hatred toward women. There's a word for that: misogyny.",
      "author": "Josh Larsen"
    },
    {
      "text": "The best teen sex comedy ever made.",
      "author": "John Thomason"
    },
    {
      "text": "Thrives on rowdiness and raunchiness and celebrates the infantilism of the male side of the species as a source of boundless humor.",
      "author": "Frank Swietek"
    },
    {
      "text": "A raunchy teen comedy flick about parties and having sex that really wants to say something about male friendship.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Mostly Superbad is as soulful and funky as its soundtrack.",
      "author": "Shawn Badgley"
    },
    {
      "text": "Superbad is cute if you like guys who aren't even remotely bad, in a coming-of-age tale so old-fashioned the girls might just as well be wearing bloomers.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "With the personalities in place, this stuff writes itself.",
      "author": "Eric Kohn"
    },
    {
      "text": "What they came up with is one of the most authentic and hilarious high school films in memory.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Effortlessly combines the outrageous adventure plot with some strikingly serious subtext about friends growing up and growing apart.",
      "author": "Rich Cline"
    },
    {
      "text": "A loving ode to the penis.",
      "author": "Victoria Alexander"
    },
    {
      "text": "2007: The Year Judd Apatow And Seth Rogen Saved Movie Comedy.",
      "author": "Sean Burns"
    },
    {
      "text": "The movie is frequently amusing and occasionally uproarious.",
      "author": "James Berardinelli"
    },
    {
      "text": "As a Revenge of the Nerds redux, Superbad isn't perfect. But it's super close.",
      "author": "David Ansen"
    },
    {
      "text": "We'll just say that McLovin turns out to be the baddest mutha by far.",
      "author": "Christy Lemire"
    },
    {
      "text": "It is as deep as it is obscene and should make audiences very uncomfortable that they are laughing themselves sick.",
      "author": "Danny Minton"
    },
    {
      "text": "A marvelous late-summer surprise, a film that's small in scope but big on laughs and--believe it or not, dick mouths--heart.",
      "author": "Ethan Alter"
    },
    {
      "text": "The movie succeeds as a teen's wild fantasy of a night in which everything goes wrong, revised by an adult's melancholy sense that nothing was ever meant to go right.",
      "author": "David Denby"
    },
    {
      "text": "No film in the history of cinema has displayed as much interest in male genitalia.",
      "author": "Nick Schager"
    },
    {
      "text": "A fairly standard teen raunch romp with some really funny parts involving a completely unrelated subplot. It's worth sitting through Hill and Cera to get to Rogen, Heder, and McLovin.",
      "author": "Joshua Tyler"
    },
    {
      "text": "The comic inventions at play are so beyond the pale, and yet so within the realm of teenage possibility, that we follow imaginary emotional arcs of pubescent experience. This is fun stuff.",
      "author": "Cole Smithey"
    },
    {
      "text": "Superbad is the American Pie for this century.",
      "author": "Vince Koehler"
    },
    {
      "text": "Superbad is the rarest of teenage comedies; one that manages to be puerile, charming, and genuinely funny all at once.",
      "author": "Joshua Starnes"
    },
    {
      "text": "The only problem with this insanely funny movie is that it's going to incite envy from anyone in the audience who thought high school was for studying.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "It's very honest and frank, and... smart about kids of a certain age.",
      "author": "Richard Roeper"
    },
    {
      "text": "Like American Graffiti and Dazed and Confused, the film all takes place during a single day and night. But it doesn't have the smarts or the depths of those ensemble comedies.",
      "author": "Stephen Farber"
    },
    {
      "text": "It helps that the fun doesn't stop. It helps even more that the pitch-perfect script doesn't step out of character for a joke.",
      "author": "Peter Travers"
    },
    {
      "text": "The bawdy jokes score big points, but it's the rueful acknowledgement of adolescent embarrassment and humiliation that most distinguishes Superbad.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Gloriously profane, Superbad, Mottola's follow-up to Daytrippers, takes one of the most disreputable genres--the teenage sex comedy--and detonates it through a shrewd and unapologetic mixture of the uproarious and outrageous.",
      "author": "Emanuel Levy"
    }
  ],
  "release_year": 2007,
  "duration": 113,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "High school seniors Seth and Evan have high hopes for a graduation party. The co-dependent teens plan to score booze and babes so they can become part of the in-crowd, but separation anxiety and two bored police officers complicate the pair's self-proclaimed mission.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/ek8e8txUyUwd2BNqj6lFEerJfbq.jpg"
}