{
  "movie_name": "Ted",
  "movie_id": "ted_2012",
  "total_reviews": 220,
  "reviews": [
    {
      "text": "With Family Guy-style jokes and references to Springfield, the humor, based on current topics such as homosexuality, sex, and other vices... permeates all elements of the film, from comedy to romance, suspense, action and comedy. [Full review in Spanish]",
      "author": "José C. Donayre Guerrero"
    },
    {
      "text": "\"Ted,\" while extremely funny in individual jokes here and there, suffers from that lame and predictable story, especially for something that advertises itself to be as daring.",
      "author": "Don Shanahan"
    },
    {
      "text": "Ted becomes a character that’s more than just a plot device or source of vulgar humor; he’s one of those oddly real characters brought to life by subtle and effective special FX.",
      "author": "Brian Eggert"
    },
    {
      "text": "Ten years after its release, films like Ted make one wonder what is it that we collectively saw in man-children on the screen.",
      "author": "Danielle Solzman"
    },
    {
      "text": "It's just not funny. Not only is it not funny, it's unfunny.",
      "author": "David Bax"
    },
    {
      "text": "Ted gives us one of the greatest comedic characters - a lovable, foul-mouthed cuddly toy full of memorable one-liners who armed us with an arsenal of handy insults.",
      "author": "Film Companion Staff"
    },
    {
      "text": "Easily one of 2012's raunchiest studio releases to date.",
      "author": "Richard Propes"
    },
    {
      "text": "A funny premise, executed, for the most part, well.",
      "author": "Brent McKnight"
    },
    {
      "text": "'Ted' is one of the funniest, craziest, most offensive comedies about immaturity I've seen this year. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "The movie's ability to alternately shock and amuse with graphic, gross and genuinely hilarious gaggery is not to be underestimated.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Ted is funny, silly and very rude...so unless you're easily offended, watch it and revel in the laughter.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "This foul-mouthed pot-smoking teddy bear was a whole lot of fun.",
      "author": "Kate Rodger"
    },
    {
      "text": "A bold, raucous comedy that takes no prisoners and shows no mercy, emerging as something both hilarious and yet strangely touching, sustaining its rollicking energy for its entire running time.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Wahlberg and MacFarlane deserve a lot of credit for making it work, especially Wahlberg, who approaches the role with a reckless comedic abandon, not afraid to be the butt of the joke.",
      "author": "Micheal Compton"
    },
    {
      "text": "A perfectly enjoyable slice of contemporary comedy that manages to raise its head above the faecal pond of modern crude comedy.",
      "author": "Patrick Gamble"
    },
    {
      "text": "MacFarlane's film debut is a winning combination of humor and heart, of crude jokes and genuine wit.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "The greatest compliment I can pay Seth MacFarlane's Ted is that although this is essentially one of those slacker, stoner comedies, and such comedies aren't really my thing... this did make me laugh quite a bit.",
      "author": "Deborah Ross"
    },
    {
      "text": "Like Family Guy, Ted's obsession with fame, celebrity and brainless sight gags means it's content being merely funny now but forgettable in the long term.",
      "author": "Ali Gray"
    },
    {
      "text": "... the result is pretty hilarious. [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "MacFarlane shows himself to be a capable live action director.",
      "author": "Sarah Marrs"
    },
    {
      "text": "There are glimpses of hilarity in there some of the jokes connect hard and there are some seriously awesome cameos, but it's just not enough to carry the entire film which plays more like a bunch of poorly connected, very funny skits than a cohesive film",
      "author": "Yasmin Shehab"
    },
    {
      "text": "Ted is, at heart, a relatively simple and predictable romantic comedy/buddy movie but it's much more than the extended single-gag it could so easily have been.",
      "author": "Francesca Rudkin"
    },
    {
      "text": "The movie is hilarious in fits and starts, but nothing is sustained and every joke, funny or not, is delivered with the dial up to 11.",
      "author": "J. Olson"
    },
    {
      "text": "Very funny until all of the sudden it's not anymore.",
      "author": "Sean Burns"
    },
    {
      "text": "A surprisingly funny and crude comedy about a man's relationship with a talking teddy bear.",
      "author": "John Hanlon"
    },
    {
      "text": "It is a film that seems to have an endless middle.",
      "author": "Violet Lucca"
    },
    {
      "text": "Soulless, angry-white-guy comedy at its worst. This is a smug, nasty little number.",
      "author": "Will Leitch"
    },
    {
      "text": "I was expecting something more than repetitive jokes, incessant pop culture references and rampant misogyny.",
      "author": "Al Alexander"
    },
    {
      "text": "Hit and miss humour with problematic undertones buoyed by an intriguing premise and appealing performances from the film's human cast.",
      "author": "Catherine Bray"
    },
    {
      "text": "A refreshingly original idea backed by excellent performances and terrifically funny writing.",
      "author": "Tom Glasson"
    },
    {
      "text": "The creator of TV's \"Family Guy\" directs his first live-action movie-in which he gets to say and do all the profane, politically incorrect and just plain gross things he can't say or do on television. And a lot of it is pretty funny.",
      "author": "Michael Sauter"
    },
    {
      "text": "MacFarlane is reduced to making increasingly laboured references to the 1980s.",
      "author": "Andy Lea"
    },
    {
      "text": "Those who detest Family Guy will not be converted but fans will surely lap up a film that - whilst sometimes flawed - is rude, crude and often very funny.",
      "author": "Laurence Boyce"
    },
    {
      "text": "Ted presents plenty of fresh laughs and, from time to time, heart/stuffing-warming character moments.",
      "author": "Ben Kendrick"
    },
    {
      "text": "A film with Ted's ingredients should have you stone-drunk on laughter but this film is the comedic equivalent of pissed-in light beer: its 2.5% funny.",
      "author": "Adam Ross"
    },
    {
      "text": "I enjoyed and laughed at Ted, but I can't say I liked it; MacFarlane lacks focus, the jokes are occasionally offensive, and though the movie has heart, it bungles whatever message it's trying to get across.",
      "author": "Jonathan Lack"
    },
    {
      "text": "Feel free to tell me to lighten up and get a sense of humour, but it's also worth asking whether it's humour that really drives Ted's nasty streak.",
      "author": "Charlie Lyne"
    },
    {
      "text": "\"Ted\" is what happens when you give the creator of \"Family Guy\" the freedom of an R-rating and a big budget - and the final product is nothing short of raunchy, comedy gold.",
      "author": "Justin Craig"
    },
    {
      "text": "The laughs are mountainously massive.",
      "author": "Erick Weber"
    },
    {
      "text": "A lot of comic effort is smothered in conventional wrapping.",
      "author": "Matthew Sorrento"
    },
    {
      "text": "If you've ever put a Twisted Sister cassette into a Teddy Ruxpin or wished you could have, this movie is for you.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Raunchy, intentionally offensive and full of warm fuzzies (including its title character), 'Ted' is one of the funniest movies for grownups that's come along in years.",
      "author": "Linda Cook"
    },
    {
      "text": "With Ted, MacFarlane has produced a genuinely laugh-a-minute yarn which warms the heart and tickles the funny bone into hysterical submission.",
      "author": "Adam Lowes"
    },
    {
      "text": "If you're fundamentally put off by MacFarlane's brand of comedy, Ted's cruder elements may well prove too irksome, but this film does have a sweetness at its heart that is pleasantly unexpected, even if it does follow an extremely predictable plot.",
      "author": "Martin Roberts"
    },
    {
      "text": "there is a sophisticated social satire at work that is so finely wrought that though it might appear as the very thing it is skewering, there is something much more subtle and much more potent going on.",
      "author": "Andrea Chase"
    },
    {
      "text": "Ted gives a rude, irreverent and, in places, very funny new spin to the buddy comedy genre.",
      "author": "Jason Best"
    },
    {
      "text": "At times I laughed so hard I thought I would bust a capillary somewhere.",
      "author": "Grae Drake"
    },
    {
      "text": "Hit and miss humour with problematic undertones buoyed by an intriguing premise and appealing performances from the film's human cast.",
      "author": "Film4 Staff"
    },
    {
      "text": "In effect we can read Ted as not merely a comedy of growing up, or refusing to move on from adolescence, but as a psychological fable about the continuing struggle to become a mature person.",
      "author": "Philip French"
    },
    {
      "text": "There's just enough mileage in the gag to keep the movie spluttering through an energetic series of pop-cultural references and broadly staged orgies of profanity.",
      "author": "Donald Clarke"
    },
    {
      "text": "Laughter doesn't lie. I loved Ted and found it irresistibly funny and hugely enjoyable.",
      "author": "David Sexton"
    },
    {
      "text": "There's something quite wonderful about having a bear that is this free to speak its mind.",
      "author": "Graham Young"
    },
    {
      "text": "Ted has nothing much to offer in terms of subtlety and sensitivity, but there are plenty of laughs.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "If you're in the mood for something raucous, rude and very silly, Ted should keep you entertained. Just be warned: Toy Story it 'aint.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "The film will probably be funnier if you go with a beer, a friend or perhaps - who knows? - your own dissolute soft toy companion.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Less a movie, more a ragbag of 80's pop cultural references hung on a storyline.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Underneath the fur-ious comedy of Ted is the standard skeleton of a traditional rom-com complete with a conservative ending. Ted does not really work as a fully rounded film but feels more like three episodes of a sitcom strung together.",
      "author": "Brian Henry Martin"
    },
    {
      "text": "Enjoyable slacker comedy with likeable characters, a steady stream of decent gags and strong performances from a superb comic cast...",
      "author": "Matthew Turner"
    },
    {
      "text": "[W]orks so well not just because the entire story so casually accepts the reality of a living teddy bear... but because Wahlberg is so wholly dedicated to... emotional authenticity...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "This is ersatz subversion for an audience secretly terrified of the real thing.",
      "author": "Robbie Collin"
    },
    {
      "text": "Voiced by MacFarlane, you could argue that Ted is just Family Guy's hooched-up pooch Brian with more fur and less class. Maybe so, but he's still a riot.",
      "author": "Elliott Noble"
    },
    {
      "text": "Only a protracted fight between the titular fuzzball and a well-cast Mark Wahlberg begins to tap into the absurd potential of the concept.",
      "author": "Rob Humanick"
    },
    {
      "text": "Sure, MacFarlane, you can make us laugh, but it's time to grow up. Seriously.",
      "author": "Ben Walters"
    },
    {
      "text": "The bear done good.",
      "author": "Adam Woodward"
    },
    {
      "text": "The bottom line is that I laughed and didn't feel guilty about it.",
      "author": "Siobhan Synnot"
    },
    {
      "text": "Crass, supremely silly and very, very funny, Ted is the comedy of the summer.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "... just misses being a real classic ...",
      "author": "Jim Lane"
    },
    {
      "text": "If you're easily offended, then give it a miss. But you will be overlooking this summer's biggest comedy hit, which has many hilarious moments.",
      "author": "Christopher Tookey"
    },
    {
      "text": "Ted is dispiriting because it has no faith in us and no ambition for itself.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "A pet project padded out to feature-length, bromance-meets-romance predictability. The story beats are so obvious they seem tapped out on a telegraph. If you want to see a Boston bruin who was truly interesting, watch a documentary about Bobby Orr.",
      "author": "Brian Gibson"
    },
    {
      "text": "A fabulous first live-action effort, combining R-rated hilarity with skilled storytelling as it slips some real heart into the stuffing of a toy bear.",
      "author": "Tony Horkins"
    },
    {
      "text": "An ugly-looking film, with the expected ugly jokes and extended pop-culture riffs, but, like the similarly scattershot 'Family Guy,' its holds your interest even as it annoys.",
      "author": "John Beifuss"
    },
    {
      "text": "Tami-Lyn, the little boy's dream girl who is so easy to mock, despise, and dismiss, is Ted's least imaginative take on magic.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "One of the comedies of the year.",
      "author": "Rob Carnevale"
    },
    {
      "text": "It's two hours of sheer blissful nonsense...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "I think \"Ted\" is freakin' hilarious. Your mileage may vary.",
      "author": "Sean P. Means"
    },
    {
      "text": "Everything about this film feels like a pretty good reworking of 'The Family Guy.' Unfortunately the last quarter of the film forgets it is a comedy.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Funniest film of the year so far? Yes. Has it had much mainstream competition for that title? No.",
      "author": "Matt Neal"
    },
    {
      "text": "The comedy surprise so far of the year.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Surprisingly sentimental, superior stoner comedy.",
      "author": "James Croot"
    },
    {
      "text": "It left me fantasising of ways to go back in time, Lost style, and keeping Family Guy from ever returning to screens and kicking off this terrible chain of events.",
      "author": "Simon Miraudo"
    },
    {
      "text": "mostly content to fling what it can at the screen-whether it be crass or sentimental-and be fine with whatever sticks",
      "author": "James Kendrick"
    },
    {
      "text": "The best stuff is in the trailer but there were still many moments that left me laughing openly.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Ted is as far from its precursor Alf as Texas Chain Saw Massacre is from The Sound of Music.",
      "author": "Tony Medley"
    },
    {
      "text": "Ted is, in the end, a terminally uneven and barely-passable debut from MacFarlane that, when compared to his superior work in television, can't help but come off as a serious disappointment.",
      "author": "David Nusair"
    },
    {
      "text": "The shock value of seeing a big fluffy teddy bear cursing and getting high... [provides] most of the comedy, while the startlingly easy rapport that Whalberg and a CGI effect share provides the warmth.",
      "author": "Tim Brayton"
    },
    {
      "text": "Gives the usual R-rated raunchiness featuring men and boys behaving badly a magical twist.",
      "author": "John Wirt"
    },
    {
      "text": "Make this bear a necessity...oh man that was terrible. I'm actually very sorry I wrote that.",
      "author": "Bob Grimm"
    },
    {
      "text": "Fluctuating between crass and sentimental without being particularly impressive at either, Ted wears out its welcome very, very fast.",
      "author": "Tom Clift"
    },
    {
      "text": "The irony is that, at least for the time being, if you want to see Seth MacFarlane at the top of his game, you'll have to turn on a TV",
      "author": "Rick Kisonak"
    },
    {
      "text": "Plying his trade in pop culture references and surprising punchlines, MacFarlane jumps the adult-oriented comedy bandwagon with a film that's smarter and funnier than most",
      "author": "Rich Cline"
    },
    {
      "text": "What interests MacFarlane is the business of funny, and a talking teddy bear (particularly one with a healthy sex drive) is pretty funny.",
      "author": "CJ Johnson"
    },
    {
      "text": "Rude as hell, funny as hell...While merrily delivering all the coarse anti-PC humour the Family Guy fanbase have a right to expect, the best thing about Ted is also its biggest surprise - it has real heart.",
      "author": "Jim Schembri"
    },
    {
      "text": "A movie about a come to life foul mouthed teddy bear is not my idea of entertainment",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Sorry, but I could bearly stomach Ted. Give me a good gross-out comedy any old day, but this one ain't funny.",
      "author": "Paul Chambers"
    },
    {
      "text": "Amusing, irreverent, outrageous - the weirdest, funniest movie I've seen in a long time",
      "author": "Susan Granger"
    },
    {
      "text": "Ted is raunchy and funny as you might expect but it's also surprisingly sweet natured. Quite a fun and satisfying first feature from MacFarlane.",
      "author": "Beth Accomando"
    },
    {
      "text": "Does well for a film built on a thin plot and an outlandish premise but it works well and it's good to see MacFarlane take his first steps into filmmaking.",
      "author": "Cameron Williams"
    },
    {
      "text": "Wahlberg once again shows a knack for comic timing, especially in his scenes with the CGI bear.",
      "author": "Josh Larsen"
    },
    {
      "text": "... One of the funniest movies I've ever seen.",
      "author": "Greg Maki"
    },
    {
      "text": "The crazy gags deliver the promised laughs, but even crazier is, by the end, how much affection one feels for this most unconventional family.",
      "author": "Michael Dequina"
    },
    {
      "text": "When Ted isn't funny, it isn't much of anything. It's the sip of water a stand-up comedian takes between jokes, leaving the audience to twiddle their thumbs as they wait for the next one.",
      "author": "Anders Wotzke"
    },
    {
      "text": "Low brow, silly and utterly predictable, Ted is still the funniest movie of the summer so far.",
      "author": "Scott Nash"
    },
    {
      "text": "MacFarlane, whose Ted sounds a lot like Peter Griffin on his show \"Family Guy,\" also co-wrote and directed \"Ted,\" so expect a lot of pop-culture references and random gags. Some of them hit, some don't.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The script has a hit-and-miss irreverence that relies too heavily on its central gimmick.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Who would think a teddy bear would shine in this Summer's comedies?",
      "author": "Jolene Mendez"
    },
    {
      "text": "\"Family Guy\"- originator Seth McFarlane stacks his romantic-comedy deck by repurposing his popular animated television series' brand of irreverent humor.",
      "author": "Cole Smithey"
    },
    {
      "text": "Works better than it has any right to",
      "author": "Robert Denerstein"
    },
    {
      "text": "MacFarlane throws everything against the wall to get a laugh or two, but most of the bits fail to stick.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Just as he has done for cartoons, Family Guy mastermind Seth MacFarlane has made what could have been a children's story safe for raunch.",
      "author": "Dan Lybarger"
    },
    {
      "text": "A clever and outrageous comedy that hits far more than it misses.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "I'm more impressed with the comparatively low-tech look of Ted than the been-there-done-that razzle dazzle of The Amazing Spider-Man -- a declaration that might make some wonder if I've spent too much time myself on the couch with the bong-banging bear.",
      "author": "Matt Brunson"
    },
    {
      "text": "There are so many things that Ted gets right that the things it gets wrong are baffling.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Everything goes on too long -- Ted's carousing, Lori's watchful waiting, John's wistful indecision.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "It's not quite as funny as I hoped, but if you're ready to leave commonsense at the door and enjoy some good-hearted nonsense, there's fun to be had with Ted",
      "author": "Louise Keller"
    },
    {
      "text": "The plot is so cliched that it practically becomes a parody within itself, complete with obvious musical cues and convenient plot twists. I'm sure this was all intentional, and it works as both an homage and satire of buddy, romantic/comedies.",
      "author": "Austin Kennedy"
    },
    {
      "text": "... a riot, a wholly realized concept from a man who makes his living via a trademark ADD-addled approach.",
      "author": "Bill Gibron"
    },
    {
      "text": "One of the funniest movies of 2012.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Ted\" is boorish, ridiculous and offensive. It also is refreshingly unapologetic. That alone makes it worth seeing.",
      "author": "Bob Bloom"
    },
    {
      "text": "It's like watching a cleverly subversive, inspired and hilarious opening act followed by a very weak, uninspired, and repetitious main act. If you've seen the trailer, you've seen most of the funny scenes already.",
      "author": "Avi Offer"
    },
    {
      "text": "Do you like to laugh? Go see Ted.",
      "author": "Matthew Razak"
    },
    {
      "text": "Very funny and almost entirely inconsequential,",
      "author": "James Verniere"
    },
    {
      "text": "MacFarlane knows American pop culture and, when at his best, he uses it in a critical way that is hilarious.",
      "author": "John Esther"
    },
    {
      "text": "Laugh-out-loud movie moments are hard to come by. Seth MacFarlane's crudely funny Ted provides several.",
      "author": "Clint O'Connor"
    },
    {
      "text": "It's a goofy premise pursued with crass -- as well as sentimental -- relish.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Seth MacFarlane puts the \"R\" in Toys R Us with Ted, the not-so-tender story of a fuzzy-wuzzy teddy bear and the man-child who loves him.",
      "author": "Steve Persall"
    },
    {
      "text": "An over-the-top comedy with genuine heart. As ridiculous and as silly as Ted's three characters are, they actually care for one another, and their bond comes through.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "If you're expecting a live-action Family Guy, you'll be somewhat disappointed...",
      "author": "Mark Bell"
    },
    {
      "text": "You'll feel the warmth and camaraderie of a Bostonian and his little sentient bear.",
      "author": "Laremy Legel"
    },
    {
      "text": "Not just a potty-mouthed retread of The Muppets, but a highly watchable, even affecting buddy picture in its own right.",
      "author": "Steve Schneider"
    },
    {
      "text": "TV is so confining. Words beginning in \"F\" can't be used, naked women and sex are taboo. Like his counterparts, Seth MacFarlane found a move to the movies irresistible.",
      "author": "Gary Wolcott"
    },
    {
      "text": "The scattered adventures of a talking teddy bear and his best bud.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "I tried to resist but couldn't.",
      "author": "Bob Mondello"
    },
    {
      "text": "When Sacha Baron Cohen goes over the top with his brand of boundary-pushing offensive humor, it's because he's pointing out hypocrisy. When MacFarlane goes over the top, he's just laughing at people for being who they are. There's a difference.",
      "author": "Eric Melin"
    },
    {
      "text": "I can't deny that MacFarlane mined a number of big laughs out of what would seem to be a one-joke premise.",
      "author": "Ethan Alter"
    },
    {
      "text": "By the third act, the thin premise collapses and the film runs out of steam, bringing in jarring elements that don't work with a light Peter Pan comedy/fantasty.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "Perhaps if saddled with a lower MPAA rating, the filmmaker might have been forced to resort to greater and more effective creativity. (Full Content Parental Review also available)",
      "author": "Jim Judy"
    },
    {
      "text": "To his credit, MacFarlane earns his laughs here, making an effort to write jokes that would be funny even if they weren't being delivered by a talking teddy bear.",
      "author": "Mike Scott"
    },
    {
      "text": "Outrageously funny from beginning to end, \"TED\" could only come from the mind of \"Family Guy\" creator MacFarlane.",
      "author": "Michael A. Smith"
    },
    {
      "text": "Promises to be one of the most original, twisted and outrageous comedies of the year, and succeeds 75% of the time.",
      "author": "Willie Waffle"
    },
    {
      "text": "Ted is worth seeing, but it's not quite the water cooler flick it aspires to be. Or maybe it was months ago as a trailer.",
      "author": "Peter Paras"
    },
    {
      "text": "The writing is fabulously rude, sexist, racist and funny, and everyone in Ted seems to be having a very good time.",
      "author": "Liz Braun"
    },
    {
      "text": "As unabashedly idiotic movie comedies go, Ted goes fairly well.",
      "author": null
    },
    {
      "text": "\"Ted\" is so lazy you want to kick the stuffing out of it.",
      "author": "Tom Long"
    },
    {
      "text": "Underneath the matted fur of the movie's foul-mouthed bear beats a very real heart.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The plot is simply a shaky frame on which to hang drug and sex jokes and numerous pop-culture references.",
      "author": "Joe Holleman"
    },
    {
      "text": "I expected \"Ted\" to be a one-joke movie, but it's got ideas spilling out of its seams.",
      "author": "Kyle Smith"
    },
    {
      "text": "What began as a promising, if unhinged, experiment in suspending disbelief starts to feel like \"You, Me and Dupree\" for plushies.",
      "author": "Ann Hornaday"
    },
    {
      "text": "MacFarlane shows he's going to be just as popular a filmmaker as he is at TV animation. Lord help us all.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Ted offers the low comedy and raunch that made movies like The Hangover a hit, but don't be fooled. It's a lot smarter than that...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Fans of the MacFarlane oeuvre will be tickled; everyone else would be advised to sample Family Guy, among other shows, to see if they really, really need to see his sensibility - with curse words included.",
      "author": "Corey Hall"
    },
    {
      "text": "For all its raunchy and iffy humor, the film is surprisingly sweet, too.",
      "author": "Mark Dujsik"
    },
    {
      "text": "If you don't take it seriously, 'Ted' is hilarious at times, obnoxious too often and alternating between being mind-numbingly stupid or brilliant.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "This reminds me of the time I made a disappointing movie about a talking teddy bear where I recycled all the \"Family Guy\" jokes I couldn't get past the censors. . .",
      "author": "Peter Sobczynski"
    },
    {
      "text": "For a summer comedy that name-drops the Adam Sandler vehicle \"Jack and Jill\" before destroying it in a single sentence, it's amazing how many of the same traps \"Ted\" falls into",
      "author": "Dustin Putman"
    },
    {
      "text": "It's so wrong. But it's very funny.",
      "author": "Nell Minow"
    },
    {
      "text": "[It's] such a solid, confident debut that you have to wonder why it took [MacFarlane] so long to make the jump in the first place.",
      "author": "Jason Zingale"
    },
    {
      "text": "Ted, which was conceived as an animated series, suffers the flaws of Family Guy without sharing its strangeness.",
      "author": "Ann Lewinson"
    },
    {
      "text": "Not going to lie. I kind of want my own talking teddy bear. But only if he guzzles beer, tells excessively dirty jokes, can drive and wants to be my best friend forever.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "In a universe of Hollywood comedies that seem determined to insult the audience and pander to the basest form of post-adolescent fantasy, \"Ted\" feels almost sophisticated.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "The natural interactions between Ted and his beloved man-child owner, John, terrifically played as an adult by Mark Wahlberg, are more often than not ridiculously funny.",
      "author": "Claudia Puig"
    },
    {
      "text": "Ted's real trick is turning a one-joke premise into a reasonable facsimile of a movie, and one that isn't entirely bent on grossing us out.",
      "author": "Peter Howell"
    },
    {
      "text": "It is funny to watch a teddy bear wail on Mark Wahlberg. But afterward, I mostly felt beat up.",
      "author": "David Haglund"
    },
    {
      "text": "For all of its transgressive plush-toy sex and screw-'em humor, the plot is pretty standard stuff.",
      "author": "Amy Biancolli"
    },
    {
      "text": "Ted is, no matter how you stuff it, yet another man-child buddy movie -- and all that that implies.",
      "author": "Marc Savlov"
    },
    {
      "text": "If you yearn to be treated like an eight-year-old, this R-rated kids movie for adults-the very opposite of Judd Apatow's wave of \"time to grow up\" comedies- is all yours.",
      "author": "Peter Canavese"
    },
    {
      "text": "A pot-smoking, womanizing, wisecracking, profanity-spewing teddy bear is, as you might figure, good for a lot of laughs. Trouble is, the rest of 'Ted' is pretty listless.",
      "author": "Matt Soergel"
    },
    {
      "text": "To fully appreciate \"Ted,\" it's best to simply forgive its bad behavior upfront and save any apologies for liking it until later. Sorry.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "This is not a comedy for anyone who might be turned off by humor that plays a little loose with race, sex, and any other subjects that may be considered taboo. Honestly, if you use the word \"taboo,\" don't see Ted.",
      "author": "Brian Tallerico"
    },
    {
      "text": "\"Ted\" may not be profound or deft, but when it hits the sweet-sour spot, which it does regularly, it can win you over.",
      "author": "Shawn Levy"
    },
    {
      "text": "In \"Ted,\" Seth MacFarlane becomes the latest comic brain to take on the popular subject of the adult male who refuses to grow up.",
      "author": "Gary Thompson"
    },
    {
      "text": "I'm betting on Mark Wahlberg for best actor when the Oscars swing around next year.",
      "author": "Steven Rea"
    },
    {
      "text": "Has a few genuinely funny moments, but on the whole it's repetitive and stale.",
      "author": "Frank Swietek"
    },
    {
      "text": "Not every joke scores, of course. But the hits are worth the misses, and anyway, the movie's true genius is in the way its outlandish scenario is played so perfectly straight.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "Visionary artist MacFarlane makes smooth transition from animated TV to the big screen with this comedy-fable, which is slender in ideas but is charming and quite funny.",
      "author": "Emanuel Levy"
    },
    {
      "text": "One of the year's funniest movies and certainly its most flatulent.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Ted contains 12-15 minutes of the some of the best comedy I've seen in a movie this year. Now see if you can stand the other 90.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "You can overlook an awful lot in a comedy when it makes you laugh.",
      "author": "Chris Vognar"
    },
    {
      "text": "Co-writer-director McFarlane is a funny guy, but his barbed humor here rests on the same generic, boy-meets-girl, bed-of-roses conceit as too many romantic comedies to count.",
      "author": "Duane Dudek"
    },
    {
      "text": "Like \"Family Guy,\" \"Ted\" is only about its own hyperlinked pop culture references.",
      "author": "Michael Phillips"
    },
    {
      "text": "MacFarlane has definitely made the best leap from animated television to movies since 1999′s South Park: Bigger Longer & Uncut.",
      "author": "Mary F. Pols"
    },
    {
      "text": "Ted is essentially a one-joke movie. Okay, it's a very funny joke, but it's still only one joke.",
      "author": "James Berardinelli"
    },
    {
      "text": "Mostly hysterical, even if it falters a bit towards the end. A sure-fire stoner classic.",
      "author": "Chris Bumbray"
    },
    {
      "text": "You will believe a teddy bear is alive.",
      "author": "Laura Clifford"
    },
    {
      "text": "Seth MacFarlane's debut as a feature director hits all the sweet spots that irritate prudes. Ted is hysterically, gut-bustingly funny.",
      "author": "Peter Travers"
    },
    {
      "text": "Ted finds a surprising range of off-color vowel sounds in its potentially one-note gag.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "This comedy of a boy and his talking bear - which plays like a long episode of \"Family Guy\" - is basically like watching Seth MacFarlane and Mark Wahlberg hanging out. Happily they're both pretty funny.",
      "author": "Joe Lozito"
    },
    {
      "text": "Avoids pitch-black comedy, selecting a more rascally tone that toys with Boston brute behaviors (served with wicked good accents) and the undeniable magic of a bong-sucking teddy bear that has sex with women.",
      "author": "Brian Orndorf"
    },
    {
      "text": "This is exactly the same plot as The Muppets, in which Jason Segel was forced to choose between Amy Adams and Kermit the Frog.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "Pretty funny, pretty racist.",
      "author": "Matt Pais"
    },
    {
      "text": "The sin of \"Ted\" is not that it is offensive but that it is boring, lazy and wildly unoriginal. If Triumph the Insult Comic Dog ever got a hold of Ted, there would be nothing left but a pile of fluff and a few scraps of fur.",
      "author": "A.O. Scott"
    },
    {
      "text": "Some of this is undeniably funny, but the humor is very hit-or-miss.",
      "author": "Soren Andersen"
    },
    {
      "text": "A crass, foul-mouthed, mostly hilarious, surprisingly sentimental bromance about a grown boy named John and his teddy bear.",
      "author": "Ty Burr"
    },
    {
      "text": "An incongruously cute interspecies buddy comedy that's powered alternately by the pixie dust of boyhood imagination and the ruder, cruder urges of adolescence.",
      "author": "Nathan Rabin"
    },
    {
      "text": "The plot of \"Ted\" is fairly standard but greatly embellished by MacFarlane's ability to establish comic situations and keep them building.",
      "author": "Roger Ebert"
    },
    {
      "text": "The film has one of the most bizarre dick joke to earnestness ratios ever, but strangely it all works and is, most importantly, hilarious.",
      "author": "Eric Eisenberg"
    },
    {
      "text": "The stuff that sticks to the wall is so outrageously hilarious that it's ultimately worth enduring the film's lackadaisical pacing and lazy misogyny.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Even though a lot of the movie is grating dumb-assery, it's something to behold. Stuffed with crap, but something.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "The one-note joke plays out longer and better than you might expect, at least for a while. But not forever.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Ted's extraordinary design and good cheer [makes this] a comedy I find more than bearable.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "A guilty pleasure - devilishly wrong and yet, oh so right.",
      "author": "Mark Sells"
    },
    {
      "text": "Will it make you wince with embarrassment? That's a promise. Will you also laugh? In double-time, like a Rockette.",
      "author": "Rex Reed"
    },
    {
      "text": "... while the movie has a dirty mouth, it's got a sweet heart, and it suggests to me that MacFarlane's signature interests are tempered by a new maturity to his work.",
      "author": "Drew McWeeny"
    },
    {
      "text": "Seth MacFarlane's comedic modus operandi is to shock with outrageousness and pander with TV and movie citations via one non sequitur after another, a strategy that leads to a few laughs but nothing approaching lasting humor.",
      "author": "Nick Schager"
    },
    {
      "text": "Pop culture reference heaven. I haven't laughed this hard at a movie in a while. It's the funniest movie of the year so far. I'm happy to see Seth MacFarlane take such a great first step on the big screen. You saved every one of us!",
      "author": "Kristian Harloff"
    },
    {
      "text": "It's a hilarious film that gets a little slow towards the end simply because it has to tell a real story. It gets even funnier with a couple gut-punches at the end. It's hysterical and the funniest movie I've seen so far this year.",
      "author": "Mark Ellis"
    },
    {
      "text": "Ted ends up undermining both halves of its whole, as well as its creator's clear intent to add something a little deeper to his crassness.",
      "author": "David Fear"
    },
    {
      "text": "Anyone over 15 ... might sit in the theater in stony silence.",
      "author": "Melissa Anderson"
    },
    {
      "text": "...it does serve up a pretty jaw-dropping array of remarkably crude, nasty, and at times pretty gut-busting jokes.",
      "author": "Glenn Kenny"
    },
    {
      "text": "A furiously-paced comedy that goes where none has gone before.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "This isn't a sensitive grown man/stuffed animal story like The Beaver, which starred a mental Mel Gibson and a hand-puppet -- Ted sets a raucous R-rated comedy gold standard",
      "author": "Pete Hammond"
    },
    {
      "text": "Ted takes the classic mold of a '50s comedy and stuffs it full of MacFarlane's signature foul-mouthed humor. The result is sweet, sick and satisfyingly simple.",
      "author": "Matt Patches"
    },
    {
      "text": "If you love Family Guy and worship at the alter of McFarlane you will absolutely adore Ted. It's ridiculous, inappropriate, hilarious, nostalgic, geek heroin.",
      "author": "Blake Howard"
    },
    {
      "text": "Much of the material works because the bear has someone to bounce off of; Wahlberg does his best work in situations like this, where he's playing it totally straight in a setting that's totally silly.",
      "author": "Christy Lemire"
    },
    {
      "text": "The movie's stuffing of creative smarts is still inert.",
      "author": "Richard Brody"
    },
    {
      "text": "A no-brainer for anyone who appreciates Seth McFarlane's brand of humor but also for anyone just looking for solid unadulterated laughs which it delivers in spades.",
      "author": "Edward Douglas"
    },
    {
      "text": "A film about the importance of putting away childish things, \"Ted\" is itself an immature comedy that boasts a clever premise but a rather sour spirit.",
      "author": "Tim Grierson"
    },
    {
      "text": "[A] predictably irreverent satire that's sweeter and, sadly, less funny than you might expect.",
      "author": "Peter Debruge"
    },
    {
      "text": "Ted is, hands down, the best comedy of the year so far.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "Not too many films serve up laughs that just keep on rolling with regularity from beginning to end, but Seth MacFarlane's directorial debut does so and without any feeling of strain.",
      "author": "Todd McCarthy"
    }
  ],
  "release_year": 2012,
  "duration": 106,
  "genres": [
    "Comedy",
    "Fantasy"
  ],
  "synopsis": "When John Bennett (Mark Wahlberg) was a little boy, he made a wish that Ted (Seth MacFarlane), his beloved teddy bear, would come alive. Thirty years later, foul-mouthed Ted is still John's constant companion, much to the chagrin of Lori (Mila Kunis), John's girlfriend. Though Lori's displeasure is exacerbated by the pair's constant consumption of beer and weed, she's not the one who's most disappointed with John; it may take the intervention of John's boyhood toy to help him grow up at last.",
  "popularity": 7.3,
  "poster_url": "https://image.tmdb.org/t/p/original/1QVZXQQHCEIj8lyUhdBYd2qOYtq.jpg"
}