{
  "movie_name": "Tenet",
  "movie_id": "tenet",
  "total_reviews": 379,
  "reviews": [
    {
      "text": "The wildly inventive set-pieces are the highlights. Whether the car chase which crosses time barriers or the crash of the 747, the film is packed with bravura sequences.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Orson Welles’ assertion that a movie in production is the biggest train set a boy could have is routinely borne out by Christopher Nolan films, in which planes are wrecked with giddy glee.",
      "author": "Gayle Sequeira"
    },
    {
      "text": "Despite all of its issues in terms of plot and inaudible dialogue, Tenet is a reminder that nothing can quite beat the cinematic experience.",
      "author": "Bianca Garner"
    },
    {
      "text": "Every single thing you think you’ve known about the filmmaker—or even about this movie in particular—is rendered virtually useless.",
      "author": "Ankit Ojha"
    },
    {
      "text": "A sleek, grandiose, modestly berserk, superbly costumed, intermittently lovely tessellation of dawdle and detonation and elements found in James Bond movies along with the customary Christopher Nolan time-and-space conundra.",
      "author": "Ray Pride"
    },
    {
      "text": "Christopher Nolan's 'Tenet' futzes with the time-space continuum in a top-secret spy tale intended to tank an incipient WWIII, but it's a tad tedious.",
      "author": "Mark Jackson"
    },
    {
      "text": "Christopher Nolan’s puzzle box Bond film is one of the most original films in quite some time.",
      "author": "Ryan McQuade"
    },
    {
      "text": "With Tenet, Nolan evolves as a surrealist director, yet his writing style does not similarly advance.",
      "author": "Peter Bell"
    },
    {
      "text": "Christopher Nolan's Tenet is a technically flawless, elaborate, immersive experience that needs to be felt in order to be understood.",
      "author": "Serena Seghedoni"
    },
    {
      "text": "The most Nolan-y film yet, where he’s fixated entirely on the possibilities and wonder of his creation and entirely ignorant of the people involved in the events. […] It’s gripping but it’s also empty.",
      "author": "Akhil Arora"
    },
    {
      "text": "Then, suddenly and unexpectedly, almost towards the end of the movie, Nolan scores a winning goal. I felt that what's called \"movie magic\". [Full review in Spanish]",
      "author": "Juan José Beteta"
    },
    {
      "text": "Tenet undoubtedly boasts an incredibly complex narrative with a unique temporal concept impressively demonstrated through spectacular, loud, jaw-dropping, practical action set pieces.",
      "author": "Manuel São Bento"
    },
    {
      "text": "An idyllic journey in which Christopher Nolan immerses himself in the physical laws of time through a screenplay that isn't suitable for the impatient. [Full review in Spanish]",
      "author": "Adrián Monserrat"
    },
    {
      "text": "the tangled pile of plot threads may look like a jumbled mess, but everything comes together in a frenetic final act, weaving into a fabulously bold and entertaining tapestry... filmmaking on the grandest scale in terms of scope, technique and ambition",
      "author": "Dallas King"
    },
    {
      "text": "Absurd elite espionage.",
      "author": "Erick Estrada"
    },
    {
      "text": "Christopher Nolan has once again done what he does best – create an exhilarating cinematic experience aimed at wowing you visually and challenging you intellectually.",
      "author": "Keith Garlington"
    },
    {
      "text": "A game cast and topnotch production values are unable to improve upon a clunky script and awkward execution. Tenet fails to reach its lofty ambitions. It also suffers from one of the worst sound mixes in a modern film at this level.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "The production team create some fantastically enjoyable big moments of cerebral high-octane fun that made the film's two-and-a-half hour run-time fly by.",
      "author": "Cris Kennedy"
    },
    {
      "text": "Tenet is an intense blockbuster that doesn’t let up, and we’re swept along with the momentum of it all. Don’t try to understand it, just feel it.",
      "author": "Daniel Howat"
    },
    {
      "text": "A story people will try to explain to others, probably badly, who will in turn head to the multiplex to form their own opinion. If the mission was to create a discussion, then Tenet is a huge success.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Tenet suffers most from its absence of feeling and thinly described characters, leaving Nolan's cinematic puzzle box a contraption with nothing inside for those who attempt to solve it.",
      "author": "Brian Eggert"
    },
    {
      "text": "Nolan finally seems to admit that he is not interested in people or their stories or their emotions, but rather using their forms, their bodies, to fill them with abstractions. [Full review in Spanish]",
      "author": "Alonso Díaz de la Vega"
    },
    {
      "text": "The film begins to entangle itself. [Full review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "For all its ambition, 'Tenet' is a mushy glob of nonsense.",
      "author": "Witney Seibold"
    },
    {
      "text": "Tenet is one of Nolan's most cerebral films, as confounding as it is scintillating.",
      "author": "Cory Woodroof"
    },
    {
      "text": "It's interesting to consider that Nolan and the entire team believed in creating a challenging narrative with the escapism, wonder, and thrill of the best cinematic experience.",
      "author": "Nicholas Oon"
    },
    {
      "text": "Heaps of plot devices, Washington's ridiculously cool fight scenes and Pattinson looking in a suit like a hunk that just won't quit only mildly distracts from the over-complicated and nonsensical world of Tenet.",
      "author": "Lonita Cook"
    },
    {
      "text": "Nolan revisits all the pieces of formulaic ingenuity that have risen him to the pinnacle of non-franchise blockbuster cinema, and it's fun.",
      "author": "Taylor Baker"
    },
    {
      "text": "This is a narrative purely driven by the action and concept, but it lacks a human connection. There is nothing to grasp, nothing to identify with on-screen, no matter how charismatic the actors are.",
      "author": "Maria Lattila"
    },
    {
      "text": "[A] stylish espionage thriller.",
      "author": "Alex Behan"
    },
    {
      "text": "Never slowing down to explain much or allow a passive moment, Tenet almost requires a second or third viewing, all part of the Nolan pattern that creates moneymaking blockbusters.",
      "author": "Robin Holabird"
    },
    {
      "text": "Nolan prioritizes the dense audiovisual spectacle of his most narratively complex films. Beyond the intellectual, they exist primarily, and more accessibly, as experiences. Put another way: Tenet is a vibe.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "Tenet fails to convince as either dramatic or action spectacle, let alone as philosophical investigation ... [it's] a house of cards, built only to be toppled over.",
      "author": "Lawrence Garcia"
    },
    {
      "text": "Even as Tenet engages in loads of hand-wringing about the implications the characters' actions have for the future, it's hard to really form any worry for that future that exists only in prolepsis.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Though it's sometimes hamstrung by clumsy dialogue - a necessary evil, perhaps, given how much Nolan needs to explain - Tenet is rarely less than thrilling to watch.",
      "author": "Nick Levine"
    },
    {
      "text": "Tenet is one of the most enthralling cinematic experiences I have had for years.",
      "author": "Rhys Bowen Jones"
    },
    {
      "text": "Exhausted and disoriented by Nolan's curlicue-rollercoasters, we end up fooled into thinking we've been stirred when, in fact, we've mostly been shaken.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "Christopher Nolan's Tenet is a film which can be enjoyed, but it's highly likely that you won't really understand it. It takes a lot of big ideas - and a lot of big moviemaking techniques to deliver a film which is mesmerising but very flawed.",
      "author": "Niall Browne"
    },
    {
      "text": "It is not so much a matter of criticizing Nolan's filmmaking, which is not very difficult to do. The important issue is to understand and criticize the conditions that produced his filmmaking ...",
      "author": "David Walsh"
    },
    {
      "text": "Led beautifully by protagonist John David Washington, 'Tenet', an exceptional action-packed film, dives into a concept of twisting time in a way never explored before. I'm adding this to my permanent library.",
      "author": "Vincent Schilling"
    },
    {
      "text": "As a delivery system for the thrills, I think the film gets a long way, and you can kind of sit back and enjoy it. As a delivery system for the ideas, I think it trips itself up an awful lot.",
      "author": "Tim Robey"
    },
    {
      "text": "[Has] perfectly orchestrated battle scenes. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "It means what you want it to mean, and I don't want it to mean anything. It's just a ride.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "By the end of its two-and-a-half-hours, with all its bi-directional action, revelations and world-ending ramifications, it's a bit numbing, And you're pretty sure you can't wait to watch it again.",
      "author": "Mark Meszoros"
    },
    {
      "text": "...a high-faluting, high energy, uber-glam espionage thriller...",
      "author": "Eddie Harrison"
    },
    {
      "text": "Just go with it. Allow the inversion to pull you along because it does, for the most part, make sense by the end.",
      "author": "Tony Black"
    },
    {
      "text": "Huge scale, gripping and ambitious sci-fi spy thriller from Christopher Nolan, which simply has to be seen to be believed, and possibly seen more than once to be fully appreciated.",
      "author": "Alix Turner"
    },
    {
      "text": "It's the most Nolan movie ever and I'm not sure it makes since but I was enthralled nonetheless.",
      "author": "Brian Gill"
    },
    {
      "text": "The future is now or in the past",
      "author": "Kathia Woods"
    },
    {
      "text": "Nolan's obsession with making his films as complex as humanly possible is frustrating for those of us who would like at least a scintilla of clarity in our storytelling.",
      "author": "Alex Bentley"
    },
    {
      "text": "Washington and Pattinson have palpable charisma, but this cold puzzle offers no incentive to solve it. Throw in damsel-in-distress crap, and both my geek sensibilities and my feminism are offended.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Something like the epitome of [Nolan's] temporally twisty canon, distilling his many cinematic signatures and preoccupations down to their entrancing abstract essence.",
      "author": "Nick Schager"
    },
    {
      "text": "Nolan's reverence for tech and the cleverness of pulling off a metaphysical narrative puzzle finally swamps his awareness of whether the thing in question is even any good.",
      "author": "PJ Nabarro"
    },
    {
      "text": "The trippy last hour is jam packed with artfully arranged action scenes that manipulate time in increasingly psychedelic ways.",
      "author": "Richard Crouse"
    },
    {
      "text": "Tenet has its moments, but is easily Nolan's worst film. Mostly incomprehensible; this muddled sci-fi thriller is a long way from being the \"savior of cinema.\" Honestly, it'd be difficult to recommend even if we weren't in the middle of a pandemic.",
      "author": "Mark Cassidy"
    },
    {
      "text": "Tenet asks for patience as it winds forward and backward through its narrative accordion structure...savor, even [its] flaws.",
      "author": "Sean Fennessey"
    },
    {
      "text": "...'Tenet' makes 'Inception' feel like a children's story. The film is magnificently and perhaps quite purposefully confusing.",
      "author": "Joey Morona"
    },
    {
      "text": "Tenet isn't here to collect Oscars. It exists to pummel you with excitement, twist your sense of reality, and leave you confounded with the deafening power of its nine-figure budget.",
      "author": "Luke Hicks"
    },
    {
      "text": "The weakest of Nolan's 11 cinematic at-bats to date, Tenet finds the filmmaker unable to get out of his own way as he attempts to spin a yarn that makes earlier efforts like Memento seem as linear and uncomplicated as A Charlie Brown Christmas.",
      "author": "Matt Brunson"
    },
    {
      "text": "I love Tenet so much, despite its frustrations. Nolan wants to keep pushing the boundaries of these kinds of blockbusters, and that means he's going to fail as much as he succeeds.",
      "author": "Ben Kuchera"
    },
    {
      "text": "Tenet is a Christopher Nolan film in every way. An amalgamation of themes & threads out of his other films combined into one, Tenet has shades of Nolan's best work, but not without flaws.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "A science fiction film in which Nolan builds, visually, a twisted and frenetic experience of international espionage that is structured as if it were a narrative palindrome of dualities and retrocausality. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "It's an audiovisual experience that no movie lover should miss. Stimulating, revealing, adrenaline-pumping and spectacular, this is Christopher Nolan's new proposal. [Full review in Spanish]",
      "author": "Diana Mangas"
    },
    {
      "text": "Visually dazzling but absolutely incomprehensible and impenetrable...",
      "author": "Susan Granger"
    },
    {
      "text": "Less of a puzzle and more like a mechanical bull. But at home you can tame -and appreciate- this beast. [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Fact is, Tenet should not be taken more seriously than a James Bond movie. As an action film, it isn't nearly as skillful as a Tom Cruise Mission Impossible commodity.",
      "author": "Armond White"
    },
    {
      "text": "It is an imperfect film, but to dismiss it would be to punish it for merely being 'good' and not 'great'.",
      "author": "Grant Watson"
    },
    {
      "text": "The film feels a lot like an allusion of its palindrome title. What I like most about Nolan, and Tenet, is that it challenges me and reminds me, forgive the redundancy, that movies are first felt and then understood. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Even if you are confused by all this complexity, there is still much to enjoy here. For me, it was just too much. I prefer more character depth and less emphasis on manufactured plot complications.",
      "author": "Robert Roten"
    },
    {
      "text": "Love your palindromes? The film is a dud.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Anyone who insists Tenet is Important or Otherwise Notable is probably trying to sell you something.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Like with other Christopher Nolan films, it will take multiple viewings to fully realize the scope of Tenet's groundbreaking accomplishments.",
      "author": "Kent Garrison"
    },
    {
      "text": "If you stick it out to the end, you'll either hate it or feel you need to watch it again.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "TENET ends up something of a Rube Goldberg machine of a film: a wondrously complex set of mechanics that is fascinating, but also an incredibly convoluted way of masking what is, in essence, a thin and poorly executed story.",
      "author": "Jim Ross"
    },
    {
      "text": "Christopher Nolan's most ambitious and complex film to date, also ends up being his most cold and lacking emotion. Not all of it works, but it's still better than many of the other releases this year. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "\"Tenet\" succeeds in somehow transcending the audience's basic understanding of time and narrative while nevertheless keeping them engaged and entertained for the film's entirety.",
      "author": "Joel Mayward"
    },
    {
      "text": "A Christopher Nolan movie is an event, and Tenet and its extraordinary action set pieces justify such a tag.",
      "author": "John Serba"
    },
    {
      "text": "A flashy disappointment-intricate but not especially involving, clever but never captivating...a sterile exercise in spy movie cliché, with a twist that allows for some striking effects but... proves far less engaging than Nolan thinks it is.",
      "author": "Frank Swietek"
    },
    {
      "text": "Amid all the nonsensical writing, messy action, and blank characters, Tenet is a display of the pure, unfiltered blockbuster-filmmaking sensibilities that Nolan always delivers.",
      "author": "Juan Barquin"
    },
    {
      "text": "[Christopher Nolan] is very clever, but mostly irritating is what I find. [His movies] are not cerebral - they're fake cerebral... He doesn't even do the time travel right.",
      "author": "Tim Cogshell"
    },
    {
      "text": "I am a big fan of [Christopher Nolan's] films -- I usually enjoy the time puzzle of it -- but this seems even more intentionally inaccessible and challenging than everything else... Confusing, distancing, and chilly.",
      "author": "Christy Lemire"
    },
    {
      "text": "Nolan at his most thrilling and semi-comprehensible.",
      "author": "Daniel Barnes"
    },
    {
      "text": "[We] get the full Nolan treatment in spectacle without [any] emotional and psychological lifting. It'll never [match] his best, but it's undeniably entertaining nonetheless.",
      "author": "Jared Mobarak"
    },
    {
      "text": "From Tenet's opening sequence to the final climactic battle, not knowing exactly what the hell is going on has never been so fun! That's actually kinda sincere...",
      "author": "Ryan Syrek"
    },
    {
      "text": "I could see the points when the movie was like: this is the moment where I want you to have that emotional feeling, and I really wanted to get there... there wasn't enough done in the build-up of this whole movie for me to actually, really care.",
      "author": "Achara Kirk"
    },
    {
      "text": "It didn't engage with me as a viewer... the biggest reason I can see is that the main character didn't have this goal that was recognizable.",
      "author": "Jaby Koay"
    },
    {
      "text": "'Tenet' may contain [Nolan's] most ambitious use of time, but also, ultimately, the least effective.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Garbled nonsense of a most entertaining order, it's basically a Christopher Nolan fetish film.",
      "author": "Sean Burns"
    },
    {
      "text": "\"Tenet\" is indeed impressive, although I gave up trying to follow the plot.",
      "author": "G. Allen Johnson"
    },
    {
      "text": "\"Tenet\" is difficult to understand, but even worse, it inspires little desire to understand it.",
      "author": "Mick LaSalle"
    },
    {
      "text": "All-in-all, much like the film's subject, Tenet is a film way ahead of its time. It's Nolan's most audacious experiment. Whether posterity favours it kindly -- only time will tell...",
      "author": "Devesh Sharma"
    },
    {
      "text": "Tenet﻿ is a fascinating and exciting sci-fi thriller bolstered by Nolan's grand vision for action and strong performances from the cast.",
      "author": "Chris Agar"
    },
    {
      "text": "Washington is decent as the Protagonist but not as good as he was as Ron Stallworth in BlacKkKlansman.",
      "author": "Allison Rose"
    },
    {
      "text": "\"Tenet\" squanders all its visual spectacle through obtuse storytelling and dramatic inertia. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "The convoluted logic begins to detract from the film's enjoyment - or it would if Nolan didn't keep tossing out exciting visuals to keep viewers engaged and challenged.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Tenet is Christopher Nolan's weakest film. It's also evidence that Christopher Nolan's weakest film is still way better and more exciting than some directors' best films.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The story & plot are super intriguing and quite clever. Once you hit the end of the film, it's all tied up in a neat little bow, proving itself to be more than worth a watch.",
      "author": "Tessa Smith"
    },
    {
      "text": "... mediocre espionage sci-fi thriller.",
      "author": "Filipe Freitas"
    },
    {
      "text": "... Tenet is not the best film Nolan's created, but it may be his most ambitious and there's much to be lauded in that.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Tenet will go down as middle of the road Christopher Nolan. It's not a masterpiece and it's not a misfire.",
      "author": "Joey Magidson"
    },
    {
      "text": "It's basically Inception for time travel instead of dreams.",
      "author": "Fred Topel"
    },
    {
      "text": "The best way to go about trying to understand Tenet is to just sit there and enjoy the ride.",
      "author": "Danielle Solzman"
    },
    {
      "text": "If Tenet were a Beatles song, it would be Revolution 9: gun shots and car crashes, breaking glass and muffled words, all come together in a mix, made all the more unintelligible by segments happening forward and backward.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "To be constantly told how Tenet's engine works is like having Peter Jackson explain the metallurgy behind the One Ring -- unnecessary.",
      "author": "Rohan Naahar"
    },
    {
      "text": "A well-oiled machine in which each element fulfills a specific function, and like all machinery, lacks a soul... Nonetheless, Tenet is a fascinating experience. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "A beautiful mess.",
      "author": "Jim Schembri"
    },
    {
      "text": "Excellent hard-hitting big-budget action, inconsistent dialogue /acting, refreshingly clever brain-stretching plot, great sound, a tad longer than necessary. Prepare to be confused, but entertained!",
      "author": "Ross Anthony"
    },
    {
      "text": "I was confused... but it was well executed, well acted. It looked fantastic. The set pieces, the originality of the story was great.",
      "author": "Tony Baker"
    },
    {
      "text": "A film that wends its way around time, backward and forward, needs some space, and filling it with more intricacy doesn't always work.",
      "author": "Marie Asner"
    },
    {
      "text": "For the first time in a long time Christopher Nolan's work just gets a bit tiring and tiresome as he exploits his obsession with time yet again in a way that's more noisy than expressive. [Full Review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "An interesting palindrome, but really doesn't amount to anything significant. [Full Review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Tenet is a heck of an achievement and is spectacular to watch. Technologically there is nothing like it.",
      "author": "Robert Slack"
    },
    {
      "text": "Tenet is the kind of movie that leaves you asking, \"Why can't we have John David Washington as James Bond?\"",
      "author": "Nathan Mattise"
    },
    {
      "text": "A cerebral thriller that gives us the most gimmicky version of Nolan we've seen yet. [Full review in spanish]",
      "author": "Julio Fernando Navas"
    },
    {
      "text": "An often electrifying grand scale thriller that tackles bold structural concepts, but its execution is a decidedly mixed bag.",
      "author": "Mattie Lucas"
    },
    {
      "text": "When put in context of what we have come to expect from Christopher Nolan...Tenet seems to land with an even more despondent, painful thud.",
      "author": "Tom Santilli"
    },
    {
      "text": "It's the Nolanest movie that ever Nolaned, for better and for worse, and even more so than any of his previous efforts.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "... asks viewers to trust what's going on will make sense once it reveals its secret... one of those rare instances where seeing the film more than once actually reaps a reward...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Alas, Tenet is 100% Christopher Nolan - for better and worse.",
      "author": "Rafael Motamayor"
    },
    {
      "text": "Some films grow richer with each viewing, I fear this one will fade. Best thing I can do is quote one of the time inversion scientists...\"don't try to understand it.\"",
      "author": "Eli Glasner"
    },
    {
      "text": "The scale of its spectacle suggests innovation; but Nolan's combination of the reverse motion with the cross cut, which he's dressed with trivial exposition, has all been done before.",
      "author": "Kelley Dong"
    },
    {
      "text": "As if you were holding a Rubik's cube: you will not feel calm until you manage to solve it with your hands.",
      "author": "Jose Maria Areste"
    },
    {
      "text": "An incomprehensible and pretentious misfire from the usually reliable Christopher Nolan.",
      "author": "Damien Straker"
    },
    {
      "text": "Typically good Nolan puzzler.",
      "author": "Bob Grimm"
    },
    {
      "text": "That's Tenet in a nutshell. A movie obviously built on interesting, complex ideas, but with no clue how to put them into practice.",
      "author": "Germain Lussier"
    },
    {
      "text": "Tenet shines with its action sequences and the time inversion premise, but it quickly wears out its welcome.",
      "author": "John Nguyen"
    },
    {
      "text": "John David Washington is the best part of Tenet...stuck in a story that makes zero sense and requires a massive amounts of Advil...",
      "author": "Shawn Edwards"
    },
    {
      "text": "Dense and pretentious, Tenet will irritate even the most dedicated Nolan fans with its curiously flawed similarities to Inception.",
      "author": "Dan Tabor"
    },
    {
      "text": "Tenet addresses some important themes, such as the dangers of technology concentrating world-shattering powers in the hands of unaccountable individuals, but it treats the world as an abstraction of physics, not as a real place where real people live.",
      "author": "Chris McCoy"
    },
    {
      "text": "Ambitious and grandiloquent, Tenet is a palindromic thriller where past and present converge in a mission against the clock. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "The auteur doesn't show much growth in his most recent self-indulgent work.",
      "author": "Kathleen Sachs"
    },
    {
      "text": "I doubt that even the director could explain what it's about.",
      "author": "John McDonald"
    },
    {
      "text": "Watching Tenet is like watching somebody else play a video game whose maddeningly complex rules you haven't had a chance to learn.",
      "author": "Margot Harrison"
    },
    {
      "text": "...Even as it fumbles in key ways, TENET will fit the expectations set by most Nolan fans... even while this proves to be one of Nolan's lesser films, in my opinion.",
      "author": "Colby Bryant"
    },
    {
      "text": "There comes a point where Nolan's attention to detail as a visionary filmmaker fails to compensate for his current lack of storytelling abilities.",
      "author": "Rendy Jones"
    },
    {
      "text": "As stellar as Tenet is for the senses, it is not something most moviegoers will want to revisit - unless, of course, they believe Nolan's brand of storytelling really doesn't add up until the third or fourth viewing.",
      "author": "Kiko Martinez"
    },
    {
      "text": "The dialogue was a little lame. Kenneth Branagh chewed the scenery. Elizabeth Debicki made no impact. But lordy, lordy no one can put a movie together like Christopher Nolan.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "With such lofty goals, the characters are reduced to pieces on a sleek chess board. And if Nolan doesn't give a damn about what happens to his chronology-challenged travelers, why should we?",
      "author": "Rubén Rosario"
    },
    {
      "text": "The cast are solid talents, but all struggle to breath life into a film already overstuffed and whittled down to the point of leaving no time for any natural humanity to flow though it.",
      "author": "Garth Franklin"
    },
    {
      "text": "It is easy to sit back and revel in the wonder of the big-screen experience, and to immediately want to see the film again. And again.",
      "author": "Anna Smith"
    },
    {
      "text": "While I think Nolan is a talented & visionary filmmaker, with TENET he seems to care more about the fantastical spectacle + time inversion extravaganza than he is about an affecting story, so the result frankly, is a cold, detached film.",
      "author": "Ruth Maramis"
    },
    {
      "text": "It would be easy to dismiss the plot as confusing, but that would be generous.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "Tenet is an obnoxious, cold and unpleasant movie. Nevertheless, Nolan achieved a rare formal experiment never seen before in summer blockbusters. Hollow, cynic and revolutionary at the same time. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "This being a Christopher Nolan film, seeing it on a big screen is kind of a must - in the very least for the imposing, driving score [by Ludwig Göransson] and the impressive camera work by Hoyte Van Hoytema.",
      "author": "Tom Meek"
    },
    {
      "text": "The real \"inversion\" of Tenet-and ultimately, all of Nolan's films-is that its stretching upward toward the heavens boomerangs back to this world.",
      "author": "Brett McCracken"
    },
    {
      "text": "A solid 3.5 star movie rating was unfolding. Then the big shootout battle reared its ugly head and the film became an overindulgent mash-up of Inception and 1917 that led to a dramatic drop-off in quality - and my interest.",
      "author": "Louisa Moore"
    },
    {
      "text": "This movie tries its hardest to be a complex, puzzling adventure, but it's a puzzle with only 150 pieces. Expected so much more from this, but at least Nolan still gets \"spectacle.\"",
      "author": "EJ Moreno"
    },
    {
      "text": "Ridiculously complicated, childishly simple, and completely overwhelming.",
      "author": "Michael J. Casey"
    },
    {
      "text": "One of Nolan's most ambitious and complex films to date. [Full Review in Spanish]",
      "author": "Arturo Magaña"
    },
    {
      "text": "A bit like solving a Rubix Cube while running a marathon, backwards.",
      "author": "Asher Luberto"
    },
    {
      "text": "Of the performances, Debicki stands out.",
      "author": "Robert Denerstein"
    },
    {
      "text": "For a writer often accused of being humorless, this may be his most playful script, often arid in its dry humor, and much of it provided by Pattinson playing an inverted Felix Leiter to Washington's stoical Bond riff.",
      "author": "Richard Whittaker"
    },
    {
      "text": "Tenet is a soundtrack attached to an incoherent set of moving images.",
      "author": "Jeffrey Edalatpour"
    },
    {
      "text": "Tenet features all of the big ideas and spectacle you want from a Christopher Nolan film, but it's also far more confusing than it needed to be.",
      "author": "Sean Chandler"
    },
    {
      "text": "A glorious mess of a film. The concepts in the film cause whiplash, but the visual cacophony of Christopher Nolan's imagination and current cinema tech is beautiful & emotion.",
      "author": "Patrick McDonald"
    },
    {
      "text": "Tenet is more of a base single for Christopher Nolan, although even his weakest efforts still provide an exhilarating jolt of blockbuster craftmanship.",
      "author": "Matt Conway"
    },
    {
      "text": "Nolan's violent, elaborate epic is best for deep thinkers.",
      "author": "Tara McNamara"
    },
    {
      "text": "The wait has been worth it. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "...the movie, saddled with a muddy sound mix, is dominated by frustratingly unintelligible dialogue that compounds the already-baffling atmosphere.",
      "author": "David Nusair"
    },
    {
      "text": "Mind. Officially. Blown.",
      "author": "Linda Cook"
    },
    {
      "text": "Basically, it's a James Bond film with a bachelor's degree in physics, and it has the decency to be an extremely good James Bond film, on top of it.",
      "author": "Tim Brayton"
    },
    {
      "text": "The concept of \"time inversion\" that Nolan developed is mind blowing being like nothing we've seen before on the big screen, but he fails at simply mixing sound dialogue correctly.",
      "author": "Brandon Avery"
    },
    {
      "text": "The most complex work yet by Nolan with a superb John David Washington as the film's protagonist. Visually stunning as the director layers scenes where others would use flashbacks or non-linear edits.",
      "author": "Joe Friar"
    },
    {
      "text": "As a Christopher Nolan film, it has all the warmth of a meat locker and features a Ludwig Göransson soundtrack that makes you feel like you're inside a shipping container. This is appropriate, since half the movie takes place inside shipping containers.",
      "author": "Neal Pollack"
    },
    {
      "text": "'Tenet' is pure escapism, in the tradition of greats like 'King Kong' and 'Bowfinger' (that's right, a comedy).",
      "author": "Bill Arceneaux"
    },
    {
      "text": "Nolan's new movie is all gimmick, and devoid of those fascinating questions of identity and truth that invigorated his previous efforts.",
      "author": "Matt Goldberg"
    },
    {
      "text": "Tenet is trying very hard to be deep and meaningful, but the archetypical characters and over-explanation of the convoluted storyline means we have a lot of homoeroticism in fantastic menswear in between awesome set pieces.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "Devoid of soul and verve, Tenet is a winning science project but a failure as a piece of art.",
      "author": "Drew Dietsch"
    },
    {
      "text": "If it wasn't so smart and muddled it could pass for a Bond thriller.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It's not the cinematic savior some have made it out to be, but that doesn't mean it's not a total blast. Once you accept how dumb its central concept is, the real fun can begin.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The truth is, I had more fun after putting my pen down and letting it wash over me like an extremely loud, chaotic waterfall.",
      "author": "Piers Marchant"
    },
    {
      "text": "Tenet is what happens when Nolan forgets Borden's wisdom [from The Prestige]. He's so obsessed with how impressive his 'secret' is that the trick he uses it for is nothing.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "A massive, sprawling, largely incomprehensible mess, albeit with Nolan's usual slick action scenes and sense of weight.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "This is 100% pure Christopher Nolan. He pushes the boundaries of storytelling and filmmaking.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Nolan has created a story so obtuse that the viewer cannot hope to grasp it - while simultaneously demanding reverence and mid-pandemic attendance.",
      "author": "Sean Collier"
    },
    {
      "text": "What strikes you is how determinedly bare of feeling it seems, even when emotional opportunities present themselves.",
      "author": "Anthony Lane"
    },
    {
      "text": "Tenet is ambitious and messy and big and bold. ... It's a movie worth seeing in theaters on as large a screen as possible.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Telling a story backward sounds bizarre - it is bizarre - but it works. The backward stuff in \"Tenet\" sounds bizarre - worse than bizarre, goofy - and for a while it works. But once it doesn't, it really doesn't.",
      "author": "Mark Feeney"
    },
    {
      "text": "Christopher Nolan's latest dazzles the senses while making no sense at all.",
      "author": "Christian Toto"
    },
    {
      "text": "a loud, boisterous, eye-popping spectacle that will absolutely blow your socks off with dazzling visuals and immersive exhibition, even if solving puzzles isn't your thing",
      "author": "Frank Wilkins"
    },
    {
      "text": "Nolan's homage to the spy genre is a globetrotting epic that features some well-crafted action sequences that help gloss over a plot that sometimes gets a little convoluted for its own good.",
      "author": "Micheal Compton"
    },
    {
      "text": "It's the first Nolan movie in a long while that I've left feeling disappointed. And yet there is enough good stuff buried beneath its antiseptic, perhaps overly showy technique, once you get past the clankier bits, that is worth exploring.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "Though personal growth and emotional depth are hardly necessary ingredients in a spy thriller... with so much else about Nolan's script a mental exercise made real, some emotional stakes would be helpful to bring it alive.",
      "author": "Michael Burgin"
    },
    {
      "text": "It's an intricate Rubik's cube of a film that... never quite pieces itself together. But in this ever-changing world in which we live in, we need filmmakers like Nolan, who dare to be bold and try to look at the world differently.",
      "author": "Michael Lee"
    },
    {
      "text": "Even with its shortcomings, Tenet is loads of fun to absorb, whether you attempt to understand it or not.",
      "author": "Steven Prokopy"
    },
    {
      "text": "The setup gives his movies a fresh look along with an old soul that is irresistible. Like staring into Debicki's eyes for more than five seconds, you're a goner every time.",
      "author": "Dan Buffa"
    },
    {
      "text": "Christopher Nolan Creates Stunning Action in a Frustrating, Muddled Movie.",
      "author": "Chris Evangelista"
    },
    {
      "text": "it's visually stunning, thanks to Nolan and cinematographer Hoyte van Hoytema, and contains some of the year's best action filmmaking, but its plot is needlessly complex",
      "author": "Stephen Silver"
    },
    {
      "text": "The dullness of its story is counterbalanced by set pieces action fans will never stop talking about - for better or worse.",
      "author": "Evan Dossey"
    },
    {
      "text": "On the whole, while Tenet does have some things to like about it, it does ultimately prove to be one of Nolan's weaker efforts, at least from a narrative standpoint.",
      "author": "Jeff Beck"
    },
    {
      "text": "No question that Nolan's superlative filmmaking technique, once again, rises to the occasion.",
      "author": "Wendy Shreve"
    },
    {
      "text": "Technically the film is a masterpiece. The production design is first rate and the various locations jump off the screen like three-dimensional postcards.",
      "author": "Michael A. Smith"
    },
    {
      "text": "Tenet is all action all the time, sacrificing heart and clarity for spectacle.",
      "author": "Cameron Meier"
    },
    {
      "text": "The biggest problem with the film is its lack of heart. This is a cold exercise lacking an avenue through which the viewer can become emotionally engaged.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Don't try to keep up -- just sit back and let Tenet carry you away.",
      "author": "Kate Rodger"
    },
    {
      "text": "By the end, I enjoyed it.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "\"Tenet\" is Nolan's attempt to outdo and subvert the James Bond thriller, a globe-hopping adventure that gets increasingly heady and convoluted as it goes forward. And then backward. And then forward again.",
      "author": "Rob Thomas"
    },
    {
      "text": "\"Tenet\" is virtuoso filmmaking and frustrating storytelling in equal measure.",
      "author": "Russ Simmons"
    },
    {
      "text": "Christopher Nolan's latest brain-bender is an entertaining if rather dense spy thriller.",
      "author": "Rich Cline"
    },
    {
      "text": "It's a shiny clockwork contraption with a hollow center: a convoluted Rubik's Cube blockbuster that, once solved, reveals little more than the complexity of its own design.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Although the action scenes are certainly flashy and take some interesting risks, the plot is so needlessly complicated and the characters so painfully stale that the film just isn't worth your time -- no pun intended.",
      "author": "Lauren Coates"
    },
    {
      "text": "The film is technically excellent, with jaw-dropping action and clever plot twists. Action fans should be more that delighted with all that, which is brilliantly executed.",
      "author": "Cate Marquis"
    },
    {
      "text": "Like the palindrome title of the movie, it goes back & forth the same way. You might want to wait until Tenet is streaming so you can play it forward & in reverse to figure out what Nolan was really going for. And you'll be able to control the volume.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Nolan's new movie is \"Tenet,\" and it is a big, brassy, brainy spectacle.",
      "author": "Michael Smith"
    },
    {
      "text": "It would be better if Tenet gave us more to feel. That would make it easier to absorb all the confusion that this thriller sows.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "There is a moment when everything begins to click, and you slowly realize what this movie is... It feels like Nolan's version of Bond.",
      "author": "Austin Burke"
    },
    {
      "text": "Tenet, Nolan's latest, is very much about time -- and very little about much else.",
      "author": "Mark Dujsik"
    },
    {
      "text": "A complex but also fascinating experience. [Full review in Spanish]",
      "author": "José Amador Pérez Andújar"
    },
    {
      "text": "John David Washington has crossed a bridge. He's no longer just the son of a superstar actor. He is a superstar actor.",
      "author": "Dwight Brown"
    },
    {
      "text": "When you ignore what Nolan wants you to pay attention to (how smart he is) and just let the dynamism and endless cool wash over you, it's a thrilling experience.",
      "author": "Oluwatayo Adewole"
    },
    {
      "text": "TENET falters to crystallise all its sophisticated and complex mechanics, but as an enthralling piece of cinema where imagination meets scale and ambition, it is the epitome of Nolan at his best.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Tenet can very likely be explained. I'm not sure it can be experienced.",
      "author": "Josh Larsen"
    },
    {
      "text": "Pesky things like narrative and character development only get in Nolan's way, to the point where I cannot help but feel his next film should abandon storytelling altogether.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Both utterly dazzling and increasingly bewildering.",
      "author": "Brian Truitt"
    },
    {
      "text": "It doesn't have the heart of Inception, but Nolan is so far ahead of everyone that he's going in reverse. The action is not only jawdropping, but thought-provoking, like you're deciphering the fight as it's happening.",
      "author": "Lee McCoy"
    },
    {
      "text": "Another cerebral puzzle of epic proportions from Christopher Nolan. Your mind will run a marathon as your eyes will drink in images never before seen from its pulse-pounding opening to its explosive conclusion.",
      "author": "Preston Barta"
    },
    {
      "text": "Even if it ultimately emphasizes spectacle over substance, the film shows that cinematic time travel can be high-minded without losing its cool.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Maybe you could follow what is happening if you wrote it all down on a flow chart with circles and arrows and multiple colored inks, but it wouldn't be worth the effort - and that's hard to do in a dark movie theater.",
      "author": "Daniel Neman"
    },
    {
      "text": "A cacophony of a blockbuster with flashes of wit that stumbles on its bombastic stretches. [Full Review in Spanish]",
      "author": "Jorge Loser"
    },
    {
      "text": "Rather ho-hum, finding Nolan repeating himself to remain in his comfortable, profitable filmmaking bubble, once again issuing a brain-bleeder that only he understands in full.",
      "author": "Brian Orndorf"
    },
    {
      "text": "[W]hile it may not have quite the philosophical heft of some of his other work, it is provocative and evocative in its own right. As with so many of Nolan's films, what you take from it is directly proportional to what you put in.",
      "author": "Allen Adams"
    },
    {
      "text": "Posey's character, a scientist, says early on, \"don't try to understand it, feel it.\" That's good advice.",
      "author": "Dana Barbuto"
    },
    {
      "text": "These amazing set pieces, while respectable for their reliance on practical effects and impressive for Nolan's commitment to his craft, often feel divorced from the rest of Tenet.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Nolan has finally zoomed out so far with a story that fundamentals of physics have themselves become character motivations.",
      "author": "David Sims"
    },
    {
      "text": "Tenet is the kind of thrilling blockbuster that we so desperately need in any summer.",
      "author": "Nick Johnston"
    },
    {
      "text": "The more everyone explains the plot, the more needlessly complicated it becomes. The \"grandfather paradox\" is mentioned, but Back to the Future and The Terminator handled the same idea with less heavy lifting.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "Big, loud, muscular, and teaming with abundant testosterone, which actually works to its advantage as it's essentially a James Bond flick as filtered through science fiction. (Full Content Review for Parents - Violence, Profanity, etc. - Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Nolan's latest gargantuan effort to blow your mind may duly blow your mind, or it may simply bruise it, but at least it's a whole lot of movie, and to that I say bravo.",
      "author": "Kyle Smith"
    },
    {
      "text": "I liked Tenet.",
      "author": "Walter Chaw"
    },
    {
      "text": "I didn't want to dive further into Tenet's logical knot - I wanted to swat it away.",
      "author": "Richard Lawson"
    },
    {
      "text": "Nolan delivers another mind-blowing concept with stunning visuals and breathtaking action sequences.",
      "author": "Sharronda Williams"
    },
    {
      "text": "Christopher Nolan's mission to save cinema mostly succeeds with a convoluted yet thrilling experience designed to be witnessed in movie theaters.",
      "author": "Aaron Peterson"
    },
    {
      "text": "Tenet is an amazingly ambitious and heart-pounding action thriller that misses the mark by being too smart for its own good. It's still a fun ride worth the watch in theaters.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Slick action scenes and visual effects can't save the tediously complex Tenet.",
      "author": "Julian Roman"
    },
    {
      "text": "Nolan never fails to deliver on the big screen experience and, in spite of some atypical predictability, this is a thrilling watch from beginning to end.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "Tenet is the most ambitious and alienating film Nolan's ever made.",
      "author": "Hannah Lodge"
    },
    {
      "text": "The film has some great set-pieces, a game cast, and a compelling premise, but the parts are better than the sum.",
      "author": "Jeff York"
    },
    {
      "text": "In the end, Tenet is mostly understood but rarely felt; it's one of Nolan's worst. The upside is that even his lower-tier works provide one hell of a spectacle",
      "author": "Robert Kojder"
    },
    {
      "text": "An undeniably ambitious but dramatically confused story which feels as if it is going out of its way to come across as the most deliberately obtuse and impossible-to-follow Bond film ever made.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "A maze-like action thriller that's exciting in the moment, even if it's gratuitously complicated.",
      "author": "Sean P. Means"
    },
    {
      "text": "The overdone complications, playful timelines and filmmaking tricks are icing on the cake; moviemaking confection...'Tenet' is all icing, no cake.",
      "author": "Matt Oakes"
    },
    {
      "text": "\"Tenet\" is a magic trick on a loop, and it might leave you with a gnawing headache.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "\"Tenet\" lacks the elegant mastery of \"Dunkirk\" or the cosmic soulfulness of \"Interstellar,\" but it has a darkly grand geometry.",
      "author": "Jake Coyle"
    },
    {
      "text": "Even at its most bewildering, the raw imagination and distinctive imagery on display are always thrilling.",
      "author": "Matt Singer"
    },
    {
      "text": "Gorgeous visuals and game performances can't compensate for generic action, thin characters and a needlessly convoluted plot. Oh, and it would be nice if we could hear all of that exposition...",
      "author": "Scott Mendelson"
    },
    {
      "text": "The plot can become tireless and exhausting, but this is Christopher Nolan firing on all cylinders, and \"Tenet\" is an audicious time-bending thriller that literally makes you question reality and space. You won't believe your eyes.",
      "author": "Nate Adams"
    },
    {
      "text": "The storyline is mind-bendingly intricate, with thought-provoking fantasy and juicy twists. But the characters are never more than one-dimensional.",
      "author": "Nell Minow"
    },
    {
      "text": "What the hell was that?",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "His stunts feel realer than his stakes.",
      "author": "CJ Sheu"
    },
    {
      "text": "It goes to show all the splashy action in the world does not get you anywhere, for this critic at least, if the characters aren't engaging and the story isn't interesting",
      "author": "Rachel Wagner"
    },
    {
      "text": "Impressively constructed [but] Christopher Nolan's obsession with manipulation of time is starting to become something for an audience of one.",
      "author": "Dan Murrell"
    },
    {
      "text": "Fans of Nolan's films will enjoy rewatching this until they pick up on a few of the revelations, while everyone else will walk away mystified and only marginally entertained.",
      "author": "Mike Massie"
    },
    {
      "text": "Knowing how hard Nolan is trying to recreate what was so cool and exciting about Inception, but not really succeeding, makes Tenet a disappointment at best.",
      "author": "Edward Douglas"
    },
    {
      "text": "It's as if you're trying to solve a math problem while cars crash around you and there's a variable you're constantly missing.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Nolan doesn't seem to care too much about leaving his viewers confused. The question is whether a confused audience can still be an entertained audience.",
      "author": "Matt Looker"
    },
    {
      "text": "It's bitten off more than it can chew but with the positives balancing out the negatives, Tenet deserves a look.",
      "author": "Matthew Toomey"
    },
    {
      "text": "When it's all said and done, chances are you'll be obsessing over what you don't understand about Tenet , rather than what you enjoyed.",
      "author": "Travis Hopson"
    },
    {
      "text": "The secret to enjoy 'Tenet' lies in what a scientist, who is explaining inversion tells the Protagonist, \"Don't try to understand, feel it.\"",
      "author": "Ronak Kotecha"
    },
    {
      "text": "\"Tenet\" is a sleek, mysterious clockwork which, like its title, flips in its middle and doubles back on itself, exposing its inner machinations. As The Protagonist, John David Washington imbues the director's chilly aesthetic with humanizing warmth.",
      "author": "Laura Clifford"
    },
    {
      "text": "If big entertainments want to be respected as intelligent entertainments, they must communicate with audiences clearly, not flit between the abstract and pretentious.",
      "author": "Ed Whitfield"
    },
    {
      "text": "In the end, hate it or love it, this is a movie to be seen by all and at least once.",
      "author": "Hanna B"
    },
    {
      "text": "Director Christopher Nolan the showman is in his element with this mammoth head-scratcher, rolling out stunts, trappings and confrontations.",
      "author": "Andiee Paviour"
    },
    {
      "text": "It's among the director's most ambitious efforts and is a match for his most narratively complicated screenplays.",
      "author": "James Berardinelli"
    },
    {
      "text": "A flick you'll want, however desperately, to like more than you actually do, this is surely the most Nolan-esque Nolan offering of them all...is this really the movie that's going to save the industry from COVID-induced oblivion?",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "It's another intriguing and fascinating film from one of our most daring filmmakers working within the mainstream system.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "Pure, ravishing cinema from Nolan who offers a dizzying, delirious ride for lockdown audiences yearning to gather before the biggest screen possible in a union of hearts and minds. There's a killer plague betting against him. It's your call.",
      "author": "Peter Travers"
    },
    {
      "text": "It is too dense and incomprehensible. But wow, the lead performances are perfection.",
      "author": "Anne Brodie"
    },
    {
      "text": "Everything happening in the film is cued up visually. This is a film built for full attention no matter where (or when) you watch it.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "This is a film that will cause many to throw up their hands in bamboozlement - and many more, I hope, to clasp theirs in awe and delight.",
      "author": "Robbie Collin"
    },
    {
      "text": "Gloriously mind-bending bunkum, done with such conviction you really will believe your eyes.",
      "author": "Sarah Cartland"
    },
    {
      "text": "Tenet's gears turn smoothly, but it's like a factory with no raw material to process.",
      "author": "Sam Adams"
    },
    {
      "text": "A hold-on-by-your-fingernails thrill ride with subtle touches of wit, romance, suspense, tragedy, determination and cinema-driven awe woven throughout it.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Nolan has made better films, but Tenet is a culmination of his distinctive filmmaking, so it's hard not to be impressed.",
      "author": "Ian Schultz"
    },
    {
      "text": "Tenet is by no means a disaster -- it's a solid three-starrer... Nolan's film have always demanded the largest canvas -- but safe to say this is one time reversal film you probably won't immediately want to watch again.",
      "author": "Stuart McGurk"
    },
    {
      "text": "Tenet is clearly attempting some kind of emotional payoff that remains out of reach. By the end, the idea of swimming against the current feels like a metaphor for the film itself.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "It's alternately compelling and mind blowing, while potentially being mind numbing when trying to keep up with its time shifting machinations and plot density.",
      "author": "George M. Thomas"
    },
    {
      "text": "What unspools across the screen for nearly two-and-a-half hours is one scene topping another that leaves viewers thinking, \"How did they do that?\"",
      "author": "Mark Daniell"
    },
    {
      "text": "A dazzling, confusing spectacle.",
      "author": "Rachael Harper"
    },
    {
      "text": "It's exhilarating, mind-bending and the score is to die for.",
      "author": "Marwa Hamad"
    },
    {
      "text": "Viewers won't be able to fully understand Tenet's dialogue, and they're likely to have the same problem in trying to understand its convoluted plot. But there isn't much there to feel, either.",
      "author": "Tina Hassannia"
    },
    {
      "text": "So yes, the whos, whats, whys, wheres, whens and hows will assault you non-stop until you give up and go with the flow. Unfortunately, there is nothing to feel.",
      "author": "Jeanmarie Tan"
    },
    {
      "text": "Tenet is a bit like the myth whereby NASA spent millions of dollars on a pen that could work in zero gravity when the Soviets just used a pencil. Nolan should re-learn how to use a pencil.",
      "author": "Tom Duggins"
    },
    {
      "text": "Every time that Tenet stops to speak, it only emphasizes a hollowness within: how enamored it is of its own cleverness.",
      "author": "Ben Flanagan"
    },
    {
      "text": "[Costume Designer] Jeffrey Kurland is surely a shoo-in for an Oscar nomination - either way, he won't want for future job opportunities.",
      "author": "Matthew Turner"
    },
    {
      "text": "This one has it all: a brand-name film-maker in Christopher Nolan, big names in the cast and, most importantly, big action.",
      "author": "John Lui"
    },
    {
      "text": "But there remains a sense that Nolan has got his cinematic mission back to front. Yes, he's giving us a cerebral workout, yet we could also do with more visceral thrills and romance, and a bigger sense of fun.",
      "author": "Jason Best"
    },
    {
      "text": "I wish \"Tenet\" exploited its own ideas more dynamically. Nolan's a prodigious talent. But no major director, I suppose, can avoid going sideways from time to time.",
      "author": "Michael Phillips"
    },
    {
      "text": "Tenet is a complex and yet deceptively simple film that has the capacity to leave you loving and loathing it at the same time. As it is so hellbent on telling us: yes, we can have it both ways.",
      "author": "Rebecca Harrison"
    },
    {
      "text": "Christopher Nolan will render you speechless and shivering in endless exhilaration.",
      "author": "Ben Rolph"
    },
    {
      "text": "Tenet is truly a marvel, especially when seen on the biggest screen possible with a sound system to rock the floor beneath your feet. The film offers a story and overall experience which will still satisfy those who cannot get to a movie theater.",
      "author": "Brandon Davis"
    },
    {
      "text": "There is no emotional root to concern yourself with beyond the visual force of the images. [Full Reviews in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "May be the loudest movie I've ever seen.",
      "author": "CJ Johnson"
    },
    {
      "text": "If \"Tenet\" can be a hard movie to fully get invested in emotionally, or even comprehend it for that matter, the craftsmanship is second to none.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Working from his own labyrinthine screenplay, Nolan (along with cinematographer Hoyte van Hoytema and the special effects crew) has great fun with elaborate set pieces...",
      "author": "Richard Roeper"
    },
    {
      "text": "It's an epic film both for its thrilling set-pieces and its complex concepts. [Full review in French]",
      "author": "Kevin N. Laforest"
    },
    {
      "text": "Beneath the highly polished spy-thriller aesthetic lies a head-spinning, temporally warped plot, laced with concepts and conceits that will delight and baffle in equal measures.",
      "author": "Joseph Walsh"
    },
    {
      "text": "Sprawling and ambitious, flawed yet admirable, failure and success concurrently reside in every minute of Tenet. A technical feat but a narrative dud.",
      "author": "Robert Daniels"
    },
    {
      "text": "[W]hat's surprising about the film is how attuned to the current moment it sometimes feels, not just in its futuristic prognostications, but in its grimly ironic thematic obsession with humanity's unwillingness to prepare for a future it can see coming.",
      "author": "Alistair Harkness"
    },
    {
      "text": "The performances are all excellent, with Debicki elevating Nolan's rote depiction of abusive relationships and motherhood, and Pattinson providing louche charm galore, while Washington is an endlessly compelling presence...",
      "author": "Roe McDermott"
    },
    {
      "text": "Tenet is a unique and often stunning film about the nature of time and fate, but it's ultimately a little too smart for its own good.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "It is 100% designed as an experience for people who have unpacked films like The Prestige and Memento late into the night, hoping to give Nolan fans more to chew on than ever before.",
      "author": "Brian Tallerico"
    },
    {
      "text": "\"Tenet\" is, as breathless as it can feel in its best bits, ultimately, no more and no less than a consummately arranged film about a group of people who arrive, get the job done with enormous skill and at great expense, and leave.",
      "author": "Caspar Salmon"
    },
    {
      "text": "whether you ultimately like the end result or not, you'll definitely feel something, even if it's only the booming bass of Richard King's sound design and Ludwig Göransson's score rattling your seat at key moments.",
      "author": "Amber Wilkinson"
    },
    {
      "text": "Tenet's first hour is as elegant as its director, always in a suit. [Full review in Spanish]",
      "author": "Andrea G. Bermejo"
    },
    {
      "text": "Nolan's latest contribution to the canon of first-year dorm posters was made for stoned teens who want to get their mind blown by trippy fight sequences and unsolvable paradoxes about time travel.",
      "author": "Alex Hudson"
    },
    {
      "text": "You could take the advice Poésy's character gives... \"Don't try to understand it. Feel it.\"",
      "author": "Chris Knight"
    },
    {
      "text": "Incredibly ambitious and inventive, Tenet is a film that demands repeat viewings. To boil it down - imagine a super cerebral version of a James Bond movie - but backwards.",
      "author": "Chris Bumbray"
    },
    {
      "text": "It's not the best Nolan film by a longshot, but it's certainly the most Nolan film, and there's certainly a curious charm to that.",
      "author": "Andrew Parker"
    },
    {
      "text": "The most audacious Nolan film to date; Tenet is pure cinematic spectacle. The score, mind-bending concept & utterly immersive action make for a truly unique experience,",
      "author": "Nicola Austin"
    },
    {
      "text": "Christopher Nolan turns the spy thriller into a disproportionate palindromic spectacle that recovers the pleasure of perplexity in cinema. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "On the surface, the strokes in Tenet may seem simple, but they have grand effects especially as far as its cinematography is concerned. [Full Review in Spanish]",
      "author": "Manu Yáñez"
    },
    {
      "text": "Tenet is a locked puzzle box with nothing inside.",
      "author": "Christina Newland"
    },
    {
      "text": "Maybe it will take repeated viewings to fully appreciate Nolan's achievement here; certainly he deserves praise for his attempts to reinvent a pretty tired genre.",
      "author": "David Stratton"
    },
    {
      "text": "This is Nolan on typically spectacular form... All terrific, but then we come to the story. A riddle wrapped in a mystery inside an enigma is just the start of it.",
      "author": "Alison Rowat"
    },
    {
      "text": "In its finest moments, Tenet is like Pattinson's hair: slick and immaculate. But messy plotting and deliberately confused dialogue drive the film frustratingly off-course time and time again, leaving us with Nolan's patchiest work to date.",
      "author": "Robert Salusbury"
    },
    {
      "text": "A deadpan jeu d'esprit, a cerebral cadenza, a deadpan flourish of crazy implausibility - but supercharged with steroidal energy and imagination.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Tenet cuts both ways, welcoming us into Nolan's time-bending world of wonder while also practically daring us to come out the other end without a headache.",
      "author": "Nicholas Fonseca"
    },
    {
      "text": "Nolan has taken a trope that has sent many a movie down a rabbit hole - time travel - and found a way to make it even more confounding.",
      "author": "Jim Slotek"
    },
    {
      "text": "It's peak Nolan, in a good way, and even if some characters are not as fleshed out, his cast convincingly sells the impact of what's happening at any given moment.",
      "author": "Amon Warmann"
    },
    {
      "text": "Christopher Nolan's mind-bending melting pot of confusion is a visually epic phenomena, but its vagueness and headache-inducing storyline leave a sour taste.",
      "author": "Zehra Phelan"
    },
    {
      "text": "Tenet's twists and thoughtful complexities will have the most-devoted Nolan fans heading back to the cinema for a rewatch, to catch whatever they missed the first time around.",
      "author": "George Simpson"
    },
    {
      "text": "While my brain wrestled with 'temporal pincer movements' and a double helping of high-speed car-chases, what keeps you going is Nolan's obvious sincerity, his love of real cinematic spectacle and his tremendous talent for staging it.",
      "author": "Michael Bond"
    },
    {
      "text": "Christopher Nolan's spy thriller Tenet is a mind-boggling and time-bending spectacle.",
      "author": "Kate Muir"
    },
    {
      "text": "Tenet is not a complete disaster, nor is it the messianic blockbuster that will help pull cinemas out of the rubble this year.",
      "author": "Alex Lines"
    },
    {
      "text": "Christopher Nolan's most challenging film - and also his most satisfying.",
      "author": "Peter Howell"
    },
    {
      "text": "It won't leave you shaken, but your mind will be stirred. And that has to be worth a trip to the cinema.",
      "author": "Will Gompertz"
    },
    {
      "text": "An incredible time at the movies for which - and this may sound like an exaggeration, but from my own experience it is not - not all brains are prepared... [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Tenet is a crazy, revolutionary, extraordinary and chilling maze where Christopher Nolan seems to have reached the limit. [Full Review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "Tenet is a massively conceived and structured film, but it lacks a heart.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Christopher Nolan has pulled out all the stops for Tenet.",
      "author": "Vicky Roach"
    },
    {
      "text": "Luckily, for what Tenet lacks in narrative comprehension, it more than makes up for in action--a cinematic language with which Nolan has become increasingly fluent.",
      "author": "Hanna Flint"
    },
    {
      "text": "Tenet is Nolan's ultimate puzzle. Those with the constitution to unwaveringly pay attention to its secrets will be rewarded with an epic tale found somewhere beyond time. Those without may just have to get by on the visual achievements alone",
      "author": "Mark Goodyear"
    },
    {
      "text": "In short, Tenet isn't any old Christopher Nolan movie. It's a Christopher Nolan movie squared - Nolan to the power of Nolan.",
      "author": "Tom Shone"
    },
    {
      "text": "Nolan seems to be... encouraging the audience to trust the film's beats and to feel its impact on a gut level. As a strategy of film-making, it's a supremely confident one and in parts Nolan pulls it off.",
      "author": "Simran Hans"
    },
    {
      "text": "Although shaky in its communication of the science, it more than makes up for it in ambition and stupendous action.",
      "author": "Emma Simmonds"
    },
    {
      "text": "It's easy to be dazzled by its visual feats, but it's hard to truly enjoy a film that leaves its audience feeling entirely befuddled and exhausted by everything they've just experienced.",
      "author": "Doug Jamieson"
    },
    {
      "text": "bold, epic and ingenious",
      "author": "Chris Hunneysett"
    },
    {
      "text": "Washington in the lead is perfect and as we already saw in Spike Lee's BlacKkKlansman, he can carry a film on his shoulders. In Tenet this is even more evident.",
      "author": "Tero Heikkinen"
    },
    {
      "text": "Tenet instead feels like it's pushing you away from engaging with its deeper plot, rather than inviting you in to engage with it intimately.",
      "author": "Andrew F. Peirce"
    },
    {
      "text": "Overlong, noisy, full of poe-faced delivery of portentous dialogue, needlessly convoluted plot threads, unearned sense of gravitas that verges on the unintentionally hilarious and a script that isn't even vaguely as clever as it seems to think it is",
      "author": "Anthony O'Connor"
    },
    {
      "text": "If Tenet had paid as much attention to its writing and character work as it did to its visual and conceptual ambitions, it could have been a masterpiece instead of merely great. But it's still great.",
      "author": "Wenlei Ma"
    },
    {
      "text": "After five months stuck in front of the small screen, maybe being a little overwhelmed is no bad thing. But it's hard to escape the sense that less might have been more.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "It's breathtaking at times, and frustrating at others, but even with all its near-detrimental ambition it's a film that is at least trying to break a familiar mould.",
      "author": "Peter Gray"
    },
    {
      "text": "It's a tense, bewildering assault on the senses. It was never going to live up to all the expectations - but despite the frayed plot and bad script, this is still a film you need to see.",
      "author": "Jamie East"
    },
    {
      "text": "It's a high concept thriller which never fails to take itself with deadly seriousness but Tenet fails to live up to the intriguing set-up in the first act and doesn't quite convince the viewer of its internal logic...",
      "author": "Alan Corr"
    },
    {
      "text": "No doubt avid students of the Nolan formula will get months of entertainment out of repeated viewings, but for me it was oddly tantalizing -- full of good things but ultimately frustrating.",
      "author": "Sandra Hall"
    },
    {
      "text": "Nolan is the sort of filmmaker who captures our imaginations for what could be possible, which is something that feels important right now.",
      "author": "Emily Zemler"
    },
    {
      "text": "If a headache can ever be pleasurable, it's when watching Tenet.",
      "author": "Tom Beasley"
    },
    {
      "text": "Great movies always time travel - living with you beyond the closing credits, carried into the future. With Tenet, 150 minutes pass harmlessly, but the film left my head before I took off my face mask.",
      "author": "Danny Leigh"
    },
    {
      "text": "If Nolan has out-Nolaned himself, it's in the action set-pieces which, despite being of head-scrambling technical intricacy, are sharper than Occam's razor and carried off with astonishing economy.",
      "author": "Adam Woodward"
    },
    {
      "text": "Nolan is an artist extraordinaire.",
      "author": "Scott Davis"
    },
    {
      "text": "The most important film of the year is a heavy weight to carry, and Tenet for the most part pulls it off. This may not be a perfect film but it could just be perfect cinema.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Altogether, it makes for a chilly, cerebral film - easy to admire, especially since it's so rich in audacity and originality, but almost impossible to love, lacking as it is in a certain humanity.",
      "author": "Leslie Felperin"
    },
    {
      "text": "To point out that Tenet has flaws feels ungrateful. It's like slagging off Santa. But, I confess, some of the yick yacking - vis a vis physics, metaphysics and so on - made me sleepy... Those quibbles aside, Tenet is an eye-popping, ground-breaking blast.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "We're never meant to know what exactly is going on at any one moment, but we will be - we must be - entertained by the overwhelming nonsense of it all.",
      "author": "Barry Hertz"
    },
    {
      "text": "The real joy of the film, nonetheless, is the sheer spectacle.",
      "author": "Kevin Maher"
    },
    {
      "text": "The movie is a race against a clock that defies everything we know about time. Massively scaled sequences have time moving forward and backwards and zigzagging all at once. The action exceeds anything Nolan has ever done before.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "Revisiting ideas he had already broached in his brilliantly underrated space saga Interstellar, Nolan is back again to his favourite subject, Time. The results are, unsurprisingly, phenomenal.",
      "author": "Linda Marric"
    },
    {
      "text": "Seek it out, if only to marvel at the entertainingly inane glory of what we once had and are in danger of never having again.",
      "author": "Jessica Kiang"
    },
    {
      "text": "Tenet feels a little conservative, as if Nolan's style is a franchise rather than a framework. Despite this, it remains more interesting than most other tentpole movies and acts as a beacon for the director's strengths.",
      "author": "Matt Purslow"
    },
    {
      "text": "It's a dream ride... for the most part, for anyone looking for glitzy escapism, and who wouldn't include themselves in that demographic right now.",
      "author": "Fionnuala Halligan"
    },
    {
      "text": "Nolan's latest may well be full of sound and fury, signifying nothing, or it may signify something imponderably resonant, and signify it forward, backward and inside out. Does your head hurt yet?",
      "author": "Jonathan Romney"
    },
    {
      "text": "It's the kind of film worthy of heralding a triumphant, unashamedly explosive return to cinemas, whenever that happens.",
      "author": "Shannon Connellan"
    },
    {
      "text": "Bamboozling, bold, wildly spectacular - this could be the perfect curtain-raiser for this year's delayed blockbuster season.",
      "author": "Andy Lea"
    },
    {
      "text": "The world is more than ready for a fabulous blockbuster... It's a real shame Tenet isn't it.",
      "author": "Catherine Shoard"
    },
    {
      "text": "What's really there to untangle, beyond loops of string and a whole lot of smoke rings?",
      "author": "Mike McCahill"
    },
    {
      "text": "When you come right down to it, 'Tenet' is a mess. A gloriously shot, exquisitely staged mess with a thrilling final act - but still a mess.",
      "author": "Brian Lloyd"
    },
    {
      "text": "For those who don't want to engage with Nolan's academic exercises, just tune out and revel in its baser pleasures: thrilling spy set pieces and charismatic leads. The other stuff? Ain't nobody got time for that.",
      "author": "Simon Miraudo"
    },
    {
      "text": "In the end, \"Tenet\" isn't one of Nolan's most satisfying films. But after I've seen it four or five more times, maybe I'll change my mind.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Happily, Tenet exceeds our already sky-high expectations.",
      "author": "James Mottram"
    },
    {
      "text": "Tenet is a thrilling place to get lost in.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "The stakes have never been higher, but Tenet is exactly the film cinemas need right now.",
      "author": "Jordan Farley"
    },
    {
      "text": "Even if we were brave enough to try, we would not be capable of spoiling a plot so wilfully obtuse it demands repeat viewings to disentangle.",
      "author": "Donald Clarke"
    },
    {
      "text": "Tenet is technically excellent and challenging, pushing boundaries and subverting expectations with the director's usual elegance.",
      "author": "Laura Potier"
    },
    {
      "text": "A concrete cornucopia of global chaos and threat, in which humanity's survival depends on the minor matter of reshaping time and space, \"Tenet\" looks well suited to an anxious age.",
      "author": "Guy Lodge"
    },
    {
      "text": "By the time it's done, you might not know what the hell's gone on, but it is exciting nevertheless. It is ferociously entertaining.",
      "author": "Alex Godfrey"
    },
    {
      "text": "For all the technical achievements and Christopher Nolan's potentially captivating time-inversion concept, \"Tenet\" lacks the heart and soul to qualify as among the best movies in his illustrious filmography.",
      "author": "Casey Chong"
    },
    {
      "text": "An original and mind-bending take on a spy movie... Solely in terms of technical aspects, it's an incredible feat of filmmaking.",
      "author": "Ian Sandwell"
    },
    {
      "text": "Say what you will about the tenets of TENET, at least it has an ethos.",
      "author": "Jason Gorber"
    }
  ],
  "release_year": 2020,
  "duration": 150,
  "genres": [
    "Action",
    "Sci-Fi",
    "Mystery & Thriller"
  ],
  "age_rating": "PG-13",
  "synopsis": "A secret agent embarks on a dangerous, time-bending mission to prevent the start of World War III.",
  "popularity": 7.6,
  "poster_url": "https://image.tmdb.org/t/p/original/aCIFMriQh8rvhxpN1IWGgvH0Tlg.jpg"
}