{
  "movie_name": "The Batman",
  "movie_id": "the_batman",
  "total_reviews": 500,
  "reviews": [
    {
      "text": "The film creates an alluring combination of the familiar and the fresh.",
      "author": "Christina Newland"
    },
    {
      "text": "\"The Batman\" has a somber tone different from previous versions that, due to its enunciation, bring it closer to the style of the Film-Noir film genre, returning to the original style of the comic strip and its proximity to pulp literature.",
      "author": "Denise Pieniazek"
    },
    {
      "text": "When it’s all said and done, The Batman is good—not great. From technical and narrative standpoints, there are both gaps and achievements.",
      "author": "Brittany Patrice Witherspoon"
    },
    {
      "text": "For a film set deep in the depths of Gotham’s gritty underbelly, the script slowly descends into the chaotic silliness of the characters that it feels so desperate to shed",
      "author": "Connor Lightbody"
    },
    {
      "text": "The Batman is a gritty psychological crime thriller featuring the most Gotham-esqe Gotham we’ve seen yet.",
      "author": "Nadya Martinez"
    },
    {
      "text": "It’s certainly a better film than any of the Zack Snyder ones. But that’s not exactly a high bar to set.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "This film is beautifully gritty and simply a great detective story. It takes Batman to his roots and acknowledges the silliness of a sad, orphan boy in a rubber suit.",
      "author": "Zach Youngs"
    },
    {
      "text": "It starts with an original vision of the hero, has an inspired cast, creates a self-sufficient story and elevates it with a stylized direction that's in line with the film's substance. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "The Batman is an ALL TIME BEST FILM. Matt Reeves has crafted the DEFINITIVE take on The Caped Crusader that Pattinson will define for generations to come. Brooding and brutal, I didn’t want it to end.",
      "author": "Daniel Baptista"
    },
    {
      "text": "The Batman isn’t just another entry in a trilogy or a multi-directed Batman starring three Bruce Wayne’s. It’s a love letter to fans who have waited decades for a faithful adaptation of Batman.",
      "author": "Christian Eulinberg"
    },
    {
      "text": "This latest Batman tale is grounded, noir and detective based, and a highly realistic entry into the movie mythos of the caped crusader.",
      "author": "Jeffrey Peterson"
    },
    {
      "text": "It’s a part-serial killer mystery, part-superhero adventure, and part-crime drama stuffed in a 3-hour runtime that can feel loaded but never dull.",
      "author": "Ryan Oquiza"
    },
    {
      "text": "Not only does the central plot feel like a rehashing of other films and comic books, the entire movie plays like a patchwork quilt of past works.",
      "author": "Rick Bentley"
    },
    {
      "text": "A phenomenal take on the caped crusader that will leave you wanting more from this Batman world.",
      "author": "Cris Parker"
    },
    {
      "text": "The Batman becomes less of a full-throttle action romp and more of a detective tale, an arc that hasn’t been filmed before.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "BEST Batman Film yet…. Beautifully made with incredible action sequences, a thrilling mystery, & amazing characters. You can’t get any better than this & wherever smart Reeves goes next door will I.",
      "author": "Zach Pope"
    },
    {
      "text": "With an incredible score by Michael Giacchino, and a backdrop of Nirvana songs to elevate the mood, The Batman is a fantastic film. The acting and fighting sequences will keep audiences on the edge of their seats.",
      "author": "Matthew Creith"
    },
    {
      "text": "Matt Reeves delivers a distinctly darker, more intense, frighteningly realistic noir thriller than past adaptations, with an aggressively vengeful Bruce Wayne / Batman and a fear-inducing, mysterious, lunatic Riddler.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Even with a runtime of nearly three hours, The Batman leaves the audience wanting more. While ultimately fumbling the ending, the characters, performances, plot, and visual appearance leave enough behind to warrant a return to this version of Gotham.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "The Batman is everything a superhero film should be. It’s gritty, stylistic, and most importantly, there’s an intrinsic balance between the action and quiet moments, which Matt Reeves masters superbly through this adaptation.",
      "author": "Gissane Sophia"
    },
    {
      "text": "In a lot of ways, the disjointed editing in The Batman leaves much for the viewer to process; not enough time exists for key character moments.",
      "author": "Peter Bell"
    },
    {
      "text": "... In this Batman -- very different from Nolan's, Burton's or Schumacher's -- everything seems more appeased, more contained, more... human. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "They turned revealing an antagonist's presence to the audience without the victim's knowledge into a suspense-driven art. Here, Reeves taps directly into these tactics to phenomenal effect...",
      "author": "William Jones"
    },
    {
      "text": "This is the ultimate Batman movie.",
      "author": "Steph Cozza"
    },
    {
      "text": "Batman's superpower has always been that he's the smartest guy in the room. ... His title as the Dark Knight Detective has never been showcased on film as well as it was in The Batman.",
      "author": "Jonathan Garcia"
    },
    {
      "text": "It may take three hours for Bruce to learn this lesson, but it's an incredible three hours. It may be fun to watch Pattinson put on black make-up and strap into the Batsuit to fight some bad guys, but there's much more to this story than just that.",
      "author": "Alex Billington"
    },
    {
      "text": "THE BATMAN exceeds my expectations and passes the bar of a reboot. It justifies its own existence with great storytelling, insights into humanity and human society, and powerful performances.",
      "author": "Dolores Quintana"
    },
    {
      "text": "“The Batman” reaches for an ingenious and compelling new way to tell a story about the thin lines between corruption, greed and nobility — but ever so limply and always just out of its grasp.",
      "author": "Candice Frederick"
    },
    {
      "text": "Matt Reeves’ The Batman brings us closest to the essence of the Batman character than any film adapted from the DC comics have since Tim Burton’s inaugural Batman in 1989.",
      "author": "Wesley Lovell"
    },
    {
      "text": "The Batman is a brave, bold and brilliant new take on a familiar character and Reeves and Pattinson have done him proud.",
      "author": "Dallas King"
    },
    {
      "text": "Matt Reeves’ The Batman is a brutal, uncompromising vision that leaves its indelible mark in comic book film history.",
      "author": "M.N. Miller"
    },
    {
      "text": "The film casts long shadows with blacks and grays, but the consistent, bleeding flashes of red paint the most intense moments with jarring contrast.",
      "author": "Maggie Lovitt"
    },
    {
      "text": "The Batman is the only comic book adaptation since The Dark Knight to come close to recreating that cinematic achievement, brilliantly blending entertainment with artistry.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "Reeves, it should be noted, assembles a lot of other people’s ideas and themes into this mammoth package. The movie is a triumph of craft and design, but original it ain’t.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Reeves’ vision is fresh and innovative, building a young (but not brand new) version of the Bat world that is satisfying as a single film, while planting the seeds for a juggernaut franchise.",
      "author": "Ron Seoul-Oh"
    },
    {
      "text": "The Batman transcends an oversaturated genre and gives arguably the best portrayal of the caped crusader yet. Matt Reeves delivers a slow-burn detective noir with a terrifying villain and ever-rising tension. A rare film that I would call a masterpiece!",
      "author": "Cody Leach"
    },
    {
      "text": "Writer-director Matt Reeves knows how to write a blockbuster with brains, and he knows how to film one with visual flare.",
      "author": "Scott Phillips"
    },
    {
      "text": "The way that everything is spliced and shaken together, and the mood — and it's definitely a mood — makes this weighty, heavy, sublimely shot, excellently cast, always-engaging blockbuster feel new, and all things Batman with it.",
      "author": "Sarah Ward"
    },
    {
      "text": "THE BATMAN shows that even the best intentions may inspire mayhem, cause heck this is Gotham.",
      "author": "Rosalie Kicks"
    },
    {
      "text": "And even though at times the movie seems a little too male-centric, in times when this is almost prohibited, it felt good to feel those testosterone punches in such a quality, entertaining film. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "How many times can this story be told? Next time pray that the filmmakers aren’t this self-serious about their own vision and that the running time values your time outside of Gotham.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "Lovers of action, fight sequences, digital effects, and mainstream fare may be driven to mental torture. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "Matt Reeves is a director with a vision. I'm glad I enjoy that vision, because Batman needs to have good movies.",
      "author": "Kent Garrison"
    },
    {
      "text": "It is a victory of story and a failure of plot.",
      "author": "Grant Watson"
    },
    {
      "text": "If they had to do one more go on dark, broody, loner, brutal Batman and they decided the selling point was going to be a push into noir... if it had to happen, this is not a bad result. Actually it's pretty good.",
      "author": "Vera Wylde"
    },
    {
      "text": "Do we actually need another brooding Bat-flick of this type? Not really -- a little of Vincent Price prancing around as Egghead would be a welcome sight right about now -- but given its assignment, it mostly gets the job done.",
      "author": "Matt Brunson"
    },
    {
      "text": "Operatic, simmering, and replete with a smoky noir atmosphere, The Batman is an enthralling package of contradictions.",
      "author": "Eric Francisco"
    },
    {
      "text": "more procedural than action movie, a kind of DC Universe version of Seven (1995)",
      "author": "James Kendrick"
    },
    {
      "text": "Matt Reeves' The Batman features skillful cinematography, an epic score, and a memorable turn or two from the cast, but it's all undone by a remarkably weak screenplay that ultimately turns the film into a repetitive, unengaging, and over-long slog.",
      "author": "Jeff Beck"
    },
    {
      "text": "More than a superhero film –there is little \"super\" about the masked hero– it is a contemporary film noir with touches of absolute terror. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "Reeves succeeds much more in the exposition of situations than in the way in which he manages to solve them. [Full review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "Solid and fleshed out.\n[Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "‘The Batman’ is a little long, but it’s an overall surprisingly fun and creepy comic book film that never takes itself too seriously. And Robert Pattinson makes one good emo Batman.",
      "author": "Mary Beth McAndrews"
    },
    {
      "text": "A solid and adult thriller…with constant rhythm that draws away from the traditional blockbuster.\n[Full review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "Certainly stylish and intense, but ultimately in service of a simplistic story.",
      "author": "Witney Seibold"
    },
    {
      "text": "A dazzling, enveloped, night-time spectacle.\n[Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A no man's land that will not comfort the multiplex spectators in search of adrenaline...\n[Full Review in Spanish]",
      "author": "Felipe Rodríguez Torres"
    },
    {
      "text": "If any character leaves you wanting more in a good way, it's Farrell. He's very entertaining, something the film strives very hard to be in all its gothic rage. It's his young Penguin who nearly steals Matt Reeves's film.",
      "author": "Dan Buffa"
    },
    {
      "text": "A Batman that has never been seen in cinema. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "The action scenes and special effects in The Batman are top-notch, but what makes it all worth watching (on top of your device's Pause button for bathroom breaks) is the strong supporting cast...",
      "author": "Steve Murray"
    },
    {
      "text": "While the film has been mostly applauded, that for me was where the good stuff ended. First of all, it is interminable. 2 hours and 56 minutes!!!! I mean.that is not necessary.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "\"The Batman\" is an installment of an often-depicted superhero that manages to give a fresh take. Both atmosphere and plot are dark and heavy. This may not be the kind of movie for those who lean more towards the MarvelDisney fanfare.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "Overlong but quite strong as an origin story that works on an emotional level by the end. The cast handles this material well, making it more of a detective yarn with hints of commentary about privilege by the end that could've been fleshed out more.",
      "author": "Jim Laczkowski"
    },
    {
      "text": "A fairly good mock up for a Batman film templated as a graphic novel. Its dark and seedy mood is new backdrop for the Batman films but in terms of showcasing what this cape crusader has to offer in story telling, there is nothing new here.",
      "author": "Alachia Queen"
    },
    {
      "text": "If it's neither fun nor searing, even those iconic pointy ears might struggle to hear the point.",
      "author": "Matt Pais"
    },
    {
      "text": "The Batman shows that Reeves interpretation is one that knows that Caped Crusader was always as famous for his brains as his brawn",
      "author": "Laurence Boyce"
    },
    {
      "text": "It appears that Warner Brothers holy union with HBO MAX has rubbed off on them. diandrareviews",
      "author": "Diandra Reviews"
    },
    {
      "text": "It remains an action thriller that, with detective intrigue and atmospheric styling, shows an unexplored side of the dark knight in a Gotham City that is always drenched in rain and corruption at night. Full review in Spanish",
      "author": "Yasser Medina"
    },
    {
      "text": "The bigger problem is: the Riddler's menace mostly comes from the Army surplus togs and voice modulation. Otherwise, his demeanor is more like the creepy guy in your sophomore CompLit class who always volunteered to read the Henry Miller excerpts.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Thanks to Pattinson and Danos compelling performances, as well as Reevess ambitious direction, The Batman is an enthralling thriller and a welcome return for the Caped Crusader.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Matt Reeves The Batman is a riveting and passionately crafted film noir that wears its inspiration on its sleeve while bringing Detective Batman to the big screen.",
      "author": "Rendy Jones"
    },
    {
      "text": "hose seeking a grim reflection of our times, will find it; those seeking an escape likely will not. And yet, depressive as it is, the film is electrifying, potent, fun.",
      "author": "John Serba"
    },
    {
      "text": "Pattinson successfully goes back in time with this character...",
      "author": "Sucharita Tyagi"
    },
    {
      "text": "I didn’t think I wanted another Batman movie. But it turns out that Matt Reeves’s The Batman -- starring Robert Pattinson, who played Edward Cullen in the Twilight films -- has the Batman we need.",
      "author": "Kathryn Reklis"
    },
    {
      "text": "Matt Reeves and Robert Pattinson made it look easy to make a new great Batman movie. Greig Fraser, Colin Pharrell and Paul Dano steal the show. The best Gotham out there in a universe full of potential. Full review in Spanish",
      "author": "Victor Pineyro"
    },
    {
      "text": "Reeves takes inspiration from numerous comic storylines, mixing and matching to concoct an elaborate tapestry that overflows with iconic characters in differing stages of repute. While not as emotive as his Apes films, the blockbuster spectacle remain.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Always great to see a director with a distinct vision amidst a pool of adaptations. Matt Reeves commits to it and offers a rumination closer to Munich than whacks and pows.",
      "author": "Erik Childress"
    },
    {
      "text": "It doesnt execute every second of its runtime perfectly, but its sense of ambition and drive buoy its entire epic narrative, giving us a reason to get excited about Batman at the movies once again.",
      "author": "Matthew Jackson"
    },
    {
      "text": "Strange, squalid and sinister, Matt Reeves' version is dark and deadly.",
      "author": "Susan Granger"
    },
    {
      "text": "\"The Batman\" offers several great action pieces, but the movie does begin to crumble under its own weight, both in terms of the near-three-hour runtime and its own self-importance.",
      "author": "Matthew Passantino"
    },
    {
      "text": "Perhaps the biggest indictment of Gotham City is that even the villains feel a burning need to fight crime and corruption. Sex and sleaze are everywhere, apart from the Batcave, which may as well be a monks cell.",
      "author": "John McDonald"
    },
    {
      "text": "Although Matt Reeves does make attempts to inflect the tired subject matter with some virtuosity, the universe's over-familiarity and essential stodginess overrides any novelty, to my mind, at least.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Star Pattinson is electric in the role of Batman, expressing so much with his intense silence and reactions to the chaos.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "There's a tactile stickiness to the world that clings to you and immerses you.",
      "author": "Rachel Ho"
    },
    {
      "text": "It's quite possible \"The Batman\" might be too dark and disturbing for some viewers, but I thought it was pretty terrific.",
      "author": "Jim Judy"
    },
    {
      "text": "This new The Batman is a seductive, and gripping detective tale by way of super-heroism. If this is what blockbuster filmmaking in 2022 looks like, then were off to a great start.",
      "author": "Andrew Kendall"
    },
    {
      "text": "The film I imagine Ricky Fitts would grow up to make after the events of 'American Beauty.'",
      "author": "Keith Uhlich"
    },
    {
      "text": "Matt Reeves’ meandering faux-profound take on Batman spends its over-long runtime telling women to shut up and do as they’re told or face the consequences.",
      "author": "Nick Soulsby"
    },
    {
      "text": "175 minutes, dark in form and brilliant in execution, that break any labels a preconceived ideas, making the concepto of \"superhero movies\" lose all its meaning despite the masks and capes showing on screen.",
      "author": "Víctor López G."
    },
    {
      "text": "Thrilling from beginning to end, The Batman offers a bleaker spin on Gotham City's beloved hero as he discovers his role in a city just as wounded as him. Full Review in Spanish",
      "author": "Rene Sanchez"
    },
    {
      "text": "...an above-average comic-book adaptation...",
      "author": "David Nusair"
    },
    {
      "text": "It verges on camp without committing to it, and it essays the operatic without being able to provide the emotional impetus required.",
      "author": "Andrea Chase"
    },
    {
      "text": "Stylish and stark, packed with well-executed action and high-quality performances, The Batman is a welcome addition to the canon of the Caped Crusader. Heres hoping we get to see more of what Reeves, Pattinson and the rest have in mind.",
      "author": "Allen Adams"
    },
    {
      "text": "What this film does achieve, however, is telling a solid new Batman story, one with some pretty compelling twists and a strong point-of-view on who, exactly, the Caped Crusader is. By default, that makes it one of the better Batman movies ever made.",
      "author": "Liz Shannon Miller"
    },
    {
      "text": "As for special effects, they are very good, and Greig Fraser’s cinematography is epic.",
      "author": "Marie Asner"
    },
    {
      "text": "How you like this iteration of Batman may depend upon how you like your serial murderers served and if you like your casting on a binary of Black and White.",
      "author": "Jana Monji"
    },
    {
      "text": "The cast is fine, with Pattinson adding his own touch to a role now undertaken by six different actors in the past 30 years, seven if you go back to Adam West and the original television show of the 1960s.",
      "author": "Michael A. Smith"
    },
    {
      "text": "A beefy, stylised approach and committed performances make this take on the Dark Knight worth a look, even if the film fails to break out of the usual cliched lack of light and colour.",
      "author": "Rich Cline"
    },
    {
      "text": "This is everything I could have asked for in a Batman film. I loved the tone, easter eggs, and so much research that went into this. Bobby Patts brought something different to this character that really stood out. I really loved this film.",
      "author": "Justin Brown"
    },
    {
      "text": "This is at least in the top three Batman films of all time for me. It was a combination of all of the best elements of the Batman character and Gotham as a city. It blew me away. This was fantastic.",
      "author": "Brandon Collins"
    },
    {
      "text": "The Dark Knight returns with a more hopeful take on vengeance",
      "author": "Pedro Luis Graterol"
    },
    {
      "text": "This Batman is as dark, depressed and angry as many of those living in these dark, stressful times. Batman wants revenge, while the villain wants to expose government corruption. Thus, the normal superhero story formula is upended.",
      "author": "Robert Roten"
    },
    {
      "text": "The good guy/bad guy duality — opposite sides of the same coin — has been done to death in past Batman movies. In this one, suffice it to say, it’s taken to startling heights.",
      "author": "Randall King"
    },
    {
      "text": "\"... a veritable breath of fresh air in an industry glutted with visually banal superhero films with plots that feel written by committee.\"",
      "author": "Nathanael Hood"
    },
    {
      "text": "In a film that’s more about the showing than the telling, Pattinson’s moody edginess fits right in.",
      "author": "Nandini Ramnath"
    },
    {
      "text": "The Batman is not only proof that a comic book movie can be sexy, but an indication that the long-gone genre that defined Hollywood in the 80s and the 90s is making a slow but sure comeback.",
      "author": "Carrie Wittmer"
    },
    {
      "text": "The twists and turns, the grim Fincher feel, the growling bruised Batman and the sadistic Riddler, this big-screen blockbuster is heavy-duty and for Bat-fans with a big appetite.",
      "author": "Kate Rodger"
    },
    {
      "text": "I love the way they made Gotham City look.",
      "author": "Tony Baker"
    },
    {
      "text": "The Batman sets the bar for the crowded superhero subgenre in a bold, refreshingly auteur-driven manner.",
      "author": "Matt Conway"
    },
    {
      "text": "Reeves self-possessed direction digs into the character with gravitas and precision, making for a reinvigorating return to basics.",
      "author": "Filipe Freitas"
    },
    {
      "text": "Yes, self-parodic travesties like 'The Batman' could be more original. But even a creative Batman story is still just another Batman story. Isn't it time to give the man a rest?",
      "author": "Chris Barsanti"
    },
    {
      "text": "So committed is this film to a reenvisioned Batman look, feel, and face that I never thought of the other films as I watched. It might be the best reboot Ive seen.",
      "author": "Brett McCracken"
    },
    {
      "text": "With a super tight first half and a second one that tries too hard to work too many plot lines, The Batman goes back to the character's detective-like roots and makes Gotham dark and grim again. Se7en and Saw blending into a low key superhero movie.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "Pattinson is more a presence than a character, and he fits in with the dark visuals and chilling elements of the story.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "If you strip down the characters iconography deep enough, you are left not with a film about capital-B Batman but rather just a sullen sociopath who dresses up like a bat to fight bad guys.",
      "author": "Neil Morris"
    },
    {
      "text": "You can call it brooding -- I call it irritating.",
      "author": "Andy Klein"
    },
    {
      "text": "This movie doesn't earn the three-hour running time... It's an okay Batman movie; it's just too long.",
      "author": "Kevin Carr"
    },
    {
      "text": "Ultimately, this Batman accepts the thankless, death-defying role he’s stepped into, and the sacrifices that go with it. But that choice would be more compelling if it weren’t framed as a tacit acknowledgement of all the inevitable sequels to come...",
      "author": "Adam Nayman"
    },
    {
      "text": "What I like best is that Matt Reeves has delivered something strikingly unique -- not only for a Batman movie but within the superhero genre as a whole. And while I wasn't initially sold on its length, the movie earns its three hour running time.",
      "author": "Keith Garlington"
    },
    {
      "text": "Controversial opinion: a Batman movie should not be longer than 'The Godfather.'",
      "author": "Vincent Mancini"
    },
    {
      "text": "\"The Batman\" transcends the superhero genre, honoring the characters roots by becoming an homage to film noir and the hard-boiled detectives of the 1930s and 40s.",
      "author": "Collin Garbarino"
    },
    {
      "text": "The Batman isnt just one of the best Batman films, its also one of the best comic book films to date.",
      "author": "George Clark"
    },
    {
      "text": "It's early in the year, but Reeves' lumbering misfire is a strong contender for the great overreach of 2022. This is not my Batman.",
      "author": "Rubén Rosario"
    },
    {
      "text": "The city of Gotham just feels very grounded and dangerous.",
      "author": "John Nguyen"
    },
    {
      "text": "The Batman is everything a superhero movie should be.",
      "author": "Jonathan Sim"
    },
    {
      "text": "It's the kind of fat, clumsy imposter that a real Batman movie would tie up and leave at the scene of a crime in order to limit the damage it might do to itself and others.",
      "author": "Ian Simmons"
    },
    {
      "text": "The movie’s inability to imagine its superheroes and supervillains with any meaningful psychological identity is of a piece with the failure to imagine ordinary people with any degree of individuality.",
      "author": "Richard Brody"
    },
    {
      "text": "The Batman is a triumph where we see the Bat find love, hope, and a sense of understanding that he is not alone in this world.",
      "author": "Lyra Hale"
    },
    {
      "text": "It’s not too surprising that this is Reeves’s film, since the recent Planet of the Apes trilogy is among the most rich, complex, and well-crafted franchises in cinematic history.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "An emo-thriller take on the world of Gotham, The Batman explores the mysteries of the dark underbelly of the city with expert world-building and unexpected humor.",
      "author": "Kristen Maldonado"
    },
    {
      "text": "On the whole, The Batman satisfies. It may continually remind you of other films, the aforementioned work by Mann, Fincher and Lumet, but at least this magpie director is pinching from the best.",
      "author": "Jamie Dunn"
    },
    {
      "text": "There's so much to love about Matt Reeves' The Batman: the characters, the cinematography, the stellar soundscape, the incredible world-building. The screenplay could have been a little tighter, though.",
      "author": "Natasha Alvar"
    },
    {
      "text": "The Batman may not knock The Dark Knight from its perch, but it is a fully imaginative reworking of the Detective Comics era, lifted by muscular performances.",
      "author": "Tom Shone"
    },
    {
      "text": "I was pleasantly surprised. It's not the Nolan movies, but for heaven's sake better than Affleck...I think Pattinson does a good job with it.",
      "author": "Mark Kermode"
    },
    {
      "text": "It left me curious as to what's to come next. It's got that power, speed and strength to it...",
      "author": "tt stern-enzi"
    },
    {
      "text": "A stylistic masterpiece. More pulpy than Saturday morning fun.",
      "author": "Shawn Edwards"
    },
    {
      "text": "A wonderful send up to pulp detective comics Batman has origins in. Dark and grown up, but not afraid to be weird and silly as well.",
      "author": "Doug Walker"
    },
    {
      "text": "Reeves, Pattison and the talented cast and crew have created a crime/action/drama extraordinaire. A close to perfect superhero film that nips at the heels of the untouchable The Dark Knight.",
      "author": "Dwight Brown"
    },
    {
      "text": "Theres a good two-hour film buried in this bladder-busting, three-hour mess.",
      "author": "Chris McCoy"
    },
    {
      "text": "While it might not be the greatest Batman story ever told, its good to see someone attempting to try something a little different with the character and the genre  and that alone means The Batman has an excellent defence for its existence.",
      "author": "Niall Browne"
    },
    {
      "text": "The trend of turning Batman and everything around him increasingly darker, which began with Keatons Batman, has reached its logical culmination in The Batman. Robert Pattinson is absolutely tremendous, vanishing completely into the role.",
      "author": "Kshitij Rawat"
    },
    {
      "text": "Stellar cinematography and production design stand out, fantastic visual effects and a strong score from composer Michael Giacchino likewise resonates.",
      "author": "Michael Ward"
    },
    {
      "text": "'The Batman' is a darkly satisfying portrayal of the masked crime-fighter and a refreshing interpretation better aligned with 'Brightburn' than anything produced by Zack Snyder.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "The Batman is all the fun youve been hoping for. Choosing to be gritty and real just as Marvel zooms off into the Multiverse was a smart choice, and provides a crowd-pleasing first chapter to a new franchise.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Robert Pattinson shuts all his haters up with a vulnerable and terrifying performance in Matt Reeves’s The Batman.",
      "author": "Noëlle D. Lilley"
    },
    {
      "text": "The Batman is both too dark and not noir enough.",
      "author": "Eileen Jones"
    },
    {
      "text": "Totally didn't need the shot of Robert Pattinson eating blueberries in slow motion, but I still liked it.",
      "author": "Bob Grimm"
    },
    {
      "text": "The film gets a good retro look that fits the story  as most of us know it  giving the proceed a dark and brooding look and feel.",
      "author": "Robin Clifford"
    },
    {
      "text": "This is a goth Batman. He's also a furry. \"Furries create their own animal character (a fursona) which functions as their avatar within furry communities.\" So, a goth furry, with Catwoman making up his furry community of two. It's fairly fun but too long.",
      "author": "Mark Jackson"
    },
    {
      "text": "Despite the weight of its long-running time and some unwanted subplots, The Batman offers plenty to celebrate as one of the best versions of the character.",
      "author": "Alif Majeed"
    },
    {
      "text": "A near operatic morality play that isn't afraid to question its hero or show his weaknesses.",
      "author": "Mattie Lucas"
    },
    {
      "text": "Pattinson is one of the premier weirdos of his generation, yet The Batman restrains him and his co-stars into generic crime drama roles.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "Without rising above the films that influenced it, this impeccably crafted noir thriller successfully presents a promising new take on the Batman universe.",
      "author": "Nestor Bentancor"
    },
    {
      "text": "The Batman may be overstuffed, but the strong cast and impeccable direction make the film an impressive love letter to the DC hero.",
      "author": "Brandon Zachary"
    },
    {
      "text": "Matt Reeves' oh-so-serious Batman presents a fresh, complex and inventively retooled entry in a long and crowded superhero franchise mostly dominated by supervillains far more interesting than its titular hero.",
      "author": "Dann Gire"
    },
    {
      "text": "The Batman ultimately feels like a competent adaptation of the source material refined and emboldened in the image David Finchers Zodiac. Reeves has a knack for memorable shots and incorporates interesting visual perspectives into his Batman",
      "author": "Taylor Baker"
    },
    {
      "text": "Reeves has made the first Batman movie that has the feel of the best Batman comics.",
      "author": "Tim Brennan"
    },
    {
      "text": "(Matt Reeves) transcends the clichés with a masterful, often tense and noir-as-night twist on the mythology that ranks with Christopher Nolan’s The Dark Knight as the best of all the Batman movies.",
      "author": "Cary Darling"
    },
    {
      "text": "The Batman is more Blade Runner than Batman Begins, but this is damn good, consistently surprising filmmaking, and it all works.",
      "author": "Samuel R. Murrian"
    },
    {
      "text": "It’s a hellish fusion of ideas and genres, built on the foundations of some of the best comic book stories but still wholly its own creation, brimming with emotion and angst and tragedy -- and yet, this is not a film to be endured. It’s to be enjoyed.",
      "author": "TK Burton"
    },
    {
      "text": "Despite its flaws, Matt Reeves has marshalled one of the smartest and most mature comic book adaptations in memory. The film is strongest in its first half but the double act between Wright and Pattinson sustains throughout.",
      "author": "Christopher Machell"
    },
    {
      "text": "Superhero reboots have become tellingly frequent, as if being jolted back to life by increasingly desperate electro-shocks. For all the consummate care expended on The Batman’s beautiful surface, its substance subsides through familiarity.",
      "author": "Nick Hasted"
    },
    {
      "text": "In addition to Pattinson, Wright, and Farrell (whose Penguin series cant arrive soon enough), nearly everyone else in the impressive cast likewise brings their A game.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "Matt Reeves gets caught between not being fun enough while also refusing to lean fully into the darkness offered by his premise, creating something that's undeniably watchable but also very serious and safe.",
      "author": "Ella Kemp"
    },
    {
      "text": "The underlying plot becomes off-puttingly complicated, the tone remains annoying one-note, and one crucial climactic scene goes on so long you think it’s never going to end.",
      "author": "Matthew Bond"
    },
    {
      "text": "Even without the overdone backstory, Pattinson's Batman is a fully realized, deeply-moving character who is immensely interesting to watch.",
      "author": "Candice McMillan"
    },
    {
      "text": "The Batman is inarguably the darkest cinematic vision of the Caped Crusader  and one that prods at the foundations of heroism.",
      "author": "Christopher Cross"
    },
    {
      "text": "The Batman is a terrific individual dissertation in the legacy of the Dark Knight. Brooding, brilliant, and breathtaking, The Batman hits that elusive sweet spot between a made-for-the-masses popcorn flick and a deeply complex political thriller.",
      "author": "Mark Johnson"
    },
    {
      "text": "A smart, thrilling, engaging, and entertaining ride through a Gotham City that I hope to see revisited many more times.",
      "author": "Josh Davis"
    },
    {
      "text": "As expected of a director of Reeves calibre, The Batman is an exceptionally well-made film on a technical level, but in its critical final act, it loses sight of its procedural tone and instead gets distracted by the need to check numerous other boxes.",
      "author": "Rohan Naahar"
    },
    {
      "text": "While it doesn't redefine the Caped Crusader, Reeves and Pattinson provide a solid outing into Gotham. The film could probably be about an hour shorter and have shaved a plot line or two, but it's bound to make some Bat-fans very happy.",
      "author": "Dana Han-Klein"
    },
    {
      "text": "...deserves credit for shining the spotlight on the underbelly of Gotham, but the storytelling in The Batman is like Bugs Bunny meaning to have taken that left turn at Albuquerque; a meandering foray down a dark rabbit hole that isnt entirely necessary.",
      "author": "Chris Sawin"
    },
    {
      "text": "Stylish and well-cast, but monotonous and with an overlong running time and not enough suspense or thrills.",
      "author": "Avi Offer"
    },
    {
      "text": "No snark, no spandex pantomime spectacle. Just noir mystery, Pattinsons sad recluse a detective in a cesspit of corruption. Relentlessly grim, all darkness and despair, not escapist but of our time.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "If the film falls short of greatness, because Reeves didnt know when to cut and run, it is, in its final extended form, a superior comic book adaptation and brooding thriller in its own right.",
      "author": "Ed Whitfield"
    },
    {
      "text": "The Batman is the triumph we hoped for, and the film DC have desperately been in need of for a long time.",
      "author": "Tony Black"
    },
    {
      "text": "A gritty and dark noir crime thriller that plays like David Fincher's \"Seven.\" Pattinson, Kravitz, and Wright are the dynamic trio in Matt Reeves's definitive Batman film.",
      "author": "Joe Friar"
    },
    {
      "text": "In The Batman, Pattinson is one of the best portrayals of Batman on screen.",
      "author": "Kate Sánchez"
    },
    {
      "text": "\"The Batman\" is a crime film, influenced by film noir and police procedurals. It feels unique, and it manages to differentiate itself from the comic book movies that are usually released in theatres every month. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Except for a new cauldron of actors, this lengthy and exceptionally grim load of PG-13 (huh?) cinema gives the franchise that keeps trying to reinvent the wheel little to distinguish itself from the previous rest.",
      "author": "John Urbancich"
    },
    {
      "text": "As a standalone police procedural, it works quite well, but as a franchise reboot it’s not enough of a reset.",
      "author": "Simran Hans"
    },
    {
      "text": "You could say every era gets the Batman it deserves. Reeves has made an absorbing entertainment where its rainy streets and perturbed faces speak to our intensely uncertain days.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Previous Batman movies have had noir elements. The Batman feels more like film noir with Batman elements.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Has very few identifiable \"flaws\"; it's more that at a certain point, it's hard not to feel ground into submission.",
      "author": "Tim Brayton"
    },
    {
      "text": "Greig Frasers A+ cinematography drenches the screen in heavy horror-noir vibes as fear rules Gotham in this fantastic new Batman chapter.",
      "author": "Matt Donato"
    },
    {
      "text": "In The Batman, Pattinson and Reeves create a superhero spectacle for audiences that goes above and beyond the norm. In lieu of a fatigued origin story, we get an evolution.",
      "author": "Erin Maxwell"
    },
    {
      "text": "In the end, this may be the best Batman movie.\n\nBut it also may be the least entertaining Batman movie.",
      "author": "David Poland"
    },
    {
      "text": "Robert Pattinson and Matt Reeves return the caped crusader to his roots as an obsessive detective with this complex, intriguing reboot.",
      "author": "Norman Wilner"
    },
    {
      "text": "When it comes to elevated powers, The Batman has a rare one: it is not a super hero movie.",
      "author": "Stephen Romei"
    },
    {
      "text": "Director/co-writer Matt Reeves doesn’t present anything especially revolutionary in his approach here, but he incorporates some notable stylistic influences and places an emphasis on detective work.",
      "author": "Dominic Corry"
    },
    {
      "text": "The Batman is a product of this time and place, in other words. A shame that this time and place are so stupid.",
      "author": "Walter Chaw"
    },
    {
      "text": "There's more to The Batman than its style, but I should say something about the film's prop and tech design, which is so good and fun.",
      "author": "Jas Keimig"
    },
    {
      "text": "The Batman lives and dies on its characterizations. They’re pretty good.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "Gotham City’s favorite vigilante has long been known as “the World’s Greatest Detective.” Matt Reeves is the first director to truly realize that on screen.",
      "author": "Miles Surrey"
    },
    {
      "text": "Lensed by two-time Oscar nominee Greig Fraser, Gotham has never looked so gritty, moody and beautiful... Michael Giacchino's haunting score is fantastic, orchestrating each scene with a balance of intensity and intimacy.",
      "author": "Joanne Soh"
    },
    {
      "text": "Listen, The Batman is a solid outing for DC. But, by focusing on the early, comic-book detective iteration of Batman, it sacrifices some of the potential fun of the character.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "I really, really enjoyed this movie and... I definitely wanted to see it",
      "author": "Andre Meadows"
    },
    {
      "text": "At its best, The Batman drips with shuddering dread. Too bad the movie concludes with a half-hearted attempt at a hopeful resolve, a letdown after so much dark commitment.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Matt Reeves delivers a near-perfect film that’s only occasionally limited by its excesses.",
      "author": "Aniruddho Chakraborty"
    },
    {
      "text": "An emotional, noir, David Fincher-esque take on the iconic character.",
      "author": "Anupama Chopra"
    },
    {
      "text": "This film is on the level of Nolan’s masterful trilogy and transcends the comic book genre in a rather impressive fashion.",
      "author": "Micheal Compton"
    },
    {
      "text": "For fans of the grittier DC movie entries, The Batman may be too sardonic. For those of us who missed freaky Batman, however, it’s an interesting turn, even if it’s not exactly a delight.",
      "author": "Abby Olcese"
    },
    {
      "text": "Coming exactly 100 years after F. W. Murnau’s still-disturbing Nosferatu, The Batman doesn’t earn being called artistic decadence. Its depiction of social horror isn’t fully imagined; it never gets to the core of spiritual repulsion that Murnau touched",
      "author": "Armond White"
    },
    {
      "text": "Owing to the first-rate cinematography, and for Pattinson's brooding and emotionally bruised superhero, The Batman isn't the drudge it otherwise might have been.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "What Reeves has done here should be taken as a remarkable accomplishment. In an era of studio properties, especially superhero movies, aiming for the safest possible outcome, The Batman is a legitimately out-there film.",
      "author": "Owen Gabbey"
    },
    {
      "text": "The film gets off to a slow and slightly tedious start, taking far too long to get going... However, once the investigation into these murders deepens, the pace picks up and the film gets really fun.",
      "author": "Amanda Keats"
    },
    {
      "text": "It’s not the grand synthesis Reeves may have hoped for, nor can all the villains put together live up to Heath Ledger’s Joker. But if you’re after a full meal of a movie, you shouldn’t leave feeling hungry.",
      "author": "Jake Wilson"
    },
    {
      "text": "Weve seen him campy, broody, neon-splashed, comic book-styled, grittily realistic and whatever it was Zack Snyder was attempting, but this is a whole other Batman, altogether.",
      "author": "Damond Fudge"
    },
    {
      "text": "The result is unexpectedly welcome, a comic book movie that feels buoyed by a mixture of humility and fidelity to its cartoon origins, and which stumbles only when it grasps at being more.",
      "author": "George Elkind"
    },
    {
      "text": "Somehow, through dark magic and incredible craftsmanship, The Batman has managed to bring some truly fresh and invigorating elements to the franchise that are sorely needed.",
      "author": "Drew Dietsch"
    },
    {
      "text": "Reeves delivers clearer action sequences than any previous Batman director. Even better is the way the Riddler is revealed as a mirror image of the superhero who busts Bruce on his privilege.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "The Batman has some stylish trappings and some interesting ideas. But under the mask, weve seen it all before.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Absolutely everything that writer/director Matt Reeves and cowriter Peter Craig put in the script works. But to be clear, thats works in the sense of how I kept my Mitsubishi Galant working until it caught fire in a parking lot.",
      "author": "Ryan Syrek"
    },
    {
      "text": "The Batman is exactly the gritty crime thriller it was selling in the trailer, but it is not the deep, dark detective story come to smash your notions of what a superhero movie can be.",
      "author": "Jonathan DeHaan"
    },
    {
      "text": "Created alongside Dune cinematographer Greig Fraser, this may be the best-looking Gotham City flick of all time.",
      "author": "Brady Langmann"
    },
    {
      "text": "However bleak and disturbing the movie might be, The Batman's grittiness is in service of an unexpectedly optimistic message, and Reeves brings some much-needed glimmers of hope to this otherwise gloomy picture.",
      "author": "Brendan Morrow"
    },
    {
      "text": "My quibbles with the runtime aside, I think audiences going in expecting a more grownup mystery drama than a tentpole action movie will love The Batman.",
      "author": "Brad Keefe"
    },
    {
      "text": "A bold vision of the character that reboots the franchise in an exciting new way.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Knowing what kind of Batman this is (and, crucially, isn’t) is key to getting the most from this long, dark story.",
      "author": "Chris Knight"
    },
    {
      "text": "It's not my favorite take on Batman or Bruce Wayne, but done well enough that I have more positives than negatives. A good to great film.",
      "author": "Brandon Avery"
    },
    {
      "text": "The Batman proves to be monotonous murk.",
      "author": "Dennis Harvey"
    },
    {
      "text": "Rarely do I use the word \"perfect\", but I wouldn't change a thing about \"The Batman\". It's an absolute \"must-see more than once\".",
      "author": "Susan Kamyab"
    },
    {
      "text": "Wants to be critical of Batman as a vigilante who uses excessive force and use the Riddler to comment on white male radicalization, which may actually feel newly relevant after the freedom convoy, but the points don't land as hard as Batman's fists.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "The standout performer among the cast is Kravitz, whose Catwoman is constantly keeping all the men in The Batman on their toes.",
      "author": "Joshua Axelrod"
    },
    {
      "text": "Beneath the rubber ears, he’s all granite-chinned and haunted eyes. Off duty, he’s a tragic, wan, raccoon-eyed Bruce Wayne. He hurts. He suffers. And that’s OK, because his Batman is the tense center of a whirl of well-cast characters.",
      "author": "Thelma Adams"
    },
    {
      "text": "Reeves delightfully returns this property to the realm of adult sensibilities as far as mood, tone and characterization are concerned.",
      "author": "Nicholas Bell"
    },
    {
      "text": "The Batman is a smart and uncompromising work that makes the familiar seems fresh and which does have more on its mind than simply extending a valuable [intellectual property].",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Although it does disappointingly go over the top on occasion, there’s just too much depth and style to The Batman for it to be anything other than a success.",
      "author": "Peter Rainer"
    },
    {
      "text": "... Just because it's grim doesn't mean it's a drag: this is exhilarating filmmaking on every level.",
      "author": "Kimber Myers"
    },
    {
      "text": "It occurred to me that The Batman feels, in atmosphere and pretensions, exactly like what was so sublimely spoofed by 2017's The Lego Batman Movie. It isn't every day that the target of a parody shows up five years after the parody itself.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "The shame of it is Reeves' hewing to all those established norms negates the elements of the film that do feel more revelatory, creating a kind of mish-mash of ideas rather than an engaging whole.",
      "author": "Piers Marchant"
    },
    {
      "text": "Pattinson deserves another two movies to grow into the character. He looks great in the suit, and he's got the broodiness of Batman down pat. He just needs more time to be the man under the mask and remind audiences he's human.",
      "author": "Courtney Lanning"
    },
    {
      "text": "In an era of superhero gluttony, in which these familiar stories, characters, and visuals tend to bleed together, The Batman holds the rare distinction of creating and embracing its own identity.",
      "author": "Jake Kring-Schreifels"
    },
    {
      "text": "Reeves strikes closer to the core of Batmans ethos than any other live-action depiction, a noir mystery ripe for Gothams murky confines.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "The Batman just gets darker and more oppressive. This is the pandemic caped crusader, and he has a personality disorder.",
      "author": "James Verniere"
    },
    {
      "text": "My reaction may be mixed but there's lots to love about Mat Reeves' The Batman. It owes more to the likes of Zodiac or Road To Perdition than to common heroes-in-tights fodder ... here's my video take!",
      "author": "Jason Gorber"
    },
    {
      "text": "... so bleak and cynical that it too often forgets to be fun, which would be forgivable if the central mystery was more compelling or if the films thematic complexity matched its technical ambitions.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "THE BATMAN is not a superhero movie. Reeves eerie tone and subject matter plays more like a horror movie. Matt Reeves has crafted a different cinematic interpretation in THE BATMAN that merits a place in the DCEU with Robert Pattinson as the vigilante.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "The capable cast all inhabit their roles with panache, but some of the film's potency is lost with certain unconvincing narrative twists and a few characters who feel stale.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "Only more time under the cowl will confirm it, but based on this performance alone, Robert Pattinson may be the best live-action version of The Dark Knight yet.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "The question is not whether or not The Batman is smart and well put together; undeniably, it is. The question is whether or not you want this particular film about this particular character.",
      "author": "Sean Collier"
    },
    {
      "text": "While its action is appropriately theatrical and its mystery appropriately intriguing, in the end this is a film that lives and thrives on its thematic resonance. It lives in the brain instead of passing through it.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "The Batman takes the best of what we have read, watched, and listened to for the better part of a century, and crafted one of the greatest depictions of the character on the big screen to date.",
      "author": "Kevin Brackett"
    },
    {
      "text": "If this film effectively repurposes our shared trauma into something more palpable and satisfying, then maybe Matt Reeves finds something that eludes most Batman films of the past. He makes him relevant.",
      "author": "Alan Zilberman"
    },
    {
      "text": "While The Batman might tread familiar ground... there’s enough that’s distinctive here to ensure it makes good on its promise.",
      "author": "Gayle Sequeira"
    },
    {
      "text": "Pattinson makes a great Batman, but he makes an even better Bruce Wayne.",
      "author": "Rob Thomas"
    },
    {
      "text": "Matt Reeves has a strong artistic vision that's worth seeing for fans of the Dark Knight. The movie is not a home run, though.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "This is a redemptive view of a superhero as sociopath, trying to balance moral courage against a society that believes youre a chump if you do so. Riddle me this  what society does that sound like? Theater tip ... an empty bladder  full experience.",
      "author": "Patrick McDonald"
    },
    {
      "text": "Batman Begins, again.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Pattinson's one-note performance isn't the fundamental problem. The problem is that it attempts to embody the current ethos of deconstructing systems we once believed represented the common good  and that includes the system that created Batman.",
      "author": "Megan Basham"
    },
    {
      "text": "A rock-solid building block that re-establishes the hero for its next decade or so of direction.",
      "author": "Phil Villarreal"
    },
    {
      "text": "'The Batman' runs too long and could use a Pow, Bam, Whamm, Thwapp, Biff, and Zok, but this is a worthy superhero-detective story.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Pattinson shares several (although too few) scenes with Kravitz, and their flirty chemistry enlivens every one of them.",
      "author": "Kurt Loder"
    },
    {
      "text": "W hat’s wacky, woke and cast like an indie movie? Answer: this Batman reboot.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "This is only the beginning of a run of new Batman tales. The best thing is, it makes us want to see what happens next in this dark and angry place.",
      "author": "Peter Howell"
    },
    {
      "text": "I didn’t want a retread of the past or another origin story. Instead, I got something different.",
      "author": "Alan Ng"
    },
    {
      "text": "Reeves’ bold and enthralling The Batman marks a radical shift in direction, even from Christopher Nolan’s (comparatively) more grounded trilogy.",
      "author": "Richard Whittaker"
    },
    {
      "text": "The Batman is a standalone film that packs in all the ingredients for a delectably dark mindbender featuring the caped crusader, who is more human than ever.",
      "author": "Ronak Kotecha"
    },
    {
      "text": "The film has some exceptional qualities. Its biggest issues are a bloated, unrefined script and a misguided final act.",
      "author": "Jeffrey Harris"
    },
    {
      "text": "While the film's runtime leads to some bloat, Reeves' noir-influence The Batman stands out as the darkest and most visually inventive film starring the caped crusader.",
      "author": "Alan French"
    },
    {
      "text": "At three hours, THE BATMAN flew by. Warner Bros. will have a huge hit at the box office.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "I went into our screening expecting a bloated, too-heavy-on-the-action, overly violent, 175-minute ho-hum affair. THE BATMAN is none of these.",
      "author": "David Kaplan"
    },
    {
      "text": "The Batman both feels like a terrific achievement given the comic book saturated climate we live in, and a disappointment for it struggles to retain its identity and flex more than a few muscles.",
      "author": "Akhil Arora"
    },
    {
      "text": "When the villain here says 'we're not so different', it actually carries weight. Pattinson's Batman is a despondent, disturbed, destructive presence.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "The Batman is as good as a Batman movie has ever been, or possibly ever can be.",
      "author": "Tom Santilli"
    },
    {
      "text": "[The Batman] is very long, relentlessly intense, murmured more often than spoken, and photographed, by Greig Fraser, with a glowering gorgeousness that must be seen to be felt. It’s also enthralling and tailored to our time.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The Dark Knight continues to get darker and darker.",
      "author": "Russ Simmons"
    },
    {
      "text": "Even with multiple sequels and spin-offs planned, there likely wont be another superhero movie that looks and feels like this for quite some time.",
      "author": "Nicolás Delgadillo"
    },
    {
      "text": "Visually, Reeves’ film is spectacular, full of graphic tableaux and painterly touches. It never rains but it pours in his Gotham, a city mired in grey, abandoned by the sun.",
      "author": "Paul Whitington"
    },
    {
      "text": "Matt Reeves innovative makeover reimagines The Batman as a modern-day noir murder mystery, abandoning the action genre.",
      "author": "Dustin Chase"
    },
    {
      "text": "Lacking in light and shade, and definitely overlong, The Batman is nonetheless a compelling and well-performed detective story that, yeah, happens to star a man in a batsuit.",
      "author": "Simon Miraudo"
    },
    {
      "text": "What carries the film are the sly intricacies of The Riddler’s misdeed... and the stunning set designs that range from the crowded, rain-slicked streets of Gotham to the gaping Batcave and an Edward Hopper-styled diner lit in green neon.",
      "author": "Tom Meek"
    },
    {
      "text": "A compelling hard-boiled mystery with a detective who just happens to wear a cape and cowl.",
      "author": "Josh Bell"
    },
    {
      "text": "That willingness to play with the pop art of it all, even as it’s very much doing a modern, grim-and-gritty blockbuster thing, is the truest joy of The Batman.",
      "author": "Eric Webb"
    },
    {
      "text": "Not that The Batman doesn't have its moments. It's just that it only has about 90 of them. I actually liked Robert Pattinson's smoldering broody routine (the first 20 times I saw it).",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "The 'most anticipated film of the year' proves to have been worth the wait. Peeling a big black onion for almost three hours -- that's what you're getting with The Batman.",
      "author": "Harry Guerin"
    },
    {
      "text": "The grittiest, gloomiest, and most pitch-black of the entire Caped Crusader canon, The Batman expands the compelling mythology with a neo-noir approach and very gothic Gotham look.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "There's an awful lot going on in \"The Batman,\" maybe three movies worth. But Reeves is a capable storyteller, and the actors are good enough to keep the momentum going.",
      "author": "Michael J. Casey"
    },
    {
      "text": "Even as it may neglect or deviate from aspects of canon in minor ways, it pulls off a few essential new tricks. Perhaps the most essential? It's actually a movie about Batman.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "There is shuddering set-piece after set-piece with nothing innovative of note. Usually you do, at least, get (lame) jokes between the action sequences but this is so humourless and deadly serious you don’t even get that.",
      "author": "Deborah Ross"
    },
    {
      "text": "Matt Reeves made good on his promise to deliver a fierce and suspenseful Batman detective noir. The film is deliberately somber but not an entirely joyless affair, filled with stunning shots and thrilling action.",
      "author": "Ruth Maramis"
    },
    {
      "text": "One of the strongest elements of the film is how much new ground and fresh ideas permeate The Batman with little or no retread of the character history",
      "author": "Kyle Wilson"
    },
    {
      "text": "The Batman is an amazing world of Gotham. I want to see more from this world of Gotham.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Dropsical with self-importance, and setting a bold new standard in joylessness...",
      "author": "Anthony Lane"
    },
    {
      "text": "Reeves nails Batman's raison d'etre. The personal grievance, married to intimate violence, is satisfying.",
      "author": "John Lui"
    },
    {
      "text": "When Christopher Nolan was directing the Dark Knight trilogy, he tore into the Batman mythos with fervor, whereas Reeves just seems to be lackadaisically marinating in misery.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "The Batman -- the man, the film -- is so hard-boiled it's nigh on turned to stone. Alas, the writing is nowhere near strong enough to support this weight.",
      "author": "Keva York"
    },
    {
      "text": "This caped crusader is young, tortured, and frightening in a way that the character has never been.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "This very special episode of 'CSI: Gotham' tries to mimic all the moves from David Fincher's 'Seven,' but has a lot more in common with junky '90s knockoffs like 'The Bone Collector' and 'Kiss The Girls.'",
      "author": "Sean Burns"
    },
    {
      "text": "Relentless, dark, diabolic, and dynamic is Director Michael Reeves iteration with Robert Pattinson as a subdued Caped Crusader uncovering sordid clues from each characters past, and it works.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "A grim, gloomy, lugubrious, violent tale of vigilantism in a dystopian city mired in corruption and cynicism...There are plenty of praiseworthy elements in 'The Batman,' but as a whole it comes across as extremely depressing and self-indulgently labored.",
      "author": "Frank Swietek"
    },
    {
      "text": "It’s the kind of superhero movie that, along with something like Spider-Verse, should be the standard-bearer for the genre going forward.",
      "author": "Nick Johnston"
    },
    {
      "text": "Matt Reeves finally gives us the first Batman movie ABOUT Batman, with no villain stealing his spotlight. A captivating film noir in which Gotham is filtered through the mood and aesthetic of Se7en.",
      "author": "Mario Alegre"
    },
    {
      "text": "We've become so used to superhero movies with a few good sequences sandwiched between lackluster stuff that I wonder if moviegoers are ready for a beautifully constructed one with a beginning, middle and end. That would be \"The Batman.\"",
      "author": "Chris Hewitt"
    },
    {
      "text": "With a sweeping soundtrack, actual detective work, and a surprising turn by a capable Pattinson leading a great cast, this Caped Crusader is learning to be better than he was yesterday in a city losing hope... a reconstruction of the superhero genre?",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Robert Pattison, following up performances in The Lighthouse (2019), Tenet (2020), and The Devil All the Time (2021), continues to expertly plumb the depths of men with nothing left but anger, vengeance, and violence",
      "author": "MontiLee Stormer"
    },
    {
      "text": "The problem is that the movie, which hampers its value with a bloated running time of 176-minutes, never feels fresh, original, or essential.",
      "author": "Michael Calleri"
    },
    {
      "text": "176 minutes is a long time to go without laughs. And once you've settled into Matt Reeves universe of Gotham, you kind of brace yourself for whatever might be around the corner, its definitely not a joke.",
      "author": "Tatsam Mukherjee"
    },
    {
      "text": "Batman is officially a buzz kill ...",
      "author": "Dana Barbuto"
    },
    {
      "text": "If previous Batman movies were a tad too upbeat, festive, short, and well-lit for you...",
      "author": "Brent McKnight"
    },
    {
      "text": "Is this Batman THE Batman? Hard to know this early, but Im sure Reeves and Pattinson will be back for more. Theyve accomplished something special here, a Bat with a real brain.",
      "author": "Jeff York"
    },
    {
      "text": "The Batman is a boiled down detective noir that scales back the theatrics of previous versions to concentrate on Bruce Waynes personal issues and gritty action scenes.",
      "author": "Richard Crouse"
    },
    {
      "text": "Reeves cleverly subverts the obvious inklings of an origin story in exchange for a brooding and bleak bat-noir that reinvigorates the cape crusader.",
      "author": "Shikhar Verma"
    },
    {
      "text": "The Batman movie youve been waiting for.. Pattinson is great",
      "author": "Caffeinated Clint"
    },
    {
      "text": "There is something triumphant about Reeves The Batman, and I do like where the film leaves the character before the screen fades to black. But so many aspects dont come together, each refusing to resonate no matter how much I wished otherwise.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "The Batman is the first live action Noir Detective Batman narrative. An excellently paced ride with captivating shots, great action, an intense/terrify tone, where Collin immerses, Paul owns, Robert Slays, & Zoe delivers! An amazing superhero thriller!",
      "author": "Samuel Leggett Jr."
    },
    {
      "text": "The latest iteration, The Batman, cranks the dial hard towards the darker end of the bat-spectrum and gives us a pretty cool (if unnecessarily overlong) take on the citizens of Gotham City.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Robert Pattinsons Batman sinks his teeth into terminal misery in a dystopian wodge of a movie from Cloverfield director Matt Reeves.",
      "author": "Andiee Paviour"
    },
    {
      "text": "Though Matt Reeves The Batman is very entertaining ... its yet another in a long line of films about fractured heroes thats targeted at appealing to an older crowd at the expense of greater audience inclusivity.",
      "author": "Rob Dean"
    },
    {
      "text": "A solid story, great performances, and intriguing ideas about where to go from here. If you're demanding The Dark Knight from every Batman movie, you're going to be disappointed a lot.",
      "author": "Dan Murrell"
    },
    {
      "text": "Matt Reeves has managed to create perhaps the perfect Batman movie. Never before has it felt like the Gotham Knight has jumped right from the page to real life as he has here.",
      "author": "John Campea"
    },
    {
      "text": "If nothing else, The Batman helps shift Batman back to being a hero for the people.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "Matt Reeves had a vision. He wanted to push the limits and do something we haven't seen done with Batman. He succeeded.",
      "author": "Korey Coleman"
    },
    {
      "text": "The Batman works on many levels, from the actors to the action to its detective storyline. Well just have to wait and see if this version of Batman sticks around for a while.",
      "author": "Alex Bentley"
    },
    {
      "text": "The filmmakers take a simple but somewhat ambitious approach to their storytelling here. They strip the character of anything unessential, redundant, or gimmicky.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The Batman has more in common with Chinatown than The Avengers. Its a pulpy and violent serial killer story in the vein of Fincher thrillers like Seven and Zodiac.",
      "author": "Victor Stiff"
    },
    {
      "text": "After gobs of Marvel Cinematic Universe cotton candy, it's refreshing to get a superhero movie with this much attitude, vision and thematic command.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Again, so much of this is about shock value rather than anything actually scary, since The Batman is handcuffed by its family-friendly PG rating, the result being something like a Saw movie made for Disney+.",
      "author": "Eli Glasner"
    },
    {
      "text": "This interpretation is po-faced to the extreme, but Reeves’s commitment to the material and Pattinson’s preternatural grumpiness in the role make The Batman sing -- though the ballad is undeniably emo.",
      "author": "David Sims"
    },
    {
      "text": "Its a rather highly-polished and extremely well-directed mainstream affair, but the ideas that Reeves infuses his film with, the substance, so to speak, is familiar and feels almost artificial.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Giacchinos score is the standout aesthetic element of The Batman...",
      "author": "Josh Larsen"
    },
    {
      "text": "Lacks a particular freshness key to making a zeitgeist-capturing phenomenon like the films from Tim Burton or Christopher Nolan, but the effort to bring in a certain kind of soulfulness amid a creepy mystery leads to some often stunning results.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "The Batman is a journey through the seedy underbelly of Gotham filled with epic action, unmatched cast chemistry, and maniacal villains. Everything that DC fans have wanted, and more.",
      "author": "Tessa Smith"
    },
    {
      "text": "Pattinson is a perfect fit for the cowl and cape in this gritty, pacy and achingly stylish adventure",
      "author": "Andy Lea"
    },
    {
      "text": "Reeves is one of the more thoughtful blockbuster filmmakers out there, but here he never quite manages to transcend his influences.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Reeves brings a real sense of motivation to his re-telling of the character and his why is clear. Even in its stumbles, The Batman doesn’t feel like a money grab.",
      "author": "Emily Zemler"
    },
    {
      "text": "Yet another lugubrious, laboriously grim slog masquerading as a fun comic book movie.",
      "author": "Ann Hornaday"
    },
    {
      "text": "An ambitious and very dark thriller that takes its hero back to his noirish roots.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The first Batman movie to feel not just dark but diseased, like something unclean teetering on the edge of an apocalypse. This is what makes it interesting and, in a number of places, very good.",
      "author": "Ty Burr"
    },
    {
      "text": "'The Batman' soars with action and atmosphere.",
      "author": "Linda Cook"
    },
    {
      "text": "The most artistic Batman movie ever made...Pattinson leaves his mark on the Bat-legacy as a \"broken\" Bruce Wayne...but this is another case of a director's ambition getting in the way of his own work...demanding so much patience without actual payoff.",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "The Batman is, quite simply, a ponderous bore.",
      "author": "Emily Wheeler"
    },
    {
      "text": "Semi-novel spin on the done-to-death Dark Knight routine (\"What if Bruce Wayne was kind of BAD at being Batman at first?\") and welcome attempts to address uglier aspects of the vigilante fantasy get overwhelmed by an overplotted script franchise demands.",
      "author": "Bob Chipman"
    },
    {
      "text": "It takes nearly three hours for The Batman to tell its story and that story, while familiar, is the Batman story I've been waiting for my whole life.",
      "author": "Richard Propes"
    },
    {
      "text": "This is a moody, atmospheric and at times genuinely creepy flick, with some top shelf performances and a couple of surprising and quite subversive moments in the final act.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Creating enough points of difference to distinguish itself from the successful Christopher Nolan-helmed Batman trilogy, The Batman is dark, interesting and a little frustrating.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Echoes with the doubled resonance of the best myths, at once a thrilling adventure and a cautionary tale.",
      "author": "Sarah Marrs"
    },
    {
      "text": "This Batman, played by Robert Pattinson, is our goth Bruce Wayne, more disaffected youth than playboy billionaire, and that allows Reeves, as a director, to play with all kinds of grimy imagery, and as a writer, to grapple with the real function of Batman",
      "author": "Katie Walsh"
    },
    {
      "text": "At a time when many comic book franchises are seeking to go bigger, with cosmic beings and multiverses, The Batman’s down-to-earth approach offers a welcome reprieve.",
      "author": "James Berardinelli"
    },
    {
      "text": "For those of you who wondered if another reboot could find itself an audience after Christopher Nolan did such a fine job with his trilogy, please wonder no more.",
      "author": "Elias Savada"
    },
    {
      "text": "The Batman is a needless collage of not only better movies, but more egregiously of better Batman movies as director/co-writer Matt Reeves and co-writer Peter Craig create an utterly inferior and infuriating vision of the Dark Knight.",
      "author": "Blake Howard"
    },
    {
      "text": "Matt Reeves excellent new film introduces us to the fourth live-action cinematic incarnation of the Dark Knight.",
      "author": "Mark Meszoros"
    },
    {
      "text": "I can’t say I had a good time, but I did end up somewhere I didn’t expect to be: looking forward to the next chapter.",
      "author": "A.O. Scott"
    },
    {
      "text": "Even the doubters wondering if there’s anything more to say about Batman will find this reboot in a league of its own, even if Christopher Nolan’s trilogy remains hard to beat.",
      "author": "Randy Myers"
    },
    {
      "text": "Robert Pattinson puts an emo spin on the Worlds Greatest Detective in gritty, engrossing thriller \"The Batman.\"",
      "author": "André Hereford"
    },
    {
      "text": "This is a Batman movie that really embraces something the comics have done, which is Batman is the true identity and Bruce Wayne is a facade.",
      "author": "Eric Goldman"
    },
    {
      "text": "Nolan’s legacy still can’t be shaken off. But the tweaks are something.",
      "author": "Danny Leigh"
    },
    {
      "text": "Director Matt Reeves and brooding star Robert Pattinson see the Caped Crusader as more film-noir detective than comic-book hero in their mesmerizing mindbender that aims high even when it misses the mark. Its a grenade of pure cinema ready to blow.",
      "author": "Peter Travers"
    },
    {
      "text": "'The Batman' fires on all cylinders and commits to its darkest impulses without losing sight of the light at the core of its protagonist.",
      "author": "Leigh Monson"
    },
    {
      "text": "We've seen the man become the bat plenty of times. In Matt Reeves The Batman, we see the bat become a man again.",
      "author": "Matt Oakes"
    },
    {
      "text": "The Batman is its own, mostly very effective, strain of gorgeous and thoughtful blockbuster filmmaking.",
      "author": "Matt Lynch"
    },
    {
      "text": "Visually speaking, this is where The Batman excels the most. Matt Reeves has certainly gone all out to make his film looks meticulous with the help of Greig Frasers stunning nighttime cinematography.",
      "author": "Casey Chong"
    },
    {
      "text": "I don’t know if we needed “The Batman,” but Reeves and company certainly elevated it.",
      "author": "Michael Phillips"
    },
    {
      "text": "Once your ears get attuned, and your eyes too, for that matter, since daylight hardly ever encroaches, there is plenty to relish in The Batman.",
      "author": "Brian Viner"
    },
    {
      "text": "While it could be cut by at least 45 minutes, there’s plenty of ‘Kapow!’ to keep audiences entertained in this scary and sadistic trip to Gotham city.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "Underlit and overblown is a formidable combination, though not necessarily in the way Reeves intends.",
      "author": "Mark Feeney"
    },
    {
      "text": "The Batman is a thrilling, cerebral drama that gives us one of the most realistic portrayals of the caped crusader to date.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Puts sthe Batman characters into a forgettable, B-minus serial killer thriller, one with a needlessly convoluted plot, too many characters, unconvincing twists, and a terrible villain.",
      "author": "Stephen Silver"
    },
    {
      "text": "The Batman is an OK film that thinks its excellent. It's also so inspired by Fincher's two exceptional pictures about serial killers that I'm surprised it didn't call itself The Ba7man. (Full review in Portuguese.)",
      "author": "Pablo Villaça"
    },
    {
      "text": "It's good but not great, with the emphasis on drama and a pretty complicated plot that is involving, decidedly heavy and, to be frank, not all that exciting. Director Matt Reeves takes his time with the pacing that is big on character, short on action.",
      "author": "Jim Schembri"
    },
    {
      "text": "Reeves' contribution to the latest caped crusader tale is hypnotic with dazzlingly dark visuals and a Se7en/The Crow inspired detective story. It's not as focused as the Nolan trilogy, but boasts a strong start for future Batman detective stories.",
      "author": "Lee McCoy"
    },
    {
      "text": "It all adds up to an epic vision of an age-old tale",
      "author": "Stephen A. Russell"
    },
    {
      "text": "Here, Batmans default state is pure misery, and while that may be something many viewers can empathise with, this is a Batman few would want to be.",
      "author": "Travis Johnson"
    },
    {
      "text": "A magnificently dark vision that resets expectations about the character and his place in the world.",
      "author": "Peter Martin"
    },
    {
      "text": "This is an excellent first chapter in what I hope will be several more to come.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Despite its flaws... Reeves and Pattinson do offer something new and quite exciting with their interpretation of the DC superhero. Die-hard fans will have plenty to chew over, while more casual viewers can admire the exceptional cast and the characters.",
      "author": "Tori Brazier"
    },
    {
      "text": "Even with missteps, The Batman is an impressive movie. It’s not the rousing, over-the-top exciting superhero version of the character we remember from Tim Burton or Christopher Nolan, but it shouldn’t be. This is Matt Reeves' Batman.",
      "author": "Germain Lussier"
    },
    {
      "text": "What it does do, quite effectively, is tell a solid Batman story, with the most soulful and vulnerable Batman to ever grace the big screen. And that much, at least, is new.",
      "author": "Glen Weldon"
    },
    {
      "text": "Not your typical superhero film, The Batman is dark in all aspects. Kudos to Reeves for a different stylization and noir, but the story lacks in originality. Still not kid friendly.",
      "author": "Tania Lamb"
    },
    {
      "text": "Make no mistake, this iteration is here to stay and is only getting started with reminding moviegoers just how phenomenal unadulterated comic book stories can be on the big screen.",
      "author": "Andrew J. Salazar"
    },
    {
      "text": "It didn't have to be nearly three hours, and the disaster-film last act comes right out of the blue. But there's a film noir soul in this one somewhere.",
      "author": "Jim Slotek"
    },
    {
      "text": "In Matt Reeves confident hands, everything is breathtakingly alive and new.",
      "author": "Christy Lemire"
    },
    {
      "text": "The Batman doesn't quite rise above its ubiquitous genre in the way that it maybe hopes to, but when it stays street level it's a tantalizingly creepy mystery, anchored by Robert Pattinson's eerie take on the Caped Crusader.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "Reeves is aiming for a film noir-like Batman story, but the Dark Knight, supposedly the worlds greatest detective, does very little detecting of his own  mostly relying on others to unearth clues and pass them on to him.",
      "author": "Bob Bloom"
    },
    {
      "text": "I left it still humming that Nirvana song and wondering what this messed-up new Bruce Wayne, cape streaming moodily behind him as he rode away on his bat-motorcycle, would get up to next.",
      "author": "Dana Stevens"
    },
    {
      "text": "The Batman emerges from a movie universe, now becoming ubiquitous, where a phony funereal worldview is the only thing that can confer depth.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "There's a powerful tone and atmosphere created here, one drenched in a pulpy and occasionally terrifying exploration of this iconic character and those that cross him. The Batman is a bold and brilliant examination of a young Dark Knight.",
      "author": "JimmyO"
    },
    {
      "text": "I wish they had taken the time to develop Bruce as a real person with feelings and emotions. Even in a dark and brooding film noir, there still should be moments where the characters breathe and connect.",
      "author": "Rachel Wagner"
    },
    {
      "text": "The Batman is Matt Reeves most ambitious film yet. The jump from a tense detective story to thrilling action to melancholic romance to disaster film is a massive feat, but yes, Reeves has managed to pick up Nolans mantle where others have failed before.",
      "author": "Therese Lacson"
    },
    {
      "text": "Its challenging to sit with this level of moody darkness for so long, but what an unforgettable take on one of the DCEUs most popular characters.",
      "author": "Louisa Moore"
    },
    {
      "text": "\"The Batman\" certainly mirrors the dismal state of the world today. Any breaks from that dreariness will have to come at a different bat time on a different bat channel.",
      "author": "Adam Graham"
    },
    {
      "text": "The fact the titular character can't solve a series of simple clues is one of the many problems with this flawed but intriguing take on the pop culture icon.",
      "author": "Charles Koplinski"
    },
    {
      "text": "The reality is that there is probably nothing truly novel to be done with Batman at this point... Try as Reeves and his co-screenwriter Peter Craig might, they can’t squeeze much higher-meaning blood out of a fatally depleted stone.",
      "author": "Richard Lawson"
    },
    {
      "text": "Pattinson and Kravitz make for a compelling Bat and Cat while Dano's Riddler terrifies. The Batman is an ambitious, scorching thriller that brings the hero's detective side into the light. Its third act reaches staggering, stunning highs",
      "author": "Robert Kojder"
    },
    {
      "text": "Scaling down beautifully from the silly operatics of the DCEU, Matt Reeves has crafted a movie which stands cape-to-cape with The Dark Knight, perhaps even surpassing it as a forensic study of Gotham’s most famous protector.",
      "author": "Christopher Preston"
    },
    {
      "text": "While very much beholden to Nolan's grounded trilogy, Matt Reeves pulls from several comic and cinematic influences to give THE BATMAN a flavor all its own.",
      "author": "Zaki Hasan"
    },
    {
      "text": "The Batman is such a grandiose cinematic achievement, crafted with a filmmakers skill and Reeves daring to do it his own way.",
      "author": "Travis Hopson"
    },
    {
      "text": "The riddles of The Riddler, with their dime-store greeting-card histrionics, are about as frightening as a frown drawn on a detached baby-doll-head. Truly cornball stuff",
      "author": "Jason Adams"
    },
    {
      "text": "Richly layered in dark intrigue, The Batman takes viewers deeper into Batman/Bruce Wayne's mind than previous Batman films have ever ventured. This top-notch superhero film makes pointed social commentaries along with plenty of stunning action sequences.",
      "author": "Carla Hay"
    },
    {
      "text": "More of a detective mystery than previous Bat-flicks, borrowing in particular from David Fincher's serial killer chillers Seven and Zodiac... Most of all, though, The Batman is a horror movie.",
      "author": "Richard Trenholm"
    },
    {
      "text": "Matt Reeves understands he can't rewrite the status quo on the worlds most bankable hero, but he can try to tweak the formula and audiences expectations. For better or worse, that's something his \"The Batman\" does incredibly well.",
      "author": "Nate Adams"
    },
    {
      "text": "Impossibly entertaining and ultimately very compelling.",
      "author": "Dan Scully"
    },
    {
      "text": "The Batman is a competently-constructed film with its most significant flaw being it's too darned serious. That grim one-note approach for two hours would be tough. At three hours it gets to be a bit much.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Reeves’ The Batman is an impressive exploration of the character’s Year Two, a visually stunning, violent and believably gritty detective film to please the purists and introduce casual fans to a different version of the Bat.",
      "author": "Laura Potier"
    },
    {
      "text": "“The Batman” is impressively made. The acting is first rate, and the chemistry between Pattinson and Kravitz is magnetic. It’s meant to be an important statement. It’s just not a lot of, you know, fun.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "I’m as surprised as anyone to say that, after watching Pattinson in action, I’m calling on the industry to bring on all its many Batmen, Batwomen, Batbats. Keep ‘em coming hot and ready until we choke on a cowl.",
      "author": "Barry Hertz"
    },
    {
      "text": "Within the confines of its PG-13 rating, The Batman is much more unnerving than previous Batman installments ... The trouble is grafting a somber pastiche onto a superhero base coat can sometimes feel more exhausting than rewarding.",
      "author": "Caroline Siede"
    },
    {
      "text": "Matt Reeves throws us back into Gotham with a New and Refreshing take on the Caped Crusader which taps into the Detective aspect of the character that has been long looked over! Robert Pattinson and Paul Dano shine.",
      "author": "Alex Page"
    },
    {
      "text": "Imagine if David Fincher made a Batman movie but it was censored to air on televisions at Walmart.",
      "author": "Kristy Puchko"
    },
    {
      "text": "The mix of great and subpar makes it a challenge for me, but there is more good than bad...barely. Plus points for reminding me of The Crow.",
      "author": "DarkSkyLady"
    },
    {
      "text": "With his labyrinthine plotting and tragically human ensemble of characters, Reeves has crafted a richly realized Gotham City where there may be heroes and villains, but no one is innocent.",
      "author": "David Crow"
    },
    {
      "text": "The Batman is a gritty stylized police procedural that suffers from some pacing issues, but offers a fresh standalone take on the Batman mythos.",
      "author": "Michelle Kisner"
    },
    {
      "text": "This is high art at the intersection of blockbuster entertainment. If ever a superhero movie were to be considered for big awards, 'The Batman' is it. See it soar.",
      "author": "Preston Barta"
    },
    {
      "text": "The Batman ushers the Gotham crime fighter out of the shadows, to bring justice into a broken world, in this epic new installment. This is undoubtedly the best Batman yet.",
      "author": "Leo Brady"
    },
    {
      "text": "The Batman is a must-see edge-of-your-seat addition to the catalog of Batman films.",
      "author": "Ashley Menzel"
    },
    {
      "text": "I'll take 2 hours plus of the best Batman movie ever made with a little extra fat. I'll take that deal anytime.",
      "author": "Kyle Pinion"
    },
    {
      "text": "Batman nearly dissolves into the night, overwhelmed by and acquiescent to his films own noirish ambitions.",
      "author": "Jacob Oller"
    },
    {
      "text": "Matt Reeves' The Batman is an invigorating balm for superhero fatigue.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "The performances are as complex as the colour palette (ie not very).",
      "author": "Kevin Maher"
    },
    {
      "text": "What works about The Batman is Reeves and cowriter Peter Craig’s ability to weave suspense in with characters we know from the world of Gotham and make them all feel like a cohesive unit.",
      "author": "Rachel Leishman"
    },
    {
      "text": "The darkness of The Batman is somehow both richly textured and flimsy–a painting done up on newsprint.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "The film succeeds as both a narrative and visual product.",
      "author": "Sam Allard"
    },
    {
      "text": "The Batman is a very good Batman film. To think of it as anything more only leads to delusion or disappointment.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "That rare beast: a neatly self-contained contemporary blockbuster. Still too long though.",
      "author": "Adam Woodward"
    },
    {
      "text": "From start to finish, “The Batman” is mostly just a collection of bad ideas.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Depressing, dark and endless. I don’t know about you, but this particular time in history does not seem like the moment for a movie that will leave you a) miserable and b) wondering why nobody in Gotham City seems to have heard of light bulbs.",
      "author": "Moira MacDonald"
    },
    {
      "text": "The Batman feels like a turning point for the Caped Crusader.",
      "author": "Callum Crumlish"
    },
    {
      "text": "There’s an unshakable feeling here of “What’s the point?” Not to mention the nearly three-hour length. Holy runtime!",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Though not a totally radical refit of the Nolan/Snyder era, it establishes a Gotham City we would keenly want a return visit to.",
      "author": "John Nugent"
    },
    {
      "text": "The first 2/3rds of the movie are so phenomenal, it doesn't matter that the final act is weak. Matt Reeves delivers the best Batman movie to date, and Robert Pattinson the best Batman. Mind-blowingly good.",
      "author": "Grace Randolph"
    },
    {
      "text": "To create a Batman film able to compete with  or maybe even eclipse  Christopher Nolans Dark Knight trilogy takes some doing. Matt Reeves has done that with The Batman.",
      "author": "James Mottram"
    },
    {
      "text": "Reeves loves these dead-end apocalyptic environments, and delights in tales that toy with the moral calculus of typical hero narratives. He has given us a Batman that he himself can believe in, not to mention a Batman that feels right for our times.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "It falls on Pattinson's leather-cased Batman to be the hero we need, or deserve.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "It’s a movie of alternately promising and frustrating half-measures, in which Reeves’ shrewd storytelling instincts and the usual franchise-filmmaking imperatives repeatedly fight to a draw.",
      "author": "Justin Chang"
    },
    {
      "text": "Matt Reeves has delivered The Batman we have earned. Bleak, yet hopeful, true to its origins while being very much of our times. And wait till you see that car chase!",
      "author": "Joanna Langfield"
    },
    {
      "text": "A gripping, grimy and sensational street-level detective story, the Dark Knight’s triumphant return is exactly the fresh start needed after a decade of diminishing returns.",
      "author": "Jordan Farley"
    },
    {
      "text": "If dark, rain-soaked superhero flick sounds done to death, this latest Batman may not be for you.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "As a reboot, The Batman is a very good re-introduction of the Batman movie franchise, but one that feels like a victim of circumstance.",
      "author": "Kofi Outlaw"
    },
    {
      "text": "Director Matt Reeves delivers a gritty action thriller reminiscent of \"Se7en\" and \"Zodiac\" that finally makes \"the world's greatest detective\" deserving of the title.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "As grim as the Burton, Nolan and Snyder films were, Reeves and his team have fashioned their own distinctive and stylish variety of grimness, and they commit to it for three whole hours. Frankly, it's amazing that they got away with it.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Loved every single aspect of this film; the cinematography, that score!!, performances and the story. Easily one of the BEST Batman iterations.",
      "author": "Rosa Parra"
    },
    {
      "text": "A combination of Pattinsons faultless delivery and an engaging storyline from Reeves and Craig give this new interpretation the edge over Zack Snyders overly stylised representation of the DC hero. I just wish it had been slightly shorter.",
      "author": "Linda Marric"
    },
    {
      "text": "Inevitably, night falls on the latest Batman iteration with the cloudy sense that – of course – nothing has really been at stake. A classy turn from Pattinson, however, as the crime fighter with an injured soul.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Robert Pattinson is a perfect fit for the cowl, but this bloated effort lacks focus.",
      "author": "Christian Toto"
    },
    {
      "text": "Director Matt Reeves’ ambitious and excellently crafted The Batman more than justifies its existence as a world-building wonder that slathers a realistic grime across its Gotham City.",
      "author": "Brian Truitt"
    },
    {
      "text": "A superhero-infused take on the noir genre, with Robert Pattinson diving deep into the Dark Knights state of mind.",
      "author": "Collier Jennings"
    },
    {
      "text": "A masterful and heady introspection on vigilantism, told with foreboding grit and intensity atypical of the genre.",
      "author": "Meagan Navarro"
    },
    {
      "text": "The film sounds even better, thanks to a remarkable Michael Giacchino score that alternates minimalist strums and imperial marches; it’s somehow in the same league as the operatic themes Danny Elfman once lent the franchise.",
      "author": "A.A. Dowd"
    },
    {
      "text": "This epic (nearly three-hour) new chapter in the evolution of the superhero is a new milestone for Pattinson, ranking among the best Batman movies and truly marking his re-entry into the big-ticket, movie mainstream.",
      "author": "Neil Pond"
    },
    {
      "text": "Gotham's never been grimmer than in R-Batz's moody but mesmerising detective thriller",
      "author": "Alex Flood"
    },
    {
      "text": "At its best, The Batman is a helluva tough-guy yarn -- an entertaining pulp-fiction epic under the guise of sure-thing blockbuster. At its worst, it’s the cinematic equivalent of a mixtape.",
      "author": "David Fear"
    },
    {
      "text": "The Batman is an epic masterpiece.",
      "author": "Danielle Solzman"
    },
    {
      "text": "A Caped Crusader adventure with a purpose thankfully more meaningful than taking funny-book characters seriously for a fast buck.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "A towering achievement... Its exactly what the Batman franchise needed to be... This is the Batman movie weve been waiting for.",
      "author": "Mark Hughes"
    },
    {
      "text": "Dark, grungy & hugely atmospheric, Matt Reeves The Batman is potentially the most true to the DCs greatest detective yet. This is a gripping noir-esque detective tale.",
      "author": "Nicola Austin"
    },
    {
      "text": "The Batman is a dark, chilling, and compelling interpretation of Batman and Gotham's corrupt underbelly.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "“The Batman” is darkly dour stuff — potent but erratic.",
      "author": "Jake Coyle"
    },
    {
      "text": "The Batman is frustratingly safe, a movie full of potential for more and settling for less. It preaches to the choir, reinforcing the same ideas trodden over and over again across five movies.",
      "author": "Joshua Rivera"
    },
    {
      "text": "A Gothic opera version of the Batman legend, full of dark portents with Robert Pattinson as less ego-driven version of the character. A bit long and drags around the two-hour mark, but the first half and finale more than make up for it.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "A sprawling and sinuous urban detective thriller, with the intricately unhinged red-wool-on-corkboard plotting of classic film noir.",
      "author": "Robbie Collin"
    },
    {
      "text": "Arguably the moodiest and most intense the character has ever been portrayed in live-action, 'The Batman' is a strong debut for Robert Pattinson in the cowl and more than lives up to the legacy of the character.",
      "author": "Brian Lloyd"
    },
    {
      "text": "The reward for such an extreme run time is full immersion in the mental health war that is the Batman experience, with Reeves nailing the brutality and awakening of this complicated dark knight.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A sprawling, complex neo-noir thriller that shares more in common with the filmography of David Fincher than with most other superhero movies. Matt Reeves delivers an experience thats unpredictable, unexpected  and perhaps even definitive.",
      "author": "Brent Hankins"
    },
    {
      "text": "The Batman is a reinvention of the iconic vigilante with a powerhouse cast at the forefront, providing a masterclass of visual storytelling at the hands of Matt Reeves. I could've watched five hours of this.",
      "author": "Josie Meléndez"
    },
    {
      "text": "The Batman is soggy, gloomy, dank, rank, filthy, and forbidding. And so I really liked it. It’s not quite as searing or unsettling as Joker, but it pushes further in that direction than any big-budget comic-book movie yet.",
      "author": "Kyle Smith"
    },
    {
      "text": "Matt Reeves delivers a spectacularly striking, remarkable vision, ringing as an echo of previous Batman-centered features, reverberating long after the end credits finish their scroll.",
      "author": "Courtney Howard"
    },
    {
      "text": "It’s a soulful nocturne of corruption and chaos, and as much as I longed for a few more glimmers of humor, at no point during the hefty three-hour run time did my attention wander.",
      "author": "David Rooney"
    },
    {
      "text": "Reeves has taken on the challenge of producing a fresh take for this comic book icon as well and comes up with the novel twist of turning it into a detective story.",
      "author": "Pete Hammond"
    },
    {
      "text": "Zo Kravitz entered the scene, and two minutes into her first sequence I was already thinking: Couldnt this have been The Catwoman instead of The Batman?",
      "author": "Patricia Puentes"
    },
    {
      "text": "With exhilarating action scenes, a layered story & poignant, in-depth characterization, The Batman is a worthy addition to the live-action DC slate.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "The Batman is a gripping, gorgeous, and, at times, genuinely scary psychological crime thriller that gives Bruce Wayne the grounded detective story he deserves.",
      "author": "Alex Stedman"
    },
    {
      "text": "The Batman features terrible pacing, a much too long runtime, a story that seems to think it's being original while it isn't, and a combination of a score and cinematography that leads to an uncomfortable viewing experience.",
      "author": "Kaitlyn Booth"
    },
    {
      "text": "This isnt quite like any previous version of Batman, and thats a good thing; Reeves and Pattinson have fashioned a grim, desperate super-hero thats largely in line with todays hardscrabble times.",
      "author": "Eddie Harrison"
    },
    {
      "text": "Matt Reeves has outdone Christopher Nolan in presenting a realistic take on the source material without appearing ashamed of its comic book origins. It is the most like a \"real movie\" any comic book adaptation has felt in ages.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The Matt Reeves directed The Batman is almost oppressive. The Batman creates an unsettling world that keeps the audience on edge as Batman navigates an overwhelming Gotham City one clue at a time.",
      "author": "Fred Topel"
    },
    {
      "text": "That it doesn’t come off as a parody of a parody is a testament to both the holistic nature of Reeves’ vision and the eagerness with which Pattinson buys into it.",
      "author": "David Ehrlich"
    },
    {
      "text": "While so many comic book movies feel like variations on the same ideas, and the same formal execution of them, Reeves has made something distinct and fully realized.",
      "author": "Brian Eggert"
    },
    {
      "text": "A movie that wants to be shrouded in mystery, but its principle one is how a film can create such a compelling Batman while seeming so disinterested in the character.",
      "author": "Larry Carroll"
    },
    {
      "text": "Registers among the best of the genre, even if — or more aptly, because — what makes the film so great is its willingness to dismantle and interrogate the very concept of superheroes.",
      "author": "Peter Debruge"
    },
    {
      "text": "A less gripping redo of previous Batman films and television shows, with a lethargic pace that drains the film of tension and suspense.",
      "author": "Scott Mendelson"
    },
    {
      "text": "As new chapters go, it's a strong beginning; if only it had known when to end.",
      "author": "Brian Lowry"
    },
    {
      "text": "Matt Reeves The Batman should tell audiences that other superhero movies are possible, and yet more, they can be exist outside the formulaic tentpoles filling theaters today.",
      "author": "Robert Daniels"
    },
    {
      "text": "The Batman is an utterly mesmerizing detective story with electrifying execution.",
      "author": "Jeff Nelson"
    },
    {
      "text": "It seems we get the Batman movie for our times And so now, in 2022, we get the darkest Batman yet, one that pictures a Gotham City so drenched in corruption, Bruce Wayne (Robert Pattinson) finds himself looking into his own family history.",
      "author": "Laura Clifford"
    },
    {
      "text": "A slow-burn noir detective thriller, 'The Batman' may not be the film you're anticipating, but it just might be precisely what this franchise needs.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Batman works in the shadows, and the intensity of Reeves action sequences work well there over three hours that never feel bloated or unnecessary.",
      "author": "Sean P. Means"
    },
    {
      "text": "This isnt just a new take on a popular comic book character, its a fully realized vision for a world. One like weve never gotten before.",
      "author": "Kyle Anderson"
    },
    {
      "text": "Reeves weaves a complex narrative that forces the audience to pay attention and helps his cause when, by the time Kyle appears, that attention shakes a bit.",
      "author": "George M. Thomas"
    },
    {
      "text": "The Batman is the stellar start of a new era of the cinema character. Something that works for the most diehard DC comics fans and those who love the character in the movies. Its an excellent time for film.",
      "author": "Julian Lytle"
    },
    {
      "text": "'The Batman' is a captivating take on the franchise and is in a league of its own. The pacing is consistent throughout its nearly 3-hour long running time, and the ending leaves you craving for more.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "This riveting take on Batman is, refreshingly, more of a detective story than an action spectacle -- although it does offer that element, too, as well as complex characters and relevant themes.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "This just might be for diehard fans alone; less faithful viewers will surely wonder what has happened to all of the standard exhilaration and the general sense of fun.",
      "author": "Mike Massie"
    },
    {
      "text": "An epic crime saga which more than justifies its epic length, \"The Batman\" aspires to a grandeur few of its superhero-cinema contemporaries can match.",
      "author": "Tim Grierson"
    },
    {
      "text": "Paul Danos incredible performance as The Riddler will send a chill down your spine.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "This is the Batman that Ive always wanted to see since I was a boy, and a Batman for the ages.",
      "author": "Alan Cerny"
    },
    {
      "text": "The Batman triumphs as a reinvention of one of cinema's most enduring comic book heroes. Matt Reeves has crafted a bleak, brutal new vision of Gotham City and its tormented protector.",
      "author": "Mark Cassidy"
    },
    {
      "text": "\"The Batman\" plays brilliantly like a murder horror mystery for 2h15, and then like a boring superhero movie for the last 30m. Thankfully the great vastly overwhelms the choppy.",
      "author": "J. Don Birnam"
    },
    {
      "text": "Matt Reeves takes Batman on a dark knight of the soul and rediscovers a hero.",
      "author": "Sherin Nicole"
    },
    {
      "text": "In terms of tone and scope and storyline, Matt Reeves’ reboot of the ever-fruitful franchise is more of a film noir than a fable about fantastic flying creatures, more Zodiac and Seven than Guardians of the Galaxy or Eternals.",
      "author": "Richard Roeper"
    },
    {
      "text": "While The Batman is far from the best or most consistent cinematic outing for the caped crusader, the film is still undeniably strong with one of the more poignant reflections seen regarding the character and his impact.",
      "author": "Carson Timar"
    },
    {
      "text": "The material here isnt exactly Agatha Christie, but its refreshing to see a superhero film in which the characters take time to think the plot through and in which the plot is worth thinking about.",
      "author": "Oscar Goff"
    },
    {
      "text": "\"The Batman is a darker knight than ever before. Reeves movie, wholly entertaining and full of surprises, features Twilight star Robert Pattinson as the youngest Bruce Wayne ever.",
      "author": "Roger Friedman"
    },
    {
      "text": "The most well thought-through outing for the caped crusader since Christopher Nolans durable The Dark Knight from 2008.",
      "author": "Donald Clarke"
    },
    {
      "text": "This is an incredibly well-made film. The score is otherworldly, the action scenes are perfectly crafted, and it captures tone better than most DC movies.",
      "author": "EJ Moreno"
    },
    {
      "text": "The harsh, grimy atmosphere that Matt Reeves has created leans further in to the noirish disposition his narrative delights in entertaining, with his dangerous, violently-minded Gotham serving as the perfect hunting ground for Pattinsons Batman",
      "author": "Peter Gray"
    },
    {
      "text": "Reeves has made the best Batman film since The Dark Knight, with a captivating and rich world that reinvigorates characters weve already seen on screen over and over again.",
      "author": "Ross Bonaime"
    },
    {
      "text": "What impresses most about The Batman is its deep well of interiority, the way it uses the innately mythic nature of comic book storytelling to zero in on the wants and needs of its characters.",
      "author": "Clint Worthington"
    },
    {
      "text": "Do we really need yet another Batman reboot? The answer, after watching Matt Reeves' tremendous The Batman, is apparently a resounding yes.",
      "author": "Chris Evangelista"
    },
    {
      "text": "The Batman presents us truly for the first time with a cinematic interpretation of The Worlds Greatest Detective. This version of the character is as much a sleuth as a superhero. Its a new feel for this type of film, giving it an added weight.",
      "author": "Joey Magidson"
    },
    {
      "text": "A spectacular, thrilling, and impressive interpretation of the character with a stirring story to tell.",
      "author": "Eric Eisenberg"
    }
  ],
  "release_year": 2022,
  "duration": 176,
  "genres": [
    "Action",
    "Adventure",
    "Crime",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Batman ventures into Gotham City's underworld when a sadistic killer leaves behind a trail of cryptic clues. As the scale of the perpetrator's plans become clear, he must bring justice to the abuse of power and corruption that plagues the metropolis.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/74xTEgt7R36Fpooo50r9T25onhq.jpg"
}