{
  "movie_name": "The Perks of Being a Wallflower",
  "movie_id": "the_perks_of_being_a_wallflower",
  "total_reviews": 170,
  "reviews": [
    {
      "text": "A very lively film whose ending gives a sensation of leaving behind a youth that, although dramatic, love-filled and happy, is never permanent. [Full review in Spanish]",
      "author": "José C. Donayre Guerrero"
    },
    {
      "text": "It can sometimes be hard to watch a film adaptation of one of your favorite teenage books because, too often, they fail to live up to the brilliance of the page. Luckily, this was not the case for the 2012 adaptation...",
      "author": "Michael Cuby"
    },
    {
      "text": "The films biggest achievement is how beautifully it captures the rich tapestry of teenage experiences soaked in lessons learned for a lifetime.",
      "author": "Gautam Anand"
    },
    {
      "text": "How warmly rewarding it is to watch people seem to actually like each other once in awhile",
      "author": "Jason Adams"
    },
    {
      "text": "The Perks of Being a Wallflower is one of the best coming-of-age films ever made, from its strong performances...to its eloquent but grounded screenplay.",
      "author": "Nicole Ackman"
    },
    {
      "text": "The result, while generally pleasant, is neither compelling nor memorable enough. The figures and situations are somewhat familiar, generic, rounded off.",
      "author": "David Walsh"
    },
    {
      "text": "In this fraudulent alternate reality, eccentricity appears unconvincingly appreciated.",
      "author": "Mike Massie"
    },
    {
      "text": "The Perks Of Being A Wallflower is a delicate film which captures the pain, fragility, love and joy of being young like few before it have.",
      "author": "Film Companion Staff"
    },
    {
      "text": "Celebrates the stories that make up our lives and the friends and loved ones who help us survive the journey.",
      "author": "Richard Propes"
    },
    {
      "text": "Stephen Chbosky's decision to translate his MTV cult novel into a movie where \"the gay kid is the coolest kid\" pays huge dividends...",
      "author": "David Lamble"
    },
    {
      "text": "Chbosky's film captures many of the feelings that can engulf the adolescent mind.",
      "author": "Jim Ross"
    },
    {
      "text": "Filmed on location in Pittsburg, the setting is the 90s but the script is timeless. Some scenes are as visually compelling as the characters.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "A pleasant enough evocation of the first stirrings of confidence and maturity in a painfully shy teenager.",
      "author": "PJ Nabarro"
    },
    {
      "text": "The Perks of Being a Wallflower is essentially a love letter for the awkward kids, but a film I think everyone can relate to.",
      "author": "Micheal Compton"
    },
    {
      "text": "It's a rare movie that improves upon the book in every way.",
      "author": "Rachel Wagner"
    },
    {
      "text": "The film, much like its reclusive protagonist, manages to carve out its own identity amongst a sea of vapid imitators.",
      "author": "Patrick Gamble"
    },
    {
      "text": "This is boring, and it's partly that believability thing. How many alienated outsiders do you have to gather together before they become insiders? Alternatively, they are all so good-looking, smart and well-heeled, they are winners, surely.",
      "author": "Deborah Ross"
    },
    {
      "text": "Like the best teen movies, the filmmakers recognize the power of the music we associated with our youth, and the excitement of finding somebody else who likes the same weird music you do.",
      "author": "Pat Padua"
    },
    {
      "text": "A surprisingly spot-on directorial debut, cementing Chbosky's voice as one to be listened to. His directorial style compliments the material to a tee, and helps to deliver a film that's as earnest, heartfelt and charming as coming-of-age dramas get.",
      "author": "Jamie Neish"
    },
    {
      "text": "Perks hits on a kind of universal nostalgia for the teenage years...without blunting the sharp, dark edges it simultaneously imparts.",
      "author": "Emma Dibdin"
    },
    {
      "text": "In spite of its downer of an opening act, the film achieves instant lift-off the very moment Charlie falls in with the out crowd.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It understands how adolescence is a period of anxieties provoked by prosaic desires. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "What it gets right is so right that the occasional clunky piece of dialogue or the slip of an accent isn't enough to derail a lovely piece of cinema.",
      "author": "J. Olson"
    },
    {
      "text": "Satisfying enough to delight younger audience members, and maybe win over a few older ones, too.",
      "author": "Victoria Luxford"
    },
    {
      "text": "It's been a while since a movie captured so colorfully the comedy, tragedy, angst, and exuberance of adolescence.",
      "author": "Eric D. Snider"
    },
    {
      "text": "\"Like real teenagers, Watson and Miller convincingly move from glowing objects of desire to comic relief to deeply troubled human beings.\"",
      "author": "Violet Lucca"
    },
    {
      "text": "Bravely delves into issues of incest, depression, homophobia and most hauntingly, death. And rarely does any of it feel fake.",
      "author": "Al Alexander"
    },
    {
      "text": "One of the absolute best films about surviving High School ever made.",
      "author": "Wesley Lovell"
    },
    {
      "text": "A modern masterpiece...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Stephen Chbosky's The Perks of Being a Wallflower is one of the best coming-of-age stories I've seen in years, thanks to his enduring and truthful script.",
      "author": "Jeremy Lebens"
    },
    {
      "text": "The Perks of Being a Wallflower flutters with the excitement and terror that comes in being young and trying to find your way.",
      "author": "Mark Pfeiffer"
    },
    {
      "text": "Boasts one of 2012's best live-wire performances in the form of Ezra Miller's exuberantly gay high school senior.",
      "author": "Tim Brayton"
    },
    {
      "text": "This profound story of love and friendship is apparently fiction, but it sure comes across with the power of a true story. It seems a lot truer to me than some based-on-fact movies like 'Argo.'",
      "author": "Robert Roten"
    },
    {
      "text": "While most films about teenage life tend to trade on a nifty hook, and sometimes even a plot, The Perks of Being a Wallflower chimes in as an unusually incisive, character-driven ramble through the inevitable awkwardness of teen life.",
      "author": "Jim Schembri"
    },
    {
      "text": "Logan Lerman is outstanding in this well done coming of age tale.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Rings inauthentic throughout.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The Perks of Being a Wallflower is funny, nostalgic, heartfelt and sweet, and so vivid it will practically make you feel the warm summer wind in your hair.",
      "author": "Tim Martain"
    },
    {
      "text": "I think for a first film this guy who wrote the book and has adapted it for the screen has done a terrific job and I really found these characters sympathetic.",
      "author": "David Stratton"
    },
    {
      "text": "Something's missing in this film. It just feels constructed and flat. And I found the casting uninspired as well.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "Even making allowances for a certain amount of Hollywood gloss, there's something wrong with a film about misfits where everyone is this good-looking and poised.",
      "author": "Jake Wilson"
    },
    {
      "text": "A stellar adaptation and a beautifully crafted coming-of-age tale that comes wrapped in all the promise and possibility of adolescence.",
      "author": "Cara Nash"
    },
    {
      "text": "A funny, heartfelt if admittedly formulaic feature that boasts first rate performances and a genuine affection for its characters.",
      "author": "Tom Clift"
    },
    {
      "text": "Miller and Watson are in their element here, helping to shore up Chbosky's sophomore effort, which is likely to offer a pivotal moment in time for its leads.",
      "author": "Ed Gibbs"
    },
    {
      "text": "Chbosky's adaptation from his semi-autobiographical best selling novel is a zinger of a screenplay, and he directs it with verve and sensitivity. Charlie's journey is beautifully conveyed and it's done without sentimen",
      "author": "Andrew L. Urban"
    },
    {
      "text": "Funny and sad, involving and moving, this quirkily named film with its mixed cocktail of characters offers more than you expect",
      "author": "Louise Keller"
    },
    {
      "text": "Humbling experience and despite whatever generation you hark from there is the common ground of having lived through those teenage years and this film revels in those magic moments and the people that help form who we are.",
      "author": "Cameron Williams"
    },
    {
      "text": "It's adolescent life, without the gloss but the resonant joy of freeze-framed fist pumps.",
      "author": "Blake Howard"
    },
    {
      "text": "The only misfire involves the trio's search for a mystery song. The fact that this shower has heard of Nick Drake but not David Bowie is really beyond belief.",
      "author": "Andy Lea"
    },
    {
      "text": "...parents and teens might not want to watch it together, but they sure will want to talk about it afterwards.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "One of the year's most agreeable surprises on every level.",
      "author": "Ken Hanke"
    },
    {
      "text": "A dewy early 1990s coming-of-age tale that is remarkable for its sensitivity and earnestness, even if its post-Salinger stations of the cross are almost entirely familiar.",
      "author": "John Beifuss"
    },
    {
      "text": "Earnest and eclectic, the innate compassion of Stephen Chbosky's young adult novel elevates it above other coming-of-age dramas.",
      "author": "Susan Granger"
    },
    {
      "text": "The bottom line is there are many perks to The Perks of Being a Wallflower.",
      "author": "Gary Wolcott"
    },
    {
      "text": "Is it a tale of first love, traumatized youths, loss of innocence or . . . all of the above?",
      "author": "Duane Dudek"
    },
    {
      "text": "Where Chbosky does score is in conveying the joyful release teenagers feel on finding themselves and finding their soul-mate peers - something his characters do with the aid of the emotional touchstones provided by British post-punk classics.",
      "author": "Jason Best"
    },
    {
      "text": "Once Lerman finds his footing, he carries the film with just the right amounts of nuance, charm and angst.",
      "author": "Mike Prevatt"
    },
    {
      "text": "It will become one of those movies this generation turns to when it wants to say, \"This is how it was for us, and this is how we survived it.\" For teenagers - and those of us who were teenagers once - it's truly remarkable.",
      "author": "Sean O'Connell"
    },
    {
      "text": "Filmmaker Chbosky constructs a tight, confined microcosm for them where the outside world never intrudes.",
      "author": "Kelly Vance"
    },
    {
      "text": "Perks seems like the work of a much more experienced director, maintaining fidelity to the source material without sacrificing any cinematic qualities, triggering genuine sentimentality and nostalgia through interaction between sound and image.",
      "author": "Ian Buckwalter"
    },
    {
      "text": "Spikier than the average coming-of-age movie, this astute comedy-drama is packed with memorable characters and resonant situations. It's also strikingly intelligent, refusing to accept Hollywood's fake moralising. And even better, it's funny and sexy.",
      "author": "Rich Cline"
    },
    {
      "text": "What exactly are the perks of being a wallflower? Chbosky's as short on answers as he is on vowels.",
      "author": "Ed Whitfield"
    },
    {
      "text": "It's all rather obvious and familiar, but well enough acted.",
      "author": "Philip French"
    },
    {
      "text": "Ezra Miller commits cinema larceny, stealing this movie from everyone.",
      "author": "Clint O'Connor"
    },
    {
      "text": "There's a lot to like about Perks, but I just couldn't shake the feeling that much like its main character, this movie is little more than an empty shell.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Chbosky creates a rich and authentic portrait of high-school bohemians, searching for freedom in the stifling environment of adolescent conformity.",
      "author": "Sean P. Means"
    },
    {
      "text": "The notoriously-perilous journey through late adolescence is at the heart of this ambitious child-to-adult drama.",
      "author": "Graham Young"
    },
    {
      "text": "Chbosky directs the movie with the care and conviction of someone who knows that this is his big story being told once and for all.",
      "author": "David Sexton"
    },
    {
      "text": "Whether or not the problems of these upper-middle-class, arty, would-be hipsters reflect your own teen experience, there is a kind of unmistakable genius in the way it taps the universal heightened reality of adolescence.",
      "author": "Corey Hall"
    },
    {
      "text": "Sensitive teens and their older kin who pine for the '90s may want to take it for a spin on the dance floor.",
      "author": "Joe Williams"
    },
    {
      "text": "Regardless of the viewer's proximity to his or her own high school experience, \"Perks\" seems to get it right, precisely because it's not about a specific time or place.",
      "author": "John Anderson"
    },
    {
      "text": "Seek out the infinitely superior The Myth of the American Sleepover for an original and moving take on similar material.",
      "author": "David Jenkins"
    },
    {
      "text": "The movie has its moments of soap-opera excitement, but it has all the substance of a teenage strop, and none of the energy.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Has some nice touches and makes nice use of the passing seasons, but can't ever manage to tap into the universal center of the story.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "A perky comedy with a few high-flying perceptions, mostly licensed to Watson, who acts with the freedom of a Hogwarts escapee who has finally outrun the dogs.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Teenage wallflowers, past and present alike, will feel tingles of recognition, and pure pleasure.",
      "author": "Robbie Collin"
    },
    {
      "text": "It's over-familiar stuff and the characters talk in pretentious teen speak (\"I feel infinite\") but scenes and characters linger in the memory.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "Chbosky brings genuine feeling to his variation on teenage angst and unrequited love, developing soulful characters and a funny but melancholy narrative.",
      "author": "Josh Bell"
    },
    {
      "text": "A coming-of-age film for the ages, Perks will charm even ardent cynics, with a rousing script, breathless soundtrack, and three stunning performances, particularly from the enormously talented Ezra Miller.",
      "author": "Shaun Munro"
    },
    {
      "text": "(The movie is) set in 1991, in a small town where high school culture is a John Hughes movie, with all the confusion, '80s music and hip ennui that implies.",
      "author": "Steve Persall"
    },
    {
      "text": "The real strength of the film though lies in its authenticity. There are many scenes, characters, details and interactions that you'll swear have been lifted from your very own adolescent years.",
      "author": "Joe Cunningham"
    },
    {
      "text": "It's quite sweet, quite funny and quite moving. There's just not enough of anything for it to really work.",
      "author": "Roz Laws"
    },
    {
      "text": "Enjoyable and emotionally engaging coming-of-age teen drama with a superb soundtrack, a sensitive, sharply written script and a trio of terrific performances from Lerman, Miller and Watson.",
      "author": "Matthew Turner"
    },
    {
      "text": "The leading trio and soapily watchable tone make it worth coming out of your room for.",
      "author": "Elliott Noble"
    },
    {
      "text": "It might not be a massive hit, but it will certainly ease a few paths through the awkwardness of adolescence.",
      "author": "Ellen E Jones"
    },
    {
      "text": "Its romance regarding the significance of teen experience might not work on everyone, but its earnestness, wit and stirring music ought to leave few hearts wholly untouched.",
      "author": "Hannah McGill"
    },
    {
      "text": "An honest, affection-hooking, coming-of-age drama which proves that there is life beyond Hogwarts for Emma Watson.",
      "author": "Dan Jolin"
    },
    {
      "text": "Watson holds her own with a character more annoying on paper than in reality, but it's the boys who most impress ...",
      "author": "Guy Lodge"
    },
    {
      "text": "The freshest and most heartfelt teen-angst to come along since \"Easy A.\" (Stephen) Chbosky directs with sensitive confidence and wrings impressive work out of his young leads.",
      "author": "Fr. Chris Carpenter"
    },
    {
      "text": "It's an earnest indie about a troubled teen, Charlie (Logan Lerman), and his various troubled confederates -- but it does demonstrate that Watson can stand on her own.",
      "author": "Peter Rainer"
    },
    {
      "text": "Observe the white, middle-class American Catholic teenager in his natural habitat...Though we have, perhaps, never flaunted the fetching eyelashes and perfect skin of these curious creatures...have we not, in a sense, been there?",
      "author": "Peter Canavese"
    },
    {
      "text": "The Perks of Being a Wallflower. Ripe dramatic material, but Chbosky surrounds his hurting characters with the cinematic equivalent of a hug circle -- which is sweet, but rather antithetical to tension-building.",
      "author": "Kimberley Jones"
    },
    {
      "text": "An exploration of troubled teenagers as well as counter-cultural angst that, because of its commitment to the ugly side of truth, is rife with honesty and captivating drama.",
      "author": "Ben Kendrick"
    },
    {
      "text": "A muddled creation blessed with unique emotional sincerity, yet cursed with loose ends and poorly defined characters, huddled into a precious creation that might test the patience of those with a sensitivity to effusive teen melodrama.",
      "author": "Brian Orndorf"
    },
    {
      "text": "High school can be hell, but Stephen Chbosky's engaging new film argues that anyone can get by with a little help from their friends.",
      "author": "Connie Ogle"
    },
    {
      "text": "Somehow, these imperfections fit. Somehow, \"The Perks of Being a Wallflower\" shouldn't be flawless.",
      "author": "Amy Biancolli"
    },
    {
      "text": "The movie's perfectly understated, warts-and-all sense of time and place will send any suburban Gen Xer in the audience flashing right back to their less-cautious days, when mix tapes did heavy lifting as calling cards.",
      "author": "Mike Russell"
    },
    {
      "text": "This somewhat disjointed but refreshingly earnest movie ultimately establishes itself as a charmer.",
      "author": "Jen Chaney"
    },
    {
      "text": "This is clearly a labor of love that was nurtured and sculpted from the beginning. The result is a film that feels exhilarating, fragile, funny and real.",
      "author": "Tom Long"
    },
    {
      "text": "Well-soaked in the familiar brine of teen sensitivity.",
      "author": "Liam Lacey"
    },
    {
      "text": "The Perks of Being a Wallflower will not be for everyone, but for those it affects, it affects greatly. I love it unreservedly, and feel it is one of the very best films of 2012.",
      "author": "Jonathan Lack"
    },
    {
      "text": "An instant high school classic, this film truly captures the grand spirit of the novel.",
      "author": "John Hanlon"
    },
    {
      "text": "There's a certain tangible quality to the way Chbosky puts his characters and dialogue up on the screen that makes the film seem fresh and occasionally quite touching. (Full Content Review for Parents also available)",
      "author": "Jim Judy"
    },
    {
      "text": "One of the truest coming-of-age films in recent memory.",
      "author": "Dustin Putman"
    },
    {
      "text": "It has a sense of timelessness.",
      "author": "Mark Dujsik"
    },
    {
      "text": "It deserves to be regarded as a modern classic.",
      "author": "Christopher Tookey"
    },
    {
      "text": "If [it] doesn't explore any new territory, it covers familiar ground engagingly, and sometimes touchingly.",
      "author": "Frank Swietek"
    },
    {
      "text": "Here's how to make sure your novel arrives on screen with its soul intact: adapt and direct it yourself.",
      "author": "Moira MacDonald"
    },
    {
      "text": "As a director, Chbosky mirrors his central character's emotional state.",
      "author": "Carrie Rickey"
    },
    {
      "text": "\"The Perks of Being a Wallflower\" finds an unexpectedly moving freshness in the old clichs by remaining attentive to the nuances of what happens within and between unhappy teenagers.",
      "author": "Ty Burr"
    },
    {
      "text": "The most pleasant and accomplished surprise of the year, a delightful, sweet, funny, and moving examination of teenage life that merits comparison to John Hughes and Cameron Crowe.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Takes the other side of the bullied high-school outcast story and shows us a teen who discovers the fun of belonging.",
      "author": "Gary Thompson"
    },
    {
      "text": "Verbal play and smartass-ery weaves through Wallflower, but it's of the predictable variety rather than the wryly observant commentary we'd hope for, like when a bored teen drawls: \"That works on so many levels.\"",
      "author": "Linda Barnard"
    },
    {
      "text": "This big-screen adaptation, written and directed by Chbosky, doesn't advance the source material, though it preserves the book's sensitive tone and affectionate characterizations.",
      "author": "Ben Sachs"
    },
    {
      "text": "Unlike many movies about teenagers, \"The Perks of Being a Wallflower\" does them the favor of taking them seriously.",
      "author": "Chris Hewitt"
    },
    {
      "text": "A beautiful, realistic, heartfelt comedy/drama, with a trio of standout performances.",
      "author": "Stephen Silver"
    },
    {
      "text": "The book and movie's key line, 'We accept the love we think we deserve,' rings true in any age.",
      "author": "Matt Pais"
    },
    {
      "text": "All of my previous selves still survive somewhere inside of me, and my previous adolescent would have loved \"The Perks of Being a Wallflower.\"",
      "author": "Roger Ebert"
    },
    {
      "text": "There is an honesty to \"The Perks of Being a Wallflower,\" a genuineness of experience that makes the movie soar when it just as easily could have stumbled.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "A universal tale of growing up as an outsider.",
      "author": "Brett Michel"
    },
    {
      "text": "It is the remarkable Logan Lerman who negotiates his journey to Charlie's self-discovery with so much dignity and vulnerability that he steals every scene and carries the picture.",
      "author": "Rex Reed"
    },
    {
      "text": "Nice youth pic about an early-'90s high-school freshman misfit benefits from an avalanche of period rock hits and pleasing performances.",
      "author": "Doris Toumarkine"
    },
    {
      "text": "Logan Lerman makes you completely forgive and forget Percy Jackson. You are with him from start to finish in this fantastic adaptation. This is a very popular book that I think will be a popular film because it just does everything right.",
      "author": "Kristian Harloff"
    },
    {
      "text": "I always root for these kids like this. You want them to fit in and have a good experience. It's what this movie does to you; it's so full of life and spirit but it can also get real dark in places. A lot like going on a date with Mark Ellis.",
      "author": "Mark Ellis"
    },
    {
      "text": "It's funny without resorting to broad slapstick, and it's poignant without settling for cheap sentimentality.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Book-based drama for mature teens tackles tough subjects.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "Charlie's personality relaxes yet moves you, and you'll take some of that sensation with you when you leave the theater.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "One of the most honest and assured teen dramas in recent memory.",
      "author": "Jason Buchanan"
    },
    {
      "text": "It's a movie that captures what your teenage years are like when you're in them, and what your teenage years are like when you look back at them.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Aside from offering a prime showcase to Harry Potter's Emma Watson... and her male costars, the movie manages to capture the book's deeply-felt emotions about growing up as a social misfit.",
      "author": "Leonard Maltin"
    },
    {
      "text": "A movie that makes teenage isolation and high-school torment seem like fresh subjects again.",
      "author": "Kurt Loder"
    },
    {
      "text": "A touching and consistently witty story about a fateful year of high school.",
      "author": "Marshall Fine"
    },
    {
      "text": "There's a lot to like about The Perks of Being a Wallflower, but Chbosky has some growing up to do before he steps behind the camera again.",
      "author": "Ethan Alter"
    },
    {
      "text": "\"The Perks of Being a Wallflower'' is the sort of lower- budget personal film you hardly see being released by a major distributor anymore, except during awards season.",
      "author": "Lou Lumenick"
    },
    {
      "text": "The best perks of Perks come from the ragtag band of young actors, particularly Ezra Miller's theatrical Patrick, who exhibits a giddy, anarchic teen spirit that masks a most profound sorrow.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "Feels warm and genuinely affectionate in a way that's impossible to manufacture. You've seen this story before, but maybe not populated with personalities this fully realized and alive.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Writer-director Stephen Chbosky's adaptation of his novel is so infused with honey-glazed recollections of suburban Pittsburgh in the early '90s that it suffocates.",
      "author": "Robert Levin"
    },
    {
      "text": "Likable, unsurprising and principally a showcase for the pretty young cast, notably Mr. Miller, who brings texture to his witty if sensitive gay quipster.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Thanks to [Chbosky's] stars, the film - like the book - is a smartly observed study of a troubled teen's first year in high school.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "High school is a messy, shocking, and occasionally beautiful experience. So is 'Perks.'",
      "author": "Matt Patches"
    },
    {
      "text": "...it's Miller's movie - he's an original, unafraid to let his freak flag fly and his presence is exhilarating.",
      "author": "Laura Clifford"
    },
    {
      "text": "While there are humorous and poignant moments, this angst-filled story of tender kisses, awkward dances, friends drifting apart, kindly English teachers, unrequited crushes and drug-addled partying has a nagging sense of deja vu.",
      "author": "Claudia Puig"
    },
    {
      "text": "It's populated by characters who are just too good to be plausible.",
      "author": "Mark Jenkins"
    },
    {
      "text": "Screenwriter/director Chbosky deserves credit for insisting on adapting a story he knows best, and he takes a heartfelt, if hardly visionary, approach.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "The rousing coming-of-age journey of a shy, smart, and sensitive high-school freshman who emerges from his shell to savor life.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Perks deserves points for going beyond the typical coming-of-age drivel aimed at teens. Logan Lerman excels as Charlie and Emma Watson makes a dream girl to die for, but the movie is stolen, head to tail, by Ezra Miller.",
      "author": "Peter Travers"
    },
    {
      "text": "Stephen Chbosky has created an intensely honest and personal look at high school friendships and first love, full of entertaining retro fun and deeply poignant moments.",
      "author": "Edward Douglas"
    },
    {
      "text": "A graceful and beguiling drama adapted from Stephen Chbosky's 1999 novel ...",
      "author": "Owen Gleiberman"
    },
    {
      "text": "The best teen film since JUNO.",
      "author": "Chris Bumbray"
    },
    {
      "text": "\"The Perks of Being a Wallflower,\" may not do anything groundbreaking, but it tells a familiar story in small, thoughtful ways.",
      "author": "Christy Lemire"
    },
    {
      "text": "An earnest, big-hearted ode to friends as support and salvation, and to the talismanic quality a favorite song, treasured hang-out, or shared tradition can take on for a teenager.",
      "author": "Alison Willmore"
    },
    {
      "text": "[The] characters, though familiar, become multidimensional and transcend stereotypes and the hot-button issues.",
      "author": "Kent Turner"
    },
    {
      "text": "Fact is, much as you and I might want to protest that we were cooler than these kids, wherever and whenever we did our growing up, we probably weren't.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "It's sad, funny, warm, and nostalgic - kind of like high school, really.",
      "author": "James Berardinelli"
    },
    {
      "text": "The greatest perk of being a real Wallflower is that at least you don't get stuck watching a movie about one.",
      "author": "Phil Villarreal"
    },
    {
      "text": "You can feel Chbosky's blood, sweat and tears oozing out of this highly personal project, but that holy trinity of fluids isn't enough to wash away the sense that you've seen this before-many, many, many times.",
      "author": "David Fear"
    },
    {
      "text": "I found the ultimate 'statement' of Wallflower to be a humane and encouraging one that the movie manages to deliver without getting overly precious.",
      "author": "Glenn Kenny"
    },
    {
      "text": "It's nostalgia with an emphasis on nostos, pain.",
      "author": "David Edelstein"
    },
    {
      "text": "A risible, somewhat revolting piece of pop martyrdom, made for and isolated to the damaged middle class.",
      "author": "Chris Cabin"
    },
    {
      "text": "This is what drama is all about, characters just behaving. They can bring all the pain and joy a movie needs if they're not wasting time explaining why they're doing everything.",
      "author": "Fred Topel"
    },
    {
      "text": "This beautifully written, directed and acted gem belongs with the handful of classics in the high school genre",
      "author": "Pete Hammond"
    },
    {
      "text": "It's all frightfully familiar - as if teens sitting around the campfire need to be told the same story every night - until the last 15 mins., when this Cocoa Puffs movie reveals an underlayer of arsenic.",
      "author": "Richard Corliss"
    },
    {
      "text": "First-time writer-director Stephen Chbosky adapts his young-adult bestseller with far more passion than skill, which suits familiar scenes of adolescent awkwardness aptly enough.",
      "author": "Rob Nelson"
    },
    {
      "text": "It is smart, it is delicately made, and it is played perfectly by its young ensemble cast.",
      "author": "Drew McWeeny"
    },
    {
      "text": "Chbosky can't reinvent the characters he created for the screen, but he's definitely done right by them.",
      "author": "Katey Rich"
    },
    {
      "text": "Chbosky has, for the most part, done an absolutely note-perfect job of bringing this story to the big screen...",
      "author": "David Nusair"
    },
    {
      "text": "The Perks of Being a Wallflower\" captures the phenomenon of high school with all the tenderness and horror it deserves.",
      "author": "Laremy Legel"
    },
    {
      "text": "Heartfelt but rather generic.",
      "author": "Jordan Mintzer"
    },
    {
      "text": "A whooping, leaping carnival of shouting about your difference in the faces of all those jocks and squares who never even heard of Sonic Youth.",
      "author": "Henry Barnes"
    },
    {
      "text": "[Ezra Miller] is a major talent and, I suspect, this role will make him a significant star.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Chbosky plays this CW serial stuff for maximum earnestness, stressing the teenage tendency to assume that every new thing they're feeling is unprecedented in human history, keeping the tone just-moist-eyed throughout.",
      "author": "Karina Longworth"
    }
  ],
  "duration": 103,
  "genres": [
    "Comedy",
    "Drama",
    "Romance",
    "LGBTQ+"
  ],
  "age_rating": "PG-13",
  "synopsis": "Socially awkward Charlie is a wallflower watching from the sidelines, until a pair of charismatic seniors take him under their wing.",
  "popularity": 8.9
}