{
  "movie_name": "The Invisible Man",
  "movie_id": "the_invisible_man_2020",
  "total_reviews": 423,
  "reviews": [
    {
      "text": "The Invisible Man is a chillingly brilliant horror film that again shows why Leigh Whannell needs to be considered one of the best filmmakers currently going around. The psychological nature of the film takes the horror genre to a whole new level",
      "author": "David Griffiths"
    },
    {
      "text": "Sublime without becoming overly sentimental, Invisible Life plays out like Douglas Sirk by way of Todd Haynes with a dash of Claire Denis.",
      "author": "Brandon Stanwyck"
    },
    {
      "text": "I really wanted to like this film. I’m a sucker for horror where reality is taken out of our control, and it feels like the world is turning off its axis... As with many things in the film, the intention is clear, but the execution is wanting.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "Sure nothing beats the original Invisible Man from 1933, but this new take on a classic is very entertaining.",
      "author": "Sarah Cortinaz"
    },
    {
      "text": "The Invisible Man is a much better film than expected, and quickly moves past simple genre to become a movie that should make you viscerally feel what it is like deep in the throes of a dangerous relationship.",
      "author": "Dave Giannini"
    },
    {
      "text": "The Invisible Man is an intelligent and creepy adaptation that is anchored by one of Moss' best.",
      "author": "Kristy Strouse"
    },
    {
      "text": "Whannell's The Invisible Man is an absolute banger, and stands tall as the most spectacular evolution of the story to hit the big screen.",
      "author": "Anya Stanley"
    },
    {
      "text": "Leigh Whannell crafted a genuinely scary and extremely suspenseful horror movie, based on a traumatic real-life situation that a lot of people, unfortunately, go through. Elisabeth Moss delivers an emotionally powerful performance.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Under Whannell’s direction, the camera is virtually a separate character, often turning away from Cecilia as if it’s seeing something she can’t, directing our gaze in a way that draws us into her nightmare.",
      "author": "Paul Kanieski"
    },
    {
      "text": "... \"visibly\" sails through that ocean filled with horror products. [Full review in Spanish]",
      "author": "Emiliano Basile"
    },
    {
      "text": "Whether it’s being an edge-of-your-seat horror thriller or a stinging allegory of domestic violence and the quest of women to be heard, “The Invisible Man” hits all of its targets.",
      "author": "Keith Garlington"
    },
    {
      "text": "... It uses its serious theme to give extra force to a tale that already has plenty of flair as a pure and simple spine-chiller.",
      "author": "Edward Porter"
    },
    {
      "text": "A fierce study in deadly gaslighting, anchored by Elisabeth Moss' best performance yet.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Just be prepared to do a double-take the next time you walk into a room that appears to be empty.",
      "author": "Britany Murphy"
    },
    {
      "text": "Whannell delivers an often-terrifying experience that just happens to be achingly germane.",
      "author": "Brian Eggert"
    },
    {
      "text": "The Invisible Man keeps the viewer disrupted and disturbed from the beginning to the very end. Whannell brings the feeling of uneasiness and agitation to the forefront, constructing an incredibly thought-through story.",
      "author": "Zofia Wijaszka"
    },
    {
      "text": "Small details... give weight to a story about an immaterial person. [Full review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "A thriller whose mandate is to startle its audience with surface-level shocks while simultaneously subverting expectations in a deeper way, dropping us out of our comfort zone toward some sunken place.",
      "author": "Adam Nayman"
    },
    {
      "text": "He (Whannell) uses the cinematic language to his advantage, moving the camera in ways which show that he is in complete control of his audience.",
      "author": "Nicholas Oon"
    },
    {
      "text": "Imbues its classic horror story with real-life terror.",
      "author": "Kip Mooney"
    },
    {
      "text": "Though influenced by the earlier film, Writer-Director Leigh Whannell reworks outdated elements and comes up with a surprisingly relevant take on the powers provided by invisibility.",
      "author": "Robin Holabird"
    },
    {
      "text": "It's fast and violent but crystalline in clarity...letting us experience the violence, shame, confusion, and anger that Cecilia does rather than explaining it to us.",
      "author": "Matt Lynch"
    },
    {
      "text": "From the film's opening titles you can tell you're in for something special.",
      "author": "Damian Levy"
    },
    {
      "text": "This film - with its science-fiction slant - delivers scares and works as a heightened examination of obsession and an abusive relationship.",
      "author": "Mark Meszoros"
    },
    {
      "text": "Leigh Whannell's update of the classic concept stars Elisabeth Moss as the ex-girlfriend of a millionaire inventor turned high-tech gaslighter whose goal is to erase his victim's humanity as effectively as he has obscured his own visibility.",
      "author": "John Beifuss"
    },
    {
      "text": "The film falls into stale traps, ones so basic and obvious that it's almost maddening to see them regurgitated for yet another rote thriller.",
      "author": "Emily Wheeler"
    },
    {
      "text": "With some great acting and solid storytelling, The Invisible Man has only strengthened the legacy of Wells' story.",
      "author": "Alex Bentley"
    },
    {
      "text": "Timely, relevant, and genuinely terrifying...The Invisible Man recontextualizes a classic Universal monster into a modern examination of abuse, toxicity, and gaslighting.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "It's doubtful any of The Invisible Man would work so well ... without Moss.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Staring, waiting, preparing for the worst creates the most unease in the viewer ... Whannell's script is equal parts action, suspense and surprise. He doesn't go for the easy scare, and much of the film is anxiety-inducing, not seat-jumping.",
      "author": "Candice McMillan"
    },
    {
      "text": "'The Invisible Man' displays how victims can be in constant danger, whether they're at home or in a crowded room.",
      "author": "Amelia Emberwing"
    },
    {
      "text": "The Invisible Man is one of the best horror movies in recent years and, of course, one of the best movies of 2020.",
      "author": "Anna Swanson"
    },
    {
      "text": "Whannell's simmering long shots get under the skin, the ambient soundscape is successfully designed to terrify.",
      "author": "Anne Brodie"
    },
    {
      "text": "Anchored by a raw performance from Elisabeth Moss, The Invisible Man cements Leigh Whannell's spot in the horror directors' Hall of Fame.",
      "author": "Trace Thurman"
    },
    {
      "text": "I may not have seen every invisible man remake and sequel there is, but of all the ones I have seen this is the best, even better than the original 1933 classic starring Claude Rains (which nevertheless was a technological marvel for its day).",
      "author": "Robert Roten"
    },
    {
      "text": "Anchored by another awesome performance by Moss, this urgently topical reworking of the HG Wells tale is a terrifically gripping thriller - and a brilliant metaphor for hidden coercive control.",
      "author": "Jason Best"
    },
    {
      "text": "Blends some of the year's best cinematography and special effects with a gasp-inducing story of abuse. Crisp and menacing.",
      "author": "Matt Pais"
    },
    {
      "text": "The Invisible Man is finally in the win column after years of being on the fringe of the well-loved Universal Monsters.",
      "author": "Paul Salfen"
    },
    {
      "text": "Leigh Whannell's contribution to the genre just keeps growing and growing.",
      "author": "Grant Watson"
    },
    {
      "text": "Sweet baby Jesus this movie had me on the edge of my seat.",
      "author": "Robert Slack"
    },
    {
      "text": "[Elizabeth Moss] carries the film, she is phenomenal in every single way.",
      "author": "Emma Wolfe"
    },
    {
      "text": "The Invisible Man is a reinterpretation of a classic character done right. By combining scares and thrills with a remarkable story that is timely and relatable, Whannell and Moss have brought the goods. Highly recommended.",
      "author": "Harris Dang"
    },
    {
      "text": "The horror her comes not from the jump scare, but from the psychological deterioration of Moss's character. [Full Review in Spanish]",
      "author": "Alberto Corona"
    },
    {
      "text": "The Invisible Man has a grand vision that it doesn't live up to.",
      "author": "Richard Propes"
    },
    {
      "text": "Elisabeth Moss brings full life to her characters. What an amazing and capable actress. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "Whannell combines his proven skill at making the most of a low budget chiller with a sharp, timely message.",
      "author": "Tom Beasley"
    },
    {
      "text": "Remarkably intense, consistently clever, and full of characters worth caring about, this is one of the best \"studio\" horror films in recent years.",
      "author": "Scott Weinberg"
    },
    {
      "text": "Hodge, Reid and Dyer are competent adjuncts. The movie makes use of conventional horror tropes, while Wallfisch's pounding score borders on the hysterical...but Invisible Man doesn't have anything even vaguely radical or oppositional about it.",
      "author": "Joanne Laurier"
    },
    {
      "text": "The Invisible Man is a masterpiece of suspense. Less is definitely more when invisibility is the premise of the film.",
      "author": "Scott Phillips"
    },
    {
      "text": "Moss communicates with her bulging blue eyes the terror of past trauma, the panic of being systematically tyrannised, the helplessness of not being believed, and the courage to take her tyranniser down head on.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Fear of the unknown is what drives us to be afraid, not fear of the thing itself. The Invisible Man, regrettably, fails to realise this",
      "author": "Alex Flood"
    },
    {
      "text": "Whannell puts a brilliant spin on this character that I've honestly felt has never been used to his full potential... It could quite possibly be the single best Universal Monster revival film we've ever had.",
      "author": "Dave Lee"
    },
    {
      "text": "You have to see it to believe it, but it's a rare remake that actually works, chilling in all the right ways and infusing enough modern sensibility for our current social climate.",
      "author": "Jason Fraley"
    },
    {
      "text": "At last, we have up-to-date evidence that it's perfectly possible to make a new version of a classic story that neither tinkers unnecessarily, nor departs entirely from the tone and content which made the story so good in the first place.",
      "author": "Keri O'Shea"
    },
    {
      "text": "Who knew that a \"remake\" could be so refreshing? Leigh Whannel's 3rd turn in the director's chair feels refreshing, borrowing elements of the Universal Monster as a threat anchor. The Invisible Man, at its core, is a woman's cry for escape.",
      "author": "Lee McCoy"
    },
    {
      "text": "It might seem hard to believe, but there's a horror-movie remake that actually isn't an embarrassment to the original film.",
      "author": "Carla Hay"
    },
    {
      "text": "Whannell managed to take a classic story and turn it into a relevant call in favour of the #MeToo movement. [Full review in Spanish]",
      "author": "Ricardo Gallegos"
    },
    {
      "text": "We've come a long way from a doctor wearing bandages to make himself seen. If a remake is going to exist in the modern space, it has to take on some modern horrors.",
      "author": "Murjani Rawls"
    },
    {
      "text": "Leigh Whannell kicks off the re-envisioned Monster Universe with a hyper-intense modern-twist on a classic story.",
      "author": "Zehra Phelan"
    },
    {
      "text": "This is not only a horror film that will cause you to grip your chair in fear but will also make you think about it on the car ride home, while having dinner, and when you're lying in bed.",
      "author": "Allen Almachar"
    },
    {
      "text": "The Invisible Man is a refreshing take on this Universal Classic Monster with a modern twist. It's a terrorizing look into abusive relationships and just how far someone could go to stay in control, becoming the villain hidden in plain sight.",
      "author": "Jordy Sirkin"
    },
    {
      "text": "No doubt about it: the movie works. And it works on a nasty personal level; it exploits our awareness that women are gaslighted by abusive men all the time, to perpetuate and add to the abuse.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "I appreciated the simple fact that Whannell's film was legitimately scary while meaning something in the end. It's not made out of fluff or easy frights.",
      "author": "Dan Buffa"
    },
    {
      "text": "Whannell's ruthlessly efficient script invests the story with some real resonance.",
      "author": "Adam Lubitow"
    },
    {
      "text": "This is a chilling horror movie, chained to a social commentary that sets it apart from the rest. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "With this reimagining, Universal Pictures has done several things right.",
      "author": "Damond Fudge"
    },
    {
      "text": "Very tame version of an Entity-type premise, without inventiveness or interest.",
      "author": "Adrian Martin"
    },
    {
      "text": "The Invisible Man  is much more than the reboot of a classic, it is the reinvention of a monster from a much more real and modern perspective -- making it infinitely more terrifying. [Full review in Spanish]",
      "author": "Luis Bond"
    },
    {
      "text": "The Invisible Man is a fresh, modern take on a classic horror film that is sure to keep you on the edge of your seat. You'll probably enjoy how this film feels more like an experience given the collective paranoia that is offered.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "Almost halfway through the film, I was worried that it was going in a direction that would make me hate the story - but thankfully, that wasn't the case. Whannel turns the story around with a terrifying action sequence which clarifies the arc ...",
      "author": "Amie Simon"
    },
    {
      "text": "It builds a generous helping of dread through universally understandable fears - and ones that will strike a particular nerve with victims of abuse.",
      "author": "Mike Massie"
    },
    {
      "text": "Whannell the screenwriter still has some catching up to do with Whannell the director. But his spiffy remake is mostly able to sustain that sweet spot between cheap thrills and sobering drama.",
      "author": "Rubén Rosario"
    },
    {
      "text": "Never lives up to its magnificent opening sequence.",
      "author": "Evan Dossey"
    },
    {
      "text": "The most dazzling aspect of The Invisible Man is the long stretches of silence where the visual grammar forces viewers to really analyze what's happening in the frame.",
      "author": "Willow Maclay"
    },
    {
      "text": "Proves an old classic can get dusted off to be a completely relevant and timely thriller that's worth seeing for a new generation.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "The Invisible Man is an effective horror thriller that utilizes outstanding special effects, a chilling storyline, and a strong performance from Elisabeth Moss.",
      "author": "Jeff Beck"
    },
    {
      "text": "The truth is, we own nothing but ourselves and it's that which serves as a glorious jumping off point for writer/director Leigh Whannell's The Invisible Man remake, now available on home video.",
      "author": "Douglas Davidson"
    },
    {
      "text": "The film plays like a roller coaster, going through twists and turns that will leave you breathless.",
      "author": "Caroline Madden"
    },
    {
      "text": "The tension never lets up, and you will be on your seat every frame of the film. An award-worthy film for Elizabeth Moss!",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Leigh Whannell's approach on H. G. Wells classic adds some interesting contemporary elements, but near the end everything gets quite tangled on a flimsy third act.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "It was very well-done. The acting was solid.",
      "author": "Justin Brown"
    },
    {
      "text": "Really entertaining, and I was really surprised by it.",
      "author": "Brandon Collins"
    },
    {
      "text": "Writer-director Leigh Whannell takes the basis of H.G. Wells' 1897 novel of \"The Invisible Man\" and gives it a Hitchcockian-like psychological horror-thriller spin made relevant for today's #MeToo era.",
      "author": "Casey Chong"
    },
    {
      "text": "Neither as misanthropic nor maniacal as the original, this update finds a happy medium between entropy and empathy. It's the right ground to claim for a shrewd, sleek and truly scary story that knows trauma can't be erased but it can be empowering.",
      "author": "Nick Rogers"
    },
    {
      "text": "There's a lot more to think about than a typical horror film. It's a real psychological thriller...a good strong film, not SCARY scary, but it gets in your head.",
      "author": "tt stern-enzi"
    },
    {
      "text": "It's more than meets the eye, in all the best ways.",
      "author": "Isaac Feldberg"
    },
    {
      "text": "The things that I really loved the most about it are the cinematography and the direction.",
      "author": "Steph Cozza"
    },
    {
      "text": "Elisabeth Moss is magnificent, as she plays the part of \"Cecilia Kass\" in this high intensity, edge of your seat, thrilling, gas lighting roller coaster.",
      "author": "Stephanie Chapman"
    },
    {
      "text": "The Invisible Man 2020 remake takes a classic thriller and somehow makes it better. It's perfectly updated for the times & brings light to domestic abuse.",
      "author": "Tessa Smith"
    },
    {
      "text": "The Invisible Man forces us to ask if we are so quick to type #believewomen, if held to those words in a real-life Cece v. Adrian situation?",
      "author": "Jonita Davis"
    },
    {
      "text": "The prize asset is Moss, of course, a seven-octave actor equally happy with micro-emotion and going very big indeed.",
      "author": "Danny Leigh"
    },
    {
      "text": "Moss, so attuned to the nuances of trauma in the early going, devolves into revenge movie clichés. There's nothing wrong with an old-fashioned horror flick, but it's frustrating to watch a film make a grab for greatness and end up grasping only air.",
      "author": "Noah Gittell"
    },
    {
      "text": "In their re-imagined The Invisible Man, filmmaker Leigh Whannell and actress Elisabeth Moss attack the patriarchy and affirm rich white tech bros as the enemy.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "The Invisible Man is a smart, lo-fi approach to a classic movie monster that tells a gripping, timely story.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Whannell delivers a refreshingly modern take on H.G. Wells' story by incorporating technology, twisting the origin of the classic villain.",
      "author": "Sabrina Ramirez"
    },
    {
      "text": "But \"The Invisible Man,\" alas, comes off as underpopulated, unpersuasive and cheap.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "A dark, fairly grounded and relentlessly unnerving thriller about domestic-abuse and psychological torment that's aiming hard for the 'subtext that's also just text' style of topical horror.",
      "author": "Bob Chipman"
    },
    {
      "text": "I still feel the trailer showed way too much of the plot, but there is more here than you expect and the scares and chills are frequent and effective.",
      "author": "Danny Minton"
    },
    {
      "text": "The Invisible Man expertly brings the classic Universal monster flick into the modern age. It is an enthralling tale of resilience and survival against a familiar evil.",
      "author": "Molly Henery"
    },
    {
      "text": "The Invisible Man is both a smart, relevant reboot of a classic story and a wholly entertaining two hours packed with fun scares.",
      "author": "Anna Menta"
    },
    {
      "text": "More than just your standard monster movie. This time the monster is real, and he's absolutely terrifying.",
      "author": "Micheal Compton"
    },
    {
      "text": "[A] horror thriller that is driven by a riveting performance by actress Elisabeth Moss.",
      "author": "Sameen Amer"
    },
    {
      "text": "The scariest horror film in years, The Invisible Man is exactly the reason we all fell in love with the Universal Horror Monsters in the first place. This will go down in modern horror history.",
      "author": "EJ Moreno"
    },
    {
      "text": "This new approach to the myth created by Wells is interesting, elegant and, best of all, activist. [Full Review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "The Invisible Man is a worthy thriller that meets its mandate, painting by the numbers to make a nonetheless fun picture.",
      "author": "Jordan Calhoun"
    },
    {
      "text": "Staying slightly longer on a shot of a door left ajar doesn't reveal a hidden clown, Halloween-style, but instead makes evident how menacing the everyday can become for a person who has been traumatised.",
      "author": "Manuela Lazic"
    },
    {
      "text": "Filmmaker Whannell does an absolutely stunning job of immediately drawing the viewer into the deliberately-paced proceedings...",
      "author": "David Nusair"
    },
    {
      "text": "Again: what these horror characters need are horror movies. Hopefully they will dare to do the same with the other Universal monsters! [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A high level fright night at the movies.",
      "author": "Patrick McDonald"
    },
    {
      "text": "The fight choreography and special effects are flawless, but they're nothing but aesthetic bells and whistles without Moss giving them substantive purpose via her performance.",
      "author": "Jared Mobarak"
    },
    {
      "text": "Invisible Man offers more than just a retread of familiar horror tropes",
      "author": "Amanda Greever"
    },
    {
      "text": "'The Invisible Man' is an appreciable addition to the catalog of films focused on this character. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A sober and impeccable direction, a main performance that stands out. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Leigh Whannell continues his hot streak with another fantastic thriller. The performances are great, and the scares come from real world fears rather than jump scares.",
      "author": "Sean Chandler"
    },
    {
      "text": "The Invisible Man is capable of perfectly showing Cecilia's anguish and helplessness before the invisible threat. [Full Review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "It seems that you can teach an old dog new tricks, at least when it comes to classic Universal monster movies.",
      "author": "Louisa Moore"
    },
    {
      "text": "Elisabeth Moss's Cecilia has everything under the sun to be petrified about.",
      "author": "Andiee Paviour"
    },
    {
      "text": "The Invisible Man works as the retelling of a classic monster, channeling the energy of that bygone age into something relevant to our modern era.",
      "author": "Karen M. Peterson"
    },
    {
      "text": "The film surprises as science fiction to show masculine domination over women. [Full Review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "This film is relentless with a #metoo trope in that the director keeps showing Moss as Cecilia strong physically and mentally. What makes it white-knuckle-worthy is that you can't see her enemy, nor can she.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "In the glut of Hollywood reboots, remakes and sequels, Leigh Whannell's new take on \"The Invisible Man\" comes along and makes a good case for why remakes can work.",
      "author": "Blake Howard"
    },
    {
      "text": "The Invisible Man is a potent look at the abuse foisted upon women by the nation's predators, and how it feels like that threat is perpetually present even in moments of calm.",
      "author": "Matt Brunson"
    },
    {
      "text": "Cinematographer Stefan Duscio's camerawork is crafty, often focusing on empty frames and spaces where Adrian might be hiding, so that every scene becomes instantly tense.",
      "author": "Amber Wilkinson"
    },
    {
      "text": "A smart update from the Invisible Man of Wells' novel.",
      "author": "Joshua Rivera"
    },
    {
      "text": "[Leigh] Whannell creates a solid sense of place and he affects a narrative pacing that punctuates long, slow sequences with sudden stabs of graphic violence.",
      "author": "Dan Webster"
    },
    {
      "text": "Writer/director Leigh Whannell paces The Invisible Man so perfectly, it earns every punctuated scare.",
      "author": "Steven Prokopy"
    },
    {
      "text": "Thrilling suspense from beginning to end with Elisabeth Moss really selling her is she or isn't she crazy role?",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Equal parts harrowing abuse story and genuinely terrifying horror movie, The Invisible Man [is] a #MeToo shocker with a darkly fantastical heart.",
      "author": "Joey Keogh"
    },
    {
      "text": "Moss gives it her all, throwing herself into the role, literally and figuratively, with courageous abandon. Still, such attributes feel lost on a film far too content to render story logic and common sense as invisible as the bad guy.",
      "author": "Jeff York"
    },
    {
      "text": "2020's The Invisible Man is filled with all the thrills, suspense, and storytelling we could've hoped for out of a Universal Monster.",
      "author": "Joseph Dominguez"
    },
    {
      "text": "Elisabeth Moss delivers a spectacular performance in this smart and opportune retelling of a horror classic. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Ultimately, The Invisible Man makes for a pacey, if mostly predictable, reimagining of a classic Hollywood horror terror.",
      "author": "Adam Mullins-Khatib"
    },
    {
      "text": "What makes this film so scary isn't how unrealistic it is, but the fact that some small part of it feels familiar.",
      "author": "Emma Baty"
    },
    {
      "text": "The brilliant Elizabeth Moss embodies the invisibility of abused women everywhere whose reports are often disbelieved with a typical top-shelf performance as Cecilia.",
      "author": "Donovan Farley"
    },
    {
      "text": "Riffing on the invisible bad guy of films gone by, this twisting of the tale with Moss front and centre as a woman trapped in an abusive relationship is potently relevant.",
      "author": "Kate Rodger"
    },
    {
      "text": "[Elizabeth Moss is] amazing and she does so much just with her eyes. It's a really demanding role physically [and] emotionally; it's a huge range she has to play.",
      "author": "Christy Lemire"
    },
    {
      "text": "This is far removed from what you might be expecting.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Elisabeth Moss delivers a gritty, yet commanding performance worthy of big notice. Though the film is The Invisible Man, Moss makes this movie what it is, an excellent anxiety-ridden thrill ride.",
      "author": "Vincent Schilling"
    },
    {
      "text": "The movie has so much going for it.",
      "author": "Rick Kisonak"
    },
    {
      "text": "Elisabeth Moss' performance was was one of the takeaways, great performance, you really feel her going through the motions of coming out of abusive relationships.",
      "author": "Tony Baker"
    },
    {
      "text": "Leigh Whannell is our new king of elevated schlock.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Lack of urgency trips \"Invisible Man.\"",
      "author": "Charles Koplinski"
    },
    {
      "text": "Between the dark territory that the film explores ... and Moss' gripping portrayal of a woman on the edge of her sanity ... this Invisible Man movie has giant invisiballs",
      "author": "Matt Looker"
    },
    {
      "text": "This marriage of sheer filmmaking prowess and worthwhile themes make The Invisible Man among the most impressive horror remakes of our time.",
      "author": "Matthew Dougherty"
    },
    {
      "text": "Moss, courageously devoid of vanity when the character calls for it, seamlessly whisks Cecilia from victim to victor, but with a high cost of humanity attached.",
      "author": "Dann Gire"
    },
    {
      "text": "By making Cecilia the main character, rather than the lunatic who's tormenting her, Whannell has entirely changed the story's focus, and turned it into a very effective and at times positively Hitchcockian thriller.",
      "author": "Paul Whitington"
    },
    {
      "text": "The baddie's super strength, and clicky Predator noise, distracted me a bit at one point but overall this is a successful addition to the Invisible Man family.",
      "author": "Aine O'Connor"
    },
    {
      "text": "It's a good film that's honestly trying to be good...",
      "author": "Korey Coleman"
    },
    {
      "text": "Whannell is brilliant at distracting us with amusing, knowing dialogue (siblings are rivalrous; architects are trendy; waiters are irksomely urbane). Death comes when you least expect it.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "The Invisible Man is next level gaslighting as Leigh Whannell and Blumhouse show Cecelia's life systematically ruined through the most mundane of acts and how tenuous trust really is.",
      "author": "MontiLee Stormer"
    },
    {
      "text": "It's an entertaining, effective, scary horror thriller with a lot of great moments of tension, but it's also a film that is very strong thematically.",
      "author": "Marianna Neal"
    },
    {
      "text": "What I love about this film (and horror in general) is how it can really be a voice for the marginalized experience when done thoughtfully.",
      "author": "Princess Weekes"
    },
    {
      "text": "The Invisible Man is horror filmmaking of the finest kind ... a smart, self-aware work that is both frightening and provocative, an of-the-moment work of art that exquisitely updates a genre classic.",
      "author": "Allen Adams"
    },
    {
      "text": "It's hard to imagine a film that feels more of the moment than The Invisible Man. Smart and scary in equal measure, it sets the new gold standard for remaking classic horror properties.",
      "author": "Phil W. Bayles"
    },
    {
      "text": "Whannell and Moss team up for a memorable if imperfect frightener that recasts HG Wells' story as a harrowing domestic violence horror.",
      "author": "Matt Neal"
    },
    {
      "text": "We've seen the man who makes himself invisible, but it turns out seeing the one in view of the man who can't be seen is compelling for an entirely different reason.",
      "author": "Jon Winkler"
    },
    {
      "text": "It's essentially silly stuff, and overextended, but Moss is great and there are several good flourishes. At his most devilish, the indiscernible psycho is worth seeing.",
      "author": "Tom Shone"
    },
    {
      "text": "A powerful psychological thriller. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "There's a very serious message here, and it needs to be delivered in a far more complex, sophisticated way that matches Moss's fearless work. She's real. Her co-stars are devices.",
      "author": "Chris Alexander"
    },
    {
      "text": "Despite its flaws, The Invisible Man is a movie that will keep you entertained thanks to the good use of suspense and an interesting premise. [Full Review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "That The Invisible Man manages to truly be about something meaningful to modern society proves the necessity of retelling this legendary story, despite the film makers occasionally overindulging in the process.",
      "author": "Tom Augustine"
    },
    {
      "text": "[Moss] is the heart of this story, which combines ... paranoia, mental illness, female empowerment and domestic abuse into a tale that - unlike Cecilia's abusive boyfriend - never overstays its welcome.",
      "author": "Cameron Meier"
    },
    {
      "text": "Director Leigh Whannell's remake is scary, timely, unsettling and gripping, and features one hell of a performance from Elisabeth Moss.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "The silences are the scariest parts of \"The Invisible Man.\"",
      "author": "Matthew Passantino"
    },
    {
      "text": "The vision of writer/director Leigh Whannell sets this remake apart, with twists and turns that prevent it from falling into clichés and keep you guessing until the very last frame.",
      "author": "Kent Garrison"
    },
    {
      "text": "Moss is very impressive here considering that she spends so much time staring at, reacting to or running from... nothing.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "Moss is terrific as a woman who believes (or says she believes) her not-dead husband has come back, masked by an invisibility he has created...",
      "author": "Stephen Romei"
    },
    {
      "text": "This riff on H.G. Wells's sci-fi classic is a slow, steady squeeze from a vise that doesn't release its grip until its final shot.",
      "author": "Robert Ham"
    },
    {
      "text": "As Whannell builds tension past the point where other films would have offered a cheap payoff, he instead continues to turn the screw, resulting in a film that's not only scary, but genuinely surprising.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The thrilling, fun, and violent mode of The Invisible Man proves that sometimes some monsters are worth resurrecting.",
      "author": "Emma Stefansky"
    },
    {
      "text": "A bracingly modern #MeToo allegory that, despite its brutal craft, rings hollow.",
      "author": "Jake Coyle"
    },
    {
      "text": "Abusers keep their victims under their thumbs, even when they're absent. That's plenty shocking on its own, and now is just the right time to be telling this story, this way, as a piece of effective entertainment with a core of instinctual horror.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "A smart, unexpected delight.",
      "author": "Kevin Maher"
    },
    {
      "text": "This is the most powerful movie about domestic abuse in the last 88 years. We should act accordingly.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "This version of The Invisible Man is entertaining, of the moment, and clever enough to satisfy, without ever getting too pleased with itself.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Whannell uses stillness and empty spaces against the audience expertly. But it's Moss who most sells this new, self-consciously serious take on a hammy monster movie premise.",
      "author": "Andrew Whalen"
    },
    {
      "text": "Whannell keeps his audience guessing, and I confess, in my case, also literally jumping out of our seats.",
      "author": "Brian Viner"
    },
    {
      "text": "It's a shame the script is so lazy about plugging gaps in logic that pepper the plot. Of course, these lapses are there because [Leigh] Whannell is working so diligently to manipulate us.",
      "author": "Rich Cline"
    },
    {
      "text": "entertaining slice of Friday night popcorn horror",
      "author": "Chris Hunneysett"
    },
    {
      "text": "The movie's success is in large part attributable to Moss, who spends large chunks of the film expressing terror, weariness, cunning, or desperate strength in the face of an invisible foil.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Leigh Whannell's The Invisible Man is a masterpiece...",
      "author": "Walter Chaw"
    },
    {
      "text": "Despite losing its nerve, there are moments (one in particular) that are genuinely shocking, which just about makes it a worthwhile and unsettling experience.",
      "author": "Jamie East"
    },
    {
      "text": "Each scene in \"The Invisible Man\" sets the right tone, building the foundation of tension block by block so that we the viewer have no choice but to jump in our seats as the madness unfolds.",
      "author": "Pamela Powell"
    },
    {
      "text": "\"The Invisible Man\" is a new kind of monster movie, and it is really creepy because it knows what makes us afraid today. It knows what a modern monster looks like.",
      "author": "Michael Smith"
    },
    {
      "text": "A good and modern horror movie, which brings the original work to the present and expands upon it with many interesting ideas. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "This one is a pure crowd-pleaser.",
      "author": "Brad Keefe"
    },
    {
      "text": "Overall, this is the most sustained exercise in Hitchcock-style suspense in some years.",
      "author": "M.V. Moorhead"
    },
    {
      "text": "Sharp camerawork and a dedicated performance from Elizabeth Moss make The Invisible Man a paranoia-filled nail-biter that revitalizes a classic story for a new generation.",
      "author": "Lauren Coates"
    },
    {
      "text": "Very suspenseful and very twisty! A fresh modern take on this story.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Leigh Whannell's expert direction and clever script make 'The Invisible Man' a remake in the same caliber as Carpenter's 'The Thing' or Cronenberg's 'The Fly.' It's THAT good.",
      "author": "Drew Dietsch"
    },
    {
      "text": "This is the breath of vitality needed to rejuvenate Universal's stagnant Dark Universe, and is without question one of the year's best horror films.",
      "author": "Jay Krieger"
    },
    {
      "text": "A great lead performance guides intriguing twists and turns!",
      "author": "Jason Escamilla"
    },
    {
      "text": "The Invisible Man deals with emotional manipulation. Whannell lets so much of the horror be motivated by it. He makes the audience feel like we are losing control too by letting us in on more than the characters are seeing.",
      "author": "Karl Delossantos"
    },
    {
      "text": "Heavy on quality suspense and scares, but surprisingly light on character development and logic.",
      "author": "Edwin Arnaudin"
    },
    {
      "text": "While chock full of relatively good scares, campy effects and an ending that will tickle a very specific demographic of 1990s and 2000s thriller fans with glee, The Invisible Man doesn't deliver more than that.",
      "author": "Sarah-Tai Black"
    },
    {
      "text": "By switching the focus in this film, this iteration of The Invisible Man becomes a powerful and haunting cinematic allegory for those who are forced to live with the lingering effects of abuse in all of its forms.",
      "author": "Heather Wixson"
    },
    {
      "text": "...a timely metaphor about believing women who make charges against powerful men.",
      "author": "Josh Larsen"
    },
    {
      "text": "The audience finds itself questioning the veracity of a woman claiming terror at the hands of her domestic partner. #MeToo? Y tú.",
      "author": "Neil Morris"
    },
    {
      "text": "It has muscular direction, an intelligent script, and a cast that works together to bring a shared vision to life.",
      "author": "Tim Brennan"
    },
    {
      "text": "It may be sound oxymoronic, however if you're a horror/thriller fan, you will want to see this Invisible Man.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Though sometimes over-keen to sacrifice logic for a tricksy payoff, the rebooted The Invisible Man is a triumph of low-fi invention elevated by a crackerjack Elisabeth Moss performance.",
      "author": "Shaun Munro"
    },
    {
      "text": "A chilling re-imagined modern-day remake of the classic 1933 sci-fi/horror/monster film by James Whale.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "With tricks of misdirection, creative camera angles, and spot-on editing to tighten an already above-average script, this thriller is far better than the trailers suggest and earns every moment of attention...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The Invisible Man is a smart, gripping, and downright scary take on a story many of us know so well. The film proves, yet again, that Leigh Whannell is one of the most exciting filmmakers in the genre today.",
      "author": "Melissa Hannon"
    },
    {
      "text": "A well-plotted thriller with horror trappings that deserves praise for finding a new and unsettling spin on an old premise.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Subverting the original text's point of view allows Whannell to privilege his female protagonist while continuing to explore the novel's theme of untrammelled power.",
      "author": "Simran Hans"
    },
    {
      "text": "The first must-see horror movie of 2020, The Invisible Man is destined to be a classic, and Elizabeth Moss' incredible performance proves to be impossible to tear your eyes from.",
      "author": "Josh Wilding"
    },
    {
      "text": ". . . a surprisingly gripping thriller with another boffo performance from always watchable Elisabeth Moss.",
      "author": "John Urbancich"
    },
    {
      "text": "What was once meant for the microwaved territory of the would-be Dark Universe has found new, timely, and sometimes ingenious life as a one-off.",
      "author": "Chris Feil"
    },
    {
      "text": "Buckle up for a wild cinematic ride that goes beyond the \"is she or isn't she crazy?\" premise thanks to a brilliant performance by Elisabeth Moss.",
      "author": "Rachel West"
    },
    {
      "text": "Director Leigh Whannell has found a way to recontextualize the modern monster movie in a way that feels perfectly timed with the #MeToo movement and seems alive like no horror remake has in years.",
      "author": "Nate Adams"
    },
    {
      "text": "Leigh Whannell puts an updated feminist spin on H.G. Wells' horror classic.",
      "author": "Susan Granger"
    },
    {
      "text": "It's nice to see a horror film this big be slow and methodical. When it finally goes for the throat towards the end, it feels earned. It's the reward, made sweeter by the respect the film pays it audience. The Invisible Man is a must see film.",
      "author": "Callum Forbes"
    },
    {
      "text": "The plot has more holes than a brimming pin cushion.",
      "author": "Wendy Shreve"
    },
    {
      "text": "A genuinely distressing and topical psychological horror, this is a stellar example of how to update a classic concept to reflect modern fears.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Bravo, Leigh Whannell! You have created your own renaissance. I'll call it \"The Whannellissance\". Also Elisabeth Moss is undeniably one of the best performers working today.",
      "author": "Rendy Jones"
    },
    {
      "text": "Leigh Whannell continues his impressive streak of conjuring impeccable storytelling and creative special effects all on a shoestring budget. The first exceptionally good horror film of 2020.",
      "author": "Chris Sawin"
    },
    {
      "text": "The biggest weapon in this film's arsenal, however, has to be The Handmaid's Tale star Elisabeth Moss, one of the greatest actresses of her generation, who delivers vulnerability, brittle strength, and fury in spades",
      "author": "Lewis Knight"
    },
    {
      "text": "Whannell has gone back to basics crafting a grounded, deeply unsettling character-driven thriller.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "The best Invisible Man movie ever made, hands down, bar none.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The Invisible Man does compellingly and sympathetically depict the devastatingly all-consuming effects of domestic violence, while providing plenty of suspense and scares.",
      "author": "Brandy McDonnell"
    },
    {
      "text": "In this heart-stopping update, the 'Gotcha!' moments really do surprise.",
      "author": "Richard Roeper"
    },
    {
      "text": "In fact, instead of surprising us with something new, he has gone in the opposite direction and has rendered the invisible man, well, truly invisible...",
      "author": "Devesh Sharma"
    },
    {
      "text": "The Invisible Man subverts many genre tropes to keep you looking over your shoulder well after the credits roll.",
      "author": "Neil Soans"
    },
    {
      "text": "The pleasant revelation of The Invisible Man is how well it works on a scene-to-scene, scare-to-scare basis; what's a bit disappointing is how minor its resonance beyond the frame feels.",
      "author": "Rob Harvilla"
    },
    {
      "text": "Moss has mastered slow-burn suffering on the TV series The Handmaid's Tale, and she brings that experience to bear here, anchoring the fantastic circumstances of Cecilia's torment to the real world.",
      "author": "Randall King"
    },
    {
      "text": "There's some cruelty in this visual; there are moments when The Invisible Man is not fun to watch. But the movie's violence opens up a larger question...",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "[Elisabeth Moss] is a victim in this movie for a long, long time, and I didn't really care for that.",
      "author": "Tim Cogshell"
    },
    {
      "text": "Alternative title = Sleeping with the Invisible Enemy",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Despite its lack of pretense, there are actually layers of intelligent subtext curling beneath the standard horror plot.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "If you're looking for a horror movie that has some effectively terrifying moments with a theme relevant to a modern day social struggle then you'll enjoy this film.",
      "author": "Chauncey K. Robinson"
    },
    {
      "text": "Moss is on the screen almost constantly, often acting against an invisible co-star, and she's tremendous in the role. Here's a performer who can easily slide between glamorous and mousy, and she's fully in the latter mode in The Invisible Man.",
      "author": "Chris Knight"
    },
    {
      "text": "The minimalist approach works for what is one of the finest films of 2020 so far.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Even more proof that large budgets and a stable of A-listers aren't needed to frighten an audience out of its wits.",
      "author": "Frank Wilkins"
    },
    {
      "text": "A cold, chrome, and suspenseful 'Where's Waldo?' for two hours and five minutes.",
      "author": "Kimberley Elizabeth"
    },
    {
      "text": "With this updated take on the H.G. Wells tale, writer/director Leigh Whannell has done just about everything right, delivering a tense, clever thriller with touches of both horror and sci-fi.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "... more concerned with high-tech gimmickry than emotional investment in those who are, um, visible.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Yes, Adrian appears in his optics suit during the climactic finale, but Moss is the one who dominates every scene. This is her story: a story of trauma and what it means to not be believed, and there's not a breath of exploitation on screen.",
      "author": "Taylor Antrim"
    },
    {
      "text": "Leigh Whannell's nimble reinvention turns the source material on its head. No longer is The Invisible Man a morality tale of a power-hungry lunatic but a hot-take What If? about our truth-is-subjective times.",
      "author": "Stephen Garrett"
    },
    {
      "text": "There have been other Invisible Man movies over the years but this is one of the smartest. It gets its strength from not only what goes bump in the night but also from what we think is going bump in the night.",
      "author": "Rick Bentley"
    },
    {
      "text": "It might deserve some credit for injecting a few doses of effective horror elements into the form of psychological manipulation known as gaslighting, but [it] falls apart at the seams in the thriller's hokey and illogical second half.",
      "author": "Kiko Martinez"
    },
    {
      "text": "So it falls to me to be that guy. The woke critic who points out that the film sadistically brutalizes women for 120 minutes of entertainment in order, ostensibly, to tell us that brutalizing women is bad.",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "[A] film whose smarter points, like its antagonist, ultimately blink in and out of existence before standing, dark and disappointing, and clocking you over the head.",
      "author": "Lena Wilson"
    },
    {
      "text": "...for those who've had any experience with real-life stalkers, consider this your trigger warning.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "The Invisible Man is unsettlingly good as it brings a classic story into the modern era. It's a horror that is all too real, with Elisabeth Moss delivering a commanding performance that'll leave you grasping the edge of your seat.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "A step above what many most likely will be expecting. (Full Content Review for Parents - Violence, Scares, Profanity, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "The major update here to the classic concept of \"dude becomes invisible, is a real jerk about it\" is that it is now framed as a #MeToo allegory. Maybe not the nimblest or nuanced of metaphors, but it mostly works.",
      "author": "Ryan Syrek"
    },
    {
      "text": "The script gives her the space to be vulnerable, to be happy, to be afraid, and Moss seizes all of that, making Cecilia feel well-round and true.",
      "author": "Nick Johnston"
    },
    {
      "text": "Writer/director Leigh Whannell is a seasoned horror filmmaker who understands scaring viewers is about more than just loud bangs and things popping out of the darkness.",
      "author": "Sarah Gopaul"
    },
    {
      "text": "An initially gripping and chilling psychological horror thriller that loses internal logic along with Hitchcockian suspense midway. Slickly edited, overlong and overproduced. Elisabeth Moss gives a convincingly moving performance, though.",
      "author": "Avi Offer"
    },
    {
      "text": "This isn't a film about \"what would you do if you could be invisible?\" It's about domestic abuse.",
      "author": "Chris McCoy"
    },
    {
      "text": "A sleek and sleazy angle that hums like a finely-tuned paperback novel, beefed up into a timely take on throwback terror. Whannell's picture fills the big screen with a new type of spectral fear.",
      "author": "James Clay"
    },
    {
      "text": "Boasting a killer Elisabeth Moss performance, Leigh Whannell's reboot is a clever, suspenseful horror-thriller that suggests the future of the Universal monsters isn't so dark after all.",
      "author": "Brendan Morrow"
    },
    {
      "text": "Whannell, longtime writing collaborator with fellow Aussie James Wan, has a good handle on scary tension... But beyond the film's spooky thrills, he's also working with powerful material.",
      "author": "Piers Marchant"
    },
    {
      "text": "[Writer-director Leigh Whannell] seems more interested in the mechanics of torture than in giving the very real emotional framework of abuse its due.",
      "author": "Jenna Stoeber"
    },
    {
      "text": "Elisabeth Moss is incredible in \"The Invisible Man.\" She plays it very straight, never once hinting that we are in genre territory.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Elizabeth Moss' performance is simply phenomenal. [Full review in Spanish]",
      "author": "Abigail Camarillo"
    },
    {
      "text": "Moss delivers a soul-shattering performance that springs from defensive to vulnerable, from furious to terrified, without being nauseating.",
      "author": "Laura Delaney"
    },
    {
      "text": "The Invisible Man is a thrilling and exhilarating masterpiece of terror, reinventing an iconic horror character to new imaginative lengths.",
      "author": "Amanda Sink"
    },
    {
      "text": "At its center is an excellent performance by Elisabeth Moss... she's really damn good in this movie.",
      "author": "Chris Stuckmann"
    },
    {
      "text": "An intriguing take on a classic that falls short when adhering to traditional conventions of horror",
      "author": "Deirdre Molumby"
    },
    {
      "text": "[Leigh] Whannell employs some nifty fight sequences, and also blends science fiction and horror to hint at how technology can be used by egotistical, business magnates for ill gotten gains.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "Director Leigh Whannell slickly moves the predictable plot along and revels in the cat-and-mouse tricks that can be played by an amoral, invisible aggressor.",
      "author": "Thelma Adams"
    },
    {
      "text": "That rare film in which screen space becomes a living, vital presence.",
      "author": "Robert Horton"
    },
    {
      "text": "\"The Invisible Man\" is a thrilling movie. If nothing else, it will make you question if that feeling you get of being watched is just in your head, or if there really is somebody else in the room.",
      "author": "Weldon B. Johnson"
    },
    {
      "text": "[Elisabeth Moss] gives the kind of performance that, were it not in a horror movie, would get all the nominations and awards",
      "author": "Rain Jokinen"
    },
    {
      "text": "The new version of The Invisible Man has a brilliant concept and an irregular execution. [Full Review in Spanish]",
      "author": "Desirée De Fez"
    },
    {
      "text": "It's a skillfully done combination of good genre writing and inventive special effects.",
      "author": "Alci Rengifo"
    },
    {
      "text": "The small scale of Whannell's film makes its bloodiest flourishes and nastiest jumps hit harder.",
      "author": "David Sims"
    },
    {
      "text": "Crisp cinematography, fierce sound editing...and Moss' captivating performance cause The Invisible Man to leave an indelible impression.",
      "author": "Josh Goller"
    },
    {
      "text": "A sure sign of a good director is someone who is able to create suspense through stillness, camera placement, and careful editing.",
      "author": "Alan Zilberman"
    },
    {
      "text": "This is the first great film of 2020.",
      "author": "Tom Santilli"
    },
    {
      "text": "It's smart enough to take itself seriously, which makes it easy for us to follow suit.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Finally a Universal monster reboot flick worth chattin' about.",
      "author": "Rosalie Kicks"
    },
    {
      "text": "The Invisible Man is an incredibly suspenseful (and scary) psychological thriller. Its timely message about believing women and surviving trauma makes it a Me Too-era classic.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "The Invisible Man is as stylish and smart, as it is terrifying and emotionally charged, which is no easy task with a book over 120 years old.",
      "author": "Dan Tabor"
    },
    {
      "text": "Whannell's direction, as well as his construction of scenes, is, for the most part, of the straight-to-cable variety, taking portentousness for suspense and the illustration of facts for drama.",
      "author": "Richard Brody"
    },
    {
      "text": "A new Invisible Man now moves among us, and he's much, much scarier.",
      "author": "Kurt Loder"
    },
    {
      "text": "No woke lectures, just thrills and suspense until the brutally weak ending.",
      "author": "Christian Toto"
    },
    {
      "text": "It hardly matters that the most invisible element in The Invisible Man is logic. Sloppy narrative, questionable motivations and plot holes... none of that diminishes The Invisible Man from revelling in all its B-movie glory.",
      "author": "Thom Ernst"
    },
    {
      "text": "This is a smart, highly original piece of horror... it's light years away from Cruise bouncing around in zero-gravity during some heavily CGI-ed plane crash.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "This is a genuinely distressing and nerve-racking film, because its very fiber is composed of trauma, pain, and hopelessness.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Moss is very good and there are enough scares in the first half to be entertained.",
      "author": "Rachel Wagner"
    },
    {
      "text": "A tight and compelling thrill ride for horror fans, who shouldn't let this one slip by them unseen.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Leigh Whannell delivers a clever, well-constructed modern adaptation of the classic. A white-knuckle ride about toxic relationships and abuse. Go \"see\" it! [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "The Invisible Man expertly preys on the fears of the modern day, deftly weaving those themes into a story more than a century old.",
      "author": "Steve Katz"
    },
    {
      "text": "The Invisible Man is full of tension and surprise, a brooding midnight movie traumatizer packed with the constant threat of unhinged energy that roars with a crowd.",
      "author": "Mike Mazzanti"
    },
    {
      "text": "... This version feels urgent, necessary even, in the #MeToo era.",
      "author": "Greg Maki"
    },
    {
      "text": "This confident, modern reworking of The Invisible Man owes a lot less to Claude Rains' classic screen monster and much, much more to Alfred Hitchcock.",
      "author": "Wenlei Ma"
    },
    {
      "text": "The concept of an invisible man has been done many times before, but I don't know if it has ever been as effective as it is here.",
      "author": "Scott Menzel"
    },
    {
      "text": "The Invisible Man is one of those great, \"everyone thinks she's crazy but we know she's not\" movies and the frustrations (and stakes) keep mounting as the film goes on.",
      "author": "Max Weiss"
    },
    {
      "text": "Moss's conviction keeps the film compelling, even as it threatens to snap into a standard stalker-horror template -- blaring sound design, faux-Bernard Herrmann strings, an occasionally heavy-handed sense of dread.",
      "author": "Luke Goodsell"
    },
    {
      "text": "It's all pretty marvelous stuff, as much a well-oiled genre machine as it is a respite from big studio bloat, a flick more decidedly horror than any version before and yet another showcase for Elisabeth Moss's herculean prowess.",
      "author": "Dom Sinacola"
    },
    {
      "text": "A very enjoyable surprise full of suspense and technological dread. Absolutely fantastic! [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "As The Invisible Man pivots from horror to social commentary to action and, finally, to revenge, Moss' performance is what holds the entire film together.",
      "author": "Matthew Monagle"
    },
    {
      "text": "Whannell has succeeded by deemphasizing blockbuster effects and engaging with an old monster in a new way. He's created an invisible man for 2020 while still embracing the foundational terrors of 1933.",
      "author": "Scott Tobias"
    },
    {
      "text": "To say The Invisible Man is satisfying seems inadequate; there's something glorious about the film's conclusion, which may feel to some men every bit as horrific as the implications of Florence Pugh's facial expression in the final shot of Midsommar.",
      "author": "Britt Hayes"
    },
    {
      "text": "A chilling reinvention of the old chestnut, and one certainly in tune with the concerns of our time.",
      "author": "Frank Swietek"
    },
    {
      "text": "Leigh Whannell's film is ingenious, frequently scary, and a Grand Guignol tour de force for Ms. Moss. It's also purposeful to a fault as a fable for the #MeToo era.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "I walked out wondering if this is a serious early contender for a Top 10 of 2020 list, in 10 short month's time.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "The film's scares are aplenty as the camera plays the role of the intruder, and the sound design accentuates every creak or bump.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Moss's co-star, the film's score, is terrifying. The director makes an empty kitchen a dreadful place. There will be a sequel.",
      "author": "Victoria Alexander"
    },
    {
      "text": "I do not understand what people see here. It's not an s-f horror hybrid about a scientist desiring God-like power anymore. It's a bad boyfriend film with almost no science in it. Optics, indeed.",
      "author": "James Verniere"
    },
    {
      "text": "Whannell (Saw) does a wonderful job bringing this classic tale into modern times with the use of updated technology.",
      "author": "Allison Rose"
    },
    {
      "text": "[Leigh] Whannell's The Invisible Man doesn't spare the gore nor does it skimp on jump scares. It also doesn't telegraph its every move.",
      "author": "Rebecca Murray"
    },
    {
      "text": "As messy and silly as The Invisible Man gets, however, it still works as a powerful parable of an abuse victim striking back and claiming her own.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "The Invisible Man aims to rise above its B-movie origins and stand alongside horror films that find the balance between entertainment and examination of real problems.",
      "author": "Shelagh Rowan-Legg"
    },
    {
      "text": "Leigh Whannell and Elisabeth Moss do something amazing - they make an invisible man believable.",
      "author": "Chris Bumbray"
    },
    {
      "text": "Though the movie can stretch credibility beyond breaking point, a fearless, up-for-anything performance by Moss prevents everything from snapping.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It's never fair to judge a movie based on what you want it to be. But when that movie sets an explicit goal and then fails to meet it - heck, doesn't even try to meet it - it's open season.",
      "author": "Michael O'Sullivan"
    },
    {
      "text": "The movie has some plot holes, but none so massive that the audience isn't able to fill in the gaps, and it's so engaging that it earns itself enough goodwill for most viewers to not really mind.",
      "author": "Vivian Kane"
    },
    {
      "text": "Buckle your seat for the jump scares, there's a few and it can get intense.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "Everything works perfectly while [the film] develops the psychological terror space. [Full review in Spanish]",
      "author": "Gaspar Zimerman"
    },
    {
      "text": "Leigh Whannell's THE INVISIBLE MAN takes...conversations happening in our society now and marries them to a vividly tense and creepy atmosphere...[for] a stockpile of new possibilities, emotional urgency, and thrilling filmmaking.",
      "author": "Rob Dean"
    },
    {
      "text": "The film achieves its goal of updating an icon. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "The Invisible Man isn't here to shout Believe All Women hashtags from the rooftop and proclaim itself as an ally, it's daring you to look inside yourself and contemplate how much of an ally you really are",
      "author": "Robert Kojder"
    },
    {
      "text": "The reason The Invisible Man holds you in an emotional vise grip for so much of its running time is thanks almost entirely to Moss.",
      "author": "Oliver Jones"
    },
    {
      "text": "Following up his knockout Upgrade, Whannell delivers another tech-infused yet human-scaled, consistently tense genre piece anchored by a terrific lead performance.",
      "author": "Michael Gingold"
    },
    {
      "text": "Whannell - and, apparently, Universal - remembered that the best horror subs a supernatural demon for a real-life variety.",
      "author": "Sean Collier"
    },
    {
      "text": "Conjures lots of creepiness, thanks foremost to star Elisabeth Moss, but this is one of those movies that works better the less time one spends sweating the details.",
      "author": "Brian Lowry"
    },
    {
      "text": "Directed by Leigh Whannell, whose screenplays jump-started the \"Saw\" and \"Insidious\" horror series, it's a sly, twisty little chiller, not ashamed of its B-movie bona fides and better for it.",
      "author": "Ty Burr"
    },
    {
      "text": "Notwithstanding a few screenplay clunkers and narrative contrivances, those who care to look will find The Invisible Man an intelligent and rich piece of work -- one unafraid of its genre trappings.",
      "author": "Christopher Machell"
    },
    {
      "text": "It's ultimately just a fun, nasty, pulpy revenge thriller, but at least it's got some creativity under the hood.",
      "author": "Abby Olcese"
    },
    {
      "text": "Whannell lights a slow fuse in \"The Invisible Man,\" and Moss follows it every step of the way.",
      "author": "Michael Phillips"
    },
    {
      "text": "What writer/director Whannell has done is filter this violent fable through a familiar dressing. He took the basic premise of H.G. Wells' novel and the Universal horror classic, and made them frightening in a brand new way.",
      "author": "Lindsey Romain"
    },
    {
      "text": "Whannell expertly plays with our fears: the sudden metallic screech of a dog dish accidentally kicked in the quiet; the house's labyrinthine hallways; the breathing darkness of an empty road.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Leigh Whannell aces adapting H.G. Wells' nineteenth century novel for the modern #MeToo age as a paranoid thriller, low budget effects à la \"Paranormal Activity\" effecting big chills, Elizabeth Moss excelling as a woman with only herself to turn to.",
      "author": "Laura Clifford"
    },
    {
      "text": "Leigh Whannell's The Invisible Man stretches out a decent horror premise until it's as thin as air.",
      "author": "André Hereford"
    },
    {
      "text": "The Invisible Man puts a wholly fresh and compelling spin on the classic monster, delivering a cleverly scary movie with a fantastic lead performance.",
      "author": "Molly Freeman"
    },
    {
      "text": "[A] mean, handsomely-styled and absorbing thriller.",
      "author": "Tomris Laffly"
    },
    {
      "text": "The Invisible Man gives terrifying shape to an all-too-real villain. It proves that a smart script, committed director, and talented actors can be a far more powerful vehicle for classic horror than a paint-by-numbers franchise reboot.",
      "author": "Hannah Lodge"
    },
    {
      "text": "The movie clenches the imaginary of the abused woman between the memory of 70s revenge stories, the analog esthetic of 90s thrillers, and a new search, focused on Elizabeth Moss' extraordinary expressions. [Full Review in Spanish]",
      "author": "Paula Vázquez Prieto"
    },
    {
      "text": "Whannell makes a wise choice emphasizing the plight of Cecilia, rather than the tired old clichés of an invisible man running amok. It makes it easier for the audience to accept the premise and identify with Cecilia's situation.",
      "author": "Bob Bloom"
    },
    {
      "text": "A golly-whopper psycho-thriller of a horror show that's also a monster movie for the #MeToo movement, a creep show about toxic masculinity and how abused women are often told they're crazy.",
      "author": "Neil Pond"
    },
    {
      "text": "Terrifying, unique, and one of the best horror experiences this year.",
      "author": "Adam Patterson"
    },
    {
      "text": "The Invisible Man reverberates as a bold and thrilling addition to the genre.",
      "author": "Euan Franklin"
    },
    {
      "text": "Elisabeth Moss delivers an outstanding performance as a woman teetering on the edge of reality in this thoroughly engaging reboot.",
      "author": "Linda Marric"
    },
    {
      "text": "A thoroughly modern makeover of HG Wells' idea, with everything geared to generate armrest-clutching moments of suspense and to deliver a fistful of high-voltage shocks designed to jolt you in your seat - and possibly out of it.",
      "author": "Jim Schembri"
    },
    {
      "text": "Moss finds in Cecelia both a vulnerable victim and a fed-up fighter who can outfight and outthink her unseen tormentor, and her performance turns \"The Invisible Man\" into something deeper than a standard horror movie.",
      "author": "Sean P. Means"
    },
    {
      "text": "The Invisible Man does run a little long, and momentarily loses its footing in its final movement, but for the most part confirms that there is a place for Universal monsters in today's dark universe.",
      "author": "James Marsh"
    },
    {
      "text": "Another offering from the Blumhouse factory of sameness.",
      "author": "Brian Orndorf"
    },
    {
      "text": "There's nothing hollow about this man. [Leigh Whannell] has a clear vision, and he executes it with terror-filled grace while also unveiling another superhuman Elisabeth Moss performance.",
      "author": "Preston Barta"
    },
    {
      "text": "This is one screenplay that needed, well, a little more vision.",
      "author": "Sara Stewart"
    },
    {
      "text": "Doesn't quite stick the landing story-wise, but still boasts a phenomenal performance from Elisabeth Moss and more proof that Leigh Whannell has a stellar eye for highly creative and effective scares and action.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "With The Invisible Man, Whannell has reminded us just how effective even the most familiar horror can still be when done right.",
      "author": "Tyler Smith"
    },
    {
      "text": "The Invisible Man interlocks the real-world distress felt by many women, while giving face to the demons men would rather think only exist in handfuls today.",
      "author": "Robert Daniels"
    },
    {
      "text": "It taps into so many primal fears...More akin to a classic psychological thriller than the forgettable horror film that it could have been.",
      "author": "Dan Murrell"
    },
    {
      "text": "Leigh Whannell, who made the wildly entertaining, low-budget action film \"Upgrade,\" has turned the classic science-fiction tale inside out and fashioned it into a tense, suspenseful story about a brutalized woman's journey from seclusion to visibility.",
      "author": "Cary Darling"
    },
    {
      "text": "With devastating specificity and empathy for his heroine, Whannell has inverted the invisible man archetype into an incredibly tense and suspenseful thriller exploring the psychological horror of intimate partner abuse.",
      "author": "Katie Walsh"
    },
    {
      "text": "Leigh Whannell's monster movie works so well because he has such a recognizable monster.",
      "author": "Matt Goldberg"
    },
    {
      "text": "Perfectly-timed horror examining the impact of psychological and domestic abuse, the long shadow it casts, and a particularly recognisable vile strain of masculinity.",
      "author": "Steve Newall"
    },
    {
      "text": "Elisabeth Moss is an acting event all by herself, a modern version of Bette Davis, and \"The Invisible Man\" gives her a chance to embody all kinds of emotional extremes - terror, dread, madness, inconsolable grief and murderous rage.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Leigh Whannell's The Invisible Man draws from multiple Blumhouse catalog influences to ensure a chilling monster remake with ferocity and urgency at its core.",
      "author": "Matt Donato"
    },
    {
      "text": "As ingenious a reinvention of an old film as has been made in the last decade in Hollywood.",
      "author": "Matt Singer"
    },
    {
      "text": "Icy art-horror style, shocking violence, and a smart understanding of the story's acute metaphorical resonance",
      "author": "Andrew Wyatt"
    },
    {
      "text": "Whannell still manages to deliver an impeccably crafted thriller that touches on the lingering effects of trauma, and the catharsis that comes from facing your demons head-on.",
      "author": "Clint Worthington"
    },
    {
      "text": "Moss's full-bore performance - anchored by her extraordinarily supple face - gives the movie its emotional stakes.",
      "author": "Manohla Dargis"
    },
    {
      "text": "The Invisible Man manages to do what many of our greatest horror movies have done before it: address a real-life, everyday nightmare in a heightened, bracing, and even cathartic way.",
      "author": "Allison Shoemaker"
    },
    {
      "text": "The Invisible Man is as thoughtful as it is entertaining, as disturbing as it is frightening, and stays with you after you leave the theater. This is a great film.",
      "author": "Alan Cerny"
    },
    {
      "text": "Move along: there's nothing to see here.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Rare is it that one of the classic tales from the golden age gets a solid re-imagining, but this is one of those times. It's a more intimate story rather than madman wanting to rule the world, and it [mostly] works.",
      "author": "Bill Watters"
    },
    {
      "text": "Moss' intensity is almost too much for the film, which otherwise has a self-conscious B-movie mode, with sparsely dressed sets, expressionistic sound design and few concessions to realism.",
      "author": "Jake Wilson"
    },
    {
      "text": "[Moss] still holds her own as the movie crumbles around her, but her performance deserves better than what Whannell ultimately gives her.",
      "author": "Richard Lawson"
    },
    {
      "text": "A thought-provoking horror-thriller that focuses on the realities of emotional violence and abuse, particularly when it is painstakingly obscured.",
      "author": "Matt Oakes"
    },
    {
      "text": "A seriously potent psychological thriller that maximizes the suspense and violence in ways that leave you breathless. Whannell makes updating a classic look so easy, which is no small feat.",
      "author": "Meagan Navarro"
    },
    {
      "text": "Although too much of the final half-hour feels like a cookie-cutter collage of familiar moments, it delivers an adequate main course for a time of the year in which movies of this genre clog the box office.",
      "author": "James Berardinelli"
    },
    {
      "text": "The film opens by dropping us right down in escape. Cecelia (Moss) is getting away from her abusive Frankenstein-tall monster of a husband (Oliver Jackson-Cohen, scarcely glimpsed in the flesh) by any means necessary. It's electric.",
      "author": "Jason Adams"
    },
    {
      "text": "A smart and satisfyingly nasty piece of work...",
      "author": "Justin Chang"
    },
    {
      "text": "A strong lead performance from Elisabeth Moss and several well-timed scares deliver the frightful goods.",
      "author": "Julian Roman"
    },
    {
      "text": "It's twisty and super tense and, in an age where blockbusters are so full of visual effects, it's miraculous to find one that revels in what's not there.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Moss holds the film together with her deeply committed performance, and in particular with the defeated air that she gives Cecilia, one that's always there under her recovering cheerfulness or displays of brittle defiance.",
      "author": "Alison Willmore"
    },
    {
      "text": "In The Invisible Man reboot Elisabeth Moss is visibly great in the movie that is not only perfectly timed for the #MeToo era, but also resonates far beyond the 1933 horror classic that inspired it.",
      "author": "Pete Hammond"
    },
    {
      "text": "One of the more enjoyable and intense psychological thrillers I've seen in a while.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "\"The Invisible Man\" is riveting. As much a look at gaslighting and trauma as it is a vehicle for a classic Universal monster, it's top notch. Elisabeth Moss is terrific, too.",
      "author": "Joey Magidson"
    },
    {
      "text": "The Invisible Man has done well to reveal some positive light on this dark universe.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "The Invisible Man is a surprisingly modern, fresh take on a classic monster",
      "author": "Mike Ryan"
    },
    {
      "text": "While this isn't the story we're used to, Whannell's The Invisible Man might just be the story we need.",
      "author": "Kate Sánchez"
    },
    {
      "text": "[Elizabeth] Moss... is superb and convincing as a woman suffering from psychological anguish.",
      "author": "Jasmine Lim"
    },
    {
      "text": "Repeat viewings might expose further holes in the story, but Whannell remains a highly skilled genre filmmaker. As for Blumhouse, it's hard to think of another studio that currently knows its audience as well as they do.",
      "author": "Hannah Strong"
    },
    {
      "text": "This edgy psychological horror frays the senses as intensely as anything experienced inA Quiet Place.",
      "author": "Travis Hopson"
    },
    {
      "text": "Why would you want another slavish translation when you have this level of frantic entertainment? An absolute cracker.",
      "author": "Donald Clarke"
    },
    {
      "text": "An intense and at times traumatic viewing experience, The Invisible Man proves once and for all that it's time Hollywood started taking Leigh Whannell very seriously.",
      "author": "Kat Hughes"
    },
    {
      "text": "Leigh Whannell's direction is noticeably sharper than his script, but the film remains a cracking thriller that turns up the tension with suspense, scares, and surprises.",
      "author": "Rob Hunter"
    },
    {
      "text": "This is post-feminist movie feminism. F*** the guy. He is the a**hole bad guy. He doesn't deserve the screen time. All we need to know is how she feels.",
      "author": "David Poland"
    },
    {
      "text": "A suspense thriller so strong that its minor flaws are barely visible. [Full review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "Elizabeth Moss elevates a simplified version of H.G. Wells' classic tale into a higher level of thrills and scares",
      "author": "J. Don Birnam"
    },
    {
      "text": "An enjoyably nervy little slice of psychological horror whose best moments aren't its numerous jump scares (though they are, in fact, extremely jumpy) but the quieter, more existential ones.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "If the weakest part of a suspense/sci-fi/thriller is the science fiction elements, we're all in a world of trouble.",
      "author": "Dwight Brown"
    },
    {
      "text": "Alive with fresh thinking from Whanell and a dynamite Elisabeth Moss, this socially conscious horrorshow tips the old monster mash into way scarier shit about toxic masculinity that's as timely as #MeToo and Harvey Weinstein in handcuffs.",
      "author": "Peter Travers"
    },
    {
      "text": "[Leigh Whannell] has streamlined his ingredients and kept it simple at its core, slowly building out the terror from there, resulting in an all-too-slick, psychological thriller that demands to be seen.",
      "author": "Peter Gray"
    },
    {
      "text": "A slow-moving thriller with too many blank spaces.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Leigh Whannell's bleak and brutal reimagining of the classic Invisible Man is chillingly effective.",
      "author": "Rosie Knight"
    },
    {
      "text": "For an update of a Universal Monster, re-written as a villain who is universally recognizable, this is original, chilling and effective stuff. This Invisible Man is well worth seeing.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "Leigh Whannell's The Invisible Man goes to show that the Universal Monster films can be adapted for modern audiences as long as they are in the hands of the right person.",
      "author": "Shannon McGrew"
    },
    {
      "text": "Effective both with its full-blown horror antics and as a depiction of the real-world abuse one can suffer, Whannell delivers an endlessly unsettling experience.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "'The Invisible Man' wins big by just letting its title monster be a monster through-and-through.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Whannell realizes how much tension he can milk from long, uneasy scenes where Moss is stalking around a seemingly empty room.",
      "author": "Chris Evangelista"
    },
    {
      "text": "Like its style, The Invisible Man's cruelty is the point.",
      "author": "Ed Gonzalez"
    },
    {
      "text": "Delivers Hitchcock levels of tension, suspense and outright terror, and it's just a brilliant direction to go with the character.",
      "author": "Edward Douglas"
    },
    {
      "text": "The Invisible Man is a suspenseful thriller with a modern twist on a classic horror character. Elizabeth Moss steals the show with a haunting yet electrifying performance that will leave the audience on the edge of their seats.",
      "author": "Sharronda Williams"
    },
    {
      "text": "With steady character work banking our investment, Whannell tightens the screws to scare.",
      "author": "Kevin Harley"
    },
    {
      "text": "Unbearably tense and thematically rich, this feels like an entirely fresh take on a 123-year-old story. Which is not something we saw coming.",
      "author": "John Nugent"
    },
    {
      "text": "The Invisible Man addresses its underlying themes... with utmost seriousness and old-fashioned jump-scares; it's a haunted house ride with more on its mind than up its sleeve.",
      "author": "Robbie Collin"
    },
    {
      "text": "Whannell has pulled off a truly arresting, up-to-the-moment take on old material that makes it feel as fresh and new as if it had been conceived today.",
      "author": "Huw Fullerton"
    },
    {
      "text": "A solid thriller with some nifty effects, a bunch of well-earned scares, and a riveting lead performance.",
      "author": "Angie Han"
    },
    {
      "text": "It's a #MeToo horror film that couldn't be any more timely if it shuffled into a courtroom with a Zimmer frame.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "...a triumph... a clever, engrossing and frequently genuinely scary genre flick with a stellar cast and thematic resonance.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "The Invisible Man provides unrelenting tension from start to finish.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Though Adrian's methods grow increasingly menacing (or is it all in her head?), \"The Invisible Man\" lacks for truly terrifying moments.",
      "author": "Jude Dry"
    },
    {
      "text": "There's fun to be had here, thanks to Moss and an involving set-up, and given the state of multiplex horror, especially at this time of year, this is a striking diversion.",
      "author": "Benjamin Lee"
    },
    {
      "text": "Whannell's canny screenplay knows that the audience is well ahead of Cecilia, and the sinister camerawork is on it too. Many a scene finds cinematographer Stefan Duscio's frame listing, with apparent aimlessness, to one side or another. \\",
      "author": "William Bibbiani"
    },
    {
      "text": "Leigh Whannell focuses on just delivering a terrifying horror, and delivers the thrills.",
      "author": "Ian Sandwell"
    },
    {
      "text": "[I]t's an \"Invisible Man\" much more than a maniacal guy in gauze, for the better.",
      "author": "Brian Truitt"
    },
    {
      "text": "Whannell's Invisible Man is a sleek upgrade of his past horror work...",
      "author": "Jesse Hassenger"
    },
    {
      "text": "Not only a genuinely scary movie, but a brilliant sci-fi twist on the fear women too often feel. Leigh Whannell is quickly becoming a master filmmaker, and Moss shines.",
      "author": "Grace Randolph"
    },
    {
      "text": "\"The Invisible Man\" is devious fun, with a message that's organic enough to hit home: that in a toxic relationship, what you see is what you get - but what gets to you is what you don't see.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "[A]s stressed, and distressed, as Cecilia is most of the time, Moss provides a core of inner strength that invites investment in her abilities and, ultimately, belief in her survival.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Paranoid and terrifying, Whannell and Moss bring horror fans a visceral horror pic that does the legacy of the Universal Monsters proud.",
      "author": "Norman Gidney"
    },
    {
      "text": "Led by yet another impressive performance from Elisabeth Moss, 'The Invisible Man' is as thrilling and terrifying as it is shrewdly relevant.",
      "author": "Doug Jamieson"
    },
    {
      "text": "At the heart of what makes The Invisible Man work as well as it does is an ingenious approach to the specific terror that the monster can inspire...",
      "author": "Eric Eisenberg"
    },
    {
      "text": "Writer-director Leigh Whannell, screenwriter of Saw, has evolved into a proper illusionist with his old school yet radical retelling of The Invisible Man.",
      "author": "Simon Miraudo"
    },
    {
      "text": "The Invisible Man is not about what invisibility does to a man, it's about how an abuser can become even deadlier with invisibility. That's a terrifying new perspective.",
      "author": "Fred Topel"
    },
    {
      "text": "This Invisible Man is not entertainment; it's merely a domestic-violence showcase for masochists.",
      "author": "Armond White"
    }
  ],
  "release_year": 2020,
  "duration": 124,
  "genres": [
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "After staging his own suicide, a crazed scientist uses his power to become invisible to stalk and terrorize his ex-girlfriend. When the police refuse to believe her story, she decides to take matters into her own hands and fight back.",
  "popularity": 8.8,
  "poster_url": "https://image.tmdb.org/t/p/original/5EufsDwXdY2CVttYOk2WtYhgKpa.jpg"
}