{
  "movie_name": "The Lion King",
  "movie_id": "mufasa_the_lion_king",
  "total_reviews": 215,
  "reviews": [
    {
      "text": "The circle of life flatlines in this mundane, redundant Lion King prequel which sacrifices charm, heart, and comedy in the pursuit of vanguard visuals.",
      "author": "Nicholas Bell"
    },
    {
      "text": "My enthusiasm for Mufasa was initially low, and it’s only waned with further pondering of its ones-and-zeroes visual non-wizardry and borderline-pointless story.",
      "author": "John Serba"
    },
    {
      "text": "The prequel to one of the most aesthetically barren major films of the last ten years was always going to have a pretty hard time being anything but aesthetically barren in its own right.",
      "author": "Tim Brayton"
    },
    {
      "text": "Uninspired and unnecessary.",
      "author": "Wade Major"
    },
    {
      "text": "It swings back and forth tonally very awkwardly, but there are some thrilling moments and it is Barry Jenkins' usual cinematographer, James Laxton, so it is quite lovely at times. But I wish Jenkins would take his artistry where it is his.",
      "author": "Christy Lemire"
    },
    {
      "text": "Jenkins’ treatment of this story, though he cannot rescue it from middling songs and segments that read as obvious IP management, is alternately sweeping and meditative.",
      "author": "Robert Stinner"
    },
    {
      "text": "Please, PLEASE stop making entire sequels, prequels, remakes and reboots to 'address' things that only YouTube video essayists ever (sort-of) cared about a decade ago.",
      "author": "Bob Chipman"
    },
    {
      "text": "...a welcoming tribute to Disney's very own animation roots, now with digitally generated photorealistic images. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "If someone of Jenkins’s pedigree can’t, with all this budgetary power behind him, best some poster on Elon Musk’s X typing “lions fight on mountaintop epic” into Sora, then Hollywood is truly cooked.",
      "author": "Dominic Griffin"
    },
    {
      "text": "The story is filled with romance and adventures on high cliffs, mountains, in caves, and in a far, fair land. It is in a form called photo realistic animation. It doesn't exactly look real, but it is close, thanks to state of the art digital animation.",
      "author": "Robert Roten"
    },
    {
      "text": "The greatest winner here is Mufasa, a character long-lamented yet underutilized in its previous iterations. Given the time and space to develop his character, this entry is successful in all aspects.",
      "author": "Candice McMillan"
    },
    {
      "text": "...the biggest letdown of the film is that it just brushes through the characters without exploring the emotional dynamics and depth. Barry Jenkins’ Mufasa is enjoyable but nowhere close to The Lion King.",
      "author": "Ganesh Aaglave"
    },
    {
      "text": "If John Favreau had the Herculean task of bringing to tangible life the 1994 animated classic in The Lion King (2019), Barry Jenkins also does a fine job of giving Mufasa his own past, fears, journey, and value system.",
      "author": "Devansh Sharma"
    },
    {
      "text": "The script is safe and unoriginal, the voice talent is passable and while the scenes of the creatures racing through fields and prancing through canyons are fine, the drama peaks in the water bodies and on snow-capped mountains.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "The Hindi dub of Mufasa: The Lion King, at first flush, represents an improbable marriage. But it is one that is made in heaven.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "I'm not a fan of these live action updates, but I really did like this one.",
      "author": "tt stern-enzi"
    },
    {
      "text": "This addition to the Lion King franchise maintains a more than satisfactory standard in all its aspects, but at the same time it feels quite artificial and calculated. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Between its dazzling landscapes and dreamy close-ups, Mufasa is a fitfully stylish, stirring addition to the legacy of one of Disney's crowning glories.",
      "author": "Kevin Harley"
    },
    {
      "text": "Barry Jenkins took this behemoth and it didn't entirely defeat him.",
      "author": "Mark Kermode"
    },
    {
      "text": "What’s missing from Mufasa: The Lion King is that element that makes you wish the ending didn’t have to happen even though you know it will. By the time it happens, it’s less stupefying and feels more like a foregone conclusion.",
      "author": "Damian Levy"
    },
    {
      "text": "A remake of 'The Lion King' was an unnecessary move from a cinematic point of view, but a masterstroke from a business point of view. [Full review in Spanish]",
      "author": "Fran Chico"
    },
    {
      "text": "A visually stunning, occasionally moving, and predictably safe addition to the Lion King universe, this prequel might make you nostalgic for the original—don’t expect it to dethrone it",
      "author": "Troy Ribeiro"
    },
    {
      "text": "Disney’s desire to turn animated films into “live-action” ones should come with a caveat – if characters don’t normally sing and dance, they shouldn’t in remakes, either.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Jenkins handles the source material with such care that Mufasa: The Lion King works as solid entertainment.",
      "author": "M.N. Miller"
    },
    {
      "text": "Everything is virtual animation, but it feels like we are watching a real documentary about African wildlife with animals in action. [Full review in Spanish]",
      "author": "Marcelo Stiletano"
    },
    {
      "text": "Young audiences will have fun following the likable characters and their perilous adventures.",
      "author": "Dwight Brown"
    },
    {
      "text": "My favorite line is from Rafiki: “It is not what you were; it is what you have become.” This important message emphasizes that despite your early circumstances in life, staying true to your values will help you achieve your dreams and shape your future.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "...'Mufasa' has a lot of heart and manages to impress you with its story of Mufasa being an outsider who manages to rise as a leader thanks to his hard work, his skills and the fact that he is a great person. [Full review in Spanish]",
      "author": "Mariló Delgado"
    },
    {
      "text": "The director keeps a firm if predictable hand on the tiller – the action scenes, such as lions trapped in that flooded river and an elephant stampede – are impressive but the script is limp.",
      "author": "Stephen Romei"
    },
    {
      "text": "By adding new emotional layers and untold history, [Jenkins] transforms the familiar into something fresh and compelling.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "Mufasa is a minor success for Jenkins, but that success is only relative. It might be the best the project could have been, but that doesn’t mean it’s worth making.",
      "author": "Leo Brady"
    },
    {
      "text": "Improves on some of the styles that were the focus of criticisms from the previous \"live-action\" adaptation, but ultimately still fails. The songs fall flat, the story is basic, and the movie falls for all of the prequel tropes we've grown tired of.",
      "author": "Matt Hudson"
    },
    {
      "text": "A souless, visual monstrosity that reduces Scar to a guy upset he didn't get the girl. What a waste of a perfect villain.",
      "author": "Amanda the Jedi"
    },
    {
      "text": "It looks good and there's plenty of race-and-chase action against spectacular backdrops but less childhood trauma and more meerkat, plus a terrific score like the classic original, would have made this way more engaging",
      "author": "Jane Freebury"
    },
    {
      "text": "The breathtaking photorealistic animation is a visual treat, but the overly melodramatic plot may leave viewers feeling as though they are watching The Godfather rather than The Lion King.",
      "author": "Devesh Sharma"
    },
    {
      "text": "Mufasa: The Lion King would have been perfect if its characters had fewer lines, and if the songs were in the background rather than emerging through the mouths of clearly computer-generated figures.",
      "author": "Nandini Ramnath"
    },
    {
      "text": "‘Mufasa: The Lion King’ is an unnecessary prequel, but the music and ambitious production should please devoted fans.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "It's watchable and sometimes involving, but there's a problem with this kind of imagery, which uncannily looks like live-action but also clearly isn't.",
      "author": "Rich Cline"
    },
    {
      "text": "The film’s photorealistic CGI is nothing short of breathtaking, capturing emotive expressions and intricate details that deliver awe-inspiring, heartwarming, and nail-biting moments.",
      "author": "Dhaval Roy"
    },
    {
      "text": "Mufasa the Lion King is slightly better than the 2019 remake, but on its own, it’s an animated feature that is almost good, but not enough to feel like the experience was fully worthwhile.",
      "author": "Mat Brunet"
    },
    {
      "text": "Beautifully rendered (this is by far the best live-action/animated film I’ve ever seen)",
      "author": "Michael A. Smith"
    },
    {
      "text": "Barry Jenkins' intricate vision shines through, though it occasionally feels restrained by studio constraints. Yet, the film perseveres with a noble heart, delivering a genuinely enjoyable experience.",
      "author": "Gabriela Meza"
    },
    {
      "text": "The prequel “Mufasa: The Lion King” has a root problem: it is unnecessary, despite director Barry Jenkins' best efforts. [Full Review in Spanish]",
      "author": "Aglaia Berlutti"
    },
    {
      "text": "If reality is what we want, we have it in front of us, or a nature documentary, or a photograph. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "What proves much more interesting, and reminiscent of director Barry Jenkins’ earlier work, is the exploration of masculinity through the relationship between Mufasa and Taka.",
      "author": "Gemma Creagh"
    },
    {
      "text": "Had this been released in 2D animation back in the 1990s as a sequel to the original it would have been perfectly servicable entertainment for toddlers and pre-teens, but Disney’s creativity is clearly wearing thin with this one.",
      "author": "Lucas Hill-Paul"
    },
    {
      "text": "Maybe this reads like we’re making excuses, but it feels like the main issues with the film fall beyond Jenkins’ purview as a director...",
      "author": "David Jenkins"
    },
    {
      "text": "…given that the 2019 Lion King was a huge success, this prequel/sequel should ensnare part of the same audience, but it’s a big step down from the original remake...families are more likely to dig Sonic 3 than this rather inessential, pompous rehash….",
      "author": "Eddie Harrison"
    },
    {
      "text": "Ultimately, a more or less adequate Disney prequel is a waste of the gifts of a director who has poetry in his heart and other, more important stories to tell.",
      "author": "Wendy Ide"
    },
    {
      "text": "In emulating reality, Mufasa fails to conjure up compelling fictional drama.",
      "author": "Lisa Laman"
    },
    {
      "text": "Compared to Disney’s slavish recent remakes of The Lion King, The Jungle Book, and even The Little Mermaid, this movie offers up a lot more food for thought because of its original story",
      "author": "Kristian M. Lin"
    },
    {
      "text": "Although there are praiseworthy elements to Barry Jenkins’ venture into the series and children will almost certainly lap it up with the enthusiasm reserved for favorite franchise installments, the stench of lucre permeates the project.",
      "author": "James Berardinelli"
    },
    {
      "text": "Mufasa doesn’t offer the iconic character a story worthy of his eminence.",
      "author": "Maureen Lee Lenker"
    },
    {
      "text": "This is not a terrible movie by any means, just a bland addition to a very good story.",
      "author": "Alci Rengifo"
    },
    {
      "text": "The main lesson of Mufasa is a far less generative one: Even the most talented director can’t make someone else’s unoriginal idea shine.",
      "author": "Hannah Giorgis"
    },
    {
      "text": "Mufasa: The Lion King a hit with younger viewers, but anyone looking for something more will see another lifeless chapter in Disney’s quest to mine its own history.",
      "author": "Victoria Luxford"
    },
    {
      "text": "Mufasa: The Lion King is a visual improvement over the unimaginative 2019 live action remake but ultimately treads similar waters.\n\nWhile it’s by-the-numbers narratively, and the songs are a far cry from the original, there are some entertaining moments.",
      "author": "Sheraz Farooqi"
    },
    {
      "text": "It may not reach the heights of Disney classics of yesteryear, but 'Mufasa: The Lion King' is a movie worth watching for the clear attempt to turn it into something it could never have been.",
      "author": "Francisca Tinoco"
    },
    {
      "text": "It is technically impressive, as there is no denying how well-animated each animal is... Barry Jenkins attempts to deliver captivating character moments, but you feel at arms length throughout most of its run-time, and the pacing is all over the place.",
      "author": "Austin Burke"
    },
    {
      "text": "I’m glad Barry Jenkins got his bag, though.",
      "author": "Rendy Jones"
    },
    {
      "text": "Despite earnest found family themes and visually beautiful animation, prequel Mufasa feels like an unnecessary instalment which disappointingly conflicts with the wider Lion King mythos.",
      "author": "Nicola Austin"
    },
    {
      "text": "Newcomers will understand what is happening plotwise but will certainly not get as much out of that as those who live and breath the characters and relationships of the original films.",
      "author": "David Griffiths"
    },
    {
      "text": "Mufasa: The Lion King dazzles with impressive visuals but struggles to deliver the emotional depth and storytelling magic of its predecessor, leaving a hollow experience for audiences.",
      "author": "Nelson Acosta"
    },
    {
      "text": "The animated musical Mufasa: The Lion King delivers the expected eye-catching visuals, but the story, dialogue, and songs are underwhelming and tedious. This disappointing prequel lazily copies the formula of other Lion King films.",
      "author": "Carla Hay"
    },
    {
      "text": "A marked improvement from the \"dead eye\" version of 2019, this critic-proof film amps up the adventure and atmosphere. Timon and Pumbaa need their own film. while Disney took no risks in storytelling and themes, The Lion King is the Monarch of Animation.",
      "author": "Patrick McDonald"
    },
    {
      "text": "Jenkins isn’t afraid to allow his animals to take on a few human qualities. He sacrifices perfection to achieve emotional expression. The filmmaker tackles this prequel as if it were an animated film and, even better, Disney allows him that freedom.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "The story in Mufasa: The Lion King is a big improvement over The Lion King (2019).",
      "author": "Korey Coleman"
    },
    {
      "text": "While they are very good, the visuals, pacing and music are not strong enough to distract from a weak script.",
      "author": "Rick Bentley"
    },
    {
      "text": "Not bad, but it doesn’t add anything to what’s already known and loved.",
      "author": "Tom Meek"
    },
    {
      "text": "The rubbery expressiveness of traditional animation is replaced by the feeling of a nature documentary where the narrator’s attempt to graft human emotions onto wild animals never quite feels like it takes.",
      "author": "Sam Adams"
    },
    {
      "text": "Mufasa is not a bad choice for a holiday-season matinee with the grandkids, but it’s far from the pride of the Disney jungle.",
      "author": "Thom Geier"
    },
    {
      "text": "With breathtaking visuals, powerful performances, and a vibrant score by Lin-Manuel Miranda, this cinematic experience is best enjoyed in immersive 3D.",
      "author": "Lupe Rodriguez Haas"
    },
    {
      "text": "The circle of life goes on, and on, and on in \"Mufasa: The Lion King,\" a needless furthering of \"The Lion King\" mythos which treads the same waters as this story has already traversed.",
      "author": "Adam Graham"
    },
    {
      "text": "“Mufasa,” under Jenkins’ poised and creative direction, proves there is still plenty of life left in the long-reigning “King.”",
      "author": "Soren Andersen"
    },
    {
      "text": "Director Barry Jenkins brings his dynamic direction and camerawork to this film, which is visually beautiful but can't overcome the lack of its unessential backstory.",
      "author": "Meredith G. White"
    },
    {
      "text": "I guess the film’s OK, but it doesn’t really know what it’s about, and it somehow still manages to get a little preachy at the end.",
      "author": "Collin Garbarino"
    },
    {
      "text": "Every movie, every song doesn’t have to be an Oscar contender. With its endearing CGI and its warm spirit, Mufasa: The Lion King is just fine for the kiddos just as it is.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "“Mufasa” at least has the grace to offer audiences a fresh story, but children and parents may find it surprisingly difficult to tell one exquisitely rendered lion from the next.",
      "author": "Ty Burr"
    },
    {
      "text": "It’s solid craft, but craft wedded to a style of filmmaking that feels wholly impersonal, even with a top-flight director at the helm.",
      "author": "Michael Phillips"
    },
    {
      "text": "The overall results are generally pretty, mildly diverting, at times dull and often familiar, despite a few unusually sharp, brief departures from Disney’s pacifying formula.",
      "author": "Manohla Dargis"
    },
    {
      "text": "All the technological marvels of the world can’t breathe life into a film that doesn’t know what it wants to be.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Kiara and Mufasa, past and future, remind us of the meaning of the cycle of life. [Full review in Spanish]",
      "author": "Paula Pardo Luz"
    },
    {
      "text": "Barry Jenkins barely manages to salvage the bare minimum in a new hyperreal and rather incomprehensible extension of Disney's immortal feline myth. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "Jenkins puts all this across with sensitivity and what feels like a gentle confidence.",
      "author": "Tom Gliatto"
    },
    {
      "text": "Blue Ivy, daughter of Jay-Z and Beyoncé, also made her mark in the role of Kiara. Despite the pressure of being the child of two music icons, she proved her talent by bringing levity and humor to the character.",
      "author": "Kathia Woods"
    },
    {
      "text": "Director Barry Jenkins, using breathtaking CGI animation that looks so real everything looks touchable, has gone beyond just laying the groundwork for the stories to follow.",
      "author": "Rick Romancito"
    },
    {
      "text": "Decent, if unexceptional given the talent involved",
      "author": "Chris Bumbray"
    },
    {
      "text": "[Jenkins] expands the scope and range of this world, offering up a story that exists in the realm of “The Lion King” but doesn’t retread on old material (or desecrate it).",
      "author": "Katie Walsh"
    },
    {
      "text": "It doesn't even look as good as the 2019 film. The story is a bore",
      "author": "Rachel Wagner"
    },
    {
      "text": "Mufasa: The Lion King is a film struggling to find a reason to be here, and despite the best efforts of its director, it never truly does.",
      "author": "Matthew Razak"
    },
    {
      "text": "If you see one 2024 blockbuster prequel by a visionary filmmaker with a title ending with “sa”… make sure it’s the one with Anya Taylor-Joy.",
      "author": "Jack Martin"
    },
    {
      "text": "This the film’s biggest failing: it pulled a gifted storyteller out of circulation for nearly four years. Just think about the films we could have had in that time.",
      "author": "Nate Adams"
    },
    {
      "text": "Mufasa: The Lion King feels narratively flat, which is too bad, considering that the characters seem so much more alive this time.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Nobody looks into the camera to reveal their soul quite like the characters of a Barry Jenkins’ film do. Even CGI cats.",
      "author": "Pat Mullen"
    },
    {
      "text": "It stands on the shoulder of its predecessor, reaching new emotional heights and roaring with technical prowess. Does it leave a mark like the 1994 classic? No, but who wants to split hairs when you can just sing \"Hakuna matata\"? [Full Review in Spanish]",
      "author": "Nestor Bentancor"
    },
    {
      "text": "When the tribute to James Earl Jones at the start of the film carries more weight than the film itself, there's a problem.",
      "author": "Tom Santilli"
    },
    {
      "text": "To paraphrase a better song from a much better movie, Mufasa fails to find its place “on the path unwinding in the great circle of life.”",
      "author": "Jeffrey Harris"
    },
    {
      "text": "Mufasa: The Lion King will be the outlier in the filmography of one of the most talented filmmakers of his generation.",
      "author": "Eric Marchen"
    },
    {
      "text": "Despite the stunning visuals and music, this film explains the generations of this pride with silly banter and an uneven script. Now that we’ve seen the prequel, we’d like to see the next Circle of Life sequel with a better story that can roar once more.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "With gorgeous animation and a story about destiny, family, and the circumstances that shape us into who we are, Mufasa is an empathetic tale that was made by creatives who love the original film as much as you do.",
      "author": "Serena Seghedoni"
    },
    {
      "text": "The visuals and the action scenes are duly impressive, but the songs tend to bog things down and the violence may be too intense for young kids.",
      "author": "Russ Simmons"
    },
    {
      "text": "Thankfully, the movie does prove its worth with an excellent selection of exciting and inventively shot chase scenes and fight sequences, all of which serve to build the Mufasa character into a truly admirable screen hero.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The more we got into the story, the more it felt like it was forced to connect the dots to what we know of the original The Lion King. Taka's reason for turning villain was a complete letdown. The songs were, unfortunately, forgetful.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "This visually stunning but timid prequel is a triumph of computer programming, receiving a passing grade because of the emotional depth at its core.",
      "author": "John Lui"
    },
    {
      "text": "Although the story attempts to delve deeper into the hostility between Mufasa and Scar, stemming from a betrayal, narrative errors and information overload make it difficult to fully understand. [Full review in Spanish]",
      "author": "Laia Cabuli"
    },
    {
      "text": "Mufasa: The Lion King is a roaring triumph, a prequel that doesn't just rehash the old but adds something truly special to the Lion King legacy. It's not flawless, but it beats the 2019 remake paws down.",
      "author": "Nathaniel Fetalvero"
    },
    {
      "text": "Despite Jenkins’ skill in regulating the pace, this one has a repetitive feel to it. Enough is enough.",
      "author": "Sandra Hall"
    },
    {
      "text": "With its ho-hum action scenes and lowbrow comedy, “Mufasa” is as tired as the lion in the movie whose sole ambition is to nap in the sun.",
      "author": "Kyle Smith"
    },
    {
      "text": "Mufasa: The Lion King is quite a sour experience, almost running cold even with its attempts at crafting heartfelt and charming moments, most of which feel like manipulation upon faux emotions.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "“Mufasa” is fine and most families will be satisfied. But the jubilant imagination that went into the original make this one look as pale as Kiros.",
      "author": "Nell Minow"
    },
    {
      "text": "For anyone who may want something more than a version of nostalgia, especially from a visionary director like Jenkins, it serves as nothing more than two hours of pretty vistas.",
      "author": "Alex Bentley"
    },
    {
      "text": "The visual effects are incredible; there were so many luminous shots and camera angles. Ultimately, and unfortunately, Jenkins was hamstrung by the literal title and premise of the story.",
      "author": "Brooke Obie"
    },
    {
      "text": "Though it’s a visual feast...as a story it’s not imaginative or captivating enough to live up to the 1994 original.",
      "author": "Frank Swietek"
    },
    {
      "text": "Mufasa doesn’t quite manage to break free from Disney’s usual style, but it’s certainly an improvement.",
      "author": "Maria Lattila"
    },
    {
      "text": "The vocal talent in Mufasa: The Lion King is exceptional, with many actors reprising their roles from the 2019 live-action The Lion King.",
      "author": "Allison Rose"
    },
    {
      "text": "The company’s zeal for prequels has resulted in a movie about two kittens who we’ve all seen meet a grisly death. To my morbid delight, “Mufasa” starts off by killing one of them again.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Overall, is Mufasa: The Lion King an unnecessary prequel? Yes. Will it make a ton of money? Absolutely. Is it better than its predecessor? By a significant margin.",
      "author": "Shakyl Lambert"
    },
    {
      "text": "Mufasa: The Lion King might not become a beloved classic like the original animation but Barry Jenkins and company bring their best efforts.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Instead of being enhanced by the endless possibilities of CGI, Mufasa: The Lion King feels limited by it. It’s filled with visual tricks courtesy of the computer animation but there’s very little magic.",
      "author": "Richard Crouse"
    },
    {
      "text": "Lacking a creative spark, this misfire is a generic, dull and soulless attempt to go back to the familiar Shakespearean theme, with Biblical roots, to rehash family bonds and destiny. Yawn.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "The pacing is continually interrupted by lengthy, largely unnecessary musical numbers that add little to the film aside from length...Still, it rings enough bells to please Lion King fans and ensure that Disney’s quest for reputational recovery continues.",
      "author": "Jim Schembri"
    },
    {
      "text": "It's not really a problem that the title character is the most boring character in the film, though it does give the story the air of political propaganda: Mufasa was the best at everything, which is why he was the best choice for king",
      "author": "Anthony Morris"
    },
    {
      "text": "There’s only so many times you can go back to the well or what made another movie successful before you have to try and make yours stand alone.",
      "author": "Terence Johnson"
    },
    {
      "text": "Jenkins might have been an inspired choice of director — and he’s approached the project with an admirable degree of sincerity — but even he can’t quite wrestle this film away from its creative redundancy.",
      "author": "Luke Goodsell"
    },
    {
      "text": "Jenkins does the best he possibly can with this material. I just wish he had directed something, anything else.",
      "author": "Stephen Silver"
    },
    {
      "text": "Despite the impressive team of visual effects artists bringing slightly more life and personality to the character models under Barry Jenkins' direction, this is a rushed, overstuffed, weightless, joyless, nostalgia-pandering photorealistIc prequel",
      "author": "Robert Kojder"
    },
    {
      "text": "Visually stunning and well-cast, this prequel delivers enjoyable moments but lacks the timeless magic of the 1994 original.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "Mufasa: The Lion King is an improvement over the 2019 film with an engaging story that isn’t a remake and a more emotive facial animation of the animals.",
      "author": "John Nguyen"
    },
    {
      "text": "Despite its convincing photorealistic look, the film serves as an unconvincing origin story and lacks cultural sensitivity. The script reads like a mean-spirited swipe at Osamu Tezuka.",
      "author": "Jana Monji"
    },
    {
      "text": "Absolutely better than its 2019 predecessor; from stunning animation giving emotion to the animals, to breathtaking sequences presenting a bright, beautiful savanna. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "It isn’t a bright display of originality. However, it’s a more active, action-y, and emotive movie.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Many of the flaws of its predecessor have been corrected in “Mufasa: The Lion King,” and while the film isn’t necessarily a masterpiece, it’s at least superior to something like “Moana 2.” Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "A step up from its predecessor even if it still feels like something is missing…\n\nVisually beautiful (as to be expected) & some powerful themes that I think Barry Jenkins just nails every single time + Some fun moments.\n\nLiked but didn’t love",
      "author": "Zach Pope"
    },
    {
      "text": "… does more to enhance and enrich its predecessor than most Disney remakes, helped by its cultural framework that emphasises the importance of history and storytelling, giving its existence a purpose beyond mere copyright milking …",
      "author": "Cain Noble-Davies"
    },
    {
      "text": "A visually stunning spectacle, but often dull and emotionally hollow.",
      "author": "Avi Offer"
    },
    {
      "text": "Mufasa: The Lion King's impressive CGI can't make up for a plodding pace, predictable story, and worst of all, not one memorable song to inspire sing-alongs.",
      "author": "Julian Roman"
    },
    {
      "text": "The film, unbound by having to recreate large swaths of the original Lion King whole cloth, was clearly allowed to be a product of its director.",
      "author": "Justin Clark"
    },
    {
      "text": "The film never becomes overly preachy; there are laughs and action amidst the challenges and, of course, songs too.",
      "author": "Harry Guerin"
    },
    {
      "text": "Jenkins ability to explore some pretty weighty and sophisticated themes with compassion and clarity in the midst of a Disney blockbuster makes it stand out.",
      "author": "Alistair Harkness"
    },
    {
      "text": "When I ponder great animated films, I think of memorable songs, funny characters, and heartwarming stories that teach a valuable lesson. Unfortunately, Mufasa: The Lion King doesn't possess any of these qualities.",
      "author": "Joseph Robinson"
    },
    {
      "text": "Barry Jenkins' prequel is better than Jon Favreau's Lion King' remake and closer in spirit to Disney's \"better than they need to be\" mid-2010s tentpoles (like Jon Favreau's 'Jungle Book') than their recent nostalgia-chasing, culturally timid rehashes.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Mufasa: The Lion King is enjoyable enough to catch if you are a child or child at heart. If skipped over in favour of other holiday entertainment, you will not be missing a masterpiece.",
      "author": "Grant Watson"
    },
    {
      "text": "There is a reason that Disney has been so overly fussy about this film even though it is easily the best made, most beautiful, most visually engaging CG-Live-Action film in the entirety of filmed entertainment history to date.\n\nIt ain’t The Lion King.",
      "author": "David Poland"
    },
    {
      "text": "Yes, it’s a family movie, but it feels too safe. \"Mufasa: The Lion King\" should have taken bigger risks and made daring moves with doing something completely new with this universe.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The expensive, and incredibly lifelike CGI animals bely a very simple, and at times rather boring story about how one noble guy becomes even nobler and one bad guy becomes badder thanks to an even worse guy – but they're lions.",
      "author": "Paul Klein"
    },
    {
      "text": "The animals look startlingly alive (although it's a lot weirder to see 'real' animals break out in song than animated ones), the 'dead eye' problem mostly resolved....a step up from its predecessor..",
      "author": "Laura Clifford"
    },
    {
      "text": "This series of unfortunate events raises more questions than it answers.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Mufasa: The Lion King is constantly scratching at a story that could be so much more. The limitations in story, technical ability, character, and direction consistently pull the film down to only show small displays of its actual potential.",
      "author": "Carson Timar"
    },
    {
      "text": "The lion king’s character design proves to be the most rewarding aspect, as he almost effortlessly exhibits noble traits, guided by an unfaltering moral compass that adults can appreciate just as much as children.",
      "author": "Mike Massie"
    },
    {
      "text": "Getting out from the shadow of the '94 classic, It moves more freely, taking risks that the '19 remake couldn't, while remaining rather derivative. It's probably the soft remake we should've got first go round.",
      "author": "Dave Lee"
    },
    {
      "text": "At its best, Mufasa takes you on a journey that resonates with universal themes of growth, responsibility, and familial bonds. The emotional gravity and facial expressions overall is significantly better in this film than its predecessor in every way.",
      "author": "Elliott Collins"
    },
    {
      "text": "A disaster on pretty much every level.",
      "author": "Sean Burns"
    },
    {
      "text": "The music in Mufasa:The Lion King, doesn't feel like Lion King music... aside from that, it doesn't stand out as anything special.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "...a profoundly awful movie.",
      "author": "Alan Ng"
    },
    {
      "text": "The film will likely make its audience, adults and kids alike, cry, laugh, and gasp as it entertains them with some new favorite songs and whirls them away with a grand spectacle worthy of Mufasa, the Lion King.",
      "author": "Rotem Rusak"
    },
    {
      "text": "Jenkins is restricted by both the technological demands of the computer-generated talking animals and the studio mentality that puts storytelling a distant second to corporate brand management.",
      "author": "Sean P. Means"
    },
    {
      "text": "Jenkins is the kind of talent who can turn his hand to almost anything and Mufasa is a respectable film as a result.",
      "author": "Christina Newland"
    },
    {
      "text": "Mufasa, if nothing else, ought to be a searing indictment of the choices great independent filmmakers are left with in the modern creative ecosystem. Now, [Barry Jenkins] can add a \"just okay\" bit of turn-your-brain-off tedium to his résumé. Hakuna matata",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Jenkins manages to overcome artistic pitfalls to craft a gorgeous, engaging tale of brotherhood, privilege, and sibling rivalry in the wild.",
      "author": "Travis Hopson"
    },
    {
      "text": "Mufasa: The Lion King is a triumphant and heartfelt prequel that expands the Lion King legacy with emotional depth and thrilling storytelling.",
      "author": "Emmanuel Noisette"
    },
    {
      "text": "There's some heart to this one and they've made some big improvements following the 2019 remake.",
      "author": "Eric Goldman"
    },
    {
      "text": "While Mufasa doesn't reinvent the wheel, it's an engaging prequel that connects well to The Lion King. Predictable but visually beautiful, it's a worthy family-friendly film.",
      "author": "Jason Escamilla"
    },
    {
      "text": "Jenkins’ knack for eliciting deep emotion and visual wonder remains sharp, especially when bolstered by Aaron Pierre and Kelvin Harrison Jr.’s delightful voice work.",
      "author": "Robert Daniels"
    },
    {
      "text": "We tell ourselves stories in order to live. Corporate movie studios tell you stories in order to keep their board happy and make their bottom line. Find the Venn diagram center between the two, and that’s where this Hakuna Matata 2.0 lies.",
      "author": "David Fear"
    },
    {
      "text": "Mufasa: The Lion King is a boring and ugly prequel to an already terrible remake with nothing new to say - more corporate drivel from a film studio that desperately needs to go back to making original content.",
      "author": "Cole Groth"
    },
    {
      "text": "I would have much preferred an original work from Jenkins, but even when making something that feels anonymous next to his earlier films, it has far more personality than most of Disney's recent live-action output.",
      "author": "Alistair Ryder"
    },
    {
      "text": "Mufasa: The Lion King shines brightest whenever it carves its own path, a worthy reflection of the struggles faced by its titular character.",
      "author": "Andrew Parker"
    },
    {
      "text": "Mufasa: The Lion King took all the notes and returns with new mythology, a hero’s tale, that sings to the legends of the original movie and the Broadway musical. Honestly, it shocked me.",
      "author": "Sherin Nicole"
    },
    {
      "text": "Children will love it, and hopefully its message of loyalty, family bonds, working together and appreciating those who are different from yourself will sink in.",
      "author": "G. Allen Johnson"
    },
    {
      "text": "The Lion King remake ruined what was previously established as a great story. Mufasa only ruins its own derivative story, so it's not as bad.",
      "author": "Fred Topel"
    },
    {
      "text": "Mufasa: The Lion King could have been a very great and worthy ‘Lion King’ successor, but thanks to the perceived requirements of what this franchise demands, it’s only just a good one, which is a shame, given its regal and majestic potential.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Visually stunning masterpiece, blending breathtaking animation with a deeply heartfelt story that honors the legacy of one of our most beloved characters",
      "author": "Nagier Chambers"
    },
    {
      "text": "Do the ultimate results of Mufasa: The Lion King justify the fact that one of film’s great talents was taken out of the game for almost half a decade? Not especially, no.",
      "author": "Barry Hertz"
    },
    {
      "text": "Barry Jenkins crafts some inspired visuals in trying to adapt to photorealism, but the animals are still a bit too uncanny. This leads to a prequel that's just okay and won't win over any new fans. At least some of Lin-Manuel's new songs are catchy!",
      "author": "Andrew J. Salazar"
    },
    {
      "text": "Could the Moonlight director find new avenues to explore that would better exemplify what’s possible with these digital recreations of hand-drawn hits? The good news is that Mufasa, warthogs and all, is a solid step in the right direction.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "If the intention was to distract younger audience members with some inoffensive and well-meaning adventure, the movie delivers. It’s a shame Jenkins wasn’t able to personalise it more, but, as they say, that’s just the nature of the beast.",
      "author": "Dan Jolin"
    },
    {
      "text": "While Nicholas Britell turns in a good musical score, and there are a few moments that work, Mufasa: The Lion King can’t help but be a mixed bag, uneven at times, and filled with songs you won’t remember too well.",
      "author": "Jonathan Sim"
    },
    {
      "text": "There is a glimmer of something wonderful in Mufasa... There’s just too much working against it, from the flat animation and subpar songs to the preordained fate that awaits both characters.",
      "author": "Petrana Radulovic"
    },
    {
      "text": "There is little character, no visible emotion, just endless show-offy technical competence.",
      "author": "Donald Clarke"
    },
    {
      "text": "The film, directed by Barry Jenkins, is touched with a spot of leonine laryngitis. Hard as it tries, it never quite roars.",
      "author": "Brian Viner"
    },
    {
      "text": "The CG images still impress, and there are gripping moments during the film’s second half as the insecure Mufasa embraces his destiny. But like too many origin stories, Mufasa often rehashes what was once stirring about this material.",
      "author": "Tim Grierson"
    },
    {
      "text": "It's no Hakuna Matata... And it's far from Jenkins' best work, but in any other hands, a lot of Mufasa's intentions would have completely misfired. Thankfully there are some stellar vocal performances and VFX – but it could have been so much better.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "That manic script is carefully paced out; the so-so songs given vivid staging. And there are moments of fun and even wonder for the children for whom the film has really, and rightly, been made.",
      "author": "Danny Leigh"
    },
    {
      "text": "Disney has gone back to the drawing board with this dazzling animated musical, a film that matches photorealistic spectacle with hummable earworms and, mostly, a genuinely mythic sense of story.",
      "author": "Kevin Maher"
    },
    {
      "text": "I don’t think Jenkins collecting a paycheck... is a bad thing in the grand scheme of things. There just wasn’t much to be done with a story where the protagonist’s fatal flaw is that he’s the best Lion King to ever do it.",
      "author": "Evan Dossey"
    },
    {
      "text": "Unfortunately, finding the Jenkins in Mufasa is like putting a blindfold on in the Louvre and trying to feel your way to the Mona Lisa.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "While Mufasa is never as actively depressing as 2019’s Dumbo or 2022’s Pinocchio, the exercise has perhaps never felt as craven or pointless as it does here.",
      "author": "Robbie Collin"
    },
    {
      "text": "“Mufasa: The Lion King” is better than the ones that came before it, but that doesn’t mean it’s great.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "Disney knows how to tug a heartstring, of course, and “Mufasa” won’t leave you dry-eyed. Still, despite the high-resolution visuals, it’s hard to fully embrace these digital animals.",
      "author": "Rafer Guzman"
    },
    {
      "text": "This brings out the worst of modern-day Disney; the jokes aren't funny, the visuals are lackluster, and we are missing what made these stories initially work.",
      "author": "EJ Moreno"
    },
    {
      "text": "Even with a few flaws, Barry Jenkins' Mufasa: The Lion King has enough heart and depth to stand on its own feet and surpass its 2019 predecessor.",
      "author": "Rachel LaBonte"
    },
    {
      "text": "Mufasa: The Lion King is part of a long chain of movies ruined by the errant belief that IP is king. It betrays its own moral: Bloodlines and lineages are not what make things great.",
      "author": "Jason Flatt"
    },
    {
      "text": "Thanks to Jenkins’ inimitable grace and Miranda’s tuneful swagger, it continues to feel vibrant.",
      "author": "Brian Truitt"
    },
    {
      "text": "The voice work from the outstanding cast is rich and warm and vibrant, and while the songs from the great Lin-Manuel Miranda (with Lebo M. making valuable contributions) might not make for a generational catalog, they’re still infectious and clever.",
      "author": "Richard Roeper"
    },
    {
      "text": "All in all, this is not a bad tale from the Disneyfied continent of talking animals, but a minor cousin to the first film’s movie-royalty.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "To bring up an issue that arose when Joaquin Phoenix flaked on Todd Haynes’ latest project — is this any way to spend two years of an artist’s prime period?",
      "author": "Alonso Duralde"
    },
    {
      "text": "Though James Earl Jones is impossible to follow, these voice actors give it all a game try.",
      "author": "Pete Hammond"
    },
    {
      "text": "With a solid gang, Mufasa conforms to a typical journey of misfits. But that charm from the early scenes is lost with the addition of each new plot point.",
      "author": "Lovia Gyarkye"
    },
    {
      "text": "“Mufasa” never quite bursts free of the constraints placed upon it, but those constraints never stop it from moving, or from being moving.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "While it's not as unrestricted and original as a filmmaker like Jenkins is capable of, Mufasa: The Lion King has enough woven in there that will serve families this holiday season, even if it may not resonate with all of Jenkins' usual audience.",
      "author": "Billie Melissa"
    },
    {
      "text": "Jenkins has not sold out; rather, the studio bought into his vision, which respects the 1994 film and recognizes the significance that its role models and life lessons have served for young audiences.",
      "author": "Peter Debruge"
    },
    {
      "text": "A visually stunning but narratively surface-level prequel/sequel hybrid.",
      "author": "Casey Chong"
    },
    {
      "text": "The takeaway ultimately has less to do with the characters or story at hand than the resources: What tremendous volume of them have gone into making the worst Barry Jenkins movie! And to avoid thinking of or paying for an all-new cartoon!",
      "author": "Jesse Hassenger"
    },
    {
      "text": "An improvement over the live-action 2019 film in almost every way (except new songs), Mufasa: The Lion King is a solid prequel that expands the franchise's legacy and further develops its beloved characters. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "The idea of a movie centered around Mufasa was both confusing and intriguing. Yet what Mufasa: The Lion King does is use our culture love of the original film and give us a new perspective on it. A real Lion King classic move if you ask me.",
      "author": "Rachel Leishman"
    },
    {
      "text": "Looks absolutely glorious with a soundtrack to match, which helps it to overcome any of its earlier story problems.",
      "author": "Edward Douglas"
    },
    {
      "text": "Seeing how Mufasa from \"The Lion King\" grew up is little more than pop filler. It's a Silmarillion for Disney Adults. It's ultimately kind of useless.",
      "author": "Witney Seibold"
    },
    {
      "text": "Nobody, except perhaps Disney shareholders, asked for this prequel. Still, director Barry Jenkins has crafted something unexpectedly meaningful: a film that earns its place in... wait for it... the Circle of Life.",
      "author": "Joey Morona"
    },
    {
      "text": "Despite Jenkins’ track record and clear artistic touch, the light of Favreau’s semi-success taints everything all it touches here.",
      "author": "Alison Foreman"
    },
    {
      "text": "Be prepared for a disappointing prequel.",
      "author": "Matt Singer"
    },
    {
      "text": "It’s in little danger of becoming a classic but it’s gratifying to know that Barry Jenkins made this film his own, telling a fine story with genuine emotion and visual aplomb.",
      "author": "William Bibbiani"
    },
    {
      "text": "While it looks pretty, this disappointing prequel falls short in many ways. It suffers from weak music, a convoluted storyline, and a questionable portrayal of Scar's origins. Mufasa's story is completely altered in ways that make no sense.",
      "author": "Tessa Smith"
    },
    {
      "text": "But that echoes the overarching issue with Mufasa: it doesn’t want to try. It’s not interested in developing anything inventive or new, just what’s broadly accessible and easily digestible.",
      "author": "Trace Sauveur"
    },
    {
      "text": "Fans of the franchise and younger generations will find a lot to like about Mufasa: The Lion King, but it's hard to imagine it will have a legacy comparable to the original animated classic that started it all.",
      "author": "Aidan Kelley"
    },
    {
      "text": "Despite the artistry that Barry Jenkins and his collaborators bring to “Mufasa,” they can’t get out from under the five-hundred-pound elephant in the room, which is the film’s ultimate reason for existence.",
      "author": "Dan Bayer"
    }
  ],
  "release_year": 2024,
  "duration": 118,
  "genres": [
    "Kids & Family",
    "Adventure",
    "Drama",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "\"Mufasa: The Lion King\" enlists Rafiki to relay the legend of Mufasa to young lion cub Kiara, daughter of Simba and Nala, with Timon and Pumbaa lending their signature schtick. Told in flashbacks, the story introduces Mufasa as an orphaned cub, lost and alone until he meets a sympathetic lion named Taka--the heir to a royal bloodline. The chance meeting sets in motion an expansive journey of an extraordinary group of misfits searching for their destiny--their bonds will be tested as they work together to evade a threatening and deadly foe.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/lurEK87kukWNaHd0zYnsi3yzJrs.jpg"
}