{
  "movie_name": "The Kissing Booth",
  "movie_id": "the_kissing_booth",
  "total_reviews": 12,
  "reviews": [
    {
      "text": "[Noah and Elle's] relationship quickly spirals into one of those classic toxic relationships that populate Netflix's teen dramas.",
      "author": "Rachel Charlene Lewis"
    },
    {
      "text": "A refreshing film in its start but whose interest soon decays to end up being a mediocre movie. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "The director seemed to have a strange fascination with the lead taking off her shirt and wearing super short skirts, and the camera lingered on her in ways that made me uncomfortable.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It feels like it was written by someone who simply digested everything she was told \"romance\" was supposed to be by the patriarchy, and vomited back at us. Nearly every cliché in the film feels cribbed from another movie.",
      "author": "Ani Bundel"
    },
    {
      "text": "A smattering of swearing, sexual references and underage drinking means it doesn't patronise its intended audience, and it refreshingly allows the female lead to be the dork, rather than some unobtainable Venus.",
      "author": "Andrew Collins"
    },
    {
      "text": "Largely for its pre-teen audience as its flaws will likely stand out like an unwanted cold sore on prom night for those outside of its target demographic.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "I can confirm that it's not a good film. In fact, its themes are at times unsettling.",
      "author": "Dustin Rowles"
    },
    {
      "text": "In another film, the sentiment would be a romantic one. In The Kissing Booth, it feels like a cage.",
      "author": "Kate Erbland"
    },
    {
      "text": "Allusions to The Breakfast Club in the soundtrack and the casting of Molly Ringwald certainly don't help The Kissing Booth look anything other than lazy and amateur next to other teen classics.",
      "author": "Zoe Crombie"
    },
    {
      "text": "Quirky romcom has strong language, teen drinking, sex.",
      "author": "Andrea Beach"
    },
    {
      "text": "[The Kissing Booth's] troubling treatment of the female body and unrealistic representation of high school hinders its ability to accomplish anything meaningful.",
      "author": "Tess Cagle"
    },
    {
      "text": "The Kissing Booth is not a good movie. It is a good, drunk, mindless, late night rom-com watch, but it is not a good movie. For that, we say skip it.",
      "author": "Meghan O'Keefe"
    }
  ],
  "duration": 105,
  "genres": [
    "Romance",
    "Comedy"
  ],
  "age_rating": "TV-14",
  "synopsis": "A high school student finds herself face-to-face with her long-term crush when she signs up to run a kissing booth at the spring carnival.",
  "popularity": 5.6
}