{
  "movie_name": "The Silence of the Lambs",
  "movie_id": "silence_of_the_lambs",
  "total_reviews": 148,
  "reviews": [
    {
      "text": "Its impact on movies is still being felt today, and it includes arguably the best performances of both Foster and Hopkins' careers.",
      "author": "Nadir Samara"
    },
    {
      "text": "The crux of this excellent thriller is the battle of intellect and wills between them [Clarice Starling and Dr Hannibal Lecter].",
      "author": "Wendy Ide"
    },
    {
      "text": "Suspenseful and shrewd, Hopkins’ Lecter is one of the most fascinating villains in film (despite less than 20 min of screen time). In spite of his contemptible reproach and steely demeanor, there’s just something about Lecter that makes us root for him.",
      "author": "Mark Johnson"
    },
    {
      "text": "Most books, plays or films never give us even this much. Yet The Silence of the Lambs gives us so much that it's a shame the film doesn't find ways to deepen its concentration on the colossal aberrance of the minds of its complementary terrors.",
      "author": "Terry Francis"
    },
    {
      "text": "The transformation between the two protagonists is truly outstanding. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "The film flows from beginning to end without a single detour on its fatalist course.  [Full review in Spanish]",
      "author": "Rene Jordan"
    },
    {
      "text": "A failure that is a function of its success.",
      "author": "Jay Scott"
    },
    {
      "text": "An exceptional thriller; a film that puts us in the shoes —and in the eyes— of its protagonist as very few other productions have managed to do, introducing us to a world of killers and cannibals and the FBI agents who chase them. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Most viewers will be rooting for Foster's Starling all the way up to the expertly directed denouement -- a darkly whimsical ending that would have been utterly unacceptable in the old days of the Production Code.",
      "author": "Andrew Sarris"
    },
    {
      "text": "It is a freak occurrence of the right director, the right script, and the right cast making something that transcends genre and reshapes popular culture.",
      "author": "Danilo Castro"
    },
    {
      "text": "Throughout the movie, Demme gets across more terror than a dozen Friday the 13ths by showing not the horrifying thing itself but the faces of people looking at horror.",
      "author": "Kathy Huffhines"
    },
    {
      "text": "Grand Guignol is too mild an expression for a work in which every scene is an exercise in repulsion. But I couldn't wait for what happened next and would have to admit that this is an excellent, if morally reprehensible, film.",
      "author": "Warren Sonbert"
    },
    {
      "text": "The Silence of the Lambs is one of the most intoxicating and absorbing thrillers ever made.",
      "author": "Paul McKie"
    },
    {
      "text": "The Silence of the Lambs is something exceedingly rare and invaluable in movies these days: an accomplished, intelligent -- and genuinely scary -- thriller.",
      "author": "Jim Emerson"
    },
    {
      "text": "As played by Anthony Hopkins in the performance of his film career, the amoral psychiatrist dominates the picture -- a remarkable feat, since Jodie Foster is the top-billed star and also does a superb job.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "The other thing that gives Silence its special charge is Hopkins' powerfully ingratiating performance as the formidable villain. Every second he's on the screen, you can't help but feel uncomfortable.",
      "author": "Michael MacCambridge"
    },
    {
      "text": "A bone-chiller of superior intensity.",
      "author": "Candice Russell"
    },
    {
      "text": "Scott Glenn's low-key portrayal keeps things anchored in normalcy and provides a scale against which the depths of Hopkins' malice and Foster's troubled nature can be measured.",
      "author": "Michael H. Price"
    },
    {
      "text": "As the old advertising campaign said, keep telling yourself it's only a movie. But what a movie! It is quite simply one of the very best of its kind.",
      "author": "George Anderson"
    },
    {
      "text": "Even accepting that the movie's cruelty will be its calling card, there's still the void created by no clear point-of-view character. It's nobody's movie in particular, the opposite of Michael Mann's... Manhunter.",
      "author": "Eleanor O'Sullivan"
    },
    {
      "text": "The Silence of the Lambs is the stuff that nightmares are made of. It is, in a sense, a horror movie, but one that deserves comparison with such great works of psychological terror as The Shining, Psycho and Rosemary's Baby.",
      "author": "Harper Barnes"
    },
    {
      "text": "Jonathan Demme's The Silence of the Lambs is a terrific and terrifying thriller, a superbly crafted white-knuckle ride into evil psychosis.",
      "author": "Jack Garner"
    },
    {
      "text": "Do not be deceived by The Silence of the Lambs' pastoral title; this is one large-toothed lion of a suspense movie, shocking, smart and savvy.",
      "author": "Terry Lawson"
    },
    {
      "text": "Terror, as William Blake reminds us, is the human form divine. Jonathan Demme delights in that form more than the average filmmaker, and in... The Silence of the Lambs he offers variations of that form unseen in any of his work before.",
      "author": "Peter Keough"
    },
    {
      "text": "The dark tones and tense nervousness are further enhanced by Demme's oblique choreography of the action and [cinematographer Tak] Fujimoto's doom-laden compositions and camera angles.",
      "author": "Joe Baltake"
    },
    {
      "text": "Starling, played by a tight-lipped Foster with intelligence, fierce commitment and a half-erased rural Southern accent, and Lector, acted by Hopkins with glowing eyes and a caressing English purr, come together in a common pursuit.",
      "author": "Malcolm Johnson"
    },
    {
      "text": "If Hopkins spins The Silence of the Lambs off into the territory of ghoulish nightmares, Foster grounds it firmly in reality.",
      "author": "Terry Orme"
    },
    {
      "text": "It’s a tough little B-movie, but there's more to gross you out in one of Harris’ paragraphs than in all of Demme’s two hours.",
      "author": "Bill Cosford"
    },
    {
      "text": "In an age of cheap chases and absurd body counts, this is one provocative exception.",
      "author": "Bob Ross"
    },
    {
      "text": "A shockingly powerful thriller.",
      "author": "David Denby"
    },
    {
      "text": "The Silence of the Lambs is one slick, sick piece of psychological manipulation. It is an ultrarealistic horror movie, expertly made, certain to start a rash of nightmares about demented killers who mutilate or devour their victims.",
      "author": "Bob Fenster"
    },
    {
      "text": "Does Demme's movie explore the darkness of the human psyche, or merely ride its shadowy back to the bank?",
      "author": "John Powers"
    },
    {
      "text": "Rather than dwell on the violence, Demme relies on a well-constructed plot to keep viewers involved even when they avert their eyes... You identify more with Foster's diminutive FBI woman than with any over-muscled action hero.",
      "author": "Michael Sragow"
    },
    {
      "text": "The Silence of the Lambs is the Psycho of the '90s. A first-rate stomach-in-a-knot psychological thriller that will prod shaken viewers to check the back seats of their cars before they drive away from the theater.",
      "author": "Jeff Strickler"
    },
    {
      "text": "The Silence of the Lambs is a fever dream of a movie -- beautiful and terrifying arid surreal.",
      "author": "Scott Ross"
    },
    {
      "text": "Working from Thomas Harris' shocking and very scary novel, Demme goes straight to the heart of madness.",
      "author": "Stephen Hunter"
    },
    {
      "text": "Foster and Hopkins are both very good indeed; and if the film fails to make you jump out of your skin, it may leave behind a subtler, more insidious trace.",
      "author": "Hugo Davenport"
    },
    {
      "text": "The Silence of the Lambs is an unsatisfying film on the most basic level of all -- the story. It is sadly broken-backed.",
      "author": "Alexander Walker"
    },
    {
      "text": "Liberal, conservative, gross, fastidious, sly, responsible, feminist, sex-fearing, it is a particularly American compendium of impulses, a career breakthrough for Jonathan Demme that is also a Pyrrhic victory for his politics.",
      "author": "Adam Mars-Jones"
    },
    {
      "text": "It has a gutsy, intelligent heroine (a difficult role admirably played by Jodie Foster), who finds police work, a socially, useful and personally therapeutic, activity, quite a change from the current run of movie cops.",
      "author": "Philip French"
    },
    {
      "text": "There is no question that Jonathan Demme's film of Thomas Harris's best-seller is a polished production that will delight the box office. But some of the shock elements, instead of scaring you out of your skin, leave something of a nasty aftertaste.",
      "author": "Madeleine Harmsworth"
    },
    {
      "text": "This one is even better than you've heard. It locks on to an unpleasant subject; it offers as much relaxation as driving on black ice; yet still it is more entertaining, and more frazzling, than any film this year.",
      "author": "Anthony Lane"
    },
    {
      "text": "The Silence of the Lambs is a psycho-thriller for the constitutionally strong. Demme is an uncompromising film-maker. Given the raw material, he sees no reason to dilute it. Harris's readers should feel well satisfied.",
      "author": "Noel Taylor"
    },
    {
      "text": "[It's] one of the most terrifying horror films seen in recent memory, but this isn't the result of severed heads and bloodletting. Rather, the goose bumps and queasiness are aroused by the psychological terror emanating from the twisted mind of a madman.",
      "author": "Michael D. Reid"
    },
    {
      "text": "The Silence of the Lambs provoked in me a fascinated disgust, which I suppose is a way of saying I was entertained by its blend of documentary coolness and vigorously unfolded story.",
      "author": "Neil Jillett"
    },
    {
      "text": "There's nothing quiet about [Demme's] The Silence of the Lambs, just like there's nothing quiet about the tortured paintings of Edvard Munch and Francis Bacon.",
      "author": "John Griffin"
    },
    {
      "text": "Ultimately, though, what makes Lambs so uncommonly effective is not what it shows but what it suggests about humanity. You have been warned.",
      "author": "Lynden Barber"
    },
    {
      "text": "Remarkably, for all its forensic detail, The Silence Of The Lambs is as much a film about a young woman's discoveries about herself as it is a \"gruesome\" thriller about tracking a serial killer.",
      "author": "Tom Ryan"
    },
    {
      "text": "Silence Of The Lambs is being called \"the Psycho for the 90s\". It's an apt description; like Psycho, Silence will set new standards of excellence for its genre.",
      "author": "Rob Lowing"
    },
    {
      "text": "Beyond its serial killer setup, Clarice's journey for identity, which draws from classical structures and supplies an inspired variation on them, is what makes The Silence of the Lambs so rewarding time after time.",
      "author": "Brian Eggert"
    },
    {
      "text": "One of the all-time great thrillers. Demme directs this for maximum suspense, yet the film also works as a multilayered feminist tale, with Foster's resourceful agent emerging as a beautifully conceived character.",
      "author": "Matt Brunson"
    },
    {
      "text": "Impeccably directed, written and acted, The Silence of the Lambs is a classic for a reason.",
      "author": "Trace Thurman"
    },
    {
      "text": "I remembered that Lecter toyed with her as not just a trainee but a younger woman... I had no sense of how baked into every frame of the movie Clarice's awareness of her femininity is.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "...the distinguishing factor is the sense of humanity Demme brings to this inhumane material.",
      "author": "Josh Larsen"
    },
    {
      "text": "Although, in essence, it could be considered a police procedural work, Demme films it like an arty horror, always cloaking the action in an air of non-omniscience.",
      "author": "PJ Nabarro"
    },
    {
      "text": "So near perfection it practically defies criticism.",
      "author": "Mike Massie"
    },
    {
      "text": "It works as a horror movie, but also as a police procedural, a suspenseful thriller, and as a character study.",
      "author": "Allen Almachar"
    },
    {
      "text": "[Foster and Hopkins's] scenes together are, to my mind, the best in a recent Hollywood film.",
      "author": "Monica Dorenkamp"
    },
    {
      "text": "This very unsettling chiller has since been elevated to classic status by virtue of the eerie chemistry few would have seen coming from the odd-couple pairing of Anthony Hopkins and Jodie Foster.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "One of the best films of the nineties, and one of the greatest thrillers in the history of cinema. [Full Review in Spanish]",
      "author": "Sergio Benítez"
    },
    {
      "text": "It is perhaps Hopkins' greatest achievement that when he tells Starling he's having an old friend for dinner, the audience smiles with morbid anticipation.",
      "author": "Hal Lipper"
    },
    {
      "text": "It is competent melodrama spun off from a fiendishly clever book.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Although The Silence of the Lambs is of dubious moral value -- a triumph of technique rather than ideas -- it is not offensive. And as a pure thriller, it ranks with the classics.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "It's ultimately rather remarkable just how engrossing The Silence of the Lambs remains for the duration of its 118 minute running time...",
      "author": "David Nusair"
    },
    {
      "text": "A film far ahead of its time. Maybe even of our time as well. It feels somehow prescient, timeless, a dark portrait of humanity's very worst coupled with the hopeful idea of what we could be.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The creator of Something Wild establishes a similarly unpredictable context here, mixing suspense and thrills and even black humor in provocative fashion.",
      "author": "Rick Chatenever"
    },
    {
      "text": "It is a masterclass of acting, directing, writing and cinematography, of tonality, of pacing and of emotion.",
      "author": "Tara Thorne"
    },
    {
      "text": "Harrowing, tense, and unforgettable...",
      "author": "Sean Fennessey"
    },
    {
      "text": "Hopkins as Lecter is chilling throughout, and he delivers one of the best final lines in movie history.",
      "author": "Shannon Kolkedy"
    },
    {
      "text": "Demme's use of close-ups is remarkable, and not something that's translated into contemporary film language too often anymore: Faces, eyes, hands; they're everywhere, making the suspense personal, and therefore way more frightening.",
      "author": "Eric Melin"
    },
    {
      "text": "Jonathan Demme's Silence of the Lambs has everything you want in a popular thriller. It's stylish, intelligent, audacious rather than shocking, and stolen by a suave monster you'll never forget.",
      "author": "Jay Carr"
    },
    {
      "text": "[Jonathan] Demme uses some surprising methods to create a thriller that is cold, baroque and brutal. [Full Review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A great movie rarity.",
      "author": "Jeff Simon"
    },
    {
      "text": "The Silence of the Lambs is without a doubt one of the most disturbing thrillers in the history of cinema. [Full Review in Spanish]",
      "author": "Covadonga G. Lahera"
    },
    {
      "text": "Hopkins' performance is spectacularly unnerving and should win him future award nominations. Holding her own against Hopkins' hare is Jodie Foster as the tenacious, tortoise-like trainee.",
      "author": "Duane Byrge"
    },
    {
      "text": "Anthony Hopkins is devastatingly demonic in Jonathan Demme's truly horrifying thriller.",
      "author": "Jan Stuart"
    },
    {
      "text": "Nearly three decades on, The Silence of the Lambs doesn't just hold up: it still startles in finesse and execution.",
      "author": "Joseph Walsh"
    },
    {
      "text": "Are these the laws of desire in a decaying culture built on the husks of atrophied ideals, where longing is a destructive touch and relationships are made out of perverse torment?",
      "author": "Lizzie Francke"
    },
    {
      "text": "One of Demme's great skills is his sense of balance; set pieces are alternately propelled by ratcheting tension and slow, mounting dread, while his exquisite match cuts between parallel storylines keep the pace nimble.",
      "author": "Simran Hans"
    },
    {
      "text": "Anthony Hopkins' performance as Lecter is an uproarious technical masterpiece.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "An exquisite piece of filmmaking in which basically not one single thing goes wrong at any point.",
      "author": "Tim Brayton"
    },
    {
      "text": "The Silence of the Lambs, with its dark Freudian subtext, its Poe-like air of foreboding and its chillingly gritty characterizations, is simply a very tough and very scary little movie.",
      "author": "Dennis King"
    },
    {
      "text": "The movie, scary and graphic to cause timid souls (such as this writer) to close their eyes at certain points, has a vise-like grip on the audience.",
      "author": "Kathleen Carroll"
    },
    {
      "text": "Jonathan Demme's hypnotic adaptation of the Thomas Harris novel has a seriousness and intensity that's been entirely lacking in horror movies lately.",
      "author": "John Hartl"
    },
    {
      "text": "Hopkins' cumulative screen image is one of civility and decency, and the association adds to the withering, macabre effect of his murderer. It is a remarkably lucid portrait of lunacy.",
      "author": "Desmond Ryan"
    },
    {
      "text": "As Lecter, Anthony Hopkins gives an astounding performance -- eery, menacing, creepy, believable.",
      "author": "Chauncey Mabe"
    },
    {
      "text": "The confrontations between Foster and Hopkins -- facing her from an ultrasecure cell -- are models of chilling intensity.",
      "author": "Ralph Novak"
    },
    {
      "text": "Demme comes at Harris' material from another angle: His movie may deal with madness, but his perspective is mercifully sane.",
      "author": "Jay Boyar"
    },
    {
      "text": "More than a disappointment, the film is an almost systematic denial of Demme's credentials as an artist and filmmaker... It's a gnarled, brutal, highly manipulative film that, at its center, seems morally indefensible.",
      "author": "Dave Kehr"
    },
    {
      "text": "Jonathan Demme's thriller is artful pulp -- tabloid material treated with intelligence and care and a weird kind of sensitivity.",
      "author": "Terrence Rafferty"
    },
    {
      "text": "Has any horror movie equalled it in the past 22 years? Perhaps. But if only one super-gory flick is ever considered worthy enough for the Academy's top prize, I'm fine with this being it.",
      "author": "Simon Miraudo"
    },
    {
      "text": "This multi-Oscar-winning classic, adapted from Thomas Harris's bestseller, was responsible for giving cinematic serial killers a better image, thanks to Anthony Hopkins's enthralling portrayal of Hannibal Lecter.",
      "author": "John Ferguson"
    },
    {
      "text": "An exceptionally good film, perhaps this fine director's best, in which the horror genre is elevated into the kind of cinema that can at least be argued about as a treatise for its unsettling times.",
      "author": "Derek Malcolm"
    },
    {
      "text": "Hopkins' performance may be the film's bravura showpiece, but Foster's goes the whole distance, steadfast, controlled, heartbreakingly insightful, a fine addition to her gallery of characterizations.",
      "author": "Sheila Benson"
    },
    {
      "text": "Foster's character, who is appealing, is dwarfed by the monsters she is after. I'd rather see her work on another case.",
      "author": "Gene Siskel"
    },
    {
      "text": "FBI agent Clarice Starling (Jodie Foster), brainiac cannibal Hannibal Lecter (Anthony Hopkins) and tackle-tucking serial killer Jame Gumb (Ted Levine) make for one of cinema's great ménages à trois.",
      "author": "Jamie Graham"
    },
    {
      "text": "[VIDEO ESSAY] \"Hannibal the Cannibal\" is the ultimate anti-hero.",
      "author": "Cole Smithey"
    },
    {
      "text": "Thriller that made the serial killer a superstar.",
      "author": "Charles Cassady"
    },
    {
      "text": "The odd psychological interplay between the gutsy, but green, Starling and the deranged, yet fascinating, Lecter provides the basic tone for Jonathan Demme's well-made, insidious shocker.",
      "author": "Steve Newton"
    },
    {
      "text": "Not a second of this two-hour flick, which redefined the term 'thriller' and spawned a host of clones, I can find error with.",
      "author": "Garth Franklin"
    },
    {
      "text": "Screenwriters and directors can turn to this classic film for a primer on how to create incredible tension and horror far in excess of what we actually see onscreen.",
      "author": "Brian Webster"
    },
    {
      "text": "All of the film's most enduring aesthetic qualities and themes -- essentially what sets it apart from so many imitators and established it almost immediately as a canonical film -- are contained in those riveting first 20 minutes.",
      "author": "James Kendrick"
    },
    {
      "text": "It has maintained its reputation as a chilling drama after all these years...",
      "author": "Rory L. Aronsky"
    },
    {
      "text": "This is the grandest guignol Hollywood has produced in years.",
      "author": "David Ansen"
    },
    {
      "text": "The Silence of the Lambs has appalling moments, but there's a thoughtfulness to it that helps offset the horrors it portrays.",
      "author": "David Sterritt"
    },
    {
      "text": "Anthony Hopkins makes Hannibal at once a frightening and almost sympathetic character and director Jonathan Demme keeps the tension tight as the film moves to its terrifying confrontation climax.",
      "author": "Sky Staff"
    },
    {
      "text": "A pretty sharp new thriller.",
      "author": "Richard Corliss"
    },
    {
      "text": "Demme has the control of a born master of suspense.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The juiciest part is Hopkins,' and he makes the most of it. Helped by some highly dramatic lighting, actor makes the role the personification of brilliant, hypnotic evil, and the screen jolts with electricity whenever he is on.",
      "author": "Todd McCarthy"
    },
    {
      "text": "This is a still wonderful example of classy storytelling and unforgettable characterisation.",
      "author": "Film4 Staff"
    },
    {
      "text": "A riveting, non-stop thriller of nerve-racking intensity.",
      "author": "Chuck O'Leary"
    },
    {
      "text": "The over-the-top story reeks of phoniness, grisly violence and exploitation.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Not since The Exorcist had a horror flick been this applauded! It was almost as if ... \"horror\" were its own legitimate genre!",
      "author": "Scott Weinberg"
    },
    {
      "text": "An accomplished, effective, grisly, and exceptionally sick slasher film that I can't with any conscience recommend,",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "If you disregard the homophobic elements, you'll enjoy Demme's terrific thriller with brilliant acting from Hopkins, who makes a likable hero out of Hannibal, and Jodie Foster, as the agent who becomes his reluctant partner and romantic interest",
      "author": "Emanuel Levy"
    },
    {
      "text": "The film comes through with flying colors.",
      "author": "JoBlo"
    },
    {
      "text": "Understandably, much has been made of Hopkins' hypnotic Lecter, but the laurels must go to Levine's killer, admirably devoid of camp overstatement, and to Foster, who evokes a vulnerable but pragmatic intelligence.",
      "author": "Geoff Andrew"
    },
    {
      "text": "A first unmissable, then enduring, but always unmissable classic.",
      "author": "Barry McIlheney"
    },
    {
      "text": "It's a bona fide classic of its kind.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "...the rare scary movie that allows its actors room to circle and brush lightly against on another, generating cool sparks.",
      "author": "Philip Martin"
    },
    {
      "text": "The Academy also rightly awarded Best Actress to Foster for being the heart and soul of the piece.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Foster follows up her Oscar-winning role in The Accused by playing a determined young woman with an unhappy past from West Virginia, and Hopkins is a sight: This guy is so scary he even hisses with style.",
      "author": "Dan Webster"
    },
    {
      "text": "It's good, but it's not quite the classic it's touted as.",
      "author": "Ken Hanke"
    },
    {
      "text": "The film's principle attraction stems not from the thrill of the hunt, but from the spellbinding skull sessions between Jodie Foster's heroine and Anthony Hopkins's brilliant, menacing villain.",
      "author": "TV Guide Staff"
    },
    {
      "text": "Brilliant, chilling and flawless. Hopkins delivers a villain for our times.",
      "author": "Widgett Walls"
    },
    {
      "text": "A terrifying psychological drama about a brave modern day woman warrior.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The Silence of the Lambs is pop film making of a high order. It could well be the first big hit of the year.",
      "author": "Vincent Canby"
    },
    {
      "text": "It stands in a glass cage and scoffs at you!",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Terrifying and inescapable. A perfect meditation on the nature of fear and courage, featuring two of the greatest performances ever put on film.",
      "author": "Rob Vaux"
    },
    {
      "text": "[A] powerful, thought-provoking and surprisingly well-made film.",
      "author": "Dragan Antulov"
    },
    {
      "text": "Lecter fascinates us because he embodies qualities that we associate with civilized, reasonable existence, yet he is murderously sociopathic.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Director Jonathan Demme and actors Jodie Foster and Anthony Hopkins expend considerable talent on a film that remains repellent and stubbornly unilluminating.",
      "author": "Stephen Farber"
    },
    {
      "text": "It's by no mistake that The Silence of the Lambs is still considered one of the most important modern thrillers of all time. The reason, in simple terms, is that no movie looks or feels like Demme's movie.",
      "author": "Chris Cabin"
    },
    {
      "text": "...gripping action, psychological thrills, and dramatic horror...a first-rate suspense chiller.",
      "author": "John J. Puccio"
    },
    {
      "text": "Foster is typically soft and stoic as the FBI agent in way over her head; Scott Glenn is his usual leathery self as her superior officer; and Hopkins is simply petrifying.",
      "author": "Boxoffice Staff"
    },
    {
      "text": "For all the unbridled savagery on display, what is shrewd, significant and finally hopeful about Silence of the Lambs is the way it proves that a movie can be mercilessly scary and mercifully humane at the same time.",
      "author": "Peter Travers"
    },
    {
      "text": "Very few movies have ever won the five top Oscars: Best Actor, Actress, Screenplay, Director, and Picture.",
      "author": "Ben Falk"
    },
    {
      "text": "No common follow-the-clues, get-the-bad-guy movie",
      "author": "Carlo Cavagna"
    },
    {
      "text": "The collaborative effort of Demme, Foster, Hopkins, and cinematographer Tak Fujimoto in The Silence of the Lambs has resulted in something very special to anyone who loves to be scared and challenged by a movie.",
      "author": "Steve Davis"
    },
    {
      "text": "This is one heavy thriller.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Suffice it to say there is much to admire here but beware if you are at all squeamish.",
      "author": "Chris Hicks"
    },
    {
      "text": "A smart, restrained entertainment, it doesn't splash around in blood and hysteria.",
      "author": "Desson Thomson"
    },
    {
      "text": "Adroitly directed by Jonathan Demme, it lurks about the exquisite edge of horror, before finally leaping into an unholy maw of bloody bones and self-awareness.",
      "author": "Rita Kempley"
    },
    {
      "text": "There is little doubt that the most memorable aspect of The Silence of the Lambs is Anthony Hopkins' incomparable performance as Lecter.",
      "author": "James Berardinelli"
    },
    {
      "text": "The Silence of the Lambs is a psychological thriller of the highest order, and well deserving of the unusual Oscar nod for Best Picture, never before bestowed upon a film like this.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "The popularity of Jonathan Demme's movie is likely to last as long as there is a market for being scared.",
      "author": "Roger Ebert"
    },
    {
      "text": "The Silence of the Lambs (1991) is one of the most taut, suspenseful, psychological thrillers ever produced.",
      "author": "Tim Dirks"
    },
    {
      "text": "Demme has created a supremely sensuous and hypnotic thriller, one that's likely to become his first major hit.",
      "author": "Owen Gleiberman"
    }
  ],
  "release_year": 1991,
  "duration": 119,
  "genres": [
    "Mystery & Thriller",
    "Crime",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "Jodie Foster stars as Clarice Starling, a top student at the FBI's training academy. Jack Crawford (Scott Glenn) wants Clarice to interview Dr. Hannibal Lecter (Anthony Hopkins), a brilliant psychiatrist who is also a violent psychopath, serving life behind bars for various acts of murder and cannibalism. Crawford believes that Lecter may have insight into a case and that Starling, as an attractive young woman, may be just the bait to draw him out.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/uS9m8OBk1A8eM9I042bx8XXpqAq.jpg"
}