{
  "movie_name": "The NeverEnding Story",
  "movie_id": "the_neverending_story_1984",
  "total_reviews": 42,
  "reviews": [
    {
      "text": "The effects look cardboardy by today’s standards but the puppets and animatronics are great, especially Falkor, the dog-like “luck dragon”.",
      "author": "Ed Potton"
    },
    {
      "text": "There’s no doubt of the rousing urgency and terrific design of this likable movie.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Though not as wonderfully bizarre as Jim Henson's Labyrinth, it does have an existential monster called the Nothing—it's something like a black hole that sucks the life out of a fantastic world.",
      "author": "Charles Mudede"
    },
    {
      "text": "If you are looking for a family film that will not be offensive to any member of the family then Wolfgang Petersen’s (Troy, The Perfect Storm) “The Neverending Story” is a safe pick.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "This movie is dark!",
      "author": "Andrew Galdi"
    },
    {
      "text": "This scarred me for life, and I loved it",
      "author": "Avaryl Halley"
    },
    {
      "text": "It's got a sharp edge that fantasy movies rarely have.",
      "author": "Tim Brayton"
    },
    {
      "text": "What’s not in question is how this fantastic oddity stays with all those who have seen it, long, long after the credits roll...",
      "author": "James Croot"
    },
    {
      "text": "The film has an almost overwhelming number of messages. From colonization and dispossession of land to the apathy of adulthood as well as the power of new beginnings",
      "author": "Sezín Koehler"
    },
    {
      "text": "Though its foibles and failings haven't improved with age, The NeverEnding Story emerges in retrospect as a more ambitious children's movie than given credit.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "...takes viewers back to a pre-CGI era when fantastic beasts and amazing worlds were created on screen using puppets and models.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Carries with it a healthy amount of menace, and intensity, but it's also a remarkable adventure.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "This utterly enchanting, family treat of a film should leave you and yours wide-eyed with wonder.",
      "author": "Billy Mowbray"
    },
    {
      "text": "Something dark, entrancing and even a little special.",
      "author": "Rob Vaux"
    },
    {
      "text": "Fantasies as hearty and original as this are rare at the movies.",
      "author": "David Sterritt"
    },
    {
      "text": "The story is a touch simplistic, but Petersen's direction is assured and children will be dazzled by the imaginative effects and stunning sets.",
      "author": "John Ferguson"
    },
    {
      "text": "It pokes along at times and lapses occasionally into dark moments of preachy philosophy, but this is still a charming, amusing and harmless film for kids.",
      "author": "Ralph Novak"
    },
    {
      "text": "Here is a little adventure that fed on our uncultivated need to think, and wonder. It gave many of us our first taste of cinematic possibility.",
      "author": "David Keyes"
    },
    {
      "text": "The NeverEnding Story remains a testament to the power of imagination and the type of inventive cinema that was possible in a pre-digital era.",
      "author": "Thomas Caldwell"
    },
    {
      "text": "All in all, The Neverending Story is a silly fantasy movie that often shows its age, but as a kids' movie it still has enough exciting action and you-can-do-it attitude to earn itself a place in a family's DVD collection.",
      "author": "Alistair Dickinson"
    },
    {
      "text": "This was sweet and charming at the time but now it just lacks either the comedy or sophistication of kids' fantasy film that we've all become accustomed to.",
      "author": "Ian Nathan"
    },
    {
      "text": "Only a certified grump could dislike this engaging fantasy that wends its way into the imagination and is a delight on most levels.",
      "author": null
    },
    {
      "text": "A marvelously realized flight of pure fantasy.",
      "author": "Variety Staff"
    },
    {
      "text": "Despite the sophistication of the source material, the film isn't particularly successful.",
      "author": "Dave Kehr"
    },
    {
      "text": "As a testament to the power of books, the often gloomy The Neverending Story comes off as a Reading Rainbow episode covering existentialism.",
      "author": "Mark Pfeiffer"
    },
    {
      "text": "It's very hard not to give in to The Neverending Story's heart-in-the-right-place charms amidst an increasingly anti-literate society. [Blu-ray]",
      "author": "Peter Canavese"
    },
    {
      "text": "...has enough charm, delight, and wonder going for it to entertain most youngsters, and that's all that matters.",
      "author": "John J. Puccio"
    },
    {
      "text": "Magical storytelling targeted at children still fascinates.",
      "author": "Steve Crum"
    },
    {
      "text": "A fairytale of the very best kind.",
      "author": "Verina Glaessner"
    },
    {
      "text": "Even better if you never see the sequels.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The world of this movie looks like a very particular place, and the art direction involved a lot of imagination.",
      "author": "Roger Ebert"
    },
    {
      "text": "An enjoyable departure from both Das Boot and Kajagoogoo.",
      "author": "Gregory Weinkauf"
    },
    {
      "text": "The Neverending Story may have cost a mint to produce, but the result is bargain-basement.",
      "author": "Vincent Canby"
    },
    {
      "text": "An above-average children's flick with interesting characters and an imaginative premise.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The 'NeverEnding' part of the title is certainly accurate.",
      "author": "Widgett Walls"
    },
    {
      "text": "Nowhere near as good as the book, but not bad for the kids.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Classic fantasy, full of wonderful creatures and characters.",
      "author": "Fred Topel"
    },
    {
      "text": "A shining moment in Science-Fiction Fantasy. Does it get any better?",
      "author": "Caffeinated Clint"
    },
    {
      "text": "[A] marvelous, inventive, inspiring fantasy.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "One of a scant few true Fantasy masterpieces.",
      "author": "Joshua Tyler"
    },
    {
      "text": "A decent fantasy, but anyone who's read the book will be sorely disappointed at didn't make it into the adaptation.",
      "author": "Chuck Rudolph"
    },
    {
      "text": "This fantasy tale drags incredibly despite its relatively short running time.",
      "author": "James O'Ehley"
    }
  ],
  "release_year": 1984,
  "duration": 94,
  "genres": [
    "Kids & Family",
    "Fantasy",
    "Adventure"
  ],
  "age_rating": "PG",
  "synopsis": "On his way to school, Bastian (Barret Oliver) ducks into a bookstore to avoid bullies. Sneaking away with a book called \"The Neverending Story,\" Bastian begins reading it in the school attic. The novel is about Fantasia, a fantasy land threatened by \"The Nothing,\" a darkness that destroys everything it touches. The kingdom needs the help of a human child to survive. When Bastian reads a description of himself in the book, he begins to wonder if Fantasia is real and needs him to survive.",
  "popularity": 8.1,
  "poster_url": "https://image.tmdb.org/t/p/original/ddYCa91iDXfJCxaqSYzwi2fjfnl.jpg"
}