{
  "movie_name": "The Shape of Water",
  "movie_id": "the_shape_of_water_2017",
  "total_reviews": 464,
  "reviews": [
    {
      "text": "Guillermo del Toro’s enchanting fairy tale comes alive [... in this] seamless blending of practical effects and CGI, showcasing [a] vibrant palette that immerses you in its surreal atmosphere.",
      "author": "Preston Barta"
    },
    {
      "text": "Guillermo del Toro’s The Shape of Water is a beautiful and fully realized film about loneliness and our desire for love.",
      "author": "JD Duran"
    },
    {
      "text": "Del Toro has made a film whose dark, sublime, watery beauty is indisputable, and whose story is as much an intriguing \"beauty-and-the-beast\" ballad as it is a captivating homage to the different and the extraordinary.",
      "author": "Diana Tuova"
    },
    {
      "text": "However, while The Creature from the Black Lagoon was darker, in The Shape of Water he is a more humanized and warm being, here he is the victim and not a threat, the typical scheme that we know from King Kong (1933) is no longer repeated.",
      "author": "Denise Pieniazek"
    },
    {
      "text": "The meticulous craftsmanship is to be expected in any del Toro film and only adds to the magic spell he puts us under.",
      "author": "Mark Johnson"
    },
    {
      "text": "It balances a harsh 1960s setting with fairy tale magic painted into its big, beautifully-detailed sets. Only del Toro could pull this madness off.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "You’ll either be charmed by Hawkins’s ethereal, wordless performance or you won’t, but del Toro’s use of a vivid colour palette would impress anyone.",
      "author": "Chris Bennion"
    },
    {
      "text": "Touching and surreal...",
      "author": "Brian T. Carney"
    },
    {
      "text": "There is no subtlety whatsoever. You can practically hear del Toro beating his pulpit through much of Shannon’s dialogue.",
      "author": "Keith Garlington"
    },
    {
      "text": "With a narrative that resonates in unexpected ways, the film offers a showcase for the talents of its stunning ensemble cast, especially Hawkins, who embodies innocence without becoming a symbol or losing her humanity.",
      "author": "Brian Eggert"
    },
    {
      "text": "The Shape Of Water is another success for Del Toro, who has yet to received a Best Director nomination at the Academy Awards but looks to be on his way to his first. A film that should be looked at and appreciated for its beauty and message.",
      "author": "David Gonzalez"
    },
    {
      "text": "An unadulterated celebration of classical romance, monster movies, and the captivating sorcery of filmmaking.",
      "author": "Drew Dietsch"
    },
    {
      "text": "This intoxicating burst of goodness celebrates connection, the space in-between, the silence of it, a quiet reading of heartbeats, the way we dance inside.",
      "author": "Milana Vujkov"
    },
    {
      "text": "Leave your cynicism at the door-- there's no place for it here.",
      "author": "Fletcher Powell"
    },
    {
      "text": "Ultimately, del Toro's masterpiece is an utter triumph in finding love and humanity in the most unlikely of places - and it asks us to do exactly the same.",
      "author": "Nick Reilly"
    },
    {
      "text": "Without making a sound, Hawkins delivers a moving, entirely gestural performance that has charmed critics.",
      "author": "Yasmin Omar"
    },
    {
      "text": "Social politics have always provided del Toro's films with both subtext and context but The Shape of Water is the most literal translation of his embracing of the Other as beautiful...",
      "author": "Jim Rohner"
    },
    {
      "text": "A romance between two characters who never speak which means Del Toro must depict their love only in visuals. This leads to many beautiful cinematic scenes, including one of the most unique, and but wonderful, sex scenes in recent years.",
      "author": "Ian Brill"
    },
    {
      "text": "... Worthy of acclaim for its bold imagination, design and straddling of genres, as well as a heavy-weight cast, but it's perhaps more conventional than people might expect.",
      "author": "Tori Brazier"
    },
    {
      "text": "A what-if story... What if The Creature from the Black Lagoon found love? What if Beauty and the Beast were set in Cold War USA?",
      "author": "Alix Turner"
    },
    {
      "text": "The story falls into a pattern of contrived confrontations that culminates in an underwhelming union.",
      "author": "Mike Massie"
    },
    {
      "text": "Del Toro's story is built on a beautiful landscape brought to life by production design master Paul Austerberry and Dan Laustner, whose cinematography paints a pulpy noir coat of paint on a tumultuous period in American history.",
      "author": "Dan Buffa"
    },
    {
      "text": "This beautifully crafted fantasy falls somewhere between del Toro's more personal Spanish-language films (like Pan's Labyrinth) and his American popcorn spectaculars.",
      "author": "Dennis Harvey"
    },
    {
      "text": "From the very first frame to the last, The Shape Of Water is a captivating and emotional experience.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "There is no love story out there quite like the one Guillermo del Toro has put together here.",
      "author": "Leigh Monson"
    },
    {
      "text": "Guillermo del Toro has done it again.",
      "author": "Richard Propes"
    },
    {
      "text": "Simply beautifully enchanting and brutally mysterious, visually luscious and mesmerising, del Toro is a cinematic genius.",
      "author": "Zehra Phelan"
    },
    {
      "text": "It's the small, rather than the big, that impresses most here, and it proves a welcome return to the director's modest origins.",
      "author": "Luke Gorham"
    },
    {
      "text": "Del Toro's \"fairy tale for troubled times\" has the limitations of even the best fairy tale, a lack of social concreteness and urgency, but its positive qualities are real.",
      "author": "Joanne Laurier"
    },
    {
      "text": "The Shape of Water probably had inclusive goals in mind, but execution is everything.",
      "author": "Stan Clark"
    },
    {
      "text": "It's pleasant and pretty, the execution largely distracting from feeling that the script is something of a missed opportunity.",
      "author": "Matt Cipolla"
    },
    {
      "text": "\"The Shape of Water\" never truly coalesces, handing viewers a collection of admirable parts but a whole that's left wanting.",
      "author": "Brent McKnight"
    },
    {
      "text": "There is an enchanting escapism, in which Del Toro uses a visual display and sociopolitical parables in order to embellish romanticism in a film that honors the genres of cinema. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "A love story birthed by a pure love of cinema that's derivative as it is celebratory of its many inspirations.",
      "author": "Dan Tabor"
    },
    {
      "text": "Something of a cinematic miracle -- the kind that Del Toro has given us over the years to the point where I'm starting to feel spoiled.",
      "author": "Steven Prokopy"
    },
    {
      "text": "[W]ith The Shape of Water, one of our greatest storytellers has made his masterpiece.",
      "author": "Dan Scully"
    },
    {
      "text": "Art depends on a specific point of view. The Shape of Water is flawed, but there's no denying it's art.",
      "author": "Tim Brennan"
    },
    {
      "text": "The Shape of Water's visual, acoustic, and emotional fluidity transports us into an underwater world where we are free to breathe again.",
      "author": "Mengna Da"
    },
    {
      "text": "This is a elegantly portrayed love story set against a shifting background that leaves you wanting to see more happy endings.",
      "author": "Katie Hogan"
    },
    {
      "text": "A beautiful, dark fairy tale from Guillermo del Toro...",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "The Shape Of Water will charm the pants off of you, and you won't even mind the fishy smell afterwards.",
      "author": "Chris McCoy"
    },
    {
      "text": "A fairy tale as universal as it is weird.",
      "author": "Aly Caviness"
    },
    {
      "text": "Once again, del Toro has raised the bar in his creativity and made an unconventional romance into a stunning fairy tale.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "The Shape of Water lives and breathes such defiant romanticism it's hard not to swoon.",
      "author": "Zhuo-Ning Su"
    },
    {
      "text": "[Guillermo del Toro] has directed Sally Hawkins in a remarkable performance telling this tale of love without saying one word in an elaborate production that is visual, imaginative and enthralling from beginning to end.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "Interestingly primed but never fully satisfying, The Shape of Water will enchant those inclined towards the film's romantic investments in one of Del Toro's most willfully rosy-tinted films concerning mankind.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Like the best film monsters, it's difficult not to feel some sympathy for him. Because his spiritual rot born out of toxic masculinity began a long time ago and there's nothing he can do about it.",
      "author": "Rhys Tarling"
    },
    {
      "text": "In his greater films, del Toro is able to strike a balance between harsh violence and sentimentalism, but the alchemy doesn't necessarily work here.",
      "author": "David Harris"
    },
    {
      "text": "This is a love story above all else, and on many different levels, and it's all just rather wonderful.",
      "author": "Kate Rodger"
    },
    {
      "text": "The Shape of Water juggles heart-wrenching tragedy, sharp-witted humor, and heartwarming brilliance. Del Toro has this personal understanding of flawed humans and eccentric creatures resulting in something magical and wondrous.",
      "author": "Chris Sawin"
    },
    {
      "text": "Despite its talented cast and stylistic veneer, the stranger-than-Stranger-Things feature is overhyped.",
      "author": "Brigid Presecky"
    },
    {
      "text": "The Shape of Water is definitely worth a watch for its story and filmmaking prowess.",
      "author": "Karl Delossantos"
    },
    {
      "text": "The new Guillermo del Toro's film does not understand awards and nominations, but love, color, life and, in short, everything that makes the purest cinema magical. [Full Review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "'The Shape of Water' is perfectly consistent with the thematic and aesthetic obsessions of Del Toro. [Full Review in Spanish]",
      "author": "John Tones"
    },
    {
      "text": "The Shape of Water is a story about love and its intractable desire to touch us all, humans and monsters alike",
      "author": "Victor Stiff"
    },
    {
      "text": "If The Shape of Water never quite breaks out of the confines of what's basically a tale as old as time, it's still an artfully executed diversion further strengthened by an excellent central performance by Hawkins.",
      "author": "Matt Brunson"
    },
    {
      "text": "Passive furries may have helped The Beauty & The Beast become a global smash this year, but it's The Shape of Water\" that uses its interspecies, star-crossed lovers to actually say something.",
      "author": "Dominic Griffin"
    },
    {
      "text": "An aquatic beauty and the beast.",
      "author": "Michael J. Casey"
    },
    {
      "text": "The Shape of Water is boring, uninspired and undeserving of the gallons of praise in which it currently splashes.",
      "author": "Ryan Syrek"
    },
    {
      "text": "This creature is cut, chiseled, virile; you'd be forgiven if you find yourself a little turned on.",
      "author": "Erica Ciccarone"
    },
    {
      "text": "A gentle and heartrending reminder that being different doesn't mean having to live a life alone.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The world of this fairy tale is not a magic kingdom but a world like ours that is muddy and contaminated and incongruous that resonates with the tinkling notes from an old piano.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Anyone who has loved either old monster movies or the Beast in the fairy tale Beauty and the Beast will be charmed by this wonderful sci-fi fantasy of outsiders, insiders, and monsters in The Shape of Water.",
      "author": "Cate Marquis"
    },
    {
      "text": "No no one else can make (our would make) a movie like this, except for [Guillermo del Toro]...One of the most unique films I've seen this year.",
      "author": "Dan Murrell"
    },
    {
      "text": "Guillermo del Toro crafts a modern-day monster movie with a social conscience, a genre-mashup featuring a mix of old movies and musicals, vintage advertising, noir and good old-fashioned romance.",
      "author": "Julie Crawford"
    },
    {
      "text": "The Shape of Water takes us both somewhere nostalgic and unfamiliar.",
      "author": "Kimberley Elizabeth"
    },
    {
      "text": "With welcome details in every frame, the set design and costumes speak their own language.",
      "author": "Wendy Shreve"
    },
    {
      "text": "The romance of cinema; the hopefulness of love; the struggle to feel whole, valid, and less lonely; the courage to fight for what's right & good in this terrible world.",
      "author": "Amie Simon"
    },
    {
      "text": "In the end, it's films that I connect with emotionally that I love and remember the most. This one is a masterpiece bear revisiting time and time again.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Sally Hawkins is fantastic.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Rare is the film that gets under your skin in both a disconcerting and gently warming way, but this is exactly the trick that The Shape of Water manages.",
      "author": "Jack Blackwell"
    },
    {
      "text": "Despite clocking in at two hours, The Shape of Water is a tight effort.",
      "author": "Deborah Cornelious"
    },
    {
      "text": "The Shape of Water is weird and beautiful and idiosyncratic and mesmerizing. Magnificent.",
      "author": "Allen Adams"
    },
    {
      "text": "Let yourself be hastened into this unforgettable water slide ride.",
      "author": "Filipe Freitas"
    },
    {
      "text": "While it still falls short of his earlier triumphs, it's a step in the right direction for the Hollywood expansion of del Toro's unique vision",
      "author": "Kyle Pinion"
    },
    {
      "text": "If The Shape of Water were purely focused on Eliza and the creature with deity-like properties, it would be a pure shot of cinematic ecstasy.",
      "author": "Marshall Shaffer"
    },
    {
      "text": "A crystallization of timeless themes with exhilarating emotional frankness, spacious humanism, and extravagant style.",
      "author": "Andrew Wyatt"
    },
    {
      "text": "Guillermo del Toro's latest ask us about tolerance in a dark time in history where intolerance seems to be the root of all out tragedies. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "Neil Gaiman once wrote that America is no place for gods. But is it no place for fairy tales? Guillermo del Toro would say no.",
      "author": "Nathanael Hood"
    },
    {
      "text": "An undeniably gorgeous film, bathed in a radiant, emerald glow and fully embracing its early '60s backdrop that allows it to take on an old-Hollywood aesthetic.",
      "author": "Adam Patterson"
    },
    {
      "text": "Want to see a movie that pulses with an abundance of pure creativity and vision? This is it.",
      "author": "Louisa Moore"
    },
    {
      "text": "[Guillermo] del Toro's love of nostalgia gets in the way of moving the story forward. It has a familiarity that hinders the newness and excitement of the downright incredible moments of character.",
      "author": "James Clay"
    },
    {
      "text": "Del Toro hits another grand slam with the production design, but the movie really wins because of it's honest approach.",
      "author": "Kent Garrison"
    },
    {
      "text": "With its art-deco gothic look and haunting score courtesy of Alexandre Desplat, The Shape of Water is one of the most unique films to come out this year.",
      "author": "Michelle Kisner"
    },
    {
      "text": "I didn't find this iteration of a familiar myth very effective or affecting. Maybe you'll love this frog prince more than I did.",
      "author": "Joel Mayward"
    },
    {
      "text": "The Shape of Water elevates beyond genre expectations... an unexpected, deeply personal adventure that will captivate any audience willing to give it a chance.",
      "author": "Matt Ward"
    },
    {
      "text": "The Shape of Water may be the most stunning film I have ever seen. Visually, it draws you in with gorgeous creature design and fascinating use of colors. The performances are absolutely outstanding, and the characters are fascinating.",
      "author": "Molly Henery"
    },
    {
      "text": "The film does all feel rather insubstantial though and a touch 'second hand' by its final reel. Emotionally, visually and contextually it's all a little passé.",
      "author": "PJ Nabarro"
    },
    {
      "text": "Cinematic perfection at its purest.",
      "author": "Cameron Frew"
    },
    {
      "text": "At its core, The Shape of Water is a film about being seen as a person without any asterisks.",
      "author": "Ian Thomas Malone"
    },
    {
      "text": "[Hawkins is] utterly mesmerizing to watch even in scenes where she's not attempting to seduce a man-phibian.",
      "author": "Bob Chipman"
    },
    {
      "text": "The visuals are stunning ... but those visuals are even more memorable because of the tone of empathy that del Toro injects into it all.",
      "author": "Kyle Kizu"
    },
    {
      "text": "The Shape of Water is a lush, moving love story that sees a softer, tenderer side of Guillermo del Toro without sacrificing those qualities that make him one of the most unique filmmakers of his generation.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "While the genres don't always seem to be the right fit, del Toro makes it work, thanks to some beautiful imagery and a strong cast.",
      "author": "Micheal Compton"
    },
    {
      "text": "These waters might run strongly, but they're far muddier than they should be.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "I am head over heels in love with Guillermo del Toro's latest picture.",
      "author": "Rosalie Kicks"
    },
    {
      "text": "The Shape of Water shows us that it's never too late to be understood or seen. Look beyond surfaces and see with your heart.",
      "author": "Jared Mobarak"
    },
    {
      "text": "It's about the way our sexuality reveals ourselves and how sex allows us to connect with others in meaningful ways. But mostly, it's about a woman f*cking a fish monster.",
      "author": "Meghan O'Keefe"
    },
    {
      "text": "It is a beautiful, evocative and captivating film, guaranteed to resonate with audiences old and young. Simply put, it is one of the best films of the year.",
      "author": "Joe Lipsett"
    },
    {
      "text": "A teal-coloured passion project for del Toro where emotion and ideas and visual splendour swim together in harmony.",
      "author": "Ross Miller"
    },
    {
      "text": "The Shape of Water is visionary filmmaking.",
      "author": "Anupama Chopra"
    },
    {
      "text": "So, while we know Elisa has humanity, Del Toro has to plead his case for the fish-man.",
      "author": "Robert Daniels"
    },
    {
      "text": "Hawkins shines in the role, bringing a vitality and sense of spirit to the part.",
      "author": "Kimberly Pierce"
    },
    {
      "text": "The filmmaker's fearless commitment to his vision, supported by a fantastic cast and well-chosen talent in every category from makeup to musical score, has made this unlikely concept a strange but fascinating triumph of creative confidence.",
      "author": "Monica Reid"
    },
    {
      "text": "A magical transcendence that makes you leave the cinema floating.",
      "author": "Alexa Dalby"
    },
    {
      "text": "The film proves that intentional ambiguity doesn't necessarily mean a story ends unsettled. That it doesn't explicitly tell you which interpretation to have makes all of them more powerful.",
      "author": "Adam Epstein"
    },
    {
      "text": "If all we're going to get from del Toro now are on are R-rated films, then I would want them to all feel like this.",
      "author": "Rendy Jones"
    },
    {
      "text": "The Shape of Water is subversive without meaning to be political. It invites us to consider the strange, romantic pairing of its two main characters, and in challenging us with this vision, it challenges us to consider how we view each other.",
      "author": "Alci Rengifo"
    },
    {
      "text": "Guillermo Del Toro, takes the story of this unlikely duo and makes it not only believable but sorrowful, lyrical, mystical, mythical, strange, and, well, magic.",
      "author": "Glynis Costin"
    },
    {
      "text": "The pride Del Toro takes in his world-building, and the creation of his characters and monsters, is a sheer wonder that continues to amaze me. The Shape of Water is no different.",
      "author": "Millicent Thomas"
    },
    {
      "text": "As an actress who utters not a single word, Hawkins give a profound performance, creating a breathtaking understanding of her longing to be loved.",
      "author": "Pamela Powell"
    },
    {
      "text": "There is so much to delight visually here as well as the beautiful and captivating film score. It's a striking masterpiece that flows just like water.",
      "author": "Rosalynn Try-Hane"
    },
    {
      "text": "The Shape of Water may too obviously foreshadow how these characters will eventually collide violently and ideologically, but del Toro's pop storytelling remains so effortlessly jazzy and hypnotic that it hardly matters.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "The scenes underwater, specifically with Elisa and the Amphibious Man are mesmerizing and incredibly sensual; a beautiful fluidity with the motions of the characters.",
      "author": "Manny A. Castellanos"
    },
    {
      "text": "This movie, like its title, is extremely hard to define...it doesn't fit neatly in any genre...and it's best to let it wash over you.",
      "author": "Tom Santilli"
    },
    {
      "text": "... has the seriousness and innocence of A Monster Calls while indulging in an R-rated adult fantasy romance, an amazing line to walk and all the better for it.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "Del Toro has such a distinct vision for his films and never disappoints on delivering a world so vibrant and stunning.",
      "author": "Ashley Menzel"
    },
    {
      "text": "I commend [The Shape of Water] for daring to be different. It plays with an old type of story and creates something that is entirely its own.",
      "author": "Damian Levy"
    },
    {
      "text": "A captivating ode to monster movies past with a passionately inclusive message that units a group of \"others\" in their fight against the oppressive majority.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Del Toro takes the central relationship seriously, and the weight of the villain makes us care for the characters and hope they'll be buoyed by their friendships.",
      "author": "Damien Straker"
    },
    {
      "text": "Such an out of the ordinary picture demands an unconventional heroine and del Toro could not have chosen better than Hawkins.",
      "author": "Alison Rowat"
    },
    {
      "text": "The progressive agenda wins the Oscar! Love that! Wait, nope-I draw the line at interspecies carnality. When protesting persecution and lauding universal love, at least pick a metaphor not as universally reviled as bestiality. It's not twee, it's gross.",
      "author": "Mark Jackson"
    },
    {
      "text": "As the title implies, this is a movie that surrounds the viewer's psyche and physical being. It is a film that achieves everything it sets out to accomplish.",
      "author": "Cole Smithey"
    },
    {
      "text": "The film feels like a modern fable, with its characters almost bereft of grey areas, and its themes laid out without a hint of subtlety and laced with glorious lyricism.",
      "author": "Oggs Cruz"
    },
    {
      "text": "In this, del Toro asks \"what if the monster got the girl?\". It's a strange question with weird answers, but one he poses with beauty, delicacy and intelligence.",
      "author": "Matt Neal"
    },
    {
      "text": "... a feast for the eyes and the rest of the senses... [Full review in Spanish]",
      "author": "Laura Hiros"
    },
    {
      "text": "Often morose, it livens up when Shannon is tasering the fishman or engaged in bloodletting and beatings. It is a kind of horror movie, it's true, but those scenes overpower the film's invocation of desperate forbidden love.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Sally Hawkins delivers a performance of a lifetime...A visually stunning adventure that's part monster film, part romantic fable, and part Cold War thriller, The Shape of Water is a playground for some of Del Toro's favourite themes.",
      "author": "Shyama Krishna Kumar"
    },
    {
      "text": "Effectively a remake of Ron Howard's Splash with the first act excised.",
      "author": "Ed Whitfield"
    },
    {
      "text": "A universal power flows through this impressive film of love. It's perfect. [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "The Shape of Water is a fascinating experience both in an emotional and an intellectual level, and one of Guillermo del Toro's best movies. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "...a tribute to the classic genres filled with creativity, lyricism and allegorical spirit. [Full Review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "Elisa [is] played with subtle mastery by Sally Hawkins.",
      "author": "Rebecca Liu"
    },
    {
      "text": "Del Toro shows that fantasy and reality are not opposed, confronted worlds, but are part of a single universe. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "For all its cosmic tingles, del Toro manages to smuggle a deeply personal film across Hollywood's border where, beneath its haunted charm, lies an immigrant's story rising to the surface, setting us adrift in a dream.",
      "author": "Brian Quinn"
    },
    {
      "text": "The film fits [Guillermo del Toro's] elegance, his sensitivity, his good handling of the language of film. [Full Review in Spanish]",
      "author": "William Venegas"
    },
    {
      "text": "[A] virtuous and thorough fable. [Full review in Spanish]",
      "author": "Alberto Sáez Villarino"
    },
    {
      "text": "Easily del Toro's best English-language work, The Shape of Water is not simply a triumph, but a reminder of what it is to fall in love with cinema.",
      "author": "Christopher Machell"
    },
    {
      "text": "The actors are in perfect harmony with the story and the emotional core is never lost thanks to a masterful interpretation by Sally Hawkins. [Full Review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "It's a film that doesn't want to be categorised, but it's no trouble at all to lose yourself in its swirling currents.",
      "author": "Adam Sweeting"
    },
    {
      "text": "If we can't believe in the characters, how are we supposed to care?",
      "author": "Andy Lea"
    },
    {
      "text": "It sounds ridiculous, yet through some magical alchemy it works - magnificently so.",
      "author": "Mark Kermode"
    },
    {
      "text": "It is made with the absolute, dead-centre sincerity of a child righting an ancient wrong, and the craft of a film-maker at the height of his powers. It is also unexpectedly kinky in ways that deepen it into something genuinely rich and strange.",
      "author": "Tom Shone"
    },
    {
      "text": "A beautiful homage to cinema, its moral is far from subtle, but Sally Hawkins's wonderful performance raises it from cute oddity to emotional journey.",
      "author": "Aine O'Connor"
    },
    {
      "text": "On the one hand, The Shape of Water plays out like a forgotten instalment of The Twilight Zone. On the other, it makes for an attractive date movie. Seriously, who'd have thought that something so bizarre could be so romantic?",
      "author": "Chris Wasser"
    },
    {
      "text": "A film about films, and a lush Cold War melodrama involving an interspecies romance that should be creepy but isn't, Guillermo del Toro's Shape of Water is an unexpected and irresistible delight.",
      "author": "Paul Whitington"
    },
    {
      "text": "Del Toro creates a beautifully imagined world, rich in colours and characters, with touches of humour and social commentary.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Shot in blue and green hues, the emotionally charged film is a visual feast.",
      "author": "Devesh Sharma"
    },
    {
      "text": "It is an entertaining and acceptable film, but... at times gives the feeling that we are facing a succession of Hollywood patterns. [Full review in Spanish]",
      "author": "Jaime Fa de Lucas"
    },
    {
      "text": "What could be Amelie-style tweeness is invested with warmth, beauty and a surprisingly deep emotional richness.",
      "author": "Michael Bonner"
    },
    {
      "text": "As she did in the under-garlanded Maudie, Sally Hawkins reminds us that there is nobody better at turning robust fragility into something other than a paradox.",
      "author": "Donald Clarke"
    },
    {
      "text": "This is a film made by a boy who loves monsters, who has grown up to understand what they might represent to an adult woman, other outsiders (a gay man, a communist sleeper, a black woman) and an unforgiving society.",
      "author": "Kim Newman"
    },
    {
      "text": "Hawkins's performance throughout is career-defining. With her eyes, mouth and physicality, she finds a level of emotional eloquence to render speech redundant.",
      "author": "Matthew Norman"
    },
    {
      "text": "Sally Hawkins carries the film. Elisa may not speak but you are never in doubt about what she is feeling as Hawkins makes her shine with an inner resolve.",
      "author": "Allan Hunter"
    },
    {
      "text": "The Shape of Water is a wild ride that provides many unexpected, eye-raising moments.",
      "author": "Matthew Toomey"
    },
    {
      "text": "The Shape of Water is the world as Guillermo del Toro sees it - full of injustice, but also, crucially, decency. Where others see pain, he sees hope, where others see fear, he sees compassion, where others see monsters, he sees friends.",
      "author": "Rohan Naahar"
    },
    {
      "text": "I felt nothing for the characters which makes the premise of rooting for the misunderstood a moot point.",
      "author": "Jamie East"
    },
    {
      "text": "All plot holes can be subsumed within the magical-realist tone for which Del Toro is famed. Yet there's an uncomfortable tension between the film's whimsical, Amélie-light (or, lighter) style and its clumsy political point-scoring.",
      "author": "Kevin Maher"
    },
    {
      "text": "I liked it well enough, but not as much as I should have.",
      "author": "Deborah Ross"
    },
    {
      "text": "More than its visual brilliance, what captivates you the most is Del Toro's ability to capture the minutiae of his ordinary characters' everyday life.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "Like the water of its title, the film is deep, mysterious, sparkling in some places and ominously murky in others; and containing wonders few can imagine.",
      "author": "Roe McDermott"
    },
    {
      "text": "Refreshingly, the film doesn't shy away from its characters' desires... The Shape of Water spells out in letters taller than the Empire State Building exactly what Fay Wray and King Kong wanted to do all along.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "The Shape of Water almost drowns in its own gorgeousness. It is a Beauty and the Beast fable where both get to be beautiful and neither has to be beastly.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "This is a mesmerising, profoundly emotional tale of vulnerable outsiders - and it's beyond gorgeous to look at.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "From the world's most over-rated A-list director, Guillermo del Toro, comes yet another visually distinctive, tonally flat work of glum fantasy...As usual, Del Toro's acolytes have promptly fallen into line praising this overlong pseudo sci-fi pap.",
      "author": "Jim Schembri"
    },
    {
      "text": "Del Toro's greatest work. Simply magnificent.",
      "author": "Matthew Thrift"
    },
    {
      "text": "Maybe it's not Del Toro's best movie, but it's one of the best movies we're going to see this year. [Full review in Spanish]",
      "author": "Yago García"
    },
    {
      "text": "Creating a convincing romance between a woman and a fishman is probably the film's biggest challenge, but sensitive performances ... make it not just believable but compelling.",
      "author": "Jonathan Hatfull"
    },
    {
      "text": "Del Toro also dedicates himself, professing his affection and admiration for cinema, paying homage, but very much in his own style. [Full Review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "Del Toro's Valentine to boundary-crossing love pours from the screen in ravishing torrents of feeling and style. And Hawkins is sublime.",
      "author": "Kevin Harley"
    },
    {
      "text": "It's the biggest risk of del Toro's career and it could not have paid off more.",
      "author": "Olly Richards"
    },
    {
      "text": "If I had more stars to give 'The Shape of Water,' you'd see an entire constellation before you.",
      "author": "Linda Cook"
    },
    {
      "text": "Pulses attractively like a luminous toyshop novelty; one inspired by The Creature from the Black Lagoon (1954).",
      "author": "Nigel Andrews"
    },
    {
      "text": "This is a monster movie made with real love.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Guillermo del Toro's wildly imaginative adult fairytale is an opulently entertaining monster fable that is spectacularly stylised and perversely enchanting.",
      "author": "Laura Delaney"
    },
    {
      "text": "Guillermo del Toro's best movie in years...",
      "author": "David Nusair"
    },
    {
      "text": "Certainly sufficiently engaging and visually-captivating to recommend for open-minded fans of the supernatural.",
      "author": "Kam Williams"
    },
    {
      "text": "This beautiful fable could be a Disney animation - if it wasn't for the sex and all the graphic violence. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "The Shape of Water is Guillermo del Toro's best film since Pan's Labyrinth. A charming, heartwarming modern fairytale with not an ounce of flotsam or jetsam, it's an idiosyncratic delight to behold.",
      "author": "Joel Harley"
    },
    {
      "text": "Sally Hawkins brings a combination of frailty and strength to her part in this movie that makes her performance the pillar on which everything else stands.",
      "author": "John Lui"
    },
    {
      "text": "... the director's imagination gives it an authentic vintage texture and enough doses of shocks and blood.",
      "author": "Kong Rithdee"
    },
    {
      "text": "In The Shape of Water, Guillermo del Toro plays the hits. [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "Del Toro's best work to date. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Never could the phrase \"an instant classic\" be applied so well. [Full Review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "It is this adult fairy tale's uninhibited embrace of love in all its euphoric glory that renders The Shape of Water such an unexpected delight.",
      "author": "Edmund Lee"
    },
    {
      "text": "A unique and original science fiction love story that is sometimes weighed down too heavily by an unoriginal villain plot line.",
      "author": "Alachia Queen"
    },
    {
      "text": "A tonally bonkers high-gloss mainstream-adjacent oddity ... Spielberg crossed with Jean-Pierre Jeunet crossed with David Cronenberg ... full of childlike wonder but also a childish desire to shock.",
      "author": "CJ Johnson"
    },
    {
      "text": "A picturesque fairytale told by a masterful storyteller, this monster movie from director Guillermo del Toro is the most emotionally resonant of his career.",
      "author": "Kiko Martinez"
    },
    {
      "text": "Del Toro's \"Shape\" holds water.",
      "author": "Charles Koplinski"
    },
    {
      "text": "While Sally Hawkins has been an exemplary actor for a long time now - go find her stunning work in last year's Maudie if you missed it - she takes everything to an imposing, yet intimate new level in The Shape of Water.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "\"The Shape of Water\" feels like it's yet another Del Toro work that would not be denied. Set amongst the ideological flux beneath the shiny cordiality of 60s post war America, instead of the Spanish Civil War, lies an escapist wonder.",
      "author": "Blake Howard"
    },
    {
      "text": "Sally Hawkins never talks in the movie, and I take that for granted a lot of the time...she doesn't say a word in the movie, but she says so much, which is a lot of damn talent.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "The Shape of Water tells an old tale with a bizarrely beautiful del Toro twist.",
      "author": "Rick Marshall"
    },
    {
      "text": "It is a story about outsiders and the very human need to connect. It is also about the love of movies, both the craft of movies and the way stories on screen captivate us and transport to another world.",
      "author": "Theresa Smith"
    },
    {
      "text": "... Del Toro's willingness to court absurdity and bad taste serves to guarantee his integrity, proving he hasn't entirely gone respectable.",
      "author": "Jake Wilson"
    },
    {
      "text": "The beauty of this film is Del Toro's gift of telling fantastical stories, but still giving them heart and crafting well-rounded characters throughout.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "The Shape of Water may be the balm or the escape we needed. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "This mash-up of alien and immigrant hardship, in which lonely Elisa finds sexual release with a sea creature, is pervy, ridiculous, and humorless.",
      "author": "Armond White"
    },
    {
      "text": "Shannon, Jenkins, Spencer and Michael Stuhlbarg all turn in fine work here, but this is still all about Jones and Hawkins.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "It's essentially like Bioshock meets The Creature from the Black Lagoon which, yes, is very weird, but it makes for an amazing movie.",
      "author": "Steph Cozza"
    },
    {
      "text": "... while there are several beautiful, aquatic set-pieces, the story shuffles predictably towards its conflict and conclusion. For those who want look and feel, this may be enough.",
      "author": "Sarah Watt"
    },
    {
      "text": "A visually spectacular fairytale, The Shape of Water is a dazzling film, anchored by a masterful performance from the effervescent Sally Hawkins.",
      "author": "Wenlei Ma"
    },
    {
      "text": "While the parallels Del Toro is drawing will be too clunky for some, the film's huge heart and good intentions are always on display.",
      "author": "Tony Stamp"
    },
    {
      "text": "While Hawkins and the supporting cast give great performances, Shannon steals the show.",
      "author": "Samfrey Tan"
    },
    {
      "text": "I suspect that many audiences may cringe at this film, or possibly be repulsed by it, but those who accept its weird premise will have their hearts and imaginations plucked.",
      "author": "Alan Zilberman"
    },
    {
      "text": "What a wonder! [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "Del Toro's absolute love for his craft and this story comes cascading out of every frame.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "It is at the same time many things that came before it, and something altogether new. To experience it is to love it.",
      "author": "John Serba"
    },
    {
      "text": "As an oddly engaging romance, The Shape Of Water floats.",
      "author": "Vicky Roach"
    },
    {
      "text": "For all its many accomplishments, the film falls a little short. I am not often enough moved by the film, and not entirely engaged to let it flow through my subconscious, as perhaps intended.",
      "author": "Andrew L. Urban"
    },
    {
      "text": "As enigmatic as its title. An exquisite piece of visceral filmmaking that leads with the heart...",
      "author": "Louise Keller"
    },
    {
      "text": "The best fantastic cinema. [Full review in Spanish]",
      "author": "Jessica Oliva"
    },
    {
      "text": "On paper it may sound indigestible, but on screen it's pure magic.",
      "author": "David Stratton"
    },
    {
      "text": "Guillermo del Toro invites us to take a touristic dip in his dreams. [Full review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "This is a gorgeous, sensual film, a tale filled with kindness and evil and the battle between the two. Be sure to suspend disbelief at the door.",
      "author": "Diane Pershing"
    },
    {
      "text": "... A testament to the power of love, a force so strong it transcends the human constructs of speech and language ...",
      "author": "Greg Maki"
    },
    {
      "text": "The flamboyantly peculiar erotics Shape of Water have not stopped critics and audiences from applauding it as a masterpiece. I applaud it for a different reason: for its ability to make a freaky fable about interspecies sex go mainstream.",
      "author": "Kate Knibbs"
    },
    {
      "text": "What I can't forgive is how static and simplistic these characters are [...] With no ambiguity, there's nothing for my brain to do except passively watch these soggy characters as they wade to a predictable, saccharine conclusion.",
      "author": "Molly Laich"
    },
    {
      "text": "Without being obvious about it, \"The Shape of Water\" is a moving fable about outsiders and tolerance, about seeing beyond differences and finding connection; it is a soaring, magical joyride that gives new life to a tale as old as time.",
      "author": "Loren King"
    },
    {
      "text": "Del Toro's typically lusty visuals and the impressive mix of practical and computer-enhanced effects that comprise his fish-man smother the would-be intricacies of his drama.",
      "author": "J. Olson"
    },
    {
      "text": "A sea of perfectly assembled elements, The Shape of Water truly feels like a film that no one else could have made.",
      "author": "Sarah Ward"
    },
    {
      "text": "For me, this manner of finding your beloved pretty much died with the tide.",
      "author": "Jules Brenner"
    },
    {
      "text": "The Shape of Water is a cinematic fight for that world, one that could be born out of creativity and dreaming. Out of romance. Out of the movies.",
      "author": "Bill Arceneaux"
    },
    {
      "text": "Del Toro's sheer joy of filmmaking is contagious, from precision chase scenes and glimpses of period TV shows like Mr. Ed and Dobie Gillis, cannily chosen to inform the story, to his gleeful homage to vintage Hollywood musicals...",
      "author": "Lisa Jensen"
    },
    {
      "text": "For all the sumptuous style and lush visuals, The Shape of Water is, at its heart, a simple fish-out-of-water story, both figuratively and literally.",
      "author": "Cameron Meier"
    },
    {
      "text": "A magnificent story. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "The Shape of Water is a eternal story for our time, about loving and being loved, speaking and being heard, and compassion for humanity.",
      "author": "Brooke Corso"
    },
    {
      "text": "The most elaborate explication to date of del Toro's belief that monsters, like traditional religious martyrs, are 'innocents' whose torments testify to their 'state of grace.'",
      "author": "John Beifuss"
    },
    {
      "text": "A splendid entertainment, well-modulated by a steady directorial hand, and sincere in its depiction of individuals whose physical limits are meant to propel them towards wondrous - if suspenseful - adventures.",
      "author": "David Keyes"
    },
    {
      "text": "Film making at its best. Great story, great cast and a lesson to be learned for those who care.",
      "author": "Ron Wilkinson"
    },
    {
      "text": "The Shape of Water is both surprisingly sweet and shockingly sexy. And it's one of the best movies of the year.",
      "author": "Brandy McDonnell"
    },
    {
      "text": "The Shape of Water adds the species barrier to [the film's] group of segregating factors, and in so doing folds in an even larger idea, namely good old-fashioned biophilia.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "This holiday's most romantic and life-affirming feature might be The Shape of Water, which depicts a virtually silent love affair between a cleaning woman and humanoid river monster.",
      "author": "Al Hoff"
    },
    {
      "text": "Each piece fits gently, irresistibly into place making The Shape of Water one of the year's finest films.",
      "author": "Steve Persall"
    },
    {
      "text": "Del Toro makes it work using every tool in his formidable tool box, which include a textural richness in production design typical of the director.",
      "author": "Randall King"
    },
    {
      "text": "The thematic masochism is intrinsic to del Toro's art -- miserably picking the scab of one's self-esteem. But the architecture here is too cardboard, despite a high level of craft among the cast, to make us feel the pain, too.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "The movie's worldview is as easy to like as the protagonist and her friends, but del Toro lays it on so thick that there's no room for counterargument or even independent thought.",
      "author": "Ben Sachs"
    },
    {
      "text": "With visuals offering unique worlds that somehow weave into a fantastical whole, this film makes for one extraordinary water ballet.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "The film is the equivalent work of an artist, who, though beginning with a solid, well-rounded image...just didn't allow it to find the proper balance. In the end, perhaps The Shape of Water's ambition just exceeded its grasp.",
      "author": "David Fontana"
    },
    {
      "text": "Del Toro is simply too talented a visual stylist to produce something dull and inanimate, but he goes so overboard, it seems, you either buy in and swoon, or stand there shaking your head.",
      "author": "Piers Marchant"
    },
    {
      "text": "A picture postcard in production design, del Toro's talents have never been better used.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "\"The Shape of Water\" is director Guillermo del Toro's finest film, a lovely, empathetic tribute to Old Hollywood, monster movies, outsiders and love that could only come from the mind of the visionary filmmaker.",
      "author": "Adam Graham"
    },
    {
      "text": "Guillermo del Toro directs this beautifully designed but clumsily arranged sci-fi love story about a mute janitor who falls for a magical creature.",
      "author": "Daniel Barnes"
    },
    {
      "text": "There is, to be sure, nothing remotely new about the story of the beauty and the beast... Nevertheless it took audacity and nerves of steel to go all the way with it, which is what del Toro does.",
      "author": "Jeff Simon"
    },
    {
      "text": "The Shape of Water is one of the year's most gorgeous, romantic and unusual films, a fairy tale for troubled times that is full of imagination.",
      "author": "Michael Smith"
    },
    {
      "text": "Employing some good, old-fashioned movie magic, del Toro has crafted a film that borders on sensory overload. It's wondrous, odd and visually arresting from the opening seconds.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "Beautiful and occasionally moving, if not quite as emotionally rich as it aims to be.",
      "author": "Josh Bell"
    },
    {
      "text": "The fact that The Shape of Water's two leads are both incapable of speech doesn't render it any less capable of forging an emotional connection with its audience.",
      "author": "Karen Han"
    },
    {
      "text": "A wonderfully weird love story that plays like an adult fairy tale, it's a fantastical delight, one of those rare start-to-finish treats that succeeds on every level.",
      "author": "Mike Scott"
    },
    {
      "text": "This may not be among Del Toro's best films, but this tender love story fully belongs on the same shelf.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "The more I try to find some kind of justifiable meaning and relevance, the more I find The Shape of Water a loopy, lunkheaded load of drivel.",
      "author": "Rex Reed"
    },
    {
      "text": "That del Toro can seamlessly meld the whimsical, playful and profound into a moving film is a tribute to his formidable imagination.",
      "author": "James Greenberg"
    },
    {
      "text": "Guillermo Del Toro's magical masterpiece is simply a fever dream of a romantic movie - and then some.",
      "author": "Pete Hammond"
    },
    {
      "text": "The Shape of Water is breathtaking to behold and the most romantic movie you'll see about a woman falling in love with a fish man.",
      "author": "Kristen Lopez"
    },
    {
      "text": "In The Shape of Water, del Toro and co-screenwriter Vanessa Taylor make it appear easy to do something that is really quite difficult-grounding the film from start to finish in a fictional world that has its own inner logic.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "The Shape of Water is whimsical, boldly original, defiantly weird, occasionally grotesque, and beautifully shot...yet, despite all of that, the film didn't quite work for me.",
      "author": "Max Weiss"
    },
    {
      "text": "Guillermo del Toro has given us a movie lover's dream in a romantic fantasy/thriller that finds a mute cleaning woman (the brilliant Sally Hawkins) becoming infatuated with the mysterious subject of a top-secret (and mean-spirited) experiment.",
      "author": "John Urbancich"
    },
    {
      "text": "Above all, del Toro convincingly pulls us into his world with water defining every scene, the most powerful element that like love, \"takes the shape of the recipient,\" hence the title. Love has no single defined shape or restrictive dimension.",
      "author": "Diane Carson"
    },
    {
      "text": "The Shape of Water is strange, sweet, and wonderful, and easily the greatest film ever made about a mute cleaning lady who falls in love with an amphibious fish man.",
      "author": "Erik Henriksen"
    },
    {
      "text": "del Toro runs with it, delivering his best effort in years, preserving his idiosyncrasies and extremities with an often wonderfully bizarre movie.",
      "author": "Brian Orndorf"
    },
    {
      "text": "...you have to admire del Toro for pressing full bore into his make-believe world with such nightmarish whimsy. The embittered, black Cold War coal he collects in The Shape of Water is somehow crushed into a diamond of a film.",
      "author": "Elias Savada"
    },
    {
      "text": "Enchanting, intelligent, tender, and profoundly human with a perfect balance of Truth and Spectacle. One of the best films of the year!",
      "author": "Avi Offer"
    },
    {
      "text": "Guillermo del Toro's latest is a virtuosic love letter to classic cinema of multiple eras and genres. It's a shame, then, that it's so lacking in substance and coherent purpose.",
      "author": "Ken Eisner"
    },
    {
      "text": "'The Shape of Water' is one of the best films of the year. It ... has del Toro's fingerprints all over it. It is a dreamy, albeit, at times, violent, feature that is more classic animated Disney than Universal horror, in story and presentation.",
      "author": "Bob Bloom"
    },
    {
      "text": "Director Guillermo del Toro (Pan's Labyrinth) has an expansive imagination, but his limitations as a storyteller have created a film that is beautiful but cluttered, visionary but formulaic.",
      "author": "Bennett Campbell Ferguson"
    },
    {
      "text": "The visual stylist spins an adult fairy tale that takes elements from \"Beauty and the Beast\" and recasts them in an alternative universe that's a wonderfully rendered twist on our own.",
      "author": "Cary Darling"
    },
    {
      "text": "I love how del Toro trusts his audience, which means he's willing and daringly able to offer us a dizzying marriage of the sensual and also possible salvation.",
      "author": "tt stern-enzi"
    },
    {
      "text": "\"The Shape of Water\" is one of the best films of the year.",
      "author": "Calvin Wilson"
    },
    {
      "text": "Del Toro somehow manages to keep the deeply weird mash-up of ideas and images coherent, unified by style and mood.",
      "author": "Gary Thompson"
    },
    {
      "text": "Some of the plot machinations of The Shape of Water don't live up to the magic Hawkins and Jones conjure in their scenes together. When they share the screen, on land or in water, their passion washes over the audience like a cleansing rain.",
      "author": "Sean P. Means"
    },
    {
      "text": "The pieces were there for one of the year's best films, but it may have been better served with a friendship. Fish-men and women can be friends, you know.",
      "author": "Brad Keefe"
    },
    {
      "text": "While viewers may have to suspend disbelief for some of the film's plotting and action, the dazzling combination of romance, fantasy and satire is highly satisfying.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "The artistic touches of writer-director Guillermo del Toro are evident in this film. The acting is excellent, especially by Sally Hawkins. Michael Shannon is one of the best villains on screen these days, and he is great in this film.",
      "author": "Robert Roten"
    },
    {
      "text": "Del Toro once again shines and gets the most out of his amazing cast... Sally Hawkins leads an incredible ensemble in one of the most imaginative, emotional films of the year.",
      "author": "Kristian Harloff"
    },
    {
      "text": "One of the best movies of the year sees a finely crafted work of imagination from a true master in Guillermo del Toro... it's a triumph of human spirit that isn't necessarily limited to human beings.",
      "author": "Mark Ellis"
    },
    {
      "text": "striking, at times unsettling, and at other times deeply moving",
      "author": "James Kendrick"
    },
    {
      "text": "You never know where \"The Shape of Water\" is going. But, like water, you let it engulf you and sweep you away.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Call it a modern-day Creature from the Black Lagoon, or better still call it a masterpiece of storytelling and filmmaking that knows how to resonate with the audience.",
      "author": "George M. Thomas"
    },
    {
      "text": "It's the \"Amelie\" and \"Creature from the Black Lagoon\" mash-up you never knew you wanted.",
      "author": "Gary Dowell"
    },
    {
      "text": "Sensuous and sumptuous, this poignant, fantastical fable is an enchanting, redemptive, interspecies love story.",
      "author": "Susan Granger"
    },
    {
      "text": "Eggs, water, and-yes-sex all play crucial and overlapping roles in director Guillermo del Toro's The Shape of Water, an adult fairy tale that is at once deeply familiar and utterly original.",
      "author": "Christopher Orr"
    },
    {
      "text": "Del Toro has given us a small piece of cinematic magic with The Shape of Water.",
      "author": "Travis Hopson"
    },
    {
      "text": "Further makes the case that no one does fantasy on del Toro's level.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "It's a moving and charming film that doesn't shy away from the ugliness of life, choosing instead to celebrate beauty wherever it may be found.",
      "author": "Rob Dean"
    },
    {
      "text": "\"A gorgeously rendered story of love, passion, and beauty\"",
      "author": "Stephen Silver"
    },
    {
      "text": "Del Toro exceeds self with this modern fairy-tale/Gothic romance. Hawkins is stunning. The La-La Land of monster movies.",
      "author": "James Verniere"
    },
    {
      "text": "The cast is wonderful-Jenkins is warm and lovable, Spencer is funny, and Shannon, as always, plays the perfect snake. But it's Hawkins' silent performance that's the knockout here.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "... this is one of those adventurous pieces of cinematic imagination I find I like more and more as time goes by.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "... the film is simply stunning to behold.",
      "author": "Beth Accomando"
    },
    {
      "text": "Guillermo del Toro returns to fine form with this fairy tale-cum-horror story that effectively echoes the texture, mood and style of his 2006 gem, \"Pan's Labyrinth.\"",
      "author": "Tom Meek"
    },
    {
      "text": "Enchanting and annoying in equal measures.",
      "author": "Sean Burns"
    },
    {
      "text": "It's a testament to the storyteller's skill that he manages to cram [so much] into his narrative with nary a lump and still keep his characters dancing with only one or two minor missteps.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Perhaps never quite as poetic as its wonderful title, The Shape of Water nonetheless allows del Toro to give full vent to an imagination into which movies flow, cinematic tributaries that fuel his sense of invention.",
      "author": "Robert Denerstein"
    },
    {
      "text": "Perhaps [Del Toro's] loveliest film so far, easily on par with his masterpiece \"Pan's Labyrinth.\"",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Few films leave me awestruck for weeks. But the way Guillermo del Toro juggles heart, imagination, suspense, social history, outsider attitude and weird artistry so successfully in this Cold War monster romance continues to astound me.",
      "author": "Bob Strauss"
    },
    {
      "text": "It's gorgeous and weird, heart-wrenching and utterly unforgettable.",
      "author": "Rebecca Murray"
    },
    {
      "text": "The Shape of Water opens and closes on a sub-aqueous scene, but everything else about it is buoyant and uplifting.",
      "author": "Chris Knight"
    },
    {
      "text": "Beautifully shot, designed, and acted but dramatically inert.",
      "author": "Sonny Bunch"
    },
    {
      "text": "To see The Shape of Water is to be catapulted into a dream world of dancing raindrops and swirling colours that toggle between scary and cool. Smart money says you'll enjoy the sensation either way.",
      "author": "Kim Hughes"
    },
    {
      "text": "As much as The Shape of Water's disparate parts shouldn't work - and as much as its \"originality\" is sourced from the thousands of other fables del Toro has consumed over his lifetime - it does, in the end.",
      "author": "Barry Hertz"
    },
    {
      "text": "Hawkins, topping even her remarkable performance in Maudie, is captivating, sad and sensual.",
      "author": "Richard von Busack"
    },
    {
      "text": "In a career of stubbornly idiosyncratic work, it's a masterpiece on par with Pan's Labyrinth, without a hint of creative interference from outside forces.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "To place yourself in GDT's hands, as he tells the type of story he tells better than anyone else, is a rich pleasure.",
      "author": "Chris Klimek"
    },
    {
      "text": "The bad guys are a bit cliched, but you've never seen a film with the drifty, incredibly dreamy look of this masterpiece.",
      "author": "Tim Appelo"
    },
    {
      "text": "The Shape of Water is beautifully crafted on a technical level, just like del Toro's other films, but it's no more communicative than Pacific Rim. And like Crimson Peak, it renders the idea of romantic melodrama oddly abstract.",
      "author": "Jesse Hassenger"
    },
    {
      "text": "This is a very funny premise, but from it, del Toro and co-writer Vanessa Taylor expand the film's ideas and setups, until it seems ready to burst.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The Shape of Water makes the deepest dive into romance this year of any movie - literally, figuratively and on both sides of the camera.",
      "author": "Peter Howell"
    },
    {
      "text": "Magical, thrilling and romantic to the core, a sensual and fantastical fairy tale with moral overtones, it's a film that plays by all the rules and none of them, going its own way with fierce abandon.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Del Toro is an imaginative storyteller, and this is a great fairy tale -- as well as a subversive inversion of the monster movie. If you have a streak of rebellion in you, you'll love it.",
      "author": "Charles Ealy"
    },
    {
      "text": "Guillermo del Toro's Cold War mashup of outsider love story and Creature from the Black Lagoon is gorgeously realized and impeccably acted but simplistically written.",
      "author": "Chris Barsanti"
    },
    {
      "text": "A wondrous adult fairy-tale played out with impeccable cinematic control...a magical and moving experience.",
      "author": "Frank Swietek"
    },
    {
      "text": "Contrasted against the movie's three-pronged institutional threats their love story is one we're happy to root for. Up with love! Down with authoritarianism!",
      "author": "Andy Crump"
    },
    {
      "text": "As prodigious as del Toro's vision and craftsmanship are, it's Hawkins who gives palpable life to his deepest ideals, and their undertow of longing for connection, not simply as a matter of romantic love, but civic virtue.",
      "author": "Ann Hornaday"
    },
    {
      "text": "The Shape of Water is a heartfelt and moving mash note to outsiders, misfits, and the creatures (or so says the status quo) walking among us.",
      "author": "Marc Savlov"
    },
    {
      "text": "The movie is bracketed with images of Elisa floating. By the end, the audience will feel we are floating as well.",
      "author": "Nell Minow"
    },
    {
      "text": "More than any movie in recent memory, this is one you really need to discover for yourself.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "It's a finely calibrated film, brimming with romance, excitement and humanity.",
      "author": "Chris Vognar"
    },
    {
      "text": "\"The Shape of Water\" is a love story like no other, and it features one of the year's most heart-wrenching performances nestled in a supreme confabulation of cinematic craft.",
      "author": "Ty Burr"
    },
    {
      "text": "At the start, I worried that the film might prove merely winsome, like a Maryland \"Amélie,\" but Hawkins makes it taut and fierce.",
      "author": "Anthony Lane"
    },
    {
      "text": "\"The Shape of Water\" is brilliant, but sick - or maybe it's sick, but brilliant. In any case, it's something to see.",
      "author": "Mick LaSalle"
    },
    {
      "text": "\"The Shape of Water\" is devoted, madly, to the notion of love as a state of liquid bliss, and we see that bliss and a hundred other emotions in Hawkins' nonverbal (mostly) but endlessly expressive performance.",
      "author": "Michael Phillips"
    },
    {
      "text": "Del Toro has an eye for violence, kink, and dangerous desires, but his movies usually make me wish he were more willing to exploit them. He hasn't made a movie as interesting as his interests. The Shape of Water, for all of its beauty, is no different.",
      "author": "K. Austin Collins"
    },
    {
      "text": "It's the actors who give Shape its shape, sculpted by del Toro's affinity for the underdog.",
      "author": "Kelly Vance"
    },
    {
      "text": "Del Toro might be criticised for relying heavily on archetypes in his characterisation, but such is the nature of fairy tales, and finely detailed performances bring each one of them to life.",
      "author": "Jennie Kermode"
    },
    {
      "text": "Guillermo del Toro's \"The Shape of Water\" is like a beautiful painting you keep visiting at your favorite museum, because it continues to reveal its brilliant magic in new and different ways.",
      "author": "Richard Roeper"
    },
    {
      "text": "The plot is very, very similar to that of a once well-known play, Paul Zindel's \"Let Me Hear You Whisper.\"",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Whether you're a hopeless romantic or a sci-fi geek, we all could stand to both receive and give a little more compassion right now.",
      "author": "Arianna Davis"
    },
    {
      "text": "Want a picture of the culture Weinstein refers to? Watch The Shape of Water. Meet Richard Strickland.",
      "author": "Elena Nicolaou"
    },
    {
      "text": "Del Toro has completely outdone himself with this spectacularly beautiful and meaningful love story.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "This fertile product of del Toro's vivid imagination is a fabulous beacon of hope contrasted to the turbulent era of 1962 in world history.",
      "author": "David Kaplan"
    },
    {
      "text": "It will go down as one of the most magical fairy-tales of its generation and is so mesmerizing that Pan's Labyrinth no longer holds the title of Guillermo del Toro's masterpiece. The Shape of Water is the absolute best film of the year.",
      "author": "Robert Kojder"
    },
    {
      "text": "'Shape of Water' is Del Toro's best American movie yet.",
      "author": "Scott Mendelson"
    },
    {
      "text": "Allegory for the politics of the modern moment careen beneath nearly every complication, and yet del Toro keeps to the business of his lovingly designed sea of surfaces and... a single, singular theme throughout: loneliness.",
      "author": "Ray Pride"
    },
    {
      "text": "This is about a woman discovering her voice (literally) via a fish-man who is unavoidably attractive. She's Belle, but hungrier, more resolute. And it's about time we handed a tenacious woman some decision-making power.",
      "author": "Rebecca Farley"
    },
    {
      "text": "It's hard to come away from this film and not believe that, in his heart, writer/director del Toro is a romantic.",
      "author": "James Berardinelli"
    },
    {
      "text": "The Shape of Water is perhaps the finest film ever to be directed by Guillermo del Toro and actress Sally Hawkins delivers a top-notch performance in the Cold War-set film.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Of all the big year-end films, Guillermo del Toro's The Shape of Water is the most deeply moving.",
      "author": "Stuart Klawans"
    },
    {
      "text": "One could speculate that this is del Toro's origin story for \"Hellboy's\" Abe Sapien...but the film also harkens back to his love of old monster movies...distinctly del Toro, yet it also recalls the films of Marc Caro and Jean-Pierre Jeunet",
      "author": "Laura Clifford"
    },
    {
      "text": "[A] labored attempt at a gentle fairy tale.",
      "author": "Tim Brayton"
    },
    {
      "text": "It's beaming with life and beautiful commentary on love, ignorance and the concept of monsters.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "If this story is not enough of a spike for your imagination, try taking in the visually grandiose underwater scene between monster and damsel.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The Shape of Water is my favorite film of 2017, genre or otherwise, and it's no secret that my deep admiration for the work of del Toro rivals the way that the maestro himself worships at the altar of movie monsters.",
      "author": "Heather Wixson"
    },
    {
      "text": "A fantasy thriller for the ages!",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "If only the Frankenstein monster had a loving caretaker like the one played by the inimitable Sally Hawkins!",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Guillermo Del Toro has crafted a soaring, heavenly feature that's both a love letter to cinema and an anthem for outsiders everywhere.",
      "author": "Courtney Howard"
    },
    {
      "text": "Del Toro might have made The Shape of Water, but Sally Hawkins owns it.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Anchored by a soul-stirring performance by Sally Hawkins, The Shape of Water is a rapturous, romantic allegory about otherhood set during the Cold War.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "The Shape of Water rekindles a sense of wide-eyed wonder that's all too rare in contemporary cinema. Computer imagery can create amazing sights, but only a master moviemaker (and movie lover) could have fashioned this dazzling, one-of-a-kind experience.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Even better than its offhand wittiness, its aesthetic splendor or its shrewd social commentary, however, is its headliner.",
      "author": "Nick Schager"
    },
    {
      "text": "...Beauty and the Beast, with no need for a transformative prince.",
      "author": "Josh Larsen"
    },
    {
      "text": "... marvelously rhapsodic in ways that recall films like Jean Cocteau's \"Beauty and the Beast\" without ever seeming slavish.",
      "author": "Peter Rainer"
    },
    {
      "text": "A sensuous film that is both a fairy tale and a socially relevant portrait of the prejudices afoot in our times.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The Shape of Water is a good effort from Guillermo Del Toro. It's not on par with his best work, but that's a pretty high standard. He nailed the casting of Sally Hawkins.",
      "author": "Julian Roman"
    },
    {
      "text": "Guillermo del Toro reinvents classic monster movie tropes to expose the \"great\" white privilege of America's past as the true monster.",
      "author": "David Crow"
    },
    {
      "text": "But with all its grandeur and charm, the fact that this is a love story between a woman and a monster is too ridiculous to ignore.",
      "author": "Candice Frederick"
    },
    {
      "text": "... Sally Hawkins gives a five-star performance as Elisa...",
      "author": "Jenni Miller"
    },
    {
      "text": "... showcases the versatility of a director in top form without drowning in sanctimony or sentiment.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "del Toro uses the visual language of fantasy and sci-fi in their simplest, most familiar forms, imbuing them with his childlike sensibility that he balances in turn with his signature maturity.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Even if you're not transported by every minute of the film's story, though, del Toro creates such a sumptuous visual world that it's impossible to take your eyes off the screen.",
      "author": "Dana Stevens"
    },
    {
      "text": "Every frame is enchanting, bold in color, and flush with emotion, then made exquisite by Alexandre Desplat's Parisian-inspired score.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Your eyes may well manufacture some saltwater of their own as the story winds on its unpredictable, ever-heart-melting path.",
      "author": "Phil Villarreal"
    },
    {
      "text": "There's enough dreamy beauty here to smooth out the rough edges. (Fish sex, anyone?)",
      "author": "Mara Reinstein"
    },
    {
      "text": "... del Toro's film is poetic, sumptuous, emotionally complex, and yet almost strikingly simple in its narrative.",
      "author": "Germain Lussier"
    },
    {
      "text": "Hawkins sells it without a single line of spoken dialogue to rely upon, capturing the scope of Elisa's epic journey within from lonely despair to hope and purpose, and filling every scene she's in with the joy of loving, of feeling, for the first time.",
      "author": "Robert Levin"
    },
    {
      "text": "Del Toro's 10th feature, and approximately the 10th to have macabre, gothic themes, beautiful imagery, and a dark sense of humor.",
      "author": "Eric D. Snider"
    },
    {
      "text": "\"The Shape of Water\" is a flow of sumptuous images set to music, a flood tide of feelings with a mythic undertow.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "This adult fairy tale is perhaps the riskiest film of Guillermo del Toro's career, but those risks generally pay off. A visually spectacular fantasy romance.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Nothing is out of place in The Shape of Water, especially its heart. The cast is universally flawless, as is the lavish production design of Paul. D. Austerberry and the sumptuous cinematography of Dan Laustsen.",
      "author": "Jake Coyle"
    },
    {
      "text": "It builds rather than stagnates, and the sadness of its characters and the film's visuals mesh wonderfully with the heroism and uplifting spirit of the plot.",
      "author": "Gregory Wakeman"
    },
    {
      "text": "It's both weird and wonderful.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "Ultimately, this is a film from a group of terrific talents that never quite comes together the way you'd hope. It's just too fluid to wholly take shape.",
      "author": "Sara Stewart"
    },
    {
      "text": "...the nicest way I can describe it is E.T., phone Harlequin.",
      "author": "Kyle Smith"
    },
    {
      "text": "Perhaps foremost, the film plays like an ode to the black-and-white staples that helped forge del Toro's passion for movies, drawing upon those old-fashioned virtues even as the director seeks to update them with a distinctive spin.",
      "author": "Brian Lowry"
    },
    {
      "text": "In a corporate-run franchise-driven industry, del Toro's movies are refreshingly personal. All of this is true of The Shape of Water, but still, something's off.",
      "author": "Sheila O'Malley"
    },
    {
      "text": "A role-reversal monster movie with gorgeous visuals from Guillermo del Toro and a knockout performance from Hawkins.",
      "author": "Rafer Guzman"
    },
    {
      "text": "\"The Shape of Water\" is partly a code-scrambled fairy tale, partly a genetically modified monster movie, and altogether wonderful.",
      "author": "A.O. Scott"
    },
    {
      "text": "Thus begins one of the strangest yet most beautiful courtships you will see this year, a melding of horror tale, Cold War sci-fi, and musical homage [that is] a love letter to the idea of love itself.",
      "author": "Don Kaye"
    },
    {
      "text": "The Shape of Water has been made with a level of craftsmanship that should be the envy of most filmmakers, but the impudent, unruly streak that so often gives del Toro's films their pulse has been airbrushed away.",
      "author": "Chuck Bowen"
    },
    {
      "text": "The scenes that take place in a seemingly undersea world are stunning, and del Toro's filmmaking technique buoys a love-story narrative that at times feels a little too straightforward for its unorthodox conceit.",
      "author": "Brian Truitt"
    },
    {
      "text": "Guillermo del Toro makes you believe in cross-species attraction in this beautifully crafted fantasy tale of a mute cleaning woman who bonds with an exotic amphibian.",
      "author": "Kevin Lally"
    },
    {
      "text": "Beautiful. Yes, there's more to Guillermo Del Toro's otherworldly fantasy, but, for now, let's just give a sigh of relief and enjoy the fact that this is, indeed, a work of beauty.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Under all that rubber and slime, 6-foot-4 actor Jones continues to impress as the go-to monster for Del Toro and the rest of Hollywood. He's as synonymous with practical effects as Andy Serkis is with performance capture.",
      "author": "Ethan Sacks"
    },
    {
      "text": "Del Toro is a world-class film artist and he proves it in this Cold War romance about a mute cleaning lady (Sally Hawkins, unforgettable) who falls for an amphibious creature. Don't t analyze how del Toro does it. Just dive in. There's magic in it.",
      "author": "Peter Travers"
    },
    {
      "text": "It is poetic yet accessible, and earnest without being maudlin. Its biggest flaw is that its plot ultimately takes a surprisingly conventional route for such an otherwise unconventional Hollywood release.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "Guillermo del Toro's Free Willy, and all that entails.",
      "author": "Fred Topel"
    },
    {
      "text": "A heartfelt, emotional and sincere film. [Full review in Spanish]",
      "author": "Arturo Aguilar"
    },
    {
      "text": "Whatever small reservations, this is a rare magical experience aimed at adults and looks and sounds delicious.",
      "author": "Nathaniel Rogers"
    },
    {
      "text": "... in gorgeous visual ways, unimaginable depth of human feeling.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "A tribute to cinema by a dreamy worker who wants to embrace the world with a message of acceptance of the other. [Full review in Spanish]",
      "author": "Aurélie Dupire"
    },
    {
      "text": "A song to \"different\" beauty, an ode to the fraternity of the marginalized in a society marked by intolerance... [Full review in Spanish]",
      "author": "Manu Yáñez"
    },
    {
      "text": "Del Toro has said that this film is a long-gestating labor of love, a devotion that shows in every frame. It's so carefully done, but still thumps with a genuine, visceral heartbeat.",
      "author": "Richard Lawson"
    },
    {
      "text": "Guillermo del Toro's The Shape of Water elegantly blends whimsical fairy tale with a fresh spin on classic monster movies for a delightful experience.",
      "author": "Molly Freeman"
    },
    {
      "text": "The Shape of Water upends a classic monster movie trope for a more woke world.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "The Shape of Water is transportive.",
      "author": "Susan Kemp"
    },
    {
      "text": "Thank the movie gods for Guillermo del Toro. One of our best living filmmakers, del Toro crafts gorgeous, poetic films that combine genres to great effect. With The Shape of Water, del Toro may have made his masterpiece.",
      "author": "Chris Evangelista"
    },
    {
      "text": "There's a lot to love about The Shape of Water; if only it came together better.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Beautiful, sensuous, fully wearing its heart on its sleeve, with top-notch performances and a wondrous soundtrack, The Shape of Water does not hold back on emotional and physical connections as the only place of safety in a frightening world.",
      "author": "Shelagh Rowan-Legg"
    },
    {
      "text": "Like the director's best works, The Shape of Water blends lonely outcasts, chimerical beings, meticulous design, and mid-20th-century political strife.",
      "author": "Steven Mears"
    },
    {
      "text": "Del Toro has struck gold with The Shape of Water.",
      "author": "Ryan Morris"
    },
    {
      "text": "The Shape of Water is del Toro's finest film since Pan's Labyrinth, and certainly the best film he has ever made in the English language.",
      "author": "Alistair Ryder"
    },
    {
      "text": "One of the most elaborate films in years. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "The kind of film that is able to follow us. [Full Review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "A movie mash-up of lump-in-your-throat romance, espionage thrillers, and then some, The Shape of Water will be catnip for unapologetic movie musicals fans.",
      "author": "Kent Turner"
    },
    {
      "text": "It's a visual masterwork",
      "author": "Jordan Ruimy"
    },
    {
      "text": "Blending '50s creature features, dark fairy tales and old-fashioned swooning romance, the latest film from writer-director Guillermo del Toro is pure movie magic.",
      "author": "Matthew Turner"
    },
    {
      "text": "The Shape of Water may not be suitable for children but it has enough disarming charm to briefly make you feel like one.",
      "author": "Raphael Abraham"
    },
    {
      "text": "More than the scaly, expressive beauty of the creature, Sally Hawkins is the marvel here. Her flutter of sign-language and the sly wit and open ache of her eyes make her silence seem immaterial.",
      "author": "Nick Hasted"
    },
    {
      "text": "Del Toro has conceivably fashioned in his beautiful beast a 21st-century iteration of Carmen Miranda's fruit suit, a shimmering shell that attends a host of fantasies.",
      "author": "Jay Kuehner"
    },
    {
      "text": "Shannon, Jenkins, Spencer and Stuhlbarg are precision-cast but it's Hawkins that will steal your heart.",
      "author": "Emma Simmonds"
    },
    {
      "text": "The Shape of Water is del Toro at his most restrained, his flamboyant style now tempered to fit the delicate little fairy tale that gives the film its beating heart.",
      "author": "Tomas Trussow"
    },
    {
      "text": "It's like it was shot in his traveling museum exhibit, and I, for one, didn't want to leave. What a divine movie this is.",
      "author": "Jason Bailey"
    },
    {
      "text": "The Shape of Water offers hope that hearts and minds can truly be changed for the better, even in the most stubborn of individuals.",
      "author": "Soraya Nadia McDonald"
    },
    {
      "text": "The craft of Guillermo del Toro's latest is top notch.",
      "author": "Matt Hoffman"
    },
    {
      "text": "A man with a mind for the fantastical and a heart for humanity, del Toro may be one of our most humanist directors working today ...",
      "author": "Allyson Johnson"
    },
    {
      "text": "The Shape of Water unfolds as a shimmering ode to classic cinema.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "Rather than engaging with the genre in a meaningful way, [Guillermo] del Toro's film is boring, broad, and unoriginal, without any magic or charm.",
      "author": "Chelsea Phillips-Carr"
    },
    {
      "text": "Beautifully and imaginatively crafted with wondrous cinematography.",
      "author": "Dwight Brown"
    },
    {
      "text": "Everything in this fairytale is thought out, conceptualized and executed with detail. [Full Review in Spanish]",
      "author": "Alfonso Flores-Durón y Martínez"
    },
    {
      "text": "Del Toro confidently and consistently hits all the right notes, maintaining a rich, transportive, lyrical tone throughout.",
      "author": "George Sully"
    },
    {
      "text": "The Shape of Water demonstrates Guillermo del Toro's masterful way with visual storytelling, but suffers slightly from narrative distractions.",
      "author": "Darren Ruecker"
    },
    {
      "text": "Filmed in aquatic hues and bathed in nostalgic mid-century style, The Shape of Water is both a love story and a love letter to monster movies, musicals, and classic cinema.",
      "author": "Sarah Kurchak"
    },
    {
      "text": "The Shape of Water is a must-see mesmerizing fairy tale for adults.",
      "author": "Scott Menzel"
    },
    {
      "text": "Arguably del Toro's best film to date (yes it may be better than Pan's Labyrinth).",
      "author": "Jimmy Nsubuga"
    },
    {
      "text": "I don't know if it's Del Toro's best film but it's his most mature and, paradoxically, accessible work. [Full review in Spanish]",
      "author": "Oscar Uriel"
    },
    {
      "text": "What results is a story that feels both fresh and timeless - and desperately needed, at a time when the world feels mean. Let's hope this one sticks around a while.",
      "author": "Angie Han"
    },
    {
      "text": "It is a story of dreams made real, and the rare film that can rip your heart open and leave your brain intact.",
      "author": "Noah Gittell"
    },
    {
      "text": "Del Toro made a masterpiece that will remind you what you love about the movies.",
      "author": "Oliver Whitney"
    },
    {
      "text": "The story goes exactly where you think it will. It's an utterly lovely, complacent movie, too comfortable with itself to generate real dramatic tension.",
      "author": "David Edelstein"
    },
    {
      "text": "The Shape Of Water reaches out, hoping you'll reach back. Just take care not to cut yourself on its claws.",
      "author": "Norman Wilner"
    },
    {
      "text": "It is a difficult and beautiful dream - and del Toro makes it feel like just a bit less of a fantasy.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "The Shape of Water is a film that wears its heart on its sleeve. Its overtness, its accessibility, the transparent meaning of its abiding images, will surely give it a longevity.",
      "author": "Sophie Monks Kaufman"
    },
    {
      "text": "The beastliness offsets the beauty nicely, like splotches of grisly red on the film's lustrous, sea foam-green color palette.",
      "author": "A.A. Dowd"
    },
    {
      "text": "The Shape of Water is a breathless film, anchored by [Sally] Hawkins' visible, ardent longing for connection, and her fierce defiance when the things she loves are threatened",
      "author": "Tasha Robinson"
    },
    {
      "text": "With elements of noir, horror, romance and musical filmmaking The Shape of Water provides a heady brew of references, all combining to form a delightful whole.",
      "author": "Jason Gorber"
    },
    {
      "text": "One of [del Toro's] deepest, most complex, most rewarding, and flat-out beautiful films.",
      "author": "Brian Tallerico"
    },
    {
      "text": "No one loves monsters as much as Guillermo Del Toro, and his love seeps into every pore of The Shape of Water.",
      "author": "Sarah Marrs"
    },
    {
      "text": "Guillermo del Toro's masterpiece.",
      "author": "Chris Bumbray"
    },
    {
      "text": "\"The Shape of Water\" combines a creature feature and a melodrama to tell a beautiful story that will thrill as much as get you emotional.",
      "author": "Jason Guerrasio"
    },
    {
      "text": "The Shape of Water may be a bit weird and jarring to most, but it played to me like a beautiful and whimsical love story that anyone can relate to. Especially to those who do feel like outliers to what love is supposed to look like.",
      "author": "Jamie Broadnax"
    },
    {
      "text": "The Shape of Water is a very special movie.",
      "author": "Mike Ryan"
    },
    {
      "text": "It is hard to over-state how good Hawkins is in this role. Speech is an actor's most potent weapon, but she gives a masterclass in how you to move and charm an audience without it.",
      "author": "Brian Viner"
    },
    {
      "text": "The Shape of Water is one of the most delightful films of the year. And it is definitely the best film ever to be a romantic comedy, a melodrama, a spy thriller, a heist caper, a superhero blockbuster and a monster movie all at once.",
      "author": "Nicholas Barber"
    },
    {
      "text": "The Shape of Water is as strange and brave as people can be strange and brave, especially the quiet ones, the weird ones you don't think that much about.",
      "author": "Walter Chaw"
    },
    {
      "text": "...magical, old fashioned cinema, which proves to be vibrant, delightful escapism rich with emotion and significance.",
      "author": "Greg Dolgopolov"
    },
    {
      "text": "Guillermo del Toro's The Shape of Water is that big romantic all-out imaginative coup (with a sly political undercurrent) that so many of us have been waiting for from the director.",
      "author": "Nick James"
    },
    {
      "text": "If you can imagine an aggressively adorable -- and somewhat effortful -- version of Amélie in which our hero f---s the Creature from the Black Lagoon, you're totally feeling this.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "In order to enjoy the myriad pleasures of del Toro's world - with all its counterpointed humor, quicksilver pacing, endearing humanity, peculiar eroticism, and sudden eruptions of violence - one must simply take the plunge.",
      "author": "Rory O'Connor"
    },
    {
      "text": "Deeply satisfying filmmaking at its best. It's witty, smart and brilliantly played, plumbing the sub-aqueous depths of our psyches, our histories and desires.",
      "author": "John Bleasdale"
    },
    {
      "text": "Simply monumental, monstrous, political and poetic. [Full review in Spanish]",
      "author": "Luis Martínez"
    },
    {
      "text": "A sublime cross between the fantastic and the romantic; Without having to have a young woman who follows the canon of beauty of catwalk. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "There's enough magic, and extraordinary visual imagination, to smooth the edges of the movie's problems.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "The Shape of Water may just be his most touching fantasy yet.",
      "author": "David Sexton"
    },
    {
      "text": "It offers what must be cinema's uneasiest probing of the postwar American psyche since Paul Thomas Anderson's The Master - and is unquestionably del Toro's best, richest film since his 2006 Spanish-language masterpiece Pan's Labyrinth.",
      "author": "Robbie Collin"
    },
    {
      "text": "The Shape of Water casts a spell over its audience from its opening moments and holds you in its thrall long after the credits have rolled.",
      "author": "Marlow Stern"
    },
    {
      "text": "For all the veering from one genre to another, neither does it feel rough. Del Toro's tight directorial control sees to that.",
      "author": "Ben Croll"
    },
    {
      "text": "This is a monster movie but it plays like a Beauty and the Beast-style romance.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "A charming, beautifully filmed movie that appeals on many levels and is a song to cinema and to love.",
      "author": "Jo-Ann Titmarsh"
    },
    {
      "text": "Guillermo del Toro channels all the streams that make him unique into The Shape Of Water, pouring his heart, soul and considerable craft into an exquisite creature fable.",
      "author": "Fionnuala Halligan"
    },
    {
      "text": "A ravishing, eccentric auteur's imagining, spilling artistry, empathy and sensuality from every open pore, it also offers more straight-up movie for your money than just about any Hollywood studio offering this year.",
      "author": "Guy Lodge"
    },
    {
      "text": "It's a film that makes you feel a lot, but overridingly you feel lucky - lucky to be watching it, lucky that something so sincerely sweet, sorrowfully scary and surpassingly strange can exist in this un-wonderful world.",
      "author": "Jessica Kiang"
    },
    {
      "text": "A dark-edged fairy tale as lovingly steeped in vintage movie magic as it is in hypnotic water imagery, this captivating creature feature marries a portrait of morally corrupt early-1960s America with an outsider tale of love and friendship ...",
      "author": "David Rooney"
    },
    {
      "text": "Del Toro provides just enough spade-work to keep the scheme plausible and his film is stylish and charming; red meat for the senses with some sugar on top.",
      "author": "Xan Brooks"
    },
    {
      "text": "The Shape of Water not only entertains as a sumptuous fairytale, but it reinforces a faith in humanity set in a time where tolerance of other races, nationalities, and non-\"family values\" love was volatile. And it's percolating back to the surface again.",
      "author": "Brian Formo"
    },
    {
      "text": "There's something here for lovers of all kinds of movies - even silents and musicals - but del Toro transcends mere pastiche to craft a work that feels like the product of our collective film-going subconscious.",
      "author": "Alonso Duralde"
    }
  ],
  "release_year": 2017,
  "duration": 123,
  "genres": [
    "Fantasy",
    "Romance"
  ],
  "age_rating": "R",
  "synopsis": "Elisa is a mute, isolated woman who works as a cleaning lady in a hidden, high-security government laboratory in 1962 Baltimore. Her life changes forever when she discovers the lab's classified secret -- a mysterious, scaled creature from South America that lives in a water tank. As Elisa develops a unique bond with her new friend, she soon learns that its fate and very survival lies in the hands of a hostile government agent and a marine biologist.",
  "popularity": 7.3,
  "poster_url": "https://image.tmdb.org/t/p/original/9zfwPffUXpBrEP26yp0q1ckXDcj.jpg"
}