{
  "movie_name": "The Old Guard",
  "movie_id": "the_old_guard",
  "total_reviews": 100,
  "reviews": [
    {
      "text": "Director Gina Prince-Bythewood puts a fresh spin on the superhero genre in her adaptation of Greg Rucka's comic book of the same name.",
      "author": "Sukanya Verma"
    },
    {
      "text": "Has there been a more definitive star in Hollywood over the last decade than Charlize Theron?",
      "author": "Gautam Sunder"
    },
    {
      "text": "But even if this is a misfire -- and it is -- there’s still talent and that much-talked-about potential somewhere in it. Maybe next time the script will be worth the talent both behind and in front of the camera.",
      "author": "Joonatan Itkonen"
    },
    {
      "text": "As one of the creators of the original comics, Greg Rucka delivers a screenplay packed with intriguing lore, which is well-explored and well-established for (what should be) the first movie in a new franchise.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Predictable and at times very, very boring, and the music makes it even more anti-climatic. I don't see a saving grace here. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "On paper it looks like a carbon copy of Highlander but Theron... and a series of entertaining action set pieces that are directed with verve and style by director Gina Prince-Bythewood... prove you can teach The Old Guard new tricks.",
      "author": "Dallas King"
    },
    {
      "text": "The themes and moral dilemmas presented are excessively contrite and manipulative while doing nothing to elevate the material from a below-average comic book picture.",
      "author": "M.N. Miller"
    },
    {
      "text": "A new action-superhero mashup from Netflix that sounds a lot better than it ends up being.",
      "author": "Keith Garlington"
    },
    {
      "text": "This epic about immortal soldiers on the lam gets extra points for innovation. Finally, a mainstream action movie features a gay couple as the romantic focal point.",
      "author": "David Reddish"
    },
    {
      "text": "Gina Prince-Bythewood's The Old Guard is unlike any other movie based on a graphic novel. She gives us a steady stream of action and a storyline that never bores, and a welcome message about the power of goodness.",
      "author": "Zofia Wijaszka"
    },
    {
      "text": "The immortals have a powerful female energy driving them forward, which is refreshing to see in a mainstream action film.",
      "author": "Betsy Bozdech"
    },
    {
      "text": "Ambition is not always the best idea in your story. At this point we must know that not everything has to be at the cost of the entire world in action films. Universe-building harmed the story. [Full review in Spanish]",
      "author": "Victor Pineyro"
    },
    {
      "text": "What saves The Old Guard from being just another cash grab is its dynamic fight scenes, coupled with the evaluation of both the delightful and destructive nature of time.",
      "author": "Lonita Cook"
    },
    {
      "text": "If you like Highlander and 6 Underground, you're certainly in for a treat here, as Netflix's latest streaming blockbuster plays like a cross between the two.",
      "author": "Travis Johnson"
    },
    {
      "text": "It's a slam-dunk of an action movie. The pace is brisk, the script is solid, the fight scenes brilliantly choreographed.",
      "author": "Diane Pershing"
    },
    {
      "text": "Screenwriter Greg Rucka provides a well-conceived script, though a couple of characters make amazingly stupid choices...",
      "author": "Robin Holabird"
    },
    {
      "text": "Watch the first 5 minutes of this new Netflix action movie starring Charlize Theron and you'll know literally everything that's going to happen.",
      "author": "Richard Trenholm"
    },
    {
      "text": "The Old Guard falls back on the familiar a bit too often, but the world it builds and its charismatic cast keep things interesting and offer plenty of potential, even if it doesn't spawn a franchise.",
      "author": "Rick Marshall"
    },
    {
      "text": "Prince-Bythewood's direction is without reproach, as is the acting: The characters are nuanced and varied, the pacing balances fast and spectacular fight choreography with scenes that are almost meditative in their intimacy.",
      "author": "Aviva Dove-Viebahn"
    },
    {
      "text": "Delivered in between a series of flashy fight scenes - mostly played out to a lazy soundtrack of dance bangers - this punchy dialogue adds heft to the quieter moments.",
      "author": "Richard Phippen"
    },
    {
      "text": "Great choreography and fight scenes make up for any of the flaws in the story.",
      "author": "Carey-Ann Pawsey"
    },
    {
      "text": "The Old Guard ends with a post-credits scene setting up another entry. For the first time in a good while, that feels like a promise rather than a threat.",
      "author": "Daniel Gorman"
    },
    {
      "text": "A clever-enough twist on the superhero genre to add a little hefty freshness to the genre.",
      "author": "Witney Seibold"
    },
    {
      "text": "The Old Guard accomplishes what it sets out to do-namely, to be a rousing adaptation of the comics it is based on-but the characterization of Nile leaves a lot to be desired.",
      "author": "Cate Young"
    },
    {
      "text": "One of 2020's 20 best films.",
      "author": "Matt Brunson"
    },
    {
      "text": "An exciting and highly enjoyable film where the bad guys get what's coming to them. [Full review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "While The Old Guard isn't topnotch fare, it offers solid entertainment value, and we wouldn't mind a second adventure with these impossible-to-kill folks",
      "author": "Mark Meszoros"
    },
    {
      "text": "The Old Guard brings something new to the table for the comic book action genre, popping off the screen despite being limited by its debut on Netflix.",
      "author": "Alex Bentley"
    },
    {
      "text": "I'm not sure The Old Guard's appeal is as immortal as its characters.",
      "author": "Richard Crouse"
    },
    {
      "text": "Quiet moments anchor The Old Guard's predictable beats.",
      "author": "Jeffrey Zhang"
    },
    {
      "text": "The action is mostly top notch, with some scintillating gunplay sequences and fight choreography. It soon becomes a little tiresome, though, because all the spin-kicks and throat punches in the world don't matter if the story is lacking.",
      "author": "Mark Cassidy"
    },
    {
      "text": "This elite squad of globe-trotting, centuries-spanning immortal mercenaries breathed new life into a tired, Disney-dominated genre...",
      "author": "Marlow Stern"
    },
    {
      "text": "Two action-packed hours featuring Charlize Theron, Chiwetel Ejiofor, and an absolutely rockstar cast. What more could you want for your Friday evening stream?",
      "author": "Amelia Emberwing"
    },
    {
      "text": "Given a team of highly regarded actors in Charlize Theron, Chiwetel Ejiofor and KiKi Layne, Prince-Bythewood delivers both satisfying, high-octane fights and a proper storyline to stitch them together.",
      "author": "Soraya Nadia McDonald"
    },
    {
      "text": "Charlize Theron again shows herself to be a stellar action heroine, and the John Wick-meets-Highlander action is a lot of brutal genre movie fun.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Blockbuster that convinces thanks to the interpretation of Charlize Theron, a novel starting point and its successful action scenes. [Full review in Spanish]",
      "author": "Diana Mangas"
    },
    {
      "text": "Starring a half-asleep Charlize Theron, The Old Guard is another of Netflix's misguided attempts to launch a blockbuster franchise.",
      "author": "Daniel Barnes"
    },
    {
      "text": "None of this would work without someone like Gina Prince-Bythewood behind the lens.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "Filmed through a muddy digital veil that pushes all of the colors hard towards grey, unless the entire purpose of the scene is that they are yellow.",
      "author": "Tim Brayton"
    },
    {
      "text": "It's a film that's rewarding to spend time with, with a substance-over-style approach that's entirely commendable, and all too rare in films of this type.",
      "author": "Robbie Collin"
    },
    {
      "text": "Theron is amazing as Andy. The Mad Max star delivers a powerful, brooding, sometimes heartbreaking performance which viewers will quickly latch on to.",
      "author": "Callum Crumlish"
    },
    {
      "text": "Many times [music] is used to enhance the emotion or drama, but here it cuts them, causing confusion, and at times just feels forced. [Full Review in Spanish]",
      "author": "Israel Acosta Aroche"
    },
    {
      "text": "A thrilling, moving story about immortality -one that understands the strain ofemotionalcomorbidity, illustrates how kindness and conscientious choices truly reverberate and features Charlize Theron burying battle axes in bad people.",
      "author": "Nick Rogers"
    },
    {
      "text": "With its emphasis on character drama and inclusivity, The Old Guard possesses a mold that other comic book films should aim to fit going forward.",
      "author": "Matthew St. Clair"
    },
    {
      "text": "I can't wait for the sequel!",
      "author": "Brandon Avery"
    },
    {
      "text": "A cool premise and Charlize's star power keep The Old Guard afloat but it often feels rushed and thrown together.",
      "author": "Brian Gill"
    },
    {
      "text": "Though the villain is a bit cardboard-cut out, and the plot a bit messy, there's so much good-looking action fun on hand that you can't but be seduced by the flick's charms.",
      "author": "Caffeinated Clint"
    },
    {
      "text": "Every time the action gets going, demonstrating a knack for modern choreography, the intrusive soundtrack kicks in with a pitifully incompatible lineup of popular tunes.",
      "author": "Mike Massie"
    },
    {
      "text": "[The] soundtrack by Volker Bertelmann and Dustin O'Halloran is well-placed and cinematography by Tami Reiker and Barry Ackroyd, very good.",
      "author": "Marie Asner"
    },
    {
      "text": "Overall, The Old Guard is a cute popcorn film that is a nice distraction for two hours. The movie does end on a cliff hanger so we'll have to see if it does get greenlit for a sequel.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "The Old Guard was uneven but exciting, with a premise novel enough to earn a watch.",
      "author": "Asia Frey"
    },
    {
      "text": "When most action movies shy away from queer relationships, The Old Guard loudly proclaims them.",
      "author": "Murtada Elfadl"
    },
    {
      "text": "The Old Guard successfully fills the void left by the lack of blockbusters this season with a solid action feature. [Full Review in Spanish]",
      "author": "Gustavo Pineda"
    },
    {
      "text": "Although it can't fully escape from the cliches of the superhero genre, its fresh vision, and the performances of its cast, led by Charlize Theron, make this saga work. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "Some of the action beats here are overly familiar, but there's a gratifyingly fresh texture to the characters' profiles...",
      "author": "Steve Murray"
    },
    {
      "text": "A number of tender and introspective grace notes separate The Old Guard from other violent and gritty action movies...",
      "author": "Victor Stiff"
    },
    {
      "text": "The good news is, The Old Guard is better than Highlander II - but that's true of literally every movie ever.",
      "author": "Chris McCoy"
    },
    {
      "text": "This forgettable action-thriller features decent combat scenes but threadbare storytelling.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "The movie is quite conservative, it slightly explores its protagonists and has good action scenes, but nothing extraordinary. [Full Rewiew in Spanish]",
      "author": "Gabriela Meza"
    },
    {
      "text": "Gina Prince-Bythewood flexes new muscles while Charlize Theron beats bad guys bloody with her own.",
      "author": "Rob Hunter"
    },
    {
      "text": "Watching a movie is, among many other things, a leap of faith... In The Old Guard, plausibility is endangered. [Full review in Spanish]",
      "author": "José Amador Pérez Andújar"
    },
    {
      "text": "Skill like this also goes a long way towards excusing plot holes, and this is one area where \"The Old Guard\" is by no means an exception... Good thing there's the incredible action scenes to distract.",
      "author": "Andrea Thompson"
    },
    {
      "text": "Director Gina Prince-Blythewood slipstreams prosocial themes into the story-driven violence so smoothly almost no preachiness can be detected.",
      "author": "John Lui"
    },
    {
      "text": "The Old Guard is agreeable and diverse, it just feels a little, well, old.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "For people who might be intrigued by a story about warriors who are still trying to figure out their lives after living and fighting battles for centuries, The Old Guard offers an immersive experience into that world.",
      "author": "Carla Hay"
    },
    {
      "text": "Everything I see disappoints me when it trivially mixes the most conventional action with the superhero fantasy, with plastic characters as empty as toy action figures and a narrative so dull that it offends my naivety. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "A well-executed action film. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "A rock-solid (and kind of dumb) film about immortal warriors dedicated to doing the right thing, going on, even if it feels like forever.",
      "author": "Tim Brennan"
    },
    {
      "text": "It's an exciting first film in what hopefully will become a franchise for director Gina Prince-Bythewood and these characters.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The Old Guard is Netflix's latest by-the-numbers action romp, a movie that would fall into on demand oblivion if it wasn't for Charlize Theron's magnetic presence.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "...a comic-book adaptation that could (and should) have been so much better.",
      "author": "David Nusair"
    },
    {
      "text": "'Old Guard' offers up a fresh look at an action film where women are respected and the tropes that usually weigh them down are left behind.",
      "author": "Jonita Davis"
    },
    {
      "text": "You've seen Charlize Theron beat the sh** out of people and rock the \"hot mom at the gym who doubles-up on arm-and-shoulder day\" look but... I mean - why would you NOT want to see it again?",
      "author": "Bob Chipman"
    },
    {
      "text": "... offbeat and compelling superhero saga that's more about self-discovery than saving the day.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "If you're here for the action, though, there's plenty of it. Theron is so good at martial arts now that her fight scenes are a thing of beauty.",
      "author": "Sara Stewart"
    },
    {
      "text": "The Old Guard highlights the dilemma with fidelity being considered a merit in adaptations...Though [it] does not favour one audience over the other, it still fails to capture the appeal the comic book had for readers to the uninitiated viewers.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Though there is nothing to match what we saw in Atomic Blonde, the action sequences are fairly well-mounted and regular enough...And never mind bad guys, why can't we have more bad girls, like the super-cool one Theron played in F8? Come on, Hollywood.",
      "author": "Jim Schembri"
    },
    {
      "text": "The Old Guard has a ferocious kick to it.",
      "author": "Steven Prokopy"
    },
    {
      "text": "So much good and so much bad at the same time... A very pedestrian story wrapped around this enormous, mythical concept.",
      "author": "Wade Major"
    },
    {
      "text": "The Old Guard isn't just an action film loaded with blood and guts. It also offers a scathing look at what happens when scientific pursuit blends with capitalist greed.",
      "author": "Rachel Charlene Lewis"
    },
    {
      "text": "Charlize Theron is terrific in this hugely imaginative, bone-snappingly violent action-fantasy.",
      "author": "Brad Newsome"
    },
    {
      "text": "... the camaraderie between characters and backstory details are organic enough to carry the weight of Theron's brooding until she can start kicking ass... and that's when it gels together.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "The Old Guard is a decidedly grown up superhero movie.",
      "author": "Sarah Marrs"
    },
    {
      "text": "A+ Action describes Gina Pince-Blythewood's debut in the superhero film lane. The Old Guard is adrenaline junkie dream right along with Charlize Theron and Kiki Layne stomping all over the big boys at every turn! Loved it!",
      "author": "Carla Renata"
    },
    {
      "text": "Theron prides herself in having made herself a fixture of the action genre, however, she's become a parody of herself, her tough-gal posture a bit too obvious, her pithy quips a bit too tired and her action sequences a bit too choreographed.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Charlize Theron is the best thing about the comic book action movie, \"The Old Guard.\"",
      "author": "Russ Simmons"
    },
    {
      "text": "You feel the connection between [the characters]. you get the fact that these people have known each other for centuries.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Charlize Theron, practically unrecognizable here, does an excellent job projecting her character's inner conflict and how that impacts her relationship with a new immortal trying to understand what's happening.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "The characters and their interplay is enjoyable for large portions of the movie, so I'd mark this one \"worth a look.\"",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Love the big action pieces as well as the quiet, introspective moments... thanks to Gina Prince-Bythewood's competent direction. I'm down for the sequel, especially with this fantastic director & cast!",
      "author": "Ruth Maramis"
    },
    {
      "text": "Director Gina Prince-Bythewood did a great job of helming this comic book-adaptation and piecing together a story I craved more of when the credits began to roll.",
      "author": "Courtney Lanning"
    },
    {
      "text": "Were it not for its wholly inappropriate, incredibly distracting, poorly chosen, Europop-trash soundtrack, it would have been as flawless as Charlize Theron whacking bad dudes across the face with a colossal axe-type weapon.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Like Atomic Blonde, this film is adapted from a graphic novel. Also like Atomic Blonde, the film version doesn't quite work.",
      "author": "Kurt Loder"
    },
    {
      "text": "Comic book superhero film with enough killings to satisfy even the most savage of male viewers.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The Old Guard hasn't much of a sense of humor.",
      "author": "Robert W. Butler"
    },
    {
      "text": "The Old Guard asks some existential questions that leave the audience wanting more.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "The Old Guard may be comfort food, but during this particular year, and thanks in large part to this particular cast and crew-it will hit the spot for many.",
      "author": "Michael Burgin"
    },
    {
      "text": "The screenplay is written by Greg Rucka opens the story for sequels and the fact the story deals with immortals opens the creative team to all kinds of developments. Here's hoping that Gina Prince-Bythewood stays for the long haul.",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "It does just enough to spark some interest in the future of this Netflix movie franchise. Just.",
      "author": "Ben Allen"
    },
    {
      "text": "This beefy action thriller grounds its fantastical premise in a gritty globe-hopping plot. The narrative is relatively straightforward, so feels over-stretched, but it builds characters and moves with relentless momentum.",
      "author": "Rich Cline"
    }
  ],
  "duration": 125,
  "genres": [
    "Action",
    "Fantasy"
  ],
  "age_rating": "R",
  "synopsis": "A group of mercenaries, all centuries-old immortals with the ablity to heal themselves, discover someone is onto their secret, and they must fight to protect their freedom.",
  "popularity": 7.1
}