{
  "movie_name": "The Proposal",
  "movie_id": "10010458-proposal",
  "total_reviews": 188,
  "reviews": [
    {
      "text": "There are a [number of] really fun comedic set pieces in the film, and that's what makes it an entertaining movie.",
      "author": "Natasha Alvar"
    },
    {
      "text": "It delivers on the laughs and the star power",
      "author": "Rachel Wagner"
    },
    {
      "text": "While The Proposal is an enjoyable, funny, and at times endearing movie, it leaves you frustrated with how jealously it conforms to the genre's conventions.",
      "author": "Brian Eggert"
    },
    {
      "text": "...The Proposal remains a funny comedy.",
      "author": "Danielle Solzman"
    },
    {
      "text": "The movie is so formulaic that you'll need a pretty high tolerance for rom-com foolery for The Proposal to be to your taste.",
      "author": "Jason Best"
    },
    {
      "text": "Despite borrowing virtually eery rom-com plot device, screenwriter Pete Chiarelli keeps the dialogue crisp and witty.",
      "author": "Richard Propes"
    },
    {
      "text": "More like a blind date from hell than a feel-good romantic comedy.",
      "author": "Micheal Compton"
    },
    {
      "text": "It's quite a testament to Bullock and Reynolds that despite all the implausible frippery, they still make you root for their characters. Mostly they make you root for them to be paired together again in a better movie.",
      "author": "Megan Basham"
    },
    {
      "text": "I found myself enjoying The Proposal more than I felt I should, chuckling at the predicaments and feeling the odd unsolicited tear moisten my eyes as if on cue in the third act.",
      "author": "Brian D. Johnson"
    },
    {
      "text": "... I do have to admit that I did laugh a few times.",
      "author": "Candice Frederick"
    },
    {
      "text": "A fresh twist to a proposal that starts out as all business but becomes something warmer and fuzzier before it's over.",
      "author": "Neil Pond"
    },
    {
      "text": "The comedy is some good moments, and the chemistry between Sandra Bullock and Ryan Reynolds is strong, but it's too cute and predictable",
      "author": "Emanuel Levy"
    },
    {
      "text": "Simple and clichéd, yet refreshing. As long as you're hell-bent on seeing a romantic comedy, The Proposal will deliver.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "annoyingly predictable and barely watchable piece of Hollywood routine",
      "author": "Dragan Antulov"
    },
    {
      "text": "It's not awful, certainly not memorable and - despite the words of at least one quote whore - it's not \"the year's best comedy.\"",
      "author": "Brian Webster"
    },
    {
      "text": "a morass of clichés",
      "author": "Andrea Chase"
    },
    {
      "text": "Tailored to fit Sandra Bullock more snugly than the antique wedding gown altered for the star during the final act, the film begins to fall apart at the seams after its focus wanders from its promising screwball premise...",
      "author": "John Beifuss"
    },
    {
      "text": "Bullock is totally at home in this territory, and she remains fun to watch, but I do wish she would get stronger, possibly more original comedic material.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "Unfortunately, this winning team is stuck in a dumb vehicle.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The Proposal doesn't blaze any new ground, but it doesn't raze any old ground either. It's a solid, old-fashioned romantic comedy that's more interested in the romance than in being silly or raunchy. These days, that's refreshing enough.",
      "author": "James Plath"
    },
    {
      "text": "It's obviously formula stuff, and follows that formula so earnestly that at points you'll wince more than swoon (why does every big proclamation of love in the final scenes need to be made in public?).",
      "author": "Matt Soergel"
    },
    {
      "text": "There is something to be said for such a relentlessly by-the-numbers chick flick programmer that is nonetheless a breezily enjoyable sit.",
      "author": "Michael Dequina"
    },
    {
      "text": "I was engaged by the fiery chemistry between Bullock and Reynolds.",
      "author": "Jolene Mendez"
    },
    {
      "text": "A mildly enjoyed engagement that simply wasn't meant to last.",
      "author": "Anders Wotzke"
    },
    {
      "text": "The sight of Bullock doing a rap dance with granny in the woods is a traumatising experience.",
      "author": "Cosmo Landesman"
    },
    {
      "text": "This is familiar territory crudely traversed.",
      "author": "Philip French"
    },
    {
      "text": "It is contrived and predictable, squandering the chemistry between co-stars Sandra Bullock and Ryan Reynolds as it creates lazy escapist entertainment that is forgotten as soon as the end credits have rolled.",
      "author": "Allan Hunter"
    },
    {
      "text": "At the Sandra Bullock Movie Factory, a Hunky Co-Star Assembly Line rivets a new head on a standard male muscular body per SB pic.",
      "author": "Victor Olliver"
    },
    {
      "text": "They may as well have called this one 'Mis-Matched Sham Wedding Comedy #57513' for all the effort it makes to shake new life out of a tattered genre.",
      "author": "David Jenkins"
    },
    {
      "text": "Despite some fine performances and pretty scenery, The Proposal is predictable yet incredible, and devoid of any consistent tone. Better call off that wedding.",
      "author": "Anton Bitel"
    },
    {
      "text": "Predictable rom-coms can work if the comedy and chemistry are there. Alas, both have gone AWOL. There's a dry and silent desert where the jokes are meant to be.",
      "author": "David Edwards"
    },
    {
      "text": "One minute you're watching a 21st-century remake of His Girl Friday, the next you're having to endure some awful, dumbed-down \"women's picture\". Bullock deserves better.",
      "author": "Toby Young"
    },
    {
      "text": "Sandra Bullock is teamed up with Ryan Reynolds, and each star's face has a waxy immobility that has nothing to do with Botox; the pure awfulness of the script has paralysed their facial muscles.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The more recurrent noise towards the end was me groaning with disappointment, that a movie which had struck gold with its central matchmaking was succeeding so ruthlessly in taking the shine off.",
      "author": "Tim Robey"
    },
    {
      "text": "The Proposal is not a marriage made in heaven by any means, but the eventual charm of the leads and a gag-packed second half manage to salvage the movie from inauspicious beginnings.",
      "author": "Ben Rawson-Jones"
    },
    {
      "text": "Ultimately, there is something refreshing about The Proposal's undemanding humour and unabashed feel-good factor.",
      "author": "Rob Daniel"
    },
    {
      "text": "A pedigree cast, fun premise and punchy dialogue make Bullock's return to romantic comedy look a great catch, and Reynolds is sharper than a diamond solitaire. Pity, then, that its penchant for sentimentality makes it miss congeniality.",
      "author": "Kate Stables"
    },
    {
      "text": "The Proposal might not be ground breaking stuff, but it's a delightful and very enjoyable distraction that will lift your spirits.",
      "author": "Simon Thompson"
    },
    {
      "text": "As a fish-out-of-water comedy, it's so lousy that you keep wishing someone would put the poor fish out of its misery.",
      "author": "Christopher Tookey"
    },
    {
      "text": "Ignore the underlying fact that The Proposal is one big cliché of a movie and relish Bullock's ability to handle slapstick comedy as well as the smart line delivery.",
      "author": "Mark Adams"
    },
    {
      "text": "Despite good moments and likable leads, this lacks both heart and humour in a confection that smacks of the over-familiar.",
      "author": "Ian Freer"
    },
    {
      "text": "So keen to be cute it curdles our stomachs and so anxious to be funny it jellifies our funny bones.",
      "author": "Nigel Andrews"
    },
    {
      "text": "Another dagger in the back of romantic comedy.",
      "author": "Anthony Quinn"
    },
    {
      "text": "Despite some jolly, off-the-wall moments the comedy becomes increasingly desperate, relying on those old staples of fruity old relations, poodle-y pets in peril, 1980s pop dance offs and amusing, over-sexed foreigners.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "This turns out to be another bad choice for Bullock who, without playing badly, sinks in the general morass.",
      "author": "Derek Malcolm"
    },
    {
      "text": "Enjoyable romcom that succeeds thanks to the chemistry and comic timing of its two leads, but it's also formulaic, completely predictable and nowhere near as funny as it thinks it is.",
      "author": "Matthew Turner"
    },
    {
      "text": "As brightly enjoyable as this film is, there's no escaping the fact that it's yet another formulaic rom-com.",
      "author": "Rich Cline"
    },
    {
      "text": "Dear Hollywood, from this day forward, for better for worse, for richer for poorer, in sickness and in health . . . please stop parping out meritless tripe like this.",
      "author": "Robbie Collin"
    },
    {
      "text": "For better or for worse, this could be a hot contender for the best romcom of the year. Might not be the most original, but it's certainly the most consistently funny and well played.",
      "author": "Grant Lauchlan"
    },
    {
      "text": "It's not The Proposal's predictability that's the main problem, it's the lazy way it doesn't even try to cover up this predictability with witty jokes.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Sandra Bullock's performance alone deserves to give the star her first big comedy success since Miss Congeniality.",
      "author": null
    },
    {
      "text": "Bullock and Reynolds ... end up elevating The Proposal, turning something old into something (almost) new, something borrowed into something cute.",
      "author": "Mike Scott"
    },
    {
      "text": "Sometimes, 'The Proposal' is rather engaging.",
      "author": "Linda Cook"
    },
    {
      "text": "Bullock deserves better material and so do her fans. The moral: Don't accept a role unless you have read the entire script. Perhaps that's a more worthwhile proposal.",
      "author": "Bruce Bennett"
    },
    {
      "text": "The Proposal feels both new and familiar. It's new, in that it doesn't obey a lot of rules of romantic comedies, while not breaking with tradition, and familiar in that it is reminiscent of some of the best romantic comedies without seeming too derivativ",
      "author": "Karina Montgomery"
    },
    {
      "text": "There is a beacon of light -- Betty White. Ms. Betty could be cast in a revival of 'New Jack City' and you'd believe her in every frame.",
      "author": "Clay Cane"
    },
    {
      "text": "The movie, duly enjoyable, joins a long list of Bullock's previous audience pleasing romance-centric films. For fans of Bullock and Ryan Reynolds' spectacular abs only.",
      "author": "Richard Knight"
    },
    {
      "text": "Probably won't do you a permanent injury should you come into contact with it.",
      "author": "Ken Hanke"
    },
    {
      "text": "It breaks no new ground, is predictable at every turn, and no one will remember a thing about it a week after they see it. All that said, The Proposal is above-average.",
      "author": "Stephen Silver"
    },
    {
      "text": "The Proposal could have been a terrific screwball comedy, but the end results are well below average.",
      "author": "Evan Williams"
    },
    {
      "text": "What fate could be so horrible that someone would defraud the government, lie to family and friends, even marry someone they didn't love just to avoid it? Why, moving to Canada, of course.",
      "author": "Rob Thomas"
    },
    {
      "text": "... a cookie-cutter rom-com, but despite my critical instincts screaming at me that I didn't need these empty calories, I was eating the whole cookie and liking it.",
      "author": "Lori Hoffman"
    },
    {
      "text": "For a woefully unconvincing summertime romantic comedy, it's not without a certain ramshackle, rickety old charm.",
      "author": "Tim Brayton"
    },
    {
      "text": "A great example of moviemaking on autopilot. The screenplay not only heads for the predicable finish line, it also makes sure to hit all the predictable stops along the way.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The fresh dialogue, gorgeous scenery, and ultimately winsome love story make this one of the most appealing romances to come down the pike in recent years.",
      "author": "Annie Young Frisbie"
    },
    {
      "text": "The troubling thing about Margaret's \"punishment\" is the implication that she deserves it in the first place.",
      "author": "Renie Scolaro Mora"
    },
    {
      "text": "It's a pleasant time killer offering mindless entertainment and appealing stars.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "While the picture occasionally goes out of its way to make Bullock's character a ninny, the actress refuses to let the role manhandle her, and she and the ever-charming Reynolds work well together.",
      "author": "Matt Brunson"
    },
    {
      "text": "Once you've set your story up as a bedroom farce, resisting the form seems futile. The Proposal meanders toward a tone without arriving at one.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "Bullock and Reynolds are appealing enough to make viewers care if real love will emerge from the legal ploy.",
      "author": "Dan Lybarger"
    },
    {
      "text": "The chemistry between Bullock and Reynolds makes this good movie even better",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "The Proposal is a delicious revamping of a Doris Day-like vehicle for Bullock (e.g. Pillow Talk). A virginal (or near-virginal), uptight heroine loosens up and finds true love after she discovers the man she has little patience for is her ideal mate.",
      "author": "Brandon Judell"
    },
    {
      "text": "I am going to do something I've never done before. I hope you're all sitting down....ahem. I am actually going to say something nice about a chick flick.",
      "author": "Jenna Busch"
    },
    {
      "text": "Sloppy and lazy.",
      "author": "Ben Mankiewicz"
    },
    {
      "text": "Believability really goes out the window here.",
      "author": "Ben Lyons"
    },
    {
      "text": "...formula filmmaking at its coldest...",
      "author": "Jim Lane"
    },
    {
      "text": "Cookie-cutter characters inhabit a paper-thin plot while being helplessly propelled to a cliché climax.",
      "author": "Gary Wolcott"
    },
    {
      "text": "By its own modest aims, it's not horrible ...",
      "author": "Philip Martin"
    },
    {
      "text": "It simply doesn't give this screwball premise the workout it deserves.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "As one embarrassing scene follows another, The Proposal accumulates so many bad vibes that it becomes grimly compelling.",
      "author": "Jake Wilson"
    },
    {
      "text": "Just like Up, the first 20 minutes is the best part, and that's about where the comparisons stop. They had the pieces in place for The Proposal but it slowly fell apart.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Sandra Bullock is the paragon of a romantic comedy heroine ... So why does she find herself the star power behind so many romcom stinkers?",
      "author": "Beverly Berning"
    },
    {
      "text": "The \"here comes the bribe\" relationship between these two likable personalities mirrors that of an ice cream cone that starts off freezing cold and then deliciously melts from the sizzling summer heat.",
      "author": "Keith Cohen"
    },
    {
      "text": "Even though I was able to figure out the ending just based on my knowledge of romantic comedies, the film still delivered decent laughs and good chemistry.",
      "author": "Kevin McCarthy"
    },
    {
      "text": "Bullock and Reynolds play against type well, and their spicy chemistry is contagious. But while the leads are doing their thing, Betty White slips in and steals the movie.",
      "author": "Sean P. Means"
    },
    {
      "text": "When White and Bullock are on screen together, they click in a way that makes this predictable film shine.",
      "author": "Donald Munro"
    },
    {
      "text": "It's about a guy who has to be blackmailed into marrying Sandra Bullock? Blackmailed? He'd have to be married to Scarlett Johansson for that to be realistic.",
      "author": "Willie Waffle"
    },
    {
      "text": "Instead of being about dinosaurs and time warps, it's about gags that were old when dinosaurs ruled the earth.",
      "author": "Peter Rainer"
    },
    {
      "text": "A hollow proposal though Reynolds proves he's got the chops for comedy.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Thanks to casting and chemistry, this is the first great romantic comedy of the summer.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Bullock and Reynolds' chemistry propels charming romcom.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "It's impossible to guess why Bullock was ever attracted to this insulting role, and the eternally confident Reynolds is miscast as a young, bullied underling.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "Shamelessly derivative, contrived and predictable, The Proposal is nonetheless a crowd-pleasing romantic comedy.",
      "author": "Lou Lumenick"
    },
    {
      "text": "There are spit-takes and lies; small dogs and mishaps. And, to cap it off, an impassioned dash to the airport. Seriously.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "Without question this riotously funny flick is the year's best comedy -- at least so far.",
      "author": "Pete Hammond"
    },
    {
      "text": "The Proposal is just a good old-fashioned romance, one in which people actually bring out the best in one another rather than the worst. How novel is that?",
      "author": "Betsy Sharkey"
    },
    {
      "text": "The bar for modern rom-coms remains depressingly low, but The Proposal clears it with ease.",
      "author": "Christian Toto"
    },
    {
      "text": "The movie's lazy, formulaic story quickly becomes an excruciating waste of talent.",
      "author": "Mike Russell"
    },
    {
      "text": "There's nothing surprising here.",
      "author": "Sharon Hoffmann"
    },
    {
      "text": "The Proposal often lies flat where it should spark, with director Fletcher failing to maximize her talented cast's potential. The timing is off in several scenes, and a would-be outrageous character inspires more eye rolls than laughs.",
      "author": "Carla Meyer"
    },
    {
      "text": "A romantic comedy doesn't need to be original to be enjoyable, and yet The Proposal still falls way too short of the mark.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "It's got spunk and charm and two skillful stars in Bullock and Reynolds, who make it all feel much less generic than it is.",
      "author": "Kevin Williamson"
    },
    {
      "text": "It isn't a film with a lot of big guffaws, but I smiled through most of it.",
      "author": "Amy Biancolli"
    },
    {
      "text": "Like most Hollywood romantic comedies these days, The Proposal is all about bringing a woman to her knees.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Onscreen chemistry is an elusive notion but you know it when you see it, and Sandra Bullock and Ryan Reynolds definitely have it in The Proposal.",
      "author": "Liam Lacey"
    },
    {
      "text": "A straight-ahead romantic comedy that relies on the considerable charms of its stars, The Proposal feels so comfortable and familiar you might feel like you've seen it before.",
      "author": "Tom Long"
    },
    {
      "text": "Think \"Taming of the Shrew Wears Prada.\"",
      "author": "Nell Minow"
    },
    {
      "text": "The script encases Margaret in rusted defenses from which it can't free her without awkward leaps and cheats.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "Things all fit together, but the film does lack the creative spark behind classic rom coms like Pretty Woman and When Harry Met Sally.",
      "author": "Kevin Carr"
    },
    {
      "text": "[A] buoyant vehicle for Sandra Bullock and Ryan Reynolds, whose chemistry is a happy surprise.",
      "author": "Andrea Gronvall"
    },
    {
      "text": "Although The Proposal isn't a sweep-you-off-your-feet affair, Bullock and Reynolds make it a thoroughly charming engagement.",
      "author": "Tyler Hanley"
    },
    {
      "text": "Kudos to Bullock for trying something different.",
      "author": "Chris Hewitt"
    },
    {
      "text": "A cut above, but no more.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Nobody who ever attended a date movie will be surprised by what happens, but The Proposal has low expectations and good vibes in its favour.",
      "author": "Peter Howell"
    },
    {
      "text": "A spunky comedy about an odd couple and their adventures in love.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The Proposal restores Sandra Bullock to comic glory. It's her best role since While You Were Sleeping.",
      "author": "John Wirt"
    },
    {
      "text": "It's the undeniable chemistry %u2013 both romantic and comedic %u2013 shared between Reynolds and Bullock that ultimately carries \"The Proposal\" over its mediocre, formulaic writing and predictable plotting.",
      "author": "Sean O'Connell"
    },
    {
      "text": "The Proposal gives some hope that the rom-com can still function.",
      "author": "Matthew Razak"
    },
    {
      "text": "Anne Fletcher has practically established herself as the anti-feminist, playing more to the hopeless ring chasers out there rather than those who might be insulted at the prospect of independent women needing a man in their lives to complete them.",
      "author": "Erik Childress"
    },
    {
      "text": "In the end, nothing can compensate for the fact that Bullock has been so diligent in ridding herself of any trace of niceness that she looks as if she's regretting the whole thing. Boredom doesn't suit her and a romcom without charm just doesn't rate.",
      "author": "Sandra Hall"
    },
    {
      "text": "Despite its less than original pedigree, The Proposal is a perfect example of a predictable, formulaic script elevated by fine acting and palpable chemistry.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "The movie is a checklist of bad sitcom plots and generic romcom characters. But it's also funny and charming and cute.",
      "author": "David Cornelius"
    },
    {
      "text": "The experience of watching 'The Proposal\" is not unlike attending a performance from a cover band specializing in the songs of Billy Joel--both offer up the prospect of two hours of mind-numbing blandness without a single original element on display.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Know this: There are no original romantic comedies anymore, only original people in them. Sandra Bullock and Ryan Reynolds make The Proposal a lot better than it ought to be.",
      "author": "Kit Bowen"
    },
    {
      "text": "Am I huge fan then of the finished product? No, not really, but I am absolutely sold on Bullock and Reynolds making more movies together.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Fletcher's labored, downright desperate efforts at wringing laughs out of hopelessly stale material results in a series of entirely needless sequences...",
      "author": "David Nusair"
    },
    {
      "text": "Romantic comedy fans will get what they want and, at least this time, those pleasures are a little less guiltier than usual.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "Parental Content Review",
      "author": "Jim Judy"
    },
    {
      "text": "Yet another formulaic romantic comedy, with little to offer except sparkling performances from Bullock and Reynolds.",
      "author": "Jette Kernion"
    },
    {
      "text": "has fleeting moments of hilarity and charisma, but ultimately falls flat as a romance, comedy and drama with an inane, sitcom-ish, uninspired and lazy screenplay along with sloppy editing and direction.",
      "author": "Avi Offer"
    },
    {
      "text": "The Proposal's a fairly good-natured but weak proposition -- it's a movie you might enjoy on an evening's date, but it's not one you'll want to spend the rest of your life with.",
      "author": "James Rocchi"
    },
    {
      "text": "...may not be the worst romantic comedy ever made, but it surely is one of the most unnecessary...plays like a patchwork of everything from \"Men in Trees\" to \"Chuck and Larry.\"",
      "author": "Laura Clifford"
    },
    {
      "text": "The Proposal coasts along on likability, right up to its standard-issue ending; what it doesn't do is surprise us in any way.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Though it falls short of winning our hearts completely, The Proposal is a serviceable and intermittently funny romance made enjoyable by the sparks between Bullock and Reynolds.",
      "author": "Claudia Puig"
    },
    {
      "text": "And though Bullock and Reynolds have snappy chemistry to spare, their love affair stops just shy of being believable. There are too many awkward 'tender' moments and not enough vigor for a real romance.",
      "author": "Kara Nesvig"
    },
    {
      "text": "Hinging on the far fetched premise that if you put two people with zero chemistry in a room together long enough, they'll inevitably fall in love with each other, the movie is stolen away by Oscar Nunez's multi-tasking paunchy male stripper grocery clerk.",
      "author": "Prairie Miller"
    },
    {
      "text": "Surprisingly charming and smartly executed.",
      "author": "Mack Bates"
    },
    {
      "text": "Despite sparkling performances by Ryan Reynolds and Denis O'Hare, this derivative story has been made into too many movies not to be stale.",
      "author": "Tony Medley"
    },
    {
      "text": "Never underestimate the pleasure of a sparkly screwball comedy - and a fluffy puppy.",
      "author": "Susan Granger"
    },
    {
      "text": "Why a screenwriter would think hilarity would ensue from this premise is anybody's guess.",
      "author": "Wesley Morris"
    },
    {
      "text": "Given the plot summary, you have to admit that anything better than 'I took my own life halfway through the screening' is impressive.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The problem is not the acting. The problem is what these actors are required to say and do.",
      "author": "Michael Phillips"
    },
    {
      "text": "At every turn where The Proposal could have seemingly gone in a less obvious direction, it just puts on the blinders and forges ahead with the cliches of this genre.",
      "author": "Rick Mele"
    },
    {
      "text": "All this predictable, romantic/screwball comedy really has to do is supply us with a steady supply of laughs. And in that regard, the film succeeds.",
      "author": "Jeff Vice"
    },
    {
      "text": "Just looking at the poster for The Proposal, a by-the-numbers romantic comedy starring Sandra Bullock and Ryan Reynolds, tells you exactly how it's all gonna go down.",
      "author": "Ann Hornaday"
    },
    {
      "text": "A romantic comedy so numbing it feels like Novocaine.",
      "author": "Peter Travers"
    },
    {
      "text": "The setup is formula, but Bullock and Reynolds supply surprising fizz and kick.",
      "author": "Carrie Rickey"
    },
    {
      "text": "Bullock and Reynolds play off each other with a real zing and zeal, but the narrative journeys down an avenue so formulaic the viewer's heart shatters at the very realization of it.",
      "author": "Dustin Putman"
    },
    {
      "text": "Sluggish when it should be scintillating and sappy where it should be sardonic, this romantic comedy winds up more softball than screwball.",
      "author": "Frank Swietek"
    },
    {
      "text": "Following 27 Dresses, this is the second high-concept, low-impact, wedding-themed comedy in 18 months for choreographer-turned-director Anne Fletcher. It might be time to move on.",
      "author": "Keith Phipps"
    },
    {
      "text": "Were it not for the jangly screwball energy ... The Proposal would be just another desperate attempt to jam as many winning formula elements into one graceless package as possible.",
      "author": "Chris Barsanti"
    },
    {
      "text": "Though there's definitely an audience for the story's increasingly sunny sweetness, the film sparks to life pretty much only when the estimable duo of Bullock and Reynolds bickers.",
      "author": "Peter Canavese"
    },
    {
      "text": "It's been made according to the chapter in the box-office manual labeled \"summer counter-programming.\"",
      "author": "Michael Sragow"
    },
    {
      "text": "Oh Sandra Bullock, why do you do this to yourself?",
      "author": "Josh Bell"
    },
    {
      "text": "The leads are appealing, the material familiar -- it adds a Front Page romantic angle to The Devil Wears Prada, and reworks ideas from Green Card.",
      "author": "Gary Thompson"
    },
    {
      "text": "Somehow, someone decided this rom-com needed less rom and more com -- a fatal mistake.",
      "author": "Rafer Guzman"
    },
    {
      "text": "The Proposal recycles a plot that was already old when Tracy and Hepburn were trying it out. You see it coming from a great distance away. As it draws closer, you don't duck out of the way, because it is so cheerfully done, you don't mind being hit by it.",
      "author": "Roger Ebert"
    },
    {
      "text": "A high gloss, studio Romcom with clichéd jokes and conflicts that are as uncontroversial as they are predictable, The Proposal is rooted in the most classical of conventions and still finds ways to be surprisingly enchanting.",
      "author": "Sara Maria Vizcarrondo"
    },
    {
      "text": "Despite the fact The Proposal is predictable and stuffed with recycled schtick, it's surprisingly enjoyable and completely charming. If it was a baby, you'd want to pinch its little cheek -- it's that cute.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Did you ever notice that the best romantic comedies are often the cynical ones?",
      "author": "Josh Larsen"
    },
    {
      "text": "Regardless of the changes in setting and leading men, this is still Bullock running off the same old battery, and the fatigue is becoming increasingly difficult to cover up.",
      "author": "Brian Orndorf"
    },
    {
      "text": "this is sort of an object lesson in what's wrong with comedy today. The first 15, maybe 20 minutes of this film was really promising... And then it all falls apart because they bring in all these silly, farcical things.",
      "author": "David Stratton"
    },
    {
      "text": "Director Anne Fletcher knows where the comedy lies in an improbable but cute screenplay by Peter Chiarelli, it's in her two stars and she lets them fly.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "The Proposal works up such a fun vibe that you couldn't care less about the contrived schematics of its story.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The stars aren't going to erase memories of Hepburn and Tracy, or Lombard and Powell, but Bullock and Reynolds - even when playing a naked bathroom scene together - make a good fit.",
      "author": "Des Partridge"
    },
    {
      "text": "The Proposal could have been much smarter, and much hipper. Instead, it settles for silliness and sentimentality.",
      "author": "Calvin Wilson"
    },
    {
      "text": "The chemical energy between Bullock and Reynolds is fresh and irresistible.",
      "author": "Lisa Schwarzbaum"
    },
    {
      "text": "Classic screwball comedies knew how to get antagonistic lovers to fall for each other without having to resort to bathos; one wants to send first-time screenwriter Pete Chiarelli to an all-day Howard Hawks film festival.",
      "author": "Alonso Duralde"
    },
    {
      "text": "So we've got a prodigal son who has the chance to deal with his father issues and discover things about his heretofore evil boss. It's like a romantic-comedy cliché twofer.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "All the romantic comedy conventions are shamelessly on parade in The Proposal, trampling on our brains and turning them into mush.",
      "author": "Christy Lemire"
    },
    {
      "text": "Every scene between Bullock and Reynolds only suggests how fine they might be in good circumstances.",
      "author": "Armond White"
    },
    {
      "text": "Bullock is one of those actresses that help prove that, when done right, a romantic comedy can be a wonderfully satisfying thing.",
      "author": "Sara Vilkomerson"
    },
    {
      "text": "[C]ontrived... shameless in its cheap pandering... descend[s] to its most slapsticky just as it's maybe about to touch on some genuine feeling as if it assumes its audience has the emotional maturity of a kindergartner...",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "It sounds like a faint recommendation, but trust me when I say that calling it \"not terrible\" is high praise indeed.",
      "author": "Marshall Fine"
    },
    {
      "text": "The Proposal is a standard-order, by-the-book romantic comedy that offers nothing remotely fresh or new while following a formula even neophytes know by heart.",
      "author": "James Berardinelli"
    },
    {
      "text": "Sandra Shock: Bullock partners well with Ryan Reynolds, their romcom strengths sailing above any of the weaker options put forward by this decent Proposal.",
      "author": "Hilton Thomas"
    },
    {
      "text": "The lure of Reynolds' and Bullock's nude scene together is sure to fill cinema seats (and raise a smile), but the other 106 minutes of The Proposal prove utterly forgettable.",
      "author": "Liz Graham"
    },
    {
      "text": "You know every tinny beat and false note by heart, from the implausible setup to the sprint-to-the-airport finish.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "With Ms. Bullock playing a lady only a polar bear could warm up to and Ryan Reynolds' exquisite balancing of the dynamics of the situation, this romantic comedy finds a sweet comfort level.",
      "author": "Jules Brenner"
    },
    {
      "text": "An old-fashioned romp reminiscent of the best of Doris Day and Rock Hudson!",
      "author": "Kam Williams"
    },
    {
      "text": "Humor and romance are interspersed so predictably it's as if screenwriter Pete Chairelli were working from a rom-com checklist.",
      "author": "Nick Schager"
    },
    {
      "text": "Director Anne Fletcher keeps the romantic comedy running with a bubbly spirit and a snappy pace.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Diverting romantic antic about a sham engagement is sparked by the bright chemistry and comic timing of Sandra Bullock and Ryan Reynolds.",
      "author": "Kevin Lally"
    },
    {
      "text": "A likeable romantic comedy featuring two charismatic leads who can't quite escape the shackles of a predictable storyline.",
      "author": "Tim Grierson"
    },
    {
      "text": "The Proposal won't catch any bouquets for originality, but in terms of a bended-knee pitch for the affections of women this romantic comedy pretty much pulls out all the stops.",
      "author": "Brian Lowry"
    },
    {
      "text": "It's doing the same old thing but seems to know it, and so does its best to find something new buried in those clichés.",
      "author": "Joshua Tyler"
    },
    {
      "text": "It is about as pleasing a star-driven comedy as one could reasonably expect to open in wide release during the dog days of summer.",
      "author": "Jeremy Heilman"
    },
    {
      "text": "It's contrived and predictable, formulaic and derivative, yet The Proposal has its own charm. Star charisma is part of it, but there's an interesting dynamic between the two leads. The set up is fun, too.",
      "author": "Louise Keller"
    }
  ],
  "release_year": 2009,
  "duration": 108,
  "genres": [
    "Romance",
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Faced with deportation to her native Canada, high-powered book editor Margaret Tate (Sandra Bullock) says she's engaged to marry Andrew Paxton (Ryan Reynolds), her hapless assistant. Andrew agrees to the charade, but imposes a few conditions of his own, including flying to Alaska to meet his eccentric family. With a suspicious immigration official always lurking nearby, Margaret and Andrew must stick to their wedding plan despite numerous mishaps.",
  "popularity": 6.8,
  "poster_url": "https://image.tmdb.org/t/p/original/aEqtJDj8MvSDQwzggvcOfFTZMw.jpg"
}