{
  "movie_name": "The Gray Man",
  "movie_id": "the_gray_man_2022",
  "total_reviews": 277,
  "reviews": [
    {
      "text": "Nonetheless, in its own fast and furious way, the film is cleverly constructed – a modern-day equivalent to one of those old matinee adventures in which Douglas Fairbanks would play swashbuckling pirates taking on the world.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "The Gray Man may feel 15 minutes too long, but there is still much to enjoy. Chris Evans is having a ball, Ryan Gosling cements his reputation as an action star in waiting, while Ana de Armas matches her co-stars in the arse kicking stakes.",
      "author": "Martin Carr"
    },
    {
      "text": "While the adrenaline-filled film boasts an all-star cast, top-notch camera-work and impressive stunt work, it lacks in character development and story giving us concepts we’ve seen over and over.",
      "author": "Nadya Martinez"
    },
    {
      "text": "For myself, star performances and expensive grand sets are two non-negotiable ingredients of a blockbuster. The Russo brothers’ newest film has both. (And maybe it’s just a two-ingredient genre film, but that’s perfectly fine with me).",
      "author": "Joshua Polanski"
    },
    {
      "text": "This movie will more than likely just be a random grey blank spot in your memory within a few days.",
      "author": "Shakyl Lambert"
    },
    {
      "text": "It's like somebody rabbit-punching your brain for the best part of two hours, and there's a certain enjoyability in that.",
      "author": "Mark Kermode"
    },
    {
      "text": "The Russo brothers’ supposed answer to the Bond franchise is a product of popcorn entertainment that is defined by giving the audience what they want and that’s just it.",
      "author": "Srivatsan S"
    },
    {
      "text": "Netflix’s The Gray Man is its Most Expensive and Emptiest Star Vehicle",
      "author": "Prabhjot Bains"
    },
    {
      "text": "In short, the movie looks like someone painted over each frame of the film with urine. The whole thing has this sickly yellow tint to it that's even more off-putting than the usual teal-and-orange colour grading of most big-budget blockbusters.",
      "author": "Ilan Preskovsky"
    },
    {
      "text": "Given Netflix’s expenditures and the star pedigree on screen, audiences deserve — and should expect — more.",
      "author": "Kevin Slane"
    },
    {
      "text": "If not an all-timer within a tried-and-tested genre, The Gray Man is a strong showcase for its leads, their screen presence and ability to carry the source material which can be overloading with exposition on occasion.",
      "author": "Christopher Connor"
    },
    {
      "text": "A flat out AWESOME! An action packed spy thrill ride that mixes the best of Winter Soldier, Fast/Furious, & John Wick. Ryan Gosling is that ACTION HERO…",
      "author": "Zach Pope"
    },
    {
      "text": "The Gray Man is just expensive, glamour-less, and unsharp.",
      "author": "Hector A. Gonzalez"
    },
    {
      "text": "If you've seen the trailer, you've basically seen the film; it is an underwhelming affair that sounds great on paper, but isn't executed well enough to be memorable.",
      "author": "Rebecca Johnson"
    },
    {
      "text": "The Gray Man is a wannabe John Wick lost in a tonally incohesive script. You’ve seen this movie before you even press play.",
      "author": "Tina Kakadelis"
    },
    {
      "text": "The Russo Brothers return with a star-studded action thriller in Netflix’s The Gray Man that’s great where the heart is concerned but nothing special overall.",
      "author": "Gissane Sophia"
    },
    {
      "text": "The Gray Man is a sad affair. As a fan of Ryan Gosling, as a fan of Ana De Armas, as a fan of Dhanush, as a fan of action cinema, this is sad.",
      "author": "Pramit Chatterjee"
    },
    {
      "text": "We begin a 129 min journey jam-packed with quippy retorts, gratuitous violence and a hail of bullets that leap you chuckling and wiping tears of laughter from your eyes.\n\nThat being said, The Gray Man is entirely devoid of substance.",
      "author": "M.X. Katyayani"
    },
    {
      "text": "Unfortunately this did not flow for me. Gosling on paper seemed to be a very interesting character, but instead his character don't have real progression or likability. Then the action just wasn't up to par with what we've seen this amazing directors do",
      "author": "Samuel Leggett Jr."
    },
    {
      "text": "Despite its fast-paced rhythm and the caliber of the talent in front and behind the camera, it ends up being an unimaginative and formulaic spy flick. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "What I also loved about this movie was the lack of an unneeded romantic subplot, and the fact that all the females in the cast weren’t brainless skirts simply there to fix the men or let them save their life.",
      "author": "Dan Buffa"
    },
    {
      "text": "If you can remember much about it 15 minutes after watching, you'll have a stronger impression than it made on me.",
      "author": "Steve Murray"
    },
    {
      "text": "An unapologetically pure action movie, and as such, tremendously entertaining.",
      "author": "Asia Frey"
    },
    {
      "text": "A movie devoted to fists, guns, and kicking as much as the “Fast and Furious” series showcases speeding cars.",
      "author": "Steve Crum"
    },
    {
      "text": "An A-grade budget trying to wallpaper over a B-grade script.",
      "author": "Matt Neal"
    },
    {
      "text": "In a world where entertainment can be reduced to an algorithm, gray denotes dispassionate neutrality instead of vari-hued complexity, cold industrialisation instead of creative sophistication. Which pretty much sums up Netflix's new pseudo-blockbuster.",
      "author": "Prahlad Srihari"
    },
    {
      "text": "Throw the Bourne, Bond, Mission: Impossible and Fast and Furious franchises into a blender... and — voilà — you might end up with a film like The Gray Man; you’ll forget it the moment you stop watching it.",
      "author": "Tom Shone"
    },
    {
      "text": "It has all the artistic value of watching a blank screen. Except a screen has a purpose.",
      "author": "William Bibbiani"
    },
    {
      "text": "Rather than take some narrative big swings, the story is content with keeping it conventional. But for those hungry for fast-paced grand-scaled action, the Russos have you covered.",
      "author": "Keith Garlington"
    },
    {
      "text": "The Gray Man is a very bad, almost instantly forgettable film. What makes things worse in this case is that the filmmakers, the Russo brothers, do possess a degree of perception, talent and imagination.",
      "author": "David Walsh"
    },
    {
      "text": "This is an old-fashioned popcorn film, a violent feel-good fest of flash and sizzle and consuming it just makes you feel good.",
      "author": "Cris Kennedy"
    },
    {
      "text": "It can fairly be criticized as big, loud and derivative. But thanks to masterfully delivered one-liners from Ryan Gosling and top-shelf scenery chewing from Chris Evans it is, first and foremost, a fun film.",
      "author": "Mike Scott"
    },
    {
      "text": "It's a little vapid, but things blow up real good and Gosling is up for it.",
      "author": "Bob Grimm"
    },
    {
      "text": "The Gray Man strips the best qualities of everyone involved — there's a lack of personality to the filmmaking, and it's big for the sake of being big — leaving behind a tasteless pudding that reeks of a cashgrab.",
      "author": "Akhil Arora"
    },
    {
      "text": "What ensues is overly busy, dumb and riddled with cringingly glib dialogue.",
      "author": "Al Alexander"
    },
    {
      "text": "Here we go again with another substandard Netflix action film that seems to take pride in its display of stunning mediocrity.",
      "author": "Louisa Moore"
    },
    {
      "text": "For me this is like time past, but like the good kind.",
      "author": "Achara Kirk"
    },
    {
      "text": "I really enjoyed that… I thought it was a lot of fun.",
      "author": "Jaby Koay"
    },
    {
      "text": "The Gray Man is a worthy entertaining flick with enthralling action pieces, nice European cities and two handsome toughies that sustain their handsomeness ever after beating each other up across the globe.",
      "author": "Alejandro Turdó"
    },
    {
      "text": "Strong character leads mixed with enough action for the most jaded adrenalin junkie. Gosling is a smoldering assassin, aided and abetted by Ana de Armas. That duo dazzles.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "A failure that exemplifies every bad trend in action filmmaking of the last 15 years, starting with a butt-ugly visual style in which almost everything is underlit, and action blowout sequences that have no spatial continuity.",
      "author": "Stephen Silver"
    },
    {
      "text": "That Anthony and Joe Russo can take an ensemble like that and a $200-plus million budget and still deliver an uninspired, bland waste of talent is a crime that deserves the same level of investigation as Watergate.",
      "author": "Owen Gabbey"
    },
    {
      "text": "Frenetic and forgettable, this gun-riddled action-thriller continues to glorify active shooter emergencies....",
      "author": "Susan Granger"
    },
    {
      "text": "How is Netflix still so bad at this?!",
      "author": "Scott Mendelson"
    },
    {
      "text": "The parts that work really work, even as the parts that don’t fall flat. However, if you’re a fan of large-scale blockbuster cinema, you’ll derive sufficient satisfaction from the good bits to make it worth a watch, though again - size isn't everything.",
      "author": "Allen Adams"
    },
    {
      "text": "The most glam dad-enjoys-while-folding-laundry movie ever.",
      "author": "Adam Kempenaar"
    },
    {
      "text": "It takes two long hours to repeat its world tour of shootouts, fights and chases in the service of the dizzying pyrotechnics of CIA agents who look like recycled copies of Jason Bourne. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "We’re threatened with a Netflix franchise here — Gray Man 2, 3, 4, and so on to infinity. This would be obvious even without the tiresome narrative set-up for sequels at the end.",
      "author": "Eileen Jones"
    },
    {
      "text": "All action, no heart.",
      "author": "Narayan Liu"
    },
    {
      "text": "Little emotion and no substance.  [Full review in Spanish]",
      "author": "Hugo Hernández Valdivia"
    },
    {
      "text": "The nifty action beats, Gosling's snarky turn and Evans's villainous mustached douchebag keep things entertaining and elevate a weak, dull story. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "There can be pleasure in empty calories entertainment, especially in action films and reality television. However, the sin becomes apparent when one misuses many of our best actors.",
      "author": "Alan French"
    },
    {
      "text": "It is the type of film that believes that \"more\" is always \"better\": more action, more one-liners, more celebrities, and more visual effects. Unfortunately, that much excess results in a fun but shallow experience. Full review in Spanish.",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "...an exceedingly (and often excessively) polished thriller that’s really only effective in fits and starts...",
      "author": "David Nusair"
    },
    {
      "text": "An algorithm-infused product that barely has a beating heart.",
      "author": "Jordan Ruimy"
    },
    {
      "text": "After you’ve made movies about an intergalactic prophet throwing moons at superheroes, it’s hard to find something to top that.",
      "author": "Jon Winkler"
    },
    {
      "text": "A $200,000,000 snooze fest.",
      "author": "Larushka Ivan-Zadeh"
    },
    {
      "text": "Unfortunately, this movie’s by-the-numbers plot and dull action sequences make for exciting background noise but not a gripping big-screen bonanza.",
      "author": "Ani Bundel"
    },
    {
      "text": "As the company’s answer to the summer blockbuster, The Gray Man is indicative of the mediocrity that’s continued to seep into the streamer’s programming.",
      "author": "Miles Surrey"
    },
    {
      "text": "Forgive the movie for occasionally crossing the too-violent line, and a gripping good time is to be had here.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Sodden with self-satisfaction and stupefyingly bad.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Glaring in its lack of texture or flavour, this only really succeeds as a succession of mildly diverting bullet-riddled set pieces.",
      "author": "Dominic Corry"
    },
    {
      "text": "On the Netflix Original action scale, The Gray Man lands high when compared to their other “blockbuster” releases. The cg stinks and the script has the expected silliness, but there’s personality to spare and plenty of thrilling action beats to enjoy.",
      "author": "Rob Hunter"
    },
    {
      "text": "The movie may not have used it's budget or talent to it's full potential, but I still had a ton of fun with it.",
      "author": "Sean Chandler"
    },
    {
      "text": "It is all a bit much, but if this kind of movie is your thing (and you know if it is or not), and you don’t mind ridiculous video game violence with a hint of movie star charm, you may just have the most fun you’ll have all year.",
      "author": "Catherine Springer"
    },
    {
      "text": "draws liberally from the Bond and Bourne playbooks, but lacks the well-established wit and panache of the former and the grit and verité intensity of the latter",
      "author": "James Kendrick"
    },
    {
      "text": "The Gray Man is just passable enough to entertain for a couple hours, though you will likely forget everything but Chris Evans’ delightful douchebag performance.",
      "author": "Sarah Marrs"
    },
    {
      "text": "The Gray Man is so generic its makers could have forgone a title and opted instead for a universal product code.",
      "author": "Robert W. Butler"
    },
    {
      "text": "It is mere slick, workmanlike entertainment.",
      "author": "Whang Yee Ling"
    },
    {
      "text": "The Gray Man promises - and tries - to give us the whole world but falls short by many a mile.",
      "author": "Saibal Chatterjee"
    },
    {
      "text": "Beware, fans, your ears may implode. This thriller is a heavy load.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "The Gray Man could have been so much more, but that would have required so much less.",
      "author": "Asher Luberto"
    },
    {
      "text": "The fact that this is on Netflix denies the viewer of seeing this spectacle on the big screen which is a shame. However, it proves to be an advantage as being able to pause the film periodically is a plus.  You’ll need to catch your breath now and again.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Nothing beats the adrenaline rush of a suspenseful action thriller but watching The Gray Man makes me recall other movies that gave me that feeling, as there’s none of that to be found here.",
      "author": "Ruth Maramis"
    },
    {
      "text": "The Gray Man is not the worst film Netflix has put out by any means, but it is yet another example of the kind of bland and insipid anti-cinema that has become their trademark.",
      "author": "Petr Navovy"
    },
    {
      "text": "This is the kind of movie critics may be inclined to dismiss, but it tickles the tastebuds of viewers who like some bangs for their buck, an adrenalin blast and a few jokes.",
      "author": "Adam Sweeting"
    },
    {
      "text": "The film's misplaced, weak dialogue, combined with too many jump cuts for action sequences, make The Gray Man feel like a generic cross between the Marvel universe and John Wick. That is not to say the film is horrible, but it is not good.",
      "author": "DarkSkyLady"
    },
    {
      "text": "The Gray Man is a popcorn movie for the weekend, when in reality it doesn’t take any risks.  [Full review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "Mindless but well-acted and well-shot action pic.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "[A] likeable, muscular, high-octane thriller that you’ll remember for its chaos and carnage rather more than its generic serves-its-purpose storyline.",
      "author": "Paul Mount"
    },
    {
      "text": "All that effort and all that money should have paid for a better screenplay.",
      "author": "Robert Levin"
    },
    {
      "text": "Thrills on the level of an around-the-world DIEHARD, dirs Anthony & Joe Russo out-Bond multiple times better than the current Bond. Chris Evans plays the villain to the hilt, proving that a trash 'stache and white pants can work on certain types. Great!",
      "author": "Patrick McDonald"
    },
    {
      "text": "I'll give it a B- for its simple run and gun mindset and all the butt-kicking Ryan Gosling does.",
      "author": "Derek Sante"
    },
    {
      "text": "I feel comfortable assuring you that whenever there’s shooting, running, detonating, or general mayhem onscreen, you’ll like what you’re seeing.",
      "author": "Tim Brennan"
    },
    {
      "text": "A cliché on top of a cliché... A movie made out of recycled cardboard, made by Netflix's algorithm to entertain for two hours and be forgotten five minutes later. [Full review in Spanish]",
      "author": "Juan Pablo Russo"
    },
    {
      "text": "He [Gosling] makes for a good sparring partner next to Chris Evans’ character. You can tell Evans is having an absolute blast as this reckless hotshot who dons some slicked back hair, a sharp mustache, and is the anti-Captain America.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "The Gray Man is a lot of flash with nothing to hold onto. Feeling that way about movies is not what I wanted. It left me feeling gloomy and gray.",
      "author": "Leo Brady"
    },
    {
      "text": "The Gray Man is the best example of the miserable state of contemporary action cinema.   [Full review in Spanish]",
      "author": "Ruben Peralta Rigaud"
    },
    {
      "text": "Killers with a conscience, flash drives and bosses are the real bad guys. Routine action is then not the counterbalance to the question why we are still wasting money making movies like this in 2022.",
      "author": "Erik Childress"
    },
    {
      "text": "The Gray Man is alright for an action movie on Netflix, but isn’t quite in the big leagues.",
      "author": "Natasha Alvar"
    },
    {
      "text": "Empty, obnoxious, upsetting.",
      "author": "Matt Pais"
    },
    {
      "text": "Somehow two directors who have defined blockbuster genre filmmaking recently can’t get a firm grip on this caper.",
      "author": "Alci Rengifo"
    },
    {
      "text": "…it’s hard going, instantly forgettable and impossible to start a franchise with…",
      "author": "Eddie Harrison"
    },
    {
      "text": "[A] bloated, brain-dead action movie...nothing more than a catena of big, noisy set-pieces held together by the flimsiest of plots, with an occasional bit of juvenile banter added to the otherwise pedestrian dialogue.",
      "author": "Frank Swietek"
    },
    {
      "text": "Spectacular in a garishly stylized way somewhere on the spectrum between John Woo and Michael Bay.  Big, loud, dumb escapist spy thriller stuff with nothing to say but a lot to shoot at, chase and blow up.",
      "author": "Peter Canavese"
    },
    {
      "text": "As part of the weak story, there’s a flash drive involved, which contains a treasure trove of top secret information that shouldn’t get in the wrong hands. Yes, that old canard. Too much is done for laughs. Mark Greaney doesn’t write comic novels.",
      "author": "Michael Calleri"
    },
    {
      "text": "The whole movie is more and more and more: more explosions, more fireworks, more shooting, more bullets. The Russo’s didn’t care how preposterous this became. I think they got lost in their own mythology.",
      "author": "Roger Friedman"
    },
    {
      "text": "It's impossible not to be highly entertained by the super star cast clearly having the time of their lives, the explosive action scenes and the savvy directing skills of the Russo Brothers.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Chris Evans, Ryan Gosling and Dhanush fight for your attention. The plot is clichéd, but the Russo brothers deliver a film packed with action, charismatic actors and beautiful locations.",
      "author": "Anupama Chopra"
    },
    {
      "text": "Another highly enjoyable spectacle from The Russo Brothers with some stellar action sequences and fun performances from Evans and Gosling.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Love The Russos and I'm always down for a good spy adventure.  Yet, The Gray Man left me wanting just a tad bit more.  Having said that this all star cast led by Chris Evans and Ryan Gosling are everything and who doesn't love Aflre Woodard as a badass!",
      "author": "Carla Renata"
    },
    {
      "text": "A colorful, action-packed spy flick to please the Marvel loyalists but likely forgettable to many others. ... It’s enough globetrotting to fill James Bond’s passport, cover Indiana Jones’ flight map and make even Jason Bourne dizzy.",
      "author": "Jason Fraley"
    },
    {
      "text": "It is a big, noisy, explosive adrenaline rush — a live-action spin on that old \"MAD\" magazine comic, \"Spy vs. Spy\" — and about as deep.",
      "author": "Gary M. Kramer"
    },
    {
      "text": "I think they're looking for a series that could replace [James Bond], but in order for that to happen, people need to want to see to this one and the ones to come after, and I already know I don't want to see the next one.",
      "author": "Tim Cogshell"
    },
    {
      "text": "It's kind of like watching a movie that's a trailer for itself.",
      "author": "Peter Rainer"
    },
    {
      "text": "There’s some decent action set pieces and a formidable cast, but not enough to pop out of summertime filler.",
      "author": "Kevin Carr"
    },
    {
      "text": "As with all Netflix productions with blockbuster dreams, this one is tailor made to be watched at home. You only need to lift your eyes from the second screen whenever you hear an explosion.  [Full Review in Spanish]",
      "author": "Mario Alegre"
    },
    {
      "text": "The Gray Man doesn’t have much in the way of gray matter, and almost proudly has nothing to say about anything important.",
      "author": "John Serba"
    },
    {
      "text": "Directors Anthony and Joe Russo deliver an unrelenting fusillade of star-studded, big-budget action mayhem. Their adaptation of Mark Greaney's The Gray Man espionage thriller turns on a two-hour bullets and beatdowns spigot.",
      "author": "Julian Roman"
    },
    {
      "text": "If you love the MCU and loads of cartoonish CGI violence, then you’ll love “The Gray Man.\" If you’ve read the books, avoid the movie at all costs. If you haven't read the books—read them. It's a whole summer's worth of thoroughly engrossing page-turning.",
      "author": "Mark Jackson"
    },
    {
      "text": "For all the overkill, The Gray Man is big, loud fun. Mr. Gosling is hip to what's going on; Mr. Evans gets to gobble up the scenery. And even if the elements are hackneyed, they're not clumsy.",
      "author": "John Anderson"
    },
    {
      "text": "The film exists to set up sequels, to spend money on fancy location shoots, and to look glamorous and exciting; every harder edge has been sanded down to nothing.",
      "author": "David Sims"
    },
    {
      "text": "The Gray Man wallows in its obvious excesses because it doesn’t take itself remotely serious and neither does that stellar cast... which allows for almost every absurdity that unfurls on screen to possess a wink-wink-nudge-nudge kind of appeal.",
      "author": "George M. Thomas"
    },
    {
      "text": "It as aggressively, soullessly stupid a chunk of high-density concrete as you’ll ever dial into.",
      "author": "Ty Burr"
    },
    {
      "text": "“The Gray Man” will easily fit the bill for action fans. It’s a big, loud, dumb spy-thriller that could become a franchise.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "I've watched far worse, but damn, The Gray Man is just a bland, ugly shell of an action movie.",
      "author": "Brent McKnight"
    },
    {
      "text": "Boundless, entertaining fun... And absolutely forgettable. [Full review in Spanish]",
      "author": "Randy Meeks"
    },
    {
      "text": "I suppose it's a world brimming with possibility, but The Gray Man doesn't offer us a compelling enough first chapter to have me groveling for more of the same.",
      "author": "Steven Prokopy"
    },
    {
      "text": "It's an action [film], one with fights, explosions, shootouts and a few gags. It isn't original, but it's fun. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "The Gray Man benefits from its talented ensemble cast, the Russos’ creative flair, and strong action work–it is just unfortunate that its frenetic pacing doesn’t complement the monotone premise, so it fails to revolutionize the spy thriller genre.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Netflix broke the bank on this formula action epic fronted by Ryan Gosling and Chris Evans as assassins for hire. It’s good enough to rank as watchable. But even in these inflationary times, shouldn't 200 million bucks buy us more than good enough?",
      "author": "Peter Travers"
    },
    {
      "text": "A decent, disposable action movie.",
      "author": "Sean Collier"
    },
    {
      "text": "Whilst it may not be particularly innovative, The Gray Man offers enough exciting action, two game leads, and plenty of spectacle over substance. As long as you don’t expect too much, you’ll have fun with this.",
      "author": "Matt Hudson"
    },
    {
      "text": "[The] good news is, [Ryan Gosling] pulls off a convincing action-oriented role in The Gray Man.",
      "author": "Casey Chong"
    },
    {
      "text": "It feels like a mixtape, pulling bits from a bunch of much better, much more daring action movies, to create a medley that is mediocre at best.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Both (Ryan) Gosling and (Chris) Evans feel game for a much bolder movie, however the Russos play it safe in a movie that mistakes loudness for scale.",
      "author": "Tatsam Mukherjee"
    },
    {
      "text": "Directed with cardboard proficiency, there are some knockout action pieces: one sees the disintegration of a cargo plane; the other a chase involving a tram...They’ve got a marvelously kinetic, whiz-bang energy sadly missing from the rest of the film.",
      "author": "Jim Schembri"
    },
    {
      "text": "Like a collage of other, better action pictures.",
      "author": "Allen Almachar"
    },
    {
      "text": "Combine that Avengers firepower with a charismatic all-star cast, and you'd think The Gray Man would be a must-see blockbuster. As it turns out though, it's more a can-barely-see blockbuster where the promising recipe ended up a mess on the floor.",
      "author": "Ian Sandwell"
    },
    {
      "text": "It’s involving and the action sequences are first-rate. but “The Gray Man” is a James Bond wannabe that requires a way too much suspension of disbelief.",
      "author": "Russ Simmons"
    },
    {
      "text": "Netflix’s latest actioner has a wonderful one played by Chris Evans. In this spy tale, he plays such a delicious bad guy that he manages to make up for many of the mistakes on display in this big-budget adventure.",
      "author": "Jeff York"
    },
    {
      "text": "My barista could have been cast as the lead of this action-thriller, and the film would be absolutely no different.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "Another Netflix would-be blockbuster, another disappointment.",
      "author": "James Berardinelli"
    },
    {
      "text": "It's cool to watch as a spectacle. As far as the story goes, there's nothing there. It's a very shallow film.",
      "author": "Korey Coleman"
    },
    {
      "text": "Although it has a few loose ends to the plot, for the most part it’s one long adrenaline rush.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Nothing in \"The Gray Man\" is meant to be taken seriously; this is pure summer escapist fare where the quips rattle out with the same frequency as the machine gun blasts. Rat-a-tat, keep 'em coming.",
      "author": "Adam Graham"
    },
    {
      "text": "The Gray Man is a movie filled with cardboard character cutouts and Chris Evans doing everything he can to save this inexcusably dull thriller.",
      "author": "Matt Donato"
    },
    {
      "text": "The parts and the production values are in place, but without a well-devised thread or emotional soul binding them, that makes for a dull and drab affair.",
      "author": "Tom Meek"
    },
    {
      "text": "It's fair to say there's nothing particularly fresh about this premise, but getting to watch The Gos face off with The Cap? Well I could watch that all day.",
      "author": "Kate Rodger"
    },
    {
      "text": "There’s simply no life, which means it can’t be dumb fun.",
      "author": "Fletcher Powell"
    },
    {
      "text": "[The Gray Man] is the most generic piece of mail order crud imaginable given [the directors'] pedigree.",
      "author": "Matt Lynch"
    },
    {
      "text": "While Civil War or Endgame packed a lot of over-the-top spectacle but still managed the kind of well-rounded story from previous MCU phases, The Gray Man is simply adrenaline, action, chase scenes, hand-to-hand combat and not much glue in the middle.",
      "author": "Patricia Puentes"
    },
    {
      "text": "If anything, credit to the Russos, who have staked their place in film history as the most commercially successful directors to not have a single auteurist trait beyond corporate moviemaking fealty.",
      "author": "Ethan Vestby"
    },
    {
      "text": "\"The Gray Man\" barrels along, burning the millions of dollars earmarked for its cast, globetrotting ways and special effects. Is it good? Not really. But is it fun? Hell, yes.",
      "author": "Randy Myers"
    },
    {
      "text": "The Gray Man is much better than it should be when the plot is this generic, but it still leaves some room for improvement.",
      "author": "Maria Lattila"
    },
    {
      "text": "Nothing is particularly novel in The Gray Man ... and yet it all still works as a very entertaining action thriller with comedic elements throughout.",
      "author": "Rob Dean"
    },
    {
      "text": "It’s not the most original film you’ll see this year, but it benefits from two great stars who bring a lot of charisma to their roles",
      "author": "Victoria Luxford"
    },
    {
      "text": "[T]here's very little reason to care about anything happening on screen or anyone caught up in all of those happenings.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The Gray Man is a big-budget, globe-trotting adventure that makes up in exotic locations and gunplay what it lacks in intrigue and interesting characters.",
      "author": "Richard Crouse"
    },
    {
      "text": "\"Gray\" is the right word for such an empty, forgettable piece of would-be studio intellectual property.",
      "author": "Josh Bell"
    },
    {
      "text": "The movie feels increasingly tired. All that gunplay, all that traveling, all that sneering from Lloyd: Everything gets a bit . . . much.",
      "author": "Mark Feeney"
    },
    {
      "text": "A lot of really talented actors and cool visuals wasted. The Russo Bros clearly need Marvel, and some would argue Marvel clearly needs them. Let's get 'em back together before we have to watch any more of these bad non-Marvel Russo Bros directed movies...",
      "author": "Grace Randolph"
    },
    {
      "text": "Filmmakers Anthony and Joe Russo don't seem interested in nuance or understatement, but they do know how to take an audience on an engagingly outrageous rollercoaster ride.",
      "author": "Rich Cline"
    },
    {
      "text": "Even with Evans, Gosling, Ana De Armas and Billy Bob Thornton to deliver the script, it still barely raises a smile and very quickly becomes no more than a series of set-pieces.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Star power is star power, and it’s enough to get a lot of this movie past its stylistic shortcomings.",
      "author": "Dan Scully"
    },
    {
      "text": "Note the moment during a strenuous tramway shootout when Six uses the reflection in a mirrored building to defeat a goon — it’s a clever detail in a film careening full speed ahead.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Ridiculous and pointless, but The Gray Man was still entertaining. Work out the kinks and the end game, and I'll watch more of these films for Netflix.",
      "author": "Tania Lamb"
    },
    {
      "text": "The Gray Man is an obvious attempt at an action franchise for Netflix, especially since it’s based on a series that now features 11 books. If they can match the story with the action in future installments, they may have a bonafide hit on their hands.",
      "author": "Alex Bentley"
    },
    {
      "text": "It’s a film that gets no points for realism, but a lot of points for the turn-your-brain-off background noise that’s worth tuning in for every once in a while.",
      "author": "Jonathan Sim"
    },
    {
      "text": "Too preposterous to deliver Top Gun: Maverick-level fun, and not preposterous enough to deliver RRR-level fun.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The Gray Man serves its purpose by providing a few fantastic action sequences and two exciting leads. Chris Evans plays it up beautifully. The overall experience is fun but extremely messy due to its scattered story and odd structure.",
      "author": "Austin Burke"
    },
    {
      "text": "It’s hard not to think of the title when contemplating the overall effect of a film that spares no expense to entertain, yet ends up feeling a little aimless, perplexingly bland, and -- what’s the word we’re looking for? Oh yes. Gray.",
      "author": "Jocelyn Noveck"
    },
    {
      "text": "The film is adrenalized but familiar, sporting a sarcastic sense of humor in an attempt to mitigate what's so threadbare about the premise and increasingly over-the-top fight sequences.",
      "author": "Tim Grierson"
    },
    {
      "text": "Freed from the often-rigid constraints of the MCU, the Russos are at their most unrestrained, unleashing a film whose dynamism often overtakes the more laser-focused elements of this solid summertime action-thriller.",
      "author": "Douglas Davidson"
    },
    {
      "text": "Apathy is the most severe emotion the movie sparks.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Though it's an enjoyable ride packed with movie star swagger, \"The Gray Man\" is a noticeably rocky road, and makes you wonder if the Russos can ever carry the same magic to the screen without the sparkle of Marvel's stable of heroes in their corner.",
      "author": "Matthew Jackson"
    },
    {
      "text": "The Gray Man is well-titled; this is an anonymous, by-the-numbers spy movie, with studiously bland features that make it almost impossible to pick out of a line-up.",
      "author": "Noah Berlatsky"
    },
    {
      "text": "Everything here feels so programmatically dull. It’s a silly piece of popcorn entertainment that too often forgets that this kind of venture needs to be fun.",
      "author": "Brian Tallerico"
    },
    {
      "text": "The action is, at times, hard to keep up with and lacks the crispness that would make it more engaging.",
      "author": "Nicole Ackman"
    },
    {
      "text": "It’s like a Fast & Furious movie, only with better dialogue and stronger actors delivering it.",
      "author": "Olly Richards"
    },
    {
      "text": "[An] unsubtle, clattering battle of the alpha males.",
      "author": "Anne Brodie"
    },
    {
      "text": "The Gray Man is mostly a collection of tired spy tropes, directed in a muddled and baffling way, that seemingly exists to set up what seems like will be a fairly unimaginative franchise.",
      "author": "Ross Bonaime"
    },
    {
      "text": "The Gray Man is a welcome reminder of Gosling’s lighter charms, ones he really should show off more often.",
      "author": "Richard Lawson"
    },
    {
      "text": "The film knows its mission objectives and has the clinical, vicious skills required to meet them, but occasionally over-stretches itself by virtue of its attempts to be as big and bombastic as possible.",
      "author": "Tom Beasley"
    },
    {
      "text": "Evans and Gosling do what they can with a lackluster script, but its the over the top and ridiculous action that makes this a fun watch for those that just want to turn their brains off and watch explosions.",
      "author": "Tessa Smith"
    },
    {
      "text": "There is one piece that makes that non-stop action go down smoothly — Ryan Gosling.",
      "author": "M.N. Miller"
    },
    {
      "text": "Between these characters and the over-directed action, for a globetrotting assassin thriller, it’s not all that complex, but it satisfies more than most actual video game movies.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "'The Gray Man' delivers on its promise of spectacular globetrotting action escapism, but there's a noticeable spark missing that could have elevated it above formula and into greatness.",
      "author": "Scott Campbell"
    },
    {
      "text": "The main takeaway from this one is that while the Russo brothers are excellent technicians, they’re not auteurs.",
      "author": "Travis Johnson"
    },
    {
      "text": "For all the explosions and violence and near-death escapes by our antihero, the film feels too detached from reality to make a deeper impact. There’s too much black and white, and not enough gray.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "Ahead of its debut, it was touted that The Gray Man was the most expensive movie ever produced by Netflix. The film feels like more disposable entertainment from the streamer that is eager only to brag about how many eyeballs saw something.",
      "author": "Spencer Perry"
    },
    {
      "text": "Gosling has never been in the running for Bond but the deadpan La La Land star shines in this hugely entertaining adaptation of Mark Greaney's novel.",
      "author": "Andy Lea"
    },
    {
      "text": "Could've been \"Face/Off.\" Instead it's just \"Half/Off.\"",
      "author": "Nick Rogers"
    },
    {
      "text": "The Gray Man only needs to half-occupy the attention of Netflix subscribers, and it does not care whether they watch on a home theater system, or on the toilet. It goes through the motions of a spy thriller, rather than actually trying.",
      "author": "Alan Zilberman"
    },
    {
      "text": "It’s gripping and entertaining and it’s loud and bombastic. It’s also totally brainless, requiring very few IQ points to appreciate its entire proposition.",
      "author": "Wenlei Ma"
    },
    {
      "text": "For all the sensory overload – it’s a bit like being trapped inside a first-person shooter challenge being played by a 12-year-old gaming prodigy – The Gray Man is undeniably entertaining.",
      "author": "Wendy Ide"
    },
    {
      "text": "The Gray Man would be the most insufferable big-budget release of 2022 if not for the charismatic star power of Ryan Gosling and Chris Evans.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "An insipid spy thriller that confuses big-budget spectacle for an engaging experience.",
      "author": "Matt Conway"
    },
    {
      "text": "An adrenaline-laced thriller that earns its place in the upper echelon of Netflix’s original films. If you loved The Old Guard or Extraction—which the Russos also helped shape—this is right up your alley.",
      "author": "Collier Jennings"
    },
    {
      "text": "Obviously intended as a franchise starter along the lines of Bond, Bourne, or Hunt, The Gray Man ... will likely end with a single, underwhelming entry, background fodder for game nights, post-prandial chilling, or boredom-related inertia.",
      "author": "Mel Valentin"
    },
    {
      "text": "That at least 50 shades of this feature have filled other films before can't be shaken, and yet that fact never blows up the movie... entertaining despite showing the easy dots it's connecting, and its seams.",
      "author": "Sarah Ward"
    },
    {
      "text": "A strong cast and credible ending almost makes up for the screenwriting sins in a wall-to-wall actioner with, perhaps, some franchise possibilities.",
      "author": "John Urbancich"
    },
    {
      "text": "It’s not boring but it’s not exactly fun either.",
      "author": "Joshua Starnes"
    },
    {
      "text": "'The Gray Man' makes amusing use of its all-star cast, but the action-thriller wastes the opportunity to do anything original.",
      "author": "André Hereford"
    },
    {
      "text": "\"The Russos have all the skills.  The problem is, they use all the skills. If they did half of everything they can do, their non-Marvel movies would be doubly good… or if you want me to do the math… good, maybe really, really good.\"",
      "author": "David Poland"
    },
    {
      "text": "The spy-versus-spy shenanigans plays like an excuse for the elaborate action sequences and insane stunt work, which produce a few genuine highlights but also yield gradually diminishing returns, especially down the home stretch.",
      "author": "Brian Lowry"
    },
    {
      "text": "This is exactly the kind of diversion that’s such a treat when done well, and to see it done shabbily is just a massive disappointment.",
      "author": "Liz Shannon Miller"
    },
    {
      "text": "[A] gloriously brainless action spectacular...",
      "author": "Kevin Maher"
    },
    {
      "text": "The Gray Man is Bourne with a nod to Bond, part shoot-em-up video game, but also a kind of comedy -- this last ingredient crucial to its success.",
      "author": "Paul Whitington"
    },
    {
      "text": "Each CGI-filled set-piece is worse than the last.",
      "author": "Nick Johnston"
    },
    {
      "text": "Until very recently, Netflix had money to burn. And if you’d like to see $200-million of it go up in smoke, look no further than The Gray Man, the streaming service’s costliest production to date. Is it entertaining, you ask? That’s rich!",
      "author": "Chris Knight"
    },
    {
      "text": "With an all-star cast, high-octane action scenes, and edge of your seat thrills, The Gray Man is an entertaining blockbuster that you can enjoy from the comfort of your sofa.",
      "author": "Lauren Bradshaw"
    },
    {
      "text": "Like a box of Milk Duds, it might not stay with you long, but it's easy enough to gobble down.",
      "author": "Piers Marchant"
    },
    {
      "text": "The Gray Man delivers one of the most satisfying action films of the year. Everyone in the all-star cast gets their time to shine with interesting and unique fighting sequences that showcase the intense choreography.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "Part James Bond, Jason Bourne and John Wick and all adrenaline-fueled madness, Anthony and Joe Russo’s big-budgeted Netflix expenditure “The Gray Man” is a ludicrously fun exercise in explosions, shoot-outs, and wacky characters.",
      "author": "Nate Adams"
    },
    {
      "text": "A picture that tries desperately to be an over-the-top Mission: Impossible adventure only to end up in a no-man’s land of inconsequence.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Saved only by its relentless pace, Gosling’s smarm, and Evans’s bluster, it is basically “Stupid John Wick.” Please note: John Wick is not a MENSA member.",
      "author": "Ryan Syrek"
    },
    {
      "text": "I can’t help but think that Winter Soldier was a fluke.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "There isn't a single original idea here, and that's fine!",
      "author": "Joshua Rivera"
    },
    {
      "text": "The Russos and their screenwriters, adapting Mark Greaney’s novel, have sufficient fun with all this for at least some of it to rub off on the audience.",
      "author": "Brian Viner"
    },
    {
      "text": "For all that bluster and the ever-appealing Gosling-brand reticence, one can’t help but pine for the relative complexity of the Fast & Furious sequence.",
      "author": "Tara Brady"
    },
    {
      "text": "While it eventually becomes watchable, it spends most of its runtime being visually and emotionally indecipherable.",
      "author": "Siddhant Adlakha"
    },
    {
      "text": "Joe and Anthony Russo’s use of drone cameras is genuinely fascinating.",
      "author": "Sonny Bunch"
    },
    {
      "text": "“The Gray Man” is non-stop assault on the senses as Marvel directors The Russo’s bring their over-produced style to Netflix.",
      "author": "Dustin Chase"
    },
    {
      "text": "It is easy to recommend this slick-but-not-too-slick globetrotting adventure, and it’s a solid bounce back for the Russos after last year’s “Cherry,” a disappointing based-on-a-true-story drama starring fellow MCU vet Tom Holland that landed on Apple TV+.",
      "author": "Mark Meszoros"
    },
    {
      "text": "The most enjoyable parts of \"The Gray Man\" are the two or three moments in which nothing blows up.",
      "author": "Kurt Loder"
    },
    {
      "text": "While this may be yet another potentially disposable action movie, it’s still worth seeing on the big screen at full volume if you can. The action is big and the stars give it their all, even if the dialogue leaves something to be desired.",
      "author": "Emily Zemler"
    },
    {
      "text": "The Gray Man seems to be exactly what it means to be, and in the moment, it's often fun. But there's something eerily vacant in its assembly.",
      "author": "Linda Holmes"
    },
    {
      "text": "For Gosling fans whose favorite movie was Drive, this feels like a slightly pumped up, dumbed-down version of that character, with significantly more to say about how he doesn’t actually have more to say.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Tedious and sluggish with punches and kicks and kills that barely satisfy, The Gray Man is a dead on arrival action thriller that squanders potential almost as often as Ryan Gosling chews gum.",
      "author": "Chris Sawin"
    },
    {
      "text": "There are a few high-octane and tense action sequences like the one on the Prague tram and a handful of stylishly choreographed fights, but The Gray Man's screenplay is shockingly elementary in dialogue and plot. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "The Gray Man cannot be called original... But it supplies an exceptionally well-made variation that outperforms many like it with an attractive cast, biting humor, and several riveting action sequences.",
      "author": "Brian Eggert"
    },
    {
      "text": "Something perfectly serviceable to leave on in the background while noodling on your phone, and I mean that as a compliment.",
      "author": "Alison Willmore"
    },
    {
      "text": "Netflix’s charmless new action movie is a veritable tag cloud of keywords adapted into a lump of generic subscriber bait.",
      "author": "A.A. Dowd"
    },
    {
      "text": "There is potential in every one of these action sequences, only for them to fall flat typically due to some combination of choppy editing, weightless stakes, a confused tone, and monotony",
      "author": "Robert Kojder"
    },
    {
      "text": "It's red-meat candy, a Bourne Identity for brains thoroughly trained in over-stimulation, and already long gone on summer holiday.",
      "author": "Leah Greenblatt"
    },
    {
      "text": "The Gray Man comes out blasting, that’s pretty much the extent of it.",
      "author": "Jamie Graham"
    },
    {
      "text": "The Gray Man is, essentially, the best dad action movie TNT will never broadcast.",
      "author": "Joey Magidson"
    },
    {
      "text": "The Gray Man wants to remind you of what an old-school dopamine dump these types of entertainments are, and it has what seems to be the necessary ingredients to do it. Which, to be honest, only makes you wish this was tighter, tauter, tougher, better.",
      "author": "David Fear"
    },
    {
      "text": "To put it in the reference-heavy parlance of The Gray Man: It's The Cringe Ultimatum, baby.",
      "author": "Dan Jackson"
    },
    {
      "text": "The Gray Man is the kind of action movie we’ve come to love from the Russos and a great time -- especially if you love Gosling and Evans just throwing one-liners at each other while getting stabbed, shot, punched, and thrown into cars.",
      "author": "Rachel Leishman"
    },
    {
      "text": "The experience of watching it is to be aware at every moment that what you are facing is a carefully calculated, wholly corporate product, entirely predictable and devoid of any authorship or originality.",
      "author": "David Sexton"
    },
    {
      "text": "The filmmakers aren't even content merely stealing plot points or interactions or motives from other works; they also borrow actors and practically the same characters they previously portrayed, to be inserted directly into this script.",
      "author": "Mike Massie"
    },
    {
      "text": "The Gray Man isn’t a bad movie, just one wilfully drained of substance or even dramatic tension.",
      "author": "Danny Leigh"
    },
    {
      "text": "In terms of delivering an entertaining blockbuster replica that will get subscribers to hit “Play”, The Gray Man gets the job done.",
      "author": "Travis Hopson"
    },
    {
      "text": "An incredible cast and a simple enough premise completely undone by the Russo brothers' inconsistent visual language and overall shoddy filmmaking technique. In someone else's hands, with a less frenetic script, this could have been an easy layup.",
      "author": "Dominic Griffin"
    },
    {
      "text": "Not the return to cinema from Gosling we deserve.",
      "author": "Hannah Strong"
    },
    {
      "text": "They should have just called him “The Cliché Man.”",
      "author": "Richard Roeper"
    },
    {
      "text": "It is a thriller made by people who know what great thrillers can do, but without the ability to make one themselves.",
      "author": "Barry Hertz"
    },
    {
      "text": "An expensive (and expensive-looking) Netflix-produced action caper that sets the two marquee-topping actors against each other for instantly forgettable reasons.",
      "author": "Simon Abrams"
    },
    {
      "text": "Around halfway through a sustained shootout in Prague, the sheer thundering mindlessness of the whole enterprise becomes impossible to ignore.",
      "author": "Robbie Collin"
    },
    {
      "text": "\"The Gray Man\" is the kind of needless action movie that usually gets released in late August... But along with its many other flaws, \"The Gray Man\" didn't even have the decency to wait a few weeks.",
      "author": "Cary Darling"
    },
    {
      "text": "A bad parody of a terrible Michael Bay movie.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A Robert Ludlum-esque spy thriller that is more interested in dodging offending anyone’s politics than telling a coherent story, The Gray Man is perfectly mediocre entertainment because no single aspect is good enough to recommend.",
      "author": "Ryan Silberstein"
    },
    {
      "text": "It comes off as oddly limp and airless, one of Netflix’s $200m action films (à la Red Notice) that will be on their landing page today and instantly forgotten tomorrow.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "This is not a film weighed down by the need to be deep. But, dear Lloyd, it’s a hoot.",
      "author": "Charlotte O'Sullivan"
    },
    {
      "text": "A nearly nonstop two-hour action-packed ride that is part Bond, part Bourne, but really its own bag and a potential franchise-starter for Ryan Gosling.",
      "author": "Pete Hammond"
    },
    {
      "text": "The result is a film that never seems to know what it's doing, or why. The irony is that it keeps trying to be The Bourne Identity, and yet it still ends up with an identity crisis.",
      "author": "Nicholas Barber"
    },
    {
      "text": "Tinkering with the spy-action wheel rather than reinventing it, this is a pacy, ruggedly entertaining romp, with a punchy pair of lead turns from Gosling and Evans.",
      "author": "John Nugent"
    },
    {
      "text": "While the movie itself may prove nearly as unmemorable as its hero ostensibly wants to be, it’s anything but inconspicuous.",
      "author": "John DeFore"
    },
    {
      "text": "Gosling is a great choice to play an implosive spy with a good heart and some long-suppressed family issues, and yet the character’s mottled contours are buried too deep to feel.",
      "author": "David Ehrlich"
    },
    {
      "text": "Production budgets swell, stock prices go down, but Netflix subscribers are the big winners in this Bond-level summer blockbuster from the Russo brothers.",
      "author": "Peter Debruge"
    },
    {
      "text": "In spite of a pretty appalling script, the banter between Gosling and Evans is every bit as charming as expected.",
      "author": "Rachel Ho"
    },
    {
      "text": "It’s basically Netflix Winding Refn; it’s globe-trotting comic nihilism for the whole streaming-loving family.",
      "author": "Justin Chang"
    },
    {
      "text": "It’s really just two hours of Chris Evans in a bad mustache chasing Ryan Gosling around the world trying to kill him. You could do worse. Of course, you could also do better.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "The Russo brothers are aces at making superhero movies. They need more practice with superspies.",
      "author": "Brian Truitt"
    },
    {
      "text": "There’s plenty of gonzo action but no heart and no real dramatic voltage.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "Wait and catch it on Netflix.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The Gray Man is a noisy, flashy spectacle that piles clichés atop ludicrous plotting and sprinkles it all with half-funny quips.",
      "author": "Chris Barsanti"
    },
    {
      "text": "The Gray Man moves just as fast as the 1970s thrillers, too, with barely a moment to breathe.",
      "author": "Danielle Solzman"
    },
    {
      "text": "While the action can be taut and engrossing at times, and Chris Evans is terrific as a sociopath, “The Gray Man” ultimately feels like a movie we’ve seen a dozen times before.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "A non-stop thrill ride full of jaw-dropping action, intense fight sequences, quippy dialogue and a dream cast highlighted by a deliciously evil Chris Evans as your new favorite villain.",
      "author": "Joey Morona"
    },
    {
      "text": "As long as the action remains at a smaller scale, it’s satisfying.",
      "author": "Matt Singer"
    },
    {
      "text": "It's entertaining, sure. Gosling is as buff as he’s ever been and all-in as an action star, and Chris Evans seems to enjoy playing psycho. But almost nothing happens in The Gray Man that doesn’t remind you of something better.",
      "author": "Jim Slotek"
    },
    {
      "text": "With relentless pacing and glamorous locales, there is a Bond-like quality to The Gray Man, although the Russos’ tendency to lean heavily on CGI detracts slightly.",
      "author": "James Mottram"
    },
    {
      "text": "Evans's performance is, alas, the only notable thing in this preposterous, globe-trotting movie with so many cliché moments of barked dialogue it comes this close to sounding like a Saturday Night Live parody.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "The Gray Man proves that the Russo brothers don’t need superpowers to turn massive budgets into mush.",
      "author": "Jacob Oller"
    },
    {
      "text": "An enjoyable romp slightly let down by a meandering screenplay.",
      "author": "Linda Marric"
    },
    {
      "text": "An aggressively mediocre action flick.",
      "author": "Hoai-Tran Bui"
    },
    {
      "text": "With a sprawling, impressive ensemble, the filmmakers masterfully play to their actors’ strengths while gifting audiences with a thoroughly engrossing, entertaining (if not excessively so) summer thriller.",
      "author": "Courtney Howard"
    },
    {
      "text": "Silly but so much fun to watch. Ryan Gosling is a great action hero.",
      "author": "Chris Bumbray"
    },
    {
      "text": "The Gray Man is a spiritual throwback to 80s/90s action movies, with pulse-pounding fight scenes, delightfully cheesy dialogue & wickedly fun villain.",
      "author": "Molly Freeman"
    },
    {
      "text": "One of the better action movies of the year, twisting all of its Bourne and Bond influences into something quite different but equally exceptional.",
      "author": "Edward Douglas"
    },
    {
      "text": "Netflix delivers with The Gray Man, a rip-roaring and star-powered spy romp that puts all the money on screen as Ryan Gosling and Chris Evans go head to head.",
      "author": "Richard Trenholm"
    },
    {
      "text": "Wall to wall, the Russos have unleashed what may stand as the best pure action movie of 2022.",
      "author": "Don Shanahan"
    },
    {
      "text": "I wandered into The Gray Man like a child toddles into a candy store with no adult supervision; it wasn’t healthy, things got a little sticky and very loud, but I had a good time. There’s just so much to see.",
      "author": "Sherin Nicole"
    },
    {
      "text": "As the tight polo-wearing, unstable lunatic with a chillingly calm demeanor when he feels like he's in control, you can pretty much tell Evans is having the time of his life playing a wickedly charming psychopath who answers to no one.",
      "author": "Matt Neglia"
    }
  ],
  "release_year": 2022,
  "duration": 129,
  "genres": [
    "Action",
    "Mystery & Thriller"
  ],
  "age_rating": "PG-13",
  "synopsis": "When the CIA's most skilled mercenary--whose true identity is known to none--accidentally uncovers dark agency secrets, a psychopathic former colleague puts a bounty on his head, setting off a global manhunt by international assassins.",
  "popularity": 9.0,
  "poster_url": "https://image.tmdb.org/t/p/original/5Eom3JsXgQlCj6QIsGCwXkX7wyH.jpg"
}