{
  "movie_name": "The Martian",
  "movie_id": "the_martian",
  "total_reviews": 383,
  "reviews": [
    {
      "text": "Welcome back, Sir Ridley Scott. The Martian was easily one of my favorite blockbusters of the year, a film crowded with a stunning cast in which everyone is given their due.",
      "author": "Brendan Cassidy"
    },
    {
      "text": "As a piece of sweeping populist entertainment, The Martian is a great success, despite a couple of issues that perturb throughout.",
      "author": "Josh Slater-Williams"
    },
    {
      "text": "Damon has always had a knack for playing ordinary but determined men, and this quality is ideal for the role he has here: a Robinson Crusoe on the red planet.",
      "author": "Edward Porter"
    },
    {
      "text": "This entertaining mixture of striking visuals and patient, methodical narrative has little in common with Scott’s past sci-fi experiences.",
      "author": "Keith Garlington"
    },
    {
      "text": "A crowd-pleaser, complete with several disco songs on the kitschy soundtrack and a predictably applaud-worthy climax.",
      "author": "Brian Eggert"
    },
    {
      "text": "While The Martian honors the common good and the value of a single human life, I also reflected on the fictional worldwide effort it took to bring Watney home.",
      "author": "Hosea Rupprecht"
    },
    {
      "text": "A sci-fi movie heavy on science but even heavier on the abilities of the human mind to work through any situation presents.",
      "author": "Michael J. Casey"
    },
    {
      "text": "The best blockbuster of the year arrived later than anticipated.",
      "author": "Kip Mooney"
    },
    {
      "text": "The Martian somehow made the intricacies of growing crops in space exciting, continuing the trend of excellent science fiction that leaned heavily into the science.",
      "author": "Nathan Mattise"
    },
    {
      "text": "Ridley Scott and Matt Damon team up for a space-based drama that'll make you chuckle.",
      "author": "Ben Homewood"
    },
    {
      "text": "A fun film, a space Western about the strength of the human spirit and the indomitable will. \"Interstellar\" tread similar thematic ground last year but did so without the humour, the cheesy 70's soundtrack or, most importantly, Matt Damon.",
      "author": "Richard Crouse"
    },
    {
      "text": "It seems to understand that the quotidian of life in space as a lone man attempts to survive is as fascinating as any storm or explosion.",
      "author": "Nicole Ackman"
    },
    {
      "text": "The Martian is exactly the reason why we watch movies. It's fun, exciting, and a thrilling spectacle with deep emotional payoffs and strong performances from its all-star cast.",
      "author": "Rudie Obias"
    },
    {
      "text": "Matt Damon's strong central performance anchors this compelling sci-fi adventure about a man stuck on Mars while the folks back home try to find an easy way to rescue him.",
      "author": "Wesley Lovell"
    },
    {
      "text": "When the bits of suspense arrive, they're handled with Scott's veteran expertise and Damon's sensational screen presence.",
      "author": "Mike Massie"
    },
    {
      "text": "[Damon] is supported by a top-flight cast that includes Jessica Chastain, Donald Glover, Chiwetel Ejiofor, Benedict Wong, Aksel Hennie...",
      "author": "Norman Wilner"
    },
    {
      "text": "The screenplay, unhappily, has retained the general flatness of the scenes on Earth...Scott has a number of talented performers at his disposal, who struggle to make something of the oddly colorless and often drama-less dialogue...",
      "author": "David Walsh"
    },
    {
      "text": "An epic space adventure, a story of one man's determination, fighting for survival in the most hostile environment imaginable, an effects-driven tentpole, a small human story, and much more.",
      "author": "Brent McKnight"
    },
    {
      "text": "It has to be said directly: The Martian is a very clever movie and perhaps the most intriguing science fiction movie that Ridley Scott has directed in a long time. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "It was fun, it was fluffy, it was entertaining, but I didn't think it was a great movie.",
      "author": "Andrew Galdi"
    },
    {
      "text": "I was pumped up at the end.",
      "author": "Avaryl Halley"
    },
    {
      "text": "The almost octogenarian filmmaker has managed to set up a production that is a constant paragon of cinematographic virtues. [Full Review in Spanish]",
      "author": "Sergio Benítez"
    },
    {
      "text": "Once again, mixing tragedy and comedy is not something that everyone knows how to do. Scott has plenty of talent not to fall for fashion. And yet he does. [Full Review in Spanish]",
      "author": "Alberto Abuín"
    },
    {
      "text": "A crowd pleaser for all ages that is fun but tense, meaty yet light, and about as inspiring as it gets.",
      "author": "Dan Scully"
    },
    {
      "text": "The Martian is a story about people working together but thinking for themselves. It is also a first class piece of cinematic entertainment...",
      "author": "Kathi Maio"
    },
    {
      "text": "The Martian is the movie we need right now.",
      "author": "Tim Brennan"
    },
    {
      "text": "The Martian is a major return to form for Scott, who seems inspired by NASA's can-do spirit.",
      "author": "Chris McCoy"
    },
    {
      "text": "Watney may be taking a bunch of giant steps for mankind, but The Martian merely tiptoes around other great films that take on a similar topic.",
      "author": "David Harris"
    },
    {
      "text": "The Martian consumes audiences from start to finish. Damon's witty performance makes the film both fun and intense while Scott's balance of Mars, Earth, emotion, politics, science and humor is an impressive and enthralling feat.",
      "author": "Brandon Davis"
    },
    {
      "text": "\"The Martian\" is this decade's \"Cast Away,\" but if \"Cast Away\" took place in a world that was constantly plugged in and online.",
      "author": "Kirsten Acuna"
    },
    {
      "text": "The Martian is that rare film that both thrills and inspires, so much so that i'm sure it will be seen repeatedly at the theater and at home for years to come.",
      "author": "Leslie Combemale"
    },
    {
      "text": "I can't see fans of the book (myself included) being remotely disappointed and imagine newcomers will be equally as enamoured.",
      "author": "Kate Rodger"
    },
    {
      "text": "While Gravity was a mediation on the choice to survive, The Martian is a celebration of our ability to survive no matter what, even when we should very much be dead.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Scott manages to take potentially dry scientific ideas and turns it into thrilling cinematic gold.",
      "author": "Mattie Lucas"
    },
    {
      "text": "The Martian is the unique kind of blockbuster that you can marvel at in awe while still maintaining an emotional connection. It truly does have it all.",
      "author": "Beth McDonough"
    },
    {
      "text": "The Martian is a stunning return to form for Ridley Scott and a great film in its own right.",
      "author": "Phil W. Bayles"
    },
    {
      "text": "The Martian is a film that is driven and well-rounded family entertainment that is sure to please everyone and maybe make them want to go pick up a science book.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "The Martian is ultimately a love letter to the spirit that saw humanity reach for the stars in the first place. When it's channelling that spirit via Damon and witty writing it lifts off, but then can't quite sustain its trajectory.",
      "author": "Ben Nicholson"
    },
    {
      "text": "Definitely my favorite live action film of the year.",
      "author": "Rachel Wagner"
    },
    {
      "text": "The Martian won't please those expecting a dark, terrorizing thrill ride where the heroes are in constant peril, but it'll make the rest of us laugh and cheer, which is something sci-fi blockbusters don't do enough these days.",
      "author": "Bernard Boo"
    },
    {
      "text": "Ridley Scott returns to demonstrate that he is a great science fiction storyteller. [Full Review in Spanish]",
      "author": "David Ocadiz"
    },
    {
      "text": "A hugely entertaining movie about the scientific ingenuity of man while coping with the age-old dangers of abandonment and isolation. Despite coming in at 144 minutes it doesn't feel long at all (or maybe I'm just still on Mars time).",
      "author": "Sarah Cartland"
    },
    {
      "text": "The Martian is a crowdpleaser, hopefully one that may inspire the next generation of space explorations.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "It's breezy and fun, and director Ridley Scott makes the most of his talented cast.",
      "author": "Micheal Compton"
    },
    {
      "text": "The Martian is that rarest of aliens - a movie that is a heartfelt celebration of what science can accomplish, wrapped in purest entertainment.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Hopefully, The Martian is not dismissed as a foreign alien in the minds of ardent movie-going SF enthusiasts looking for a realistic and soulful space-age adventure with a refreshing backbone of scientific curiosity and candidness.",
      "author": "Frank Ochieng"
    },
    {
      "text": "The Martian is a pleasant and heartwarming surprise as both a science-fiction film and a Ridley Scott film.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "It's a brave, new world that looks a lot like our current world, just with a whole lot more red sand.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "The Martian is a finely shot, extremely well-acted film that is so by-the-numbers I hope to never see it again. In fact, I think I'd rather be stranded on Mars.",
      "author": "Aaron Peterson"
    },
    {
      "text": "A kind of Saving Private Ryan in space.",
      "author": "Pat Padua"
    },
    {
      "text": "Entertaining and visually appealing though it is, The Martian lacks one key element: characters.",
      "author": "Molly Templeton"
    },
    {
      "text": "I saw Ridley Scott's new film The Martian last night and loved every moment of it-well, almost every moment of it.",
      "author": "Charles Mudede"
    },
    {
      "text": "\"The Martian\" is exactly what you expect it to be: tense, humorous and dramatic.",
      "author": "Pamela Powell"
    },
    {
      "text": "Matt Damon could make a career out of playing marooned astronauts and I would be totally fine with that.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "Maybe the film is so bright because the days are thirty-nine minutes longer on Mars than on Earth, the same thirty-nine minutes that should have been cut from this Friday-less Robinson Crusoe.",
      "author": "A.S. Hamrah"
    },
    {
      "text": "Scott only gets it half right, but the science lecture up to the go-for-broke finale, is scintillating in its own cerebral right.",
      "author": "Tom Meek"
    },
    {
      "text": "In an era of \"look at me\" CGI fireworks, here's a movie with a \"let's work together\" emphasis on problem-solving and teamwork.",
      "author": "Mark Keizer"
    },
    {
      "text": "Rarely has a movie felt more sketched out on the back of a napkin. It is riddled with distracting continuity errors and puzzles, including the undying question: what is a botanist even doing on Mars?",
      "author": "Camilla Long"
    },
    {
      "text": "The Martian is fantastic and a great return to form for Ridley Scott. He stages the film around the theme of survival and man's willingness to defy death, which ultimately winds up uplifting",
      "author": "Robert Kojder"
    },
    {
      "text": "Yes, The Martian, which is based on a novel by Andy Weir, covers pretty familiar science-fiction ground, but the execution is marvellous.",
      "author": "Matthew Bond"
    },
    {
      "text": "The Martian is not self-serious, and is a reminder that you can make a movie with real stakes, depth, and tension and still include humor-it does not have to be one or the other (I'm looking at you, Christopher Nolan).",
      "author": "Sarah Marrs"
    },
    {
      "text": "... this bloated by mostly entertaining chunk of shameless American triumphalism casts Matt Damon as Mark Watney...",
      "author": "José Teodoro"
    },
    {
      "text": "The Martian is its own worst enemy: the good stuff at the beginning makes the run-of-the-mill stuff seem worse than it is.",
      "author": "M. Faust"
    },
    {
      "text": "The Martian never loses sight of the fact that it is about a supreme test of will and intelligence and human triumph.",
      "author": "tt stern-enzi"
    },
    {
      "text": "To watch The Martian is to witness the development of one man's pedagogy of what it means to exist in the universe.",
      "author": "Brooke Corso"
    },
    {
      "text": "The Martian would be a great engineering recruitment film - if it ever mentioned the word 'engineering.'",
      "author": "Alex Heeney"
    },
    {
      "text": "The Martian is a movie about hope, and there isn't one moment in the entire film where you aren't hoping along with Watney that he'll get home safe.",
      "author": "Julia Alexander"
    },
    {
      "text": "Ridley Scott handles the planetary and space sequences beautifully, especially an action-packed climax that will have you on the edge of your seat.",
      "author": "Paul Whitington"
    },
    {
      "text": "It's the nearest most of us will get to feeling like we've lived on Mars for an eternity. And that's not saying a lot.",
      "author": "Tanya Sweeney"
    },
    {
      "text": "Packed with as much science-fact as it is with science-fiction, The Martian is a hugely ambitious story told with genuine heart. Matt Damon delivers a knockout performance, and this film marks Ridley Scott finally getting back to his best form.",
      "author": "Cassam Looch"
    },
    {
      "text": "As pure numbers-game suspense, the movie passes inspection, but the relative absence of soul searching... makes it seem a specious vehicle for the trumpeting of such human values as cooperation, perseverance, and self-sacrifice.",
      "author": "Benjamin Mercer"
    },
    {
      "text": "While Weir's story, which screenwriter Drew Goddard adapted for Scott, may not be particularly profound -- we're not talking Blade Runner here, after all -- it is memorable. Which just shows you what a little attitude can accomplish.",
      "author": "Dan Webster"
    },
    {
      "text": "It's a little corny, of course, but a little corn can be good for the soul. You leave The Martian thinking that maybe the problems here on Earth aren't so bad after all.",
      "author": "John Powers"
    },
    {
      "text": "The Martian is a film about human error, the will to survive, and the responsibility that we have as human beings, not just to the work that we dedicate our lives to, but to one another as people.",
      "author": "Aramide Tinubu"
    },
    {
      "text": "A half-hour into The Martian any seasoned moviegoer can figure out where the plotline in this feel-good movie has to go. That's a shame and the film's biggest transgression.",
      "author": "Dwight Brown"
    },
    {
      "text": "It is at once a thoughtful, witty, intelligent, tense, and emotional experience, as beautiful in presentation as it is delightful in spirit.",
      "author": "David Fontana"
    },
    {
      "text": "Despite being marketed under the mainstream bait of a \"space movie,\" The Martian is, more than anything, a love letter to science, without ever feeling like a boring textbook.",
      "author": "Kristen Yoonsoo Kim"
    },
    {
      "text": "It's true geek entertainment, not just in the sense that it's science fiction, but because it's about a group of smart, competent characters solving problems that pan out like lethal brain teasers.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "Director Ridley Scott and screenwriter Drew Goddard have managed to turn a series of math equations into exciting filmed entertainment.",
      "author": "Sonny Bunch"
    },
    {
      "text": "... the rare science fiction drama that is actually built on applied physics and engineering and organic chemistry and where survival depends on creative problem solving and teamwork across millions of miles.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Sir Ridley Scott's The Martian is a thoroughly entertaining epic that easily ranks as one of the best films of 2015, and as the director's best film since 2000's Gladiator.",
      "author": "Jeff Beck"
    },
    {
      "text": "I have no idea if the science in The Martian is accurate. It sure felt accurate, which is all that matters in a way. On top of being wildly entertaining, the film is about using your wits to overcome seemingly insurmountable odds.",
      "author": "Max Weiss"
    },
    {
      "text": "You may discover hearing songs that normally provoke in you a knee-jerk flailing at whatever source is playing them ('Turn it off!!!') will here make you feel strangely happy.",
      "author": "Mark Jackson"
    },
    {
      "text": "The Martian is to moviegoers of today what 2001: A Space Odyssey was to audiences in 1968.... But Scott's rendition is more light-hearted and nerdy, and he clearly relishes every minute of the project.",
      "author": "Kaori Shoji"
    },
    {
      "text": "The film is racked with clichés, but largely because of Damon's presence as a compact ball of energy and optimism, The Martian ends up a passably impressive tale of survival, fired with a curious mix of thrill and humour.",
      "author": "Kong Rithdee"
    },
    {
      "text": "It's just a cracklingly good entertainment, a crowd-pleaser that's compelling and emotional and even a little inspirational.",
      "author": "Jason Bailey"
    },
    {
      "text": "The interplanetary tech geek gardening thriller of the year.",
      "author": "Russell Baillie"
    },
    {
      "text": "I'm so glad the filmmakers let Watney let his nerd flag fly, and I hope this movie will inspire other filmmakers to do the same.",
      "author": "Margaux Henquinet"
    },
    {
      "text": "The most colossally mediocre sci-fi movie of the decade, all in pursuit of empty backslapping and a grade school level celebration of science.",
      "author": "J. Olson"
    },
    {
      "text": "The Martian marks a huge, and much-needed, achievement for Scott and for Damon, whose part further cements his status as one of the biggest actors today.",
      "author": "Marija Djurovic"
    },
    {
      "text": "Here's a space travel epic that digs deep into technicalities and still manages to be tremendously thrilling and fun.",
      "author": "Edmund Lee"
    },
    {
      "text": "Like Tom Hanks before him and Leonardo DiCaprio, Damon doesn't shrink from the burden of being alone onscreen for so much of the film-he owns it....",
      "author": "James Plath"
    },
    {
      "text": "It's an adventure, pure and simple, in the tradition of Robinson Crusoe and Gulliver. And every bit as timeless.",
      "author": "Bill Newcott"
    },
    {
      "text": "I like my \"alone in space\" movies to be far weirder and more cerebral than The Martian. Scott or Damon can stay on Mars; fly me to to Sam Rockwell and the Moon or directly into the Sun with Danny Boyle.",
      "author": "Blake Howard"
    },
    {
      "text": "When it comes time for the inevitable 'triumph-of-the-human-spirit' that necessitates this regurgitated survival narrative, all that computes is smugness and nationalism.",
      "author": "Jaymes Durante"
    },
    {
      "text": "Sci-fi is withouth a doubt the genre in which Ridley Scott feels at his most comfortable, and he finally delivers an entertaining movie worthy of his caliber, even if it's not a masterpiece. [Full Review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "The biggest surprise in Ridley Scott's latest film, The Martian , is that Damon is very funny, in a movie that you wouldn't have expected to have any laughs. So if you've been put off",
      "author": "Hannah Brown"
    },
    {
      "text": "The Martian may be light, but it's a fun ride out of this world.",
      "author": "Matt Goldberg"
    },
    {
      "text": "A rollicking space procedural that depends on some logic, and a great deal of luck.",
      "author": "Jordan Raup"
    },
    {
      "text": "Probably The Martian proves to be an entertaining popcorn movie that pleases general audiences but is beyond of being as good as Alien and Blade Runner. [Full Review in Spanish]",
      "author": "Oscar Uriel"
    },
    {
      "text": "The ending is so farfetched that the suspension of disbelief dies long before anyone in the film ever does.",
      "author": "Paul Chambers"
    },
    {
      "text": "Will eventually find itself planted amongst the best in Ridley Scott's bulging anthology as it is perfectly paced, visually stunning, and mentally challenging",
      "author": "Frank Wilkins"
    },
    {
      "text": "Charming and exciting without ever losing sight of its tale of humanity, and science.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "The Martian pushes the right emotional buttons and is a crowd-pleaser.",
      "author": "Kevin Carr"
    },
    {
      "text": "This stranded-astronaut movie can't muster all that much drama. Watney's crewmates just can't convey much emotion; Watney mostly emits smart-ass movie lines. NASA's tech and its astronauts' gutsiness and smarts are glorified to the point of porn-iness.",
      "author": "Brian Gibson"
    },
    {
      "text": "If the title Robinson Crusoe on Mars hadn't already been snagged... it would be a perfect fit for Ridley Scott's space epic, which maroons Matt Damon's astronaut on the red planet and then shows him using Crusoe-like ingenuity in a bid to survive.",
      "author": "Jason Best"
    },
    {
      "text": "...an often potent sci-fi drama that benefits substantially from Damon's almost impossible charismatic performance...",
      "author": "David Nusair"
    },
    {
      "text": "Damon has never seemed more at home than he does here, millions of miles adrift. Would any other actor have shouldered the weight of the role with such diligent grace?",
      "author": "Anthony Lane"
    },
    {
      "text": "Fascinating, feel-good and quite simply a hugely fun reason to head to the cinema.",
      "author": "Alex Zane"
    },
    {
      "text": "If Damon manages to get into the awards fray for this role -- and he should -- it will be thanks to the fact that he makes it easy to understand how a desperate man could still find a way to laugh.",
      "author": "Caroline Framke"
    },
    {
      "text": "Despite following fast in the warp drive of Gravity, Interstellar and Scott's own Prometheus, this fabulously entertaining film doesn't suffer either through space fatigue or by comparison.",
      "author": "Demetrios Matheou"
    },
    {
      "text": "Sci-fi maestro Ridley Scott is in his element employing the 3D format to dazzlling effect.",
      "author": "Georgia Morgan"
    },
    {
      "text": "It's pretty sunny and often funny, a space oddity for a director not known for pictures with a sense of humor.",
      "author": "Soren Andersen"
    },
    {
      "text": "The Martian is entertaining not because of how it ends, which you can probably guess, but from watching a whole bunch of really smart people figure out how to get there.",
      "author": "Chris Hewitt"
    },
    {
      "text": "One of Ridley Scott's better films in years features one of Matt Damon's best performances.",
      "author": "David Blaustein"
    },
    {
      "text": "The Martian takes all the romance out of Mars, but substitutes in its place science, cooperation, and human perseverance. Fair bargain.",
      "author": "Kelly Vance"
    },
    {
      "text": "The Martian is one of the films of the year so far.",
      "author": "Mark Adams"
    },
    {
      "text": "Despite a lack of psychological depth, The Martian succeeds as a tribute to humanity's collective resolve.",
      "author": "Daniel Gelb"
    },
    {
      "text": "The Martian is the kind of sci-fi movie I've been wanting for a long time-one where science takes center stage and the wondrous, awe-inspiring things that happen all stem from people solving problems using their brains, working collaboratively.",
      "author": "Kyle Anderson"
    },
    {
      "text": "The Martian is a brilliantly designed entertainment that combines all the intricacies of good speculative fiction with a surprisingly lighthearted tone of survival.",
      "author": "Jay Stone"
    },
    {
      "text": "With The Martian, director Ridley Scott and star Matt Damon deliver an almost perfect piece of popular filmmaking, an intimate sci-fi epic that is smart, spectacular and stirring.",
      "author": "Robert W. Butler"
    },
    {
      "text": "The Martian is an all-American movie about complicated problems that has no deep emotional complications whatsoever, and though that would normally kill a movie for me, Scott and Damon make it an exhilarating experience.",
      "author": "Joanna Connors"
    },
    {
      "text": "Bringing optimism, nerd-itude and a touch of crazy to his character's solo ordeal -- at one point, scraggly Watney calls himself a \"space pirate\" -- Damon is the key to the movie's exuberance.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "As the movie celebrates the astronaut's industry and intelligence (and the smarts of his NASA colleagues), it offers a riposte to the shortsightedness and science-denying attitudes of those unwilling to invest in solutions to the Earth's own dilemmas.",
      "author": "John Beifuss"
    },
    {
      "text": "It isn't perfect, but The Martian is a triumph. From sound design to the visuals to watching the problem-solving unfold, it is astounding.",
      "author": "Josh Lasser"
    },
    {
      "text": "cott's directorial skills are such that for much of the film you're rooted to your seat as Damon's Mark Watney struggles to survive.",
      "author": "David Stratton"
    },
    {
      "text": "Riddley Scott proves again why he is the master of science fiction. [Full review in Spanish]",
      "author": "Jordi Batlle Caminal"
    },
    {
      "text": "dispenses with so much of the standard violent-action fare we have come to expect from science fiction films and instead returns the genre to its roots in the thrill of exploration and the wonders of science",
      "author": "James Kendrick"
    },
    {
      "text": "While this movie isn't as good as 'Interstellar', the science is more believable and the story is certainly a lot more straightforward and understandable, especially for the non-geeks amongst us.",
      "author": "Robert Roten"
    },
    {
      "text": "It's not transcendent, but it is full of excitement. [Full review in Spanish]",
      "author": "Javier Ocaña"
    },
    {
      "text": "A space adventure that surprises because of its fun and dynamic tone. [Full review in Spanish]",
      "author": "José Arce"
    },
    {
      "text": "Great visuals are not enough to fill the screen for the long running time of this predictable movie. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "High octane entertainment. [Full review in Spanish]",
      "author": "Nicolás Ruiz"
    },
    {
      "text": "A magnificent movie and one of the most enjoyable films Scott has ever directed. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Damon has a \"care for me\" gene that (one can argue) makes him one of the MVPs in Hollywood and he just takes us along with him on a ride that I, for one, wouldn't have missed.",
      "author": "Jules Brenner"
    },
    {
      "text": "It's a predictable and pleasing film. [Full review in Spanish]",
      "author": "Fernanda Solórzano"
    },
    {
      "text": "M﻿ore genial than suspenseful, more diverting than absorbing, but (thanks especially to Damon) consistently worthy of your good will.",
      "author": "Stuart Klawans"
    },
    {
      "text": "Excellent film with spectacular visual effects and charming Matt Damon. [Full review in Spanish]",
      "author": "Mario P. Székely"
    },
    {
      "text": "An excellent complement to the novel, simplifying the science without dumbing it down yet retaining the suspense and urgency of its interplanetary stranding.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Ridley Scott's The Martian may not be a great film, but it is great pop entertainment. For a full two hours and 20 minutes, it has the ability to hold an audience spellbound.",
      "author": "Ken Hanke"
    },
    {
      "text": "Ridley Scott shows a lighter touch this time in outer space as Matt Damon proves there is life on Mars and in this gem of a sci-fi adventure.",
      "author": "Pete Hammond"
    },
    {
      "text": "The Martian is no masterpiece, but it is a fine film from a talented director.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Just as people began to write off veteran director Ridley Scott after a series of merely OK movies, the 77-year-old casually releases his most entertaining film in years.",
      "author": "Rich Cline"
    },
    {
      "text": "Hollywood wastes billions of dollars each year trying to figure out how to entertain moviegoers. In reality, it's a pretty simple formula: Space travel + '70s-era radio hits = awesomeness.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "Deals with universal themes like survival, compassion, the importance of intelligence, scientific/technological know-how, cooperation, persistence and hope. It's truly a movie that matters.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "This is still a very nerdy movie, with lots of botany and physics and \"we ran the numbers and it checks out,\" but most of the book's wonkiness is ironed out in favor of moving the story along more pleasingly for the science-allergic.",
      "author": "Alissa Wilkinson"
    },
    {
      "text": "The humor and Damon's normal-guy qualities -- despite being a genius scientist -- make living on Mars all the more relatable to us. He and others also make math look cool. Geeks rule in this movie.",
      "author": "Michael Smith"
    },
    {
      "text": "While it boasts plenty of amazing effects and wide open vistas to justify its apportionment of IMAX screens, the film -- featuring a droll Matt Damon in the title role -- is a celebration of science, selflessness and good old-fashioned smarts.",
      "author": "Zaki Hasan"
    },
    {
      "text": "If there's one fault to find in this inspiring tale, it's that Damon's just too smart and self-effacing to be real. But to say that would be too cynical: a trait this film is hiding away in the same cupboard, thankfully, with all of the schmaltz.",
      "author": "Eric Melin"
    },
    {
      "text": "Think Robinson Crusoe on Mars, though sans any primitive manservant named Friday.",
      "author": "Kam Williams"
    },
    {
      "text": "The Martian isn't Scott's best film, but it's up there with the good ones. [Full review in Spanish]",
      "author": "Fausto Ponce"
    },
    {
      "text": "It rescues the carreer of a director and an actor who hadn't made anything interesting in the last couple of years. [Full review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "The Martian doesn't contain anywhere near the intellectual depth of Interstellar because it doesn't need to... it wants to stimulate a different muscle: The heart.",
      "author": "Jon Espino"
    },
    {
      "text": "Matt Damon may play the marooned astronaut who fights to make it home in this feel-good sci-fi epic, but the big news is that director Ridley Scott is back.",
      "author": "Rick Kisonak"
    },
    {
      "text": "One the smartest, sweetest, and most satisfyingly suspenseful sci-fi films in years.",
      "author": "Scott Weinberg"
    },
    {
      "text": "You'd think they could break at least one cliché, but no. This narrative is gooey smooth like an oyster without a grain of sand with which to make a pearl.",
      "author": "Cole Smithey"
    },
    {
      "text": "... light on wondering about our place in the universe and heavy on working out a way to get duct tape to seal an air leak.",
      "author": "Josh Larsen"
    },
    {
      "text": "The Martian is its own unique and wonderful beast, with a bizarre (in the best possible way) tone that is full of fun and wonder. It's a feel-good romp with lashings of science, a sci-fi flick with laughs, an ensemble comedy, a crowd-pleasing blockbuster.",
      "author": "CJ Johnson"
    },
    {
      "text": "One of Scott's best films in recent history, if not THE best. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "The Martian works for casual audiences because its about aplicated science and not scientific theory, making it easier to work with. [Full rewiew in Spanish]",
      "author": "Arturo Aguilar"
    },
    {
      "text": "Filled with real research and even a \"green\" message, The Martian will keep you on the edge of your seat, specially in the second half. [Full rewiew in Spanish]",
      "author": "Lucero Solórzano"
    },
    {
      "text": "An impecably produced but ultimately uninspired movie. [Full rewiew in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "A great movie! It's exciting, emotional, it has great storytelling and most of all, it's surprising! [Full review in Spanish]",
      "author": "Edgardo Reséndiz"
    },
    {
      "text": "Impecably shot and possibly one of Damon's best performances. The Marian is Ridley Scott's best film in the last 15 years. [Full review in Spanish]",
      "author": "Eduardo Molina"
    },
    {
      "text": "The Martian is sophisticated entertainment and a great mix between the absurd and the thrilling. [Full review in Spanish]",
      "author": "Jorge (JJ) Negrete"
    },
    {
      "text": "A crowd pleasing film from an already crowd pleasing director that feels without subtance. [Full review in Spanish]",
      "author": "Alejandro Alemán"
    },
    {
      "text": "At its core, it's a survival epic in which the hero is the scientific method: developing testable theories, gathering the data, refining the tests, sometimes going back to the drawing board.",
      "author": "Scott Renshaw"
    },
    {
      "text": "The science is compelling, just as it was the page...but it's clear that Scott and writer Drew Goddard felt that adding any pep to the proceedings, any feeling, would upset the tone.",
      "author": "Ed Whitfield"
    },
    {
      "text": "Ridley Scott turns his lens on another outer-space adventure.",
      "author": "Linda Cook"
    },
    {
      "text": "Bloated, dry as a soda cracker, and 100% safe for awards-season consumption.",
      "author": "Walter Chaw"
    },
    {
      "text": "The Martian [is] a thrilling, human and moving sci-fi picture that is easily the most emotionally engaging film Ridley Scott has made in a long time.",
      "author": "Jack Giroux"
    },
    {
      "text": "The film is a profound testament to the rare-and underrated-virtue of simply not screwing anything up.",
      "author": "Christopher Orr"
    },
    {
      "text": "Weir proves you do not have to bend the laws of science to tell a good science fiction story. This is the most gripping film of the year so far.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Its depiction of the durability/fragility of the human spirit/body during intense life/death situations is peppered with crisp, funny dialogue and colorful supporting characters.",
      "author": "John Serba"
    },
    {
      "text": "An entertaining space romp, beautiful looking and featuring a very appealing star turn from Damon.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "The Martian delivers on both intergalactic spectacle and feet-in-the-soil character drama.",
      "author": "Mark Kermode"
    },
    {
      "text": "The script is so technical it could be used as a survival manual for being lost in outer space.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Superior to both Christopher Nolan's Interstellar and (by a smaller margin) Alfonso Cuaron's Gravity, The Martian will disappoint only those who were waiting for Marvin to show up at some point to wreak looney havoc.",
      "author": "Matt Brunson"
    },
    {
      "text": "Epic, and yet surprisingly playful. It contrasts the vastness of space with the intimacy of a DIY podcast.",
      "author": "Richard von Busack"
    },
    {
      "text": "Mars may not be such a fun place to be stranded but getting stuck in a theater watching this movie about being stuck there is.",
      "author": "Gary Wolcott"
    },
    {
      "text": "For all its grim overtones, The Martian is surprisingly optimistic, a feature that cements its status as one of the best genre films in recent years.",
      "author": "Rob Vaux"
    },
    {
      "text": "Easily one of the most engrossing, enthralling and entertaining films of the year...In essence, The Martian is the antithesis of a superhero movie; instead of one man trying to save the world, it's about the world trying to save one man.",
      "author": "Jim Schembri"
    },
    {
      "text": "A science fiction gem that includes a tribute to the importance of little things like duct tape.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Riddley Scott has had great movies and some really awful ones. The Martian being in the second category. [Full review in Spanish]",
      "author": "Cuauhtémoc Ruelas"
    },
    {
      "text": "A movie that sets to get the love of the people and only does so because of the talent, rhythym and good filmaking that Scott and his team have. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "The Martian represent the newest entry on what's becoming the common trend in sci-fi: space exploration. [Full review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "The Martian hits a powerful sweet spot: blending tense action, captivating science, and beautiful 3D cinematography into an emotional character story.",
      "author": "Ben Kendrick"
    },
    {
      "text": "An adventure film for the intellect as well as the adrenaline glands, it is an emotional whirlwind as big as the storm that started Watney's problems, and with a final 20 minutes that might just make you forget to breathe.",
      "author": "Andrea Chase"
    },
    {
      "text": "A stunning piece of filmmaking by director Ridley Scott, who, with D.P. Dariusz Wolski, has created a fearsome yet alluring Mars landscape.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "The Martian highlights the book's best qualities, tones down its worst, and adds its own style, which is accentuated by some effective, yet non-intrusive, 3D work. A fast-paced, consistently enthralling adventure.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "[A] massively entertaining old-fashioned castaway adventure.",
      "author": "John Lui"
    },
    {
      "text": "The true spectacle of space exploration... lies in the collaboration between people: scientists, engineers, agencies, governments, nations, and the public...",
      "author": "Rubin Safaya"
    },
    {
      "text": "The story, Matt Damon being abandoned on Mars, strains credulity but is interesting if one can ignore some things that are pretty hard to believe. Still, the acting is good but it's the special effects, 3D, and IMAX that make this, well, special.",
      "author": "Tony Medley"
    },
    {
      "text": "In The Martian, Ridley Scott dwells into the psyche and sanity of man when survival is at its most urgent. [Full review in Spanish]",
      "author": "Anaid Ramírez"
    },
    {
      "text": "It's a long movie, but good pace and storytelling make it flow fast. [Full review in Spanish]",
      "author": "Oswaldo Betancourt Lozano"
    },
    {
      "text": "After Body of Lies, Prometheus and Exodus: Gods and Kings, it's good to see Ridley Scott get back some of his lost form in The Martian.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "We are so used to sci-fi movies in which the heroes shoot martians with ray guns that Scott's botanical approach can't help but seem offbeat and refreshing.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "The Martian plays to both Scott's strengths and weaknesses. By relegating Mark's predicament to a purely survivalist scenario, he keeps things humming along without ever widening the horizon. But there was an obligation to widen the horizon.",
      "author": "Peter Rainer"
    },
    {
      "text": "THE MARTIAN is a smart and moving story that will have kids - and probably everybody else - wanting to go to the farthest ends of the universe.",
      "author": "JimmyO"
    },
    {
      "text": "I like movies about solving problems, and Damon gives a skillful performance, and Scott's ability to put you in the middle of a howling Martian gale is impressive. But man, The Martian is corny.",
      "author": "Robert Horton"
    },
    {
      "text": "Goddard retains the science and makes it digestible in the way you wish your secondary school science teacher had.",
      "author": "Ben Skipper"
    },
    {
      "text": "How can you not like such a humour-infused drama of survival and hope?",
      "author": "Jyoti Sharma Bawa"
    },
    {
      "text": "While surviving on a planet where nothing grows, with no one to hear you scream or sing, is super serious business, it is nice that Watney's sense of humour survives the privations his mind and body are put through.",
      "author": "Mini Anthikad-Chhibber"
    },
    {
      "text": "Hell, Sean Bean's in this movie and *he doesn't die.* It doesn't get much more feel-good than that.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "There has never been and may never be a better advertisement for NASA or a better explanation of why it's so important for us to explore.",
      "author": "Matthew Razak"
    },
    {
      "text": "The Right Stuff for a new generation. Cinema legend Ridley Scott and Matt Damon deliver a film we will watch over and over again.",
      "author": "James Verniere"
    },
    {
      "text": "'The Martian' is one of the best movies of the year. It is a wondrous adventure that dreamers and doers, as well as those who set their sights on the heavens, can embrace and rally around.",
      "author": "Bob Bloom"
    },
    {
      "text": "Beyond being a great piece of entertainment, 'The Martian' is a glorious celebration of science.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "This no-nonsense science-fiction thriller is proof that book smart and entertaining are not mutually exclusive traits on the big screen.",
      "author": "Kirk Baird"
    },
    {
      "text": "It is intelligent and highly entertaining for a while, but if they cut a half an hour out of this film, it would have been great.",
      "author": "Neil Rosen"
    },
    {
      "text": "It's a brisk, funny piece of competence-porn sci-fi.",
      "author": "Alex Pappademas"
    },
    {
      "text": "To Damon's credit, it takes a special kind of actor to anchor this kind of movie, and his personality goes a long way to maintain The Martian's fun factor. But some of Damon's most effective moments come as Watney is combating discouragement.",
      "author": "Josh Terry"
    },
    {
      "text": "The visuals are stunning, yes, but it's the talented cast and source material of Andy Weir's similarly titled novel that turns The Martian into the delight that it is.",
      "author": "Allyson Johnson"
    },
    {
      "text": "An entertaining and engaging piece of sci-fi, and a thankfully smart one at that. (Full Content Review - Sex, Violence, Profanity, etc. - for Parents available)",
      "author": "Jim Judy"
    },
    {
      "text": "Excellent space thriller mixes peril, charm, real science.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "Cynical as I am about how monster-budget blockbusters have come to dominate the studio mind-set, I can't imagine anyone not liking this one.",
      "author": "David Edelstein"
    },
    {
      "text": "This is science fiction for sophisticated audiences and, as such, a fulfilling and satisfying experience.",
      "author": "James Berardinelli"
    },
    {
      "text": "\"The Martian\" is a remarkable achievement in this age of moviemaking - a big-budget science fiction film without aliens, robots, space battles or the fate of the universe at stake.",
      "author": "Greg Maki"
    },
    {
      "text": "It's simply stunning to watch, but what makes The Martian so memorable and such a captivating theatrical experience are the characters at the heart of the film.",
      "author": "Rebecca Murray"
    },
    {
      "text": "I'm going to be a sucker for any movie that includes a shoutout to '80s Infocom text adventures. But, \"Leather Goddesses of Phobos\" aside, \"The Martian\" is a terrific piece of entertainment.",
      "author": "Rob Thomas"
    },
    {
      "text": "Super-smart, sharp-witted, funny, dramatic and moving, a gripping, gorgeous, geeky, high-tech, big-screen adventure-survival yarn that will leave you cheering.",
      "author": "Neil Pond"
    },
    {
      "text": "'The Martian' is a rousing, surprisingly funny, and touching space adventure. Ridley Scott has delivered his best film since 'Gladiator'.",
      "author": "Julian Roman"
    },
    {
      "text": "Ridley Scott's enjoyable space drama feels like a throwback to the days when American know-how and determination promised a brighter future ahead.",
      "author": "Rebecca Cusey"
    },
    {
      "text": "Perhaps the purest ode to science mainstream cinema has ever produced, a love letter to NASA and STEM education.",
      "author": "Peter Canavese"
    },
    {
      "text": "It's the hard science combined with a human story of one-man's rescue that makes \"The Martian\" fascinating and irresistible entertainment.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "A celebration of smart.",
      "author": "Willie Waffle"
    },
    {
      "text": "Hell, I'm scared of simply sleeping outdoors and I walked out of the movie with just the tiniest daydream of strapping myself into a rocket and shooting for the stars (ideally with Matt Damon as my co-pilot).",
      "author": "Barry Hertz"
    },
    {
      "text": "Turns out getting stranded on Mars can lead to a whole lot of fun.",
      "author": "Adam Graham"
    },
    {
      "text": "An uptempo hymn to human ingenuity, with notes of wit and grit nicely embodied by Damon in his low-key performance.",
      "author": "Gary Thompson"
    },
    {
      "text": "A witty, gritty survival flick that happily sacrifices good science for great entertainment.",
      "author": "Andy Lea"
    },
    {
      "text": "A space-faring winner that makes exploring -- and surviving -- the great beyond seem like the greatest adventure known to man.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Director Scott is surprisingly unsuccessful in creating an original vision of Mars-his rendition of the planet's rocky landscape might have been lifted whole from an old John Ford western.",
      "author": "Kurt Loder"
    },
    {
      "text": "\"The Martian\" is one of the straight-up geekiest movies you're ever likely to see, but also one of the most thrilling.",
      "author": "Travis Hopson"
    },
    {
      "text": "Scott makes us feel both the excitement and potential danger that space crews must face, or will face, once we get serious about leaving Earth again.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "This is an exciting, absorbing story, an adventure with a genuine hero whose courage, fortitude, and intelligence will spark the hero inside anyone who see it.",
      "author": "Nell Minow"
    },
    {
      "text": "A movie as clever as its main protagonist. [Full review in Spanish]",
      "author": "Mabel Salinas"
    },
    {
      "text": "You could almost say that The Martian is at it's best a selfhelp movie, a \"must\" if you're the depressive type. [Full review in Spanish]",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "Smart and precise, Matt Damon's and Ridley Scott's new film is both beautiful and emotional. [Full review in Spanish]",
      "author": "Carlos Del Río"
    },
    {
      "text": "This might be the most calm space opera ever, buoyed by the \"Aw, shucks,\" good-natured Damon and the most eclectic cast in a recent studio film.",
      "author": "Kent Turner"
    },
    {
      "text": "While The Martian is not an edge-of-the-seat thriller like Gravity, it is gripping nonetheless and strikes an enjoyable balance between entertainment and science.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "In a sense everything is a little too entertaining to ring true.",
      "author": "Stella Papamichael"
    },
    {
      "text": "It's terrific entertainment.",
      "author": "Brian Viner"
    },
    {
      "text": "An unequivocal joy and the director's most purely enjoyable movie in over a decade.",
      "author": "Matthew Turner"
    },
    {
      "text": "A muscular storytelling masterclass, a giddy audience-pleasing thrill-ride and certainly the most purely entertaining sci-fi movie since 2013's awards-magnet Gravity.",
      "author": "Kevin Maher"
    },
    {
      "text": "A tremendously exciting popcorn spectacle, and also a portrait of extraplanetary survival convincing enough that it had my tech-obsessed 11-year-old companion on his feet cheering on several occasions.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "\"The Martian\" is imaginative, clever, entertaining and frequently very funny.",
      "author": "Anders Wright"
    },
    {
      "text": "This is Scott's most enjoyable movie in light years ..",
      "author": "Tim Evans"
    },
    {
      "text": "Anchored by another great turn from Matt Damon, The Martian mixes smarts, laughs, weird character bits and tension on a huge canvas. The result is Scott's most purely enjoyable film for ages.",
      "author": "Ian Freer"
    },
    {
      "text": "What's so stirring about the film is that, before and after everything else, it truly is about being human.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The Martian is stirring and powerful, boasting a commanding performance from Damon.",
      "author": "Steven Rea"
    },
    {
      "text": "Ridley Scott's nuts-and-bolts answer to the existential drama of Alfonso Cuaron's Gravity works best when it keeps its camera on Damon...as he takes care of business and deals with various disasters.",
      "author": "Matthew Lickona"
    },
    {
      "text": "Like Alfonso Cuaron's wonderful close-space thriller Gravity, Scott's The Martian is all the more interesting because it is linked with possibilities and even probabilities.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "It doesn't quite reach the emotional highs of Apollo 13, or the special effects wow factor that was Gravity. But it comes very, very close.",
      "author": "Chris Knight"
    },
    {
      "text": "It's a film that respects the concept of intelligence; I just wish it respected my intelligence.",
      "author": "Daniel Barnes"
    },
    {
      "text": "The Martian earns its uplift honestly, and while it doesn't rank with Scott's greatest films, it is on a par with his Gladiator as a solid, well-made piece of Hollywood entertainment.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "3-D conveys the frightening depth of space, but the suspense machinery crowds out all but the most banal philosophizing.",
      "author": "J. R. Jones"
    },
    {
      "text": "Even adjusting for flattery, it's an easy film to love - one so suspenseful and funny and just richly, consistently good you might get mad at it falling a few astronomical units short of great.",
      "author": "Chris Klimek"
    },
    {
      "text": "Matt Damon lands on solid ground in 'The Martian,' ... nothing less than superior entertainment...",
      "author": "Leonard Maltin"
    },
    {
      "text": "The Martian is for folks who like their science-fiction stories to possess as much science as fiction.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Damon is terrific. The movie lives and breathes on his performance, and he comes through in every scene.",
      "author": "Richard Roeper"
    },
    {
      "text": "For a faraway no-man's land, this is one inviting world.",
      "author": "Jonathan Kiefer"
    },
    {
      "text": "A disaster movie more about solutions than problems, The Martian is Matt Damon's most successful extraterrestrial foray to date.",
      "author": "Alex Doenau"
    },
    {
      "text": "Based on the wildly popular 2011 book by American author Andy Weir, the movie's conceptual co-ordinates triangulate somewhere close to Gravity meets Cast Away via Apollo 13.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "It's one of the year's best movies and widescreen 3D experiences, a crackerjack adventure that celebrates human ingenuity over mechanical contrivance.",
      "author": "Peter Howell"
    },
    {
      "text": "Is it Damon's best performance? Just about, and Scott's film needed a star of that magnitude to play Mark, so you'll be glad that it's Matt's face on Mars.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "The Martian's biggest accomplishment may be that it takes near-future space exploration, and makes it look achievable with the right amount of work and creative thinking.",
      "author": "Bryan Bishop"
    },
    {
      "text": "The movie's a valentine to creative collaboration as well as an example of it. It's enough to make you almost grateful.",
      "author": "Ty Burr"
    },
    {
      "text": "Upbeat and dramatically subdued,...it's characteristically handsome but uncharacteristically warm-hearted for a Scott film.",
      "author": "Frank Swietek"
    },
    {
      "text": "Don't let seeing the movie stop you from reading the book.",
      "author": "Gail Pennington"
    },
    {
      "text": "Damon is terrific. But this is by no means a one-man show.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "For putting the science back into science fiction, the movie deserves to be seen. As a great popcorn experience, it will be.",
      "author": "Ron Yamauchi"
    },
    {
      "text": "The Martian is a breathtakingly bravura piece of film-making.",
      "author": "Paul Mount"
    },
    {
      "text": "Combined with the kind of breathtaking cinematography that gave the director his name, and a sense of diluted optimism running through it, and you have a film that sails through its lengthy run time.",
      "author": "Steve Wright"
    },
    {
      "text": "Saliently researched, telling a wild but not inconceivable tale absorbing for its artistic prowess and attention to detail.",
      "author": "Dustin Putman"
    },
    {
      "text": "Ridley Scott rediscovers his light touch in a space epic that's fun to geek out at. Damon - a fine actor with the magnetism you only find in a true movie star - keeps you glued.",
      "author": "Peter Travers"
    },
    {
      "text": "Despite all that computer wizardry at work, the green-screen seams show and the herky-jerky pace mitigates against the kind of creeping tension that should inform this film.",
      "author": "Marshall Fine"
    },
    {
      "text": "Damon totally sells what is arguably his most likable role in years with a balance of charming personality and compelling need to cheer hard for this guy.",
      "author": "Brian Truitt"
    },
    {
      "text": "What makes this epic personal is Mr. Scott's filmmaking, in which every soaring aerial shot of the red planet is answered by the intimate landscape of a face.",
      "author": "Manohla Dargis"
    },
    {
      "text": "Make no mistake, at 141 minutes, The Martian is a bit of a hike. But it's a tribute to Scott's command, Damon's charisma and Goddard's script that this two-hour-plus movie about a guy by himself on Mars works as well as it does.",
      "author": "Joe Gross"
    },
    {
      "text": "The Martian is fueled by charm, curiosity and the scientific method. It plays like a modernized Kennedy-age fantasy of discovery, space and can-do initiative.",
      "author": "Chris Vognar"
    },
    {
      "text": "The problem-solving valorized in \"The Martian\" provides a simultaneously stirring and spirited example of how cool science can be. As NASA-Hollywood plots go, this one is worth lapping up like all the water on Mars.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Those who prefer their science fiction more dour, and dire, may resist the film's fuzzy humanist impulse. I found it refreshing and sincere.",
      "author": "Michael Phillips"
    },
    {
      "text": "Ridley Scott's stunning outer space survival thriller blasts off into the black yonder, hitting us with a kajillion Gs of dramatic pressure and it never lets up until the closing credits.",
      "author": "Dann Gire"
    },
    {
      "text": "All the while, he is keeping a video diary in which he is sassy (\"In your face, Neil Armstrong!\") as he outlines every step of his plan to make contact with Planet Earth. It's almost as if he knows he's a character in a movie.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "At its heart, The Martian is an unapologetically stirring celebration of our ability, as a species, to solve even the most daunting problems via rational thought, step by step by step.",
      "author": "Mike D'Angelo"
    },
    {
      "text": "This marks a solid return to form for Scott, whose last few films ( Exodus: Gods and Kings, The Counselor and Prometheus) have veered from the leaden to the unwatchable. Scott may have found himself by getting lost in space.",
      "author": "Cary Darling"
    },
    {
      "text": "This film rouses cheers because its hopefulness is earned. The Martian doesn't contain a single up-with-people bromide, and it never sacrifices tension for jokes or sentimental gestures.",
      "author": "Michael Sragow"
    },
    {
      "text": "[A] rich, compelling, extremely realistic sci-fi story... one of the smartest, coolest sci-fi movies in a long time... and perhaps the most realistic sci-fi film ever made.",
      "author": "Mark Hughes"
    },
    {
      "text": "\"The Martian\" may be stitched together with recognizable bits, but they fit together into an entertainment that's better than any of the sources it's plundered.",
      "author": "Laura Clifford"
    },
    {
      "text": "The animating humanism of Scott's film is irreducible. It's a wry tribute to the qualities that got our species into space in the first place: our resourcefulness, our curiosity and our outsized, ridiculous, beautiful brains.",
      "author": "Dana Stevens"
    },
    {
      "text": "A castaway drama with all the psychological depth of Gilligan's Island.",
      "author": "Donald Clarke"
    },
    {
      "text": "Damon is as likable an American actor as we have and ideally cast to convey the pleasing self-confidence and intrepid sense of humor that characterized Watney in the book.",
      "author": "Kenneth Turan"
    },
    {
      "text": "You'll root for Damon as a resourceful science whiz, but the movie's total absence of plot results in a narrative vacuum.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Ridley Scott's futuristic lost astronaut epic is a string of logic puzzles shot through a lighthearted ensemble dramedy that feels part 'Avengers' and part 'Gravity.'",
      "author": "Chris Barsanti"
    },
    {
      "text": "Genial, likable and borderline flippant ...",
      "author": "Peter Bradshaw"
    },
    {
      "text": "The Martian does look like it was shot on Mars, even though the film's tone is suspiciously light and cheerful for Scott, who tends to thrive on a chillier, more dour habitat. But who can bemoan this great filmmaker a crowd-pleaser?",
      "author": "Rene Rodriguez"
    },
    {
      "text": "The comedy gives The Martian personality that fades among constant shots of NASA people applauding.",
      "author": "Matt Pais"
    },
    {
      "text": "For anyone who loves science - which should be everyone except for anti-vaxxers and climate change denialists - this is fascinating and enjoyable.",
      "author": "Matt Neal"
    },
    {
      "text": "Although the outline offers no surprises, the details and the tone feel new.",
      "author": "Matt Zoller Seitz"
    },
    {
      "text": "Makes furious calculations and engineering simulations into gripping, can't-look-away drama.",
      "author": "Josh Bell"
    },
    {
      "text": "It should hold you attention all the way through but The Martian contains too much science and not enough tension.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Hollywood has sent a clear message to nitpickers with The Martian: either suspend your disbelief when Sandra Bullock's hair doesn't move as it should in Gravity, or watch Matt Damon count his poop.",
      "author": "Simon Miraudo"
    },
    {
      "text": "Scott truly serves the story, which greatly enhances its potential for credible emotion and breezy chemistry, while suspense in the final act is some of the best nail-biting stuff the helmer has come up with since \"Alien.\"",
      "author": "Brian Orndorf"
    },
    {
      "text": "By the finish, the science discussions have become impenetrable, the musical sequences are coming fast and furious, and every bit of action that should take five minutes takes 15.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The Martian is a science fiction popcorn movie that is destined to be a genuine crowd pleaser.",
      "author": "Rex Reed"
    },
    {
      "text": "On the seemingly endless screen, the Red Planet looks foreboding yet inviting. That's part of Scott's appeal to the audience: get lost in the story and the spectacle.",
      "author": "Monica Castillo"
    },
    {
      "text": "Scott has directed a phenomenal film --- one that will be a real crowd-pleaser. It's impossible for it not to be --- the adventure is intense, frightening and coming so close to being a reality.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "It's a film that makes \"Gravity\" look like a junior high science fair project.",
      "author": "David Kaplan"
    },
    {
      "text": "As always, Scott's direction is spot-on, especially in terms of pure visual spectacle... Alas, Scott's hand is almost always too cold when it comes to working with a human touch.",
      "author": "AP Kryza"
    },
    {
      "text": "The Martian, true to itself, simply gets the job done.",
      "author": "Craig Mathieson"
    },
    {
      "text": "Like many of Scott's latter-day films, The Martian is engaging to a degree but seems flimsier the more you think about it.",
      "author": "Jake Wilson"
    },
    {
      "text": "Though it's not perfect, The Martian's illustration of a world united by space travel is almost Utopian.",
      "author": "Clem Bastow"
    },
    {
      "text": "Good actors fill almost every role, from Jessica Chastain as the captain of Watney's ill-fated mission to Chiwetel Ejiofor as a NASA official with a troubled conscience.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "Gravity is the obvious comparison, but The Martian is more predicament problem-solving than thrill-ride...",
      "author": "Steve Newall"
    },
    {
      "text": "\"I'd love to tell you what the bet part of The Martian is, but it's all the best part.\"",
      "author": "Fred Topel"
    },
    {
      "text": "Watney could be the perfect character for Damon, who easily slides into the persona of a man who's relentless, optimistic, intelligent, sarcastic, self-effacing, and inspirational.",
      "author": "Tony Hicks"
    },
    {
      "text": "Rather than just presenting the audience with a special-effects show, the filmmakers have made a dedicated effort to explore the dilemmas that might result from an astronaut actually being stranded on Mars.",
      "author": "Dana Barbuto"
    },
    {
      "text": "As elaborate and expensive-looking as The Martian is, it's almost totally lacking in poetry.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Scott has again seen the future and this time it is us. Not killer androids or creature hives but humanity, its innovations and drive to succeed in unison, pulling together for common goals. You know. Science fiction.",
      "author": "Steve Persall"
    },
    {
      "text": "It's a science-fiction movie without chase scenes or shootouts, but it's as thrilling as any I've seen in years. It takes pride in the details. It shows its work.",
      "author": "Will Leitch"
    },
    {
      "text": "With Damon's charm center stage, Scott has crafted an exciting, hopeful story about humanity at its best: The brightest minds working together for a common goal that bridges international borders and forges a feeling of unity.",
      "author": "Sandy Cohen"
    },
    {
      "text": "If one thing's certain about director Ridley Scott's lightest, fleetest, least labored movie in years, it's that it's funny, hopeful, can-do, and aims strictly to entertain.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Not only does the film stress the importance of using math and physics to solve problems, but it also makes a plot based on scientific inquiry as exciting and unpredictable as the kind that involves punching everyone and then blowing everything up.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Although not inspirational in the traditional sense, \"The Martian\" advocates a message that's nonetheless stirring: We can do great things if only we put our minds to it.",
      "author": "Tim Grierson"
    },
    {
      "text": "What makes \"The Martian\" work is Damon.",
      "author": "Jeff Baker"
    },
    {
      "text": "It should be shown in schools. It should lead to an increase in education funding. It should encourage you to stock up on duct tape.",
      "author": "Rob Hunter"
    },
    {
      "text": "This first-rate popcorn film is one of the best of the year.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Scott's sci-fi adventure is the kind of film you leave the theater itching to tell your friends to see.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "If you enjoyed Andy Weir's exceedingly detailed novel, you'll certainly appreciate seeing it brought to the screen in all its geek glory. It's like science porn.",
      "author": "Joe Lozito"
    },
    {
      "text": "Good dramatic writing in film and television exists in different contexts. It is often less about convincing people that a story is being scientific than making them not think about science in the first place.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "This is a crowd pleaser on a grand scale and I certainly admire the craftsmanship and the cinematic values, although I could have wished for clearer exposition at times",
      "author": "Andrew L. Urban"
    },
    {
      "text": "Humour is the unexpected bonus of this thrilling space rescue adventure that offers a bit of everything, as it keeps us on edge throughout",
      "author": "Louise Keller"
    },
    {
      "text": "The Martian is [Ridley Scott's] most entertaining effort in years, and perhaps his most big-hearted film ever.",
      "author": "Helen O'Hara"
    },
    {
      "text": "A celebration of ingenuity, of intelligent problem-solving in the face of life-altering deadlines, and of the stubborn, never-quit attitudes that should be spotlighted in the human spirit.",
      "author": "Sean O'Connell"
    },
    {
      "text": "The Martian is Ridley Scott's best film in nearly 15 years.",
      "author": "Ali Plumb"
    },
    {
      "text": "Did Ridley Scott just make a feel-good rabble-rouser with an ABBA montage?",
      "author": "Matt Prigge"
    },
    {
      "text": "The Martian thrives simply for its humor, its heart, and its magnificence, accomplishing what Christopher Nolan yearned to do with Interstellar less than a year ago: turn our eyes to the stars and our imagination beyond.",
      "author": "Michael Roffman"
    },
    {
      "text": "The Martian isn't a great film but at the very least it shows that there is still some life left inside of Ridley Scott's directorial efforts.",
      "author": "Damien Straker"
    },
    {
      "text": "Ridley Scott's not made his third sci-fi masterpiece, but boy, has he come close.",
      "author": "Alex Leadbeater"
    },
    {
      "text": "An exhilarating, enthralling sci-fi adventure...",
      "author": "Susan Granger"
    },
    {
      "text": "Uma ficção científica que busca frisar bastante o \"científica\" a fim de tornar o componente \"ficção\" agradavelmente verossímil.",
      "author": "Pablo Villaça"
    },
    {
      "text": "A mass appeal movie that proclaims it's going to 'science the shit out of this'? Go figure: this genuinely thrilling sci-fi thriller about smart people is also sensational entertainment.",
      "author": "Joanna Langfield"
    },
    {
      "text": "None of the stylistic elements serves to make for especially compelling viewing; it's overlong and occasionally irritating when it should be moving.",
      "author": "Mark Demetrius"
    },
    {
      "text": "That he keeps finding ways to innovate (and get lucky, at times) is like a tribute to the American dream, but that it requires so much nerve-wracking tension at every moment is arguably an indictment of same.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "The film goes in for the idea of texture and tics and human behavior, but there's no conviction, and no real push for eccentricity.",
      "author": "Jaime N. Christley"
    },
    {
      "text": "Its lighthearted attitude allows The Martian to excel not just as an entertainment, but as a profound statement on the power of good humor.",
      "author": "Witney Seibold"
    },
    {
      "text": "I tend to cry at inspirational or hopeful or triumphant moments in movies. I must have cried a hundred times during The Martian.",
      "author": "Devin Faraci"
    },
    {
      "text": "At once a rollicking good time (its two hours and 21 minutes fly by) and extremely emotionally affecting.",
      "author": "Rebecca Pahle"
    },
    {
      "text": "Of all the stanning Hollywood has been doing for NASA in the last few years, from Gravity to Interstellar to Tomorrowland, The Martian is, by many kilometers, the nerdiest. And that's also the reason it's the best.",
      "author": "Alison Willmore"
    },
    {
      "text": "Smart, slick and, yes, funny, The Martian provides a compelling story well-told, with Scott's tendency to excess kept in line by a simple, strong plotline: Survive.",
      "author": "James Rocchi"
    },
    {
      "text": "Watney's fear for his own life takes a backseat to his stand-up, an attitude that is this consistently entertaining movie's biggest asset and also its flaw.",
      "author": "Radheyan Simonpillai"
    },
    {
      "text": "The Martian is a thoroughly entertaining survival story that is notable for its low-key approach to a very familiar narrative. I",
      "author": "Josh Cabrita"
    },
    {
      "text": "Blends science-fiction with the attitude of a college grad with four popped collars",
      "author": "Cameron Williams"
    },
    {
      "text": "Cuts all of the least challenging parts of Gravity and Interstellar into one long NASA sizzle reel. It's cinematic bubblegum pop that only occasionally edges into schmaltz.",
      "author": "Vincent Mancini"
    },
    {
      "text": "At no point did I expect The Martian to be \"fun,\" but it's surprisingly (and sort of weirdly) just that.",
      "author": "Mike Ryan"
    },
    {
      "text": "Much like its protagonist, The Martian is a film that's captivating, inventive, resourceful and widely appealing.",
      "author": "Garth Franklin"
    },
    {
      "text": "A gripping Robinson Crusoe-style survival story.",
      "author": "Kate Muir"
    },
    {
      "text": "The latest space mission saga from veteran director Ridley Scott may not be a genre landmark like Alien, but what it lacks in subtlety it certainly makes up for in spectacle and heart-in-the-throat tension.",
      "author": "Allan Hunter"
    },
    {
      "text": "The Martian is less a coup de cinema than Gravity, which jettisons through open space with swooping 720-degree camera moves, but it's a triumph of another kind, an ode to problem-solving and sticktuitiveness.",
      "author": "Scott Tobias"
    },
    {
      "text": "A pure delight, a tense survival tale leavened by an abundance of geeky wit and an array of fine actors at their snappy best.",
      "author": "Richard Lawson"
    },
    {
      "text": "Ridley Scott's latest may be the most fantastical film he's ever made.",
      "author": "Tina Hassannia"
    },
    {
      "text": "A triumph of the human spirit and of grandiose filmmaking. One of Ridley Scott's best films in years.",
      "author": "Jon Lyus"
    },
    {
      "text": "The Martian is fun - Saving Private Ryan in space, so much better than saving the world again.",
      "author": "David Sexton"
    },
    {
      "text": "It's a film about micromanaging, fixing things on the fly, and a lot of Ridley's gruff, technocrat personality shines through.",
      "author": "Tim Robey"
    },
    {
      "text": "That's what we want from a great blockbuster-something both larger than us but not so distant that we can't connect. The Martian is a great blockbuster.",
      "author": "Brian Tallerico"
    },
    {
      "text": "Watney reroutes the thingamajiggers into the whosamawhatsits in order to hussafuh the shabadoo, except you replace those with real words, and let Ridley Scott loose to direct his best film in years.",
      "author": "William Bibbiani"
    },
    {
      "text": "The Martian is a savvy blend of the technical and the personal, of outer and inner journeys, and of teamwork and isolated glory.",
      "author": "Jamie Graham"
    },
    {
      "text": "The Martian is like Gravity without the floating, Apollo 13 without the documentary intrigue and 127 Hours without the mental breakdown. It's not nearly as exciting as you wished it was.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "A joyous and triumphant tribute to science and the space program that's consistently entertaining.",
      "author": "Edward Douglas"
    },
    {
      "text": "Probably the most fun you will ever have watching a bunch of nerds solve math problems.",
      "author": "Matt Singer"
    },
    {
      "text": "A visually stunning, refreshing optimistic family sci-if adventure.",
      "author": "Chris Bumbray"
    },
    {
      "text": "The best thing that either Matt Damon and director Ridley Scott have done in years.",
      "author": "Lou Lumenick"
    },
    {
      "text": "The picture nearly runs out of fuel near the end, but the climax is expectantly exciting and visually stunning.",
      "author": "Glenn Sumi"
    },
    {
      "text": "Damon provides comfortable company during the long stretches when he's onscreen alone, and the actor's physicality makes Mark's capability entirely credible.",
      "author": "Todd McCarthy"
    },
    {
      "text": "\"The Martian\" should do far more than just make Fox a ton of money; it could conceivably rekindle interest in the space program and inspire a new generation of future astronauts.",
      "author": "Peter Debruge"
    },
    {
      "text": "The storytelling techniques work well enough to keep the film engaging - though having characters read out messages as they type them gets annoying pretty quickly - and Scott keeps the pacing breezy and relatively light.",
      "author": "John Hazelton"
    },
    {
      "text": "Out from the blackness comes something we thought we might never see again: a decent Ridley Scott movie.",
      "author": "Henry Barnes"
    },
    {
      "text": "If the kids see this one at the right time, in the right mood, they may even sign up for senior-year physics.",
      "author": "Matt Patches"
    },
    {
      "text": "A brainy studio effort that sticks to familiar ground in more ways than one.",
      "author": "Eric Kohn"
    },
    {
      "text": "The Martian, the best mainstream entertainment Ridley Scott has directed in over a decade, is thrilling and engaging from first launch.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "The Martian might just be an empty spacesuit underneath the science and spectacle, but it's a very entertaining one.",
      "author": "Sam Woolf"
    },
    {
      "text": "The streamlined narrative and the film's consistent pacing, aided by a cast who don't make a wrong-footed move, makes for easy popcorn entertainment.",
      "author": "Kevin Jagernauth"
    },
    {
      "text": "It's a film that would pass the time on a rainy Sunday afternoon.",
      "author": "David Jenkins"
    }
  ],
  "release_year": 2015,
  "duration": 142,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "When astronauts blast off from the planet Mars, they leave behind Mark Watney (Matt Damon), presumed dead after a fierce storm. With only a meager amount of supplies, the stranded visitor must utilize his wits and spirit to find a way to survive on the hostile planet. Meanwhile, back on Earth, members of NASA and a team of international scientists work tirelessly to bring him home, while his crew mates hatch their own plan for a daring rescue mission.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/3ndAx3weG6KDkJIRMCi5vXX6Dyb.jpg"
}