{
  "movie_name": "The Duff",
  "movie_id": "the_duff",
  "total_reviews": 118,
  "reviews": [
    {
      "text": "A school comedy so predictable the screenwriters should be sent to the principal's office but with a central performance worth skipping last period for.",
      "author": "Richard Crouse"
    },
    {
      "text": "It was good acting and good writing.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Oh dear, am I the Duff?",
      "author": "Avaryl Halley"
    },
    {
      "text": "While director Ari Sandel's adaptation is devoid of any surprises and spells out every thought and action, it does finally deliver a worthy message.",
      "author": "Udita Jhunjhunwala"
    },
    {
      "text": "Not clever enough to be genre-defining in its own right, The DUFF nevertheless follows successfully in the footsteps of its teen romcom predecessors, delivering both laughs and a genuinely touching romance.",
      "author": "Olivia Luder"
    },
    {
      "text": "It's not a terrible movie, just kind of forgettable and average.",
      "author": "Rachel Wagner"
    },
    {
      "text": "This is Whitman's show, and she's so strong she makes a good film out of what should have been a middling one.",
      "author": "Bernard Boo"
    },
    {
      "text": "There's a part of me that thinks I should dislike this film on principle alone, but I'd be lying if I said I did dislike the finished project.",
      "author": "Amanda Greever"
    },
    {
      "text": "A fairly predictable entry into the teen genre that is elevated thanks to an incredibly charming lead performance from Mae Whitman.",
      "author": "Micheal Compton"
    },
    {
      "text": "THE DUFF has a visual style that places you in the lexicon of the teen psyche, with self-referential hashtags and slang.",
      "author": "James Clay"
    },
    {
      "text": "Both the cruelty of the students and the happiness of the ending felt beyond the realm of possibility to me. If you're going to make a satire, you have to go all the way.",
      "author": "Asia Frey"
    },
    {
      "text": "What keeps this movie from simply being a tired rip-off is the incredible performance of Mae Whitman.",
      "author": "Brooke Corso"
    },
    {
      "text": "Always fun to see how high school gets techno-updated. The phone-and-social-media insanity portrayed here makes the beepers of 1995's 'Clueless' look like trilobite fossils.",
      "author": "Mark Jackson"
    },
    {
      "text": "The DUFF brings something different to the genre.",
      "author": "Latoya Newman"
    },
    {
      "text": "An earnest high-school comedy that mostly feels like the dried-out, overheated leftovers of John Hughes.",
      "author": "Nathan Bartlebaugh"
    },
    {
      "text": "As she proved in Arrested Development, Whitman is great -- although without her tremendous comic skill The DUFF would be, well, duff.",
      "author": "Alex Zane"
    },
    {
      "text": "[Mae Whitman] helps elevate a predictable story into one many won't mind watching.",
      "author": "David Blaustein"
    },
    {
      "text": "It occasionally plays like a mashup of Mean Girls and Easy A, but Whitman's performance gives The DUFF a spiky energy all its own.",
      "author": "Norman Wilner"
    },
    {
      "text": "There are times during The DUFF where you sense some potential. But by the time the third act delivers its predictable finale, seasoned audiences are left to reminisce about the movies that did it all better.",
      "author": "Josh Terry"
    },
    {
      "text": "...it is, in the end, impossible to view The DUFF with anything less than almost total disdain (especially given the above-average nature of its source material).",
      "author": "David Nusair"
    },
    {
      "text": "\"The DUFF\" is what you might call a catch-all teen comedy.",
      "author": "Paul Chambers"
    },
    {
      "text": "Despite the very predictable way the movie moves along, the message here is simple, well-known and comfortingly reassuring -- that if someone loves you, they will do so because of who you really are on the inside.",
      "author": "Reagan Gavin Rasquinha"
    },
    {
      "text": "As in any romantic comedy, star chemistry is essential, and this movie's got it: Whitman and Amell have an easy rapport that probably makes Cagan's dialogue sound snappier than it is.",
      "author": "Jim Lane"
    },
    {
      "text": "Mainly just a film to showcase how utterly talented Mae Whitman is.",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "You don't need to be Einstein to see where this is going, but it's an enjoyable and occasionally very funny trip, with some smart observations about the yoof's addiction to technology.",
      "author": "Stephen Romei"
    },
    {
      "text": "The DUFF may have some snappy, modern dialogue that young people will get a kick out of, but it's the film's incredibly charming leads who make it entertaining.",
      "author": "Gabrielle Bondi"
    },
    {
      "text": "Even if The DUFF doesn't raise the bar for recent teen romps, it allows Whitman and Amell to show off their considerable charms.",
      "author": "William Goss"
    },
    {
      "text": "The teen-movie standard about the struggles of the high school outsider is given a good, surprisingly thoughtful going over in an above-average offering that challenges stereotypes and the alleged importance of fitting in.",
      "author": "Jim Schembri"
    },
    {
      "text": "Mildly amusing but always well acted.",
      "author": "Alex Doenau"
    },
    {
      "text": "Mae Whitman - please star in all movies.",
      "author": "David Jenkins"
    },
    {
      "text": "Astute and genuinely funny teen comedies don't come along very often; this one starts with a smart script and lets the spirited cast run with it...",
      "author": "Rich Cline"
    },
    {
      "text": "The smartest, sweetest, wittiest high-school movie in years.",
      "author": "Jason Best"
    },
    {
      "text": "Based on the 2010 YA novel by Kody Keplinger, The DUFF is a moderately astute, consistently entertaining teen comedy about the evils of social-media shaming and the healing power of just being yourself.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The DUFF is a heartfelt film that adheres somewhat to formula, but that's distinguished by its knowingness, Josh A Cagan's smart script and by a riotous central performance from Whitman.",
      "author": "Katherine McLaughlin"
    },
    {
      "text": "This high-school comedy avoids the worst clichés of the genre and resists rather than indulges the worst tendencies of adolescence. Which is a rare thing.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "The once-ubiquitous American high school comedy has been supplanted by dystopian Young Adult franchises in recent years, but it makes a minor and surprisingly welcome comeback with The Duff.",
      "author": "Alistair Harkness"
    },
    {
      "text": "The DUFF is the first laugh-out-loud high school comedy since Easy A while also being genuinely the kind of story young girls need to be told more often.",
      "author": "Emma Dibdin"
    },
    {
      "text": "I think the selfie generation has just got it's own The Breakfast Club.",
      "author": "Andy Lea"
    },
    {
      "text": "Yes, it uses a well-worn textbook but thanks to some quality casting and a likeable screenplay from writer Josh Cagan, there are still plenty of laughs.",
      "author": "Matthew Toomey"
    },
    {
      "text": "Mean Girls it ain't, but then again, what is?",
      "author": "Mark Kermode"
    },
    {
      "text": "A formulaic comedy where the actors appear to be a good 10 years older than the characters they are playing.",
      "author": "Allan Hunter"
    },
    {
      "text": "While this latest entry into the Pygmalion with Clearasil genre doesn't bring anything new to the table, it's still fun enough to hang out with for a while.",
      "author": "Adam Smith"
    },
    {
      "text": "This is a likeable and smartly written teen movie that still seems very fresh in spite of rehashing characters and situations familiar from countless other high-school comedies.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "The Duff is your typical high-school misfit comedy, elevated by a kooky, cranky and deeply sympathetic performance by Mae Whitman.",
      "author": "Kate Muir"
    },
    {
      "text": "[The DUFF] looks at first as if it's set in a post-clique world, where it's ok to be niche. But no, the film tells us, for jock, goth and geek alike, there's another hurdle: you need to be hot.",
      "author": "Philippa Hawker"
    },
    {
      "text": "The Duff is a standard-issue high-school film, but it has some funny material.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "This tongue-in-cheek endeavour is playful in its approach, never earnest enough to a point where it's unbearable.",
      "author": "Stefan Pape"
    },
    {
      "text": "A predictable prom-com, but the journey is fun.",
      "author": "Simon Weaving"
    },
    {
      "text": "While definitely not a movie that everyone will enjoy, fans of the genre can be sure to leave more than satisfied after the credits roll.",
      "author": "Matthew Bernard"
    },
    {
      "text": "Mae Whitman... [is] absolutely terrific, giving a wry, knowing attitude to her character and the film, and turning The DUFF from a modestly amusing comedy to a genuine success.",
      "author": "Tim Brayton"
    },
    {
      "text": "This is a well-intentioned and sometimes quite sharp high school movie that falls just short of the mark due to a few way-off-the-mark scenes and too much heavy-handed preaching.",
      "author": "Richard Roeper"
    },
    {
      "text": "Subversively snarky, yet sensitive, it updates George Bernard Shaw's \"Pygmalion\" with 21st century technology.",
      "author": "Susan Granger"
    },
    {
      "text": "distinguished by sprightly, intelligent writing, and outstanding performances that are not just funny, but also perceptive and nuanced.",
      "author": "Andrea Chase"
    },
    {
      "text": "Perhaps no one over age 16 should ever see this movie. That may not be the worst advice I could give you.",
      "author": "Ken Hanke"
    },
    {
      "text": "Although it has its John Hughes-esque moments, 'The DUFF' is derivative of lots of other, and more recent, teen angst movies.",
      "author": "Linda Cook"
    },
    {
      "text": "The DUFF has a lot to say about beauty ideals and how we perceive our self-worth.",
      "author": "Andy Herren"
    },
    {
      "text": "Will...[strike a chord] with teen girls, if they can get past the casting of the healthy, but hardly plus-sized Whitman, as well as the changes made to sanitize the book...",
      "author": "Peter Canavese"
    },
    {
      "text": "Even if it serves up the happy ending audiences apparently insist upon, the good in The DUFF mostly outweighs the stuff you've seen before.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Funny, heartfelt and inspirational. The best high school comedy since Easy A. Mae Whitman deserves to be a star.",
      "author": "Avi Offer"
    },
    {
      "text": "It's hard not to see \"The Duff\" becoming an instant teen classic.",
      "author": "Nick Schager"
    },
    {
      "text": "The half-hearted message about inner beauty and self-esteem becomes muddled in a film that winds up as shallow as many of its characters.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The Duff makes timely points about self-love, body image, and modern relationships but falls short of becoming a teen drama classic.",
      "author": "Ben Kendrick"
    },
    {
      "text": "Anyone not currently in high school is bound to find it derivative, albeit not unpleasant.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The DUFF won me over, to the degree that I found it to be one of the more charming teen comedies of recent years.",
      "author": "Emily St. James"
    },
    {
      "text": "As much as the film attempts to follow in the Easy A template, it lacks its satiric edge, and its willingness to confront high school hypocrisy head-on.",
      "author": "Randall King"
    },
    {
      "text": "One of the few teen comedies that may remain relevant (and entertaining) for years to come.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Why is it so wonderful? Because wit and charm matter, and The DUFF has a good deal of both. The cast will be stars, the gags will be immortal, and you'll still be watching this movie years from now.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Fun high school comedy is unexpectedly insightful.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "Yearning to be the new \"Mean Girls,\" \"The DUFF\" is just another bad movie some premium cable channel is going to try to make you watch in the near future.",
      "author": "James Verniere"
    },
    {
      "text": "Teen angst flicks are always formula. The DUFF is no exception. Once in awhile one is done right. This is a pretty good -- but very predictable -- flick.",
      "author": "Gary Wolcott"
    },
    {
      "text": "The fact that The DUFF ends on a such a sappy, uninspired note isn't surprising, but it is disappointing given all the little glimmers of promise peppered throughout the film's first half.",
      "author": "Adriane Neuenschwander"
    },
    {
      "text": "[T]oo eager to prove that it's hip to the ways of the youngsters these days ... pounding away at its one note of supposed insight until it just becomes condescending.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The chemistry between Whitman and Amell is decent enough to overcome some issues and rough spots. (Full Content Review -- Sex, Profanity, Violence, etc. -- for Parents also available)",
      "author": "Jim Judy"
    },
    {
      "text": "Whitman displays flawless comic timing and consistently makes inspiring choices in terms of delivery, reaction, even the slightest facial expression. She shines confidently in a self-deprecating role, and it's irresistible.",
      "author": "Christy Lemire"
    },
    {
      "text": "More in line with cheesy nineties teen movies like SHE'S ALL THAT than John Hughes or more sensitive, recent fare.",
      "author": "Chris Bumbray"
    },
    {
      "text": "It's the first great teen comedy since Mean Girls.",
      "author": "Maggie Wrobel"
    },
    {
      "text": "Sandel's film has heart, some good laughs and a decent message. In this age of cyberbullying, that's nothing to scoff at.",
      "author": "David Lewis"
    },
    {
      "text": "It falls short of the mark, even as it hits every one of the genre's conventions.",
      "author": "Tirdad Derakhshani"
    },
    {
      "text": "Capable, spry, and mostly wise when it isn't spelling out its moralistic intent. The main attraction is Mae Whitman, acting her heart out while making her every last moment look as natural and vulnerable as that of a real life being lived.",
      "author": "Dustin Putman"
    },
    {
      "text": "Especially because the young co-stars Mae Whitman and Robbie Amell are so appealing, The DUFF is charming, cheeky and relevant.",
      "author": "Bruce Kirkland"
    },
    {
      "text": "Where Bianca and Wesley are going is obvious from the outset, but it builds naturally through a pal-ship with a genuine spark.",
      "author": "David Berry"
    },
    {
      "text": "Even in this would-be subversive comedy, success means getting the guy.",
      "author": "Ben Kenigsberg"
    },
    {
      "text": "Romance, or the desire to find someone special, isn't a bad thing - if it's not the only thing. But as it stands in \"DUFF,\" the denouement at prom has clich written all over it.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "The DUFF would make John Hughes smile.",
      "author": "James Berardinelli"
    },
    {
      "text": "The film deposits its heroine and everyone in the audience looking toward her for image-maintaining guidance back at square one.",
      "author": "Eric Henderson"
    },
    {
      "text": "A tepid, undernourished clone of the John Hughes high school template, with attractive leads stuck in a script that feels like a tattered hand-me-down.",
      "author": "Frank Swietek"
    },
    {
      "text": "Whitman makes Bianca so thoroughly herself throughout that anyone would be glad to have her for a BFF.",
      "author": "Nell Minow"
    },
    {
      "text": "A Derivative Unimaginative Forgettable Film.",
      "author": "Peter Keough"
    },
    {
      "text": "Mae Whitman is the best thing here, and the funny actress deserves better material than what's offered in this derivative and superficial ode to teen self-acceptance.",
      "author": "Claudia Puig"
    },
    {
      "text": "The earnest, yet consistently misfiring \"The DUFF,\" makes all those other teen movies look even better.",
      "author": "Kevin Jagernauth"
    },
    {
      "text": "A smart, funny, straight-talking teen movie in the John Hughes tradition. Oodles of charm from the young cast.",
      "author": "Rafer Guzman"
    },
    {
      "text": "It works, but just barely.",
      "author": "Moira MacDonald"
    },
    {
      "text": "While ultimately serving up the expected, The DUFF is fresh and funny throughout, largely thanks to two vibrantly written lead characters.",
      "author": "Michael Sauter"
    },
    {
      "text": "The movie is glib and willfully superficial but also smart at times about teen social stratification.",
      "author": "Gary Thompson"
    },
    {
      "text": "For all its potential pitfalls, The DUFF manages to keep its head above water, thanks to Whitman, Amell, and a willingness to engage with teen-movie clichs in a relatively thoughtful way.",
      "author": "Genevieve Koski"
    },
    {
      "text": "There are no surprises here, but the predictability doesn't mute the fun.",
      "author": "Rob Hunter"
    },
    {
      "text": "The ostensible message of accepting difference is overwhelmed by a spirit of blind conformism.",
      "author": "Ben Sachs"
    },
    {
      "text": "The DUFF is exponentially dumb. For starters, Mae Whitman isn't fat or ugly. Point of fact, she's wildly charismatic.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Whitman is fantastic, the movie is not- it goes back and forth between subverting genre cliches and wholeheartedly embracing them",
      "author": "Stephen Silver"
    },
    {
      "text": "You know what would be revolutionary? Making a really good movie about a three-dimensional teenage female character that doesn't start and finish with both eyes on the same old punishing character types.",
      "author": "Michael Phillips"
    },
    {
      "text": "What might have been a frank portrayal of high school culture and challenges ends up veering between being either too cynically hyper-sexual or preachy.",
      "author": "Ann Hornaday"
    },
    {
      "text": "\"Mae Whitman reveals herself to be one of the funniest actresses of her generation in a spot-on and endlessly quotable take on teenage 'dramz' in 2015.\"",
      "author": "Inkoo Kang"
    },
    {
      "text": "This is [Whitman's] film, and she seems determined not to waste her chance at being a leading lady.",
      "author": "Katie Rife"
    },
    {
      "text": "Whitman brings such kindness to Bianca that the movie almost sometimes sort of works as empowering evidence of many teens' flawed, self-esteem-driven perspectives.",
      "author": "Matt Pais"
    },
    {
      "text": "A shallow, witless, and bizarrely cast endeavor, always eager to preach about the value of self-acceptance, but just as ready to indulge superficial behavior as a method of empowerment.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A clever comedy that isn't a chore to sit through if you're outside of the target demographic. Oh, and your kids are gonna love it.",
      "author": "Mike Reyes"
    },
    {
      "text": "It's a comedy with an easy message, and it's sort of sweet. Not too raunchy, not too challenging. A good date movie for sophomores.",
      "author": "Jeff Baker"
    },
    {
      "text": "The DUFF doesn't seem to know what its point actually is. It's pro-self-acceptance and also pro-makeover. It's about liking yourself, and how you'd like yourself better with a boyfriend.",
      "author": "Amy Nicholson"
    },
    {
      "text": "Feels like grown-ups so desperate to appear hip to social media, they make sure to mention every app they've ever heard of, including We Heart It and Whatsapp.",
      "author": "Fred Topel"
    },
    {
      "text": "The DUFF doesn't deviate much from the pattern, in fact it doesn't stray from it all, but a pair of playful lead performances by Mae Whitman and Robbie Amell makes it a worthy entry in the genre.",
      "author": "Travis Hopson"
    },
    {
      "text": "The DUFF won't stay with you far past its runtime. But as a vehicle, it's ample proof that we should be seeing more of Mae Whitman.",
      "author": "Kevin P. Sullivan"
    },
    {
      "text": "Most of the credit goes to Whitman, who stands in, and stands up, for the DUFF in all of us.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "This winsome comedy is a little low in the stakes department, not to mention predictable, but it gets an \"A\" for charm.",
      "author": "Kyle Smith"
    },
    {
      "text": "Derivative of better teen comedies and not daring enough to deal with the consequences of an image-based culture, The DUFF wastes a talented young ensemble.",
      "author": "Jordan Adler"
    },
    {
      "text": "There are stretches in which The Duff soars, nailing scene after funny scene with an honest spirit rarely seen in mainstream teen films.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Its central pair of unlikely allies will engage young audiences' sympathy. They're smartly played by Mae Whitman and Robbie Amell, whose warmth and comic chops keep the movie buoyant.",
      "author": "Sheri Linden"
    },
    {
      "text": "While it's neither as biting as Mean Girls nor as sweetly referential as Easy A, the earnest and sometimes amusing The DUFF is a fine addition to the canon.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "I laughed a few times and despite some guy-a-mile-away plot moments, walked away feeling just fine about it. And from a jaded film snob, that's a very good sign.",
      "author": "Kyle Anderson"
    }
  ],
  "release_year": 2015,
  "duration": 96,
  "genres": [
    "Romance",
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "Frumpy high-school senior Bianca (Mae Whitman) has a rude awakening when she learns that her classmates secretly know her as the DUFF -- designated ugly fat friend -- to her prettier and more popular pals. Desperate to reinvent herself, Bianca enlists the aid of Wesley (Robbie Amell), a charming jock. In order to save her senior year from becoming a complete disaster, Bianca must find the confidence to overthrow a judgmental student (Bella Thorne) and revolutionize the school's social order.",
  "popularity": 6.6,
  "poster_url": "https://image.tmdb.org/t/p/original/aHzdMSKwq9ucnP2yXl5zYIfKgGl.jpg"
}