{
  "movie_name": "The Shining",
  "movie_id": "shining",
  "total_reviews": 102,
  "reviews": [
    {
      "text": "Despite The Outlook’s advantages, a hysterical, bookworm, couch potato, chain smoking wife beats it. Kubrick did not intend to create a film about evil’s Achilles heel, but I left with that message. Be a mess, but fight.",
      "author": "Sarah Vincent"
    },
    {
      "text": "With an out-of-this-world cast, \"The Shining\" remains a cult film, even after 44 years and it’s ideal for a cold winter evening.",
      "author": "Zofia Wijaszka"
    },
    {
      "text": "The supernatural joins forces with psychosis in Stanley Kubrick’s superb adaptation of a Stephen King bestseller.",
      "author": "Wendy Ide"
    },
    {
      "text": "Stanley Kubrick somehow manages to feel restrained and more ambitious than ever, delivering a harrowing and nightmarish case study in the impact of isolation and familial resentment.",
      "author": "Patrick Cavanaugh"
    },
    {
      "text": "The Shining might be one of the most accessible classics to new viewers of today to understand why it is, in fact, one of the greatest and most influential horror films of all time. The ending is still mind-blowing after all these years.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Yet, The Shining, which was his third to last film, was akin to the genre films of his past such as Dr. Strangelove and 2001: A Space Odyssey where he explored the essence of humanity in a way unlike any other filmmaker.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Kubrick sabotages his own thesis in the most knuckleheaded way conceivable: we can't be charged as accomplices in horror when there is no horror.",
      "author": "Jay Scott"
    },
    {
      "text": "Kubrick, however, doesn't really seem interested in the \"shining\" or in the hotel's supernatural forces generally... The result is a movie fatally flawed artistically.",
      "author": "John Brosnan"
    },
    {
      "text": "An unending roller coaster of terror that knows exactly how to get under the skin of anyone who watches it.",
      "author": "Cody Dericks"
    },
    {
      "text": "There are a few terrific thrills, and some eerie moments of dislocation that only Kubrick could achieve, but most of the movie is unfelt, unscary, and bizarrely heavy-handed. It's the first pompous haunted-house movie.",
      "author": "David Denby"
    },
    {
      "text": "The terrifying aspect of The Shining, and its most enduring quality, is how Kubrick has trapped us in his cinematic maze to search without hope of ever discovering an adequate answer outside of our own making.",
      "author": "Brian Eggert"
    },
    {
      "text": "He's always been the caretaker. Yet he's not fully aware, unlike Phil in Groundhog Day, who improves himself over what could be millions of years. (An aside from Harold Ramis about that story's duration.)",
      "author": "Ray Pride"
    },
    {
      "text": "A true masterpiece.",
      "author": "Tony Black"
    },
    {
      "text": "Each viewing reestablishes The Shining as one of the greatest horror movies of all-time.",
      "author": "Brian Gill"
    },
    {
      "text": "I have never watched The Shining and not been blown away. It's an absolute clinic in atmosphere, tension, family drama, production design, cinematography, and so much more.",
      "author": "Kent Garrison"
    },
    {
      "text": "Primarily about building an atmosphere and a feeling of unease; something could pop out at any second, but it doesn't have to in order to startle viewers.",
      "author": "Mike Massie"
    },
    {
      "text": "(1980 Review) Aside from an occasional flash of brilliance it is tedious and, the fatal blow, not all that scary.",
      "author": "Bill Newcott"
    },
    {
      "text": "It just didn't speak to me. I thought it was way too long and a little too slow in pace.",
      "author": "Justin Brown"
    },
    {
      "text": "One of the best movies of all time...my favorite Kubrick film.",
      "author": "Brandon Collins"
    },
    {
      "text": "...one of cinematic history's most lauded horror films.",
      "author": "David Nusair"
    },
    {
      "text": "\"The Shining\" is woke, both in that the movie subtly addresses complex social issues and because the in-universe clairvoyant act of shining allows characters to see past and future atrocities (some politically charged) that occurred in the Overlook Hotel.",
      "author": "Matthew Rozsa"
    },
    {
      "text": "[The Torrence's] night of anarchy, spearheaded by Nicholson's ferocity, has become one of cinema's most iconic and deranged events.",
      "author": "Luke Parker"
    },
    {
      "text": "It's an interesting movie, but not the ultimate work in its genre that some expected from one of the great directors.",
      "author": "Lee Lescaze"
    },
    {
      "text": "Nicholson gives the performance of his life here, subtly changing from a vaguely defeated family man to a maniacally leering American version of Eisenstein's Ivan the Terrible.",
      "author": "Richard Freedman"
    },
    {
      "text": "Kubrick takes the trash material of the book so seriously, giving us optical purity, frame by languorous frame. But the material can't support that kind of handling, and we're denied the few simple pleasures we expect from a scare movie.",
      "author": "Lawrence O'Toole"
    },
    {
      "text": "The altered tone suits Kubrick's gallows humor, which was always about confronting and critiquing his audience's baser impulses: reinventing The Shining as a slapstick comedy about murderous patriarchal insecurity is a daring move.",
      "author": "Adam Nayman"
    },
    {
      "text": "Kubrick gives Shelley Duvall's persona depth and importance.",
      "author": "Kathy Huffhines"
    },
    {
      "text": "Stanley Kubrick's efforts to mix fantasy and reality are resolved too often in overused scenes of the persecuted kid, threatened woman, loud effects, and a deluge of blood. The result is an excessively calculated and distant film. [Full Review in Spanish]",
      "author": "Jesús Fernández Santos"
    },
    {
      "text": "For the stout-hearted, The Shining is definitely worth seeing for Nicholson's performance as well as Kubrick's fancy camerawork.",
      "author": "Rick Chatenever"
    },
    {
      "text": "Kubrick is master of visual images, and many of the scenes display his brilliance. But much of the suspense ends in anti-climax, and Jack Nicholson and Shelley Duvall seem over-extended in trying to maintain the terror.",
      "author": "Bob Thomas"
    },
    {
      "text": "The Shining is a bonafide classic. By this point, almost every scene is so iconic, the experience of watching it - truly watching it - feels something like devouring a Greatest Hits collection.",
      "author": "Scott Wampler"
    },
    {
      "text": "Kubrick most definitely made an impressive horror film that not only contributed to the genre as a whole, it also left an indelible mark on many moviegoers.",
      "author": "C.H. Newell"
    },
    {
      "text": "A work of maximum-impact minimalism based on a slender, yet searing story by King.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Stanley Kubrick is at top of his game.",
      "author": "Rachel Wagner"
    },
    {
      "text": "It is technically magnificent and eerily tense, like waiting for an ocean of blood to pour from an elevator shaft. The Krzysztof Penderecki score is deeply unnerving.",
      "author": "Sean Fennessey"
    },
    {
      "text": "What a picture that could have been: a modern ghost yarn with an excellent cast, directed by master technician Stanley Kubrick. Yet the result is a bore, sometimes gratuitously violent, and lacking logic as well as chills.",
      "author": "David Sterritt"
    },
    {
      "text": "When you sit down to The Shining, you sit down with normal expectations of being diverted, perhaps even being gripped, but not being undermined. But the film undermines you in powerful, inchoate ways.",
      "author": "Bruce McCabe"
    },
    {
      "text": "It is a film that feels tantalizingly incomplete, missing just a few crucial pieces that you feel certain you're bound to catch the next time around.",
      "author": "Sean Burns"
    },
    {
      "text": "Kubrick again plays off the awesomeness of the internal odyssey and the banality of ordinary human behaviour.",
      "author": "Richard Combs"
    },
    {
      "text": "The Shining buzzes madness and malevolence from every frame.",
      "author": "Jamie Graham"
    },
    {
      "text": "Anyone coming to this work for the first time should be forewarned that the will generate more giggles (and perhaps a yawn or two), but there is absolutely nothing here to fear.",
      "author": "Phil Hall"
    },
    {
      "text": "Shock effect and graphic imagery don't compensate for the sense of pointlessness and even distaste that is left at the end of the movie.",
      "author": "Ernest Leogrande"
    },
    {
      "text": "If The Shining isn't trivial, it certainly encourages one to think that it is. But, perhaps, even that's a change for the better. Generally, it's the other way around.",
      "author": "Derek Malcolm"
    },
    {
      "text": "One of the best scary movies ever made, one of the best scary movies even imaginable.",
      "author": "Tim Brayton"
    },
    {
      "text": "A masterpiece.",
      "author": "Ben Walters"
    },
    {
      "text": "The Shining is like a near-miss auto accident: You don't know how scared you really were until you start shaking a few hours later.",
      "author": "Ralph Novak"
    },
    {
      "text": "The first time I saw Stanley Kubrick's The Shining, I had to turn it off during three key moments... Perhaps this time, I prayed, [it] would seem almost comically silly. Yeah, not so much.",
      "author": "Simon Miraudo"
    },
    {
      "text": "...above all a movie about spaces, and how few things are more frightening than not knowing which way to go.",
      "author": "Josh Larsen"
    },
    {
      "text": "Strange and deeply creepy.",
      "author": "Andy Lea"
    },
    {
      "text": "The technique is as overpowering as Nicholson's performance, which is both hammy and deeply disturbing.",
      "author": "Adrian Turner"
    },
    {
      "text": "Kubrick's compositions and Jack Nicholson going kill-crazy with an axe remain hard to beat on the big screen.",
      "author": "Alistair Harkness"
    },
    {
      "text": "It's all in the build-up: Kubrick sets the scene for the horror with meticulous care.",
      "author": "Killian Fox"
    },
    {
      "text": "Re-cut or not, The Shining remains one of the most viscerally disturbing films ever made.",
      "author": "Emma Dibdin"
    },
    {
      "text": "Deeply scary and strange.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "It does for the 'horror' genre what 2001 did for the science fiction epic; it intensifies it, thereby making it more theatrical but at the same time giving it more depth.",
      "author": "Peter Ackroyd"
    },
    {
      "text": "Essential viewing. Prepare to be disturbed.",
      "author": "Ashley Clark"
    },
    {
      "text": "Its artful ambiguities are immersive. Check in.",
      "author": "Kevin Harley"
    },
    {
      "text": "As in 2001, Kubrick likes ghost stories more than I do. And he gives me enough else, in the way of acting and bizarrely beautiful surroundings, to keep me happy.",
      "author": "Robert Hatch"
    },
    {
      "text": "Stanley Kubrick's film is a work of art that will continue to be broken down and explored for decades to come...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Kubrick doesn't dumb it down or anything, but he's not actively trying to appeal only to film connoisseurs either. If any of his movies could be called mainstream, it's this one.",
      "author": "Jeremy Knox"
    },
    {
      "text": "Kubrick has made a movie that will have to be reckoned with on the highest level.",
      "author": "Richard Schickel"
    },
    {
      "text": "\"The Shining\" is an intense and not always ingratiating experience, a natural bookend to \"2001\"...",
      "author": "Rob Gonsalves"
    },
    {
      "text": "As a ghost story and adaptation of the Stephen King novel, it's largely a failure. On the other hand, as an example of directorial bravura and as a study of madness and the unreliable narrator, it's a brilliant success.",
      "author": "James Berardinelli"
    },
    {
      "text": "The result may not quite match Kubrick's greatest films, but it is enthralling and hypnotic - a brilliant, ambitious attempt to shoot a horror film without the Gothic trappings.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "It's arguably the talented director's least appealing film, as it feels empty and soulless.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It's the experience more so than the actual content of The Shining that radiates cold, anti-humanly indifferent terror.",
      "author": "Eric Henderson"
    },
    {
      "text": "Ostensibly a haunted house story, it manages to traverse a complex world of incipient madness, spectral murder and supernatural visions... and also makes you jump.",
      "author": "Ian Nathan"
    },
    {
      "text": "One of the late 20th century's finest tales of the supernatural and a justly famous classic.",
      "author": "Film4 Staff"
    },
    {
      "text": "Kubrick is after a cool, sunlit vision of hell, born in the bosom of the nuclear family, but his imagery -- with its compulsive symmetry and brightness -- is too banal to sustain interest, while the incredibly slack narrative line forestalls suspense.",
      "author": "Dave Kehr"
    },
    {
      "text": "The movie is not about ghosts but about madness and the energies it sets loose in an isolated situation primed to magnify them.",
      "author": "Roger Ebert"
    },
    {
      "text": "With remarkable visual panache and a keen sense of irony, Stanley Kubrick rehabilitates Stephen King's trashy, terrifying novel.",
      "author": null
    },
    {
      "text": "With everything to work with, director Stanley Kubrick has teamed with jumpy Jack Nicholson to destroy all that was so terrifying about Stephen King's bestseller.",
      "author": "Variety Staff"
    },
    {
      "text": "Kubrick's mostly riveting attempt to rewrite the conventions of the horror genre",
      "author": "Dan Jardine"
    },
    {
      "text": "Kubrick's use of space and the eerie steadycam have never been put to better use.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Kubrick's spellbinding 1980 horror epic is one of the true masterpieces to come out of the genre. And Nicholson's descent into unbridled insanity is simply unforgettable.",
      "author": "Chuck O'Leary"
    },
    {
      "text": "I fear all work and no play has made Stanley a dull boy.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "If Stanley Kubrick's The Shining is not the best haunted house movie ever made, it is certainly among the most intricately constructed.",
      "author": "Leo Goldsmith"
    },
    {
      "text": "\"Here's Johnny!\" ... Kubrick's grandiose Jack-in-a-box shocker is a fright, but it's hardly up to his earlier brilliance.",
      "author": "Thomas Delapa"
    },
    {
      "text": "Regardless of how you read the film, there's little denying that it's a masterful work.",
      "author": "Ken Hanke"
    },
    {
      "text": "The Shining goes halfway toward bringing back Franz Kafka's understanding of real horror as the evil that lies within.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "An immortal classic.",
      "author": "Andreas Samuelson"
    },
    {
      "text": "One of Kubrick's most severely overcooked, overdetermined projects; Duvall fascinates, but the rest bores and wearies.",
      "author": "Nick Davis"
    },
    {
      "text": "Among a handful of the scariest movies ever made.",
      "author": "Jon Niccum"
    },
    {
      "text": "The beauty of Kubrick's film is the ambiguity of it all . . . will leave the gears turning long after the credits stop.",
      "author": "Brian Mckay"
    },
    {
      "text": "The trappings are brilliant, but Kubrick ultimately loses the essence of the source material - and he's too good to expect anything less.",
      "author": "Rob Vaux"
    },
    {
      "text": "I can't recall a more elaborately ineffective scare movie.",
      "author": "Gary Arnold"
    },
    {
      "text": "Among that rare class of adaptations: it is as good as or better than the source material.",
      "author": "Michael W. Phillips, Jr."
    },
    {
      "text": "A mysterious, haunting, visual experience.",
      "author": "Jeremiah Kipp"
    },
    {
      "text": "Boy will it chill your blood.",
      "author": "Almar Haflidason"
    },
    {
      "text": "By the second hour all hell breaks loose, and in the last few minutes it's sheer terror.",
      "author": "John J. Puccio"
    },
    {
      "text": "One of the scariest films I've ever seen. And I'm not easily scared.",
      "author": "Ted Prigge"
    },
    {
      "text": "Kubrick isn't out for screams, but he manages to make his movie thoroughly unnerving by keeping the horror so close to home.",
      "author": "Janet Maslin"
    },
    {
      "text": "A deliberately paced, but endlessly creepy, horrifying motion picture.",
      "author": "Dustin Putman"
    },
    {
      "text": "A camp classic that brings up some good psychological scares, yet is also abundant with laughs.",
      "author": "Matt Easterbrook"
    },
    {
      "text": "Weird as it sounds, this creepy thriller works.",
      "author": "Marjorie Baumgarten"
    },
    {
      "text": "Not Kubrick's greatest work (let's be honest: entire sections of this film make no sense at all), but hey, it's creepy as hell.",
      "author": "Christopher Null"
    },
    {
      "text": "The Shining (1980) is creative director Stanley Kubrick's intense, epic, gothic horror film masterpiece - a beautiful, stylish work that distanced itself",
      "author": "Tim Dirks"
    },
    {
      "text": "one of those rare thrillers that actually benefits from repeated viewings, although the movie is so unnerving many viewers have never made it all the way through even once.",
      "author": "James Sanford"
    },
    {
      "text": "Chilling, majestic piece of cinematic fright.",
      "author": "JoBlo"
    },
    {
      "text": "Kubrick's showcase of abilities, both with the camera and his characters, are incomparably haunting.",
      "author": "David Keyes"
    },
    {
      "text": "Strays from the source material, but still a creepy classic.",
      "author": "Scott Weinberg"
    },
    {
      "text": "The idea of the haunted house is turned completely inside out",
      "author": "Shane Burridge"
    }
  ],
  "release_year": 1980,
  "duration": 142,
  "genres": [
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "Jack Torrance (Jack Nicholson) becomes winter caretaker at the isolated Overlook Hotel in Colorado, hoping to cure his writer's block. He settles in along with his wife, Wendy (Shelley Duvall), and his son, Danny (Danny Lloyd), who is plagued by psychic premonitions. As Jack's writing goes nowhere and Danny's visions become more disturbing, Jack discovers the hotel's dark secrets and begins to unravel into a homicidal maniac hell-bent on terrorizing his family.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/xazWoLealQwEgqZ89MLZklLZD3k.jpg"
}