{
  "movie_name": "The Hangover Part II",
  "movie_id": "the_hangover_2",
  "total_reviews": 244,
  "reviews": [
    {
      "text": "If you want more laughs than you shouldn’t miss The Hangover Part II, just don’t expect anything remarkably different this time around… in fact to be safe just check your brain in at the Candy Bar on your way in.",
      "author": "David Griffiths"
    },
    {
      "text": "Even if The Hangover Part II is, in essence, a predictable mirror image of the first film, just in a new setting, doesn't make it any less funny or entertainingly over-the-top.",
      "author": "Don Shanahan"
    },
    {
      "text": "The shock-based laughs were forgivable with The Hangover given the novelty of the concept, but there’s no pardoning the do-over feel of this sequel.",
      "author": "Brian Eggert"
    },
    {
      "text": "It wasn't that bad and we laughed a lot.",
      "author": "Julie and Brandy"
    },
    {
      "text": "Offers another dose of debauched misadventures from the \"wolf pack\" of comedians, sure to please those hungering for more after the original film.",
      "author": "Mike Massie"
    },
    {
      "text": "For the most part, director Todd Phillips plays it safe and goes for the surefire box-office hit.",
      "author": "Richard Propes"
    },
    {
      "text": "An almost identical rehash of the first film.",
      "author": "Brent McKnight"
    },
    {
      "text": "This is a movie of bad things happening to relatively bad people, with precious little humor to break up the ugliness.",
      "author": "Sean Collier"
    },
    {
      "text": "A reprehensible film that is completely devoid of laughs.",
      "author": "David Harris"
    },
    {
      "text": "The Hangover Part II answers this riddle: how can a movie be a doting copy of the original and have the opposite effect?",
      "author": "Brian D. Johnson"
    },
    {
      "text": "It's a fun distracting mile a minute race to the ridiculous last scene. That's what the title promises, and that's what you get.",
      "author": "Leslie Combemale"
    },
    {
      "text": "I'll admit it is fun to see these familiar characters again, even if it feels like we've seen this before. Cooper seems so relaxed as Phil that I think it is easy to overlook how good he really is here, while Helms isn't afraid to be the butt of the joke.",
      "author": "Micheal Compton"
    },
    {
      "text": "If you want to see everything you saw in Hangover, only transplanted to Bangkok, with a drug-peddling simian and a missing human finger, then Hangover 2 is the movie for you.",
      "author": "Shubhra Gupta"
    },
    {
      "text": "There are plenty of laughs to be had from the outrageous situations in which the guys find themselves.",
      "author": "Kelly Jane Torrance"
    },
    {
      "text": "A sluggish, pointless and overly vulgar shot for shot copy of its far superior forebearer, though it is neither as clever or as tactful.",
      "author": "Edward Frost"
    },
    {
      "text": "An obnoxious installment in an obnoxious franchise, The Hangover Part II is also (intentionally or not) fascinatingly bent on disconcerting its target audience.",
      "author": "Fernando F. Croce"
    },
    {
      "text": "The wickedly entertaining characters and actors each leave audiences in stitches as they go through the motions of an equally entertaining--albeit redone--plot that will thrill die-hard fans of the original.",
      "author": "Candice Frederick"
    },
    {
      "text": "I don't believe that these characters would ever be friends, I don't like spending time with them, and I do not care what happens to them or their weddings or their adoptive babies or their relationship with Mike Tyson.",
      "author": "Lindy West"
    },
    {
      "text": "Raunchy and unfunny, this sequel feels like a simple retread of its predecessor.",
      "author": "John Hanlon"
    },
    {
      "text": "If you love the first film, seriously, do not see this one. You'll ruin two movies at once.",
      "author": "Will Leitch"
    },
    {
      "text": "The cast is once again at the top of their game and there are some genuinely hilarious moments, but on the whole, The Hangover Part II is way too similar to the first film to be enjoyable.",
      "author": "Matt Joseph"
    },
    {
      "text": "The Hangover: Part II shows the writers have absolutely no faith in their characters or their own ability to take them somewhere new.",
      "author": "Ali Gray"
    },
    {
      "text": "Overall, your enjoyment of this film will correlate directly to your enjoyment of the previous film. If you liked it, you'll like this one, if not, you won't enjoy the sequel as it's just more of the same.",
      "author": "Jeff Beck"
    },
    {
      "text": "I think the first one is like GONE WITH THE WIND compared to this tired old turd.",
      "author": "Austin Kennedy"
    },
    {
      "text": "Visually dazzling, well shot and perhaps richer in character than the first film -- but also nowhere near as clever, refreshing or funny.",
      "author": "R.L. Shaffer"
    },
    {
      "text": "It is the epitome of lazy Hollywood filmmaking.",
      "author": "Greg Maki"
    },
    {
      "text": "There are one or two good jokes and the cast is mainly likeable but the rest of the material is so predictable and tawdry that the entire film becomes something of a chore",
      "author": "Laurence Boyce"
    },
    {
      "text": "...almost the same gang of dimwits are up to the same shenanigans, with Thailand substituting for Vegas.",
      "author": "John J. Puccio"
    },
    {
      "text": "The guys are just as clueless after a wild night on the town, but getting lost amid the goggle-bright lights of Las Vegas seems like a fairground ride compared to Bangkok.",
      "author": "Stella Papamichael"
    },
    {
      "text": "One drink too many, The Hangover Part II relies too much on its talented cast and not enough on the laughs.",
      "author": "Rory Meyer"
    },
    {
      "text": "This is not a case of imitation being the sincerest form of flattery-it is indolent narcissism of the most nauseating kind.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "More a horror than a comedic film, as if Todd Phillips is making a kind of \"Heart of Darkness\" argument with Bangkok as his backdrop.",
      "author": "Stephen Himes"
    },
    {
      "text": "If you can look past the fact that this film is closer to a remake than a sequel, it's an enjoyable way to spend an hour and a half. Might not be original, but it's still funny.",
      "author": "Andreas Heinemann"
    },
    {
      "text": "...as needless a contemporary sequel as one can easily recall...",
      "author": "David Nusair"
    },
    {
      "text": "It might not be quite as much fun as the first film but it's fun enough - and that's all that counts. Plus, there's a monkey in it.",
      "author": "Jim Schembri"
    },
    {
      "text": "\"It happened again.\" That's the opening gambit of The Hangover: Part II, but sadly the same can be said of the franchise.",
      "author": "Sam Bathe"
    },
    {
      "text": "If you liked The Hangover, you're going to like The Hangover Part II because it is the same movie.",
      "author": "James Verniere"
    },
    {
      "text": "Hangover 2 far too Familiar",
      "author": "Charles Koplinski"
    },
    {
      "text": "Unless moviegoers themselves are willing to shoulder some of the blame, it's useless to try and figure out why The Hangover Part II is so bad. The film only exists because, after the hilarious 2009 movie broke box-office records for an R-rated comedy...",
      "author": "Leonard Maltin"
    },
    {
      "text": "For me, the bottom line is, did I laugh? And I did. As much as I did the first time around.",
      "author": "David Poland"
    },
    {
      "text": "This may be the one time in recorded history where a second hangover is a good thing. Bartender, serve up another round with the wolf pack.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "If its hugely successful 2009 predecessor served up a lot of raucous laughs and guilt-free entertainment, this seems intent on dishing out morning- after-style punishment for all the fun that was had.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Missing is the deliriously unpredictable inventiveness of the first film, replaced by variations on its most memorable bits.",
      "author": "Siobhan Synnot"
    },
    {
      "text": "The reason [the first one] worked so well was because of the unique concept and the mystery structure. Now the concept is familiar and the mystery isn't engaging. [This is} the very definition of a lazy, pointless sequel.",
      "author": "Eric Melin"
    },
    {
      "text": "Seamlessly applies the Hangover structure to a new setting. The beauty of it is it could happen anywhere, or with anyone (i.e. franchise.)",
      "author": "Fred Topel"
    },
    {
      "text": "As this is the boys' fate, it speaks also to assumptions about viewers, that they're satisfied with a wheel that takes them nowhere surprising, repeating a semblance of plot points and a series of gags.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "If you laughed your butt off in the first film, you'll laugh half your butt off here, and even that is generally worth the price of admission these days.",
      "author": "Burl Burlingame"
    },
    {
      "text": "Phillips and company are treading water, going through the motions in order to pick up a quick paycheck before moving onto something else.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "You know, this isn't all that original. Even for a sequel, it's unashamedly derivative. But I kept thinking, as I gasped, sometimes with laughter and sometimes from shock, that 'The Hangover Part II' still is hilarious more often than it's not.",
      "author": "Linda Cook"
    },
    {
      "text": "It feels less like The Hangover Part II than it does like The Hangover 2.0, as if Phillips were trying to go back and make the first film funnier instead of making a new one.",
      "author": "Joshua Starnes"
    },
    {
      "text": "The Hangover Part II isn't a dud, exactly -- some of it is very funny, and there are a few memorable jolts and outlandish dirty moments. But it feels, at times, like a routine adventure film set overseas.",
      "author": "David Denby"
    },
    {
      "text": "More mean spirited than fun.",
      "author": "John Wirt"
    },
    {
      "text": "Stu, Phil, and Alan are like the Three Stooges: the backdrop may look a little different, but it's the same ladder to the gut and poke in the eye again.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Man, did they blow it with this one.",
      "author": "Bob Grimm"
    },
    {
      "text": "Five credited writers have made the sequel darker, much less funny and provided the type of bad behavior in another country that pretty much defines the term \"ugly Americans.\"",
      "author": "Lori Hoffman"
    },
    {
      "text": "The makers of The Hangover Part II have pulled off one of the most blatantly lazy acts of filmmaking in recent memory. And it still works.",
      "author": "Tim Martain"
    },
    {
      "text": "little more than a repetitive, desperate sequel, the very definition of unnecessary",
      "author": "James Kendrick"
    },
    {
      "text": "What was dumb in the original is dumber in the sequel; what was crude in the original is cruder in the sequel; Galiafinakis was obnoxious in the original and he is more so in the sequel.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Director Todd Phillips Should be Given Credit for Making a Darker, Edgier Film But A Lot of the Shock is Lost with Predictable Material.",
      "author": "Jimmy O"
    },
    {
      "text": "What's missing is a huge part of what made the first film so good: the element of surprise.",
      "author": "Stephen Silver"
    },
    {
      "text": "Funnier than the first one, for what that's worth.",
      "author": "Kelly Vance"
    },
    {
      "text": "I didn't laugh a whole lot at this grimier, darker sequel, but I found it consistently more interesting, visually and thematically, than the first.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "It's a dark and morbid cash-in and nothing more...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "It's fun to hang out with these guys again ... until it isn't. The problems with the first film seem amplified in the second.",
      "author": "Jeff Bayer"
    },
    {
      "text": "By definition, a sequel is just more of the same. In the case of The Hangover Part II, that's a very welcome redundancy indeed",
      "author": "Christopher Null"
    },
    {
      "text": "Sure, it's a rehash of the first movie's plot, but it's still funny. Just not as funny as the original.",
      "author": "Scott Nash"
    },
    {
      "text": "Same deal as the original.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The Hangover Part II sees the same ingredients shaken up in the kaleidoscope, but a less attractive and far less amusing pattern emerges.",
      "author": "Philip French"
    },
    {
      "text": "\"The Hangover Part II\" is what you will expect. I don't think it was better then the first but it did a great job at being just as good.",
      "author": "Jolene Mendez"
    },
    {
      "text": "Those yearning for some summertime bawdiness at the movies would be well-advised to check out Bridesmaids instead, as any random scene in that picture is better than anything on display in The Hangover Part II.",
      "author": "Matt Brunson"
    },
    {
      "text": "This film is more fun than it has any business being.",
      "author": "Widgett Walls"
    },
    {
      "text": "Laff-out-loud raunchy ... delivers on its promise to not leave one sacred cow standing, one nationality or sexual designation unsullied. How many films can make that claim?",
      "author": "Glenn Lovell"
    },
    {
      "text": "The movie exceeds expectations! The acters carve out a special comedy niche that will not be easily forgotten. They operate like a well-oiled machine with perfect comedic timing and a contagious form of winning camaraderie. The clever lines of...",
      "author": "Keith Cohen"
    },
    {
      "text": "It's all very close to being offensive, but as the joke's on the Americans, the film gets away with it.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "a lazy excrescence",
      "author": "Andrea Chase"
    },
    {
      "text": "Adheres to the old maxim \"if it ain't broke, don't fix it,\" yet somehow manages to break it while not fixing it.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "The things that worked best about the first movie still work... while the things that were worst have become even more grating.",
      "author": "Tim Brayton"
    },
    {
      "text": "Is it as brilliant as No. 1? No. How could it be? But Hangover Deux still provides lots of fun laughs, and there's more Zach Galifianakis' twisted Alan. This is good.",
      "author": "Clint O'Connor"
    },
    {
      "text": "You could literally smash yourself in the face with a frying pan, stumble into this movie and mistake it for the original... almost.",
      "author": "Kevin Carr"
    },
    {
      "text": "It's really pretty simple: If you laughed at the first \"The Hangover,\" you will most assuredly laugh at \"The Hangover Part II.\"",
      "author": "Mathew DeKinder"
    },
    {
      "text": "It just might be the worst sequel ever to a really good movie.",
      "author": "Michael Smith"
    },
    {
      "text": "Are we really so immature and/or penis-averse we have to shriek like middle schoolers every time one...pops up?",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "Think of it as a decent high school football player who suffers from having an older brother who was all-state two years earlier.",
      "author": "Ben Mankiewicz"
    },
    {
      "text": "At least it's not in 3D.",
      "author": "Rob Vaux"
    },
    {
      "text": "The Hangover Part II feels like the fifth or sixth installment in the franchise. It's that out of fresh ideas.",
      "author": "Christian Toto"
    },
    {
      "text": "I am not going to deny The Hangover Part II follows the same blueprint as the first film, but, to be honest, it didn't bother me one bit. The reason? I was too busy laughing to care.",
      "author": "Adam Tobias"
    },
    {
      "text": "The missing person, the seamy urban setting, the gradual accretion of clues: The Hangover films are, essentially, hard-boiled crime stories spun into comic depravity.",
      "author": "Christopher Orr"
    },
    {
      "text": "Maybe every wild party boy has a deep-seeded inner queer.",
      "author": "Rob Humanick"
    },
    {
      "text": "...director Todd Phillips wrongly seems to think he can solve any problem with more mayhem. How about better jokes instead?",
      "author": "Corey Hall"
    },
    {
      "text": "It delivers what you'd expect from the team that brought you the first film but nothing new... unless you think a monkey smoking and Thai trannies are something new and exciting.",
      "author": "Beth Accomando"
    },
    {
      "text": "The Hangover Part II falls into the greatest trap of the comedy sequel: assuming the audience wants the exact same thing, but even more so.",
      "author": "Matthew Razak"
    },
    {
      "text": "There are plenty of déjà vu moments,...but before you know it, Phillips yanks you in an entirely unexpected direction, continually ramping up the stakes, the raunch and the visceral humor.",
      "author": "Alison Gang"
    },
    {
      "text": "One could easily mistake this supposed blockbuster for a mockbuster. After all, it was co-written by one of the scribblers of the Scary Movie series.",
      "author": "Anders Wotzke"
    },
    {
      "text": "...makes an excellent companion piece to the original...",
      "author": "Bill Gibron"
    },
    {
      "text": "To paraphrase statements from the characters: we've done it again doesn't do it again.",
      "author": "Gary Wolcott"
    },
    {
      "text": "About halfway through, Galifianakis wails, \"I just wanted things to say the same!\" If Warner Brothers were being completely honest, that'd be 'The Hangover Part II''s ad line.",
      "author": "Jason Bailey"
    },
    {
      "text": "I can't dismiss the ugliness behind many of its antics.",
      "author": "Peter Rainer"
    },
    {
      "text": "It's the same movie, just with different details plopped in place of the previous ones.",
      "author": "Grae Drake"
    },
    {
      "text": "Director Phillips whips along proceedings at break-neck speed, perhaps in the hope that we won't notice how all the quirks we loved the first time are nothing like as funny the second time",
      "author": "Anthony Quinn"
    },
    {
      "text": "I laughed all the way through it, just like I laughed all the way through the first one.",
      "author": "Dave White"
    },
    {
      "text": "The terrific idea behind the first one -- a mystery story based around a night of total debauchery -- has no more shock.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "The Hangover Part II gets considerable mileage out of following precisely the same structure as the first film.",
      "author": "Norman Wilner"
    },
    {
      "text": "How much you'll go for it depends on whether, like our beleaguered comrades, you partake in a tipple before seeing it...",
      "author": "Shaun Munro"
    },
    {
      "text": "I can't believe how precisely everything does happen again, except that what was fresh and surprising in Las Vegas turns rancid and predictable in Bangkok, where yet another wedding is scheduled to take place.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "It's not with a sense of delight that you realise you're on exactly the same ride again but with dawning dismay.",
      "author": "Derek Malcolm"
    },
    {
      "text": "The more rational characters have lost any redeeming qualities and this makes the film hard to watch - for all the wrong reasons.",
      "author": "Alex Zane"
    },
    {
      "text": "Best watched drunk - that way you might awake with no memory of the experience.",
      "author": "David Edwards"
    },
    {
      "text": "A tasteless, preposterous and ultimately pointless tale of east meets west which lurches from one improbable set piece to the next including the bizarre concealment of a dead body and a high-speed car chase.",
      "author": "Catherine Jones"
    },
    {
      "text": "Every time a character in this follow-up groans \"I can't believe this is happening again\", you can only nod forlornly in agreement.",
      "author": "Matt Neal"
    },
    {
      "text": "Business and creative people go together as well as fine wine at a burger joint. For this sequel, the brass beat out the artists and afford us the double-edged sword of the same exact formula from two years ago.",
      "author": "Adam Fendelman"
    },
    {
      "text": "[VIDEO] The formula mold that worked so well the first time around loses some steam in this follow up to the most successful R-rated movie",
      "author": "Cole Smithey"
    },
    {
      "text": "Despite a few slow patches, it is loaded with gut-busting laughs. After its much brainier predecessor, though, it feels like a well-meaning kid forced to follow in the footsteps of his genius older sibling.",
      "author": "Christopher Lloyd"
    },
    {
      "text": "There are a lot of things to dislike about this derivative sequel, but at the top of the list is its appalling vulgarity, which crossed the line the first avoided.",
      "author": "Tony Medley"
    },
    {
      "text": "Directed, like the wildly successful first film, by Todd Phillips, it airlifts the original characters, premise, and story structure out of Vegas and plonks them down in Bangkok in near-identical form, save for a few instances of ante-upping.",
      "author": "Dana Stevens"
    },
    {
      "text": "It's a tribute to the filmmakers, particularly director and co-writer Todd Phillips, that the best way to approach The Hangover Part II is to talk about what it isn't. It isn't a typical sequel, either a watered-down encore or a muddled [extension].",
      "author": "Tom Maurstad"
    },
    {
      "text": "The Hangover Part II is the worst sequel of all time.",
      "author": "Christopher Tookey"
    },
    {
      "text": "Whereas The Hangover was borderline outrageous as it stacked one mesmerizing vulgarity atop the next, this second exercise in bad manners (presumably of four) feels rote in comparison.",
      "author": "Marc Savlov"
    },
    {
      "text": "Those who enjoyed The Hangover for its gross out insanity will appreciate this film, and it is possessed of a stronger ending than its predecessor, however anyone looking for novelty or a fresh take will be disappointed.",
      "author": "Giles Hardie"
    },
    {
      "text": "The premise and the execution are numbingly familiar, and what was funny and unexpected about a guys-bonding-under-pressure movie the first time around becomes: ''Are they kidding? Again?''",
      "author": "Philippa Hawker"
    },
    {
      "text": "It's not that \"Hangover II\" is a notably bad movie. It's more that nothing in it seems to justify all the effort spent to add a new but nearly identical series of episodes to the original.",
      "author": "Shawn Levy"
    },
    {
      "text": "The Hangover Part II is, for the most part, an exceedingly hacky comedy.",
      "author": "Alonso Duralde"
    },
    {
      "text": "This buzz-kill follow-up suffers from a pervasive sense of been there, drunk that.",
      "author": "Matt Stevens"
    },
    {
      "text": "Such is the genius of the original movie, it still feels fresh in carbon copy form with some more end credits guaranteed to have anyone who has just popped a boiled sweet in danger of laughing themselves to death.",
      "author": "Graham Young"
    },
    {
      "text": "Shifts to Bangkok for a few laughs and a whole lot of desperation.",
      "author": "Robert Denerstein"
    },
    {
      "text": "May be a rehash, but it's a funny rehash.",
      "author": "Chris Bumbray"
    },
    {
      "text": "One of the most uninspired and unoriginal sequels you'll ever see. Or not see, if you're lucky.",
      "author": "Richard Roeper"
    },
    {
      "text": "Phillips and his co-writers, Craig Mazin and Scot Armstrong, seem to have launched into this project with a misguided faith in their own brilliance, but nothing resembling an idea or a story.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "The filmmakers can't recapture the original's novelty or freshness, so they up the raunch level considerably; the matter-of-factness of the transsexual and gay-panic jokes is almost progressive.",
      "author": "Nathan Rabin"
    },
    {
      "text": "If The Hangover gave you hope for Hollywood - yup, there is some creativity and boldness left - The Hangover Part II sinks it.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "Raunchy comedy sequel is cruder, less funny, than original.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "The Hangover made the actors A-list Hollywood stars. But despite the indisputable talent of this cast, The Hangover Part II doesn't deliver the same zany punch of its predecessor.",
      "author": "Gayle MacDonald"
    },
    {
      "text": "Pushing the envelope farther and making this more crass didn't increase the funny.",
      "author": "Vic Holtreman"
    },
    {
      "text": "As much as the original \"Hangover\" was fresh and funny, \"The Hangover Part II\" is just stale and painful.",
      "author": "David Kaplan"
    },
    {
      "text": "Maybe what goes on in Vegas really should stay in Vegas.",
      "author": "Tom Long"
    },
    {
      "text": "Alas, this time there are about three or four mild laughs in the whole picture, and the entire visual aspect of the movie is a botched disappointment.",
      "author": "Mick LaSalle"
    },
    {
      "text": "It follows the same essential pattern as its predecessor, but the ingenious loopiness is gone; the mechanism behind it grinds instead of whirrs.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "This is a faded copy of its predecessor, only raunchier (if you can imagine) and with better scenery.",
      "author": "Loey Lockerby"
    },
    {
      "text": "Somebody must have roofied me. I left The Hangover Part II feeling dazed and abused, wondering how bad things happened to such a good comedy.",
      "author": "Peter Travers"
    },
    {
      "text": "Sluggish, erratic attempt to duplicate the first, better movie.",
      "author": "Rich Heldenfels"
    },
    {
      "text": "\"The Hangover Part II\" is such a complete copy of the original 2009 hit comedy that I'd be surprised if the writers even bothered to create a new Microsoft Word file when they wrote it.",
      "author": "Rob Thomas"
    },
    {
      "text": "If there's such thing as plagiarizing your own work, Hangover Part II is the best example. Also, for those folks who drink to get plastered, fist pump at the club, splurge on a hooker and say racial epithets for fun - you've finally found your franchise!",
      "author": "Clay Cane"
    },
    {
      "text": "We all enjoyed ourselves during that first movie. But now ... well, the hangover has begun.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "According to Phillips, the 'Part II' in the title is a nod to the second Godfather, which matched the genius of its forerunner. Ironically, his own sequel offer is one you should refuse.",
      "author": "Nick De Semlyen"
    },
    {
      "text": "Loud, dumb, occasionally obnoxious but truly, unashamedly hilarious.",
      "author": "Matt Bochenski"
    },
    {
      "text": "Oh, what a headache-inducing, unapologetic money grab we have in \"The Hangover Part II.\"",
      "author": "Betsy Sharkey"
    },
    {
      "text": "Stu, Alan and Phil are likely to remain America's favorite penitents, and there's still some (though not as much) humor in their pain.",
      "author": "Gary Thompson"
    },
    {
      "text": "It might not be great or legendary, but you are going to laugh.",
      "author": "Willie Waffle"
    },
    {
      "text": "If director Todd Phillips used the first movie to see how far he could push the envelope, this one licks and seals it.",
      "author": "Steve Persall"
    },
    {
      "text": "Painfully unfunny sequel that desperately tries to recapture the magic formula of the original film with increasingly tedious results.",
      "author": "Matthew Turner"
    },
    {
      "text": "Film-makers Todd Phillips and co make no apologies for being creatures of habit and sticking to what worked for them before.",
      "author": "Lisa Giles-Keddie"
    },
    {
      "text": "Part II has too many over-the-top moments that pull back the curtain and remind viewers that nothing we're seeing could ever really happen. What's left are some big laughs but little genuine pathos.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Tasteless, pointless, tactless and pretty much anything else you care to stick the '-less' suffix on.",
      "author": "Charlie Lyne"
    },
    {
      "text": "Darker and more desperate than the previous go-round, this one might have done better just to sleep it off.",
      "author": "Peter Keough"
    },
    {
      "text": "While these characters were amusing the first time around, Phillips and his screenwriters don't bring much new to the party.",
      "author": "Carrie Rickey"
    },
    {
      "text": "Less a hangover and more a mild irritation.",
      "author": "Tim Evans"
    },
    {
      "text": "For all the talent Hangover II reassembles, our boys just can't muster the hair of the dog that bit them the first time around.",
      "author": "Scott Bowles"
    },
    {
      "text": "Proving that 2009's The Hangover was a fluke, this sequel returns to filmmaker Todd Phillips' more usual mean-spirited style",
      "author": "Rich Cline"
    },
    {
      "text": "The guys could make 12 more of these movies, do just as well every time and get audiences to laugh and laugh at themselves for laughing. That's a lot of laughing, and that's The Hangover: Part II.",
      "author": "Phil Villarreal"
    },
    {
      "text": "Although the production went all the way to Thailand, the comedy never ventures far from what worked in Vegas.",
      "author": "Rebecca Murray"
    },
    {
      "text": "It falls into the classic trap for sequels made primarily to cash in on the unexpected success of a movie: tell the same story again, only louder.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "It's dumb, yeah, and hugely indefensible, but The Hangover Part II's also a specific vision of bliss.",
      "author": "Walter Chaw"
    },
    {
      "text": "Phillips has no sense of comic energy, relying instead on the actors ratcheting up their characters' hateful traits to 11.",
      "author": "Mark Dujsik"
    },
    {
      "text": "...on the whole the movie is depressing. That's right, a big studio R-rated summer comedy followup to the biggest R-rated comedy of all time is depressing.",
      "author": "Laura Clifford"
    },
    {
      "text": "Whereas the original had the wonderful epiphany of watching a comedy that actually didn't suck, The Hangover Part II sticks strictly to its own formula - and to a fault.",
      "author": "Bill Clark"
    },
    {
      "text": "The Hangover Part II revels in its wickedness, and encourages viewers to do so as well. It's kind of infectious. Just because you like it, doesn't mean you have to feel good about it.",
      "author": "Simon Miraudo"
    },
    {
      "text": "The Hangover Part II isn't nearly as fresh or as funny as the original, [but] it still gets plenty of good mileage out of what is essentially the exact same joke.",
      "author": "Jason Zingale"
    },
    {
      "text": "If you want to avoid plot spoilers for The Hangover Part II, don't watch The Hangover.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The result is a cinematic illustration of the law of diminishing returns, in which more money, more exotic locales, more crazy situations and more Mike Tyson all fuel a familiar carnival of abasement.",
      "author": "Ian Buckwalter"
    },
    {
      "text": "Phillips seems to be relying all too heavily on the idea that we just want to see the first movie again. (We can do that. At home. For a lot less money.)",
      "author": "Moira MacDonald"
    },
    {
      "text": "The action is fast, the gags are plentiful - and many actually are funny if you check your squeamishness at the door.",
      "author": "Sue Pierman"
    },
    {
      "text": "Using the original as a template, The Hangover Part II colors within the lines, but does so with bright fluorescents rather than drab primaries.",
      "author": "James Berardinelli"
    },
    {
      "text": "We don't know what's more bizarre: Phillips' sensibility, or how he avoided an NC-17. We profit (mostly) unscathed.",
      "author": "Matthew Sorrento"
    },
    {
      "text": "If the first film was \"The Godfather\" of comedies I'd have to call this once \"The Godfather Part II.\"",
      "author": "Michael A. Smith"
    },
    {
      "text": "The movie's an unclean thing and a mostly unfunny one.",
      "author": "Ty Burr"
    },
    {
      "text": "Less a sequel than a remake, The Hangover Part II brings the wedding smashers to Bangkok with more outrageousness but diminishing returns. Still, initial grosses will be explosive.",
      "author": "Kevin Lally"
    },
    {
      "text": "Not rotten - just not fresh - following its own raunchy, shenanigan-filled formula.",
      "author": "Susan Granger"
    },
    {
      "text": "Sure, it has some scattered big are-you-kidding? laughs, but could they have at least pretended that they weren't making the exact same movie?",
      "author": "Matt Soergel"
    },
    {
      "text": "Bangkok may be bigger, sexier, sleazier than Vegas, but this sequel feels tired and cautious. Ed Helms does everything he can to make a not very funny film work.",
      "author": "Caryn James"
    },
    {
      "text": "There's no simply no way to connect with this film on a story basis.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "Copies the original so slavishly that it's the equivalent of a big-screen rerun.",
      "author": "Frank Swietek"
    },
    {
      "text": "If you superimposed a diagram that mapped out all the narrative beats, characters and jokes in \"The Hangover Part II\" over one for \"The Hangover,\" the two would align almost perfectly.",
      "author": "Manohla Dargis"
    },
    {
      "text": "The Hangover Part II never makes a convincing argument for its existence, but it works exactly as much as it has to in order to not be a bad movie.",
      "author": "Devin Faraci"
    },
    {
      "text": "Part II is everything the first movie was, and less. It's crucially missing laughs and intelligence.",
      "author": "Peter Howell"
    },
    {
      "text": "The sequel turns not dark but revoltingly cruel.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "It would be nice if Phillips could find something original to say when we all get together to tear the next town apart.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "The Hangover Part II is what the label says: another day in which you sit there with blurred vision and a headache wondering how you came to be in the same room as several dozen other people debauched by Hollywood.",
      "author": "Nigel Andrews"
    },
    {
      "text": "A severe bout of sequelitis afflicts this eagerly awaited but only sporadically amusing follow-up, which changes the locale from Las Vegas to Bangkok, but keeps the formula intact.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "It's no fun to report that this one is so perfunctory, so deeply routine even as it struggles to feel unhinged.",
      "author": "Drew McWeeny"
    },
    {
      "text": "I need jokes. Something more than a situation recycling the situation in the first one. I'd like filmmakers who, worldwide grosses aside, show more of an interest in filming visual comedy -- gross-out, violent, action-based, whatever -- with some finesse.",
      "author": "Michael Phillips"
    },
    {
      "text": "It's still fun to watch, but the first one was better.",
      "author": "J. R. Jones"
    },
    {
      "text": "Mistaking meanness for edge, borderline racism for irreverence and disregard for women as 'boys will be boys' solidarity, this 'Part II' is as horrifying as a 'Saw' sequel, but with fewer laughs.",
      "author": "John Beifuss"
    },
    {
      "text": "Most of the laughs go down easily. Most.",
      "author": "Mary F. Pols"
    },
    {
      "text": "A veritable textbook case of what not to do when re-making a comedy that depended on sheer surprise for most of its appeal.",
      "author": "Ann Hornaday"
    },
    {
      "text": "Telling a bad joke twice doesn't mean it was any good the first time.",
      "author": "Armond White"
    },
    {
      "text": "If you enjoyed the first one, I bet you'll enjoy this one. But a little less.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Despite all the similarities, despite the same madcap plotting and hysterically unhinged comic filth, The Hangover Part II veers into much darker territory.",
      "author": "Amy Biancolli"
    },
    {
      "text": "The Hangover Part 2 definitely has its moments and a few big laughs throughout, but the most memorable thing about this second substance-induced amnesia comedy is how ultimately forgettable it is.",
      "author": "Jim Vejvoda"
    },
    {
      "text": "Though it hews to the template of the original, director Todd Phillips has one strategy to fall back on: Upping the ante.",
      "author": "Kevin Williamson"
    },
    {
      "text": "Just laziness with an active passport, employing an exotic locale to cover the moldy odor of a rehash. There are laughs to be had, but one must suffer through a disheartening display of déjà vu to find them.",
      "author": "Brian Orndorf"
    },
    {
      "text": "As to whether the whole thing works, yes and no. Galifianakis, I think, has definitely overextended his repertoire, but Cooper and Helms still engage, mainly because they are so good at sustaining their hysteria. Cooper is especially consistent.",
      "author": "Sandra Hall"
    },
    {
      "text": "What can be believed as reliable word-of-mouth is that The Hangover Part II will not leave fans with a sore head or a sorry frame of mind.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "A colossal disappointment, The term dialed-in should be replaced with The Hangover 2.",
      "author": "Julian Roman"
    },
    {
      "text": "We've been on this bender before, and no matter how raunchy and un-PC The Hangover Part II is, there's no disguising that this is just warmed-up leftovers that will leave a nasty taste in your mouth.",
      "author": "Randy Myers"
    },
    {
      "text": "The spirit is meaner, and the tone is much darker -- both of which zap the vibe of what made the original film so much fun in the first place.",
      "author": "Scott A. Mantz"
    },
    {
      "text": "Wastrels think the formula for a hangover is the hair of the dog, but this flaccid follow-up to the hit comedy expects us to swallow the entire rotting carcass.",
      "author": "Joe Williams"
    },
    {
      "text": "This isn't even really a sequel to the hilarious 2009 comedy smash set in Las Vegas. It's virtually the same movie, just transferred to another continent and with the raunch wildly amped up.",
      "author": "Randy Cordova"
    },
    {
      "text": "Now that we know them, the core characters are all the funnier; they've become an American suburban version of the Three Stooges.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "Trade out Las Vegas for Bangkok, a tiger for a monkey, a lactating hooker for a trannie stripper, a missing tooth for a face tattoo, and you've got Todd Phillips's rote, dispiriting replica of his own surprise smash hit.",
      "author": "Eric Hynes"
    },
    {
      "text": "The laughs may be fewer and the gasps more \"ewww\" than \"wow,\" but there is still some pleasure in seeing those guys suffer.",
      "author": "Nell Minow"
    },
    {
      "text": "As the film goes on its dull, dim-brained, slapdash way, there isn't a solitary laugh in sight. Not one. A person couldn't write worse jokes if he or she tried.",
      "author": "Dustin Putman"
    },
    {
      "text": "You already paid for and saw this film two years ago. Though, the version you saw then was a thousand times better. Beyond disappointing!",
      "author": "Kevin McCarthy"
    },
    {
      "text": "The equivalent of a drunk college student waking up the morning their book report is due and desperately trying to remember what they saw in the crappy movie version.",
      "author": "Erik Childress"
    },
    {
      "text": "...[it] sacrifices plausibility, believability and empathy with anything that doesn't validate its lead characters' 'Wolf Pack' mentality in the service of a smirkingly cynical attitude.",
      "author": "Glenn Kenny"
    },
    {
      "text": "Every time Phillips pushed his undoubtedly formulaic sequel down yet another squalid alley for the sake of a shocking joke, I grew to appreciate, respect and even love \"The Hangover Part II.\"",
      "author": "Sean O'Connell"
    },
    {
      "text": "Well, it's not as good as the original movie. It is darker and harsher in tone and the comedy is more cruel. It's also cruder.",
      "author": "Marc Lee"
    },
    {
      "text": "It tries to tell the same story again, with slight variations and bigger, louder, raunchier jokes and action. More, as it often does, turns out to be less.",
      "author": "Marshall Fine"
    },
    {
      "text": "Todd Phillips directs with increased confidence, but in every respect, The Hangover Part II is a cowardly cash-in, devoid of novelty or daring.",
      "author": "Nick Schager"
    },
    {
      "text": "It's amazing how fast a fresh comedy idea can go stale.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "The unexpectedly wonderful thing about this sequel is that it actually improves on the jokes.",
      "author": "Joshua Rothkopf"
    },
    {
      "text": "Stranger, funnier. This is male bonding through f'd-up adversity, compared to what previously felt like acquaintances drunkenly coming to terms with their own simmering anger.",
      "author": "Matt Pais"
    },
    {
      "text": "Your head hurts like hell, the whole thing feels horribly familiar, and it's just not funny any more. Can this really be happening again?",
      "author": "Nigel Floyd"
    },
    {
      "text": "I have the sad duty to report I found this more elaborate, play-it-safe sequel far less fresh or funny.",
      "author": "Lou Lumenick"
    },
    {
      "text": "The MPAA's elaboration of the film's R rating says the movie has \"pervasive language, strong sexual content including graphic nudity, drug use and brief violent images.\" Also other stuff. Maybe their space was limited.",
      "author": "Roger Ebert"
    },
    {
      "text": "Can't justify essentially reenacting, beat for beat, the plot of its predecessor.",
      "author": "Josh Bell"
    },
    {
      "text": "So closely mirrors its blockbuster predecessor in every vital aspect that it can scarcely claim the right to call itself a sequel.",
      "author": "Thomas Leupp"
    },
    {
      "text": "A soulless and badly unfunny retread of everything that worked the first time.",
      "author": "Katey Rich"
    },
    {
      "text": "The actors are having a great time with unfunny, repetitious dialogue.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "Essentially, it's Ocean's 12 ... if a monkey stole the movie.",
      "author": "Edward Douglas"
    },
    {
      "text": "A huge disappointment. Not funny.",
      "author": "Victoria Alexander"
    },
    {
      "text": "In this world of give-'em-what-they-want, the team behind the 2009 comedy hit has reconvened to try and do just that. Too bad it doesn't work.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Just like the memory of the wolf pack's big night out in Thailand, funny jokes seemed to have simply slipped the filmmakers' minds.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "While not quite in the league of, say, The Empire Strikes Back or the film that it amusingly references with its title, The Godfather Part II, The Hangover Part II really is a sequel to savour... right to the bottom of the bottle.",
      "author": "Erin Free"
    },
    {
      "text": "The Hangover: Part II feels more like a Bangkok tourism project pitched at rapey frat boys.",
      "author": "Paul Verhoeven"
    },
    {
      "text": "A film that seems to have been written mainly with the find and replace function on Microsoft Word.",
      "author": "Robbie Collin"
    },
    {
      "text": "The sequel has some mildly amusing moments, but it has a slapdash quality to it, and at 102 minutes, it feels padded.",
      "author": "Emanuel Levy"
    },
    {
      "text": "Triggers fewer belly laughs-per-minute than the original, yet nevertheless generates more than enough yucks to satisfy fans of the gross-out genre.",
      "author": "Kam Williams"
    },
    {
      "text": "Sticking with the same winning formula, Phillips has made a near carbon copy of the original. This makes it less surprising but still entertaining.",
      "author": "Matthew Toomey"
    },
    {
      "text": "There are guffaws of rude comedic shock and there are hair raising incidents, but it still feels like a poor sequel.",
      "author": "Andrew L. Urban"
    },
    {
      "text": "A monkey drug mule, a monk with a vow of silence, trans-sexual, Russian thugs, a kidnapping and a cut off finger are some of the disparate elements of this highly anticipated sequel, which sadly is only a pale imitation of the very funny original",
      "author": "Louise Keller"
    },
    {
      "text": "Its sense of fun-loving camaraderie feels forced and tinged with buzz-killing danger.",
      "author": "John P. McCarthy"
    },
    {
      "text": "Giving the people what they want is one thing. Making nearly the exact same movie a second time, but shifting the setting to Thailand, is just ... what, lazy? Arrogant? Maybe a combination of the two.",
      "author": "Christy Lemire"
    },
    {
      "text": "The stock dismissal \"more of the same\" has rarely been more accurately applied to a sequel than to The Hangover Part II, which ranks as little more than a faded copy of its predecessor superimposed on a more brightly colored background.",
      "author": "Andrew Barker"
    },
    {
      "text": "What happens in Bangkok isn't as much fun as when it happened in Vegas, but it's still worth the trip.",
      "author": "Michael Rechtshaffen"
    },
    {
      "text": "Darker and meaner than the original but just as funny and horrifying.",
      "author": "Jane Crowther"
    }
  ],
  "release_year": 2011,
  "duration": 102,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Two years after the disastrous events in Las Vegas, it is now Stu's (Ed Helms) turn to walk down the aisle. Since his bride is from Thailand, Stu decides to hold the wedding there. Desperately hoping to avoid the mayhem of Doug's (Justin Bartha) bachelor party, Stu chooses what he thinks will be a safe option: an alcohol-free, prewedding brunch. But this being Thailand, and with Phil (Bradley Cooper) and Alan (Zach Galifianakis) again in attendance, anything can happen.",
  "popularity": 5.2,
  "poster_url": "https://image.tmdb.org/t/p/original/7sGkjqorTHkaHTz8Q4WWHj8JL9t.jpg"
}