{
  "movie_name": "The Fifth Element",
  "movie_id": "fifth_element",
  "total_reviews": 63,
  "reviews": [
    {
      "text": "Released in 1997, it's remarkable how well Luc Besson's The Fifth Element still holds up, nearly three decades after its initial release.",
      "author": "Thomas Lethbridge"
    },
    {
      "text": "As irresistible—if occasionally annoying—popcorn-munching escapism, The Fifth Element remains an experience of diversionary entertainment, and almost exclusively about rehashing previously explored surfaces with a new sheen.",
      "author": "Brian Eggert"
    },
    {
      "text": "A sci-fi film a million aesthetic miles away from the industrial dystopias, dusty wastelands, and sterile starships of most screen SF of the time.",
      "author": "Travis Johnson"
    },
    {
      "text": "...a distinctive Moebius-inspired gumbo that's easy to enjoy...",
      "author": "Eddie Harrison"
    },
    {
      "text": "Visionary filmmaker Luc Besson manages to create several of the most exotic and original characters for this magnum opus of sensory outlandishness.",
      "author": "Mike Massie"
    },
    {
      "text": "The brains behind The Fifth Element would have been better off adding a sixth element - common sense - to the plot, and allowing it to form a bridge between the film's fantastic visual appeal and its ramshackle plot.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The Fifth Element is a bold, bright, loud, rowdy, lush, extravagant science fiction space opera that wears its heart on its garish sleeve.",
      "author": "Ed Travis"
    },
    {
      "text": "Aside from Besson's impressive directorial panache, always providing something eye-catching and original to look at...there is little else about The Fifth Element that is particularly noteworthy.",
      "author": "Zaki Hasan"
    },
    {
      "text": "It fuses slapstick with screwball comedy in brilliant ways, and appreciates the necessity of levity when considering heavy themes.",
      "author": "Glenn Heath Jr."
    },
    {
      "text": "Narratively challenged, visually monotonous and aurally overpowering, The Fifth Element is a staggering accretion of all the wrong elements and some rather dopey ones as well.",
      "author": "Duane Byrge"
    },
    {
      "text": "Even 20 years on, The Fifth Element hasn't lost very much of its ability to thoroughly confound and dazzle.",
      "author": "Tim Brayton"
    },
    {
      "text": "The Fifth Element has enough eye-appeal for two good movies.",
      "author": "Gene Siskel"
    },
    {
      "text": "Luc Besson's The Fifth Element is a dazzling, funny, and exciting sci-fi actioner that features unforgettable characters and a thrilling story, making this one of the most underrated science-fiction classics around.",
      "author": "Jeff Beck"
    },
    {
      "text": "A jaw-dropping, mind-blowing pop epic that gives you everything from the slam-bang sci-fi fantasy of Star Wars to the inspired slapstick lunacy of The Marx Brothers",
      "author": "Joe Leydon"
    },
    {
      "text": "In this movie and many like it, the only elements that count are impact, impact, impact and impact. The fifth element is gibberish.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Loud, long, and overwhelming...",
      "author": "David Nusair"
    },
    {
      "text": "Stylish and very violent sci-fi action flick.",
      "author": "Carly Kocurek"
    },
    {
      "text": "Pure eye-candy and a rollicking good-time.",
      "author": "Scott Nash"
    },
    {
      "text": "A hodgepodge of elements that don't comfortably coalesce.",
      "author": "Todd McCarthy"
    },
    {
      "text": "It's a triumph of form over content, but it's a stunning triumph.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "I knew where it was going at all times, but the ride was excellent.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Besson's futuristic fable is flawed by a messy narrative which strains to incorporate far too many grotesque and eccentric characters.",
      "author": "Geoff Andrew"
    },
    {
      "text": "The story is such a cut-rate kid's sci-fi fairy tale that at one point Evil actually calls Gary Oldman on the phone (and it isn't played for laughs).",
      "author": "Jimmy Chertkow"
    },
    {
      "text": "Besson has done a solid, if not outstanding, job in bringing his story, written as a teenager, to the big screen.",
      "author": "Robin Clifford"
    },
    {
      "text": "This gonzo sci-fi outing proves to be a messy amalgam -- a motion picture with the body of a mainstream blockbuster but the spirit of a trendy cult flick. And yet, for all its narrative incoherencies, visual excesses and shifting moods, the movie works.",
      "author": "Matt Brunson"
    },
    {
      "text": "The special effects provided Besson with the tools to provide the movie with the spectacular images, displaying the eagerness of a child in a candy store.",
      "author": "Dragan Antulov"
    },
    {
      "text": "It's cyberpunk!",
      "author": "Dennis Schwartz"
    },
    {
      "text": "Everything from the visual effects to the costume design seems to shout out like a precocious child: \"Look at me!\"",
      "author": "Brian Mckay"
    },
    {
      "text": "The best-looking science fiction movie to come out in years, with fabulous sets, costumes and special effects, but its plot doesn't quite measure up to its appearance.",
      "author": "Robert Roten"
    },
    {
      "text": "Fifth Element doesn't reach the level of great sci-fi to which it clearly aspires because it has too many characters doing too many things for too few reasons. Still, it's a lot of fun.",
      "author": "Margaret A. McGurk"
    },
    {
      "text": "Slam-dunk sci-fi extravaganza.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The Fifth Element has to be the most creative visualization since Tim Burton's first Batman in 1989. On top of that, it's a whole lot of fun.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The film's most basic conceit -- that there is an anti-life that, despite its nature, can have a desire and can operate physically in this universe, using its elements -- is not only never explained, it can't be.",
      "author": "Kim Williamson"
    },
    {
      "text": "The pace is perfect, the combination of international casting superb and the cinematography sublime.",
      "author": "Leslie Rigoulot"
    },
    {
      "text": "Boring and idiotic",
      "author": "Christopher Null"
    },
    {
      "text": "(In Sony's new Superbit DVD format) picture and sound unite to create a unique three-dimensional fantasy world.",
      "author": "John J. Puccio"
    },
    {
      "text": "Bruce Willis is good in an average role, Milla Jovovich is acceptable in a terrible role, but as ever Gary Oldman is terrific in how he seems to find just the right note for the film and threatens to take it over.",
      "author": "William Gallagher"
    },
    {
      "text": "What an exhilarating, visual feast is Luc Besson's The Fifth Element. And what a mess.",
      "author": "James Kendrick"
    },
    {
      "text": "There's no doubt about it, when it comes to saving the world, Bruce Willis is your man. He does it with smarts and style, humor and courage.",
      "author": "Kevin Thomas"
    },
    {
      "text": "Don't read the rest of this review until after you've seen the film and don't let your friends tell you about the movie. Just go and enjoy the most spectacular piece of mindless eye candy to come along in years.",
      "author": "Edward Johnson-Ott"
    },
    {
      "text": "One of the great goofy movies -- a film so preposterous I wasn't surprised to discover it was written by a teenage boy.",
      "author": "Roger Ebert"
    },
    {
      "text": "Willis shines in these roles, as the unlikely hero, who saves the day, or as in this case, saves the world.",
      "author": "Urban Cinefile Critics"
    },
    {
      "text": "These kinds of attitude are really getting old. If you're gonna be a pig, at least be original about it.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "A lot of money was spent on this film, but $100 million doesn't guarantee a good product. Maybe someone should have thought of spending a few more dollars on a better script.",
      "author": "James Berardinelli"
    },
    {
      "text": "A highly involving and mesmerizing film.",
      "author": "Steve Rhodes"
    },
    {
      "text": "I hate to suggest that viewers should check their brains at the door to enjoy a movie, but I'm afraid that sentiment serves both as a warning and a recommendation where The Fifth Element is concerned.",
      "author": "Bryant Frazer"
    },
    {
      "text": "An eye-popping, exciting, comic bookish, sensory overload experience.",
      "author": "Rob Blackwelder"
    },
    {
      "text": "An overblown cosmic comic book.",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "It sounds like a big confused jumble, but actually it has its own internal consistency and look. It is almost immediately engaging and engrossing.",
      "author": "Marty Mapes"
    },
    {
      "text": "After doing much to reduce French cinema to a second-rate clone of bad Hollywood, Besson is seeking to expand to America.",
      "author": "Peter Keough"
    },
    {
      "text": "The Fifth Element actually feels like it was scripted by a daydreaming teenager, but in a good way; that is to say, there's a certain \"gosh, wow\" sense of wonder to the whole thing that echoes the completely unique universes of George Lucas and company.",
      "author": "Marc Savlov"
    },
    {
      "text": "Director Besson keeps the action moving fast enough to satisfy any action movie junkie.",
      "author": "James O'Ehley"
    },
    {
      "text": "The film just takes off from the first slow frame and by the end, you're going \"Wow!\"",
      "author": "Ted Prigge"
    },
    {
      "text": "Besson surrounds his colorful characters and eccentric myths with a world of incredibly detailed richness. He fills every inch of every frame with imagination.",
      "author": "Jack Garner"
    },
    {
      "text": "The world that director Luc Besson has created is original and breathtaking. In fact, it is almost worth the admission for the eye-candy alone.",
      "author": "Madeleine Williams"
    },
    {
      "text": "For the most part, it's a nice goofy E-Ticket ride.",
      "author": "Widgett Walls"
    },
    {
      "text": "His enthusiasm for this project is so pervasive that you can't help share his sense of enjoyment",
      "author": "Shane Burridge"
    },
    {
      "text": "Rarely does a filmmaker's original vision come to the screen in all its audacious, undiluted glory.",
      "author": "Michael Dequina"
    },
    {
      "text": "While the logic of the storyline leaves a lot to be desired, \"The Fifth Element\" satisfies as sheer spectacle.",
      "author": "David N. Butterworth"
    },
    {
      "text": "Things happen for the sake of a momentary laugh or gasp rather than for the creation of the film's internal universe. It's not a specific future; it's The Future, impressive but generic.",
      "author": "Scott Renshaw"
    },
    {
      "text": "This is a prodigious something. It's just difficult to say whether that something is good or evil.",
      "author": "Barbara Shulgasser"
    },
    {
      "text": "Mr. Besson directs with ceaseless flamboyance and with an obvious enthusiasm for his film's comic book conceits. But the tone of The Fifth Element is often terribly shrill, especially when attention shifts to grating minor characters.",
      "author": "Janet Maslin"
    },
    {
      "text": "As you sit through the interminable two-hours-plus that constitute The Fifth Element -- a colossally stupid, overbearingly pompous new movie by Luc Besson -- you can expect to become acquainted with boredom on the most elemental level.",
      "author": "Scott Rosenberg"
    }
  ],
  "release_year": 1997,
  "duration": 127,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action",
    "Fantasy"
  ],
  "age_rating": "PG-13",
  "synopsis": "The Earth is about to be destroyed by a huge ball of fire racing toward the planet. Cornelius, an old monk, knows how to stop the burning sphere with the help of Korben Dallas, a taxi driver and former secret agent and a woman named Leeloo.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/fPtlCO1yQtnoLHOwKtWz7db6RGU.jpg"
}