{
  "movie_name": "The Thing",
  "movie_id": "1021244-thing",
  "total_reviews": 77,
  "reviews": [
    {
      "text": "Buried upon its release by another extra-terrestrial story, the GOAT remake perfectly blends science fiction and horror into a still-arresting symphony of terror.\nChristopher Lloyd",
      "author": "Christopher Lloyd"
    },
    {
      "text": "In my eyes, The Thing is as perfect as a movie can get: it knows exactly what it wants to be and what it’s trying to do, and succeeds on every level I can conceive.",
      "author": "Thaddeus Buttrey"
    },
    {
      "text": "Incredible atmosphere and simple effective thrills",
      "author": "Rachel Wagner"
    },
    {
      "text": "Carpenter stresses the slimy ET at the expense of characterisation, mood and practically everything else, yet it's precisely this one grisly facet that makes it such compelling science fiction.",
      "author": "Alan Jones"
    },
    {
      "text": "The solemnity of the frozen wastes contrasts brilliantly with the sweaty paranoia of the men, who are unsure which of their colleagues is next going to erupt with hidden jaws and shooting tendrils.",
      "author": "Ed Potton"
    },
    {
      "text": "... an alien invasion horror masterpiece, a kind of survivalist chamber drama set in a remote research station in the icy Arctic where a small group men without women are confronted by an insidious takeover.",
      "author": "Sean Axmaker"
    },
    {
      "text": "While the close-quarters direction is stellar, full of tight, terrifying spaces, and the cast is excellent (led by Kurt Russell), the real strength of the film lies in the special effects by Rob Bottin.",
      "author": "Howard Waldstein"
    },
    {
      "text": "Tremendously fun. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "This is a nihilistic look at survival at all costs, in which the men become as dangerous as the thing they’re hunting.",
      "author": "Alison Gillmor"
    },
    {
      "text": "Since no one knows who has been infected until it is too late, The Thing becomes a nightmare guessing-game which Carpenter exploits most efficiently.",
      "author": "Noel Taylor"
    },
    {
      "text": "The Thing is full of terrifying sequences, but one stands out as one of the most innovative and scary set pieces of John Carpenter's entire career.",
      "author": "William Jones"
    },
    {
      "text": "Every October, I revisit John Carpenter’s “The Thing” to celebrate the month of Halloween, and every year I arrive at the same conclusion: it's one of the most effective horror films ever made.",
      "author": "Wael Khairy"
    },
    {
      "text": "THE THING (1982) was not exactly John Carpenter's breakthrough film, but it may well be his best film.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "The Thing fully realizes its potential as a thriller of nightmare proportions.",
      "author": "Phil Edwards"
    },
    {
      "text": "The film sets the stage for a piercingly chilly descent into the unraveling human condition.",
      "author": "Matt Conway"
    },
    {
      "text": "The Thing's brilliance rests on the equilibrium between implied and visceral horror, often incompatible ideas that Carpenter stirs together in a stylish, engrossing way.",
      "author": "Brian Eggert"
    },
    {
      "text": "This version is so full of \"the thing\" that it strangles our imagination and becomes a mere exercise in ugly, mechanical horrorifics. Very dumb, very disappointing.",
      "author": "Peter Stack"
    },
    {
      "text": "The Thing is like The Howling, a showcase for fiber and latex and the products they produce, by and for people who need their nightmares to be completely comprehensible and completely unreal.",
      "author": "Ginger Varney"
    },
    {
      "text": "Such a pity. John Carpenter is too gifted a moviemaker to let nauseating special effects take over his biggest film, but that's what happened in The Thing.",
      "author": "Scott Cain"
    },
    {
      "text": "...a methodically-paced endeavor that essentially (and effectively) captures the viewer's interest and attention right from the get-go...",
      "author": "David Nusair"
    },
    {
      "text": "A masterpiece of horror filmmaking.",
      "author": "Allen Almachar"
    },
    {
      "text": "Whether it scares you with its paranoia, claustrophobic setting, Ennio Morricone's brooding score or Rob Bottin's bar-raising practical creature effects, The Thing's sole purpose is to get under your skin...",
      "author": "Howard Gorman"
    },
    {
      "text": "It's what all horror connoisseurs crave; a mysterious and evocative beginning, a steady burgeoning of tension, and enough left unexplained leveled with the right amount of terror shown. It is a masterpiece of filmmaking.",
      "author": "Kristy Strouse"
    },
    {
      "text": "My favorite horror movie.",
      "author": "Jeff Mitchell"
    },
    {
      "text": "Few filmmakers understand how to use practical effects as well as the master of cult horror, John Carpenter.",
      "author": "Leigh Monson"
    },
    {
      "text": "Far surpassing most of the CG work of the time, the practical creature and makeup effects continue to amaze even today.",
      "author": "Mike Massie"
    },
    {
      "text": "An amazing adventure that... contains scenes that speak for themselves of the enormous talent of the same person responsible for Halloween. [Full Review in Spanish]",
      "author": "Sergio Benítez"
    },
    {
      "text": "The sheer nastiness of it all had an imprinting effect on a generation of budding cinema buffs. It's one of the first films I can recall seeing that felt like it was trying to hurt you.",
      "author": "Sean Burns"
    },
    {
      "text": "In the midst of all the special effects, it is ultimately about the psychological impact of a high stress situation.",
      "author": "Tyler Smith"
    },
    {
      "text": "The Thing feels like a perfect movie. An embarrassment of riches all concentrated in a single feature film that stands the test of time in a way that few stories do.",
      "author": "Ed Travis"
    },
    {
      "text": "With its groundbreaking visual effects, terrific ensemble, and haunted-house atmosphere, is now rightfully regarded as an all-time horror classic.",
      "author": "Kirk Baird"
    },
    {
      "text": "The Thing is set in an all-male environment, and is as much a study of masculinity in crisis as an update of the sort of siege scenario that Carpenter had already played out in Assault on Precinct 13.",
      "author": "Anton Bitel"
    },
    {
      "text": "What really is there left to say about John Carpenter's The Thing? A true genre classic from 1982, the film is an all-time favourite of many and often cited as a sci-fi horror masterclass.",
      "author": "Andrew Pollard"
    },
    {
      "text": "fascinating, horrifying, and utterly engaging from the first frame to the last",
      "author": "James Kendrick"
    },
    {
      "text": "Graphically violent, gory, grisly, and frightening, though it's so over-the-top and dated that the gore is almost campy.",
      "author": "Renee Schonfeld"
    },
    {
      "text": "With a thick, thick air of intense paranoia and jaw-dropping monster effects work, The Thing stands as one of the greatest films of both the horror and science fiction genres.",
      "author": "Austin Trunick"
    },
    {
      "text": "Far and away the best film of John Carpenter's career.",
      "author": "Matt Brunson"
    },
    {
      "text": "Like Ridley Scott's 1979 classic \"Alien\" before it, \"The Thing\" is science-fiction/horror with a visionary punch that continues to resonate and inspire filmmakers decades later.",
      "author": "Dustin Putman"
    },
    {
      "text": "John Carpenter's The Thing boasts outstanding special effects, skilled direction and cinematography, and a tension-filled story, making for one of the legendary director's most cherished works.",
      "author": "Jeff Beck"
    },
    {
      "text": "It personifies the definition of \"popcorn entertainment\" - that is, the kind of film that relishes the thrill of its many ambitious moments without seeking total transcendence.",
      "author": "David Keyes"
    },
    {
      "text": "Something close to an absolutely perfect exercise in how to construct a thriller.",
      "author": "Tim Brayton"
    },
    {
      "text": "A magnificent cabinet of grotesqueries, one of the decade's great works",
      "author": "Fernando F. Croce"
    },
    {
      "text": "I'll say it: the single greatest horror movie ever made.",
      "author": "Rob Vaux"
    },
    {
      "text": "...stays truer to its source material, John W. Campbell, Jr.'s 1938 novella Who Goes There?, than the 1951 Howard Hawks-Christian Nyby feature The Thing from Another World.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "...reading this as a Cold War allegory is doing the movie a very big favor. In reality, this is a film about tentacles and teeth and eyes and orifices and goo, goo, goo.",
      "author": "Josh Larsen"
    },
    {
      "text": "I discovered what it was to love a movie that was relentless in its desire to be unpleasant",
      "author": "Walter Chaw"
    },
    {
      "text": "The Thing is a peerless masterpiece of relentless suspense, retina-wrecking visual excess and outright, nihilistic terror.",
      "author": "Adam Smith"
    },
    {
      "text": "Carpenter's direction is slow, dark, and stately; he seems to be aiming for an enveloping, novelistic kind of effect, but all he gets is heaviness.",
      "author": "Dave Kehr"
    },
    {
      "text": "It's a paranoid masterpiece, and that rare remake that improves upon the original.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "Not just an excellent remake, it's an excellent movie, and an almost perfect horror movie...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Shows more originality, wit and invention than possibly any other film you might call a remake... as influential as Alien for its blend of action, sci-fi and chilling horror.",
      "author": null
    },
    {
      "text": "The special effects can't hope to be as creepy to our seen-it-all eyes as they were to the film's first viewers, but we can still enjoy the monster's unique weirdness, and the story is a rock-solid yarn.",
      "author": "Edward Porter"
    },
    {
      "text": "It's pretty scary and entertaining stuff, though I always get the feeling that nothing in it lives up to the tremendous opening section.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "An accomplished horror movie.",
      "author": "Philip French"
    },
    {
      "text": "The Thing is a masterpiece: a black comedy, monster movie, conspiracy thriller and whodunit.",
      "author": "Rob Daniel"
    },
    {
      "text": "Carpenter's rethinking of producer Howard Hawks' classic is an honorable attempt to hew closer to the original story.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "Contains everything you could want to know about horror filmmaking.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "If it's the most vividly guesome monster ever to stalk the screen that audiences crave, then The Thing is the thing. On all other levels, however, John Carpenter's remake of Howard Hawks' 1951 sci-fi classic comes as a letdown.",
      "author": "Variety Staff"
    },
    {
      "text": "Great entertainment. Just try not to take it too seriously.",
      "author": "John J. Puccio"
    },
    {
      "text": "Russell's sub-Eastwood heroics hardly compensate for the absence of all characterisation, while Bill Lancaster's script boasts the most illogical climax any monster movie ever had.",
      "author": "Geoff Andrew"
    },
    {
      "text": "John Carpenter equaled the unrelenting suspense of Halloween with this nerve-racking remake. Carpenter's The Thing is one of the all-time great horror films.",
      "author": "Chuck O'Leary"
    },
    {
      "text": "The original has been built up to classic scale, but Carpenter's remake is actually far scarier and equally thoughtful.",
      "author": "Daniel Fienberg"
    },
    {
      "text": "The Thing may be a tad too careful and schematic to stand shoulder with Carpenter's very best films.",
      "author": "Eric Henderson"
    },
    {
      "text": "Because this material has been done before, and better, especially in the original The Thing and Alien, there's no need to see this version.",
      "author": "Roger Ebert"
    },
    {
      "text": "I never got into this. Very slow, dated special effects, and obvious exploration of the paranoia theme.",
      "author": "Fred Topel"
    },
    {
      "text": "Mr. Carpenter has demonstrated that he can make good, comparatively plain, old-fashioned scare movies and effective suspense thrillers, but he seems to lose his own head when he combines two or more genres, as he [does here].",
      "author": "Vincent Canby"
    },
    {
      "text": "Wild, gruesome and outrageous",
      "author": "James Sanford"
    },
    {
      "text": "The claustrophobic group becomes the perfect petri dish in which to create an environment of fear, paranoia, and betrayal.",
      "author": "Brian Mckay"
    },
    {
      "text": "Films like this make me hope against hope that, some day...one day...the real John Carpenter will return.",
      "author": "Widgett Walls"
    },
    {
      "text": "A bit too heavy on the shock effects, but far scarier than most average horror films.",
      "author": "Chuck Rudolph"
    },
    {
      "text": "Underlining every frame of The Thing is an anticipating dread: the characters -- and the viewer -- sense the potential menace of an enemy they cannot see.",
      "author": "Rumsey Taylor"
    },
    {
      "text": "Pointless remake of the 1951 by the usually overrated John Carpenter",
      "author": "Ken Hanke"
    },
    {
      "text": "This is one of those great films which inspire inarticulate awe within your humble narrator rather than verbose declarations of praise.",
      "author": "Jeremiah Kipp"
    },
    {
      "text": "Genuinely scary and full of tension, and populated by one bad-ass monster.",
      "author": "Christopher Null"
    },
    {
      "text": "Director Carpenter makes effective use of his source material - there is a real sense of paranoia and real tension hanging over onscreen proceedings . . .",
      "author": "James O'Ehley"
    },
    {
      "text": "Horror movies don't get much better than this.",
      "author": "Scott Weinberg"
    },
    {
      "text": "This is one of those rare remakes that remains faithful to the premise of the original but does something unique with the concept.",
      "author": "James Berardinelli"
    }
  ],
  "release_year": 1982,
  "duration": 108,
  "genres": [
    "Horror",
    "Sci-Fi",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "In remote Antarctica, a group of American research scientists are disturbed at their base camp by a helicopter shooting at a sled dog. When they take in the dog, it brutally attacks both human beings and canines in the camp and they discover that the beast can assume the shape of its victims. A resourceful helicopter pilot (Kurt Russell) and the camp doctor (Richard Dysart) lead the camp crew in a desperate, gory battle against the vicious creature before it picks them all off, one by one.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/tzGY49kseSE9QAKk47uuDGwnSCu.jpg"
}