{
  "movie_name": "To All the Boys I've Loved Before",
  "movie_id": "to_all_the_boys_ive_loved_before",
  "total_reviews": 69,
  "reviews": [
    {
      "text": "One must mention the performance by Condor. Her comedic timing is perfect, but more than that, she really embodies this character...",
      "author": "Aaron Charles"
    },
    {
      "text": "Every movie should have a Lara Jean Covey and Peter Kavinsky — except I don’t know that we, as a society, are prepared for that much cuteness.",
      "author": "Patricia Karounos"
    },
    {
      "text": "It has a strong, flawed protagonist who reminds us of some important life lessons as she is learning them at the same time.",
      "author": "Nicholas Oon"
    },
    {
      "text": "Thanks to films like To All The Boys I've Loved Before, The Edge of Seventeen, and Running from Grace, Asian American teenagers can see dimensional versions of themselves onscreen who are worthy of falling in love, no matter who they end up with.",
      "author": "Laura Sirikul"
    },
    {
      "text": "The romance I see is too sweet for my taste. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "Lara Jean learns a lot of lessons--she changes and she grows--but she never becomes anything other than herself. It's always her discovering new sides of herself. That's so important for young women to see.",
      "author": "Sherin Nicole"
    },
    {
      "text": "To All the Boys I've Loved Before is heartwarmingly sweet and features delightful performances.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "The resultant plot follows a style reminiscent of the Shakespeare-inspired Ten Things I Hate About You and She's All That, making To All The Boys I've Loved an enjoyable trip down the comedy-of-deception genre.",
      "author": "Redmond Bacon"
    },
    {
      "text": "Thrills in part because most viewers are all too familiar with what it feels like to baldly deny feelings for another person even as they become patently obvious to everyone else.",
      "author": "Hannah Giorgis"
    },
    {
      "text": "This sweetness works because, like Johnson et al., we in the audience know what shape rom-coms have historically taken, and are thus ready and able to have our expectations subverted in the purest of ways.",
      "author": "Alexis Gunderson"
    },
    {
      "text": "Don't sleep on this movie just because it's familiar-save for a lead character and actor blazing a trail for diversity-To All The Boys I've Loved Before is a crush-worthy movie that will have your heart swooning.",
      "author": "Karl Delossantos"
    },
    {
      "text": "A well-intentioned, good-natured teen romance that plays it safe and ends up being blander than it should have been.",
      "author": "Sameen Amer"
    },
    {
      "text": "'To All the Boys I've Loved Before' is a solvent romantic comedy that knows how to handle a hackneyed idea to make your viewing enjoyable. [Full Review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "Lana Condor is super charming as the lead character Lara Jean in this perfectly pleasant teen romance.",
      "author": "Rachel Wagner"
    },
    {
      "text": "This is the kind of smart movie for and about contemporary teenage life that has been in short supply in recent years.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "Y'all, it was precious.",
      "author": "Amanda Greever"
    },
    {
      "text": "A teen rom-com success for Netflix.",
      "author": "Fiona Underhill"
    },
    {
      "text": "Not a moment will cause you emotional turmoil, except maybe some swooning.",
      "author": "Bridget Read"
    },
    {
      "text": "Takes everything audiences love about the genre and wraps it in a Hughes-esque bow to offer viewers a carefree, easily rewatchable film sure to entertain movie lovers of all ages.",
      "author": "Matt Ward"
    },
    {
      "text": "A perfect blend of John Hughes teen angst with Disney film teen cheesiness, To All the Boys contains familiar coming-of-age tropes mixed with fresh narrative ideas.",
      "author": "Joel Mayward"
    },
    {
      "text": "With great lead performances, some good comedy and heart (and far from falling into cliché) this is a charming and happily sweet movie.",
      "author": "Matt Hudson"
    },
    {
      "text": "For those who say To All the Boys is trodden territory, I ask: Trodden territory for who?",
      "author": "Li Lai"
    },
    {
      "text": "Some of the actors and actresses pop off the screen and none more than Centineo. He is a star from the word go.",
      "author": "Alan French"
    },
    {
      "text": "This movie is witty, funny, heartwarming and will make even the nonbelievers of true love, or at least romance, into converts.",
      "author": "Kiera Allen"
    },
    {
      "text": "It is such a cute movie. It's so adorable, so funny, so sweet. It's corny, but not overwhelmingly corny. It so works.",
      "author": "Funmi Sunmonu"
    },
    {
      "text": "If you want a realistic portrayal of the ugly truth of high school relationships, this ain't it. If you're after escapism, this might just be the best fantasy film since Lord of the Rings.",
      "author": "Amelia Navascues"
    },
    {
      "text": "It's not just that it looks nice; it has a palette, a color scheme...beyond all that, it's just a great, fun, interesting situation these characters find themselves in.",
      "author": "Eli Glasner"
    },
    {
      "text": "To All The Boys I've Loved Before presents an adolescent romance that appears extremely generic on the surface, but stashes away enough novel elements to feel fresh. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "The pleasure of the film does not come from being surprised, it comes from experiencing these characters. Perhaps because the source material is a novel, the people in the story blossom beyond their boilerplate romantic comedy slots.",
      "author": "Asia Frey"
    },
    {
      "text": "Much of the movie's success is down to Condor's gentle appeal and her quiet chemistry with co-star Noah Centineo .",
      "author": "Brad Newsome"
    },
    {
      "text": "No prizes for guessing who she ends up falling in love with, but as predictable as it is, the story is told with flair, both narrative and visual.",
      "author": "Alison de Souza"
    },
    {
      "text": "If there was any doubt that Netflix is dominating the romantic comedy genre this year, this should end the argument. It's full of heart, charm and genuine feel goods.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "Incredibly funny and heartfelt with star making turns from Lana Condor and Noah Centineo, this movie is just a delight from start to finish.",
      "author": "Terence Johnson"
    },
    {
      "text": "Incurable romantics of all ages should enjoy this heartwarming teenage rom-com.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Condor is a real find as a promising actor we'll be sure to see more of, too.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Centineo performs a type of compassionate male energy that is in short supply in movies at the moment, but Lana Condor is undeniably TATBILB's star.",
      "author": "Rachel Syme"
    },
    {
      "text": "It's wonderful cliché that works... The script understands exactly where the effervescence of a great romcom lies.",
      "author": "Anna Leszkiewicz"
    },
    {
      "text": "A rom-com that although it falls in certain clichés, it brings a fresh air to youthful adaptations. [Full Review in Spanish]",
      "author": "Monica Urruchua"
    },
    {
      "text": "The energetic, game cast and smart writing that makes To All the Boys I've Loved Before one of the best romantic comedies in years, and the strongest outing in the genre released by Netflix thus far.",
      "author": "Deborah Krieger"
    },
    {
      "text": "To All the Boys is a joy to watch and rises to the top of a cliché genre on the strength of its whip-smart writing and cast.",
      "author": "Frida Garza"
    },
    {
      "text": "It's a stylish pastel-tinted confection of a movie, one that knows every single one of the romantic tropes it's working with backwards and forwards, and loves them with all its pure and wholesome heart.",
      "author": "Constance Grady"
    },
    {
      "text": "This generation is lucky to have To All the Boys I've Ever Loved Before as the teen romance comedy of their generation.",
      "author": "Jordan Calhoun"
    },
    {
      "text": "It's so undeniably sweet.",
      "author": "Wenlei Ma"
    },
    {
      "text": "There's a lot more competition now than there was when we wore out our Can't By Me Love or John Hughes VHSes, but I have faith that To All The Boys I've Loved Before will become heavily quoted by current high schoolers.",
      "author": "Fred Topel"
    },
    {
      "text": "...doesn't set out to break the mold, but by staying true to its characters and the mixed-up feelings of youth, it improves on what so many films before it have gotten wrong.",
      "author": "Travis Hopson"
    },
    {
      "text": "There is nothing mean-spirited or pernicious in its content. Just a thoroughly sweet, at times hysterically funny narrative that manages a certain amount of endearing authenticity.",
      "author": "Tynan Yanaga"
    },
    {
      "text": "Netflix's best rom-com yet.",
      "author": "Joe Reid"
    },
    {
      "text": "Like any teen story, To All the Boys has some growing pains... Still, we'll forgive it. Sure, it hits at core truths about new love. But it's still a fantasy, just not the bodice-ripping one of Lara Jean's teen daydreams.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "As lighthearted entertainment and a look at a too-little-seen culture, it's a welcome addition to Netflix's blossoming roster of teen romcoms.",
      "author": "Renee Schonfeld"
    },
    {
      "text": "A delightful and refreshing take on the teen drama.",
      "author": "Ferdosa Abdi"
    },
    {
      "text": "Charming and sweet and as such is a much-needed storm in a very long drought that reminds us not just what we've been missing all these years, but also just how timeless teen movies and their coming-of-age stories can be.",
      "author": "Kaitlin Thomas"
    },
    {
      "text": "To All the Boys simmers in nostalgia by paying homage to the great teen comedies of the past. However, the film manages to make its own mark with its charismatic cast and engaging filmmaking style.",
      "author": "Gabrielle Bondi"
    },
    {
      "text": "Centineo is the big beating heart at the center of the somewhat reserved \"To All The Boys I've Loved Before.\" He's a lot like his character, bringing out the best in this love story.",
      "author": "Katie Walsh"
    },
    {
      "text": "Every frame of the movie is stunning and set up so meticulously that it makes you want to Instagram your TV screen.",
      "author": "Peggy Truong"
    },
    {
      "text": "The film is precisely what it should be: pleasing and clever, comforting and fun and romantic.",
      "author": "Linda Holmes"
    },
    {
      "text": "A delightfully adorkable time.",
      "author": "Nell Minow"
    },
    {
      "text": "To All the Boys... is strictly Disney Channel stuff, but it's got more substance then you expect.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "It deserves to find its place alongside warm, whip-smart teen classics that are unafraid of complete and utter romance, like Easy A and The Duff.",
      "author": "Delia Harrington"
    },
    {
      "text": "It's a smart, funny, sweet, winning movie, and I was constantly amazed by how much I enjoyed it.",
      "author": "Matt Goldberg"
    },
    {
      "text": "To All The Boys I've Loved Before is a charming young adult romantic comedy that tells a sweet and joyful story of young love for modern audiences.",
      "author": "Molly Freeman"
    },
    {
      "text": "All this brews to make a perfect first-boyfriend fantasy, the kind you dreamed of as a girl and the kind you may still reminisce over. This makes To All the Boys I've Loved Before a total treat and a perfect pick for a night of Netflix and Girls Night in.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Stilted and scattered and strangely cold in its cinematography, it's a handsomely shot whole lotta nothin'.",
      "author": "Inkoo Kang"
    },
    {
      "text": "Its heartwarming and clear-eyed approach to first love and the challenges of coming-of-age distinguishes it from its contemporaries. Add it to your queue.",
      "author": "Cady Lang"
    },
    {
      "text": "To All the Boys keeps a tight grip on the formula of every rom-com and adapts it for the younger set.",
      "author": "Kate Erbland"
    },
    {
      "text": "A pleasant and perfectly relatable situation comedy about a 16-year-old's awkward first attempts at dating.",
      "author": "Peter Debruge"
    },
    {
      "text": "So, as was said recently about another film, leave your brain at the door and lead with your heart. Sometimes you just need to feel good, no matter what your age. This is a good start.",
      "author": "Neely Swanson"
    },
    {
      "text": "Unlike previous Netflix misses, To All the Boys I've Loved Before is likely to be watched on repeat for years to come by romance fans of all ages.",
      "author": "Kimber Myers"
    },
    {
      "text": "This shows the audience within the first few minutes why it belongs in the upper echelon of \"fake relationship\" romcoms.",
      "author": "Courtney Howard"
    },
    {
      "text": "I didn't appreciate what a unicorn-like rarity a good, solid boy is in a teen comedy until To All the Boys I've Loved Before.",
      "author": "Emily Yoshida"
    }
  ],
  "duration": 99,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "TV-14",
  "synopsis": "A teenage girl's love letters are exposed and wreak havoc on her life.",
  "popularity": 8.4
}