{
  "movie_name": "Toy Story",
  "movie_id": "toy_story",
  "total_reviews": 91,
  "reviews": [
    {
      "text": "I don't see how anyone can say this isn't a perfect film. The story is tight, it had some strong emotional beats, and the voice acting is spot on.",
      "author": "Justin Brown"
    },
    {
      "text": "This is an animation classic. I love rewatching this from start to finish. It's impact on cinema is undeniable.",
      "author": "Brandon Collins"
    },
    {
      "text": "John Lasseter has delivered a great adventure story that will not only entertain children but can also be enjoyed as a jokey parable by adults.",
      "author": "Tom Hutchinson"
    },
    {
      "text": "Children must eventually outgrow their toys and it’s this existential fear that informs the animated film. Even as its characters worry about getting left behind, the movie is a perfectly preserved snapshot of childhood, a time gone by.",
      "author": "Gayle Sequeira"
    },
    {
      "text": "Despite the animation not holding up, Toy Story is a flawless movie. The writing and characters are amazing.",
      "author": "Korey Coleman"
    },
    {
      "text": "You don't have to be a kid to enjoy it, just have a sense of humor.",
      "author": "Sheila Reid"
    },
    {
      "text": "... a tight, inventive script that balances strongly etched characters with a tremendous sense of play, and brings it to life with vividly realized characters.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Whenever watching the film, an eternally charming account of the world of toys, imagine that the story told is that of Pixar, the little company who proved, both through their own story and their film, the infinite possibility of imagination.",
      "author": "Brian Eggert"
    },
    {
      "text": "I always look back to Toy Story as the match that lit my movie-loving fuse.",
      "author": "Cory Woodroof"
    },
    {
      "text": "We have seen the future of cartoons, and its name is Toy Story.",
      "author": "Margaret A. McGurk"
    },
    {
      "text": "An unforgettable, groundbreaking, absolutely winning masterpiece.",
      "author": "Mike Massie"
    },
    {
      "text": "Toy Story takes a number of surprising turns, and though I didn't fall in love with it -- there's a lot of routine clobbering, scrambling, and zooming about -- I remained interested and happy until the end (and children, I think, will adore it).",
      "author": "David Denby"
    },
    {
      "text": "Toy Story remains the humanistic, vital film that created the mold for such classics as Finding Nemo and WALL-E.",
      "author": "David Harris"
    },
    {
      "text": "Toy Story (1995) is the first completely computer-generated, animated feature film. The visuals were entirely generated from computers, creating a wonderfully-realistic 3-D world with lighting, shading, and textures...",
      "author": "Tim Dirks"
    },
    {
      "text": "This eighty minutes are an endless succession of novelties. [Full Review in Spanish]",
      "author": "Sergio Benítez"
    },
    {
      "text": "If you haven't seen the original in some time, perhaps for fear that it won't hold up compared to the later, sleeker releases from Pixar, it's worth rediscovering its pleasures.",
      "author": "Matt Brunson"
    },
    {
      "text": "[Tom] Hanks doesn't just speak lines, he gives a performance.",
      "author": "David Baron"
    },
    {
      "text": "[Toy Story] gives us some of the best characters ever in film.",
      "author": "Rachel Wagner"
    },
    {
      "text": "All great animated films, certainly those aimed at youngsters, seem to subtly lament the transience of the magic of childhood, and Toy Story certainly fits in that lineage.",
      "author": "PJ Nabarro"
    },
    {
      "text": "With \"instant classic\" written all over it, Toy Story, the first full-length feature entirely composed of computer-generated animation, is a visually astounding, wildly inventive winner.",
      "author": "Michael Rechtshaffen"
    },
    {
      "text": "The rivalry between Woody the cowboy and Buzz the astronaut is worked out as a direct parallel to any other family quarrels and it is this sense of oneness that gives the film its kick.",
      "author": "Derek Malcolm"
    },
    {
      "text": "To an entire generation of filmgoers, it just might represent the most significant leap in storytelling that they will ever see...",
      "author": "Shaun Munro"
    },
    {
      "text": "Pixar classic is one of the best kids' movies of all time.",
      "author": "Nell Minow"
    },
    {
      "text": "Apesar de representar um imenso avano tecnolgico, a fora do filme reside no carisma de seus personagens e no charme de sua histria.",
      "author": "Pablo Villaça"
    },
    {
      "text": "When Woody perks up in the opening scene, it's not only the toy cowboy who comes alive - we're watching the rebirth of an art form.",
      "author": "Josh Larsen"
    },
    {
      "text": "Introduced not one but two indelible characters to the pop culture pantheon: cowboy rag-doll Woody (Tom Hanks) and plastic space ranger Buzz Lightyear (Tim Allen). [Blu-ray]",
      "author": "Peter Canavese"
    },
    {
      "text": "it is easy to see how virtually everything that is good in animation right now has some small seed in Toy Story",
      "author": "James Kendrick"
    },
    {
      "text": "Though some of the animation seems dated compared to later Pixar efforts and not nearly as detailed, what's here is done impeccably well.",
      "author": "James Plath"
    },
    {
      "text": "Perhaps the film is meant as a pre-emptive sop to any resistance to a new medium.",
      "author": "Walter Chaw"
    },
    {
      "text": "Time has been kind to it, and future years I imagine will still be kind; a classic is forever.",
      "author": "Tim Brayton"
    },
    {
      "text": "I think I speak for all adults and kids when I say I can't wait for playtime",
      "author": "Amy Nicholson"
    },
    {
      "text": "So ingenious in concept, design and execution that you could watch it on a postage stamp-sized screen and still be engulfed by its charm.",
      "author": "Derek Adams"
    },
    {
      "text": "Turns out the real magic is nothing to do with technology: it's in the words, the voices, the story. But then, a child could have told you that.",
      "author": "Matt Glasby"
    },
    {
      "text": "Its lightness of touch has not diminished, nor has its near-miraculous kidult-fusion humour.",
      "author": "Andrew Pulver"
    },
    {
      "text": "The 3-D viewing doesn't make much difference...but it is a joy to see these superb films back on the big screen, even after dozens of DVD viewings.",
      "author": "Tom Charity"
    },
    {
      "text": "It doesn't enhance the experience, because the film's timeless appeal is down to great characters and wonderful storytelling; a classic that doesn't need goggles or gimmicks.",
      "author": "Cosmo Landesman"
    },
    {
      "text": "As such Toy Story in 3D is never overwhelming. Nor is it tedious, as many recent 3D vehicles have come too close for comfort to.",
      "author": "Adam Woodward"
    },
    {
      "text": "The fresh look serves the story and is never allowed to overwhelm it, leaving a beautifully judged yarn to unwind and enchant a new intake of young cinemagoers.",
      "author": "Tim Evans"
    },
    {
      "text": "There's no denying 3D adds extra texture to Pixar's seminal 1995 buddy movie, emphasising Buzz and Woody's toy's-eye- view of the world.",
      "author": "Neil Smith"
    },
    {
      "text": "If anything, it feels even fresher, funnier and more thrilling in today's landscape of over-studied demographically correct moviemaking.",
      "author": "Rich Cline"
    },
    {
      "text": "If you haven't seen it for a while, you may have forgotten just how fantastic the snappy dialogue, visual gags and genuinely heartfelt story is.",
      "author": "Grant Lauchlan"
    },
    {
      "text": "The two films and the 10-minute intermission run just over 3 hours, bit much for the little ones who find sitting still that long agonizing.",
      "author": "Gary Wolcott"
    },
    {
      "text": "The 3D revamp adds an intriguing new dimension to an already wonderful film that's both genuinely engaging and laugh-out-loud funny.",
      "author": "Matthew Turner"
    },
    {
      "text": "A magnificent film, created with a then unproven playful spirit that merges broad cartoon antics with an endearing eye toward nostalgia -- the heartbreaking years when wonder turns to knowledge and maturation.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Colorful and witty...the mixture of action and humor proves as irresistible as ever.",
      "author": "Frank Swietek"
    },
    {
      "text": "Like the transcendent long shot of Buzz and Woody soaring as one, Toy Story does the impossible in casting us up.",
      "author": "Rob Humanick"
    },
    {
      "text": "The year's most inventive comedy.",
      "author": "Richard Corliss"
    },
    {
      "text": "A winning animated feature that has something for everyone on the age spectrum.",
      "author": "David Ansen"
    },
    {
      "text": "The film sports a provocative and appealing story that's every bit the equal of this technical achievement.",
      "author": "Leonard Klady"
    },
    {
      "text": "A children's film that has real staying power.",
      "author": null
    },
    {
      "text": "An entertaining computer-generated, hyperrealist animation feature (1995) that's also in effect a toy catalog.",
      "author": "Jonathan Rosenbaum"
    },
    {
      "text": "As Lion King did before it, Toy Story revived the art of American children's animation, and ushered in a set of smart movies that entertained children and their parents. It's a landmark movie, and doesn't get old with frequent repetition.",
      "author": "Michael Booth"
    },
    {
      "text": "Hilariously funny, sweet, smart, utterly enchanting look at the secret world of toys.",
      "author": "Betsy Bozdech"
    },
    {
      "text": "The film will probably be more fully appreciated by adults, who'll love the snappy, knowing verbal gags, the vivid, deftly defined characters, and the overall conceptual sophistication.",
      "author": "Geoff Andrew"
    },
    {
      "text": "Absolutely stunning and immensely enjoyable.",
      "author": "Michael Dequina"
    },
    {
      "text": "Just perfect.",
      "author": "Caroline Westbrook"
    },
    {
      "text": "Remains a groundbreaking work in the field of animation, and is still a wonderfully entertaining film.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "My 2-year-old runs around yelling, 'Buzz Lightyear to the rescue!' If that's not a testament to the power this movie has to connect to children, I don't know what is.",
      "author": "Kevin Carr"
    },
    {
      "text": "You wanna know what real \"movie magic\" looks like? Rent yourself the entire Pixar collection and try not to spend the next eight hours grinning from ear to ear.",
      "author": "Scott Weinberg"
    },
    {
      "text": "A return to the inspiration and genius that powered the old Disney classics. In some ways, its even better than the classics. This film is innovative AND it has a memorable, unpredictable, interesting story.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "Moviemaking alchemy — a breathtakingly perfect blend of wide-eyed childhood wonder and wry adult humor, yesteryear nostalgia and eye-popping novelty.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "Many movies lose their luster over time. Toy Story just gets better with age.",
      "author": "Matt Norris"
    },
    {
      "text": "Children will enjoy a new take on the irresistible idea of toys coming to life. Adults will marvel at a witty script and utterly brilliant anthropomorphism.",
      "author": "Janet Maslin"
    },
    {
      "text": "A film of such striking individuality and uncompromising precocity that I left the theater thrilled with the knowledge that I had just witnessed cinematic history.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "A good holiday movie for kids and adults. Although the story is easily understood by kids, there are plenty of jokes and innuendos that will sail right over most kids' heads.",
      "author": "Robert Roten"
    },
    {
      "text": "Revolutionized animation, and had a great story, to boot!",
      "author": "Alex Sandell"
    },
    {
      "text": "Captivating animated film that will win the hearts and minds of all who see it.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "The premise is brimming with possibilities -- and none go unfulfilled.",
      "author": "Christine James"
    },
    {
      "text": "The animation is dazzling, but the movie at heart has the simple charm of kids' puppet show.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "Shot through with an exuberant and enviable sense of its own brilliance, Toy Story will continue to impress long after its technical virtuosity has been upstaged.",
      "author": "Nick Hilditch"
    },
    {
      "text": "Although its computer-generated imagery is impressive, the major surprise of this bright foray into a new kind of animation is how much cleverness has been invested in story and dialogue.",
      "author": "Kenneth Turan"
    },
    {
      "text": "Disney's witty, wondrously imaginative, all-computer-generated cartoon is far and away the best of the new holiday movies in town.",
      "author": "John Hartl"
    },
    {
      "text": "Besides the eye-popping look of the movie, Toy Story offers a good tale told with zest and humor, which is a roundabout way of saying you'll believe those toys are real.",
      "author": "Liz Braun"
    },
    {
      "text": "Disney's first computer-made animated feature is a 3-D eye popper.",
      "author": "Susan Stark"
    },
    {
      "text": "Adult viewers also will have fun -- and not only because of the witty writing or the nostalgic trip back to the toy chests of our past.",
      "author": "Jack Garner"
    },
    {
      "text": "stretches your mind creatively to look at inanimate objects with a new respect.",
      "author": "Steve Rhodes"
    },
    {
      "text": "Pixar has made a charming movie carrying their current plot concepts and animation techniques to what appears to be about the limit. Toy Story is a lot of fun.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Cute, inventive, entertaining little toy adventure for young and old alike.",
      "author": "JoBlo"
    },
    {
      "text": "Sheer delight, exhilarating and breathtaking.",
      "author": "Bryant Frazer"
    },
    {
      "text": "The film will intoxicate children and charm the parents in their company.",
      "author": "Barbara Shulgasser"
    },
    {
      "text": "The wizards at Pixar and Disney have created a film that is unlikely to be forgotten in the next few years.",
      "author": "Christopher Null"
    },
    {
      "text": "In fact, there isn't a funnier, faster-paced movie around, nor one that is more visually arresting.",
      "author": "Chris Hicks"
    },
    {
      "text": "The script, by Lasseter, Pete Docter, Andrew Stanton and Joe Ranft, is filled with clever gags that keep the two heroes at each other's throats and the plot on fast- forward.",
      "author": "Peter Stack"
    },
    {
      "text": "The result is a visionary roller-coaster ride of a movie.",
      "author": "Roger Ebert"
    },
    {
      "text": "Technically, Toy Story is nearly flawless.",
      "author": "Sean P. Means"
    },
    {
      "text": "The one big negative about Toy Story involves Disney's overcommercialization.",
      "author": "James Berardinelli"
    },
    {
      "text": "Toy Story is long on sentiment and short on story; but has anyone ever complained? Surely not when the characters are so appealing and the visuals so extraordinary.",
      "author": "John J. Puccio"
    },
    {
      "text": "Computer generated cartoon fun!",
      "author": "Madeleine Williams"
    },
    {
      "text": "It's a nice change of pace to see the studio draw magic from this modern tale about ordinary 20th-century kid Andy and his eager-to-please playthings.",
      "author": "Rita Kempley"
    },
    {
      "text": "John Lasseter and his compu-teers have tethered their sky's-the-limit wizardry to a typical Disney tale of wandering and redemption. After a frantic grab-ya opener, this buddy yarn is as engagingly simple as its technology is mind-boggling.",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "Thanks to Pixar's inherent wit, story sense and unerring ear for voice casting, its original charm and delight are intact.",
      "author": "Jim Lane"
    }
  ],
  "release_year": 1995,
  "duration": 81,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Fantasy",
    "Animation"
  ],
  "age_rating": "G",
  "synopsis": "Woody (Tom Hanks), a good-hearted cowboy doll who belongs to a young boy named Andy (John Morris), sees his position as Andy's favorite toy jeopardized when his parents buy him a Buzz Lightyear (Tim Allen) action figure. Even worse, the arrogant Buzz thinks he's a real spaceman on a mission to return to his home planet. When Andy's family moves to a new house, Woody and Buzz must escape the clutches of maladjusted neighbor Sid Phillips (Erik von Detten) and reunite with their boy.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/uXDfjJbdP4ijW5hWSBrPrlKpxab.jpg"
}