{
  "movie_name": "Us",
  "movie_id": "it_ends_with_us",
  "total_reviews": 190,
  "reviews": [
    {
      "text": "Its gravest sin, however, is that it doesn’t portray a broken cycle of abuse at all.",
      "author": "Audra Heinrichs"
    },
    {
      "text": "As distilled, it’s so turnkey, didactic and flat that it deducts from the traumatic real-life issue it seeks to dramatize.",
      "author": "Tom Meek"
    },
    {
      "text": "The theme serves as a reminder to domestic abuse victims that there is a way out. But it's questionable whether actor/director/producer Justin Baldoni will helm Colleen Hoover's sequel, \"It Starts With Us,\" which his Wayfarer Films has also optioned.",
      "author": "Susan Granger"
    },
    {
      "text": "The film is a tonal mess, mostly presented as a romantic comedy, although it’s really almost entirely about domestic violence",
      "author": "Stephen Silver"
    },
    {
      "text": "It’s rom-com meets trauma porn, deafeningly emotive in a way that for some will be too much and for others precisely what they are looking for.",
      "author": "Francesca Steele"
    },
    {
      "text": "Whatever your issues with the source material, Hoover at least tried to dig into the generational cycle of abuse. Baldoni wants to couch all that in rom-com trappings, diluting the impact and ending up with something more mawkish than moving.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "…the violence done by men to women is such an omnipresent element of today’s daily news cycle that it usually goes uncommented on; IEWU puts these elements front and centre, and that fresh, fearless content seems to be what audiences want to see in droves",
      "author": "Eddie Harrison"
    },
    {
      "text": "Rich in character and incident, but tonal inconsistencies and some narrative fudging blunt its overall impact.",
      "author": "Matt Brunson"
    },
    {
      "text": "The film appears well-intentioned, but it’s inability to keep its focus on Lily, to center her journey absent the will-they-won’t-they rom-com elements, and to present the film with a coding of danger, makes the experience a vapid one ... .",
      "author": "Douglas Davidson"
    },
    {
      "text": "It Ends with Us has an important message about domestic violence that it wants to get across, but sadly it ends up getting clumsily handled in a story that's buried under a pile of cliches & extreme coincidences.",
      "author": "Jeff Beck"
    },
    {
      "text": "Weaknesses aside, there is a good movie within the faltering framework. Some scenes have believable strengths because Baldoni is a superb director. Even with a cluttered screenplay, he knows how to tell a story that holds your interest as well as it does.",
      "author": "Michael Calleri"
    },
    {
      "text": "Based on the Colleen Hoover bestseller, Blake Lively’s ‘It Ends With Us’ is a tale of love, grief, abuse and rage that’s oddly disengaging",
      "author": "Mini Anthikad-Chhibber"
    },
    {
      "text": "It Ends with Us is a mess, but a fairly watchable one.",
      "author": "John Serba"
    },
    {
      "text": "The movie wants to be a form of comfort food, assuring us that everything would be all right if only women embraced their traditional roles as nurturers, mothers, and healers, but it all just tastes stale.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "This smart and sensitive movie version will more than satisfy the millions who’ve picked it up and found a bible of sorts for abuse survivors.",
      "author": "Philip De Semlyen"
    },
    {
      "text": "The film’s theme of how abuse occurs in generational cycles is noteworthy as we see Lily’s stalwart goal of breaking that cycle--excellent messages about the topic of physical abuse and self-worth.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "The plot... along with the co-mingled romantic comedy tropes, [date] and [cheapen] the film drastically, despite the care it brings to its more sensitive elements.",
      "author": "Clara Cuccaro"
    },
    {
      "text": "It’s an unapologetic melodrama through and through, fully aware that we do still go to the movies to watch impossibly gorgeous people existing well behind their means living ordinary lives with relatable problems.",
      "author": "Scott Mendelson"
    },
    {
      "text": "This melodrama on spousal assault forgoes psychological and character complexities for congenial viewing.",
      "author": "Whang Yee Ling"
    },
    {
      "text": "After more than two hours, It Ends With Us gets to [Lily's] self-actualization, but it’s difficult to shake the feeling that it could have gotten there much faster and more meaningfully.",
      "author": "Mel Valentin"
    },
    {
      "text": "Until a crucial confrontation scene, “It Ends With Us” suggests too many outs for comfort. Lively doesn’t reveal the most important stories in her life and ends up reliving them. Baldoni’s character keeps his cards close to the vest, too.",
      "author": "Bruce R. Miller"
    },
    {
      "text": "Those looking for a genre-redefining cinematic masterpiece or expecting a line-by-line remake will leave the theater disappointed. But those searching for a good enough drama with a few standout performances will get their money’s worth...",
      "author": "Brooks Eisenbise"
    },
    {
      "text": "A well-acted, though somewhat overlong romantic drama.",
      "author": "Casey Chong"
    },
    {
      "text": "Well-intentioned. .... While fans of Colleen Hoover’s best-selling novel might enjoy it, others might find it as contrived as some of the protagonist’s elaborate flower arrangements.",
      "author": "Valerie Kalfrin"
    },
    {
      "text": "I didn't see anything in this film that was of tremendous interest or hadn't been done before and better.",
      "author": "Peter Rainer"
    },
    {
      "text": "Director Justin Baldoni brings Colleen Hoover's beloved novel adaptation to life beautifully.",
      "author": "Lauren Veneziani"
    },
    {
      "text": "This is the steamy romance you want your teens to see.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "Blake Lively is lovely in 'It Ends With Us,' but this domestic abuse film needed less 'Sweet Home Alabama' and more black eyes and bloody noses.",
      "author": "Mark Jackson"
    },
    {
      "text": "I enjoyed it and the audience reactions back me up, with some saying it's better than the book. Grade: B+ from me.",
      "author": "Derek Sante"
    },
    {
      "text": "The plot of 'It Ends With Us' does not forget that part of the success of the book it comes from is based on the emotions of its characters. [Full Review in Spanish]",
      "author": "Aglaia Berlutti"
    },
    {
      "text": "It's similar to a Lifetime movie. It's decent, but flawed",
      "author": "Michael Cook"
    },
    {
      "text": "“It Ends with Us” is an unforgettable, compelling story that will move all audiences.",
      "author": "Susan Kamyab"
    },
    {
      "text": "I’m all for getting behind a melodramatic story that is clearly appealing to audiences who are not always well-served by theatrical releases, but being glossy and soapy can only get a movie so far.",
      "author": "Aaron Neuwirth"
    },
    {
      "text": "Although the narrative may seem predictable in some aspects, the film presents unique elements, such as the way the camera captures episodes of violence, reflecting people's tendency to ignore such signs. [Full review in Spanish]",
      "author": "Gisela Savdie"
    },
    {
      "text": "Blake Lively provides a strong entertainment core for this affecting romance/drama.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "It Ends With Us has lofty goals it ultimately cannot meet, and the end result is a bad film that is borderline insulting in its depiction of the very subject it seeks to explore.",
      "author": "Sarah Marrs"
    },
    {
      "text": "There are only brief moments of intensity, none of which are brave enough to do anything but hint at what's really going on.",
      "author": "Lisa Trifone"
    },
    {
      "text": "Lively does well as the conflicted star of the piece, assured at every point of her character's emotional journey.",
      "author": "Terry Staunton"
    },
    {
      "text": "It Ends With Us is well-made, but ultimately over-stuffed. There is a good film buried somewhere inside this Lifetime movie facade, making it even more frustrating to have to sit through.",
      "author": "Micheal Compton"
    },
    {
      "text": "The gaze feels like it’s a bit too obsessed with Blake’s beauty than her ability to bring a character to life. If you don’t look for relatability, you won’t mind watching this one more for the glamour than the substance.",
      "author": "Renuka Vyavahare"
    },
    {
      "text": "It's a realistic look at domestic violence that answers the question: 'Why doesn't she just leave?'",
      "author": "Linda Cook"
    },
    {
      "text": "On the other hand, the creative decision... to structure the adaptation with the same point of view of the novel is very successful: Lily lives and narrates everything that happens. [Full review in Spanish]",
      "author": "Natalia Trzenko"
    },
    {
      "text": "As often happens, the theme may be attractive rather than captivating, yet the form is not. And that's what happens with this film, which is also very long.",
      "author": "Pablo O. Scholz"
    },
    {
      "text": "The movie isn’t disgraceful, but we may have a hard time distinguishing it from the usual Hallmark or Lifetime fodder aside from the star power of Lively and the bestselling imprimatur of Hoover.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "Too much caution keeps \"It Ends with Us\" from living up to its full potential.",
      "author": "Rick Bentley"
    },
    {
      "text": "A really interesting, multi-layered drama.",
      "author": "tt stern-enzi"
    },
    {
      "text": "Both its heart and head remain in the right place throughout. Worth a look, particularly if the book means something to you.",
      "author": "Leigh Paatsch"
    },
    {
      "text": ".... It ends up being a rather obvious, clumsy, and banal experience. [Full review in Spanish]",
      "author": "Diego Batlle"
    },
    {
      "text": "While an adequate film with a good heart... its strange treatment of the most important themes and its fidelity to the original material makes the film feel somewhat superficial and fails to fully convince the average viewer. [Full review in Spanish]",
      "author": "Laia Cabuli"
    },
    {
      "text": "The same time, the movie's seductive slickness allows its seriousness to slide away too easily. So, I'll vacillate, as I think the movie does: It Ends with Us could have been better, but it also could have been a whole lot worse...",
      "author": "Robert Denerstein"
    },
    {
      "text": "Despite a very good performance by Blake Lively, the film is way too clean for its own good. Less in the depiction of domestic violence but in the smooth transition in which our heroine is able to leave it behind.",
      "author": "Erik Childress"
    },
    {
      "text": "Trauma is not a plot device to dangle around in order to amp up the drama.",
      "author": "Barbara Goslawski"
    },
    {
      "text": "A glossy romantic sudser that's well-meaning but too breezy to be convincing.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "The roots of an honest story are here but misguided decisions smother them at every turn. A book this popular was never going to be allowed the benefits of a free-wheeling adaptation, regardless of how much it would have improved the narrative.",
      "author": "Kayleigh Donaldson"
    },
    {
      "text": "Incredibly, Lively makes it all work. Beyond nailing Lily’s exact shade of auburn hair... she also conveys her luminousness and strength, and reminds you how pleasurable it can be to watch a romantic thriller.",
      "author": "Johanna Schneller"
    },
    {
      "text": "Blake Lively gives a moving performance in this inspiring story about the traumas we carry, and the power that each individual possesses to take control of their lives. [Full Review in Spanish]",
      "author": "Rene Sanchez"
    },
    {
      "text": "It’s not often a motion picture makes me physically ill.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "It Ends with Us  is not for me. If it’s for you more power to you. I hope you enjoy it.",
      "author": "Rachel Wagner"
    },
    {
      "text": "For a film that dips its Manolo-clad toe into the murky waters of domestic abuse, it’s unexpectedly aspirational, almost frothy in tone.",
      "author": "Wendy Ide"
    },
    {
      "text": "Anyway, it doesn’t really matter that It Ends With Us is cheesier than a wheel of Camembert and shallower than a toddler’s paddling pool because, you see, there’s a twist on its way.",
      "author": "Brian Viner"
    },
    {
      "text": "To young people who have become inured to the misery of modern life, there’s a seductive premise in these novels: Relentless suffering can give way to freedom if women want it badly enough. On-screen, performed by real people, it’s not as convincing.",
      "author": "Hannah Giorgis"
    },
    {
      "text": "Naturally this all feels dishonest, cloying, and clumsy, as Baldoni’s directorial prowess can’t match that of a halfway decent HBO series.",
      "author": "Brianna Zigler"
    },
    {
      "text": "I appreciate the fact that this is ultimately a film—and book—about ending the cycle of violence.",
      "author": "Max Weiss"
    },
    {
      "text": "Justin Baldoni directs a strong adaptation of the source material, being sensitive to the touchy subject matter and including full circle layers that add more meaning to moments in the film.",
      "author": "Kristen Maldonado"
    },
    {
      "text": "In this sense, the film leaves nothing to the viewer's imagination, it fulfills its didactic and moralistic purpose, the issues become clear, and the famous circle breaks, even if it is surrounded by flowers. [Full review in Spanish]",
      "author": "Elsa Fernández-Santos"
    },
    {
      "text": "Blake Lively is convincing and impressive in this complex role, but even better is her co-star Justin Baldoni, who does a multi-dimensional job bringing to creepy and disturbing life a character who's simultaneously seductive and dangerous.",
      "author": "Michael Medved"
    },
    {
      "text": "There is an incontrovertible charm to this film, and, I hate to say it, this dissenter has cleanly cut out her piece of humble pie.",
      "author": "Candice McMillan"
    },
    {
      "text": "The film’s emotional trajectory is gripping, and Blake Lively delivers a luminous performance as Lily.",
      "author": "Ayelet Dekel"
    },
    {
      "text": "This is not a perfect film, but it handles the important stuff — abuse, trauma and recovery — unexpectedly well.",
      "author": "John Nugent"
    },
    {
      "text": "“It Ends With Us” is fitfully diverting, at times touching, often ridiculous and, at 2 hours and 10 minutes, almost offensively long.",
      "author": "Manohla Dargis"
    },
    {
      "text": "While some of the plotting is obvious and dialogue a touch too portentous, as a director, Baldoni brings the same raw edge of hand-held camerawork and naturalistic lighting that marked out his Five Feet Apart as a cut-above the usual teen weepie.",
      "author": "James Croot"
    },
    {
      "text": "If you are a fan of Hoover’s novels, then this film is a must see. For moviegoers not in the know, it will be a horror show.",
      "author": "Sarah Vincent"
    },
    {
      "text": "It Ends with Us offers both fun and a point, and while the blend isn’t smooth, it’s admirably ambitious.",
      "author": "Emily Wheeler"
    },
    {
      "text": "The film concludes by asserting that domestic violence is far more complicated than Hollywood has historically given it credit for being, and anyone can be a perpetrator or survivor. It’s a powerful statement that it doesn’t quite earn the right to make.",
      "author": "Brandon Lewis"
    },
    {
      "text": "It is far from perfect, but It Ends with Us does offer enough solid substance to honour the heaviness of its source material in a film that, for all its flaws, takes the viewer on an effective emotional ride.",
      "author": "Jack Martin"
    },
    {
      "text": "Lively is the movie’s lifeblood. She gives a heartfelt performance that conveys both confidence and vulnerability while remaining authentic, even on the occasions when the material turns syrupy.",
      "author": "Keith Garlington"
    },
    {
      "text": "The narrative is a carefully constructed emotional rollercoaster, designed to pull us into the orbit of its characters before shattering our hearts just as theirs break.",
      "author": "Troy Ribeiro"
    },
    {
      "text": "Despite its over 2-hour runtime, It Ends With Us rushes through the plot, barely allowing enough time to process or feel Lily's trauma.",
      "author": "Steph Cozza"
    },
    {
      "text": "As a cultural statement, It Ends With Us doesn’t quite get there. As a personal exploration of what it feels like to be caught up in a cycle of violence, however, it’s a much more powerful big-screen experience.",
      "author": "Caroline Siede"
    },
    {
      "text": "A tearjerker that indulges in its red-meat drama, but then gives it the grace of shading and complexity -- and rare humanity.",
      "author": "Richard Lawson"
    },
    {
      "text": "A bungled adaptation that is at once too close to its source and too far from it.",
      "author": "Katie Walsh"
    },
    {
      "text": "After a surfeit of montages and Ms Blake contemplating Lily's journey through a veil of melancholy, it ends as predictably as it unfolded. Dull and stale though it may be, it does have the welcome virtue of being instantly forgettable.",
      "author": "Andrea Chase"
    },
    {
      "text": "[Lively] has a willowy vulnerability, an intriguing air of remote sadness and a soft, muffled voice that sounds as if she were speaking from within a pile of autumn leaves.",
      "author": "Tom Gliatto"
    },
    {
      "text": "Although the biggest moments are present and well-acted, they play like 'next, next, next' instead of an engrossing final act.",
      "author": "Harry Guerin"
    },
    {
      "text": "Between the flat acting, cheesy storytelling, and overall weird vibes, It Ends with Us is a cinematic failure on almost every front.",
      "author": "Audrey Fox"
    },
    {
      "text": "The frothy romance comedy lands better than the dark parts about men’s scary tempers, but on the whole, it’s one of the year’s more satisfying films.",
      "author": "Tim Appelo"
    },
    {
      "text": "Flowers, their short-lived beauty notwithstanding, can often brighten even the bleakest day. In this movie, they're treated like something we don't deserve, a blessing closed up tight, instead of a thing worth living for.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Lively is tasked with carrying the full weight of the story in “It Ends With Us” and she’s up to the challenge, but this is an uneven and turtle-paced romantic drama that feels like a missed opportunity.",
      "author": "Richard Roeper"
    },
    {
      "text": "The controversial bestseller written by Colleen Hoover makes for good trashy material, but the underlines in the message, direction, and performance leave the movie in limbo territory.",
      "author": "Nelson Acosta"
    },
    {
      "text": "There are a few shining moments where the performances come alive, but the majority of the film feels like a cookie-cutter addition to the genre that is more focused on making checkmarks on a list than delivering something a little more nuanced.",
      "author": "Matt Rodriguez"
    },
    {
      "text": "... downplays moral complexity and meaningful character dynamics in favor or treating weighty issues with a soap-opera gloss.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "The film’s flat, conventional structure lessens the impact of its vital message.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "It Ends with Us is a film about domestic abuse that may be seen as overly idealistic. It is nonetheless meaningful in portraying the power of healing and moving forward because of the main character’s dormant and suddenly active power of resilience.",
      "author": "M.N. Miller"
    },
    {
      "text": "The film teases out a darker story involving domestic abuse, but as a director, Baldoni manages to deal with it sensitively while embracing the melodrama of it all.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Is this a soap opera? For a while, that seems to be the case. But be patient because It Ends With Us is something more substantial. Plus, until it gets there, it’s a good soap opera, and that counts for something.",
      "author": "Mick LaSalle"
    },
    {
      "text": "The commitment to the story and characters is unmistakable, and Baldoni elicits performances of tautly focussed, high-relief earnestness...but what remains is a mechanism of thrilling power that's missing a touch of mere humanity.",
      "author": "Richard Brody"
    },
    {
      "text": "Bravely tackles difficult themes with sensitivity and depth, leaving audiences with a lasting impression of hope and the courage to rewrite one's own story.",
      "author": "Frank Wilkins"
    },
    {
      "text": "Despite the film's reliance on familiar tropes and occasionally simplistic dialogue, Lively’s instinctive and heartfelt portrayal ensures that its themes of self-acceptance and love are delivered with genuine grace.",
      "author": "Devesh Sharma"
    },
    {
      "text": "I went into it not expecting to be impressed by any means, but the film has the potential to resonate with its intended audience, and I have to admit that it touched my heart at moments.",
      "author": "Sarah Ksiazek"
    },
    {
      "text": "The movie's heavy themes make it a bit weightier than a summer breeze, but \"It Ends With Us\" is the big screen equivalent of a beach read: It's light on the eyes, easy to digest and simple to walk away from once it's over.",
      "author": "Adam Graham"
    },
    {
      "text": "While at times too bubble-wrapped to spare our comfort... the theme is well-broached. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "A baffling, overlong and tonally inconsistent exercise in tedium.",
      "author": "Daniel Pemberton"
    },
    {
      "text": "Ryle being written as a good guy gone bad feels dated, making this Hallmark version of domestic violence ill-equipped to deal with the weight of the subject.",
      "author": "Dulcie Pearce"
    },
    {
      "text": "Anchored by a mighty Blake Lively, 'It Ends with Us' brings Colleen Hoover's story to smartly cinematic and tremendously touching life.",
      "author": "Charlotte Simmons"
    },
    {
      "text": "It Ends With Us tries to balance heavy drama and conventional romance with some difficulties, but it manages to offer a minimally thought-provoking reflection on generational trauma and relationship abuse.",
      "author": "Manuel São Bento"
    },
    {
      "text": "Fighting their way out of the flowery tearjerking in the film version of Colleen Hoover’s mega-bestseller are a movie and a stellar Blake Lively performance that both take measure of domestic violence and the women who get to decide when enough is enough.",
      "author": "Peter Travers"
    },
    {
      "text": "Once we enter the more intense second half, the film struggles to hold up its end. It never feels quite sad or suspenseful enough to meet the demands of its heavy subject matter.",
      "author": "Dana Barbuto"
    },
    {
      "text": "Although there are some good intentions to be found within the confused melodrama It Ends with Us, they’re lost in a sea of odd choices and mixed messaging.",
      "author": "Andrew Parker"
    },
    {
      "text": "Despite its flaws, It Ends With Us is a must-watch. Its portrayal of abuse, though less violent, evokes strong reactions from audiences.",
      "author": "Allison Rose"
    },
    {
      "text": "Abuse is a thorny, ugly subject, and nobody wants to see explicit representations of it on screen, but It Ends with Us, while well-meaning, simplifies the issue to the point of melodrama. Sincere melodrama, but melodrama none the less.",
      "author": "Richard Crouse"
    },
    {
      "text": "It Ends With Us has a lot more substance than you’d think, even if it often lacks ambition.",
      "author": "Maria Lattila"
    },
    {
      "text": "That the film largely avoids any bombastic moralizing makes its message all the stronger and all the more moving.",
      "author": "Jim Schembri"
    },
    {
      "text": "It Ends With Us is a mixed bag of great acting and good direction begging to escape its hazy narrative.",
      "author": "Brittany Patrice Witherspoon"
    },
    {
      "text": "This film had a lot going for it, but becomes a tearjerker melodrama misfire. Starring the gorgeous Blake Lively, two attractive sexy men, up-scale settings and revealing high-end fashions, there’s inauthenticity about the characters and the main theme.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "[T]he whole thing comes across as a cheesy romance that makes a misguided effort to do something far more serious by the end.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Though replete with ridiculous character names and incredibly cheesy dialogue, the film manages to successfully blend its rather unserious, flowery façade with its heavy subject matter.",
      "author": "Sophie Terakes"
    },
    {
      "text": "Lively is appealing and Justin Baldoni, who also plays one of Lively’s romantic partners, does passable work, but this well-meaning film version is a bit too contrived for full emotional impact.",
      "author": "Russ Simmons"
    },
    {
      "text": "The themes are powerful, and the acting — particularly Blake Lively in the staring role — is for the most part excellent.",
      "author": "Chris Knight"
    },
    {
      "text": "Unfortunately, the slipshod screenplay, which relies on ridiculous circumstances to move the story along, lays a shaky narrative foundation that fails to treat the characters' problems with the weight they deserve.",
      "author": "Charles Koplinski"
    },
    {
      "text": "Even when the story beats are at their most predictable — several shots are devoted to Lively’s Lily looking in a mirror and applying concealer to an injury to her face — Lively brings her enormous empathy to them.",
      "author": "Sean P. Means"
    },
    {
      "text": "As close as a filmed version of a novel can be to a book, scene by scene, line by line. The fans of the novel who were in the audience at the screening I saw thought this was just fine, and they sighed happily along.",
      "author": "Nell Minow"
    },
    {
      "text": "The serious message of It Ends With Us may not be fully served by its relatively muted storytelling, but Baldoni and Hall justify their approach in a series of small ways that add up a satisfying whole.",
      "author": "Alex Bentley"
    },
    {
      "text": "For all its eyeroll-worthiness, it proves to be one of the more sensitive and progressive explorations of abuse I’ve seen on screen.",
      "author": "Dan Scully"
    },
    {
      "text": "It Ends with Us does conclude with an emotional, believable exchange that needs to be heard by domestic abusers around the world. It’s a shame the rest of the film is outlandish and doesn’t cut nearly as deep",
      "author": "Robert Kojder"
    },
    {
      "text": "A wonderful edgy romantic drama with a powerful message at its core. A sexy rom-com that sneaks on you, while it explores trauma, trust, choices and love. Blake Lively and Justin Baldoni are great. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Guilty pleasure alert! This is a goodie!",
      "author": "Kevin Maher"
    },
    {
      "text": "It Ends With Us pours most of its nuance into the beginning, middle, and harrowing climax of its central relationship.",
      "author": "Kimberley Jones"
    },
    {
      "text": "Baldoni and company’s approach to capturing a woman in an abusive relationship, though, offers nothing new. Everything is boilerplate.",
      "author": "Lisa Laman"
    },
    {
      "text": "None of the main characters are really allowed to bloom (pardon the pun), hindered by the surface-level soapiness of both Hoover's original tale and Hall's adaptation, as well as the overly slick, music-montaged direction of Baldoni.",
      "author": "Christina Izzo"
    },
    {
      "text": "It Ends With Us is a strange mixture of swoony romance and literal gut-punch, filled with odd choices, flat dialogue and occasional comic relief in the form of Jenny Slate.",
      "author": "Moira MacDonald"
    },
    {
      "text": "“It Ends With Us” is, despite its failings and indulgences, a highly emotional and absorbing couple of hours.",
      "author": "Johnny Oleksinski"
    },
    {
      "text": "In Baldoni’s hands, It Ends with Us plays like a too-hot-for-TV episode of This is Us, in which the only thing missing from the dynamic is a Crock Pot fire and an additional three treacly speeches.",
      "author": "Nick Johnston"
    },
    {
      "text": "At the very least, I hope everyone can agree on the fact that It Ends With Us is a poignant story that showcases the resilience of domestic abuse survivors and what courage it takes to find the strength to walk away.",
      "author": "Emma Vine"
    },
    {
      "text": "The multiple montages at least cut down on the dialogue, which is risible.",
      "author": "Sandra Hall"
    },
    {
      "text": "The weighty subject of domestic abuse gets glossy soapoperatic treatment... With some standard-issue rom-com beats added to the mix, the combination of serious message and overripe packaging makes for a tonally unsteady, unsatisfying whole.",
      "author": "Frank Swietek"
    },
    {
      "text": "This adaptation of Hoover's bittersweet tale gets a lot of things right.",
      "author": "Hannah Rose"
    },
    {
      "text": "An attractive, tactful, pertinent little film on the subject, one you hope grabs as many eyeballs as the novel did on BookTok and Bookstagram.",
      "author": "Jinal Bhatt"
    },
    {
      "text": "Devoid of plausible characterizations, decision-making, and plotting, it’s a dud of epic proportions—literally, as its 130-minute runtime makes it feel like it’ll never end.",
      "author": "Nick Schager"
    },
    {
      "text": "It Ends with Us packs a powerful punch in a contrived but harrowing journey of self-realization. What begins as a thrilling romance transforms into a deceptively destructive relationship with iron tentacles.",
      "author": "Julian Roman"
    },
    {
      "text": "It kind of works for the same reasons people indulge in mindless reality television - looking at you “Bachelorette” fans - because we know and expect it’ll be a little formulaic and cheesy.",
      "author": "Nate Adams"
    },
    {
      "text": "Having a movie that starts out as one thing but effectively delivers such a message may be why Hoover’s book was so popular, and I imagine that will help this film do just as well.",
      "author": "Edward Douglas"
    },
    {
      "text": "An outsized, soapy fantasy of heartbreak and resilience that only falters when it tries to ground itself in reality. I would have liked the movie better if it were even cornier.",
      "author": "Sean Burns"
    },
    {
      "text": "Much of the dialogue did not work for me, even lines pulled directly from the book did not strike the same. I did not feel the spark between Lily and Ryle at all. \nJenny Slate was perfect as Allysa and stole every scene she was in.",
      "author": "Wendy Lee Szany"
    },
    {
      "text": "Whatever its faults, there’s something to be said for the way in which it gets to the essence of its source material, delivering an emotional experience that manages to be both clear-eyed and thorny in its complexity.",
      "author": "Luke Goodsell"
    },
    {
      "text": "“Us” has the power of the book driving its appeal, but there’s something about this cinematic representation of doubt and danger that makes Hoover’s work seem ridiculous, or worse when it comes to trivializing real-world pain.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Contrived, shallow and so saccharine that it might give you a cavity.",
      "author": "Avi Offer"
    },
    {
      "text": "An important message about domestic violence in “It Ends with Us” is diluted by the film adaptation’s shallow, superficial trappings that favor a glossy lifestyle magazine approach to a serious issue.",
      "author": "Lynn Venhaus"
    },
    {
      "text": "Despite the wobbly mix of the lightweight and the extremely serious, Lively keeps Lily's feet firmly on the ground. You may not leave wanting to know what happens next, but this ending feels earned.",
      "author": "Anthony Morris"
    },
    {
      "text": "Lively’s poignant performance truly elevates what could have devolved into a cloying Hallmark moment. The adroit adaptation heartily serves its core audience.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "Like popular book club fiction, the romance connects with an audience yearning for strong emotions, toggling between the height of romantic love and the depth of domestic violence until the redemptive end.",
      "author": "Thelma Adams"
    },
    {
      "text": "Although it's about as well crafted as a discounted IKEA kitchenette, It Ends with Us does manage to land some relevant facets about domestic abuse in its own overtly glossy, ham-fisted way.",
      "author": "Nicholas Bell"
    },
    {
      "text": "[It Ends With Us] tries to balance the realities of domestic violence inside a rom-com and a female-empowerment movie. All suffer in the process.",
      "author": "Mark Kennedy"
    },
    {
      "text": "The film’s theme of how abuse occurs in generational cycles is powerful as we see Lily’s aim to break the cycle that exists so commonly in the world. All we can do throughout is hope that it ends with her.",
      "author": "Jonathan Sim"
    },
    {
      "text": "It Ends with Us is an occasionally schlocky and saccharine novel, but Justin Baldoni’s film adaptation uses an ace script and stellar performances -- particularly that of lead Blake Lively -- to elevate Colleen Hoover’s story to its cinematic peak.",
      "author": "Lena Wilson"
    },
    {
      "text": "Talented performances from the principal cast members give emotional resonance to the melodrama in It Ends With Us. This worthy book adaptation effectively shows how abuse and generational trauma can be toxic when mixed with love and loyalty.",
      "author": "Carla Hay"
    },
    {
      "text": "Fans pant for romantic male leads who blur the line between passionate and aggressive — and that murk is exactly what the story explores. How can an extravagant gesture double as a red flag?",
      "author": "Amy Nicholson"
    },
    {
      "text": "Colleen Hoover’s bestselling novel is now a middling Hollywood romance.",
      "author": "Rafer Guzman"
    },
    {
      "text": "It’s a plot of hackneyed soap tropes but there’s a real maturity to how it unfolds, a story of abuse that’s far less obvious than we’ve grown accustomed to, the details far knottier than some might be comfortable with.",
      "author": "Benjamin Lee"
    },
    {
      "text": "As a survivor of domestic violence myself, I'm grappling with a movie that gets so much right but is ultimately trying to grow a garden in the poisoned soil of bad source material.",
      "author": "BJ Colangelo"
    },
    {
      "text": "While It Ends with Us is lacking in nuance, it delivers a message of bravery and hope in the form its audience will be most receptive to hearing it.",
      "author": "Travis Hopson"
    },
    {
      "text": "Blake Lively is good enough to keep us invested in a lazy-afternoon-cable kind of way, but there are just too many things wrong here, including her schizophrenic costume design…serious issues shouldn’t be cloaked in soapy fantasy.",
      "author": "Laura Clifford"
    },
    {
      "text": "The characters and their emotional truths prop the movie up, but it’s lacking something, perhaps a greater depth. So much of It Ends With Us feels like an appetizer for a meal that is never served.",
      "author": "Sherin Nicole"
    },
    {
      "text": "If an overly long, sexless YA abuse drama with odd casting that reads like an Afterschool Special sounds appealing, It Ends with Us will satisfy.",
      "author": "Joseph Robinson"
    },
    {
      "text": "It Ends With Us might have inherited some unescapable aspects of its source material, but some smart changes and a luminous Blake Lively make up for part of it.",
      "author": "Mireia Mullor"
    },
    {
      "text": "It Ends With Us does have plenty of problems, but considering the dangerous line it treads, it could have turned out a lot worse.",
      "author": "Sean Boelman"
    },
    {
      "text": "One minute Lively shakes her curls and wears the heck out of dungarees and vintage layers. The next is very different. Loyal fans will be pleased. Untold millions of BookTok users can’t be wrong, surely.",
      "author": "Tara Brady"
    },
    {
      "text": "As a survivor, It Ends With Us offers nothing but stress without an ounce of catharsis.",
      "author": "Jason Flatt"
    },
    {
      "text": "This is a film that leans into its cliches — long, loving nights transform into windswept mornings, ardent dialogue teases obsession — and smartly uses them to enact triggering lessons about generational trauma.",
      "author": "Robert Daniels"
    },
    {
      "text": "It Ends With Us boasts an important message but doesn’t stick the landing with its delivery.",
      "author": "Abe Friedtanzer"
    },
    {
      "text": "Saved by Blake Lively performance. A melodrama that feels like a montage of emotion",
      "author": "Zach Pope"
    },
    {
      "text": "It Ends With Us most closely resembles a high-budget, competently-produced Lifetime Original Movie.",
      "author": "Trace Sauveur"
    },
    {
      "text": "It Ends with Us means well, and Lively is committed to the cause. But it’s a Hallmark-esque adaptation, aimless and nondescript, with too many weepy pop tunes in the mix. They’re also pushing it with that 130-minute runtime.",
      "author": "Chris Wasser"
    },
    {
      "text": "A visual headache, overcrowding every frame with colour, texture and patterns, rather than building to some carefully orchestrated tension.",
      "author": "Anna McKibbin"
    },
    {
      "text": "Lively does her best to add emotional layers to Lily so we see her internal growth, but this process is often hampered by the film around her.",
      "author": "Marya E. Gates"
    },
    {
      "text": "What Baldoni gets right, just like the novel, is relaying a tale of how many relationships, which begin with the utmost love, can unfortunately sour.",
      "author": "Dessi Gomez"
    },
    {
      "text": "A serious subject is sensitively handled in a drama that’s otherwise just tear-jerking soap opera.",
      "author": "Neil Smith"
    },
    {
      "text": "...It Ends With Us keeps the essence and the spirit of the book.",
      "author": "Danielle Solzman"
    },
    {
      "text": "Even with all the cards stacked in his favor, Baldoni's lackluster direction is what kills the emotion.",
      "author": "Meredith G. White"
    },
    {
      "text": "It’s not Lively’s fault that she’s so weakly defined as a character, but her performance still verges on vacuous, and Baldoni’s on overbearing.",
      "author": "Tim Robey"
    },
    {
      "text": "It Ends with Us is capable of poignancy. Yet it’s also entirely ill-equipped to square such sensitive material up against scenes of diamanté boots being sensually rolled down.",
      "author": "Clarisse Loughrey"
    },
    {
      "text": "A mix of tones that doesn’t always work, but often feels like a throwback to a different era of movie-making, one where the mid-budget movie willing to delve into issues was a viable business model. In that way, it’s a successful endeavor.",
      "author": "Esther Zuckerman"
    },
    {
      "text": "It can’t be denied that the audience that made [Colleen] Hoover’s initial words such a success are likely to lap up such mawkishness, but there’s a deeper, darker iteration of this story that could – and should – be told.",
      "author": "Peter Gray"
    },
    {
      "text": "Armed with a script by “Daddio” filmmaker Christy Hall, “It Ends with Us” manages to sensitively handle its delicate subject matter, though largely at the cost of a more intricate narrative.",
      "author": "Proma Khosla"
    },
    {
      "text": "An avid and emotional movie that pulls you right along. If you go in not knowing what it’s about, and are therefore all the more surprised by where it goes, it may be even more effective.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "It’s challenging to be totally on board with a film like this since it tries too hard to tell us it’s on the heroine’s side when there’s ample evidence it’s only partially in her corner.",
      "author": "Courtney Howard"
    },
    {
      "text": "The screenplay, by Daddio director Christy Hall, makes an effort with some early winking jokes that acknowledge the novel’s clichés. But the adaptation can’t be saved from the contrivance baked into the original text.",
      "author": "Lovia Gyarkye"
    },
    {
      "text": "This dark and melodramatic story could easily have taken a turn into Lifetime territory. But Lively and her director/co-star Justin Baldoni keep it on track.",
      "author": "Emily Zemler"
    },
    {
      "text": "As a whole, Baldoni's directorial effort isn't made for the fans who were drawn in by the love triangle, but rather intended for the audiences who resonate with Lily's journey, and maybe that is for the better.",
      "author": "Isabella Soares"
    },
    {
      "text": "This is a visually striking film that struggles to balance its artistic vision with the weight of its subject matter. The result is an adaptation that leaves the viewer wishing for a more grounded and sincere portrayal of its poignant themes.",
      "author": "Linda Marric"
    },
    {
      "text": "The warmth and earnestness exuding from every frame of “It Ends With Us” wouldn’t be possible without such investment in the material. That same earnestness, though, is precisely what holds the film back in its final scenes.",
      "author": "Dan Bayer"
    }
  ],
  "release_year": 2024,
  "duration": 130,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "IT ENDS WITH US, the first Colleen Hoover novel adapted for the big screen, tells the story of Lily Bloom, a woman who overcomes a traumatic childhood to embark on a new life in Boston and chase a lifelong dream of opening her own business. A chance meeting with charming neurosurgeon Ryle Kincaid sparks an intense connection, but as the two fall deeply in love, Lily begins to see sides of Ryle that remind her of her parents’ relationship. When Lily’s first love, Atlas Corrigan, suddenly reenters her life, her relationship with Ryle is upended, and Lily realizes she must learn to rely on her own strength to make an impossible choice for her future.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/cSMdFWmajaX4oUMLx7HEDI84GkP.jpg"
}