{
  "movie_name": "WALL-E",
  "movie_id": "wall_e",
  "total_reviews": 257,
  "reviews": [
    {
      "text": "It’s a remarkable accomplishment, and it only gets better with time.",
      "author": "Cory Woodroof"
    },
    {
      "text": "Stanton directs a masterpiece that is to behold forever among the greatest animated films.",
      "author": "Brian Susbielles"
    },
    {
      "text": "Clever and endearing. I would not call this essential viewing but I enjoyed it more than I expected.",
      "author": "Eve Tushnet"
    },
    {
      "text": "The tale of a trash compactor from the future who's desperate for connection isn't just one of Pixar's unlikeliest successes, but its most arresting and prescient.",
      "author": "Adam Nayman"
    },
    {
      "text": "WALLE stands as the studios crowning achievement.",
      "author": "Brian Eggert"
    },
    {
      "text": "Gorgeous visuals, unmatched animation, and wondrously moving scenarios mask a relatively simple story of love.",
      "author": "Mike Massie"
    },
    {
      "text": "Hollywood gets it right and kudos go to Pixar/Disney for the beautiful, touching, funny, and unforgettable Wall-E.",
      "author": "Richard Propes"
    },
    {
      "text": "A charming love story of two lonely robots surrounding a satire of consumer culture. Strong stuff.",
      "author": "Michael J. Casey"
    },
    {
      "text": "WALL-E is one of the best animated films of the century.",
      "author": "Danielle Solzman"
    },
    {
      "text": "A delightful family film full of wonder and plenty of heart.",
      "author": "Micheal Compton"
    },
    {
      "text": "Ultimately, WALL-E is about nothing less than one of the tenets of human existence: the need to find a partner with whom to share life's experiences.",
      "author": "Matt Brunson"
    },
    {
      "text": "A sweeping, glorious spectacle that never loses sight of its heart or the simple, heartrending love story at its core.",
      "author": "Mattie Lucas"
    },
    {
      "text": "One of the most gorgeous animated films ever made- CG or 2D.",
      "author": "Rachel Wagner"
    },
    {
      "text": "Wall-E is near the top of the list of films I call \"friendship killers.\"",
      "author": "Kenneth R. Morefield"
    },
    {
      "text": "Wall-E is Chaplinesque in the worst way.",
      "author": "Eileen Jones"
    },
    {
      "text": "It's an eclectic and often quite daring mixture of elements-yet it all coheres wonderfully.",
      "author": "Christian Caryl"
    },
    {
      "text": "Much of the film is wonderfully imagined, and there is something utterly winning about this tin can topped with binoculars... It's just a shame that, at the end, it trips itself up with its own SENTIMENTALITE.",
      "author": "Deborah Ross"
    },
    {
      "text": "Although the title character's arc is juxtaposed by the troubling dystopia on the Axiom, it nonetheless brings light to both Pixar's gloriously unique protagonists and real-world issues.",
      "author": "Tyler Christian"
    },
    {
      "text": "Although Wall-E ends with a very apt and moving nod to City Lights, it is in fact Pixar's answer to Modern Times-both a bravura summation of everything the studio is great at and a \"You ain't seen nothing yet!\" statement of purpose.",
      "author": "Glenn Kenny"
    },
    {
      "text": "If Wall-E has anything original to say, it takes place in the first 30 minutes on a planet heaped high with junk. But the parallels between fiction and reality are almost too painful to contemplate.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "Yeah, Pixar movies are usually good, but this one's unimaginably great.",
      "author": "Annie Wagner"
    },
    {
      "text": "Wall*E is poised to take its place alongside other Pixar instant classics.",
      "author": "Julie Washington"
    },
    {
      "text": "To carry the film for as long as it does with virtually no dialogue... that's to me the magic of animation.",
      "author": "Margaret Pomeranz"
    },
    {
      "text": "Director Andrew Stanton has pulled off a remarkable achievement here.",
      "author": "David Stratton"
    },
    {
      "text": "The latest entry in the Pixar stable is a modern classic - both an animated thrill ride, and a chilling tale of lost humanity.",
      "author": "Simon Miraudo"
    },
    {
      "text": "It indeed feels 'new', moving out of Pixar's comfort zone while retaining the brand's populist virtues: loveable characters, crafted jokes, aw-shucks niceness and wonderful images.",
      "author": "Andrew Osmond"
    },
    {
      "text": "We've come to expect brilliance from the digital wizards at Pixar, but WALL*E is pure genius.",
      "author": "Katherine Monk"
    },
    {
      "text": "WALL-E dazzles, particularly in its magnificent first half-hour, a post-apocalyptic love-story in miniature that serves as a graceful introduction to the intergalactic journey that follows.",
      "author": "Chris Wisniewski"
    },
    {
      "text": "Can Earth be reclaimed? The answer's a hopeful one (more Spielberg, less Kubrick), perfectly in toon (ahem) with the tale of a rickety old PC who wins the heart of a Mac.",
      "author": "Brett Michel"
    },
    {
      "text": "Much of the joy here comes from the aesthetic clash between the metallic sweethearts.",
      "author": "Ryan Gilbey"
    },
    {
      "text": "To see these ideas delivered so profoundly speaks volumes to the power animation possesses in cleansing minds weathered by the cynicism of adulthood.",
      "author": "David Keyes"
    },
    {
      "text": "This is a movie with genuine heart.",
      "author": "Stella Papamichael"
    },
    {
      "text": "As a film critic who has spent too many summers viewing mediocre misfires and uninspired reinterpretations of TV shows, comic books and cult classics, it's immensely satisfying to recommend something as breathtakingly glorious as WALL-E.",
      "author": "Jeff Meyers"
    },
    {
      "text": "Pick any 24th of a second, frame it and you could hang it on a museum wall.",
      "author": "Ali Gray"
    },
    {
      "text": "WALL-E sparks with genuine creativity.",
      "author": "Ben Kenigsberg"
    },
    {
      "text": "I wonder a little what kids will make of the long silence of the first half followed by the disorienting mania of the second, but there's nothing here that's not wonderfully imagined and lovingly presented.",
      "author": "Dave Calhoun"
    },
    {
      "text": "It's a breathtaking, inspirational film, transcending the medium of animation and blossoming into a genuinely magnificent piece of cinema.",
      "author": "Simon Reynolds"
    },
    {
      "text": "This film deserves the Oscar. It deserves every Oscar. And a Nobel Prize for brilliantness. And I bet it would win it too if I hadn't just made it up...",
      "author": "Mike Edwards"
    },
    {
      "text": "It's not often that you find 'post-apocalyptic' and 'delightful' going together in the same sentence, but they're essential to describe the deceptively artful Wall-E.",
      "author": "Joshua Starnes"
    },
    {
      "text": "Some found ecological undertones too scolding. But the question of what happens to trash is a nice undertone - never overshadowing the endlessly renewable entertainment of \"WALL-E's\" plucky protagonist & carefully, comically choreographed physical humor.",
      "author": "Nick Rogers"
    },
    {
      "text": "Captivating",
      "author": "Fernando F. Croce"
    },
    {
      "text": "That it ultimately falls short reflects less a failing than a raising of the bar: when you aim this high, you can beat all the competition even if you fail to set a new world record.",
      "author": "Steve Biodrowski"
    },
    {
      "text": "Vastly overrated movie with all the charm of two vacuum cleaners making love.",
      "author": "Louis Proyect"
    },
    {
      "text": "Disney-Pixar's greatest film yet; one of the ten best movies of 2008",
      "author": "Fr. Chris Carpenter"
    },
    {
      "text": "Ladies and gentlemen: believe the buzz! WALL-E is a bona-fide, all out masterpiece.",
      "author": "Chris Bumbray"
    },
    {
      "text": "...flat-out thrilling in its uniqueness...",
      "author": "David Nusair"
    },
    {
      "text": "Not about high profile characters or big action, it delights by entertaining and inspiring more subtly. Who expected that from any movie these days, let alone an animated one?",
      "author": "Brian Webster"
    },
    {
      "text": "Simplicity and complexity harmonize together in cinematic zen in the instant-classic WALL-E, a film that uses technical prowess to tell a straight-forward yet far-reaching story.",
      "author": "Ryan Cracknell"
    },
    {
      "text": "The most ambitious, visually-breathtaking film from the animation stable to date, pushing family entertainment to new limits of thoughtfulness and imagination, and offering unprecedented challenges to young minds.",
      "author": "Mike Goodridge"
    },
    {
      "text": "The most consistent production unit in Hollywood just hit another home run.",
      "author": "Tom Charity"
    },
    {
      "text": "Among its many wondrous achievements, the animated WALL-E is a sci-fi trifecta: a vision of the future, a tale for our times and a blast from the past.",
      "author": "Joe Williams"
    },
    {
      "text": "WALL-E is everything that you've come to expect from a Pixar movie. It's sweet, clever, funny, and visually stunning... but man, does Pixar swing a big stick this time around.",
      "author": "David Medsker"
    },
    {
      "text": "WALL-E is something completely different for the kiddie crowd that will hold the attention of adults even with the 'G' rating.",
      "author": "Jonathan W. Hickman"
    },
    {
      "text": "Eco-friendly, pro-exercise and featuring a glorious use of a fire extinguisher, Wall-E sparks with genuine creativity.",
      "author": null
    },
    {
      "text": "Ultimately, the elevation of technology to center stage, and the relegation of humankind to supporting act, left me cold.",
      "author": "Jason Di Rosso"
    },
    {
      "text": "A visual tonic of a film, wise enough to give its audience plenty of space.",
      "author": "Vicky Roach"
    },
    {
      "text": "A rich and provocative work of art that manages to be fun.",
      "author": "Evan Williams"
    },
    {
      "text": "If anyone doubted that Pixar is the most creative outfit in modern motion pictures, this movie should convince them. It is a genuine masterpiece, a word I don't use often.",
      "author": "Paul Byrnes"
    },
    {
      "text": "It's a credit to the animators that they were able to create believable emotions in these beeping hunks of computer-generated metal.",
      "author": "Colin Newton"
    },
    {
      "text": "What transpires is a delightful and almost heartbreakingly tender love story between these two expressive and adorable characters.",
      "author": "Pauline Adamek"
    },
    {
      "text": "Despite an intriguing story, the picture falls from Art to the realm of kiddy-film fare. I'd have loved to see Pixar limit the dialogue to two words: Eva and Wall-E.",
      "author": "Ross Anthony"
    },
    {
      "text": "In what must be a tongue in cheek nod to his Antipodean origins, writer/director Andrew Stanton has named the CEO of By N Large, Shelby Forthright (the only genuine human seen in the film)",
      "author": "Andrew L. Urban"
    },
    {
      "text": "Wonderfully inventive, this whimsical sci-fi animation from the wizards at Pixar is topical in its environmental message and full of heart when it comes to its robot/ droid romance. Brilliant execution",
      "author": "Louise Keller"
    },
    {
      "text": "Saving the world became secondary to the power of holding hands. There is an amazing amount of life and humanity throughout and a quality message to boot.",
      "author": "Jeff Bayer"
    },
    {
      "text": "Charming, funny and entertaining. All you've come to expect from the greatest animation house in the history of cinema.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Stanton finds more success with a tender, thoughtful and terrific-looking animated film.",
      "author": "Todd Gilchrist"
    },
    {
      "text": "That's the beauty of Pixar, behoden only to its own quality standards, it can still play the part of the child prodigy whose creative genius appears to have no boundaries.",
      "author": "Bruce Bennett"
    },
    {
      "text": "One of the most imaginatively made and individual pieces of work that the audacious Pixar has developed.",
      "author": "Derek Malcolm"
    },
    {
      "text": "Praise Pixar for trying to raise the stakes, but the longer the film goes on the more one appreciates the impact of that amazing first half-hour.",
      "author": "Anthony Quinn"
    },
    {
      "text": "It is delicious for 30 minutes. Then the plot starts.",
      "author": "Nigel Andrews"
    },
    {
      "text": "It is indeed a hard movie to explain, but a good story told well transcends any age even without words.",
      "author": "Lina Das"
    },
    {
      "text": "A bold, beautiful achievement.",
      "author": "Jonathan Dean"
    },
    {
      "text": "The wit, invention and sheer charm of WALL-E will win over anyone with a heart. And maybe, given long enough, even those without.",
      "author": "Rich Phippen"
    },
    {
      "text": "The confidence and skill with which Stanton's team have extended the parameters of their art form are amazing.",
      "author": "Sukhdev Sandhu"
    },
    {
      "text": "Does Andrew Stanton's film amount to much more than a brilliant aesthetic exercise? I'm not convinced it does.",
      "author": "Xan Brooks"
    },
    {
      "text": "For once, the artful nods to Huxley, Kubrick and Philip K. Dick are not the preserve of trainspotters.",
      "author": "James Christopher"
    },
    {
      "text": "Another in the long line of Pixar classics -- beautiful, energetic, intelligent, satirical, crammed full of gorgeous design, and genuinely heartwarming.",
      "author": "Saxon Bullock"
    },
    {
      "text": "Both moving and laugh-out-loud funny.",
      "author": "Matthew Turner"
    },
    {
      "text": "Absolute heaven.",
      "author": "Olly Richards"
    },
    {
      "text": "Sentient with sentiment. Please read review.",
      "author": "Karina Montgomery"
    },
    {
      "text": "It's unlikely Mr Bean inspired this tale yet there's a resemblance. WALL.E is for the most part a silent comedy dependent on ingenious sight gags.",
      "author": "Victor Olliver"
    },
    {
      "text": "WALL-E is a classic, but it will never appeal to people who are happy with art only when it has as little bite as possible.",
      "author": "David Denby"
    },
    {
      "text": "... for every plot revelation reinforcing the predicament of WALL-E, the story moves farther from him/it as a strong central character... nevertheless a positive (theme)...",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "A haunting, fantastic, and eerie robot reverie. Deft little touches add more and more complex, heartfelt circuitry to Wall-E's character. A beautifully wrought film.",
      "author": "Brian Gibson"
    },
    {
      "text": "Wall-E [is] a truly innovative animated adventure and an unexpected cautionary tale.",
      "author": "Lori Hoffman"
    },
    {
      "text": "so thoroughly embodies the greatest pleasures the movies have to offer that it goes directly into the sublime",
      "author": "James Kendrick"
    },
    {
      "text": "You'd have to be a machine for your heart not to melt.",
      "author": "David Ansen"
    },
    {
      "text": "Get ready to fall in love with a glorified trash compactor -- and ditto for his little buddy, a cute cockroach.",
      "author": "James Verniere"
    },
    {
      "text": "The movie is so engaging that it just moves along and speech isn't needed.",
      "author": "Kamal  'The Diva' Larsuel"
    },
    {
      "text": "Watching its use of a couple of the better bits from Hello, Dolly! could make you think you should put that '60s musical on your Netflix queue. You shouldn't. That movie is as lousy as Wall-E is terrific.",
      "author": "Chris Hewitt"
    },
    {
      "text": "This film is a real treasure, one that can make you laugh when you are in your worst of moods.",
      "author": "Michael Drakulich"
    },
    {
      "text": "Even after WALL-E turns clunky, the beauty of its images is undiminished, the acuity of its animation unrivaled, the warmth underlying it all apparent.",
      "author": "Bryant Frazer"
    },
    {
      "text": "A nice little romantic film about the transformational power of love.",
      "author": "Robert Roten"
    },
    {
      "text": "It's a work of art, a sci-fi funhouse, and hilarious all at once.",
      "author": "Widgett Walls"
    },
    {
      "text": "...charm galore.",
      "author": "Jim Lane"
    },
    {
      "text": "It may well be the best science fiction film in ages, but the movie doesn't need any hyperbolic assertions to draw an audience.Or, alas, to sell its action figures.",
      "author": "Philip Martin"
    },
    {
      "text": "This first half of the film is exquisite. The animation is spectacular but without being show-offy.",
      "author": "Beth Accomando"
    },
    {
      "text": "One of the most stunning and incredible pieces of art I've seen from Pixar...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "A materpiece... maybe Pixar's best ever.",
      "author": "David Poland"
    },
    {
      "text": "Too Gloom-E.",
      "author": "Kyle Smith"
    },
    {
      "text": "Perhaps the most wonderfully twisted and bizarre G rated movie I've ever seen. It's sweet, too.",
      "author": "Bob Grimm"
    },
    {
      "text": "WALL-E is a technical gem, a marvel of sound design and just a little too ambitious to continuously captivate.",
      "author": "Larry Ratliff"
    },
    {
      "text": "The plot, when it finally arrives, has a few unforgivable holes, but the thing never stops being a marvel to behold.",
      "author": "Eric Kohn"
    },
    {
      "text": "The first half of \"Wall*E\" can best be described as \"Star Wars,\" only if R2-D2 were the only character.",
      "author": "Stephen Silver"
    },
    {
      "text": "As soon as WALL-E stows away on the spaceship in pursuit of EVE, the film turns into something a lot less special and a lot more like a fairly typical animated movie.",
      "author": "Ken Hanke"
    },
    {
      "text": "Though perfection in film is a highly unlikely proposition, WALL-E indeed has become 2008's first perfect film and one of the best Pixar projects of all time.",
      "author": "Adam Fendelman"
    },
    {
      "text": "This endearing post-apocalyptic romantic adventure never puts a foot wrong.",
      "author": "Rich Cline"
    },
    {
      "text": "More impressive than its ecologically minded message is its modestly profound portrait of loneliness, obligation and the desire for reciprocated affection.",
      "author": "Nick Schager"
    },
    {
      "text": "... Pure movie magic, a rare picture of wonder, hope, joy, love and social conscience.",
      "author": "Greg Maki"
    },
    {
      "text": "It is all about some serious problems our world is facing. Under the laughs and the humanized robots this is a serious science fiction film and well above average for the genre.",
      "author": "Mark R. Leeper"
    },
    {
      "text": "No movie can be a downer that fills you with pure exhilaration. You leave WALL-E with a feeling of the rarest kind: that you've just enjoyed a close encounter with an enduring classic.",
      "author": "Peter Travers"
    },
    {
      "text": "Like the humble little hero of this film, Pixar holds onto its dreams. If that makes the films more challenging, less easily accessible, good for them and good for us, too.",
      "author": "Nell Minow"
    },
    {
      "text": "Cutes-E, but not enough gravit-E.",
      "author": "Jules Brenner"
    },
    {
      "text": "Al Gore is going to love this movie",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "The new Pixar picture Wall-E is one for the ages, a masterpiece to be savored before or after the end of the world -- assuming, like the title character, you're still around when all the humans have taken off and have access to an old video player.",
      "author": "David Edelstein"
    },
    {
      "text": "...[a] loud and damning indictment of consumerism.",
      "author": "Chris Barsanti"
    },
    {
      "text": "...absolutely incredible.",
      "author": "Gary Brown"
    },
    {
      "text": "Technically Wall-E is the best film Pixar has made - it's funny and heartwarming, but it's also the preachiest.",
      "author": "Vic Holtreman"
    },
    {
      "text": "The 2001 of animation. It's a sci-fi masterpiece. R2D2 hits The Road. But it's also no Finding Nemo ...",
      "author": "Gina Carbone"
    },
    {
      "text": "In a world that is moving too fast and changing too rapidly, a moment to pause and and reflect on what's really important in life and enjoy it at the same time is rare. There are lots of those moments in WALL-E.",
      "author": "Diana Saenger"
    },
    {
      "text": "Wistful and whimsical, it's a visionary robotic romance that's destined to be one of the best pictures of the year.",
      "author": "Susan Granger"
    },
    {
      "text": "Drawing on science fiction epics like 2001: A Space Odyssey and Star Wars, Wall-E may be the first truly dystopian animated movie for kids.",
      "author": "Cole Smithey"
    },
    {
      "text": "I think Wall-E is a masterpiece. The folks at Pixar never rest on their laurels. They continue to push the limits of both computer animation and the storytelling possibilities that accompany it.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Enough to restore your sense of wonder not only in movies, but in the universe as well.",
      "author": "Geoff Berkshire"
    },
    {
      "text": "I was bowled over by the charm of both Wall-E the film and especially Wall-E the character. Congratulations to Pixar for making a gem of a film that you'd have to have a heart two sizes too small not to love.",
      "author": "Diva Velez"
    },
    {
      "text": "Triumphant and teary-eyed, WALL-E withstands its mellifluous moments with a welcomed surge of honesty, impishness and introspection...smart, heart-warming and savvy in its observational radar.",
      "author": "Frank Ochieng"
    },
    {
      "text": "WALL-E and EVE project more humanity and genuine emotion than most human characters I've seen in films lately.",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Uma espécie de mistura perfeita de Chaplin, Kubrick e Disney.",
      "author": "Pablo Villaça"
    },
    {
      "text": "I don't know if it's a masterpiece; what I do know is that it is perfection.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "As perfect as a movie can be.",
      "author": "Kevin Carr"
    },
    {
      "text": "It is a story about love and loneliness, perseverance and triumph, the possibilities and pitfalls of human existence. That this story is told by way of the exploits of a tiny, faceless robot only makes it more extraordinary.",
      "author": "Christopher Orr"
    },
    {
      "text": "Not only is this a great Sci-Fi film, it's also easily one of the most romantic! Dismissing this as just another kids film is not only unfair to the movie, it's unfair to you.",
      "author": "Austin Kennedy"
    },
    {
      "text": "Wall-E is art. Hell, it's philosophy -- it's practically religion.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "WALL*E announces yet another massive leap in technological talent for the fabled filmmakers, a textural, tactile quality that continues to push CG 3D into uncharted artistic arenas.",
      "author": "Bill Gibron"
    },
    {
      "text": "While the film's social message comes through loud and clear, it never detracts from the heart of the picture--the unlikely romance between Wall*E and EVE.",
      "author": "Ethan Alter"
    },
    {
      "text": "It's been such a lousy year for romantic comedies that the only engaging one features a pair of robots.",
      "author": "Dan Lybarger"
    },
    {
      "text": "Pixar has once again burst the boundaries of the animation ghetto, creating a world so intricately worked-out, so ravishing, that we don't feel we're just watching it -- we're visiting.",
      "author": "Kurt Loder"
    },
    {
      "text": "Miraculous.",
      "author": "Tim Brayton"
    },
    {
      "text": "Wall*E begins as a truly groundbreaking work and then turns into just another diverting cartoon with some wonderful themes.",
      "author": "Devin Faraci"
    },
    {
      "text": "He is the cutest robot since R2-D2, but I wish the whole movie was just as cute.",
      "author": "Willie Waffle"
    },
    {
      "text": "At last, an answer to the celebrity voicing in animated movies! No dialogue.",
      "author": "Cynthia Fuchs"
    },
    {
      "text": "Offers a touching robot romance, visuals as artful as they are state-of-the- art, and vital messages about environmental and personal health.",
      "author": "Carla Meyer"
    },
    {
      "text": "A terrific movie, easily one of Pixar's best. The animation is startling and the story follows suit. So far, this is the animated film to beat at next year's Academy Awards.",
      "author": "Christopher Smith"
    },
    {
      "text": "The picture feels weirdly, and disappointingly, disjointed, something that starts out as poetry and ends as product.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Visually dazzling and possessing wit and emotion 99 percent of movies with real-life actors can't hope to achieve.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "The power of WALL-E as a character, the poetic figure of the robot drawn to human splendor, remains powerful throughout -- and Pixar's loveliest creation.",
      "author": "Mick LaSalle"
    },
    {
      "text": "It may not be top-shelf Pixar, but every one of Pixar's shelves is higher than those of anyone else making movies for kids and their families today.",
      "author": "Shawn Levy"
    },
    {
      "text": "Too many kid's movies are created to give kids things to buy; WALL-E is a kid's movie that might, perhaps, give you and your kids pause to think about what things truly cost.",
      "author": "James Rocchi"
    },
    {
      "text": "This latest achievement from Disney's Pixar Studios rotates around a rusty little robotic hero who's built, as the movie is, with such emotion, brains and humor that whole universes exist in his whirring tones and binocular eyes.",
      "author": "Joe Neumaier"
    },
    {
      "text": "WALL-E is Pixar's E.T. the Extra-Terrestrial or its Pinocchio: an archetypal fable about loneliness simple enough -- yet deep enough -- to instantly captivate anyone who sees it.",
      "author": "Rene Rodriguez"
    },
    {
      "text": "It works; this is Pixar's most enthralling entertainment since Nemo.",
      "author": "Richard Corliss"
    },
    {
      "text": "WALL*E begins with all the comedic splendor of a Charlie Chaplin film, but quickly devolves into a rickety bore.",
      "author": "Christian Toto"
    },
    {
      "text": "The film's visions of a ravaged, abandoned future Earth and a mechanized, corporately controlled space ark/pleasure cruiser are stunning, hilarious and hit their pro-green, anti-consumerist points remarkably hard.",
      "author": "Bob Strauss"
    },
    {
      "text": "The greatest of all films by Pixar Animation, the little Disney studio with the Midas touch.",
      "author": "Peter Howell"
    },
    {
      "text": "This grim vision of Earth's future is not so funny and not so cute. Nonetheless, the Pixar guys send another enthralling entertainment to the planet's movie screens.",
      "author": "John Wirt"
    },
    {
      "text": "With its split personality, WALL-E falls short of greatness. Even so, it pushes the animation envelope with every frame.",
      "author": "Robert W. Butler"
    },
    {
      "text": "Wall*E has adventure, danger and thrills to be sure, but for this viewer, the animated tale seemed to be more about the animation and less about the storytelling.",
      "author": "Liz Braun"
    },
    {
      "text": "Wall-E never feels preachy or pushy, instead letting the witty storytelling and expressive animation transport audiences to another world.",
      "author": "Sean P. Means"
    },
    {
      "text": "With its stellar character work and sound design, WALL-E inspires enough awe and 'Awww...' to be a worthy entry in the Pixar canon.",
      "author": "Matt Stevens"
    },
    {
      "text": "His intelligence may be artificial, but his heroism is anything but superficial.",
      "author": "Lisa Kennedy"
    },
    {
      "text": "A beautiful film that makes us proud of the species that created it, even as we root for the robot who inadvertently saves us from ourselves",
      "author": "Amy Nicholson"
    },
    {
      "text": "A hilarious, heartfelt and extraordinary comedy adventure that pushes animation to new heights.",
      "author": "Pete Hammond"
    },
    {
      "text": "WALL-E is yet another notch in Pixar's computer-animation belt, and it's one of the better entries, with greater emotional resonance than anything they've done since Finding Nemo.",
      "author": "Peter Rainer"
    },
    {
      "text": "The best American film of the year to date.",
      "author": "Ty Burr"
    },
    {
      "text": "WALL-E conjures magical comedy out of the confusions of adolescence and the wrong turns of adulthood, as well as the exuberance of childhood. It's sometimes bright, sometimes gloomy, but always engaging and accessible.",
      "author": "Michael Sragow"
    },
    {
      "text": "WALL-E may contain a simple love story about non-living robots that are full of wires and microchips, but it has more heart than any other movie you will see this year.",
      "author": "Adam Tobias"
    },
    {
      "text": "A spectacular testament to the life force that beats within us all, WALL - E puts the \"extra\" back in terrestrial.",
      "author": "Kimberly Gadette"
    },
    {
      "text": "Pixar's boldness has advanced with its achievements in special effects. The opening act of 'WALL-E' is as melancholy as the Ray Bradbury short story, 'There Will Come Soft Rains'...",
      "author": "John Beifuss"
    },
    {
      "text": "For 45 sublime minutes, WALL-E is a modest and noble experiment, and even with an ordinary action climax and an abbreviated ending, it's likely to be lingering in the mind when Cars has long since faded.",
      "author": "Robert Davis"
    },
    {
      "text": "Beautifully executed with a wink and a nudge, this one has heart.",
      "author": "Jeanne Aufmuth"
    },
    {
      "text": "A highly entertaining and emotionally satisfying film that will play equally well to adults, and maybe even more so than with kids.",
      "author": "Jim Judy"
    },
    {
      "text": "Pixar's robot romance is crazily inventive, deliriously engaging and emotionally true.",
      "author": "Bob Mondello"
    },
    {
      "text": "Slapstick, adventure and love are all familiar elements in animated family films. Awe, existential themes and wholesale worldbuilding are not … Even Pixar has never attempted anything on a canvas of this scale.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "...an immensely appealing film for all ages.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "You have heard it said that there are but two constants in the universe: death and taxes. It's time a third constant was added to the list: Pixar can do no wrong.",
      "author": "Brandon Fibbs"
    },
    {
      "text": "Mixing Chaplinesque delicacy with the architectural grandeur of a Stanley Kubrick film, director Andrew Stanton recycles film history and makes something fresh and accessible from it without pandering to a young audience.",
      "author": "Liam Lacey"
    },
    {
      "text": "Put simply, WALL-E is about as charming as movies get.",
      "author": "James Berardinelli"
    },
    {
      "text": "An animated robot love story with an environmental theme and a slapstick delivery, 'WALL•E' is a charmer of a film and a delightful piece of storytelling.",
      "author": "Sean Axmaker"
    },
    {
      "text": "...\"Wall-E\" is nothing short of magical ...",
      "author": "Michael A. Smith"
    },
    {
      "text": "Pixar's best feature... As fresh as it is funny, as heartwarming as it is innovative.",
      "author": "David Cornelius"
    },
    {
      "text": "\"WALL-E\" is a gem and continues Pixar's amazing winning streak of animated hits.",
      "author": "Bob Bloom"
    },
    {
      "text": "It is one of the best movies ever made!",
      "author": "Steve Rhodes"
    },
    {
      "text": "As horrible, wretched, infantile, disgusting and flat-out lousy as \"The Love Guru\" is, that is how wonderful \"WALL*E\" is.",
      "author": "Peter Sobczynski"
    },
    {
      "text": "The most unique Pixar movie yet and, hands-down, the best love story of the year.",
      "author": "Matt Pais"
    },
    {
      "text": "Simply brilliant, those creative people at Pixar have accomplished the near impossible %u2013 they've outdone themselves once again.",
      "author": "Rebecca Murray"
    },
    {
      "text": "The fact that Wall-E's not merely adorable, but central to a serious, thoughtful, adult story is still another illustration of Pixar's downright heroic commitment to the craft.",
      "author": "Eugene Novikov"
    },
    {
      "text": "Brainy, charming, eco-friendly animated adventure.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "It wouldn't be a stretch to call the movie pitch perfect.",
      "author": "Jeffrey Chen"
    },
    {
      "text": "Wall·E is truly an animated masterpiece, and that word shouldn't be thrown around easily, but for some reason I cannot think of a single problem with this film.",
      "author": "Kevin McCarthy"
    },
    {
      "text": "Not only does it provide further proof of Pixar's unprecedented brilliance, but it may have actually elevated their game to a whole new level.",
      "author": "Rob Vaux"
    },
    {
      "text": "As long as we have WALL*E's point of view on earth, the film is simply great, but whenhe movies into outer space and the Axiom, the missed opportunities are immeasurable.",
      "author": "Laura Clifford"
    },
    {
      "text": "[The] first 60 minutes ranks with the best work Pixar has ever done.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "WALL-E's bumbling courtship of the completely indifferent EVE has as much truth about humanity's sweetness and perseverance as any piece of great literature",
      "author": "Andrea Chase"
    },
    {
      "text": "WALL-E is yet another perfect Pixar masterpiece.",
      "author": "Danny Minton"
    },
    {
      "text": "It can hardly be called a children's film, but a masterpiece of feature-film animation for all ages.",
      "author": "Ken Fox"
    },
    {
      "text": "This is a film that stretches the expectations and reaches of animation at the same time it offers fantastic entertainment value to its audience.",
      "author": "Tom Long"
    },
    {
      "text": "I must drop my inhibitions about dropping the M word -- especially since I've already used magnificent -- and call WALL-E the masterpiece that it is.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "The attention to detail -- always a Pixar hallmark -- is amazing, and Stanton and his crew incorporate surprising elements that mix vintage sci-fi with old musicals with a meta-cartoon rendering of the future.",
      "author": "Steven Rea"
    },
    {
      "text": "In the Pixar animation universe, all things are possible. More important, they are plausible.",
      "author": "Duane Dudek"
    },
    {
      "text": "Wall-E is an improbable delight, a G-rated crowd-pleaser that seems poised to pack theaters as efficiently as the titular robot crams his chest cavity with rubble.",
      "author": "Dana Stevens"
    },
    {
      "text": "Here I am, surprised and delighted all over again at just how well these people can tell a story.",
      "author": "Eric D. Snider"
    },
    {
      "text": "WALL*E is not only a triumph in terms of style, it's also a triumph in terms of story. There's a real emotional resonance and depth to this material",
      "author": "Jeff Vice"
    },
    {
      "text": "It is, undoubtedly, an earnest (though far from simplistic) ecological parable, but it is also a disarmingly sweet and simple love story, Chaplinesque in its emotional purity.",
      "author": "A.O. Scott"
    },
    {
      "text": "When it works, it really works, but it's debatable whether its target audience will really enjoy anything more than the nifty robots. Which is fine, too. Robots are pretty cool.",
      "author": "Jenni Miller"
    },
    {
      "text": "It whisks you to another world, then makes it every inch our own.",
      "author": "Owen Gleiberman"
    },
    {
      "text": "It's Pixar's most daring experiment to date, but it still fits neatly into the studio's pantheon: Made with as much focus on heart as on visual quality, it's a sheer joy.",
      "author": "Tasha Robinson"
    },
    {
      "text": "Only Pixar could pull off a story about robots in love with this much success.",
      "author": "Bill Clark"
    },
    {
      "text": "Another Pixar triumph in storytelling...you'll recognize in the wee machine a version of yourself.",
      "author": "Tricia Olszewski"
    },
    {
      "text": "While Wall-E dances whimsically, it's a plodding, frighteningly hypocritical, and forbidding film that trips over its fogged intentions at every dreary turn.",
      "author": "Brian Orndorf"
    },
    {
      "text": "A tale that's equally satisfying as science fiction, cautionary satire, gentle love story and purely visual comedy.",
      "author": "Kevin Lally"
    },
    {
      "text": "Daring and traditional, groundbreaking and familiar, apocalyptic and sentimental, Wall-E gains strength from embracing contradictions that would destroy other films.",
      "author": "Kenneth Turan"
    },
    {
      "text": "An original, mature and borderline-artsy family film that makes a name for itself. Like the rest of Pixar's titles, it is destined to endure for years to come.",
      "author": "Dustin Putman"
    },
    {
      "text": "How much further will they be able to raise the storytelling bar? And how on Earth will I pass the time until Pixar's next endeavor, Up, arrives in theaters to charm, amaze, and enthrall us, as the studio has done time after time?",
      "author": "Sean O'Connell"
    },
    {
      "text": "Eco-toon romance blooms as WALL-E deposit a gift of love - a tiny plant - in EVE's, well, compartment, and rebel robot computers with much more to teach humankind than just sending emails. A Kidconvenient Truth.",
      "author": "Prairie Miller"
    },
    {
      "text": "A beautiful sci-fi tale complete with all the feel-good vibes and fantastic, cutting-edge visuals we've come to expect from a film wearing the Pixar name.",
      "author": "Erik Davis"
    },
    {
      "text": "The tender and touching story of a lonely robot on Earth who falls in love and becomes a spiritual teacher to all who encounter him.",
      "author": "Frederic and Mary Ann Brussat"
    },
    {
      "text": "Dangerously close to the sublime, a film that will be dissected and enjoyed for years to come.",
      "author": "Chris Vognar"
    },
    {
      "text": "WALL-E goes beyond inviting comparisons to E.T., Number 5, R2D2, even Chaplin's Little Tramp--the Waste Allocation Load Lifter relies on them, for writer-director Andrew Stanton understands this robot janitor as a study in memory and inheritance.",
      "author": "Ed Gonzalez"
    },
    {
      "text": "Never before have the world's most influential animators been as bold and forthright about their dark vision for humanity as in WALL-E, a potent environmental message wrapped up in an irresistibly cute romance between robots.",
      "author": "Lawrence Toppman"
    },
    {
      "text": "WALL-E is probably the sweetest movie ever made about humans destroying the earth.",
      "author": "Gary Thompson"
    },
    {
      "text": "Like Charlie Chaplin's best silents -- a clear influence -- WALL-E is pure visual magic. As a bonus, it packs a wicked satirical punch.",
      "author": "Rafer Guzman"
    },
    {
      "text": "For adults there aren't a lot of surprises, but that doesn't mean you won't revel in the Pixar-perfect execution of another story well told.",
      "author": "Joshua Tyler"
    },
    {
      "text": "The genius of WALL-E is how so many disparate influences...are incorporated and evoked while creating something unique...What a wonderful world it would be if the talents they manifest here could somehow be marshalled to address real-life problems.",
      "author": "John P. McCarthy"
    },
    {
      "text": "Pleasant enough--and certainly pretty enough--to serve: a lesser Pixar effort, but one that most viewers, young and old, will enjoy if not be transported by.",
      "author": "Frank Swietek"
    },
    {
      "text": "Finding Nemo director Andrew Stanton tops himself with this adorably loopy Pixar animation that sends up consumerism, musicals, Apple computers, and 2001: A Space Odyssey.",
      "author": "Andrea Gronvall"
    },
    {
      "text": "By turns sad, hilarious, exciting and, ultimately, hopeful, this is a film of Great Truths masquerading as child's play.",
      "author": "Marc Savlov"
    },
    {
      "text": "A triumph of style over substance.",
      "author": "Harvey S. Karten"
    },
    {
      "text": "A jewel of a film in conception, execution and message.",
      "author": "John Anderson"
    },
    {
      "text": "A work of art expressing that the products of our hands can hold, if we look well and deeply, the secrets to our own salvation.",
      "author": "Walter Chaw"
    },
    {
      "text": "Some day, there will be college courses devoted to this movie.",
      "author": "Lou Lumenick"
    },
    {
      "text": "Pixar's WALLE succeeds at being three things at once: an enthralling animated film, a visual wonderment and a decent science-fiction story.",
      "author": "Roger Ebert"
    },
    {
      "text": "Who would guess that a movie with minimal dialogue and a love story between robots could emerge as one of the best films of the summer? And who would think a tale could be both post-apocalyptic and charming?",
      "author": "Claudia Puig"
    },
    {
      "text": "This is Pixar's most audacious film yet, and some small children may become impatient with the film's long wordless stretches. But the storytelling is so meticulous and skilled, some may not even notice the absence of dialogue.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Andrew Stanton is resourceful enough to find infinite ways for them to express themselves - amusingly, achingly, and with emotional precision. He's also created, with the help of a team of animators, a visual marvel.",
      "author": "Christy Lemire"
    },
    {
      "text": "Pixar's ninth consecutive wonder of the animated world is a simple yet deeply imagined piece of speculative fiction...it has plenty to say, but does so in a light, insouciant manner that allows you to take the message or leave it on the table.",
      "author": "Todd McCarthy"
    },
    {
      "text": "Who'd have thought the year's most romantic on-screen duo would be a couple of robots?",
      "author": "David Foucher"
    },
    {
      "text": "Despite being subtle, sophisticated and light on dialogue, it's every bit the crowd-pleaser we expect from this studio: funny, romantic, imaginative, and utterly gripping.",
      "author": "Josh Hurst"
    },
    {
      "text": "WALLE is so unlike anything else Pixar has ever done I'm not even sure where to begin.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "Wall-E is not only the best movie of the year by galaxy-sized leaps and bounds, it's one of my favorite movies in a long, long time.",
      "author": "Brian Tallerico"
    },
    {
      "text": "It's best not to ask too many questions during Wall-E...Take the film's outstretched hand and go with it. That's the best way to enjoy a film that's as charming as a tale of two robots falling in love can be.",
      "author": "Peter Canavese"
    },
    {
      "text": "It's remarkable to see any film, in any genre, blend honest sentiment with genuine wit and a visual landscape unlike any other.",
      "author": "Michael Phillips"
    },
    {
      "text": "With its lack of dialogue, inventive visual comedy and satirical view of working life, WALL-E plays like an animated addendum to Charlie Chaplin's Modern Times.",
      "author": "Josh Larsen"
    },
    {
      "text": "If you can imagine Buster Keaton as a small box with binoculars for eyes and tank treads for legs -- and WALL-E makes this easy to imagine -- then the movie's first half represents the purest visual storytelling since movies started to talk.",
      "author": "Jeffrey Westhoff"
    },
    {
      "text": "While paying tribiute to seminal American sci-fi, such as 2001, Star Wars and E.T., the endlessly inventive Pixar has succeeded in creating a unique milieu with distinctive look and feel that transports viewers to a magical, almost surreal world.",
      "author": "Emanuel Levy"
    },
    {
      "text": "Not since Titanic will you have heard two prospective partners cry out each other's names with as much longing (and frequency) and if there's any karma, fate, or pure love out there to believe in than WALL-E will equal its attendance and then some.",
      "author": "Erik Childress"
    },
    {
      "text": "This is getting to sound like a broken record: Pixar Animation Studios has just topped itself. Again.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "Stanton and Pixar have achieved a new plateau in their craft, creating what's destined to be a beloved classic, right up there with the likes of Snow White, Bambi and Cinderella ...",
      "author": "Edward Douglas"
    },
    {
      "text": "A wondrous work of the imagination and, to date, the year's best film.",
      "author": "Rossiter Drake"
    },
    {
      "text": "The film poses as thinking-fans animation, but there's little room for wonder or interpretation in the on-the-nose presentation.",
      "author": "Phil Villarreal"
    },
    {
      "text": "While the film's most daring gambits pay off in full, the inclusion of a standard outwit-the-bad-guys storyline dulls the magic that WALL-E so often achieves.",
      "author": "Alonso Duralde"
    },
    {
      "text": "The animation is stunning; the landscapes of the futuristic Earth offer the Pixar folks ample opportunity to show off their wares.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "The pole position in the race for the next Best Animated Feature Oscar has clearly been staked out.",
      "author": "Brent Simon"
    },
    {
      "text": "A film that's both breathtakingly majestic and heartbreakingly intimate.",
      "author": "Robert Wilonsky"
    },
    {
      "text": "There are no accolades too generous for the film that turns out to be so good that it's now my favorite story from the Pixar library.",
      "author": "Sean McBride"
    },
    {
      "text": "[It] could end up being the best movie of the year.",
      "author": "Paul Gallagher"
    },
    {
      "text": "One of the best movies of the year. Just so beautifully done.",
      "author": "Richard Roeper"
    },
    {
      "text": "We've seen social commentary via future sci-fi before, but it's never been this astute or accurate. Hopefully it'll reach the kids before they're set in their text messaging, virtual ways.",
      "author": "Fred Topel"
    }
  ],
  "release_year": 2008,
  "duration": 97,
  "genres": [
    "Kids & Family",
    "Adventure",
    "Sci-Fi",
    "Comedy",
    "Animation"
  ],
  "age_rating": "G",
  "synopsis": "WALL-E, short for Waste Allocation Load Lifter Earth-class, is the last robot left on Earth. He spends his days tidying up the planet, one piece of garbage at a time. But during 700 years, WALL-E has developed a personality, and he's more than a little lonely. Then he spots EVE, a sleek and shapely probe sent back to Earth on a scanning mission. Smitten WALL-E embarks on an adventure when he follows EVE across the galaxy.",
  "popularity": 9.0,
  "poster_url": "https://image.tmdb.org/t/p/original/hbhFnRzzg6ZDmm8YAmxBnQpQIPh.jpg"
}