{
  "movie_name": "We're the Millers",
  "movie_id": "were_the_millers",
  "total_reviews": 157,
  "reviews": [
    {
      "text": "Along the way, as the film begins to unravel, all the possible variants and ramifications that the plot could have pursued parade through the mind. The only alternative they should not have chosen is the one they go for... [Full review in Spanish]",
      "author": "Iván Kazi"
    },
    {
      "text": "There are just enough laughs to be had to allow this sketchy, smutty affair the benefit of the doubt.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "The foul-mouthed dialogue and bawdy predicaments inserted at nearly uninterrupted intervals leave the journey with rarely a dull moment.",
      "author": "Mike Massie"
    },
    {
      "text": "Features a talented enough cast that they take the film's one-note premise and compose a nice little ditty out of it.",
      "author": "Richard Propes"
    },
    {
      "text": "If you've seen the trailers, you've seen a highlight reel of all We're the Millers has to offer, save for swollen prosthetic genitalia worn by a teenage actor from Chronicles of Narnia.",
      "author": "Ryan Syrek"
    },
    {
      "text": "An ever increasingly ludicrous premise bludgeoned mercilessly into the requisite formula of Hollywood comedy.",
      "author": "Nicholas Bell"
    },
    {
      "text": "Cross-country van travelling with a pseudo-family hasn't been this enjoyable since Scooby-Doo.",
      "author": "Stephen O'Nion"
    },
    {
      "text": "Thurber aims for a please-all comic strategy that feels mischievously naughty while remaining ultimately safe and middle of the road, but the reality is a wholly unconfident, tonally disjunctive summer ride.",
      "author": "Chris Fennell"
    },
    {
      "text": "It's consistently LOL hilarious all the way through, and after this dreadfully straight-faced season, it's nice to finally crack a smile.",
      "author": "Tara Thorne"
    },
    {
      "text": "Dramas are great, but good comedy is hard to find, and this isn't just good comedy -- this is great comedy. New York, it's Miller time!",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "An R-rated comedy shouldn't possess a PG-rated heart.",
      "author": "Jared Mobarak"
    },
    {
      "text": "The film takes the tried-and-true family road trip formula and not only turns it on its head, but gets it drunk and embarrassed.",
      "author": "J. Olson"
    },
    {
      "text": "One of the more bearable comedies to arrive in 2013...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "A great movie it isn't, but it's one hell of a funny excursion.",
      "author": "Wesley Lovell"
    },
    {
      "text": "At one point Aniston does a strip tease to create a diversion, presumably from her own heart of gold.",
      "author": "Jonathan Kiefer"
    },
    {
      "text": "The movie's lingering close-ups on yearning faces and heart-to-heart conversations force the fake Millers into real familial longing that's more bogus than the family itself.",
      "author": "Wesley Morris"
    },
    {
      "text": "Lazily agreeable, harmlessly vulgar...",
      "author": "John Beifuss"
    },
    {
      "text": "More like We're the Fillers. Despite having a half-decent premise, this generic American comedy squanders every single one of its comedic opportunities.",
      "author": "Adam Ross"
    },
    {
      "text": "Naturally, there are roadblocks galore -- but the breezy film stays one mile ahead in terms of plot and punch lines",
      "author": "Mara Reinstein"
    },
    {
      "text": "...a promising comedy that ultimately succumbs to the worst and most needless conventions that Hollywood has to offer.",
      "author": "David Nusair"
    },
    {
      "text": "Then there's the idea of the primped and plastic Aniston playing a stripper, perhaps the least realistic portrayal of a sex worker since Julia Roberts in \"Pretty Woman.\"",
      "author": "Sean P. Means"
    },
    {
      "text": "It's worth pondering whether the target audience will be able to grasp that the moral here - that crime does pay, as long as you're funny - isn't meant to be taken seriously.",
      "author": "Todd Jorgenson"
    },
    {
      "text": "It's predictable, politically incorrect and too long - but a handful of really big chuckles excuse most of the cop-outs.",
      "author": "Paul M. Bradshaw"
    },
    {
      "text": "Often funny but not extravagantly or consistently so.",
      "author": "Philip French"
    },
    {
      "text": "A movie with a solid comedic concept at its core but one that is forced to go through the necessary motions until it rolls to a stop.",
      "author": "Ali Gray"
    },
    {
      "text": "A very rude road movie prone to too many second-gear kangaroo jumps ( ... ) but [Will Poulter] is sure to be dining out on the fun of his kissing education for years.",
      "author": "Graham Young"
    },
    {
      "text": "Consistently amusing but never uproariously funny, this comedy plays it relatively safely by gently subverting our expectations of Aniston and Roberts, while making rising-star Poulter the butt of most jokes.",
      "author": "Rich Cline"
    },
    {
      "text": "The central conceit is well established, the comedy is often impressively sour and the four leads complement one another beautifully.",
      "author": "Donald Clarke"
    },
    {
      "text": "It's consistently funny, the characters are a hoot and the anticipated family \"bonding\" is quite touching and doesn't interrupt the flow of big laughs.",
      "author": "Henry Fitzherbert"
    },
    {
      "text": "The script development is funnier and more ingenious than you might expect, and the actors have the comic timing to pull off most of it.",
      "author": "Christopher Tookey"
    },
    {
      "text": "It's a goofy road movie with some nice gags.",
      "author": "Peter Bradshaw"
    },
    {
      "text": "This is a fine collection of cheap and sleazy jokes, well-told ...",
      "author": "Robbie Collin"
    },
    {
      "text": "Reason No. 34,075 to legalize drugs: it would eliminate painfully unfunny comedies like this one. Comedy shouldn't make you pity the comedians.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "Enjoyable road-trip comedy with likeable characters, strong comic performances and a decent number of laughs, though the tone is uneven in places, particularly when leering over its female lead.",
      "author": "Matthew Turner"
    },
    {
      "text": "It's Miller time.",
      "author": "Tim Evans"
    },
    {
      "text": "With jokes cloned from bad taste movies and off-kids-telly villains, it doesn't even qualify for dumb fun.",
      "author": "Cath Clarke"
    },
    {
      "text": "This has a script that initially manages a surprise or two and nearly makes you like the characters until the ideas (or the dope) run out, and everyone's forced to ham it up, swear their heads off and drop their pants for serious scrotum jokes.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "A surprising number of verbal gags pepper the lark's broad, knockabout physical comedy, including an uproarious genital joke clearly designed to rival the eye-watering zipper bit from There's Something About Mary.",
      "author": "Jim Schembri"
    },
    {
      "text": "Though complete with a handful of funny and touching moments, ultimately We're the Millers is too predictable a film.",
      "author": "Stefan Pape"
    },
    {
      "text": "Excessive improvisation and scrappy plotting let down an able cast.",
      "author": "Rebecca Davies"
    },
    {
      "text": "A likeable comedy that uses its greatest asset, its talented, funny cast, to good effect.",
      "author": "Olly Richards"
    },
    {
      "text": "We're The Millers aims to shock, but the real kicker is that actually, it's not that bad. In fact, it's quite funny (though you may quietly hate yourself for laughing).",
      "author": "Stella Papamichael"
    },
    {
      "text": "...the outtake that closes the proceedings, with the four principals of the titled \"family\" applauding and laughing at and with their certified star, Jennifer Aniston, once and always from TV's \"Friends,\" might be the most memorable moment in their movie.",
      "author": "John Urbancich"
    },
    {
      "text": "There's very little about the film that rings true.",
      "author": "Rob Carnevale"
    },
    {
      "text": "We're the Millers is way funnier and entertaining than it should be.",
      "author": "Blake Howard"
    },
    {
      "text": "Has humor and heart but it is covered up with rude, crude language and endless streams of profanity.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Jagged, always funny and fitfully hilarious, 'We're the Millers' is a comedy that will make grownups laugh out loud - maybe not as hard or as often as they did in 'The Heat,' but certainly enough to leave them smiling when they depart the theater.",
      "author": "Linda Cook"
    },
    {
      "text": "Aniston provides the showstopping highlight as she homages Flashdance in an Aerosmith-scored sexy strip \"clearly essential to the plot\" of this edgier, adult version of RV.",
      "author": "James Croot"
    },
    {
      "text": "Time to wonder if Jennifer Aniston's early career was a set-up for dirty-girl punchlines she's delivering now.... Wholesomeness and sitcom-clean language has been stripped away along with most of her clothes. Immodesty looks and sounds good on her.",
      "author": "Steve Persall"
    },
    {
      "text": "By mixing raunchy laughs with genuine warmth, this pot-dealing comedy sparks up as a gag-filled surprise about the need for familial connection.",
      "author": "Erin Free"
    },
    {
      "text": "Pretends to be edgy and hip, but in reality is so conventional it makes an old Osmond Family Christmas special look subversive.",
      "author": "Ken Hanke"
    },
    {
      "text": "Certainties are few in this life, but you can take it from me: Though the movie listings might suggest otherwise, there's no such thing as Miller time.",
      "author": "Rick Kisonak"
    },
    {
      "text": "Funniest comedy of the Summer.",
      "author": "Jolene Mendez"
    },
    {
      "text": "Offering some chuckles along the way, the film delivers exactly what it promises - a crass Hollywood tall tale about drugs, sex and family - with a glossy ending. And some questionable outtakes",
      "author": "Louise Keller"
    },
    {
      "text": "Instead of fun there is a labored desperation to obvious plot devices and cliché humor",
      "author": "Andrea Chase"
    },
    {
      "text": "We're the Millers too often settles for the tried and true, taking the easy way out when being bold would have better satisfied the audience.",
      "author": "Rebecca Murray"
    },
    {
      "text": "There are a few inspired scenes strung together by miles of filler on this road trip, and a pretty bull---- resolution ending.",
      "author": "Matt Kelemen"
    },
    {
      "text": "Stays mean and maintains a bit of an edge even when it threatens to go all soft and gooey.",
      "author": "Christy Lemire"
    },
    {
      "text": "Not a bit of We're the Millers doesn't feel forced. None of it feels real. You don't know, have never met, and will never meet anyone in real life who is remotely like any of these characters.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "I'll forget about We're the Millers in a week, but I can't say I didn't laugh",
      "author": "Kevin Carr"
    },
    {
      "text": "A slight but amusing combination of the subversive and the conventional.",
      "author": "Scott Weinberg"
    },
    {
      "text": "We're The Millers certainly doesn't push any boundaries or break new ground, but it's just funny enough to garner a tepid \"meh.\"",
      "author": "Christian Law"
    },
    {
      "text": "Distasteful & mediocre, concluding with obligatory outtakes that are funnier than the film itself.",
      "author": "Susan Granger"
    },
    {
      "text": "Pretty much no one will buy Jennifer Aniston as a veteran stripper, and the film veers from funny-stupid into the merely stupid.",
      "author": "Clint O'Connor"
    },
    {
      "text": "Hilarious dialogue and timing, more fun than a bong full of Jack Herer.",
      "author": "Kelly Vance"
    },
    {
      "text": "...causes chuckles but no big laughs...some of the sexual jokes are so graphic they tend to make one uncomfortable rather than inducing laughter.",
      "author": "Tony Medley"
    },
    {
      "text": "This is comedy not rocket science. It doesn't need to be realistic. We're the Millers is laugh out loud funny.",
      "author": "Gary Wolcott"
    },
    {
      "text": "A simple elevator-pitch comedy that's brought to life by its actors.",
      "author": "Kurt Loder"
    },
    {
      "text": "Great premise. Lousy execution.",
      "author": "Kirk Honeycutt"
    },
    {
      "text": "The baseline for American movie humor sinks once again in this sentimentally cynical and cynically sentimental farce.",
      "author": "Michael Sragow"
    },
    {
      "text": "A triumph of bad taste and good casting, the very funny road comedy We're the Millers benefits from Jason Sudeikis' sleaze and Jennifer Aniston's lack thereof.",
      "author": "Carla Meyer"
    },
    {
      "text": "It boils down to the idea that men and women alike yearn for what they don't have, and that making your way through life is about seizing the bizarre opportunities it thrusts at you.",
      "author": "Andrew O'Hehir"
    },
    {
      "text": "We're the Millers is very raunchy in its humor, but very sweet in its nature. The cast is terrific, and enough of the jokes worked to satisfy me.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "Sudekis clearly has leading man charisma on the big screen and is at his funniest when interacting with the other Millers.",
      "author": "Mark Ellis"
    },
    {
      "text": "It never shifts into third gear as a great comedy but there are worse places to be stuck than in second with this family.",
      "author": "Kristian Harloff"
    },
    {
      "text": "A solid effort in the road trip genre and features more laughs than not.",
      "author": "Justin Craig"
    },
    {
      "text": "Though incredibly predictable from start to finish, \"We're the Millers\" did make me laugh.",
      "author": "Kara Nesvig"
    },
    {
      "text": "An affable if only passably funny effort that reunites Jason Sudeikis with his Horrible Bosses co-star Jennifer Aniston, We're the Millers rides much the same highway as National Lampoon's Vacation did in an earlier era of raunchy road comedies.",
      "author": "Jason Anderson"
    },
    {
      "text": "While its plot points are pedestrian at best, the genius -- at least, the definite charm -- of We're the Millers is its notion of family as something beyond a simple blood connection, particularly when exigent circumstances create the ties that bind.",
      "author": "Steve Davis"
    },
    {
      "text": "As a comedy couple, [Aniston] and Sudeikis aren't exactly Cheech and Chong, but their well-matched timing and clashing attitudes often create comic sparks that erupt into laughter.",
      "author": "Susan Wloszczyna"
    },
    {
      "text": "After an irreverent first act that seems determined to give the finger to family-bonding clichés, the movie then proceeds to embrace every single one of them.",
      "author": "Josh Bell"
    },
    {
      "text": "This has not been a great year for film comedy... We're the Millers sets down that same low comedy road but then something odd happens: it's actually funny.",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Director Rawson Marshall Thurber doesn't take any risks, but sometimes, you just need a good laugh.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "It's worth it to suffer through every Adam Sandler clunker if just occasionally a clever script like \"We're the Millers\" comes along.",
      "author": "David Kaplan"
    },
    {
      "text": "If you buy Sudeikis as a black-marketeer (he's an Ivy League stripper at best) maybe you'll buy Helms as a killer whale collecting king pin.",
      "author": "Sara Maria Vizcarrondo"
    },
    {
      "text": "a movie written by a committee, too long, but the cast carries it a long way, these mild virtues don't quite add up to a recommendation, but if you said you wanted to see it I wouldn't block the door.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Some of the jokes are funny. If one was to compile all the good snippets and scenes into a highlight reel, it might run about six minutes.",
      "author": "James Berardinelli"
    },
    {
      "text": "Truth is, I laughed at \"We're the Millers,\" more than once.",
      "author": "Paul Chambers"
    },
    {
      "text": "Not the funniest or most thoughtful comedy but We're the Millers should provide interested viewers with a number of memorable scenes - both humorous and oddly sweet.",
      "author": "Ben Kendrick"
    },
    {
      "text": "Though the cast partially eschews the family-friendly timidity that the film defers to in the end, this would-be wild thing remains little more than a rowdy endorsement of the status quo.",
      "author": "Chris Cabin"
    },
    {
      "text": "Believe it or not, Jennifer Aniston just made a movie that isn't appalling.",
      "author": "Willie Waffle"
    },
    {
      "text": "Mean-spirited to squishy does not a convincing trajectory make...That wouldn't be so much of an issue if We're the Millers weren't such a dismally unfunny endurance test, but there you are.",
      "author": "Peter Canavese"
    },
    {
      "text": "The cast of We're the Millers is having so much fun, it's infectious.",
      "author": "Dann Gire"
    },
    {
      "text": "These four strangers who are pretending to be a family hate each other at the start. You get three guesses as to how the film ends and odds are high you'll only need one.",
      "author": "Rick Bentley"
    },
    {
      "text": "We're the Millers offers an interesting commentary on the endangered middle class by saying it may be little more than an illusion, a practical joke that's become the punch-line of the American Dream.",
      "author": "Katherine Monk"
    },
    {
      "text": "The plot isn't particularly sound and some jokes fall flat, but the appeal of watching this 'family' come together is so enjoyable and satisfying, it makes the film a worthy watch.",
      "author": "Perri Nemiroff"
    },
    {
      "text": "This is the most consistently funny Hollywood comedy of the 2013 summer season.",
      "author": "Perry Seibert"
    },
    {
      "text": "The filmmakers lack the courage of their convictions, falling back on moments of egregiously false sentimentality whenever the material threatens to turn dark.",
      "author": "Ben Sachs"
    },
    {
      "text": "Drug-smuggling road-trip comedy has lots of sex references.",
      "author": "S. Jhoanna Robledo"
    },
    {
      "text": "The result is a loose conglomeration of jokes that never really holds together: Funny in parts, but overwhelmed by the bland emptiness where its protagonist should be.",
      "author": "Bilge Ebiri"
    },
    {
      "text": "Even tastelessness needs to have some taste. The blue humor in We're the Millers is just bland.",
      "author": "Peter Rainer"
    },
    {
      "text": "It's easy to point out the faults in We're the Millers because it is definitely not a complete comedy, but it is the funniest one this summer.",
      "author": "Matthew Razak"
    },
    {
      "text": "Aniston is a gifted comic actor, and she is in amazing shape. Sudeikis, too, has serious comic chops and experience. But this material is weak and lacks warmth in spite of its hypocrisy.",
      "author": "James Verniere"
    },
    {
      "text": "A truly wretched comedy that's full of major, major miscalculations.",
      "author": "Stephen Silver"
    },
    {
      "text": "A few highlights hint at a more interestingly devilish picture than the McDonald's meal director Rawson Marshall Thurber ultimately slaps together here.",
      "author": "Brian Orndorf"
    },
    {
      "text": "There's a few laughs to be had along the way and if there's any justice we should see a lot more of the truly talented Will Poulter, but this well-hyped comedy isn't as funny as its well cut trailer would indicate.",
      "author": "Laura Clifford"
    },
    {
      "text": "Sudeikis has always been a charming comedic actor. He usually doesn't have to work this hard for laughs; he's just naturally funny. The giggles that eventually materialize here are entirely a result of his dogged efforts.",
      "author": "Jamie S. Rich"
    },
    {
      "text": "Trying to turn such acerbic raunch into a sweet redemptive comedy is like trying to negotiate an RV around a hairpin turn, and \"We're the Millers\" just can't make it.",
      "author": "Rob Thomas"
    },
    {
      "text": "There are some genuinely laugh aloud moments scattered amoungst the barrage of lame jokes and adult humor, but not enough to elevate this offering into any sort of recommended status.(Full Parental Review also available)",
      "author": "Jim Judy"
    },
    {
      "text": "I laughed a lot during this brisk, consistently funny movie...counts on comedy shocks for laughs - but it makes them outlandishly weird and surprising.",
      "author": "Marshall Fine"
    },
    {
      "text": "Everyone on screen is slumming a little in this silly comedy.",
      "author": "Nell Minow"
    },
    {
      "text": "The laughs may come in fits and starts, usually by way of sight gags and set pieces, but they do come. And then they go.",
      "author": "Ann Hornaday"
    },
    {
      "text": "The standard jokes in \"We're the Millers\" build in a way that is evidence of more care than most comedies of this ilk.",
      "author": "Chris Hewitt"
    },
    {
      "text": "\"We're the Millers\" plays like a \"Saturday Night Live\" skit that goes on too long.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "Not only is it not funny, it's offensive.",
      "author": "Claudia Puig"
    },
    {
      "text": "This film's eagerness to please functions as a slow poison, draining The Millers of its vitality by rendering its characterization uneven, its potential undeveloped, and its plot predictable and stupid.",
      "author": "Inkoo Kang"
    },
    {
      "text": "A laugh-out-loud comic trek that avoids being either too crude or too docile. If a summer of high-impact blockbusters has left you worn out, join the Millers for a laugh.",
      "author": "Tom Long"
    },
    {
      "text": "\"The Millers\" might be the first movie ever made that could have been improved by casting Pamela Anderson, Charlie Sheen, Lindsay Lohan and Chris Brown.",
      "author": "Graham Killeen"
    },
    {
      "text": "We're The Millers asks you to believe that somewhere in this world there's a pot dealer who prides himself on not selling to kids and a stripper who never takes her bra off.",
      "author": "Linda Barnard"
    },
    {
      "text": "Loud and annoying? Occasionally. Funny? Sometimes. Likely to be noticed by filmgoers six months from now? Not really.",
      "author": "Ben Kenigsberg"
    },
    {
      "text": "The setup is there, but something gets lost on the way to the punch line.",
      "author": "Gary Thompson"
    },
    {
      "text": "An innocuously smutty road comedy starring Jason Sudeikis and Jennifer Aniston.",
      "author": "Steven Rea"
    },
    {
      "text": "For a movie about a group of drug smugglers pretending to be an all-American clan, \"We're the Millers\" hogs the middle of the road like the big, farty RV at its center.",
      "author": "Ty Burr"
    },
    {
      "text": "When the end-credit bloopers roll, Sudeikis and Aniston, free of the contrived plot, look like they're finally having fun.",
      "author": "Jake Coyle"
    },
    {
      "text": "[A]n ensemble comedy in which every character and every actor click into place.",
      "author": "Mark Dujsik"
    },
    {
      "text": "The kind of laugh till it hurts, spit-take funny, doubling over in your seat comedy that lesser films can only aspire to.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "We're The Millers isn't really a bad movie, so much as its inoffensively and instantly forgettable. You will laugh here and there, but you probably won't laugh even more.",
      "author": "Kevin Jagernauth"
    },
    {
      "text": "One could make a great movie out of this set-up, though sadly \"We're the Millers\" doesn't.",
      "author": "Laremy Legel"
    },
    {
      "text": "A smarter, more thoughtful comedy could have made something interesting out of this material, but \"We're the Millers\" takes the easy route.",
      "author": "Rafer Guzman"
    },
    {
      "text": "We're the Millers doesn't break any new comedic ground, but it's packed with some great laughs and an ensemble cast that seems game for just about anything.",
      "author": "Jason Zingale"
    },
    {
      "text": "While Aniston shows that she's as deft on a stripper pole as she is with her sitcom-honed timing, Sudeikis wields his smart-ass sarcasm like a barbed weapon. And more often than not, it kills.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "What really drives the movie is its own search for something to make fun of, and for a comic style that can feel credibly naughty while remaining ultimately safe and affirmative.",
      "author": "A.O. Scott"
    },
    {
      "text": "When the film sticks to the jokes, it's a breezy pleasure.",
      "author": "Eric D. Snider"
    },
    {
      "text": "The crux of the humor depends on the Sudeikis and Aniston characters bickering in a way that spells l-o-v-e, but the screenplay spells it a-g-g-r-a-v-a-t-i-o-n instead.",
      "author": "Michael Phillips"
    },
    {
      "text": "The Millers script -- it took four writers to cobble together something that seems so slight -- hits too many obvious notes between the moments when Aniston can strut her stuff.",
      "author": "Joe Neumaier"
    },
    {
      "text": "Like a long road trip with the family, this one speeds along without any bumps.",
      "author": "Matt Patches"
    },
    {
      "text": "\"We're the Millers\" has funny ideas, but it's not consistently inspired, and it goes on too long. There's a pretty great 85 minutes stuck in these 110.",
      "author": "Tim Grierson"
    },
    {
      "text": "Unfortunately, We're the Millers is a case of so many writers, so few real laughs, thanks to the strained brand of humor which permeates the project",
      "author": "David Noh"
    },
    {
      "text": "'National Lampoon's Vacation' retooled for the 'Hangover' generation...aims for the funnybone but more often hits the crotch.",
      "author": "Frank Swietek"
    },
    {
      "text": "Do you find insults revolving around the words Marky Mark, churros and/or #YOLO hilarious? How about the notion of a dorky white kid flawlessly rapping TLC's \"Waterfalls\"?",
      "author": "David Fear"
    },
    {
      "text": "There isn't a ton of heavy thinking involved with the high concept premise but it works better than one might expect.",
      "author": "Edward Douglas"
    },
    {
      "text": "A bland and expected comedy wearing the skin of something dark and naughty.",
      "author": "Witney Seibold"
    },
    {
      "text": "We'd have to be stoned to be interested in these characters or to be surprised when they form a surrogate family just in time for the blooper reel.",
      "author": "Joe Williams"
    },
    {
      "text": "Definitely a crowd-pleaser, all but guaranteed to be a sleeper hit of the late-summer movie season even if it is jagged around the edges and tries too hard to be too many things at once by the finale.",
      "author": "Dustin Putman"
    },
    {
      "text": "The film's humor ... tends toward the mean-spirited and cynical throughout-which ultimately makes [the] inevitable happy ending ring all the more false.",
      "author": "Genevieve Koski"
    },
    {
      "text": "A movie so lazy that it opens with clips from famous YouTube videos, just to prime the pump for laughs.",
      "author": "Katey Rich"
    },
    {
      "text": "\"We're the Millers\" delivers on the threat of its amusing setup with gags that often veer into the Farrelly brothers mode of pull-no-punches vulgarity.",
      "author": "Jon Niccum"
    },
    {
      "text": "For every laugh there's something that will make you want to hurl an object at the screen.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "\"We're the Millers\" is full of moments that feel as forced as the marriage of convenience - and contrivance - in the movie.",
      "author": "Betsy Sharkey"
    },
    {
      "text": "A funny trip with people who are fun to hang with even when they squabble.",
      "author": "Matt Pais"
    },
    {
      "text": "Jason Sudeikis in the lead? As a drug dealer who could never hope to pass for a picket-fence type? Please, the man looks like he was born in a Lands' End catalog.",
      "author": "Kyle Smith"
    },
    {
      "text": "\"We're the Filler\" might have been a more apt title ...",
      "author": "Justin Chang"
    },
    {
      "text": "More fun as a red band trailer than as a feature, We're The Millers scatters a handful of raucously funny scenes across nearly two hours of softer family themed comedy.",
      "author": "John Hazelton"
    },
    {
      "text": "We're the Millers is vulgar vanilla, a \"family\" comedy about a bunch of would-be golly-gee squares who talk dirty and get involved with Mexican drug dealers because it's 2013 instead of 1953.",
      "author": "Todd McCarthy"
    },
    {
      "text": "I'm baffled how you can throw this many relatively funny people at an idea this blatantly down-the-middle and end up with something like this.",
      "author": "Drew McWeeny"
    },
    {
      "text": "By ending with outtakes that wind up being the funniest part of the film, \"We're the Millers\" basically confesses that its talented cast would have been much better off untethered from the pedestrian screenplay.",
      "author": "Alonso Duralde"
    },
    {
      "text": "Picture Cheech & Chong on a National Lampoon Vacation!",
      "author": "Kam Williams"
    }
  ],
  "release_year": 2013,
  "duration": 110,
  "genres": [
    "Comedy",
    "Action"
  ],
  "synopsis": "Small-time pot dealer David learns the hard way that no good deed goes unpunished; trying to help some teens, he is jumped by thugs and loses his cash and stash. Now, David's in big debt to his supplier and to wipe the slate clean, he must go to Mexico to pick up the guy's latest shipment. To accomplish his mission, Dave devises a foolproof plan: He packs a fake family into a huge RV and heads south of the border for a wild weekend that is sure to end with a bang.",
  "popularity": 7.6,
  "poster_url": "https://image.tmdb.org/t/p/original/yNJreiR2PuiGwsWWJC7cWpgXwCL.jpg"
}