{
  "movie_name": "Wonder Woman",
  "movie_id": "wonder_woman_2017",
  "total_reviews": 474,
  "reviews": [
    {
      "text": "A turning point in the DC Extended Universe came when Patty Jenkins' Wonder Woman climbed out of the trenches.",
      "author": "Jennifer Bisset"
    },
    {
      "text": "Gal Gadot proved to be a worthy successor to LGBT ally extraordinaire Lynda Carter.",
      "author": "Brian T. Carney"
    },
    {
      "text": "Wonder Woman is fierce feminist filmmaking at its finest, featuring a powerhouse poignant performance from Gal Gadot, a truly ravishing romance that harkens back to Old Hollywood, and an effervescent sense of earnest optimism.",
      "author": "Zoë Rose Bryant"
    },
    {
      "text": "A visual splendor of precise period recreation and breathtaking superhero action. An emotional exploration of human proclivities towards good and evil and the ugliness of oppression and suffering.",
      "author": "Keith Garlington"
    },
    {
      "text": "Whether it represents a cog in a larger universe, a historical watershed for women’s leadership, or the answered prayers of long-suffering fans and idolizing dreamers, \"Wonder Woman\" is valiant, momentous, and satisfying.",
      "author": "Don Shanahan"
    },
    {
      "text": "Wonder Woman is flawed, clichéd, imperfect. But it has moments -- more than a few -- where I found myself shedding a slight tear. Sometimes sadness. Sometimes elation.",
      "author": "Jane Fae"
    },
    {
      "text": "Wonder Woman features an optimistic, brave, compassionate, and relatively well-adjusted character - a refreshing change of pace from the moody bunch that preceded her.",
      "author": "Brian Eggert"
    },
    {
      "text": "It's a big moment for blockbuster filmmaking  the next step in diversifying Hollywood storytelling on the big stage. In that effort, dare we say, it does a wonderful job.",
      "author": "Cory Woodroof"
    },
    {
      "text": "The Jenkins / Heinberg duo gave Hollywood a valuable lesson: the \"underdogs\" of indie cinema and television have much to contribute to contemporary action cinema that urgently needs new blood to avoid repeating formulas [Full review in Spanish]",
      "author": "Luis Bond"
    },
    {
      "text": "Diana Prince is both compassionate, gentle, and peace-loving while at the same time strong, uncompromising where important, and unwilling to be pushed around.",
      "author": "Hosea Rupprecht"
    },
    {
      "text": "Wonder Woman is the right movie at the right time -- and for all the right reasons.",
      "author": "Matt Brunson"
    },
    {
      "text": "It's not a stretch to say that Wonder Woman is the best of the recent DC Comics movies, but that's kind of damning with faint praise.",
      "author": "Alex Bentley"
    },
    {
      "text": "It showed a female-led comic book conquest was worth doing, especially when it leveraged well-executed period-piece elements with delightful sidekick chemistry...it proved everything didn't have to be dark and brooding in order to reach an audience.",
      "author": "Nathan Mattise"
    },
    {
      "text": "Wonder is Badass thanks to Patty Jenkins and Gal Gadot. PAcked with action, adventure and the type of diverse cast I wish was prevalent in most Hollywood blackbusters!",
      "author": "Carla Renata"
    },
    {
      "text": "It's taken a while, but the first ever superhero film with both a female protagonist and director is an absolute delight.",
      "author": "Dan Brightmore"
    },
    {
      "text": "Entries into the Marvel Cinematic Universe continue to take chances and clean up at the box office but even the most cynical of us are eagerly awaiting what Patty Jenkins and Gal Gadot have in store next.",
      "author": "Jim Rohner"
    },
    {
      "text": "It's easily the best film in the DC Extended Universe (DCEU) thus far. But what does that mean when your yardstick is [Man of Steel, Batman vs. Superman, and Suicide Squad]?",
      "author": "Kendra James"
    },
    {
      "text": "Piercing through a lot of the nonsense and bombast, this is pretty crude nationalist and pro-war propaganda.",
      "author": "David Walsh"
    },
    {
      "text": "The overuse of computer-augmented imagery and wirework and fully computer-animated characters makes everything look just a bit faker, especially during showdowns.",
      "author": "Mike Massie"
    },
    {
      "text": "Diana's a strong role model for young girls as she's a fighter and has no time for the typical gender roles placed in society.",
      "author": "Paul McGuire Grimes"
    },
    {
      "text": "Gal Gadot is simply extraordinary.",
      "author": "Richard Propes"
    },
    {
      "text": "Wonder Woman would have been a powerful statement just by its mere existence. Instead, we are treated to a definitive genre classic in its own right.",
      "author": "Leigh Monson"
    },
    {
      "text": "Wonder Woman deserves the success and praise not just because the film is about an empowering female superhero that will undoubtedly inspire the younger generation and women alike - it's just a good film period.",
      "author": "Kelechi Ehenulo"
    },
    {
      "text": "Go see Wonder Woman solely for the fact that it's a fantastic, well made, exciting and emotional film. In fact, I can honestly say, without hyperbole, that this is one of the best superhero movies ever.",
      "author": "Damond Fudge"
    },
    {
      "text": "Wonder Woman is not only the depiction of a powerful woman that men and women alike needs to see, it's a metaphor for ourselves as well. It's a win for a comic movie universe that very much needed one.",
      "author": "Murjani Rawls"
    },
    {
      "text": "This film is full of 'fish-out-of-water' humour which comes from a demi-god negotiating the world of men. It is also visually stunning and the action scenes are thrilling - coupling the world of superheroes with WWI works surprisingly well.",
      "author": "Fiona Underhill"
    },
    {
      "text": "Wonder Woman is a flawed superhero origin story. With that out of the way, the good news is it's mostly awesome, brings one of the greatest comic book characters ever to the big screen, and breaks up the boys' club that is contemporary superhero cinema.",
      "author": "Brent McKnight"
    },
    {
      "text": "Although it has a charismatic role from Gal Gadot, it has nothing exciting for two hours that turns wonderful to yawn. [Full review in Spanish]",
      "author": "Yasser Medina"
    },
    {
      "text": "It was totally entertaining. I'm excited to see more of these movies.",
      "author": "Avaryl Halley"
    },
    {
      "text": "Part of what I really liked about this movie was that it focused on her as a character and a human being.",
      "author": "Andrew Galdi"
    },
    {
      "text": "Judged on equal footing as all other superhero films, as it and all movies should be, this is a terrific action film, a sly take on gender politics of the early 1900s, and a wonderfully crafted antiwar picture.",
      "author": "Steven Prokopy"
    },
    {
      "text": "... the directing by Patty Jenkins who shows that she can take a good script and turn out great scenes and coherence. Her way of directing works fantastically well with lead Gal Gadot's interpretation of Wonder Woman.",
      "author": "Emilie Black"
    },
    {
      "text": "Wonder Woman stands proudly on its own, and a frankly astonishing sequence of Diana crossing No Man's Land alone pushes a fun blockbuster directly into iconic territory.",
      "author": "Tim Brennan"
    },
    {
      "text": "At least, finally the DCCU seems willing to learn from its mistakes and improve over previous entries.",
      "author": "Jorge Ignacio Castillo"
    },
    {
      "text": "Gal Gadot's performance is fantastic to watch, she not only carries the entire film, but she also brings strength, intelligence, compassion and beauty to her role.",
      "author": "Sarah Knight Adamson"
    },
    {
      "text": "Making the Hero with a Thousand Faces a woman proves the primal power of the oldest story by opening it up to half the world. After untold thousands of years, it still works.",
      "author": "Chris McCoy"
    },
    {
      "text": "Jenkins' Diana is vulnerable but strong, compassionate but fierce, good-hearted but no pushover. This film is a solid springboard for Diana to be fleshed out in further instalments.",
      "author": "Grethe Kemp"
    },
    {
      "text": "Wonder Woman brings joy and compassion to the DC Universe.",
      "author": "Aly Caviness"
    },
    {
      "text": "Gal Gadot is perfect in this role as she conveys compassion, athleticism and a sense of innocence as she experiences life outside of Themyscira.",
      "author": "Katie Smith-Wong"
    },
    {
      "text": "Kudos for all those involved at DC and Warner Bros. in making this woman-helmed and woman-led film so very entertaining.",
      "author": "Leslie Combemale"
    },
    {
      "text": "Gadot - who I'm not yet convinced is a great actor - is one hundred percent perfect in this role, to the extent that it would be a much poorer movie without the zeal and charisma which she brings to the titular Princess of the Amazons.",
      "author": "Rhys Tarling"
    },
    {
      "text": "Not a great film, but it is a good one.",
      "author": "Kate Rodger"
    },
    {
      "text": "Not only is Wonder Woman an action film for all ages and genders, but it has a great positive message: no matter how ugly the world gets because of war and dictators, we must be good, protect one another and do right by one other.",
      "author": "Linda and Al Lerner"
    },
    {
      "text": "The superhero film is dripping with engaging characters and you find yourself engrossed with the story. But the film takes a sharp detour in its second half to unveil something incredibly formulaic and predictable.",
      "author": "Chris Sawin"
    },
    {
      "text": "A triumph and the first truly great DC Films release, Wonder Woman exceeds every expectation and stands tall as one of the greatest superhero movies of all-time.",
      "author": "Josh Wilding"
    },
    {
      "text": "Its brain, sense of spectacle, its excellent visual and its approach to an icon of popular culture place it as one of the best superhero movies since 'The Dark Knight' of Christopher Nolan. [Full review in Spanish]",
      "author": "Víctor López G."
    },
    {
      "text": "Wonder Woman is a pure delight.",
      "author": "Karl Delossantos"
    },
    {
      "text": ". Where Snyder's films thus far have been dismal 9/11 rehashing oddities, Jenkins has made the first film to capture the magic DC's always represented in the four color world. It's a treasure to have it here on the silver screen.",
      "author": "Dominic Griffin"
    },
    {
      "text": "In her own movie, Wonder Woman has less lines of dialogue than her \"supporting\" love interest, expresses no personality and doesn't even really save the day.",
      "author": "Ryan Syrek"
    },
    {
      "text": "Rather than a reliance on flashy effects and over-the-top, apocalyptic plots, Wonder Woman  remains grounded in a totally refreshing way.",
      "author": "Mattie Lucas"
    },
    {
      "text": "For the film to reach its conclusion Diana must be confronted by the limits and power of humankind. She must understand the wonder of humanity. And for the film to work, we must be in wonder of her. And we are.",
      "author": "Andrew Kendall"
    },
    {
      "text": "Wonder Woman is easily the best DCEU movie to date. The CGI is sub par, but is forgotten during the epic battles, and thrilling plot points.",
      "author": "Tessa Smith"
    },
    {
      "text": "Wonder Woman is awesome and awe-inspiring. An all-round captivating piece of cinema.",
      "author": "Deirdre Molumby"
    },
    {
      "text": "Wonder Woman may not be perfect, but it's a validation for young girls everywhere of their strength and value, and it's the first superhero film in a long time that made me look forward to a sequel.",
      "author": "Julie Crawford"
    },
    {
      "text": "The imperative to eradicate any hint of bossiness or anger from her character weighs heavily on the film, threatening to turn it into one long, dispiriting exercise in allaying male fears about powerful women.",
      "author": "Zoe Heller"
    },
    {
      "text": "Congrats to Patty Jenkins and everyone involved for finally giving me a blockbuster I actually cared about! Thank you!",
      "author": "Rachel Wagner"
    },
    {
      "text": "Wonder Woman not only fulfils all the criteria of a superhero movie but is also engaging, exciting and inspiring throughout",
      "author": "Becky Kukla"
    },
    {
      "text": "Gal Gadot absolutely rocks as the mighty Wonder Woman, as well as the sweet and compassionate Diana. It's not just the best DCEU film so far, it's a solid and hugely entertaining film, period.",
      "author": "Ruth Maramis"
    },
    {
      "text": "Some aspects of the story are also a bit over the top, but then again, it is a superhero movie. Overall, go watch it.",
      "author": "S. Indra Sathiabalan"
    },
    {
      "text": "The opening act drags with exposition and the climax slips into the same fire and brimstone mixtape so beloved of DC. But that status also buys it an inspiring, revolutionary spirit that your average neighborhood superhero film can only dream of.",
      "author": "Tom Bond"
    },
    {
      "text": "...a wholesome good-versus-evil film that's surely bound for success.",
      "author": "Deborah Cornelious"
    },
    {
      "text": "Wonder Woman is smart and engaging, funny and fun; there's far more humor and heart here than in any other DC offering.",
      "author": "Allen Adams"
    },
    {
      "text": "Director Patty Jenkins knocks it out of the park with this film.",
      "author": "Amanda Greever"
    },
    {
      "text": "We've never had a superhero film directed by a female director, and after what Jenkins has delivered, this clearly needs to change immediately.",
      "author": "Doug Jamieson"
    },
    {
      "text": "Wonder Woman, simply put, is a wonder.",
      "author": "Nathalia Aryani"
    },
    {
      "text": "Like Zeus breathing life into the world creating man, so does [director Patty] Jenkins breathe life into the DCEU.",
      "author": "Douglas Davidson"
    },
    {
      "text": "It isn't groundbreaking in structure, but its exhibition of strong female heroism amidst conflicts of the past just elevates everything...",
      "author": "Colby Bryant"
    },
    {
      "text": "A nuanced message of hope and mercy in a violent world? A superhero motivated by love and a desire for peace? A visionary portrayal of femininity in all its beauty, complexity, and strength? I'm with her.",
      "author": "Joel Mayward"
    },
    {
      "text": "This is an exciting moment for women all over the world, make no mistake. But the outdated source material hinders Wonder Woman from reaching full-out beast mode.",
      "author": "Li Lai"
    },
    {
      "text": "With the disappointment of Batman vs. Superman and Suicide Squad, DC proves they may have found their magic again.",
      "author": "Sharronda Williams"
    },
    {
      "text": "It's not really possible to fully divorce Wonder Woman from the fact that its simple existence feels like a big, revolutionary \"event\" in and of itself.",
      "author": "Bob Chipman"
    },
    {
      "text": "Easily joins the ranks of some of the best first outings for a superhero in the last two decades.",
      "author": "Patrick Bromley"
    },
    {
      "text": "Jenkins has a keen eye for the action sequences, staging some elaborate moments stylistically. With the help of Gardot's performance, there is humanity in this character that has been sorely lacking in [DC movies].",
      "author": "Micheal Compton"
    },
    {
      "text": "Wonder Woman is undeniably the strongest entry in the ever-expanding DC Extended Universe.",
      "author": "Zaki Hasan"
    },
    {
      "text": "Wonder Woman is not just the first great female-led superhero movie ... but an astounding example of modern blockbuster filmmaking in general.",
      "author": "Jennifer Heaton"
    },
    {
      "text": "Wonder Woman is unmarred by the cynicism, grim and gritty attitudes, and humorless self-seriousness that have plagued the early entries in the DCEU.",
      "author": "Sean Mulvihill"
    },
    {
      "text": "Wonder Woman is not just the best film in the [DCEU] to date. It isn't just one of the best origin stories to date. It's simply one of the best superhero films made, period.",
      "author": "Johnny Gayzmonic"
    },
    {
      "text": "It merges the best parts of Thor and Captain America into an origin story possessed with increased character complexities despite its generic plot.",
      "author": "Jared Mobarak"
    },
    {
      "text": "If you are still in the camp of \"DC cannot get it right\", I implore you to take a chance on Wonder Woman. Diana Prince is more than a demigod with the power to bring down the mighty. She's the hero we deserve.",
      "author": "Aaron Peterson"
    },
    {
      "text": "The sappy romance might be a bit much for some, but there's a sense of optimism and play in Wonder Woman that feels invigorating after the dismal death wheeze of more recent DC efforts.",
      "author": "Alex Casey"
    },
    {
      "text": "With the film on-course for a stellar opening weekend ... the period superhero movie proves itself to be a exciting and entertaining entry to the DC cinematic universe",
      "author": "Kimberly Pierce"
    },
    {
      "text": "The refreshing superhero film the DCEU desperately needed.",
      "author": "Rendy Jones"
    },
    {
      "text": "Wonder Woman has greatness to it -- because of its hero, because of its spirit, and because it is done absolutely right.",
      "author": "Abbie Bernstein"
    },
    {
      "text": "Wonder Woman is far from a perfect film, but it's brave and smart enough to be granted a well-deserved sequel.",
      "author": "Akhil Arora"
    },
    {
      "text": "Patty Jenkin's Wonder Woman is an entertaining, exciting film. I was surprised by how refreshed I was that Wonder Woman was a good person.",
      "author": "Jourdain Searles"
    },
    {
      "text": "This is Diana's journey, and it is a beautiful and affecting indictment of the kind of people who have power yet can move through the world without using those powers for good.",
      "author": "Molly Templeton"
    },
    {
      "text": "This film is very much the hero's journey, end-to-end, and it did such a good job that I forgot it was doing that. I was just lost in the story.",
      "author": "Jaby Koay"
    },
    {
      "text": "As a summer blockbuster with blistering action, charm to burn and plenty of potential, it's a hit.",
      "author": "Alison Rowat"
    },
    {
      "text": "\"Wonder Woman\" lives up to its hype, and DC Comics' example of a strong, independent, fit woman is something to support.",
      "author": "Pamela Powell"
    },
    {
      "text": "Her journey in realizing that humans have a darkness and light in them is a tough lesson to learn, but her continued belief in that light is nicely done. Superhero fan or not, \"Wonder Woman\" is worth seeing.",
      "author": "Mae Abdulbaki"
    },
    {
      "text": "The performances, the plot, the music, the art direction -- everything about this film is movie making at it's best.",
      "author": "Lisa Johnson Mandell"
    },
    {
      "text": "The energy here is warm, unmistakably feminine, and the balance of light-hearted humor and melodrama sets this production apart from the somber, alpha-male brooding of its DCEU predecessors.",
      "author": "Rubén Rosario"
    },
    {
      "text": "Bad news, haters: Wonder Woman is good.",
      "author": "Deirdre Crimmins"
    },
    {
      "text": "It's told very well sans clumsy clutter and the pacing is perfect. Jenkin gets high marks for humor and for the delicate handling the romance between Gadot and the charismatic Pine who,... almost has you rooting for him to win.",
      "author": "Lapacazo Magrira Sandoval"
    },
    {
      "text": "With director Patty Jenkins at the helm, Wonder Woman was in the hands of someone who was more than capable of doing Diana's story justice.",
      "author": "Britany Murphy"
    },
    {
      "text": "Wonder Woman flips nearly every gendered superhero trope it encounters.",
      "author": "Heather Hogan"
    },
    {
      "text": "Bottom line: The movie is terrific, just the breath of fresh air Warners needs.",
      "author": "Leah Sydney"
    },
    {
      "text": "Wonder Woman sits, as she should, both with the pantheon of great heroes, as well as above it.",
      "author": "Tom Fitzgerald and Lorenzo Marquez"
    },
    {
      "text": "Wonder Woman is the superhero movie that I've been waiting to see and, I suspect, after a string of critical failures the one DC wanted to make.",
      "author": "Stassa Edwards"
    },
    {
      "text": "Wonder Woman is a terrifically fun movie, deftly balancing action sequences and emotional beats. Gal Gadot is charismatic as the eponymous anti-war Amazon princess.",
      "author": "Annalee Newitz"
    },
    {
      "text": "The script by is unusually introspective",
      "author": "Mark R. Leeper"
    },
    {
      "text": "Wonder Woman isn't bogged down by seriousness and cynicism. Even in its many moments where it reaches for some sort of relevance, it still manifests an affinity for unabashed spectacle and enjoyment.",
      "author": "Oggs Cruz"
    },
    {
      "text": "While the future of the DCEU still remains very much in doubt, at least most will agree that the first major female-led superhero movie in years is a rousing success.",
      "author": "Shaun Munro"
    },
    {
      "text": "Watching Wonder Woman felt like breathing out a sigh of relief.",
      "author": "Eliza C. Thompson"
    },
    {
      "text": "I just really liked seeing a superhero that WANTS to be a superhero in a superhero movie.",
      "author": "Andre Meadows"
    },
    {
      "text": "It represents a clear-eyed view of the world.",
      "author": "Megan Basham"
    },
    {
      "text": "After three underwhelming films, Warner Bros. Pictures finally finds the formula for success with director Patty Jenkins' live-action Wonder Woman.",
      "author": "Rick Marshall"
    },
    {
      "text": "There are some problems with pacing...but the movie as a whole has a lot of good payoff.",
      "author": "Jeremy Jahns"
    },
    {
      "text": "Wonder Woman is a solid piece of work, well worth watching, and hopefully a harbinger of better things to come from DC in the near future.",
      "author": "Christopher Llewellyn Reed"
    },
    {
      "text": "Gal Gadot IS Wonder Woman.",
      "author": "Steph Cozza"
    },
    {
      "text": "A strong entry in the comic-book superhero action film genre, with a plot that's compelling without being confusing, great special effects, strong villains, some inspirational 'girl power' scenes, crisp pacing....",
      "author": "James Plath"
    },
    {
      "text": "[Gal] Gadot is particularly memorable as the lead character here.",
      "author": "John Hanlon"
    },
    {
      "text": "Wonder Woman is a simply perfect product. [Full review in Spanish]",
      "author": "Irene Zoe Alameda"
    },
    {
      "text": "First and foremost, this is a fun film from start to finish, with gorgeous visuals, an amazing score and perfect pacing.",
      "author": "Carl Kozlowski"
    },
    {
      "text": "... Wonder Woman is an improvement over the recent onslaught of oft-tedious comics-based movies.",
      "author": "Al Hoff"
    },
    {
      "text": "I'm confident Wonder Woman is one of the best superhero movies ever made. I can't wait to get back to the theater and watch it again.",
      "author": "Jason Guerrasio"
    },
    {
      "text": "It's not difficult to see where this route is going, but that doesn't make it any less enjoyable to watch. The simple power of love is the cornerstone upon which Wonder Woman is built. If it seems earnest, it's because it is.",
      "author": "Karen Han"
    },
    {
      "text": "I felt empowered and I'm not wonderful or a woman. You can view Wonder Woman and her first solo entry movie as a feminist icon, but honestly, it's so much more than that. She inspires us all to be more caring and better to one another",
      "author": "Robert Kojder"
    },
    {
      "text": "It's thrilling that Wonder Woman is enjoying the critical and commercial success that it is. But, in some ways it's also unfair. There is more weight than one film by one director about one woman should bear.",
      "author": "Alexandra MacAaron"
    },
    {
      "text": "Gal Gadot's perfect blend of battlefield courage and uncomplicated compassion provides a formidable champion we have fun rooting for.",
      "author": "Blake Crane"
    },
    {
      "text": "The Wonder Woman that we needed. [Full review in Spanish]",
      "author": "Irene Crespo"
    },
    {
      "text": "Wonder Woman Lives Up to the Hype",
      "author": "Danielle Solzman"
    },
    {
      "text": "Wonder Woman is alive and in command in ways the other DCEU films can only dream about. It is, in short, heroic.",
      "author": "Chris Evangelista"
    },
    {
      "text": "This is undoubtedly the strongest DCEU outing till now, one that will add a new world of (female) fans to the franchise, and for all the right reasons.",
      "author": "Neil Soans"
    },
    {
      "text": "Gadot, who almost stole last years \"Batman V Superman: Dawn of Justice,\" is outstanding here as the Amazon goddess who not only learns about her destiny but that of her people.",
      "author": "Michael A. Smith"
    },
    {
      "text": "[Chris Pine's] chemistry with [Gal] Gadot is sparkling. But this is film is all about Wonder Woman. And Gadot looks like she was born to bring this legend to life on the big screen.",
      "author": "Rachit Gupta"
    },
    {
      "text": "[Wonder Woman's] greatest mert is to reinvent all the genres it touches from a woman's perspective. [Full Review in Spanish]",
      "author": "Beatriz Martínez"
    },
    {
      "text": "\"Wonder Woman\" just isn't that good of a movie",
      "author": "Jordan Ruimy"
    },
    {
      "text": "A ponderous film that contains the Michael Bay esthetic beneath a thin veneer of faux feminism.",
      "author": "Louis Proyect"
    },
    {
      "text": "Despite its flaws, Wonder Woman is every bit as epic as Batman v. Superman or Suicide Squad, yet has the humanity and emotion that those movies sorely lacked, despite being smaller-scaled.",
      "author": "Ryan Pollard"
    },
    {
      "text": "It's the film that might just turn Gal Gadot into a real film star. She's touchingly good, bringing a genuine emotional depth to a part that, in others' hands, could easily have none at all.",
      "author": "Matthew Bond"
    },
    {
      "text": "There is great pleasure in the matter-of-fact way Jenkins and Heinberg make points about chauvinism, sexism, and equality through pointed humor and practical examples, and how deftly Diana sweeps aside all attempts by men to dismiss her.",
      "author": "Sean Axmaker"
    },
    {
      "text": "Amid stunning visuals, well-crafted action sequences and a decent plot, Gal Gadot's nuanced performance speaks volumes.",
      "author": "Jordan Hoffman"
    },
    {
      "text": "DC Comics should send a huge thank-you hamper to Patty Jenkins.",
      "author": "Joanne Soh"
    },
    {
      "text": "... stands on its own as an action-packed, enjoyable piece of escapism.",
      "author": "George M. Thomas"
    },
    {
      "text": "While I'm not a big fan of superhero movies, Petty Jenkins' Wonder Woman proved to be entertainingly in its own unique way.",
      "author": "Rob Lowman"
    },
    {
      "text": "Wonder Woman is an exciting and welcome addition to the DC live action universe. She is strong and smart and capable-and also exceptionally beautiful, but it is the former qualities that are given the greatest focus.",
      "author": "Keeva Stratton"
    },
    {
      "text": "The new Wonder Woman from director Patty Jenkins has an effective story, borrowing fictional archetypes while offering something original.",
      "author": "tt stern-enzi"
    },
    {
      "text": "But this attempted revamp of the boys-club superhero genre dares to suggest that a person of conscience might put her invincible physical prowess to better use by seeking to end the carnage of warfare, not just fight to win.",
      "author": "Lisa Jensen"
    },
    {
      "text": "Now that Wonder Woman's backstory is finally on the books, let's hope the filmmakers can come up with fresher installments in the future.",
      "author": "André Hereford"
    },
    {
      "text": "A correct film, effective, with some problems in its development, but it's the most laudable that DC has done so far. [Full review in Spanish]",
      "author": "Adrián Ruiz"
    },
    {
      "text": "All considered, director Patty Jenkins has crafted a film that is about to unexpectedly revive the maligned reputation of the DCEU on the big screen, and it couldn't have arrived at a better time.",
      "author": "Nick Reilly"
    },
    {
      "text": "As befitting the genre, Wonder Woman is heroic and spirited. The fighting sequences are spectacular, and the story is engrossing, uplifting and fun. There's even a bit of romance and humor amid all the action. [Full review in Japanese]",
      "author": "Claudia Puig"
    },
    {
      "text": "The No Man's Land scene is everything, literally absolutely every last thing that every comic book movie should always be aspiring to.",
      "author": "Tim Brayton"
    },
    {
      "text": "Gadot claims star status, handling the title-character with charm, sincerity, finesse and a look that exudes beauty and good health.",
      "author": "Robert Denerstein"
    },
    {
      "text": "More than a superhero movie, this is an adventure film, and a really, really good one.",
      "author": "Lili Loofbourow"
    },
    {
      "text": "Wonder Woman is not a \"woman's movie,\" but an action film with incredible relevance.",
      "author": "Kaori Shoji"
    },
    {
      "text": "Wonder Woman is a thrilling start.",
      "author": "Megan Burbank"
    },
    {
      "text": "\"Wonder Woman\" lifts the oppressive darkness that has been the signature of the DC universe since Christopher Nolan's Batman trilogy - both tonally and visually.",
      "author": "Greg Maki"
    },
    {
      "text": "Gal Gadot has a talent for making every experience feel like it's her first - which, in Diana's case, it often is. She is remarkably alert. Her eyes and her face are always open; she's always receiving, learning, responding.",
      "author": "K. Austin Collins"
    },
    {
      "text": "This adaptation is very exciting.",
      "author": "Sr. Rose Pacatte"
    },
    {
      "text": "Our heroine leaps through the air, spinning like an arrow, but the action has so little weight, emotional or otherwise, that one feels nothing.",
      "author": "Dorothy Woodend"
    },
    {
      "text": "an exuberant fantasy with a genuine conscience that stands apart from so many other similar films in its willingness to embrace goodness, decency, and an unironic belief in the power of love",
      "author": "James Kendrick"
    },
    {
      "text": "If superheroes are supposed to be heightened versions of ourselves at our brightest and darkest points, then it is no wonder women are appreciating this character on screen... recognizing such duality in their own lives: that of object and agent.",
      "author": "Brooke Corso"
    },
    {
      "text": "[Wonder Woman is] hugely entertaining and provides a gripping origin story for the iconic female superhero.",
      "author": "Marija Djurovic"
    },
    {
      "text": "Until the battering finale, production designer Aline Bonetto and Jenkins focus the action so that even in the ravages of no-man's-land, the sound and fury signify something.",
      "author": "Michael Sragow"
    },
    {
      "text": "A great accomplishment of its director Patty Jenkins, who shows that it has the necessary talent to take care of a blockbuster of this size. [Full review in Spanish]",
      "author": "Iván Belmont"
    },
    {
      "text": "The most obvious issue here is an absurdly, needlessly overlong running time of 141 minutes (!)...",
      "author": "David Nusair"
    },
    {
      "text": "A film that has values that are interesting enough and different from the rest to make us smile. [Full review in Spanish]",
      "author": "Alejandro G. Calvo"
    },
    {
      "text": "A well-intentioned film that in an age of cynicism dares to recapitulate the importance of the primeval ideal of a superhero: the discovery of inspirational models and escapism. [Full review in Spanish]",
      "author": "Uriel Barco"
    },
    {
      "text": "So we have the formula: a good character, good sequences of action and a good story. [Full review in Spanish]",
      "author": "Carlos Díaz Reyes"
    },
    {
      "text": "Wonder Woman is not just exciting to watch -- she Wonder-fully undermines DC Comics' endorsement of vigilante justice and glorified bloodshed.",
      "author": "Jeffrey Overstreet"
    },
    {
      "text": "That optimism [is] what makes Diana Prince a real superheroine, and it's that vision that makes Wonder Woman a movie that really thrills. [Full review in Spanish]",
      "author": "Emmanuel Báez"
    },
    {
      "text": "The film is full of \"you go, girl\" moments designed to please the genre's long-neglected female demographic. Yet Diana seems far more confident than the film's director, Patty Jenkins...as a narrative the film is over the shop.",
      "author": "Jim Schembri"
    },
    {
      "text": "'Wonder Woman' is good, but not as much as I expected after so much praise. Maybe that's why I've focused more on its weak points when the truth is that I came out quite satisfied to see it. [Full review in Spanish]",
      "author": "Mikel Zorrilla"
    },
    {
      "text": "A film with a magnificent period recreation, a fantastic staging and an exiciting climax. [Full review in Spanish]",
      "author": "José Martín"
    },
    {
      "text": "Wonder Woman isn't placating audiences with its representation. It's using that opportunity to address larger injustices. It may not be perfect, but it's an encouraging step in the right direction.",
      "author": "Abby Olcese"
    },
    {
      "text": "Breathes life into a dying cinematic genre.",
      "author": "Wesley Lovell"
    },
    {
      "text": "Wonder Woman is easily the best DCEU movie so far and the best superhero movie since The Winter Soldier.",
      "author": "Jared Rasic"
    },
    {
      "text": "It's two-thirds of a terrific picture, and I'm hard pressed to think of a recent movie I was enjoying so much that s**t the bed quite as spectacularly as this one does.",
      "author": "Sean Burns"
    },
    {
      "text": "We shouldn't underestimate the opportunity the film faces: to be a feminist rescue mission.",
      "author": "John Serba"
    },
    {
      "text": "One of the few superhero movies to pass the Bechdel test with flying, bullet-deflecting wrist bracelets.",
      "author": "David N. Butterworth"
    },
    {
      "text": "What really makes the film, however is Diana's spiritual journey. Coming from an isolated, simplistic society into the greater world, she discovers for herself the complex, diverse nature of people. This spiritual journey is one worth taking.",
      "author": "Robert Roten"
    },
    {
      "text": "Wonder Woman moves like a '40s adventure story at times, with a hero-or in this case, heroine-realizing there is a greater sense of duty and service that calls for her to take her head out of the sand.",
      "author": "David Crow"
    },
    {
      "text": "As boring and flavorless as a three-day-old grilled cheese sandwich that's been left out in the sun, \"Wonder Woman\" is yet another reminder that the superhero genre is a lost cause.",
      "author": "Cole Smithey"
    },
    {
      "text": "\"Wonder Woman\" is sturdy. It's expensive. Its star, Gal Gadot is winning and hard-working. And yet, what's up on screen is dutiful and derivative and, frankly, a bit dull.",
      "author": "Eleanor Ringel Cater"
    },
    {
      "text": "DC Comics gives us a heroine to follow and applaud. Gal Gadot combines beauty, intelligence, ingenuity and the tenacity of a compassionate warrior in her princess Diana. [Full review in Spanish]",
      "author": "Mario P. Székely"
    },
    {
      "text": "Wonder Woman is a deeply sincere superhero film, but not in a self-important way.",
      "author": "Imogen West-Knights"
    },
    {
      "text": "Hits the superhero sweet spot between new and familiar, funny and exciting, romantic and heroic.",
      "author": "Nell Minow"
    },
    {
      "text": "When Trevor insists on traveling to England to consult with 'the men' he says are in the best position to end the war, Diana's response obliterates the gender gap: 'I am the man who can.'",
      "author": "John Beifuss"
    },
    {
      "text": "Flashback lurches into tedious flashback, while in the interim, blurs of jerky, chopped-up action and CGI explosions fill the spaces where you might have hoped for credibly choreographed battles.",
      "author": "Stuart Klawans"
    },
    {
      "text": "Here, DC gets its first good movie. Jenkins has come up with a star that can hold the attention of the audience better than any superman stuffed with steroids. [Full review in Spanish]",
      "author": "Daniel Krauze"
    },
    {
      "text": "In short, Wonder Woman is a wonder.",
      "author": "Diane Pershing"
    },
    {
      "text": "Jenkins rises above the pressure and brings a solid, interesting and humorous story to life. Wonder Woman brings light to the darkness of the DCEU, literally and figuratively.",
      "author": "Joi Childs and Caron LeNoir"
    },
    {
      "text": "Gadot and Pine [mine] their characters for the kinds of small but meaningful moments that most superhero movies would kill for.",
      "author": "J. Olson"
    },
    {
      "text": "\"Wonder Woman\" is a superhero movie, and it fulfills the heroic and mythic demands of that genre, but it's also an entry in the genre of wisdom literature that shares hard-won insights and long-pondered paradoxes of the past with a sincere intimacy.",
      "author": "Richard Brody"
    },
    {
      "text": "I love her. I love her so much.",
      "author": "Bob Grimm"
    },
    {
      "text": "For Wonder Woman girls can cheer without feeling a hint of fear. And guys can also shout'Hooray' when Wonder Woman saves the day!",
      "author": "Betty Jo Tucker"
    },
    {
      "text": "Wonder Woman is a perfect reflex of its time. [Full review in Portuguese.]",
      "author": "Pablo Villaça"
    },
    {
      "text": "As Wonder Woman, Gal Gadot cuts an iconic figure throughout, each purposeful stride a symbol in motion.",
      "author": "Steve Persall"
    },
    {
      "text": "Gadot carries the movie by combining the charisma of a demigod with the personability of Indiana Jones; even when she's fiercest, empathy and humor are never far away.",
      "author": "Margot Harrison"
    },
    {
      "text": "A long, long overdue movie, given our taste for superheroics, Wonder Woman deserves to be a hit. All the things that go right here overwhelm the few that don't.",
      "author": "Richard von Busack"
    },
    {
      "text": "Just fantastic from top to bottom...",
      "author": "Felix Vasquez Jr."
    },
    {
      "text": "Although the film follows a somewhat traditional script, it also deviates -- because superheroing while female is a radical act.",
      "author": "Alicia Cohn"
    },
    {
      "text": "A movie with a good romantic rapport by Gadot and Pine, a solid secondary cast and a dramatic idea contained in Allan Heinberg's script. [Full review in Spanish]",
      "author": "Ernesto Diezmartinez"
    },
    {
      "text": "Patty Jenkins brings a refreshing clarity to [Wonder Woman], a productive mix of gravitas and winking.",
      "author": "Rob Gonsalves"
    },
    {
      "text": "There are too many villains, none of them dramatically strong enough to be much of a threat, and the most interesting characters get killed off too soon.",
      "author": "Jim Lane"
    },
    {
      "text": "Beauty, strength, goodness, bravery: These are your values, and here is how your values must look.",
      "author": "Jo Livingstone"
    },
    {
      "text": "This is a proper introduction to a superhero who was brought on so lamely in Batman vs. Superman, and the good outweighs the bad here, on balance.",
      "author": "Kristian M. Lin"
    },
    {
      "text": "The film is successful for what it is because it's directed by a woman. It's worth considering the nuclear-grade disaster this could have been with a guy at the helm.",
      "author": "Walter Chaw"
    },
    {
      "text": "Everything about this joyful, sincere origin story feels like a retort - a very welcome and much needed one - to traditional male-centered superhero stories.",
      "author": "MaryAnn Johanson"
    },
    {
      "text": "From the powerful confidence of [Gadot's] action scenes to moments of emotion and comic relief, it's already near impossible to imagine anyone else in this role.",
      "author": "Brad Keefe"
    },
    {
      "text": "Jenkins tries not only to include men on Wonder Woman's side but also to make male viewers feel better about a woman saving them.",
      "author": "Leah Pickett"
    },
    {
      "text": "Gadot's Princess Diana is the full nascent-superhero package: youthful idealism, a body so perfect you'd swear it was a special effect, and some mystical backstory for a third-act revelation.",
      "author": "Craig Mathieson"
    },
    {
      "text": "The action is solid enough and the effects, of course, are impressive, but the [Wonder Woman] lacks imagination.",
      "author": "Vicky Roach"
    },
    {
      "text": "This elaborate and expensive epic is worth it for star Gadot.",
      "author": "David 'Mad Dog' Bradley"
    },
    {
      "text": "By the time we reach the Western Front with Trevor's rag-tag secret agent squad, Patty Jenkins has so deftly juggled period rom-com and epic fantasy elements that even trench warfare barely dampens the momentum.",
      "author": "Jay Horton"
    },
    {
      "text": "With strong characterisation from a largely committed cast, coherent action and a rare confidence in its mise-en-scène, Wonder Woman is a comic book movie the way they should be done.",
      "author": "Alex Doenau"
    },
    {
      "text": "Wonder Woman provides an example of female power that the world needs. Both girls and boys need to see women on-screen just as powerful, if not more powerful than men.",
      "author": "Zachary Kennedy"
    },
    {
      "text": "Wonder Woman has come to save us from ourselves in her long, long, long overdue cinematic debut. And in the best news of all, the wait was worth it.",
      "author": "Mathew DeKinder"
    },
    {
      "text": "Wonder Woman is a positive symbol, but the ideology of the movie itself is fuzzy and somewhat disappointing.",
      "author": "Vincent Mancini"
    },
    {
      "text": "Wonder Woman is a great action movie, full of adventure and light drama, similar to films like Christopher Reeve's Superman. [Full review in Spanish]",
      "author": "Sebastian Zavala Kahn"
    },
    {
      "text": "Top action choreography, a fine cast and a side order of fish-out-of-water camp that director Patty Jenkins serves next to wartime derring-do and Diana's gritty grace is why it succeeds.",
      "author": "Hilary A White"
    },
    {
      "text": "An elegant but intellectually timid film.",
      "author": "Camilla Long"
    },
    {
      "text": "Jenkins and screenwriter Allan Heinberg have created an unassailable icon, one who fits into the pantheon with ease, and stands out like no other.",
      "author": "Elizabeth Weitzman"
    },
    {
      "text": "DC finally breaks its long losing streak with a satisfying effort- and all it took was changing absolutely everything (Splice Today)",
      "author": "Stephen Silver"
    },
    {
      "text": "Wonder Woman doesn't walk away from her first film unscathed, but Jenkins mostly gets it right, focusing on grandeur, virtue, and sheer butt-kicking excellence, supporting a hero who's truly heroic.",
      "author": "Brian Orndorf"
    },
    {
      "text": "Wonder Woman is a damned good superhero movie, because it remembers to just be a damned good movie.",
      "author": "Matt Neal"
    },
    {
      "text": "Here, in her own surroundings -- and playing with contrivances that include the character's magic bracelets and Lasso of Truth -- Gadot truly appears to be a legitimate movie wonder.",
      "author": "John Urbancich"
    },
    {
      "text": "Unlike most silly fantasy superhero movies, this one is not set in a fictional locale with fictional characters. No, it's Wonder Woman winning WWI! It is the same intellectual diarrhea of all the others, only worse, minimizing the horrors of WWI.",
      "author": "Tony Medley"
    },
    {
      "text": "What stands as the film's most surprising revelation is how timely \"Wonder Woman\" feels at moments when approaching themes of war and human kind. It taps into a sensitive spot that speaks volumes today.",
      "author": "Clayton Davis"
    },
    {
      "text": "\"Wonder Woman\" gracefully ascends into the arena and defiantly delivers a stylish, funny adventure made with heart. After the genre shaking \"Logan\" and the genre redefining \"Wonder Woman,\" there's only one thing left to be said: your move Marvel.",
      "author": "Blake Howard"
    },
    {
      "text": "A superhero origin story infused with the spirit of feminist adventure, and told with smarts, heart, and a different point-of-view.",
      "author": "Sarah Ward"
    },
    {
      "text": "No matter how the \"fairy tale\" really happened. Some unknown named Gal Gadot was chosen for instant stardom. And she deserves it! Director Patty Jenkins was finally released from Hollywood jail.",
      "author": "Victoria Alexander"
    },
    {
      "text": "This Wonder Woman will be inspirational to a new generation of young girls looking for a role model who is both physically strong and endlessly compassionate at the same time.",
      "author": "Tim Martain"
    },
    {
      "text": "...smartly feminist without making too big of a deal out of it.",
      "author": "Josh Larsen"
    },
    {
      "text": "After the offensively stupid Batman v Superman: Dawn of Justice and Suicide Squad, Wonder Woman feels nothing short of revelatory.",
      "author": "Christopher Machell"
    },
    {
      "text": "In common with Diana, there is a genuine wonder at work here. We rediscover the tropes of genre through her questioning eyes. And for once, the comic-book movie almost seems fresh again.",
      "author": "Wendy Ide"
    },
    {
      "text": "Wonder Woman's relative innocence and absolute conviction make for an endearing and formidable hero.",
      "author": "Ed Whitfield"
    },
    {
      "text": "The final big action sequence, as now seems always to be the case, is a messy and overwrought CGI extravaganza. But at least the movie that precedes it involves actual characters-likeable ones, even!-exhibiting recognizable human emotions.",
      "author": "Christopher Orr"
    },
    {
      "text": "Wonder Woman is a very likable movie. But it was also a very likable movie when Marvel made its kissing cousin, Captain America: The First Avenger.",
      "author": "David Poland"
    },
    {
      "text": "Loved Gadot. The script and supporting actors/characters not so much.",
      "author": "Jackie K. Cooper"
    },
    {
      "text": "Wonder Woman is the most refreshing comic book movie in years, if not ever. Smart, witty , fun and Gal Gadot shines along with Chris Pine.",
      "author": "Pete Hammond"
    },
    {
      "text": "As a period piece made in the spirit of an old-fashioned matinee, Wonder Woman (like the first Captain America) does not have to exhibit the insistent, grim-faced dystopianism that afflicts the recent Superman/Batman movies.",
      "author": "Gary Thompson"
    },
    {
      "text": "To be honest, the fight scenes go on too long and the CGI is laid on a bit thick. It isn't necessary. Gadot's magnificent heroine is enough of a wonder woman in her own right not to need it.",
      "author": "Jason Best"
    },
    {
      "text": "Visually dazzling pop culture superhero movie.",
      "author": "Dennis Schwartz"
    },
    {
      "text": "It only took two women to right a ship that dozens of male D.C. executives, writers and directors, have tried their damnedest to sink.",
      "author": "Rubin Safaya"
    },
    {
      "text": "Jenkins and company understand superheroes should have a purpose other than brooding.",
      "author": "Pete Vonder Haar"
    },
    {
      "text": "The beautiful message of Wonder Woman is that attributes commonly associated with women - compassion, empathy, and protectiveness - are the most awesome superpowers of all.",
      "author": "Mike McGranaghan"
    },
    {
      "text": "While the film descends into the usual pyrotechnical showdown late on, it's watchable, well made and not excessively violent overall, which should make it suitable for older children.",
      "author": "Paul Whitington"
    },
    {
      "text": "Finally, DC got it right -- Wonder Woman is a thrill ride that's entertaining from beginning to end.",
      "author": "Jamal Grootboom"
    },
    {
      "text": "[It's] surprising to watch the dynamic shift in performance she delivers throughout the film, as the naive and optimistic Diana is slowly faced with the undeniable darkness in mankind. Perhaps most importantly, Gadot is also [funny].",
      "author": "Kanin Srimaneekulroj"
    },
    {
      "text": "Wonder Woman does something special: It gets real. In a genre sometimes overly fond of black-and-white heroes and villains, this film forces its heroine to confront moral grays.",
      "author": "Melissa Leon"
    },
    {
      "text": "After her long struggle to the big screen, Wonder Woman makes the most of her first solo effort.",
      "author": "Kirk Baird"
    },
    {
      "text": "is wondrous -- an origin story about a superhero not driven by loss and vengeance but an innate sense of what's right.",
      "author": "Annlee Ellingson"
    },
    {
      "text": "It has some resemblance to Captain America: The First Avenger (2011), but Jenkins doesn't fall into the propagandistic discourse of saving America, but focuses on nurturing, humanizing and affirming the leadership of his heroine. [Full review in Spanish]",
      "author": "Luis Fernando Galván"
    },
    {
      "text": "A[n] armoured shoe-in for the most pleasantly stunning feature of the summer (or year for that matter), Wonder Woman is everything you could have ever expected from a Wonder Woman movie.",
      "author": "Jack Bottomley"
    },
    {
      "text": "Invests Princess Diana with possibly the most genuinely heroic characterization of any modern cinematic superhero.",
      "author": "Steven D. Greydanus"
    },
    {
      "text": "An entertaining film with a more sincere, heartfelt and sympathetic energy than its peers - of the best that DC has created in its bewildering attempts to imitate the Marvel model. [Full review in Spanish]",
      "author": "Benjamín Harguindey"
    },
    {
      "text": "It's no small relief that 'Wonder Woman' is a decent piece of pop art, messy and unsuccessful in spots, yes, but engaging nonetheless, and an almost incalculable improvement on its predecessors in the \"DC Extended Universe.\"",
      "author": "Jason Bailey"
    },
    {
      "text": "Sorry boys. Wonder Woman is the hero the DC universe deserves, and the one it should believe in.",
      "author": "Joshua Axelrod"
    },
    {
      "text": "Wonder Woman is a great yarn, done very well.",
      "author": "Graeme Tuckett"
    },
    {
      "text": "Wonder Woman embraces issues of female power and the need to turn from hate to love, war to peace in a mainstream delivery system. And the female lead is not solely a mother, sister, girlfriend or hooker, however gold her heart: wonder of wonders!",
      "author": "Thelma Adams"
    },
    {
      "text": "I've got no subtweet with Wonder Woman, ninety percent of its running time being nothing less than sharp moviemaking. Yet the true and lasting fun will be to witness its eddying cultural influence upon younger generation",
      "author": "Ray Pride"
    },
    {
      "text": "Wonder Woman gives this long-ignored heroine the coming-out party she truly deserves.",
      "author": "Rob Vaux"
    },
    {
      "text": "With a story that moves at a steady clip and action that threads the needle between realism and supernatural exaggeration, Wonder Woman is the arrival of a hero for all of us, but young women in particular.",
      "author": "Alan Zilberman"
    },
    {
      "text": "Boldly optimistic, this action-packed adventure breathes fresh life into the DC universe with a welcome balance of comedy, flirtation and a sense of righteous justice.",
      "author": "Rich Cline"
    },
    {
      "text": "It's impossible to imagine a better Diana Prince/Wonder Woman than Gal Gadot in Patty Jenkins' lively Wonder Woman.",
      "author": "Stephen Schaefer"
    },
    {
      "text": "Wonder Woman is a great movie by any measure, but it's at its best when it embraces and embodies the universe-defying potential inside the heart of every little girl.",
      "author": "Dominic Corry"
    },
    {
      "text": "Wonder Woman downplays Diana's pursuit of destiny in the fight against evil...Diana, like her introductory movie, has childlike enthusiasm but no passion.",
      "author": "Armond White"
    },
    {
      "text": "Gal Gadot's Wonder Woman gets a chance to shine in her own Hollywood movie. Gadot makes a pretty fine job of it too, bringing a bit of soul and empathy to the proceedings, but sometimes it's more despite than because of the production surrounding her.",
      "author": "Adam Sweeting"
    },
    {
      "text": "The film puts in much simpler words the human and feminine (even feminist) discourse already seen in The Force Awakens with Rey, who, like Diana, has to sacrifice, fight and learn before reaching the final goal. [Full review in Spanish]",
      "author": "Erick Estrada"
    },
    {
      "text": "Jenkins delivers Wonder Woman's origin story and although it's uneven and overlong it finds humor, humanity, and an appealingly old school sense of honor in its title character.",
      "author": "Beth Accomando"
    },
    {
      "text": "If Wonder Woman is a sign of what is to come from DC, it's a very good sign.",
      "author": "Josh Terry"
    },
    {
      "text": "The action is crisp and thrilling, but more importantly, it's meaningful... In fierceness and sheer badass fighting prowess, Wonder Woman is a match for the other heroes in her franchise. But in courage and certainty, she tops all of them.",
      "author": "Tasha Robinson"
    },
    {
      "text": "A satisfying and heroic film that doesn't pretend or prove to be anything more. [Full review in Spanish]",
      "author": "Erick Ortiz"
    },
    {
      "text": "Thanks to Gal Gadot's truly wonderful breakout performance and Patty Jenkins' robust direction, Wonder Woman proves worth the wait.",
      "author": "Brandy McDonnell"
    },
    {
      "text": "Jenkins delivers a superhero movie that's better than those helmed by her male predecessors who weren't Richard Donner or Christopher Nolan.",
      "author": "Dan Lybarger"
    },
    {
      "text": "From start to finish, Wonder Woman is an origin story that is faithful, thoughtful, and streaked with exciting action and impressive stunts.",
      "author": "Sadhbh Ní Bhroin"
    },
    {
      "text": "I was waiting for Gadot. Now that she's arrived, she was all the Gal I could have hoped for... Jenkins creates a hero who loves without fear. She understands the difference between Wonder Woman and the spandex heap of extraordinary others.",
      "author": "Katherine Monk"
    },
    {
      "text": "\"A trailblazer and a gamechanger.\"",
      "author": "Scott A. Mantz"
    },
    {
      "text": "It's overlong at 141 minutes and suffers from too much origin story exposition and middling CGI effects, but it has a frisky, friendly spirit that perfectly aligns with its wide-eyed lead actress, Gal Gadot.",
      "author": "Peter Rainer"
    },
    {
      "text": "Have no doubt, this movie does Wonder Woman justice, as well as her fans.",
      "author": "Vivian Kane"
    },
    {
      "text": "Wonder Woman has what many other action films (and superhero films) are missing: talented, chemistry-cast leads; exciting action; and thrilling villains to antagonise our heroes.",
      "author": "Matilda Dixon-Smith"
    },
    {
      "text": "If you can forgive the ending, like I have, and love Diana for her inspiring character, the righteousness of her spirit and also the mad slo-mo action, this film will lasso you right in.",
      "author": "Soumya Srivastava"
    },
    {
      "text": "Smart, funny and tremendously exciting.",
      "author": "Rashid Irani"
    },
    {
      "text": "Patty Jenkins... working from a surprisingly deft script from Allan Heinberg, has gone and given us a Wonder Woman with a lot more than WW's bulletproof forearm bracelets on its sleeve.",
      "author": "Piers Marchant"
    },
    {
      "text": "Engaging, entertaining, empowering superhero adventure.",
      "author": "Sandie Angulo Chen"
    },
    {
      "text": "It means so much, especially in today's world, to watch a woman who is allowed to be naïve, curious, sensitive, and strong save the day.",
      "author": "Jenni Miller"
    },
    {
      "text": "It's disappointing because Wonder Woman deserves better.",
      "author": "Stephen Romei"
    },
    {
      "text": "\"Wonder Woman\" is a thing of hope and beauty; it'll give you a lump in your throat and make you want to cheer.",
      "author": "Jeffrey M. Anderson"
    },
    {
      "text": "It's a great superhero movie by any yardstick. But, more significantly, it's a great Wonder Woman movie, capturing the compassion and optimism that sets her apart from her brooding fellow SuperFriends.",
      "author": "Rob Thomas"
    },
    {
      "text": "Gadot is a gift to a genre that was long past the point of beginning to feel seriously depleted.",
      "author": "Kurt Loder"
    },
    {
      "text": "While it is not the best superhero movie I've ever seen, it's one I wish had been around when I was a young comic book nerd, and one I hope every girl, nerdy or not, gets to see.",
      "author": "Rain Jokinen"
    },
    {
      "text": "Gadot is hugely appealing in the role. She and Jenkins have leaned toward Christopher Reeve's first Superman as a model for how to play the role: strong but innocent, a fish out of water.",
      "author": "Robert Horton"
    },
    {
      "text": "Many big ideas are juggled, and while the story doesn't exactly drop them, it does flail about a bit. Still, Jenkins has an eye for moving moments, Gadot is great fun to watch, and there's genuine visual panache to be found amid the combat and comedy.",
      "author": "Matthew Lickona"
    },
    {
      "text": "This is the first DC Comics movie that mostly has the look, feel and energetic aura of a Marvel film. (Full Content Review for Parents - Violence, Profanity, Sexual Content, etc. - also Available)",
      "author": "Jim Judy"
    },
    {
      "text": "Wonder Woman is a different kind of superhero film.",
      "author": "Sarah Boslaugh"
    },
    {
      "text": "Wonder Woman is a fresh, invigorating entry into the superhero film genre that finally lets a woman take center stage-and the results are excellent.",
      "author": "Roxana Hadadi"
    },
    {
      "text": "Gadot radiates the goodness without sentimentality or wide-eyed winsomeness. Supergirl she ain't. SuperGal she certainly is.",
      "author": "Matthew Norman"
    },
    {
      "text": "The real strengths of this production are its lead actors, the period piece setting, and an unexpected emotional resonance that one doesn't expect from a popcorn movie.",
      "author": "James Berardinelli"
    },
    {
      "text": "When 'Wonder Woman' is good, it is compellingly fun. But when the Amazonian warrior is shown for the 37th time in mid-air, slo-mo battle pose, it is a yawner.",
      "author": "Steve Crum"
    },
    {
      "text": "The most fun I've had at the theater so far this year.",
      "author": "Sonny Bunch"
    },
    {
      "text": "Don't be fooled. \"Wonder Woman\" may look like just another superhero movie --- but it's not. It's a tour-de-force by Gadot, not to be taken lightly.",
      "author": "Jeanne Kaplan"
    },
    {
      "text": "Gadot more than lives up to the challenge, and is as good at delivering her lines as she is handling a magical lariat.",
      "author": "David Kaplan"
    },
    {
      "text": "Enthralling, suspenseful, thrilling and refreshingly witty. A much-needed breath of fresh air. Bravo to Patty Jenkins! Note to Hollywood: please hire more women to direct blockbusters.",
      "author": "Avi Offer"
    },
    {
      "text": "In a movie filled with striking imagery and visual effects, one of the most empowering shots is of Diana emerging out of the trenches, ready to fulfill her destiny and rewrite received Hollywood wisdom on a woman's place in the movies in the process.",
      "author": "Nandini Ramnath"
    },
    {
      "text": "Gadot's contribution to the film cannot be understated. She brings a sense of innocence and conviction to the role that's reminiscent of Christopher Reeve's approach to the Man of Steel in \"Superman: The Movie.\"",
      "author": "Charles Koplinski"
    },
    {
      "text": "Wonder Woman is funny, exciting and fun, but more importantly, it's touching and inspiring. [Full review in Spanish]",
      "author": "Fico Cangiano"
    },
    {
      "text": "Within its clichés and action sequences with inexplicably outdated effects, the film tells a solid story of maturity. [Full review in Spanish]",
      "author": "Orlando Maldonado"
    },
    {
      "text": "I have missed heroism in the big screen like Patty Jenkins and Gal Gadot's Wonder Woman. Pure, without cynicism nor sarcasm, full of goodness, wanting to do the right thing. [Full review in Spanish]",
      "author": "Jorge Rivera Rubio"
    },
    {
      "text": "The only wonder regarding this movie is that it could be so incredibly dull. I keep hoping DC will find a key to unlock the magic inherent in its great cast of characters.",
      "author": "Leonard Maltin"
    },
    {
      "text": "Wonder Woman, director Patty Jenkins' immensely satisfying origin story of the Greek Amazon warrior reared on a mist-shrouded isle, boasts the nonchalant humor and heroics, if not the breakneck pace, of Raiders of the Lost Ark.",
      "author": "Carrie Rickey"
    },
    {
      "text": "Gadot does succeed, against heavy odds, in creating a fresh figure of heroic morality and might, engaging an audience with an earnest character's discovery of herself and the world.",
      "author": "Kate Taylor"
    },
    {
      "text": "Wonder Woman has action, humor and heart, as well as strong performances across the board, especially from Gadot and Pine.",
      "author": "Adam Graham"
    },
    {
      "text": "There is an engaging, old‑school feel to Wonder Woman, a film that has some of the sincerity and charm of the early Christopher Reeve Superman epics.",
      "author": "Allan Hunter"
    },
    {
      "text": "Patty Jenkins proves what a talented director can do with a superhero movie. She and Gadot also contribute touches that only women can.",
      "author": "Christopher Lawrence"
    },
    {
      "text": "An origins story that's earnest yet fun and exciting without being grandiose.",
      "author": "Alistair Harkness"
    },
    {
      "text": "Gadot ... exudes superhero charisma, which powers her through a clichéd last chapter.",
      "author": "Sara Stewart"
    },
    {
      "text": "The balance is tipped toward the positive by the fact that the plot rattles along merrily, taking us from the wilds of Themyscira (Paradise Island for us old-timers) to wartime London, the trenches of Europe and more.",
      "author": "Chris Knight"
    },
    {
      "text": "It's a bird ... it's a plane ... it's a DC movie that doesn't crush your soul.",
      "author": "Christian Toto"
    },
    {
      "text": "Wonder Woman might not be the greatest thing ever, but it is a damn fine film, and full admission: I spent a good chunk of it honest-to-God misty eyed.",
      "author": "Rebecca Pahle"
    },
    {
      "text": "What makes Wonder Woman work so well is the character of Diana herself, who's written and performed with the kind of emotional intelligence that's rare in these kinds of films.",
      "author": "Rochelle Siemienowicz"
    },
    {
      "text": "Suffering Sappho! Patty Jenkins' \"Wonder Woman\" is that rarity: a superhero movie with a heart.",
      "author": "Moira MacDonald"
    },
    {
      "text": "Gal power whips up a roaring adventure.",
      "author": "Roger Tennis"
    },
    {
      "text": "Gadot and Jenkins convey a much-needed sense of excitement and adventure to a group of movies that seemed to be suffocating on their own gravitas.",
      "author": "Bob Bloom"
    },
    {
      "text": "Wonder Woman is a cut above nearly all the superhero movies that have been trotted out over the past few summers.",
      "author": "Stephanie Zacharek"
    },
    {
      "text": "Remember when superhero movies were fun? \"Wonder Woman\" does.",
      "author": "Chris Hewitt"
    },
    {
      "text": "Except for the title, Patty Jenkins's big-hearted blockbuster doesn't use the name Wonder Woman. Wonder Woman is singular. Wonderful women are manifold, and hopefully they'll fill theaters alongside some wonderful men",
      "author": "Amy Nicholson"
    },
    {
      "text": "This is a movie about battling evil that pauses to ask what evil is and whether it's necessary to understand its nature in order to defeat it.",
      "author": "Dana Stevens"
    },
    {
      "text": "The film's strengths far outweigh its flaws, combining moral and emotional authenticity with superhuman stunts and a lively sense of fun: everything you want from a PG-13 superhero movie. It also feels undeniably fresh.",
      "author": "Gavia Baker-Whitelaw"
    },
    {
      "text": "There's so much to like about Patty Jenkins' long-awaited Wonder Woman that I understand those who've gone off the deep end praising it.",
      "author": "Jeff Simon"
    },
    {
      "text": "So when are Jenkins and Gadot teaming up for the next installment? We can't wait.",
      "author": "Stephen Rebello"
    },
    {
      "text": "Filled with the kind of humor and earnestness that [the last couple DC films] were criticized for lacking, Wonder Woman is an absolute joy to watch, thanks in large part to its two leads.",
      "author": "Jason Zingale"
    },
    {
      "text": "Wonder Woman succeeds because it understands the character. Not only that, it lets her shine in an origin story that may hit familiar beats at times, but is driven by great character work, a clever script and two great leading performances.",
      "author": "Ben Skipper"
    },
    {
      "text": "Powerful, empowered and driven by purpose, Wonder Woman is the superhero movie we need right now. It's also a blast of summer-movie entertainment that should charm fangirls and fanboys alike -- along with anyone who likes having a good time.",
      "author": "Michael Smith"
    },
    {
      "text": "In a world of comic-book movies populated with sarcastic, jokey superheroes dropping witty one-liners with every move, Wonder Woman is a blast of fresh air -- an earnestly heroic character bringing goodness and love to a violence-ravaged world.",
      "author": "Sean P. Means"
    },
    {
      "text": "This latest entry into the DC Comics world is only partially successful before eventually succumbing to genre fatigue.",
      "author": "Rob Carnevale"
    },
    {
      "text": "The character of Wonder Woman enters the almost exclusively male domain of DC comics movies... Under this pressure, Jenkins comes through with a work that radiates confidence and sangfroid.",
      "author": "Caryn James"
    },
    {
      "text": "Fuel up the Invisible Jet. You're in for a ride.",
      "author": "Dana Barbuto"
    },
    {
      "text": "We can overlook how the third act yields to the blows-up-good formula of blockbuster franchises. For now, let's just celebrate a superhero movie that runs on estrogen rather than testosterone.",
      "author": "Peter Howell"
    },
    {
      "text": "The real success of the film is that Gadot is perhaps the cinema's best-cast DC-style aspirational superhero since Christopher Reeve's Superman.",
      "author": "Kim Newman"
    },
    {
      "text": "The moviegoing world deserves the best that Hollywood can deliver, and this time we've pretty much got it.",
      "author": "Joe Morgenstern"
    },
    {
      "text": "Unlike Batman v Superman or Suicide Squad, Jenkins' film isn't about the heroes beating the villains - it's about the humanity of its eponymous heroine.",
      "author": "Benjamin Rabinovich"
    },
    {
      "text": "Much credit should go to Godot, who can be alluring, tough, goofy and sweet all in the same take.",
      "author": "Tom Meek"
    },
    {
      "text": "What makes this a must see for fans of superhero movies is the performance of Israeli actress Gal Gadot as Wonder Woman. This is a star-making turn...",
      "author": "Daniel M. Kimmel"
    },
    {
      "text": "Wonder Woman is good. Not great, but good. And really, after Man Of Steel, Batman V Superman: Dawn Of Justice and Suicide Squad, that's all it needs to be.",
      "author": "Norman Wilner"
    },
    {
      "text": "It's so great to see a film pay off in a way that will please both its hardcore fans and a general public that has been clamoring for it for decades.",
      "author": "Kristian Harloff"
    },
    {
      "text": "The best DC film since The Dark Knight.",
      "author": "Mark Ellis"
    },
    {
      "text": "The movie does drag a bit during that midsection after Diana bids farewell to the Amazons, but it's consistently entertaining, buoyed in no small part by [Gadot's] presence, which makes the mythological seem possible.",
      "author": "Brian Lowry"
    },
    {
      "text": "The cinematic universe of DC Comics finally hits all the right notes -- bullets, bronze, and mustard gas included -- in what for any other superhero would be a distinctly Marvel origin story.",
      "author": "Marc Savlov"
    },
    {
      "text": "[A] torpid, overlong DC Comics epic ... puts the first world war on a baking tray for the latest cook-till-crisp superhero flick.",
      "author": "Nigel Andrews"
    },
    {
      "text": "This film makes the character one of the more engaging, empowered, and empowering of the recent crop of super-powered heroes. It's a pretty good movie, too.",
      "author": "Mark Dujsik"
    },
    {
      "text": "Gadot proves she is worthy of Wonder Woman's tiara, but the superhero deserves a great film, not one that's just better than the others.",
      "author": "Jody Mitori"
    },
    {
      "text": "The only grace note in the generally clunky Wonder Woman is its star, the five-foot-ten-inch Israeli actress and model Gal Gadot, who is somehow the perfect blend of superbabe-in-the-woods innocence and mouthiness.",
      "author": "David Edelstein"
    },
    {
      "text": "Hopeful, empowering, and enormously entertaining, Warner Bros. Pictures' Wonder Woman is the feature film this iconic female superhero deserves.",
      "author": "Rebecca Murray"
    },
    {
      "text": "Even in its weaker moments, Wonder Woman honors the scale of a superhero who stands alongside Superman and Batman in the DC lexicon, but has never had a vehicle worthy of her.",
      "author": "Scott Tobias"
    },
    {
      "text": "For roughly half of its nearly two-and-a-half-hour running time, 'Wonder Woman' is a better-than-average superhero movie; a pity it falls off so precipitously in the last act.",
      "author": "Frank Swietek"
    },
    {
      "text": "A Wonder Woman film that is inspiring, hopeful, blistering, and compassionate, in ways that honor what has made this character an icon.",
      "author": "Angelica Jade Bastién"
    },
    {
      "text": "She's fearless, whip-smart and she's just saved the Universe. After three false starts, director Patty Jenkins has delivered the first great film in the DCEU.",
      "author": "Andy Lea"
    },
    {
      "text": "Taken just at face value as a superhero movie, Wonder Woman is one of the best in its class, matching some of the better efforts in a genre that Marvel has dominated for years.",
      "author": "Britton Peele"
    },
    {
      "text": "Never reinvents the superhero origin story, but it hits all the familiar beats with enthusiasm and style.",
      "author": "Josh Bell"
    },
    {
      "text": "Wonder Woman is grandly entertaining, offering up a hero whose sincerity reveals a sense of decency and self-sacrifice our modern world could use to learn a little from.",
      "author": "Sara Michelle Fetters"
    },
    {
      "text": "An enjoyable adventure because of its two strong leads, its effortless tonal shifts and its aversion to narrative traps.",
      "author": "Damien Straker"
    },
    {
      "text": "Wonder Woman is easily one of DC's best movies, but it also belongs in the conversation of best comic book origin movies period.",
      "author": "Jeffrey Lyles"
    },
    {
      "text": "It's a winner! Every bit the Amazonian warrior princess, Gal Gadot leaps onto the screen in a smartly written girls' own superhero adventure with an appealing mix of action, romance, humour and spectacular effects.",
      "author": "Louise Keller"
    },
    {
      "text": "At long last: we can rank a DCEU superhero movie over some of the best the MCU has to offer... and actually mean it. Here's all you need to know: Gal Gadot IS Wonder Woman.",
      "author": "Kevin A. Ranson"
    },
    {
      "text": "She does not disappoint.",
      "author": "Rob Hunter"
    },
    {
      "text": "Wonder Woman is glorious.",
      "author": "Roe McDermott"
    },
    {
      "text": "Unlike lots of comic book movies, it feels like a work of passion and vision. I sense a filmmaker behind it, not a focus group.",
      "author": "Max Weiss"
    },
    {
      "text": "\"Wonder Woman\" has raised the bar. Now let's see if the boys can clear it.",
      "author": "Ann Hornaday"
    },
    {
      "text": "What lingers ... is the feeling of hope that the movie brings, that it someday might be possible for female rationality to defeat male brutality.",
      "author": "Mick LaSalle"
    },
    {
      "text": "Any hopes that Wonder Woman will sustain its appealing misandry are soon dashed.",
      "author": "Melissa Anderson"
    },
    {
      "text": "Your daughters should love it -- and so should your sons.",
      "author": "Ty Burr"
    },
    {
      "text": "The film effortlessly streamlines decades of comic book history that blends the DC Universe and Greek mythology, telling the origin of the mysterious, ageless Wonder Woman who stole the show in Batman v Superman.",
      "author": "Joshua Rivera"
    },
    {
      "text": "Jenkins has succeeded where DC had thus far failed, and in that sense, Wonder Woman should be (and is being) hailed as a triumph.",
      "author": "Richard Lawson"
    },
    {
      "text": "Director Patty Jenkins and her collaborators have taken the well-worn superhero origin story and invested it with a rich, sometimes revelatory depth of feeling.",
      "author": "Justin Chang"
    },
    {
      "text": "The best thing about Wonder Woman, the overlong and intermittently enjoyable new DC superhero spectacular, is Wonder Woman herself.",
      "author": "A.A. Dowd"
    },
    {
      "text": "Every DC Universe movie so far has juggled themes of love versus duty...But Wonder Woman is the first to suggest that love IS duty; if you love at all, you must fight to preserve that in the world.",
      "author": "Luke Y. Thompson"
    },
    {
      "text": "Gal Gadot's performance has the poise and humor that conjures up memories of Christopher Reeve.",
      "author": "Will Leitch"
    },
    {
      "text": "'Wonder Woman' falls victim to over reliance on computer graphics and it's too long. But that's counterbalanced by a story grounded in real emotions and characters who inhabit a three-dimensional world, albeit a comic-book-inspired, fantastical one.",
      "author": "Cary Darling"
    },
    {
      "text": "... the lone DC Comics project this century not directed by Christopher Nolan that delivers on its advance expectations.",
      "author": "Jon Niccum"
    },
    {
      "text": "Not just one of the better origin stories but one of the most hopeful, positive superhero movies we've seen in a while.",
      "author": "Eric D. Snider"
    },
    {
      "text": "Throughout Wonder Woman there is an earnestness in tone that plays well, and rarely as saccharine.",
      "author": "Dan Mecca"
    },
    {
      "text": "This picture tries so hard to avoid making a statement that it becomes the elephant in the room.",
      "author": "John Lui"
    },
    {
      "text": "Director Patty Jenkins displays a deft hand contrasting the gentle beauty of Wonder Woman's paradise island with the horror of the First World War. Her movie is mesmerizing, as she allows the audience to see the world through alien eyes.",
      "author": "Michael Sangiacomo"
    },
    {
      "text": "Wonder Woman gives rising star Gal Gadot the chance to... demonstrate her impressive skill set that includes a nuanced sense of humor, heightened physicality, dramatic gravitas and charismatic self-confidence.",
      "author": "Dann Gire"
    },
    {
      "text": "To say Wonder Woman is a breath of fresh air would be an understatement to this purely joyful and vibrant ride of a story.",
      "author": "Allyson Johnson"
    },
    {
      "text": "Get ready for Gal Gadot to become etched in the pop culture pantheon of strong women who can kick some butt, slay a few stereotypes and own a movie.",
      "author": "Clint O'Connor"
    },
    {
      "text": "[Gadot] seems born to play the part. Her ragtag band of sidekicks are a huge breath of fresh air next to the usual super-hero super-groups we're accustomed to.",
      "author": "Chris Newbould"
    },
    {
      "text": "Wonder Woman is a fun superhero movie that's well worth checking out on the big screen.",
      "author": "Scott Chitwood"
    },
    {
      "text": "The moral of the story, children, is that the world, of superheroes and mere mortals alike, is all the more better when there are more women around.",
      "author": "Shyama Krishna Kumar"
    },
    {
      "text": "The major problem is its marathon duration of 140 minutes, way too long for a blockbuster noticeably bereft of sustained wow-factor spectacle.",
      "author": "Leigh Paatsch"
    },
    {
      "text": "Jenkins and Gadot did their level best to give us, within the confines of an unforgiving superhero universe, the Amazing Amazon that fans deserve.",
      "author": "Joe Gross"
    },
    {
      "text": "Wonder Woman is a strong, at times even rousing, application of the superhero film formula, but it ultimately can't transcend the constraints of the genre.",
      "author": "Keith Watson"
    },
    {
      "text": "Commanding and clear of vision, all the more electrifying because the time is taken to get to know, to understand, and to care about the people onscreen. Imagine that.",
      "author": "Dustin Putman"
    },
    {
      "text": "Jenkins doesn't need to bludgeon us with pyrotechnics. The real fireworks of the \"Wonder Woman\" narrative are its powerful emotions.",
      "author": "Karen D'Souza"
    },
    {
      "text": "Wonder Woman is a top-notch blockbuster, fun and fast and carrying quite a lot of the thematic heft that characterizes the dramatic ambition of the better DC Comics movies as against the more light-hearted Marvel efforts.",
      "author": "Kyle Smith"
    },
    {
      "text": "I blanched slightly at Wonder Woman's almost two-and-a-half-hour running time, but the film raced by -- perhaps because every cliché was subverted by the freshness of a female lead.",
      "author": "Kate Muir"
    },
    {
      "text": "Patty Jenkins and Gal Gadot deliver in Wonder Woman the necessary superhero movie these days. [Full review in Spanish]",
      "author": "Sergio López Aguirre"
    },
    {
      "text": "Wonder Woman is spectacular.",
      "author": "Alan Cerny"
    },
    {
      "text": "A smart, exciting, politically aware origin story.",
      "author": "Daniel Eagan"
    },
    {
      "text": "...an old fashioned super hero movie. There's nothing wrong with that, of course, but I don't think my strongest impression was supposed to be 'Robin Wright really kicks ass.'",
      "author": "Laura Clifford"
    },
    {
      "text": "I have to admit, my heart soared. Wham, bam, thank you ma'am.",
      "author": "Jan Moir"
    },
    {
      "text": "What's best about the film can be summed up in two words: Gal Gadot.",
      "author": "Jake Wilson"
    },
    {
      "text": "It feels less like yet another installment in an endless sequence of apocalyptic merchandising opportunities than like ... what's the word I'm looking for? A movie. A pretty good one, too.",
      "author": "A.O. Scott"
    },
    {
      "text": "Wonder Woman walks a different path. Her arc in the movie isn't discovering she has powers or that those powers demand responsibility. Her arc is showing that humanity, as deeply flawed as it is, is worth saving.",
      "author": "Matt Goldberg"
    },
    {
      "text": "A sturdy origin story, this education of Miss Diana Prince, establishing her as a compassionate badass who consistently proves her bravery, strength, and commitment to justice.",
      "author": "Peter Canavese"
    },
    {
      "text": "Wonder Woman may be a step in the right direction when it comes to getting the DCEU on track, but it still falters in too many places to get itself up to an acceptable level.",
      "author": "Jeff Beck"
    },
    {
      "text": "The first film of the DC Extended Universe that doesn't seem embarrassed by its premise.",
      "author": "Susana Polo"
    },
    {
      "text": "Far from flawless, but 'Wonder Woman' is arguably the best DC comic book film since 'The Dark Knight.' So, bow down to the Princess.",
      "author": "Clay Cane"
    },
    {
      "text": "A rousing adventure yarn, shorn of the usual fanboy mythos.",
      "author": "David Jenkins"
    },
    {
      "text": "Wonder Woman more than shoulders the weight of our expectations, and dazzles us with brilliant kick-ass action and *shocker* heart that her male counterparts couldn't hope to match.",
      "author": "Travis Hopson"
    },
    {
      "text": "Jenkins (and Gadot) particularly excel in the action scenes, because when Wonder Woman first runs across the battlefields in her costume, you are immediately won over.",
      "author": "Edward Douglas"
    },
    {
      "text": "The film's two major strengths come down to the two most important ingredients - cast and story.",
      "author": "Matthew Toomey"
    },
    {
      "text": "It's much, much better and more thoughtful than [other superhero films]; its depiction of heroism and humanity, more complex. Most importantly, it's a great time at the movies. More like this, please.",
      "author": "Simon Miraudo"
    },
    {
      "text": "There are some moments of bold storytelling, and the focus on humanity, morality and love is an unusual and welcome theme in a superhero movie. (But don't worry, it's not all moralising - Diana still punches a lot of people.)",
      "author": "Abigail Chandler"
    },
    {
      "text": "Wonder Woman is a game changer because it is not only the best film of the DCEU but one of the best superhero films ever made.",
      "author": "Scott Menzel"
    },
    {
      "text": "Witnessing such feminine power is mind-boggling and awe-inspiring, but wistful, too. It's a shame that such instances are so rare to be exceptional.",
      "author": "Katie Walsh"
    },
    {
      "text": "With its nods to Richard Donner's Superman and Chris Evans' first outing as Captain America, Wonder Woman also exceeds expectations as an origin story with its First World War setting.",
      "author": "Mark Daniell"
    },
    {
      "text": "For all of Wonder Woman's nifty weapons, the one that proves most indispensable is her chemistry with Chris Pine's ultra-charismatic American spy Steve Trevor.",
      "author": "Mara Reinstein"
    },
    {
      "text": "Patty Jenkins' Wonder Woman is so super, you could almost forget how important it is. But I hope you don't.",
      "author": "Joanna Langfield"
    },
    {
      "text": "Wonder Woman has turned out better than the cynics expected, and has plenty of what fans were hoping for.",
      "author": "Harry Guerin"
    },
    {
      "text": "Her sincerity and compassion are her greatest super powers of all.",
      "author": "Fred Topel"
    },
    {
      "text": "It's an interesting take both on Wonder Woman and the genre in general, but as so many films like this do, it can't escape the siren pull of Big Dumb Action, with a CGI-laden climax that could be from any movie, so generic is the battle.",
      "author": "Bill Goodykoontz"
    },
    {
      "text": "When Diana DOES spring into action, Wonder Woman rocks. It's as if we're learning exactly what she's capable of at the same time Diana is discovering the depths of her powers.",
      "author": "Richard Roeper"
    },
    {
      "text": "Gal Gadot's Wonder Woman was the best thing about the swampy Batman v Superman, and now her solo outing is the far superior film: Wonder Woman, directed by Patty Jenkins, elevates her from third wheel to real deal.",
      "author": "Tom Gliatto"
    },
    {
      "text": "Gal Gadot is unstoppable and spectacular to see in motion. Watch her fly.",
      "author": "Peter Travers"
    },
    {
      "text": "Gadot plays Diana in appealing fashion. For all her strength and prowess, she is an innocent, even comic figure, who simply can't understand the cynicism, politicking, and violence of the humans she encounters.",
      "author": "Geoffrey Macnab"
    },
    {
      "text": "Director Patty Jenkins's fight scenes are masterpieces of motion. Gal Gadot is majestic. Chris Pine is impossibly charming. And Jenkins has created a film that rightfully does justice to its legendary title character.",
      "author": "Alex Abad-Santos"
    },
    {
      "text": "This is a moment 75 years in the making where the hopes and dreams of millions of little girls and adult women finally crystallize into one transcendent image that is proud, defiant, and a long time coming.",
      "author": "Don Kaye"
    },
    {
      "text": "Wonder Woman is a decent but bland addition to the genre that truly shines only in comparison to the rotten DCEU movies so far.",
      "author": "Rosie Fletcher"
    },
    {
      "text": "A rollicking action adventure in the tradition of 'Indiana Jones', with a fully functioning sense of humour and the year's most lip-smackingly evil baddie.",
      "author": "Cath Clarke"
    },
    {
      "text": "Welcome relief from the predictable skyscraper-levelling of the contemporary superhero adventure.",
      "author": "Donald Clarke"
    },
    {
      "text": "Wonder Woman is a winner, an immersive origin story with unexpected humor and epic action scenes. Gal Gadot proves she has the right stuff, every bit the feminist icon and hero fans deserve.",
      "author": "Julian Roman"
    },
    {
      "text": "Entertaining and empowering, it's the best in DC's Extended Universe. Physically perfect, Gal Gadot is strong & sexy, statuesque & stunning.",
      "author": "Susan Granger"
    },
    {
      "text": "[A]n electrifying, breathtaking cinematic achievement... Amazing performances, pulse-pounding action, and outstanding visuals make it one of the best superhero movies of all time.",
      "author": "Mark Hughes"
    },
    {
      "text": "The DCEU's game gets raised. Gadot is a godsend, Pine charms, and Jenkins delivers old-school thrills with heart and conviction.",
      "author": "Kevin Harley"
    },
    {
      "text": "You won't be disappointed in the slightest.",
      "author": "Jamie East"
    },
    {
      "text": "When it does get down to superheroine business, this latest DC Comics 'extended universe' outing packs a decent punch and, in Israeli model Gal Gadot, introduces a star with real franchise potential.",
      "author": "John Hazelton"
    },
    {
      "text": "Despite lulls in the overall narrative energy, there are real stakes and sacrifice, along with genuine heart and humor in this welcomely uncluttered tale.",
      "author": "Garth Franklin"
    },
    {
      "text": "Gadot turns out to be as perfect a fit for the iconic character as Christopher Reeve was for the Man of Steel.",
      "author": "Matthew Turner"
    },
    {
      "text": "It has a considerable amount of humor, which may not cause you to laugh out loud but sometimes triggers a smile. If it's possible to describe a superhero film as likeable, this is that film.",
      "author": "Uri Klein"
    },
    {
      "text": "Wonder Woman ends with a sequel on the horizon, that will certainly get made if the movie inspires little girls to ditch their Disney Princess regalia and learn to scare off creeps with the raise of an eyebrow, the Gal Gadot way.",
      "author": "Hannah Brown"
    },
    {
      "text": "Gadot turns in a terrific display as the titular protagonist, carrying an infectious sense of optimism and wide-eyed wonderment, while ensuring it never once cheapens her sheer power and ability to fight.",
      "author": "Stefan Pape"
    },
    {
      "text": "Gal Gadot has an adventure all her own - and all kinds of awesome - in Wonder Woman, a superheroine film brimming with majesty, action and heart.",
      "author": "Kristy Puchko"
    },
    {
      "text": "Gadot was mostly one-dimensional and stoic in her 20 minutes of screen time in Batman v Superman, but here she is lively and exudes a sense of wonder.",
      "author": "Ben Sin"
    },
    {
      "text": "The hero faces off against a seemingly insurmountable bad-guy-from-Central-Casting, throwing around what appears to be a range of fluorescent Photoshop-generated squiggly lines.",
      "author": "Luke Buckmaster"
    },
    {
      "text": "What's striking about [Wonder Woman] is the movie's sense of elated lightness.",
      "author": "Alison Willmore"
    },
    {
      "text": "A dynamic and original film we're so thrilled for you girls and boys to see.",
      "author": "Alicia Lutes"
    },
    {
      "text": "If Gal Gadot's all-too-brief appearance in Batman v Superman was promising, she fulfills that potential and then some in Wonder Woman.",
      "author": "Angie Han"
    },
    {
      "text": "Gal Gadot's Diana is her best performance to date, blending the kindness, power, and innocence needed for the iconic character.",
      "author": "Germain Lussier"
    },
    {
      "text": "Wonder Woman is a beautifully directed superhero movie origin that digs into Diana's transformation from naive warrior to inspiring hero.",
      "author": "Molly Freeman"
    },
    {
      "text": "Praise be, does Wonder Woman ever kick ass.",
      "author": "Allison Shoemaker"
    },
    {
      "text": "Dawn Of Justice proved [Gadot] could handle the kicking and the punching. Here, she gets actual honest-to-goodness dialogue, and invests Diana with excitable exuberance , bristling defiance and a disarming belief in doing the right thing.",
      "author": "Chris Hewitt (UK)"
    },
    {
      "text": "Strong, smart, sexy and downright super, this is the superhero blockbuster of the summer you need to see.",
      "author": "Chris Hunneysett"
    },
    {
      "text": "As witty and heartfelt as it is thrilling - a film that fangirls, fanboys and even those suffering from superhero fatigue can enjoy.",
      "author": "Emma Simmonds"
    },
    {
      "text": "Where Wonder Woman excels is in the pure joy and spectacle of its roaring action sequences, which are conservatively deployed to maintain their power.",
      "author": "Wenlei Ma"
    },
    {
      "text": "It is the sincerity and strength that radiate from Gadot that completely win you over in a solid, however implausible, script. Justice League? Bring it on.",
      "author": "Angie Errigo"
    },
    {
      "text": "What Patty Jenkins is able to do with all of that is ground it in emotion and character, to make audiences smile and walk out of the theater feeling uplifted rather than exhausted. It's the movie we've been waiting for. Trust me.",
      "author": "Dave Schilling"
    },
    {
      "text": "It's a film that not only improves upon many of the seemingly built-in shortcomings of superhero movies, but also mixes smarts, sentiment and adrenaline in the best Hollywood style.",
      "author": "Alonso Duralde"
    },
    {
      "text": "In a genre where fanboy entitlement regularly calls the tune, Wonder Woman's feminism feels like a rarity. Time will tell whether Hollywood [will be] in the thrall of a heroine addiction. But as the credits rolled, I was already craving another hit.",
      "author": "Robbie Collin"
    },
    {
      "text": "Wonder Woman is leaps and bounds above the other three entries in the DCEU.",
      "author": "Joshua Yehl"
    },
    {
      "text": "Like the heroine at its center, Wonder Woman the movie rises with powerful grace above the noise. It's not perfect, but it's often good, sometimes great and exceptionally re-watchable.",
      "author": "Lindsey Bahr"
    },
    {
      "text": "The film's action is explosive and engaging, and a sequence where Diana ventures into no man's land in the middle of a trench battle is stunning to behold.",
      "author": "Kelly Lawler"
    },
    {
      "text": "Wonder Woman is smart, slick, and satisfying in all of the ways superhero films ought to be.",
      "author": "Chris Nashawaty"
    },
    {
      "text": "Gadot is entirely credible as the embodiment of Amazonian perfection, but there's only so much emotion her concerted brow-furrowing can convey.",
      "author": "Steve Rose"
    },
    {
      "text": "[Wonder Woman] isn't just a triumph for women, it's a triumph, period. This is grand entertainment with rousing action, sparkling humor, a romantic streak and a titanium-strength debut from Gal Gadot in the title role.",
      "author": "Rafer Guzman"
    },
    {
      "text": "Patty Jenkins' Wonder Woman provides a welcome respite from DC's house style of grim darkness with star Gal Gadot proving an inspired choice for this avatar of truth, justice and the Amazonian way.",
      "author": "Andrew Barker"
    },
    {
      "text": "Jenkins' feature flips back through time to deliver an origin story that functions beautifully on its own while also bolstering excitement for the franchise's future.",
      "author": "Kate Erbland"
    },
    {
      "text": "It's a lot closer to 'Batman Begins' than 'Green Lantern'.",
      "author": "Scott Mendelson"
    },
    {
      "text": "WONDER WOMAN brings a powerful voice to the summer blockbuster; one filled with hope, inspiration and more than enough thrills to satisfy everyone.",
      "author": "JimmyO"
    },
    {
      "text": "This origin story, with its direct and relatively uncluttered trajectory, offers a welcome change of pace from a superhero realm that's often overloaded with interconnections and cross-references.",
      "author": "Sheri Linden"
    },
    {
      "text": "Along with the first \"Iron Man,\" it's the film you point to when you want to prove that this overly prolific genre is worth keeping around.",
      "author": "Matt Prigge"
    },
    {
      "text": "A bright, exciting film that manages to meld the more epic \"gods among us\" DC-style with moments of levity and pathos.",
      "author": "Anthony O'Connor"
    },
    {
      "text": "Seeing the Amazons training with beautiful ferocity, seeing women so powerful and skilled...was a revelation.",
      "author": "Jenna Busch"
    },
    {
      "text": "Gal Gadot grabs the Lasso of Truth and the bracelets of infinite resilience to take center stage in Wonder Woman, director Patty Jenkins' formidable and almost entirely successful bid to make the DC Comics movies a little less lame.",
      "author": "Michael Phillips"
    },
    {
      "text": "Wonder Woman is coming out at a good time. This is the movie a lot of us need right now and Wonder Woman is the hero we all kind of need right now.",
      "author": "Mike Ryan"
    },
    {
      "text": "One of the best superhero movies. Ever.",
      "author": "William Bibbiani"
    },
    {
      "text": "Wonder Woman offers a full cinematic experience from beginning-to-end, which helps it stand out from other films of its kind that worry more about what's to come than the story at hand.",
      "author": "Matt Donato"
    },
    {
      "text": "Exciting, romantic, and funny.",
      "author": "Matt Singer"
    },
    {
      "text": "Molded by the mighty Gods, but as shaped by mere mortals Wonder Woman's mettle and beliefs can only be so wonderfully divine.",
      "author": "Rodrigo Perez"
    },
    {
      "text": "Diana Prince's solo film easily stands out as the best DC film since 'The Dark Knight', and 'Wonder Woman' is a sign of great things to come in the DC Extended Universe.",
      "author": "Conner Schwerdtfeger"
    },
    {
      "text": "Gadot's portrayal of Wonder Woman is full of joy and completely without angst or cynicism. It's a breath of fresh air and a total blast from start to finish.",
      "author": "Chris Stuckmann"
    }
  ],
  "release_year": 2017,
  "duration": 141,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy"
  ],
  "synopsis": "Before she was Wonder Woman (Gal Gadot), she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, Diana meets an American pilot (Chris Pine) who tells her about the massive conflict that's raging in the outside world. Convinced that she can stop the threat, Diana leaves her home for the first time. Fighting alongside men in a war to end all wars, she finally discovers her full powers and true destiny.",
  "popularity": 8.3,
  "poster_url": "https://image.tmdb.org/t/p/original/v4ncgZjG2Zu8ZW5al1vIZTsSjqX.jpg"
}