{
  "movie_name": "After We Collided",
  "movie_id": "after_we_collided",
  "total_reviews": 16,
  "reviews": [
    {
      "text": "It doesn't work as a romantic drama, it is just bad."
    },
    {
      "text": "After We Collided has very little to work with, and it shows."
    },
    {
      "text": "Fifty Shades Light but if you're a fan of the books I'm sure you're going to love it"
    },
    {
      "text": "A series of half-digested movie tropes regurgitated by Google Rom-dram."
    },
    {
      "text": "Only meant for its young targeted audience that has the stomach for such tripe."
    },
    {
      "text": "Director Roger Kumble brings this second installment of Anna Todd's series to life in a way fans of the books have been dreaming about for years."
    },
    {
      "text": "Sequel has sex, partying, language, addiction, and fighting."
    },
    {
      "text": "After We Collided is riddled with cliches and tired young adult tropes, but its dramatic romance and laughable dialogue offers some escapist fun."
    },
    {
      "text": "After We Collided doesn't earn a place in the so-bad-it's-good category it aspires to."
    },
    {
      "text": "American \"Afternators\" will no doubt be similarly pleased with this slightly campier continuation of the series. For everyone else, however, there's not enough innovation to make the second installment a worthwhile jumping-on point."
    },
    {
      "text": "Too moronic to work as a serious romantic drama and too boring to work as straightforward sleaze."
    },
    {
      "text": "Full of tired cliches and formulaic story. [Full Review in Spanish]"
    },
    {
      "text": "\"After\" was merely awful. \"After We Collided\" is atrocious."
    },
    {
      "text": "Admittedly, the result is a superior movie.... However, After We Collided is still plagued by terribly telegraphed twists, dreadful dialogue and the overuse of pop-songs to convey emotion."
    },
    {
      "text": "This is not a good movie in any sense of the word"
    },
    {
      "text": "As dull and lifeless as its predecessor."
    }
  ],
  "release_year": 2020,
  "duration": 107,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "A college student's relationship with a troubled youth gets put to the test when she meets another man who's attracted to her.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/kiX7UYfOpYrMFSAGbI6j1pFkLzQ.jpg"
}