{
  "movie_name": "Airplane!",
  "movie_id": "airplane",
  "total_reviews": 57,
  "reviews": [
    {
      "text": "You don't even need to have seen the comedies its parading. The jokes are just good"
    },
    {
      "text": "What’s most extraordinary, looking back, is that the vast majority of them are really good jokes -- not always clever, not always tasteful, but for the most part really damn funny."
    },
    {
      "text": "It is very funny in a very silly kind of way and that people who intend to see it should do so as soon as possible. For this is a movie whose charm comes totally from the unexpected, off-the-wall nature of its jokes."
    },
    {
      "text": "Part of what makes this all so effective is how straight the actors play their parts; in the face of unending fatuousness, the cast remains earnestly aboveboard."
    },
    {
      "text": "It reminds us of the importance of pushing boundaries at the same time that it gives us a playbook for doing so in a good-natured rather than vicious or belittling way."
    },
    {
      "text": "The cast is nearly perfect."
    },
    {
      "text": "With its endless succession of movie parodies, puns and non sequiturs, it's the closest that cinema has ever seen to a live-action interpretation of Mad magazine."
    },
    {
      "text": "Hays and Hagerty had great chemistry that made their story believable."
    },
    {
      "text": "The visual and cultural gags are limitless, and remain mostly relevant and chuckle-worthy across time."
    },
    {
      "text": "Airplane! (1980) was a trend-setting, zany, hilarious comedy - using as its core material the airplane disaster film as the spoof's stepping stone, borrowing from the subplots of heavy-handed films in the 1970s decade."
    },
    {
      "text": "Verbal jokes, novel images, and political allusions all take place, including flashbacks that give way to an amazing spoof of Travolta. [Full Review in Spanish]"
    },
    {
      "text": "One of the reasons why Airplane! works as well as it does is because of those actors who play their lines with a deadpan performance."
    },
    {
      "text": "The popcorn will probably stick with you longer than this silly saga but, if you need a few belly laughs, get a boarding pass. Airplane is the ultimate take-off."
    },
    {
      "text": "The level of humor is not always consistent, but the filmmakers have thrown almost everything in with a shotgun approach and the routines work more often than not."
    },
    {
      "text": "The really great thing about Airplane! is that the jokes undercut your expectations so deftly."
    },
    {
      "text": "Airplane! is a splendidly tacky, totally tasteless, completely insignificant flight, a gooney bird of a movie that looks as if it could never get off the ground and then surprises and delights with its free-spirited aerobatics."
    },
    {
      "text": "Jim Abrahams, David Zucker and Jerry Zucker, who share both writing and directorial credits, become so desperate for laughs that the jokes descend to a much cruder level."
    },
    {
      "text": "[VIDEO ESSAY] The film's mixed bag of cultural references spill out faster than you can catch them."
    },
    {
      "text": "From takeoff to landing, this whacked-out parody is a loopy flight of fancy."
    },
    {
      "text": "There's hardly a second that passes without an assault by a wickedly accurate spoof, cringe-inducing pun or inspired sight gag, and the years have not diminished the film's dumb appeal."
    },
    {
      "text": "Directors Abraham and both Zuckers create one of the few comedies that can guarantee almost a laugh a minute..."
    },
    {
      "text": "Charmingly dated, but still immeasurably funny."
    },
    {
      "text": "Rapid-fire spoof with sexual jokes and cartoon violence."
    },
    {
      "text": "A hyper spoof of disaster films."
    },
    {
      "text": "Entering imto Mel Brooks' turf, the first lampoon of the disaster-in-the-air subgenre (such as the prepoterously Oscar nominated Airport) is silly but funny, with many good sight gags, campy one-liners and slapstick comedy."
    },
    {
      "text": "Most of the jokes are groan-worthy, and some are downright racist."
    },
    {
      "text": "Is it the best comedy ever made? I don't know, but it surely is the funniest. I stand by that. And don't call me Shirley."
    },
    {
      "text": "Surely as good as modern comedy gets?...and don't call me Shirley."
    },
    {
      "text": "Surely, this is essential. Maybe, but don't call me Shirley, etc."
    },
    {
      "text": "Although the gags aren't entirely consistent, it's inspired stuff. And whatever you do don't switch off during the closing credits."
    },
    {
      "text": "The gags aren't exactly clever, but there are a lot of them, and the cutting finds a fast, effective tempo."
    },
    {
      "text": "The fact that the movie doesn't work as well today as it did in 1980 in no way diminishes its importance in recent motion picture history."
    },
    {
      "text": "From the clever Jaws take-off opening to the final, irreverent title card, laughs come thick and fast."
    },
    {
      "text": "Brilliant, still funny airplane disaster movie parody. Started new comedy career for Nielsen."
    },
    {
      "text": "Still the funniest and most inspired of the madcap genre spoofs. For every dumb or tasteless joke that doesn't fly, a dozen land directly at Laugh Central."
    },
    {
      "text": "Some of the humor has become very politically incorrect 25-plus years later. And God love it for that."
    },
    {
      "text": "Psycho ground controllers (Stack and Bridges), laff-a-second pace, and bludgeoning innuendo make this the acceptable face of the locker-room satire."
    },
    {
      "text": "The definition of 'deadpan' starts and ends with Jim Abrahams, David Zucker and Jerry Zucker's Airplane!."
    },
    {
      "text": "Unprecedented nonsense that--fashions aside--will remain timeless comedy cinema. [new DVD review]"
    },
    {
      "text": "It is sophomoric, obvious, predictable, corny, and quite often very funny. And the reason it's funny is frequently because it's sophomoric, predictable, corny, etc."
    },
    {
      "text": "Sustains a single premise for its entire running time, and does so without lagging or going limp."
    },
    {
      "text": "It may run 90 minutes, but it takes me 120 minutes to watch it after rewinding through the jokes I missed because I was laughing too hard at the joke prior to it."
    },
    {
      "text": "If Airplane! isn't the funniest English-language movie ever made, it could at least get into some spirited comedy fisticuffs"
    },
    {
      "text": "(No quote available.)"
    },
    {
      "text": "Over two decades later, it's still funny."
    },
    {
      "text": "Airplane! is more than a pleasant surprise, in the midst of this dim movie season. As a remedy for the bloated self-importance of too many other current efforts, it's just what the doctor ordered."
    },
    {
      "text": "The spoof that launched a thousand parodies -- this is the one that's 100% funny."
    },
    {
      "text": "More laughs per minute than just about anything I can think of."
    },
    {
      "text": "Disaster parody at its finest, 'Airplane!' is a hilarious comic treat."
    },
    {
      "text": "If you get half of the jokes flung your way, and laugh at half of those you're still in much better shape than the very best episode of Three's Company."
    },
    {
      "text": "A comedy classic!"
    },
    {
      "text": "...a straight-forward premise that’s employed as a springboard for an erratic yet frequently hilarious satire of disaster movies..."
    },
    {
      "text": "The finest moment in spoof"
    },
    {
      "text": "One of the finest American comedies ever made. Ever!"
    },
    {
      "text": "It's now a familiar formula, but Airplane still retains an edge because the audience is credited with intelligence."
    },
    {
      "text": "a nonstop assault of sight gags, silly verbal puns, and pop culture references"
    },
    {
      "text": "...a nonstop flurry of slapstick sight gags, puns, innuendoes, exaggerations, and caricatures. A comedy classic."
    }
  ],
  "release_year": 1980,
  "duration": 88,
  "genres": [
    "Comedy"
  ],
  "age_rating": "PG",
  "synopsis": "This spoof comedy takes shots at the slew of disaster movies that were released in the 70s. When the passengers and crew of a jet are incapacitated due to food poisoning, a rogue pilot with a drinking problem must cooperate with his ex-girlfriend turned stewardess to bring the plane to a safe landing.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/7Q3efxd3AF1vQjlSxnlerSA7RzN.jpg"
}