{
  "movie_name": "Alien",
  "movie_id": "alien_romulus",
  "total_reviews": 397,
  "reviews": [
    {
      "text": "Seven films into this franchise, Alien: Romulus manages to be both terrifying and comforting; the audience revisiting their haunted childhood home, relieved to be tucked up in their old bed even if it does levitate."
    },
    {
      "text": "We care so much about [Spaeny and Jonsson] that we almost forget the obvious threads to this film’s predecessors that won’t stop popping up. Stop strangling good ideas to expand your IP with the constraints of needless IP familiarity."
    },
    {
      "text": "Spaeny as Rain and [David] Jonsson as Andy are the two clear standouts in this movie... the two are given the most fleshed-out characters, and they have great chemistry together as Andy changes during the movie."
    },
    {
      "text": "Fede Alvarez revives the franchise in this taut, moody, and terrifying thriller with standout work from Cailee Spaeney and David Jonsson. Alvarez evokes the best (and most insane) parts of the Alien movies while carving out his own corner of the universe."
    },
    {
      "text": "[S]ucceeds in striking a balance among fulfilling expectations, adding details to its miserable futurescape, landing solid shocks, doing fan service ... and delivering at least a couple of images we haven’t seen before."
    },
    {
      "text": "What is new under this shrouded sun is a xenomorph variant that violently emerges in the third act and is as gloriously gnarly as any other creature birthed by the franchise."
    },
    {
      "text": "Alien: Romulus is something of a greatest hits mixtape of a movie, taking some great set-pieces, visual iconography and character tropes from the original four movies and meshing them together in a very enjoyable, if not predictable, two-ish hours."
    },
    {
      "text": "Alien: Romulus represents a bold new chapter in the franchise, introducing fresh characters and innovative creature designs."
    },
    {
      "text": "As a whole the film is both irritating and frustrating: irritating because it keeps making bad creative choices, and frustrating because one solid rewrite could have easily fixed every problem that derails it."
    },
    {
      "text": "A seventh installment that lands straight in the top 3 of the prolific cinematic IP, though it can't avoid making certain concessions that will likely alienate the most purist fans."
    },
    {
      "text": "Totally committed to jump scares, this latest outing for the franchise is a far better film than the recent prequels."
    },
    {
      "text": "As blockbuster franchises go, Romulus isn’t a bad film. But it suffers from the perennial blockbuster problem, which is that it doesn’t believe in its own world or its own themes."
    },
    {
      "text": "The plot may be one “Alien” cliche after another, but the physical production is solid."
    },
    {
      "text": "You get exactly what you expect here, which is good in a way but also a shame in a way because it doesn't break any new ground save for one new gruesome alien. If you go in expecting a fairly decent bloody new Alien flick, that's what you'll get."
    },
    {
      "text": "If Alvarez has leaned more into the horror of what takes place in the movie's final 20 minutes instead of fan servicing us, maybe we would've come away with a more original vision. As it is, Romulus is mostly pastiche, albeit a beautifully rendered one."
    },
    {
      "text": "A strong, sick and scary entry in this 45-year-old franchise."
    },
    {
      "text": "This is a film that takes some time out for wonder and awe."
    },
    {
      "text": "In short, this is a sequel that falls prey to its own ambitions. [Full review in Spanish]"
    },
    {
      "text": "There are interesting ideas here, but we're beating a dead horse to a degree here."
    },
    {
      "text": "Alvarez isn’t just keeping a wheezy franchise alive, but giving us a reason to feel invested in its ongoing life."
    },
    {
      "text": "Ridley Scott tried to give us original visions in the 2010s, and those were rejected, so we’re going to get some of this instead. You know what? That’s fine."
    },
    {
      "text": "Surprisingly great! Though less distinct then its predecessors, it boasts some franchise HOF moments along with solid performances, a cloying atmosphere, and the return of the xenomorphs in their nasty glory"
    },
    {
      "text": "All the big moves have been so dutifully rehearsed in previous films that it’s no longer shocking to find a creepy little monster plastered on someone’s face or bursting from a human chest."
    },
    {
      "text": "After the pompous stodge of Prometheus and Alien Covenant, Alien Romulus is at least exciting, atmospheric, inventive and committed to making audiences jump or gasp."
    },
    {
      "text": "Alvarez is clearly a fan of the franchise (and includes a couple Easter eggs in the dialogue to prove it), and he makes “Alien: Romulus” a thrilling addition to it."
    },
    {
      "text": "Alien: Romulus shows that you can resort to nostalgia without parasitizing from what was previously rendered to the point of forgetting to tell something new. [Full review in Spanish]"
    },
    {
      "text": "Alien: Romulus is about as good as Alien movies are going to be at this point. And take that as the very backhanded compliment it sounds like."
    },
    {
      "text": "Alien: Romulus is a solid entry for the Alien franchise. Not coming for the top spot of most fan rankings, but also not deserving of last place as Alvarez’s entry handles its place on the timeline well."
    },
    {
      "text": "It's not perfect, to be sure, but unlike a majority of the films after Aliens, it's one made with more dedication behind it, and with a clear passion for the series itself. It's a ride worth taking."
    },
    {
      "text": "Even with all the effort put into the filmmaking and performances, the lack of surprise holds back what could've been a potentially outstanding Alien film, and restricts it to merely okay territory."
    },
    {
      "text": "There’s nothing like an Alien film with practical effects. But the film feels like a checklist of cliché Alien and Prometheus moments, which is incredibly disheartening."
    },
    {
      "text": "Alien Romulus is a strong return to the franchise, with homages to the 1979 original and a punchy third act.\n\nStrong performances all around and a good entry point for new fans to the series."
    },
    {
      "text": "...my low expectations were met and in some places exceeded..."
    },
    {
      "text": "I thought this was awesome... Yes, it plays the hits, but in a slightly different key. It's different enough for me to have had fun."
    },
    {
      "text": "A beautiful, terrifying parasite that can only survive by cannibalizing the very thing that it's trying to keep alive -- which is this franchise."
    },
    {
      "text": "The simplicity shines, the thrills are present throughout, and there are a few scares that hit hard. It does a nice job of mixing the familiar formula with some fresh ideas and maintains the perfect atmosphere."
    },
    {
      "text": "Every possible ingredient has surely been used, every angle exhausted. Major props, then, to Fede Álvarez for cooking up something fresh in this furiously exciting, gnarly seventh entry. He’s even found the eggs, too."
    },
    {
      "text": "Alien: Romulus is the Xenomorph roller coaster from your worst nightmare that Disney World would never construct at one of its theme parks."
    },
    {
      "text": "Fede Álvarez further cements himself as one of horror’s hottest directors; when your filmography includes 2013’s Evil Dead, 2016’s Don’t Breathe, and now Alien: Romulus, there’s a pretty strong case to be made that a blank cheque project is well-earnt."
    },
    {
      "text": "An impressive technical spectacle that highlights Fede Álvarez's talent in creating an atmosphere of tension and horror, raising the audiovisual standard of the saga to new heights through immersive sound design and Galo Olivares' stunning cinematography."
    },
    {
      "text": "Romulus brings what many fans have been craving for decades, a return to the approach of the original two films. It has some of the most intense horror of the franchise while using the elements of space in some new ways. I want more!"
    },
    {
      "text": "The result is a tense, engaging spectacle that should satisfy both existing fans and newcomers to the world."
    },
    {
      "text": "Alien: Romulus never reaches the potential of Ridley Scott’s original or James Cameron’s sequel, but it’s terrifically executed and, just the same, viscerally monstrous."
    },
    {
      "text": "Romulus is familiar, slimy, and bloody entertainment for fans of the series. Its plot is unchallenging and lacks the thematic ambition of Scott’s prequels Prometheus (2012) and Alien: Covenant (2017)."
    },
    {
      "text": "One engrossing new character and some strong production design cannot justify a comparatively limp rehash that serves mostly to remind you of other 'Alien' movies."
    },
    {
      "text": "Not everyone will love the climax but I applaud Alvarez’s bravery to try new things and we are left with both a definitive ending and the potential for more. And if Alvarez is behind the controls I am all for it."
    },
    {
      "text": "Alien Romulus succeeds thanks to Fede Alvarez’s thoughtful approach at reminding the audience why the first film worked so well. It has all the staples of the Alien franchise."
    },
    {
      "text": "It may not be particularly nostalgic, but the lack of vision and forward thinking leaves it spinning its wheels in the past."
    },
    {
      "text": "Alien: Romulus, the latest film in the iconic franchise, is a nightmarish, formulaic, but ultimately entertaining trip through space."
    },
    {
      "text": "While dark and gritty, with callbacks to the best of the Alien franchise, Alien: Romulus doesn’t bring anything new to the table. Running, screaming, and shooting comprise the bulk of its two-hour runtime, and it’s still all been done before."
    },
    {
      "text": "With its grimy, slimy industrial space chic, Alien: Romulus definitely looks the part. It’s decently directed and ratchets up some nerve-jangling suspense before chaos rains down on the unfortunate crew."
    },
    {
      "text": "After a couple of science fictiony entries full of big ideas, the Alien franchise returns to pure horror with this ruthlessly gripping, brutally intense, refreshingly simple movie."
    },
    {
      "text": "You have to wonder if simply going back to formula is enough. Being derivative isn't the problem - all art, all creation is derivative of something - the problem is when being derivative is your primary directive."
    },
    {
      "text": "Romulus is the Alien film you've been waiting for. It's like Covenant, but shorn of the fat, and replacing the mythologising and philosophising with entertaining world-building and genuine terror."
    },
    {
      "text": "You can see the gears turning in every scene, and feel the film dutifully avoiding, well, alienation, the unknown, the discomfiting."
    },
    {
      "text": "Dark and brooding, “Alien: Romulus” rewards fans with those Easter eggs from the past. It isn’t essential that you make the connection, but if you do, you’re two popcorn buckets ahead of others."
    },
    {
      "text": "The result feels like a recap of the franchise by an excited fanboy, bereft of the nuance and spectacle that made it memorable... It’s a patchwork of better films. But that’s all it is."
    },
    {
      "text": "Constantly impresses with its prodigious use of cinematic language, its striking soundtrack, its overwhelming sound work, [and] its meticulous production design. [Full review in Spanish]"
    },
    {
      "text": "While the film is an undeniably fun roller-coaster ride, it is disappointing that this franchise has reverted to something so basic and cliched. There is not a single part of this film that feels fresh or inventive for the franchise it belongs to."
    },
    {
      "text": "The film starts slow and rockets into chaotic. The sound mixing isn’t great and I didn’t find the characters memorable, but it makes up for that with the most grotesque scenes and creature design. [...] I get why its rated R."
    },
    {
      "text": "Alien: Romulus is a slick and playful entry into the long-running franchise that deals in homage and, strangely enough, feels ripped from the 2000s - the decade that never saw a standalone Alien film."
    },
    {
      "text": "What ruins the film dramatically is its reliance on nostalgia, particularly the distracting and disheartening use of a legacy character."
    },
    {
      "text": "The best Alien since Aliens."
    },
    {
      "text": "This is a safe, fan-service-y entry that doesn't go as hard as expected, though the Rook character and the climax aren't deal breakers. Alvarez is too reverential to Cameron and Scott, but The Newborn is pretty cool."
    },
    {
      "text": "Demonstrate that the 45 year-old franchise still has plenty of life left in it when given to the right director."
    },
    {
      "text": "At the end of the day, Alien: Romulus feels too long and does not get any particularly innovative ideas out of the pregnancy theme that has been used often in the series. [Full review in Spanish]"
    },
    {
      "text": "The genuinely disturbing practical effects and the star-making performance from Jonsson are so awesome that it’s easy to look past the film’s faults."
    },
    {
      "text": "Fede Álvarez delivers an effective horror film, although... he doesn't take risks or take the saga into new territories. [Full review in Spanish]"
    },
    {
      "text": "Plays things a bit safe, given the big swings the franchise has taken in entries past, but Romulus delivers a back-to-the-basics approach (along with some stellar production design) that this critic found refreshing."
    },
    {
      "text": "Lacking originality, offers good horror, fulfilling that part of the promise and, if that is what you are looking for from this saga, you will get it fully. [Full review in Spanish]"
    },
    {
      "text": "Though competently made, it's not offering anything new in the alien world -- preferring to play it safe."
    },
    {
      "text": "Were are the scientists of the franchise? A group of homeless, orphan teenagers are stuck on a hellhole planet’s colony. They decide to capture ROMULUS, an abandoned ship. Except for the charisma-free, faceless cast, it is a terrific movie."
    },
    {
      "text": "...the movie’s lackluster atmosphere is established right from the get-go..."
    },
    {
      "text": "Fede Álvarez known for slapping audiences awake with his nerve-shredding Evil Dead and the claustrophobic Don’t Breathe, this latest installment doesn’t so much reinvent the wheel as it does lovingly polish it with a rag soaked in gooey Xenomorph blood."
    },
    {
      "text": "Alien: Romulus gives a long-in-the-glistening-razor-tooth franchise a shot of youthful vigor."
    },
    {
      "text": "For franchise fans, it’s a welcome, if somewhat familiar, return to the dark, unforgiving world of Xenomorphs and corporate greed."
    },
    {
      "text": "The corporate manipulation and betrayal in the Alien films don’t lose their fascination over the course of their many variations."
    },
    {
      "text": "Romulus was generally giving me what I wanted to see...and then it came over and slapped me...very disappointing."
    },
    {
      "text": "After going outside the box a bit for a few films, the Alien franchise finally returns to its roots with Alien:Romulus."
    },
    {
      "text": "... arguably the best “Alien” movie since 1986’s “Aliens.”"
    },
    {
      "text": "Seems we are traveling over the same old ground as the past movies with nothing exciting along the way."
    },
    {
      "text": "An engaging, generic horror/sci-fi/thriller. That’s an observation. Not an accomplishment."
    },
    {
      "text": "Even with its faults and certain choice, I give it an A- for being what every other horror or suspense movie is trying to be this year."
    },
    {
      "text": "The back half is loaded with the best of what the franchise has to offer, ratcheting up the space-based survival shenanigans with zero-gravity acid avoidance and a gloriously grotesque bridge between Prometheus and Alien: Resurrection."
    },
    {
      "text": "The film boasts some rock solid Alien scares and Cailee Spaeny & David Jonsson make for a winning lead combo, but Alien: Romulus caves under franchise connectivity pressure."
    },
    {
      "text": "The best Alien movie since Aliens (1986) [Full review in Spanish]"
    },
    {
      "text": "\"Alien: Romulus\" is a sturdy and welcome addition to the \"Alien\" franchise."
    },
    {
      "text": "While very much a “greatest hits”, there’s just enough innovation to breathe life into the old ghoul​​​​​."
    },
    {
      "text": "The people behind Alien Romulus know how to make horror films, but that adds little eye opening flair to the ninth entry in the franchise"
    },
    {
      "text": "Alien: Romulus didn’t have to save the Alien franchise, but it doesn’t hurt to have a thrilling, unnerving horror-thriller ride like this one to breathe some new energy and excitement back to the brand."
    },
    {
      "text": "Rome wasn't built in a day, nor was the ALIEN sequel bearing the name of the traditional founder of the Eternal City. However, the result feels more like stumbling around the ruins of the Great Fire of Rome than a triumphant temple atop the Palatine Hill."
    },
    {
      "text": "Galo Olivares cinematography is stunning, using light and shadow to create moments of eerie beauty. Combined with Naaman Marshall’s meticulously crafted set pieces, Alvarez and his team masterfully recapture the mood and atmosphere of the original classic"
    },
    {
      "text": "Do moviegoers need another Alien movie? Yes, when it is this inventive and unafraid of returning to its B-movie horror roots."
    },
    {
      "text": "It’s not a new message – but it is powerfully delivered in this compelling addition to the Alien series."
    },
    {
      "text": "Alien: Romulus gets by on its outstanding special effects, thrilling final act, and a wonderful performance from David Jonsson, but the empty characters and tedious action create some lulls in the first and second acts."
    },
    {
      "text": "What sells the overall Alien: Romulus experience is the genuine authenticity of the cast itself."
    },
    {
      "text": "Alien: Romulus effectively honours the spirit of Ridley Scott's original classic, combining atmospheric horror with good performances to create a gripping entry into the franchise."
    },
    {
      "text": "What does it all mean, these callbacks, these sophomoric Shrek-isms? Not much, I don't think. Not when almost all of Alvarez's maximalist audacity is conspicuously neutered."
    },
    {
      "text": "Álvarez, supported by his inseparable writing partner Sayagues, recovers the 'blue-collar' essence of the original, returning the spotlight to workers oppressed by the system... [Full review in Spanish]"
    },
    {
      "text": "Partially an homage to the 2014 video game, the film is a testament to great editing of effects: scurrying face-huggers, chest-bursting creatures, plus young and mature xenomorphs."
    },
    {
      "text": "Alvarez and Sayagues have designed an effective maze of horrors, in which every feature of the setting — such as artificial gravity that cycles on and off — eventually proves to have a purpose."
    },
    {
      "text": "Between its sleek production design, dynamic editing, and nicely modulated ensemble cast, Romulus has the feeling of a quality-controlled multiplex product. The problem is that it rarely feels like anything more than that."
    },
    {
      "text": "[It] isn’t the product of a visionary mind like Alien, nor a thrilling left turn like Aliens. But it is a tightly executed genre exercise with some memorable images and no shortage of visceral thrills. It’s a working-class film that gets the job done."
    },
    {
      "text": "All things considered Fede Álvarez concots a simple but solid entry that never aims at revolutionizing the Alien universe, but it succeeds at bringing back the look and feel of the first two movies of the saga within a contained suspenseful story."
    },
    {
      "text": "[Not] the worst movie in this unfortunately inconsistent franchise. Just the worst movie that doesn't have any Predators in it."
    },
    {
      "text": "A solid, entertaining Alien film."
    },
    {
      "text": "As for the big reveal during the movie's concluding battle, I chuckled. I don't think that was the response the movie was looking for."
    },
    {
      "text": "Fans of the franchise get multiple gifts from Álvarez and co-writer Sayagues as there are moments throughout the film that connect to past offerings in the series from the original movie to “Alien: Prometheus.”"
    },
    {
      "text": "It's got great callbacks. If you've seen all the films, you'll have fun with it."
    },
    {
      "text": "This is one of the better sequels in the franchise but is not without some glaring issues. David Jonsson churns out a fantastic performance that makes what he was given even more frustrating."
    },
    {
      "text": "This is a franchise that defines itself on taking risks and being bold, even if it doesn't all work. Alien Romulus, on the other hand, frivolously decides to be about nothing."
    },
    {
      "text": "Dependent on your tolerance for callbacks, Fede Alvarez has still delivered around it a tense, well-made entry in a series that has somehow gotten dumber when its trying to be smart with solid work from Cailee Spaeny and David Jonsson."
    },
    {
      "text": "I really love this franchise and... I love it when they get it right, and I feel like they got it right."
    },
    {
      "text": "Alien: Romulus is a worthy addition to the Alien franchise, giving audiences a taste of something new, along with plenty of nostalgia."
    },
    {
      "text": "What ensues is - with a few minor and a couple of major peeves regarding plot expediency - a tightly-wrought nightmare."
    },
    {
      "text": "Artless mucus porn."
    },
    {
      "text": "Alien: Romulus stands up as a solid sci-fi with a body horror twist that is sure to attract new fans. The old-school fans might be a slightly trickier audience to win over though."
    },
    {
      "text": "A film of two distinct halves, Alien: Romulus comes so close to becoming a perfect successor to the original, but gets too bogged down in its desire to assert its own identity to be fully cohesive."
    },
    {
      "text": "It has aliens and blood and guts in it. There you go!"
    },
    {
      "text": "The problem is that however good Alien: Romulus is at recapturing much of the spirit of the original film, it's also so slavishly devoted to it that it ends up missing one key ingredient that made Alien such an event in the first place: originality."
    },
    {
      "text": "This isn’t a greatest hits album from the writer-director’s point of view. Alvarez makes the terrain his own, blending the mind of someone who loved the earlier stories with someone who knows they can add a worthy chapter."
    },
    {
      "text": "Álvarez doesn't offer any plausible action passages, nor does he reach any greater depths in his approach.  [Full review in Spanish]"
    },
    {
      "text": "The film works as an isolated entity, as another chronicle in the inhospitable world of Alien. [Full review in Spanish]"
    },
    {
      "text": "The execution’s shoddy, not the least bit nuanced (or nostalgic), and mostly falls flat."
    },
    {
      "text": "The taut set pieces are so dynamic, the tension so stickily uncomfortable, the sound design so jarring and full of screaming metal, that you barely notice that the connective tissue between the action scenes strains to hold them together."
    },
    {
      "text": "What follows is yet another retread of all too familiar Alien territory with some mumbo jumbo about natural selection and eugenics."
    },
    {
      "text": "Like the creature at its centre, Alien: Romulus is a remarkable piece of adaptive creative bioengineering."
    },
    {
      "text": "Though it's not close to the 1979 original, Romulus is on the more watchable end of the franchise, deliberate and creepy for the first half, and non-stop in the second."
    },
    {
      "text": "Director Fede Alvarez deeply, deeply loves the Alien franchise. That’s both very good & very bad. Make no mistake, Alvarez is a damn good director, particularly when it comes to pacing and setpieces."
    },
    {
      "text": "At its most ruthlessly efficient it has a certain big-sci-fi-movie sweep to it as well as some nail-biting action. But, boy, has this franchise gotten pointlessly ugly."
    },
    {
      "text": "It’s a good showcase for the xenomorph in its various permutations and a solid horror/suspense movie in its own right."
    },
    {
      "text": "The cinematography was fantastic. Spaeny and Jonsson's performances really elevated this beyond what could've been a run of the mill extension of the franchise. It took some swings that didn't always hit but it was still an enjoyable sci-fi thriller."
    },
    {
      "text": "If you're a fan of this franchise, this doesn't disappoint. It's one of the few horror films I've seen in recent memory that actually had good jump scares."
    },
    {
      "text": "Alien: Romulus is a satisfactory effort, but it's not nearly as horrific or inventive as I hoped it would be."
    },
    {
      "text": "Fede Alvarez is the Mike Flanagan of this iconic sci-fi franchise by making the equivalent of a “Doctor Sleep” (2019) bridge between “Prometheus” (2012), “Alien: Covenant” (2017) and the first four “Alien” franchise films."
    },
    {
      "text": "“Romulus” proves to be a return to form that’s been absent for far too long in the franchise."
    },
    {
      "text": "Mixing the aesthetic of the original film with new ideas related to migration, limited opportunities and oppression by super-powerful corporations, and references to previous films, “Alien: Romulus” works as a solid new instalment. Full review in Spanish."
    },
    {
      "text": "One of the scariest movies I've seen this year, despite being a “just decent” Alien entry."
    },
    {
      "text": "Filled with tense moments and gripping action, Álvarez utilizes intricate details that pay homage to Scott’s’79 original while reinforcing the film’s legitimacy. Cailee Spaeny and David Jonsson deliver solid performances."
    },
    {
      "text": "“Alien” movies are like pizza, and aside from a few head-scratching choices that will no doubt inspire reams of think pieces, “Alien: Romulus,” with its thrilling tactility and appealingly plucky cast, is a very enjoyable pie."
    },
    {
      "text": "…Alien: Romulus is Alien done right; it’s suspenseful, scary, gruelling, shocking and reboots the franchise in a derivative yet ingenious way that leaves you wanting more…"
    },
    {
      "text": "Fede Álvarez concocts a blend of dread-fueled horror, whacked-out mad science, and thoughtful characterization that brilliantly bursts out of the thin shell of mandated IP-mining courtesy of Disney."
    },
    {
      "text": "We’re left distracted by the mystery of why a thriller that initially revels in being so contained suddenly finds itself straining to reach its tendrils through the various movies that came before it."
    },
    {
      "text": "This is the sequel/prequel we´ve been waiting for almost a quarter of a century. [Full review in Portuguese]"
    },
    {
      "text": "Take the plunge on the big screen, folks, and let the squishy sounds and acid blood work their way into your heart."
    },
    {
      "text": "Alien: Romulus is a dread-inducing, tense and scary space horror with excellent performances, a concise story and tremendous use of practical effects."
    },
    {
      "text": "Romulus is the best kind of nightmare; the one you get to watch on a big silver screen to escape the dog days of summer."
    },
    {
      "text": "Alien: Romulus returns the series to theaters for the first time since 2017, and it’s clear what we’ve been missing."
    },
    {
      "text": "One of the better sequels! Took a while to get started, but once it did it doesn't stop! Really enjoyed the practical effects, loud sounds, and silence. A great mix of action, adventure, and horror. When I thought it was over the movie kept surprising me!"
    },
    {
      "text": "Contrary to every other director that came before him, Fede Álvarez is way to reverent to the rest of the franchise for this to feel like anything else than a tribute, but it is an entertaining one, and the production design is absolutely stellar."
    },
    {
      "text": "You can debate its place in the grand list of Alien films, but it’s certainly near the top, anchored by stellar performances and excellent use of practical effects blended with CG from director Alvarez"
    },
    {
      "text": "Alien - Romulus is another flagrant example of a franchise entry that is over-cluttered with ties to its past. It is too underdeveloped to have its own reason to exist."
    },
    {
      "text": "It works as a stand-alone movie, and is probably a better experience if you come in cold, without any knowledge of the franchise. ALIEN fans bring in too much baggage and rarely can we be satisfied."
    },
    {
      "text": "Writer/director Fede Àlvarez swings for the fences, leaning more into horror than sci-fi and making Alien: Romulus an extra bloody, jump-scare riddled thrill ride."
    },
    {
      "text": "Terrifying and visceral"
    },
    {
      "text": "Having seen this story unfold multiple times, it’s frustrating to watch people make the same mistakes over and over again. But unleashing the deadly extraterrestrials so they can wreak havoc is an endless cycle in which humanity appears to be trapped."
    },
    {
      "text": "Álvarez delivers a great Alien experience. Aesthetically the film is a fantastic modern recreation of the world of the first two films. Álvarez does a great job of using each environment's unique elements to draw out the tension."
    },
    {
      "text": "Thankfully under the steady hand of Fede Alvarez the movie never slips into pastiche, and keeps its wits about itself, delivering prime horror movie goodness."
    },
    {
      "text": "Alien: Romulus is a NIGHTMARE IN SPACE! Skin-crawling perfection with BIG, EXCITING, & TERRIFYING action and sound! Fede Álvarez crafts the BEST film in the ALIEN FRANCHISE with an insane third act! Cailee Spaeny KICKS ASS. See it in IMAX."
    },
    {
      "text": "20th Century Studios execs did it right. Once they realized Alvarez's film contains Oscar-caliber practical effects, production designs, sound and score, they wisely released Alien: Romulus in theaters, rather than on Hulu as originally announced."
    },
    {
      "text": "A highly derivative copy and paste job. Fans with IQs over 88 will be insulted."
    },
    {
      "text": "We’re all under the boot of an all-consuming empire, indeed. If only this finished product didn’t remind one quite so much of its final villain."
    },
    {
      "text": "After a slow and somewhat jumbled start, Alien: Romulus gets better as it goes along. It's one of the most suspenseful and visually striking movies in the Alien franchise, with a nearly perfect mix of science fiction and horror."
    },
    {
      "text": "At this moment, Alien: Romulus is my favorite film of the year."
    },
    {
      "text": "Romulus brings the Alien franchise back to its roots: There’s a scary thing on a spaceship and it’s slowly killing everyone on board"
    },
    {
      "text": "Provides a handful of those shock-repulsion moments that leave you feeling grossed out and adrenalized."
    },
    {
      "text": "A work without much identity and personality, but that has rhythm, energy and some good ideas, along with others that are quite embarrassing and even dangerous. [Full review in Spanish]"
    },
    {
      "text": "It makes for a decent time at the pictures, and the grinding first half is worth enduring for a pleasantly rip-snorting finale."
    },
    {
      "text": "Alien: Romulus is a familiar, but refreshing and ultimately invigorating entry to the Alien franchise."
    },
    {
      "text": "It's top-notch entertainment, but it brings very little that's original to this franchise. [Full review in Spanish]"
    },
    {
      "text": "It isn’t close to the achievement of the first two films in the series, but it’s better than most others in the series."
    },
    {
      "text": "There are moments of tremendous beauty on display here, and there are moments of rollicking rollercoaster-ride fun. And there are moments of fan service so clunkily offensive to a fan who loves being serviced that I nearly tore all of my skin off"
    },
    {
      "text": "It's a properly entertaining, actually scary, supremely atmospheric one-off Alien movie."
    },
    {
      "text": "Imperfect though \"Romulus\" may be, it’s also a solid entry in a slate of films whose original maker has taken the extended story seriously enough to petrify it. Álvarez returns us to the simple sweatiness and anxiety that made \"Alien\" magnificent"
    },
    {
      "text": "An efficient and reasonably entertaining thriller that, like a lot of franchise movies nowadays, traffics more in nostalgia than novelty."
    },
    {
      "text": "Alien: Romulus is 119 minutes of terrifying yet delightful madness."
    },
    {
      "text": "Alien: Romulus is an atmospheric horror, shamelessly mirroring Ridley Scott's 1979 installment. The familiarity might turn some off but for me, it's just so damn fun to watch an  awesome Alien film again!"
    },
    {
      "text": "A lean, mean fright machine that wants little more than to scare your pants off."
    },
    {
      "text": "While not all of the CGI worked, and the story pacing was uneven with noticeable dips, the narrative as a whole is nerve-wracking and anxious, delivering thrills and scares that make for an entertaining watch, regardless if anyone can hear you scream."
    },
    {
      "text": "Alien: Romulus really shines when it plays like a straightforward Alien movie -- and doesn’t pander to the demands of franchisable intellectual property. There’s yucky pleasure to be had in watching these young people flounder."
    },
    {
      "text": "Minimum recco for a fan-service-over-story film ... so a lot of callbacks & Easter eggs to remind fans of the ALIEN zeitgeist, but unfortunately this substitutes for a coherent motivation in the plot. The crew is so young, I expected Scooby-Doo to appear."
    },
    {
      "text": "The film needed more time to breathe and more of a focus. It is still an enjoyable space thriller; however, it could have been so much more."
    },
    {
      "text": "Sticks to the familiar narrative and probably won’t offend diehard fans as some of spin-offs have done over the years, but its lacklustre script and indistinguishable characters are unlikely to inspire the devotion lavished on the first two films."
    },
    {
      "text": "Expect jump shocks and armrest clutching, and the gnarliest alien expensive CGI can offer, in this visually stunning match made for IMAX, regular theaters and communal screams."
    },
    {
      "text": "It looks beautiful and sounds awesome. This is a well-crafted creature feature that does what so many legacy IP sequels fail to do."
    },
    {
      "text": "The film lacks the directorial audacity and willingness to subvert expectations that would elevate it beyond a technically well-executed but safe entry in the franchise."
    },
    {
      "text": "It mixes DNA from the past with invigorating new blood to deliver an immersive and visceral experience. Not a perfect cinematic organism, but a fun unsafe space where everyone can hear you scream. [Full Review in Spanish]"
    },
    {
      "text": "(For better & worse) A passionately directed & well-produced \"greatest hits\" remix of the first two films, with bits from the other ones. A fun horror thrill ride, but with almost nothing new, refreshing or interesting to own. [Full review in Spanish]"
    },
    {
      "text": "Filmmakers over-estimate the commitment that audiences have to “lore.” Just give us a movie, for Christ’s sake."
    },
    {
      "text": "Alien: Romulus is far from being a masterpiece or even disruptive, but at least it guarantees a few good scares during almost two hours. [Full review in Spanish]"
    },
    {
      "text": "Alien: Romulus is diverting enough, but it’s also instantly forgettable — something I don’t think I’ve ever said about any other Alien film, good or bad."
    },
    {
      "text": "If you’re looking for a good scare, or at least an Alien sequel that is willing to be a sweaty blue-collar fable, seek out Alien: Romulus."
    },
    {
      "text": "While incredible practical gore effects and stunning set pieces make Álvarez’s installment well worth watching, it’s as void of meaning as space itself."
    },
    {
      "text": "Romulus isn’t a mutation. It’s just inbred."
    },
    {
      "text": "Alien: Romulus, is the best pound-for-pound film in the franchise since Jim Cameron pulled Ripley out of cryosleep."
    },
    {
      "text": "Alien: Romulus is pure popcorn entertainment and a roller coaster, but pulled off with the kind of craft that doesn’t make it insulting."
    },
    {
      "text": "[A] huge victory, successfully and faithfully reviving one of the best sci-fi/horror series of all time for longtime fans as well as a new generation of audiences."
    },
    {
      "text": "The Alien saga strongly returns to the pantheon of horror. [Full review in Spanish]"
    },
    {
      "text": "A good old-fashioned horror tale, smartly paced, long on character, and on surprises. The only thing that could possibly make it better is if they added a cat. Maybe with sequel."
    },
    {
      "text": "The film mostly stays fresh, though it can be hampered by some weak characters and murky cinematography. But by the time the credits rolled, I thought it was a worthy installment in the franchise."
    },
    {
      "text": "The frightening facehuggers star in a fast-moving film that's low on character development but high on the body and creepy critter count. Actor David Jonsson stands out as the android Andy  and the return of Ian Holm's Ash as Rook is disconcerting."
    },
    {
      "text": "Logic flaws, underdeveloped roles, and lack of originality bring nothing memorable to this series addition. Alien: Romulus will cause severe acid reflux."
    },
    {
      "text": "Álvarez and Sayagues drown this other possible 21st century sci-fi theme in the tribute on rails, and in the end, arrive somewhat crudely at the end of the first chapter of the saga. [Full review in Spanish]"
    },
    {
      "text": "Álvarez may not bring many groundbreaking new ideas, but he understands the nuts-and-bolts mechanics and has the necessary passion. And that's what makes this an exhilarating triumph that delivers everything Alien fans could want."
    },
    {
      "text": "This being a movie about scavengers trying to pick through remnants from the first Alien movie is a great metaphor for what Alien: Romulus is up to."
    },
    {
      "text": "Romulus focuses on what worked about the classic: slasher-style terror, with an unstoppable monster."
    },
    {
      "text": "The film lacks a new Ripley. But the Xenomorph aka the Winged Victory of Samothrace of our nightmares still terrified. Director and co-writer Fede Alvarez delivers."
    },
    {
      "text": "Alien: Romulus is an instantly rewatchable gory fright fest that raises the stakes and shows what makes this sci-fi franchise great.\n\nÁlvarez is a brilliant horror director and makes Romulus the most terrifying entry in the franchise since 1986's Aliens."
    },
    {
      "text": "The summer's best blockbuster."
    },
    {
      "text": "A straightforward Alien movie for the bloodthirsty purists. Unfortunately, it goes about tapping into the soul of the original in a rather thuddingly literal way."
    },
    {
      "text": "This is a full throated, blood soaked horror film that delights in grossing out its audience with goo and gore thrown around."
    },
    {
      "text": "It includes countless references to previous entries – big and small, clever and downright offensive – to the point where it fails to deliver on his most essential assignment. Self-aware to a fault, Alien: Romulus stops being scary."
    },
    {
      "text": "Much like Álvarez’s take on Evil Dead, the director takes what we already know and runs wild with it."
    },
    {
      "text": "After years of enduring so much unnecessary building of the mythos, particularly in the last couple of Scott-directed entries, it’s nice to see this series get back to simply being the kind of space-set slasher movie that it started out as."
    },
    {
      "text": "[T]he filmmakers are smart about what they borrow ... and clever in coming up with a couple of novel ideas within the established mythology of the franchise."
    },
    {
      "text": "While Alien: Romulus is the best franchise entry since Aliens, it isn’t anything to write home about. Nonetheless, it’s the most entertaining and enthralling the middle-of-the-road can get."
    },
    {
      "text": "The line between homage and theft is slim, and this movie gleefully hops back and forth across it."
    },
    {
      "text": "Some big scares feel like tribute scenes, although Alvarez does add some fresh touches of his own."
    },
    {
      "text": "In fact, the less you know about the Alien movies, the more you’ll enjoy what may look like original elements in this one."
    },
    {
      "text": "The seventh chapter in the creepy-crawly franchise shamelessly feeds off the DNA of the first two sci-fi space classics. But new director Fede Alvarez dishes out serviceable funhouse horrors with the gory enthusiasm of the alien fanboy he most truly is."
    },
    {
      "text": "The prevailing argument is that Alien: Romulus is merely an encore of the franchise's greatest moments. That is true, but it isn't a damning assessment. Alien: Romulus gains by honouring the mythology of the original, and it works as a stand-alone sequel."
    },
    {
      "text": "I love this movie so much I want to face-hug it."
    },
    {
      "text": "Fede Álvarez shows an impressive visual style and talent for recreating the overall look and aesthetic of 1979's Alien, but it gets to a point where his vision becomes excessively reverential of the earlier films, which drags down the experience."
    },
    {
      "text": "it's an entertaining, well-made little thriller that should be a crowd-pleaser for the R-rated sci-fi horror loving crowd."
    },
    {
      "text": "The director stages a wild creature attack in a half-flooded bay, introduces a hideous new alien, and digitally reclaims a character from the original \"Alien\" — one played by an actor who in real life died four years ago."
    },
    {
      "text": "It was impossible to go back and try to reinvent the wheel. Instead, Alverez and his team created an homage to what made the first two films work."
    },
    {
      "text": "Alien Romulus feels like a love letter to the franchise, though it has its rough edges. It delivers fan service effectively but occasionally crosses into pandering. Overall, it’s an acid-spitting thrill ride!"
    },
    {
      "text": "Fantastic return to form for the franchise! Fede Alvarez does a superb job with the first 2/3rds of the film - the third act is certainly bold and doesn't quite work, but the movie is still a great ride. David Jonsson steals the show as Andy. Lots of fun!"
    },
    {
      "text": "Alien: Romulus is one of the best movies of the summer, until the last 15 minutes."
    },
    {
      "text": "'Alien: Romulus' impresses with its mood, production design, and cinematography. It may feel like a greatest hits compilation, but it does have some standout moments of intense horror thrill and a commendably bonkers final act."
    },
    {
      "text": "Weaves itself into the franchise seamlessly to deliver a space horror blockbuster and a thrilling theatrical experience."
    },
    {
      "text": "Basically \"Gen Z Does Its Alien,\" this surprisingly effective sequel/homage manages to hearken back to the first two films without burying the entire enterprise in cheap fan-servicing."
    },
    {
      "text": "It’s lovingly aimed at fans who have seen its Carter-era predecessor 15 times, yet it’s unlikely to scare anyone except those who are new to the “Alien” shtick. In space, it turns out, no one can hear you yawn, either."
    },
    {
      "text": "“Alien: Romulus” is gruesome, eerie, suspenseful and not for the faint of heart. It delivers on every aspect. It’s one of the best Alien films in quite some time."
    },
    {
      "text": "Depending on which way you angle your head Alien: Romulus is either third or fourth in line after the masterworks. When Álvarez is on top of his game he justifies Alien being put into his hands."
    },
    {
      "text": "A monstrous return to form, similar to its placement in the timeline, “Alien: Romulus” nestles in the franchise’s top three podium position. The blood, sweat, and tears shed in bringing this vision to fruition weren’t in vain."
    },
    {
      "text": "A film that has a cool and retro and kind of 1980s vision of the future that feels authentic to the timeline."
    },
    {
      "text": "In its best moments, Álvarez makes the xenomorphs and especially the facehuggers the scariest they’ve been in years."
    },
    {
      "text": "Sadly, Alien: Romulus brews a pot that adds spice from other Alien films without the proper measurements, becoming a curdled mess that's challenging to enjoy."
    },
    {
      "text": "Spaeny is an inspired addition to the saga's signature lineage of female protagonists, both fragile and indestructible, who confront the creature who often represents in his bestial way, the worst of masculinity. [Full review in Spanish]"
    },
    {
      "text": "While paying homage to the original, the film’s success lies in its unique identity."
    },
    {
      "text": "It is a gory celebration of every Alien movie that has come before it, and it proves there is still so much life left in this terrifying yet highly intriguing world."
    },
    {
      "text": "'Alien: Romulus' is an accomplished mission, but also a corporate genuflection with nothing new to contribute. [Full review in Spanish]"
    },
    {
      "text": "There are twists that don't work and the ending seems somewhat stretched. All in all, it opens a new (or old, as you prefer) strain to the saga."
    },
    {
      "text": "A bit of a mixed bag overall but certainly at times thrilling and at others scary and unsettling"
    },
    {
      "text": "“Alien” movie, “Alien: Romulus,” the seventh installment in this storied, apparently inexhaustible cycle of films, is perfectly adequate filler."
    },
    {
      "text": "Does what it’s designed to do: provide jolts to the viewer (while gobbling up, the studio hopes, box office receipts).  But it brings little new to the table, and ends up a rather unimaginative, if undoubtedly busy, addition to the series."
    },
    {
      "text": "The latest addition to the franchise, Alien: Romulus, continues with this anti-corporate theme while giving viewers an inventive new story of horror and resilience—and plenty of nightmare fuel."
    },
    {
      "text": "An installment all too aware of its cultural reach, Alien: Romulus acts as an exhumation of the franchise, like the film has been buried on the ancient burial ground of Alien, its harpooned skeleton reaching out begging for death"
    },
    {
      "text": "Alien: Romulus makes the case that the franchise can continue indefinitely as long as it’s paired with filmmakers who know how to bring out the best in their casts and the well-known aliens."
    },
    {
      "text": "The highly derivative Alien: Romulus is nevertheless a worthy addition to the xenomorph canon, especially if you think of it less as a sequel or prequel and more as a stand-alone story with a younger cast."
    },
    {
      "text": "Successful in its most basic function... If it hadn’t had someone of Álvarez’s care and attention at the helm, Romulus could certainly have been a lot worse. One does wonder, though, how many more times we can watch this same chain of events play out."
    },
    {
      "text": "A film whose virtues are weighed down by too many vices. [Full review in Spanish]"
    },
    {
      "text": "Fede Álvarez expands the myth of the xenomorph created by Dan O'Bannon, HR Giger and Ridley Scott in 1979 for the most joyful and delirious of paroxysms.  [Full review in Spanish]"
    },
    {
      "text": "If the movie doesn't advance the mythology noticeably, at least Álvarez makes sure that it delivers its share of scares and doesn't drag over the course of its 120 minutes..."
    },
    {
      "text": "Alien: Romulus is a heart-pulsating showpiece that both reinvigorates the franchise by injecting it with what it has sorely been lacking recently: fear."
    },
    {
      "text": "When the plot kicks in and the action kicks off, Alvarez gets us by the throat, skilfully mixing claustrophobic dread, race-against-time tension and grisly shocks, and taking us on a palm-dampening, seat-gripping, adrenaline-pumping thrill ride."
    },
    {
      "text": "Alvarez has just made a patchwork quilt, and the stitching doesn’t always hold."
    },
    {
      "text": "Alien: Romulus successfully captures the essence of the original Alien, both in its tone and creature design, while carving out its own place in the franchise."
    },
    {
      "text": "I’ve always loved the claustrophobic horror that Alien provides, and this one uses that to its advantage big time."
    },
    {
      "text": "It may not be the perfect organism, but Alien Romulus is certainly a tense and terrifying addition to the franchise."
    },
    {
      "text": "Director Fede Álvarez traffics in a tactile, dirt under the fingernails, practical aesthetic that’s so enveloping it smothers our natural inclination to recoil at such fan service."
    },
    {
      "text": "It's like a product wearing the skin of an Alien movie with nowhere near the same levels of either heart or soul."
    },
    {
      "text": "When it’s a full-on Alien splatter movie, it’s undeniably fun — whenever it decides it needs to turn into an Alien legacy sequel, it falls completely flat, specifically with a couple of admittedly ballsy choices that are certain to divide audiences."
    },
    {
      "text": "A gross, brutal space thriller that's part fan-servicing greatest-hits album and part cunning meta-movie about the devouring black hole of corporate greed. In other words, it's both the Force Awakens and the Matrix Resurrections of Alien movies."
    },
    {
      "text": "While its dedication to fan service occasionally holds it back, 'Alien: Romulus' is still a thrilling addition to the franchise thanks to director Fede Álvarez's dedication to visceral practical effects and new twists to the canon."
    },
    {
      "text": "A fine sequel that doesn’t take the franchise in any new or exciting directions, but director Fede Alvarez has a knack for building suspense and he delivers on the bloody, creature mayhem people want and expect."
    },
    {
      "text": "Alien: Romulus feels like it was engineered in a lab from the parts of the previous Alien films, but it is a relentless thrill machine."
    },
    {
      "text": "'Alien: Romulus' recaptures the best of the sinister atmosphere that made the first film in the saga a horror film. But it delves into the best of science fiction, on a new level. [Full Review in Spanish]"
    },
    {
      "text": "A horror film set in space, Alien: Romulus is a back-to-basics movie that finds a way to use our nostalgia for the original films as a springboard for some scary new ideas."
    },
    {
      "text": "Finally, someone has made a movie that comes close to the brilliance of Ridley Scott and James Cameron"
    },
    {
      "text": "Alvarez is flying fast and loose here, and suffice it to say his energetic creative vivaciousness does tend to be infectious."
    },
    {
      "text": "Alien Romulus is definitely a few things: a stark love letter to the entire franchise, a distinct vision by Fede Alvarez, and a fearless entry into the Alien lore. It easily stands amongst the heavyweights of the franchise."
    },
    {
      "text": "Alien: Romulus brings genuine scares and visceral thrills to revive the franchise with Cailee Spaeny shining as the badass protagonist. The film expertly meshes sci-fi and horror in a dark, grimy setting with banner special effects."
    },
    {
      "text": "A wildly entertaining sci-fi film that succeeds in paying homage to its predecessors while also forging its own fresh, creative, and new identity."
    },
    {
      "text": "Somewhat tedious and unimaginative, but well-produced, well-cast and with enough chills and thrills to be a satisfying slice of mindless entertainment."
    },
    {
      "text": "Director Fede Alvarez keeps delivering films that are amazing on a technical level, but the spark of originality keeps avoiding him for some reason."
    },
    {
      "text": "It unfolds like a bad case of déjà vu, conjuring familiar sets and circumstances but draining them of psychological energy and the thrill of the new."
    },
    {
      "text": "Alien: Romulus feels made by and for people who are familiar with the component parts of an Alien movie but haven’t ever seen one."
    },
    {
      "text": "With Romulus, [Fede] Alvarez has effortlessly inserted himself into the timeline with a blend of old-school respect and new-school brazen."
    },
    {
      "text": "A huge sci-fi spectacle worthy of being put in the “win” column for this long-storied franchise."
    },
    {
      "text": "The movie achieved exactly what I was looking for - horror and tension. The cast was fantastic, with David Jonsson's Andy as the standout. The sound design and visuals are excellent. The third act is wild!"
    },
    {
      "text": "Alvarez does succeed in recapturing the claustrophobic chills and visceral terror of those first two films - even if he overindulges in nostalgia while he's at it."
    },
    {
      "text": "It's more like a warp-speed remix, Álvarez the club DJ putting his own distinct touch on familiar bangers with the singular object of getting our blood pumping as quickly as possible."
    },
    {
      "text": "Fede Álvarez breathed new life into the franchise with “Alien: Romulus”, finding creative ways to use already established, iconic elements of these films, and to once again make facehuggers and xenomorphs the nightmare fuel they were meant to be."
    },
    {
      "text": "I like the movie. Halfway through, I was ready to love the movie. But the frustration that set in was a variation on the old cliche… it left me wanting less. Sigh."
    },
    {
      "text": "A profoundly frustrating film, given that it has hints of greatness but ultimately disappoints."
    },
    {
      "text": "Cailee Spaeny in the heroine role of Rain, she proves herself a worthy successor to the feminine force and fury first channelled by Sigourney Weaver at the dawn of all things Alien."
    },
    {
      "text": "Ultimately I was happy with Alien: Romulus, both from a visual and a tension standpoint."
    },
    {
      "text": "Alien: Romulus is a serviceable yet underwhelming entry in a franchise that’s otherwise known for its relentless evolution."
    },
    {
      "text": "The decades-old franchise returns to its space-horror roots."
    },
    {
      "text": "It borrows the shabby-computer aesthetic of the ’79 flick while upping the ante with haunting grandeur."
    },
    {
      "text": "It's a fun addition, nothing groundbreaking."
    },
    {
      "text": "Immersive, terrifying, and thrilling with an astounding cast"
    },
    {
      "text": "To its credit, it’s a no-frills, straight-up genre piece built largely on the bones of the first two movies. All that’s missing are originality and a convincing final act, and, honestly, you could do worse for a Saturday night eek-a-thon."
    },
    {
      "text": "In the end, there are some flaws, but all in all, I enjoyed Alien: Romulus."
    },
    {
      "text": "… when it’s allowed to be its own beast, it’s taut, tense and gorgeous to behold."
    },
    {
      "text": "Alien: Romulus plays the hits, but crucially remembers the ingredients for what makes a good Alien film, and executes them with stunning craft and care. It is, officially, the third-best film in the series."
    },
    {
      "text": "Fede Alvarez once again proves apt at the art of remixing with Alien: Romulus; it doesn’t have ambition or much originality, but it’s elevated by a chilling atmosphere, escalating momentum, and a resiliently fierce Cailee Spaeny"
    },
    {
      "text": "Alvarez has come up with a way to tie the original 1979 “Alien” to “Alien: Prometheus” in a third act stunner of creature design and visual effects."
    },
    {
      "text": "Spaeny is tough, and Jonsson is a standout in a film that moves forward but still harkens back to the iconic original film. While they say “In space, no one can hear you,” this film will leave Alien fans screaming for more."
    },
    {
      "text": "Fans of the first two Aliens will admire how faithfully this film recreates the grungy interiors of the Nostramo. It’s marvellously nostalgic...beautifully mounted and lovingly sculpted, a whole-hearted and adoring embracing of Old School by New School."
    },
    {
      "text": "Alien: Romulus succeeds on every level, latching onto viewers' faces and implanting us with a creepy good time."
    },
    {
      "text": "Alvarez, who did an impressive job with the \"Evil Dead\" remake, isn’t to blame. He is a smart director with an eye for visual flair, but in \"Romulus,' he apes too much of the original for it to be surprising."
    },
    {
      "text": "Alvarez brings scary back to deep space while carving his own niche, paying homage to the past, and embracing the entirety of what Alien is."
    },
    {
      "text": "The movie never feels like more than the work of a halfway decent cover band."
    },
    {
      "text": "It's an impeccably crafted sci-fi horror movie that sustains high levels of suspense and intensity for almost its entire running time, but it's also a bit hollow, functioning as a reflection of the bolder films that came before it."
    },
    {
      "text": "Seemingly designed to settle the debate over whether the Alien films count as horror..."
    },
    {
      "text": "It’s executed superbly at times, providing a fantastic thrill ride that plays with sequel iconography and plotting."
    },
    {
      "text": "It's the most purely frightening \"Alien\" movie in nearly 40 years, a vision of what the franchise can achieve when in the right hands, and hopefully a stepping stone to even more stories in the universe."
    },
    {
      "text": "Alien: Romulus is a tense, creepy, and welcome return of the franchise to more of its origins than what the last two were for most. It’s a film that could bring a new storyline to connect to a whole new generation of audiences."
    },
    {
      "text": "Repackages franchise iconography for a theme park ride that's mostly good when scrolling through the best of \"ALIEN\" and \"ALIENS\" and mostly bad when it's obligated to remind us of... the rest. 'Disney Reboot' round goes to The Predator."
    },
    {
      "text": "Alien: Romulus proves the franchise can still deliver great sequels as long as they strike a perfect balance between trying new things and sticking to the elements of the story that worked best in the first place."
    },
    {
      "text": "As glossy as it is — and the gore is deeply red and satisfying — it’s ultimately just a really high-tech photocopy."
    },
    {
      "text": "It derives far too much from Prometheus and Alien: Covenant, and not enough from Alien and Aliens."
    },
    {
      "text": "[One particular creative choice is] an unintentional, chilling vision of the future that has nothing to do with chest-bursting monsters. You might find this palatable. For me, it ruined what was otherwise a fun, icky trip to space."
    },
    {
      "text": "Alien: Romulus is the Alien film I have been waiting for. While I don’t think anything will ever reach the pinnacle of the original film, Alien: Romulus is a horror-forward swing for the fences with a third act that is uniquely of unsettling."
    },
    {
      "text": "Alien: Romulus delivers chilling atmosphere and thrilling moments, but is hampered by a thin storyline and dialogue often buried beneath the score. A must-see for franchise fans, but consider watching with subtitles for full clarity."
    },
    {
      "text": "If Alvarez is aiming to attract “body horror” fans, he’s succeeded brilliantly. But if you were impressed by the moral arguments explored in Scott’s last two prequels and by the gravitas that Weaver brought to the original trilogy, you’re out of luck."
    },
    {
      "text": "[Álvarez] has triumphed with a clever, gripping and sometimes awe-inspiring sci-fi chiller, which takes the series back to its nerve-racking monster-movie roots while injecting it with some new blood – some new acid blood, you might say."
    },
    {
      "text": "We’ve got xenomorphs, we’ve got face-huggers, there’s a chest-burster, corporate malfeasance, capitalistic overreach, acid blood, synthetics up to no good, and all the expected bells and baubles."
    },
    {
      "text": "The intense atmosphere builds gradually, keeping you on edge and heightening the tension with each passing moment. David Jonsson is a star. The Sound design team makes their money!"
    },
    {
      "text": "Fede Alvarez’s wicked concoctions are worthy deviations from a directive that is otherwise––to put it in Weyland-Yutani terms––“what’s best for The Company.”"
    },
    {
      "text": "Because so many of Romulus’ beats echo iconic moments from past Alien movies, few of the new film’s twists and turns will take longtime fans. But for folks just looking for a few solid jump scares and of Ridley Scott’s imagination, the film is enough."
    },
    {
      "text": "The slime and the shadows and the silences are back. Horror DNA is honored rather than pointlessly duplicated. This time, at least, IP familiarity breeds contentment."
    },
    {
      "text": "In its sweaty attempts to bring the franchise back to basics, Romulus feels less like its own movie and more like a greatest hits of the Alien series."
    },
    {
      "text": "A technically competent piece of work; but no matter how ingenious its references to the first film it has to be said that there’s a fundamental lack of originality here which makes it frustrating."
    },
    {
      "text": "This is an “Alien” built on fan service, from its loop of greatest hits to recycling the original’s most famous lines to repurposing familiar tropes. Face huggers? Chest busters? You got it."
    },
    {
      "text": "Romulus might inject an appalling new life into the Alien franchise, but it won’t do much good for the national birth rate."
    },
    {
      "text": "Alien: Romulus masterfully revives the Alien franchise as both a respectful tribute and a thrilling standalone offering. It expertly blends classic horror elements with fresh perspectives, creating a must-see for fans and newcomers alike."
    },
    {
      "text": "What’s onscreen is neither a haunted house nor a roller coaster, but a standard theme-park ride based on a movie — an Alien-flavored attraction that doubles as an overly respectful homage."
    },
    {
      "text": "Alien: Romulus relies too much on nostalgia at times, but when director Fede Álvarez does present enough of his own fresh ideas, it takes the franchise to exciting new heights."
    },
    {
      "text": "Alien groupies will be cock-a-hoop, as the metal-mouthed, acid-dribbling creature is as terrifying as it’s ever been. As will the gore-hounds... Álvarez does it all with mighty oomph and relentless, cold, hard menace."
    },
    {
      "text": "It's taken a while — 45 years, four sequels and two spin-off films — but finally they've got it right. An Alien movie worthy of the mood, originality and template established by Ridley Scott in 1979."
    },
    {
      "text": "It's gritty and nasty. It's violent and gory. It's intense and unnerving. In other words, it's everything an Alien film should be."
    },
    {
      "text": "Alien: Romulus is bracing fun, buoyed by a stellar ensemble cast, but its narrative falls apart under any speck of scrutiny."
    },
    {
      "text": "Alien: Romulus was a chilling rollercoaster ride full of thrills and terror in space. Fede Alvarez understood the assignment and passed with flying colors.  Alien: Romulus could be a game-changer and breathe new life into the franchise."
    },
    {
      "text": "Director Fede Alvarez competently reassembles what made space saga soar."
    },
    {
      "text": "Along the way, Álvarez makes one error so egregious that he just about makes you want to root for the xenomorphs to gobble this franchise whole before acid-spitting it back out."
    },
    {
      "text": "The movie knows what it’s doing. It’s sharply paced, dynamically varied filmmaking with dash and purpose, along with scads of blech and viscera."
    },
    {
      "text": "Sometimes bold, sometimes over-reverent, Romulus might have executed a cleaner lift-off had Alvarez ejected some of the series baggage more decisively."
    },
    {
      "text": "Pays perfect homage to the original Alien films, bringing back practical effects and terrifying, suspenseful moments. The third act is absolutely bonkers, and is sure to be divisive, but one thing is for sure, it will get people talking."
    },
    {
      "text": "The foundational mistake came when someone said, “Hey, let’s make another ‘Alien’ movie.” Newsflash: The alien concept is dead. Leave it alone."
    },
    {
      "text": "Everything gets grossly psychosexual, delirious, and dreadfully dark as per Alvarez's trademarks, just never on a level that kicks into hyperdrive."
    },
    {
      "text": "Fede Alvarez cleverly crafts a story weaving in the best elements from All the past entries. Perfect balance of Horror & Action. Breathtaking visuals! Spaeny & Jonsson are a real highlight. Overall a solid re-entry into the universe."
    },
    {
      "text": "As well-crafted and sometimes scary as it is, it can’t escape the shadow of the franchise’s first two classics, and at a certain point it just stops trying."
    },
    {
      "text": "A gorehound whose tastes and talents are much better-suited to the Grand Guignol splatter of “Evil Dead” than they are to the suffocating dread of “Alien,” the director would rather torture his cast than develop their characters."
    },
    {
      "text": "Fede Alvarez has outdone himself with his best film yet! Alien Romulus isn’t just a love letter it’s an amalgamation of the alien franchise as a whole. Beautiful, terrifying, gnarly, weird, twisted, grotesque, gory, & most of all deeply layered."
    },
    {
      "text": "You don't just watch Alien: Romulus; you are absorbed into it. Brace yourselves."
    },
    {
      "text": "Cailee Spaeney might seem, at first glance, to be an unlikely successor, but the Priscilla star certainly earns her stripes by the end of Alien: Romulus’ tight and deceptively well-judged two-hour running time."
    },
    {
      "text": "Maintaining a low orbit makes this one of the best in the franchise in years."
    },
    {
      "text": "An efficient addition to the 45-year-old franchise, Alien: Romulus draws on the strengths of the sci-fi/horror series without ever suggesting that the property’s best days are ahead."
    },
    {
      "text": "Fede made it a point of emphasis to bring the thrills and the horror roots back into the franchise without compromising on the action and blends the old with the new in a very entertaining way for the most part."
    },
    {
      "text": "This is closer to a grandly efficient greatest-hits thrill ride, packaged like a video game. Yet on that level it’s a confidently spooky, ingeniously shot, at times nerve-jangling piece of entertainment."
    },
    {
      "text": "Let the callbacks and homages begin — and then never end."
    },
    {
      "text": "While it subtly plays the greatest hits, it also brilliantly innovates, delivering smart, savvy thrills. It’s gnarly, gripping and gorgeously bleak."
    },
    {
      "text": "[You] may even laugh rather than scream. It’s all good, though. In space, probably no one can hear you laugh, either."
    },
    {
      "text": "It’s fun, tense, and slimy. It’s also nowhere near as ambitious as some of the films in this series deemed failures. We can’t have everything."
    },
    {
      "text": "Offering an unforgettable experience, Alien: Romulus proves once again that in space, no one can hear you scream."
    },
    {
      "text": "Comes frustratingly close to being great."
    },
    {
      "text": "Alvarez puts the horror first here, with exquisite craftmanship that immerses you in the insanity."
    },
    {
      "text": "Somewhere between Alien & Aliens — fitting given its place in the timeline — Romulus serves up blockbuster-level action & visceral horror all in one."
    },
    {
      "text": "In its attempts to emulate every shifting form the series has taken over the years, it ends up less a perfect organism, and more a flawed creation that doesn’t meet company standards."
    },
    {
      "text": "Alien: Romulus is the first time I actually was terrified during a movie in this franchise."
    },
    {
      "text": "A return to the haunted-house-in-space aesthetic that Ridley Scott first unveiled 45 years ago. The end is little short of a disaster, but, to that point, Álvarez, director of the fine Don’t Breathe, marshals the set pieces with violent grace."
    },
    {
      "text": "Fede Álvarez proves that his Evil Dead remake was no fluke: The director seamlessly keys into the narrative and aesthetic touchstones of the series and marshals them to breathtaking ends."
    },
    {
      "text": "\"Romulus\" has no aspirations. It's less of a new entry in a long-running series and more of a collection of greatest hits moments."
    },
    {
      "text": "The creatures remain among the most truly petrifying movie monsters in history, and the director leans hard into the sci-fi/horror with a relentlessly paced entry that reminds us why they have haunted our imaginations for decades."
    },
    {
      "text": "Alien: Romulus proves that for the Alien franchise to move forward, it might have to quit looking backward so much."
    },
    {
      "text": "Wretched excess -- with the emphasis on wretched -- is the operating principle here. Alvarez speeds things up while at the same time dumbing them down."
    },
    {
      "text": "It’s a shallower product than either of its inspirations, but it also has its own, distinct energy. It doesn’t totally jettison the franchise’s 45 years of baggage, but when it does, what’s left is a damn good monster movie."
    },
    {
      "text": "If you’re looking at Alien: Romulus as a simple horror movie, it’s quite effective and very enjoyable. The atmosphere is intense, the effects are strong, the kills are satisfying, and — most importantly — it’s fun."
    },
    {
      "text": "The scariest Alien movie in decades: a chaotic, no-holds-barred ride that won’t make you smarter but might keep you up at night."
    },
    {
      "text": "Álvarez isn't necessarily a cerebral guy, but he straps viewers into the front seat of a roller coaster and lets 'er rip, and the results are gripping."
    },
    {
      "text": "Alien: Romulus has its hiccups. It’s missing a few dashes of cohesion, doesn’t have the thematic resonance it teases at the beginning, and it’s a little backloaded. But it’s an incredibly fun sci-fi action horror movie."
    },
    {
      "text": "Alien: Romulus has the capacity for greatness. If you could somehow surgically extract its strongest sequences, you’d see that beautiful, blood-quivering harmony between old-school practical effects and modern horror verve."
    },
    {
      "text": "Like in most of the sequels, fans will debate some of its choices, but this entry offers admirable creative takes on the franchise."
    },
    {
      "text": "Alien: Romulus goes boldly where many of the Alien sequels should’ve gone before. Hard."
    },
    {
      "text": "As he did with 2013's \"Evil Dead,\" Alvarez is keeping an old-school chiller alive for a new generation. He's added an intriguing chapter to the “Alien” mythos, one that’s better than many of the later films."
    },
    {
      "text": "There is a desperate yearning for a more potent environment that can legitimately build on suspense and tension, but there is still an efficient value in this disposable enterprise."
    },
    {
      "text": "Alien: Romulus is a blast to watch. It thrives on twisting the knife in terms of building suspense and delivering gory jolts that are sure to make horror fans proud."
    },
    {
      "text": "Alien: Romulus entertains as a standalone horror adventure set in the Alien universe, but the forced franchise callbacks dampen its greatest qualities."
    },
    {
      "text": "A mostly return-to-form Alien movie that effectively combines sci-fi horror and action with slasher-film tropes."
    },
    {
      "text": "An effective monster movie, but that’s about it."
    },
    {
      "text": "Alien: Romulus successfully carves its niche into the celebrated franchise. It's a worthy entry that pays homage to the originals; It delivers the terrifying goods and finally brings the creature horror back to outer space."
    },
    {
      "text": "Fede Álvarez's new Alien film brings the series back to its roots in cool and creative ways - even while the amount of references and callbacks to the franchise's history are a bit much."
    },
    {
      "text": "Fede Álvarez’s Alien: Romulus is a gnarly, visceral, and bold cinematic experience that brings the franchise back to its horror roots while not shying away from the action spectacle of James Cameron’s Aliens."
    },
    {
      "text": "Proves that forty-five years after the xenomorph first terrified audiences, there’s still plenty of acid-bloody life left in the franchise’s monstrous bones."
    },
    {
      "text": "Alien: Romulus has enough scares to point the franchise in a solid direction."
    },
    {
      "text": "Alien: Romulus is a wild ride that will have your blood pumping from beginning to end."
    },
    {
      "text": "Romulus feel torn between Alvarez’s desire to tell a new story in the Alien universe and 20th Century Studios’ desire for a fan-servicey thrill ride.The frustrating thing about it is that, moment to moment, it very much works."
    },
    {
      "text": "It's faithful to its own detriment, a blend of some truly great sequences with recycled ideas that don't land as well as you'd hope."
    },
    {
      "text": "Is Alien: Romulus worthy of the Alien franchise? Absolutely. Are there missteps? A couple, but not enough to detract... Alien: Romulus is as thrilling, exciting, and scary as the best of the Alien Saga."
    },
    {
      "text": "Alien: Romulus ends up as the franchise’s strongest entry in three decades for its devotion to deploying lean genre mechanics."
    },
    {
      "text": "The best horror films use genre convention as a Trojan horse to introduce and comment on relevant political themes plaguing people in the current landscape. Alien: Romulus only lightly scratches the surface."
    },
    {
      "text": "'Alien: Romulus' proves there’s still plenty of life in the Xenomorphs—and that life is best served with a hefty dose of death."
    },
    {
      "text": "This is filled with all the jump scares, unexpected twists and nightmare-inducing imagery anyone who was 12 in 1986 – or 2020 – could wish for. Álvarez, has delivered an Alien movie to – almost – rival Cameron’s magnum opus of barely contained chaos."
    }
  ],
  "release_year": 2024,
  "duration": 119,
  "genres": [
    "Sci-Fi",
    "Horror"
  ],
  "synopsis": "While scavenging the deep ends of a derelict space station, a group of young space colonizers come face to face with the most terrifying life form in the universe.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/b33nnKl1GSFbao4l3fZDDqsMx0F.jpg"
}