{
  "movie_name": "Arrival",
  "movie_id": "arrival_2016",
  "total_reviews": 441,
  "reviews": [
    {
      "text": "The film works as a powerful allegory for how we try to decode and interpret the tragedies of our lives."
    },
    {
      "text": "Without spoiling too much, let’s just say Villeneuve and Heisserer use the Kuleshov effect to turn the non-linear storytelling of “Arrival” from a gimmick to an indispensable part of the film."
    },
    {
      "text": "Arrival is a work that resents the necessity of violence. However, the film ditches some of the meditative qualities of the bleakness-to-idealism dialectic of the album in favor of making a cold hard stand against war and those who clamour for it."
    },
    {
      "text": "The film not only discusses complex theories about time, but also exemplifies it by creating a circular sequence of events. Embarking on the mounting steps of Villeneuve’s hypnotic structure is assured to leave viewers spellbound."
    },
    {
      "text": "With “Arrival,” Villeneuve has hit full stride with a film that contains elements of Hitchcock, Kubrick, and Spielberg, via influence rather than imitation or tacky aping. He is his own man, yet recognizes the genius that preceded his creative journey."
    },
    {
      "text": "A masterpiece of scifi films"
    },
    {
      "text": "Leaves us with hope... One of the best sci-fi films of recent times without gunfights. [Full review in Spanish]"
    },
    {
      "text": "Melancholy, mysterious and measured as it tracks the struggle to communicate with these alien creatures, Arrival is really about language and how it functions, how it shapes us and sometimes limits us, and how it can connect or separate us."
    },
    {
      "text": "Amy Adams’ transcendent portrayal of a linguist..."
    },
    {
      "text": "I appreciated the intelligent science fiction, but also how the film steps beyond genre. It turned out to be far more intimate and thought-provoking than I ever expected. And all of that on top of the superb visuals, art direction, and score."
    },
    {
      "text": "The trippy events unfolding out of Heisserer’s screenplay tangle the puppeteer’s strings and play with narrative and filmmaking forces few are daring enough, and smart enough, to wield."
    },
    {
      "text": "Both cerebral and achingly emotional, Arrival sustains a message about hope and understanding for a better humanity that audiences may need right now."
    },
    {
      "text": "One of the most beautiful, emotional and original science-fiction films of the last decade."
    },
    {
      "text": "The best film of 2016. A motion picture that turns out to be far more focused on humanity than on otherworldly visitors, it's a transcendent viewing experience that gets under the skin and into the heart."
    },
    {
      "text": "Arrival just might be the overall best movie of the decade with the way it cleverly examines what we believe while simultaneously delivering a tense, gripping sci-fi story."
    },
    {
      "text": "Hypnotic and strange and beautiful - have I said beautiful fifteen times yet? Because it deserves that word no fewer than that many."
    },
    {
      "text": "An astonishingly beautiful film, both visually and emotionally."
    },
    {
      "text": "One of the finest, if not the finest, science fiction movie of the 21st Century."
    },
    {
      "text": "True to its theme, Arrival itself seems like a premonition of a more tangible event."
    },
    {
      "text": "We'll always have power structures that are reflexively defensive, but Arrival reminds us many in prominent positions are committed to peace."
    },
    {
      "text": "If there was such a precedent, this film might be considered an alien encounter procedural."
    },
    {
      "text": "Arrival expertly uses conventions of the genre to explore free-will, experiences and memory, in a film that is as personal as it is relatable."
    },
    {
      "text": "A film as comfortable with universe-twisting ideologies as it is with the intimate, perhaps universal, experiences of communication, grief, discovery and trust."
    },
    {
      "text": "Arrival is a feeble science fiction parable from Denis Villeneuve."
    },
    {
      "text": "Arrival showcases the best performance you'll see by Amy Adams."
    },
    {
      "text": "It's not easy to encounter a film that makes you meditate on its content days after watching it. And that's what Arrival does. [Full review in Spanish]"
    },
    {
      "text": "Villeneuve's subtlety captures the close encounter of the third kind with dazzling imagery to reveal the contradictions of human existence. It is an amazing experience. [Full review in Spanish]"
    },
    {
      "text": "It's a very immersive movie."
    },
    {
      "text": "It was a cool movie."
    },
    {
      "text": "What I cherish so much about Arrival is that it places the highest value on science and smarts over braun and firepower."
    },
    {
      "text": "[The] movie-one of the best and brainiest sf films in recent memory-depicts the linguistic and scientific challenge of human scholars to understand and be understood by creatures from another world."
    },
    {
      "text": "The success of Arrival ultimately relies on the performance of Amy Adams. If she chose to retire from acting right now, she could be secure in the knowledge that her portrayal of Banks is career best work."
    },
    {
      "text": "Arrival has aliens in it, but it's not a movie about aliens. It will challenge you with its complex plot and its ideas about life, death, communication and the nature of time. It is very much worth seeing."
    },
    {
      "text": "Villeneuve has accomplished what I thought impossible. Arrival stays true to the revelatory spirit of \"Story of Your Life\" while excising some of the story's more difficult concepts and adding a dash of Hollywood razzmatazz."
    },
    {
      "text": "This is an excellently made film that questions our notions of time, kindness and understanding."
    },
    {
      "text": "Arrival is astonishing, thought-provoking filmmaking with a career-defining role for [Amy] Adams."
    },
    {
      "text": "Cerebral and intelligent, Arrival leads one to a fascination with the art of communication and the \"what if\" of possibility and the unknown."
    },
    {
      "text": "The single most compelling and notable aspect of the film is the unwavering intelligence and insight, and the nerviness and instinct of the female lead character."
    },
    {
      "text": "Using language and communication as a fertile metaphor, Denis Villeneuve situates complex ideas into streamlined composition with Arrival, a poetic examination of extraterrestrial contact."
    },
    {
      "text": "Director Denis Villeneuve does a very good job keeping the pace going throughout Arrival."
    },
    {
      "text": "Implausibilities aside, the development of the bulk of the plot is an exciting study of the language of extraterrestrial symbols that they draw with their squid ink from outer space. [Full Review in Spanish]"
    },
    {
      "text": "A film that uses an alien encounter on earth to probe deeper questions about faith, time, suffering, and love."
    },
    {
      "text": "...a movie that soars into the deep space of emotion, with ingenious visuals and sound design that explore the very nature of communication, and cinema."
    },
    {
      "text": "Arrival will challenge us to think and to question. And while we come away with answers, we also experience the stunning power of great filmmaking, great writing, and a great story."
    },
    {
      "text": "Arrival is a delicate, thoughtful meditation on nuanced subjects that aren't even hinted at in the trailers. Sloppy though it may be, the sum of its parts is emotionally staggering."
    },
    {
      "text": "Arrival is the smart science fiction movie that leaves you stunned and wondering if the sleight of hand lives up to the punchline."
    },
    {
      "text": "An intelligent and thought-provoking science fiction drama boasting a smart screenplay, beautiful visuals, a strong musical soundtrack and uniformly tremendous performances."
    },
    {
      "text": "I like it when movies challenge us - we don't quite have enough of that these days."
    },
    {
      "text": "In its combination of big themes, globe-spanning sci-fi and intimate character moments, Arrival feels like it's what Interstellar wanted to be."
    },
    {
      "text": "Arrival is one of those films I'll always remember fondly, it was still professionally made and really well told, acted and shot. A perfect sci-fi film."
    },
    {
      "text": "I like that it really goes for it and has bold ideas."
    },
    {
      "text": "Villeneuve shoots for the stars and falls short, but ARRIVAL's slow-burning intensity and Adams' leading performance are enough to invade our thoughts."
    },
    {
      "text": "Depending on which yardstick you want to use, Arrival qualifies as Villeneuve's biggest success to date."
    },
    {
      "text": "[Arrival] is a thoughtful and sophisticated take on first contact, a beautifully-made film with dynamite performances that manages to explore some of the more complex questions that might be raised by our species' first close encounter."
    },
    {
      "text": "An enlightening tale about the human mind, communication and perception, Arrival is thoughtful and thought-provoking."
    },
    {
      "text": "\"Arrival\" is challenging yet comforting science fiction and frankly it's about time."
    },
    {
      "text": "It has some amazing moments, but ultimately, it just can't reach greatness because of some choice decisions."
    },
    {
      "text": "In a refreshing gender role-reversal, Louise's male science partner plays the support character who deepens the main storyline of a woman."
    },
    {
      "text": "A startlingly original film. This alien meets professor film is more layered character drama than thriller. Look out for the use of sound and color to express Amy Adams' character's growth and change."
    },
    {
      "text": "Ciencia ficción de autor."
    },
    {
      "text": "A film about the importance of the language. The communication. And how the human beings react in front of the unknown. [Full review in Spanish]"
    },
    {
      "text": "Arrival is...filmmaker Denis Villeneuve's most hopeful film, one which strikes a balance between the dreadful tension of the unknown and the experience of redemption."
    },
    {
      "text": "It's a big concept, grippingly executed."
    },
    {
      "text": "Adams is the centerpiece in a film full of wonder and discovery. It's not to be missed."
    },
    {
      "text": "...refreshing and thought-provoking."
    },
    {
      "text": "While the VFX are very well done, they are just what the story needs and nothing over the top, not unlike the movie itself. The narrative is non-linear and intriguing but smooth."
    },
    {
      "text": "In part a response to Stanley Kubrick's heady masterpiece 2001: A Space Odyssey and equally a dissection of current world politics, Arrival is Villeneuve's most emotionally charged and visually curious film to date."
    },
    {
      "text": "I can't help but feel like the film is eventually a bit too clever for its own good"
    },
    {
      "text": "Arrival is genius technical filmmaking combined with a profound message -- that we are happy because we choose to live life despite its inevitability and predictability"
    },
    {
      "text": "Arrival is a great example of a simple concept executed to perfection."
    },
    {
      "text": "The fact of the matter is that no review can explain just how this film will affect you. This is more than a film. It is an experience. So go experience it."
    },
    {
      "text": "It's a film that demands to be re-seen almost as soon as it's finished. That's an arrival that's more than welcome."
    },
    {
      "text": "Arrival is a thoughtful take on the alien invasion genre, carried by an impactful performance from Amy Adams."
    },
    {
      "text": "What's heptapod for disappointing?"
    },
    {
      "text": "A nuanced exploration of legacy, compassionate worldviews, humanity (in both senses of the word), and -- most of all -- appreciating the finiteness of life."
    },
    {
      "text": "The storytelling is really well done, and it's shot so well...it looks gorgeous."
    },
    {
      "text": "When a movie makes us have a conversation like this afterward, it's worth seeing."
    },
    {
      "text": "Provokes the Sci-Fi normal blockbuster genre by having a great intellectual screenplay, brilliant cinematography, heart, and another great direction from Denis Villeneuve."
    },
    {
      "text": "Ultimately a love story, and anyone who prefers their science fiction to be dystopian or, you know, scientific, may prefer to steer clear of this sentimental picture about interstellar communication."
    },
    {
      "text": "The script, performances, and overall look combine to make for an engrossing, suspenseful drama that goes a little beyond the bounds of its science fiction genre."
    },
    {
      "text": "The director really allowed moments to breathe. As a viewer, you could feel the characters' emotions."
    },
    {
      "text": "Villeneuve and company change the game right in front of your eyes, and you don't realize it until the exact moment that you need to."
    },
    {
      "text": "It's a slow burn, but it doesn't feel like it needed to be fast...close to a perfect movie."
    },
    {
      "text": "Arrival transcends the limitations that so often govern the less creative examples of the subgenre, instead using it as a loose conceptual foundation upon which to build a theoretically-informed examination of what precisely ... makes us human."
    },
    {
      "text": "Despite an overly emotional narrative in order to ground the film in humanity, it is beautifully shot and designed, with an undercurrent of threat and a conclusion that is simultaneously baffling and amazing."
    },
    {
      "text": "Sicario director Denis Villenueve goes sci-fi in alien-invasion movie Arrival, and offers up a truly moving story about what makes us human."
    },
    {
      "text": "With this terrifying scale in the background, the quiet power of Adams' intelligent and graceful performance holds the center."
    },
    {
      "text": "What I loved most about this film is the take-home message: Communication is vital and when we stop communicating, everything can be lost."
    },
    {
      "text": "\"Arrival\"...is dynamic with a strong central character. Furthermore, it's the pondering thoughts it leaves us with in the end that are perhaps its most powerful asset."
    },
    {
      "text": "Arrival is a marvel of sublime imagery and overpowering sound design... Villeneuve wants to illuminate the process of immersion, and how learning something new can begin to change the way you think, dream and ultimately act."
    },
    {
      "text": "This may seem like a frivolous thing to take away from the film but after seeing women depicted in such a way for a long enough time, you start to pick up and appreciate when women are portrayed better."
    },
    {
      "text": "The movie is ultimately superb, though not perfect."
    },
    {
      "text": "Arrival is quite good."
    },
    {
      "text": "If you like a suspenseful tale that's both action-packed and thought-provoking, Arrival is exactly the right movie for you this weekend."
    },
    {
      "text": "Arrival does such a great job at crafting anticipation, and the payoff doesn't come until much later."
    },
    {
      "text": "A plot twist that make sense if you're high and caffeinated."
    },
    {
      "text": "Arrival is one of those films that awakens profound feeling. It is not just a science fiction film, but rather a story about beings and their ability to love unconditionally even if they are not from this planet. [Full Review in Spanish]"
    },
    {
      "text": "Simply a phenomenal, emotional rollercoaster of a movie that rightly deserves its spot as one of the finest movies of the past decade."
    },
    {
      "text": "Arrival is one of the most intriguing movies I've seen in 2016 -- great acting, great premise."
    },
    {
      "text": "Villeneuve, who thus remains in the realm of the futuristic, has an artist's touch, and the future of American cinema definitely includes his arrival."
    },
    {
      "text": "Arrival is another knockout from Villeneuve, and as fans of science fiction we should all be thrilled that he is the one tackling a Blade Runner sequel"
    },
    {
      "text": "Why is it that so many sci-fi heroines end up in their underwear? I wondered whether the sci-fi movie I was about to see would sexualize its female protagonist as well. I'm happy to report it doesn't."
    },
    {
      "text": "Villeneuve has failed to deliver anything near the emotional intensity of his previous work and the ever-dependable Adams can't save the film from some ponderous sci-fi noodling."
    },
    {
      "text": "Arrival couldn't have arrived (pun intended) at a better time."
    },
    {
      "text": "...this is a movie that will make you think..."
    },
    {
      "text": "The true purpose of these intelligent extra-terrestrial beings is a jaw-dropping reveal that warrants a repeat viewing to find all the breadcrumbs left in the lead up to the crescendo."
    },
    {
      "text": "It's intelligent, pleasingly complex and visually fascinating. In short, it's a sci-fi film for grown-ups, albeit, I should add, grown-ups of all ages."
    },
    {
      "text": "Arrival is the Platonic Ideal of mainstream filmmaking-a smart film that doesn't talk down to its audience and works as not only a science fiction film but also a thriller."
    },
    {
      "text": "... Villeneuve cleverly uses the oldest means at his disposal-montage and storytelling-to produce a film that, in however modest a way, represents a valid chapter in science fiction's cinematic evolution."
    },
    {
      "text": "... Arrival is an intimate and contemplative tale of one woman's journey of discovery while battling her own demons."
    },
    {
      "text": "... sometimes it's good when a film leaves you with more questions than answers when it's capable of doing so. That fact alone makes Arrival one of the best films of the year."
    },
    {
      "text": "As timely as Arrival feels, there's an element of timelessness in the film-a sense of the legitimately profound that marks a true masterpiece of science-fiction."
    },
    {
      "text": "In the event, this is a beautiful piece of filmmaking. The revelation is exhilarating, and it gives the viewer a sense of the profound."
    },
    {
      "text": "Denis Villeneuve's new film Arrival does not offer any answers. But it does offer something else - a brief reprieve from the time we are all currently stuck in."
    },
    {
      "text": "I think of Arrival in terms of color: the milky grays of the clouds rolling over the Montana plain; the bright blue of computer screens bouncing off the gray tents on the makeshift army compound."
    },
    {
      "text": "While earlier Villeneuve films such as Prisoners and Sicario dealt respectively with grief and rage, then ignorance and revenge, Arrival is ultimately hopeful and constantly emphasizing the possible unification of language."
    },
    {
      "text": "Arrival is an emotionally involving science-fiction drama, which in its mood of cosmic anxiety, is closer in spirit to Steven Soderbergh's Solaris remake than to Robert Zemeckis's New Age-y Contact, one of its obvious precursors."
    },
    {
      "text": "Arrival isn't exactly your typical alien movie -- it's so much better than that. This is a movie about how language actually influences the way you think and live your life."
    },
    {
      "text": "The level of intelligence and respect the film has for its audience is refreshing. Its moments of emotion (and there are whoppers) feel earned, not forced."
    },
    {
      "text": "Arrival is a sober, tender and optimistic film, held together by the director's offbeat but firm command of tone and his star's unswerving commitment."
    },
    {
      "text": "As I've said, I've seen Arrival three times-for critical and then therapeutic reasons-and it takes to the light differently with each revisit, much like the edgeless ships hovering over the earth's surface."
    },
    {
      "text": "Everything about Arrival feels meticulously crafted, from the gorgeously composed shots to the Jóhann Jóhannsson score."
    },
    {
      "text": "Most of it is masterfully assembled, with great near-wordless performances from Renner ... and especially Adams, who conveys everything we want from a hero without stepping outside the bounds of a fallible human."
    },
    {
      "text": "Like Contact and Interstellar before it, Arrival conflates inner and outer space, where contact with alien intelligence is the balm that heals one's own psychic wounds, a cosmic Oprah Winfrey delivering closure."
    },
    {
      "text": "Arrival is bold, emotionally-resonant and poignant. It's science fiction at its most beautiful with a finale that will simultaneously make your heart swell and break."
    },
    {
      "text": "Arrival is at its best early on, when everything is-figuratively speaking-up in the air."
    },
    {
      "text": "Arrival is the kind of science fiction film we dream of. It's got big stars, a bigger concept, and the longer it goes, the more it demands of its audience. The pacing is methodical, the story captivating, and filmmaking beautiful."
    },
    {
      "text": "Walks a delicate balance between science fiction spectacle and art house head trip."
    },
    {
      "text": "The result is a wondrous achievement, one that combines mystery and meaning in a way so rarely found in mainstream movies."
    },
    {
      "text": "... the most cerebral of first contact films, a science fiction drama about communicating across cultures and across species and even across time without a common language, while failing to communicate within our own world."
    },
    {
      "text": "Arrival is not classic flight-from-reality faire but it sure got me out of the doldrums."
    },
    {
      "text": "A yawn-inducing snoozefest that borrows from every science fiction film from The Day the Earth Stood Still to Contact...Those hungry for a good old-school, alien-based sci-fi adventure will decry the films lack of ray guns."
    },
    {
      "text": "A captivating story that presents an ideal to follow. It's not just one of the best sci-fi films, it's one of the best of 2016. Immensely recommended! [Full review in Spanish]"
    },
    {
      "text": "When it is good, it is really, really good but when it winds up going south, it does it so completely that it hardly seems possible that the same people could have been responsible for both halves."
    },
    {
      "text": "One of the most emotional and unforgettable cinematographic experiences of contemporary cinema. [Full review in Spanish]"
    },
    {
      "text": "Arrival has much more in common with E.T. than Invasion of the Saucer Men. And if we're being honest, it's not really about the aliens at all."
    },
    {
      "text": "No film like \"Arrival\" has accomplished the examination of the inherent importance of language..."
    },
    {
      "text": "A film that proposes a plausible scenario and delights in surprising us with different plot twists and fascinating discoveries by its protagonists. [Full review in Spanish]"
    },
    {
      "text": "Arrival, which aims to touch rather than to excite, looks inward. The film about aliens, it proposes, is in fact a way to look at the human race, the good and the bad in us (mostly the bad)."
    },
    {
      "text": "Like all good science fiction, Arrival is about one big idea taken to a satisfying conclusion."
    },
    {
      "text": "An unusually delicate tale about how to cope with an alien arrival on Earth."
    },
    {
      "text": "Though a second-rate, semi-profound art movie, Arrival is nonetheless an ambitious demonstration of how the media manipulate our perception and our experience."
    },
    {
      "text": "A Spielberg-Nolan lovechild of sorts, wondrous and mind-bending in equal parts, Denis Villeneuve's latest is a quintessential science-fiction blockbuster steeped in genre traditions and made singular by Amy Adams's transporting performance."
    },
    {
      "text": "Arrival may offer a few too many metaphors to keep some viewers engaged. But it's guaranteed to stick in your mind a fair amount longer than, say, Men in Black 3."
    },
    {
      "text": "It's remarkable how far Villeneuve, too, has travelled -- from minor but impressive Quebec features to big-budget filmmaking that's turned mainstream genre-fare into thrilling, atmosphere-rich cinema."
    },
    {
      "text": "The film is not a colourful one, with suitably muted cinematography and a sense of realism many such stories eschew. Maybe that's not the best news for the box-office but it makes for a more intelligent movie of the genre all the same."
    },
    {
      "text": "This film cements Villeneuve's reputation as one of the finest filmmakers of his time."
    },
    {
      "text": "In it's own way, this beautifully shot, brilliant acted and smartly written movie is as exciting as Independence Day or War of the Worlds."
    },
    {
      "text": "Arrival may not be the sci-fi movie we deserve, but it's the one we need right now."
    },
    {
      "text": "With Arrival, Villeneuve and Heisserer have delivered us the 2001: Space Odyssey (1968) of the new century. [Full review in Spanish]"
    },
    {
      "text": "Most aliens-on-Earth movies move towards destruction, usually of the planet-wide kind, but the crux of Arrival is creation: the writing of a word, the beginning of a bond, the start of a life."
    },
    {
      "text": "How to communicate? The challenge faced by every artist is dramatized as a semantic conundrum and amplified as an existential dilemma ('What is your purpose on Earth?') in this moody science fiction film."
    },
    {
      "text": "Don't go in thinking you can sit back, relax, and enjoy some action-heavy entertainment. Your mind will be put to work."
    },
    {
      "text": "A film that goes beyond everything and also combines in a masterly way its cerebral side with strong emotional roots. [Full review in Spanish]"
    },
    {
      "text": "In times when audiences are trained to be enamored by special effects and simplified narrative patterns, Arrival is an unusual discovery: a movie that requires us to think beyond the polished surface and contemplate our own place in the universe."
    },
    {
      "text": "Arrival's narrative takes an unbelievable turn (and I mean that in the best way possible), opening up the film's story in an emotional way that I was not expecting, leaving me absolutely stunned."
    },
    {
      "text": "A suspense film that turns out to be more complex and emotional than expected. [Full review in Spanish]"
    },
    {
      "text": "A film with a highly creative story, that genuinely questions human perception and explores the limits of science fiction. [Full review in Spanish]"
    },
    {
      "text": "Part of me wishes to deliver a serious and sober appreciation of Arrival, this year's big, grown-up science-fiction film."
    },
    {
      "text": "A fun movie puzzle in addition to being an emotional gutpunch."
    },
    {
      "text": "Deliberately paced but highly rewarding, Arrival ups its IQ with Jeremy Renner as a soulful physicist, gorgeous production design... and a poignant twist that brings the drama back to the human level."
    },
    {
      "text": "It's a film you'll want to discuss and debate with your friends. The message may not be original but the methodology certainly is. A movie doesn't have to spell everything out for me if I get a sense that the filmmaker is offering me something to ponder"
    },
    {
      "text": "Arrival is about the awakening and ensuing trauma discovering that we're not alone in the universe."
    },
    {
      "text": "... probably best described as humanist sci-fi. Like 'CE3K' and 'Contact' with Jodie Foster, this new arrival appears to be looking upward to the heavens, but its real target is the human heart."
    },
    {
      "text": "An aesthetically consistent film starring a ductile and magnetic actress. [Full review in Spanish]"
    },
    {
      "text": "A film that has a very special atmosphere and aesthetic, a slow pace and a voice-over that sounds poetic. [Full review in Spanish]"
    },
    {
      "text": "A film that deserves to be seen because it is not frequent to see such risky proposals, instead of others that seek to deliver what the consumer wants, painfully underestimating it. [Full review in Spanish]"
    },
    {
      "text": "Though well made and haunted by a score of primordial dissonance, Arrival is an orbiting piece that misses out on invading the deepest parts of the mind."
    },
    {
      "text": "For those who feel the emotional weight of Louise's story, Arrival pays off in a big way."
    },
    {
      "text": "Villeneuve creates a solemn mood that crescendos to the less than chilling climax to see if the world can work together in unity during a dire emergency."
    },
    {
      "text": "Arrival is gripping not only because of the ideas at play, or how they're conveyed via its stylistic choices, but how they rest on the shoulders of Adams."
    },
    {
      "text": "a powerful, deeply felt, wonderfully evocative film that will rightly takes its place on the mantle of great science fiction"
    },
    {
      "text": "Amy Adams anchors the film with one of her smartest performances, warm but not personal (she's a total professional) and quite believable as a thinker and expert communicator."
    },
    {
      "text": "Works like this are why we love going to the movies."
    },
    {
      "text": "Arrival is one of the best films of the year and probably, one of the best movies about extraterrestrial invasion ever made. [Full review in Spanish]"
    },
    {
      "text": "A film that speaks of opening the mind to understand others. A universal message more necessary than ever. The film comes at the right time, when it seems that we're sinning of an enormous susceptibility. [Full review in Spanish]"
    },
    {
      "text": "Arrival does what science fiction at its best should do: it make us look to the future in a way that allows us to think about the present in new ways."
    },
    {
      "text": "Arrival is an intelligent and a thought-provoking alien-invasion thriller which revels in its own complexity and manages strike all of the right chords, but for a few missteps."
    },
    {
      "text": "\"Arrival,\" remarkably, tugs at the emotions and intellect with equal insistence."
    },
    {
      "text": "It's a sci-fi film that borrows nearly all of its biggest ideas from other movies, leading up to an ending that's touching but contrived (Splice Today)"
    },
    {
      "text": "Awarding it a bag-full of Oscars come February would be too puny a recognition, too inconsequential; it deserves to be shown in museums, to governments, in schools. Missing it should be outlawed."
    },
    {
      "text": "An entertaining film that proves that Villeneuve can film science fiction without special effects and pyrotechnics to get our interest. [Full review in Spanish]"
    },
    {
      "text": "We are facing semiology as a transgressive tool of linear temporality. The semiotic conception of language as a start point to perceptual and circular appreciation of time. [Full review in Spanish]"
    },
    {
      "text": "Arrival is a very entertaining film and an emotional show of good cinema, at a dramatic, visual, sound and interpretive level. [Full review in Spanish]"
    },
    {
      "text": "Without giving too much away, Arrival is an innately hopeful and pacifistic movie. Louise's effort to understand the aliens, despite the fearful human reactions around her, makes a powerful case for communication over conflict."
    },
    {
      "text": "A slow-burning sci-fi drama that posits compelling questions while creating a fascinating way to tell its story."
    },
    {
      "text": "At its best, which is considerable, you also get astonishment, awe, and tempered optimism (which is always good to have), along with respect for the female Homo sapiens and pleasure in the filmmakers' powers of invention."
    },
    {
      "text": "The way one of the most exciting contemporary filmmakers plays with the narrative is an undeniable triumph. [Full review in Spanish]"
    },
    {
      "text": "Under the guidance of equally exceptional director/co-writer Denis Villeneuve (\"Sicario,\" \"Incendies\") this scientific thriller becomes smart, touching and, obviously, one of the year's best films."
    },
    {
      "text": "A movie imagined as life affirming that actually suggests that life may not be worth living at all."
    },
    {
      "text": "Packs a powerful payoff."
    },
    {
      "text": "At a moment of monumental transition and heightened anxiety arrives an existential alien invasion flick that's at once unapologetically cerebral and elegiacally emotional."
    },
    {
      "text": "A magnetic, brilliant and captivating film where the director knows how to tense the threads that unite the imagination of the spectator with the imagery of distant worlds. [Full review in Spanish]"
    },
    {
      "text": "Denis Villeneuve gives us what is, perhaps, the best sci-fi film of the year. [Full review in Spanish]"
    },
    {
      "text": "The result is a genuine sci-fi thinkpiece, challenging and exhilarating."
    },
    {
      "text": "Arrival is artsy, emotional and comes across like the result of Terrence Malick having spent a weekend watching Interstellar on a loop. It's full of questions, though, and a definite mindscrew that will leave you thinking about [it]."
    },
    {
      "text": "What is effective is that the camera rests on the actor's faces, rather than all the ruckus going on around them."
    },
    {
      "text": "One of the premier extraterrestrial films of the century."
    },
    {
      "text": "Beautifully shot and executed, though you might need a time machine to fully appreciate the one big alien movie trope it defies."
    },
    {
      "text": "Arrival should be required viewing of every living person on the planet."
    },
    {
      "text": "Science fiction and the woman's picture rarely collide, but here Villeneuve proves that they don't have to be exclusive from the other."
    },
    {
      "text": "A film that speaks of our present without making it evident, raising more questions than answers, and where Villeneuve's staging and Amy Adams' performance stands out most. [Full review in Spanish]"
    },
    {
      "text": "The movie insists on conversation, on communication, on sharing experience."
    },
    {
      "text": "Arrival is one of the best films of the year."
    },
    {
      "text": "A remarkable piece, at once a cerebral and emotional epic which I am still thinking about days after seeing it."
    },
    {
      "text": "Besides being one of the best movies of the year, Arrival is possibly also one of the best sci-fi films ever. Beautifully shot and well acted. Villeneuve doesn't disappoint. [Full review in Spanish]"
    },
    {
      "text": "Arrival makes an impassioned plea for the necessity of global cooperation while quite hilariously never straying from the perspective of its two white, American movie stars."
    },
    {
      "text": "In this year of bruising American politics, the film's emphasis on measured communication and focused listening feels transformative."
    },
    {
      "text": "Character development, big philosophical questions, and political relevance: not what you expect heading out to a creature feature, especially one with alien heptapods that look this threatening. But welcome all the same."
    },
    {
      "text": "If you want to think about intelligent life instead of blowing it up, Arrival may be the movie for you."
    },
    {
      "text": "This is, perhaps, the best-made movie in Villeneuve's filmography to date, a robust but delicate work captured in stunning, calculated detail by cinematographer Bradford Young, and guided by Adams' stellar work as Louise."
    },
    {
      "text": "[An] unshakable odyssey of sadness and hope from director Denis Villeneuve."
    },
    {
      "text": "It is a story aimed at an adult and intelligent audience featuring an adult and intelligent performance from Adams and Renner. ARRIVAL expects a lot from its audience at the same time it is giving more."
    },
    {
      "text": "Unlike most films of this ilk, it rejects the notion that life is tragic simply because it inevitably ends in death. This story embraces death, life, sickness, despair and love."
    },
    {
      "text": "A sobering sci-fi thriller about the race to communicate with intelligent alien life to avert disaster."
    },
    {
      "text": "Arrival champions the importance of being able to work with and understand one another without resorting to violence, even in the face of the oft-terrifying unknown -- particularly important in today's increasingly fractured global political climate."
    },
    {
      "text": "The revelation here is Villeneuve, who expands on the symphonic pacing showcased last year in the drug war drama Sicario. Even though the concept of Arrival is far-out fiction, Villeneuve treats it with no less detail or urgency."
    },
    {
      "text": "A film with a big budget and solid actors, that easily surpasses Gravity and Interestellar. [Full review in Spanish]"
    },
    {
      "text": "Octopuses from outer space can't begin to compete with Klaatu or ET."
    },
    {
      "text": "Whether [Villeneuve's] forbidding worldview will strike you as an achingly realistic drama or an overly angsty downer largely depends upon what you go to movies for in the first place."
    },
    {
      "text": "The best film of the year to date, ambitious in conception and extraordinary in execution, has arrived."
    },
    {
      "text": "Amy Adams is terrific in this cerebral but enthralling sci fi drama that turns out to be much much more than just another Alien movie."
    },
    {
      "text": "\"Arrival\" embarrasses the current mode of contemporary cinema to explore ideas, moods and a vision that belongs uniquely to this film."
    },
    {
      "text": "Stealthy signals, unforgettable moments and Johann Johannsson's score coalesce magnificently as an iconic classic of sci-fi cinema, something to cherish for life, is created before your eyes."
    },
    {
      "text": "Its visuals are remarkable and its storyline is so beautifully structured. Arrival is one of the most extraordinary, breathtaking, and thought provoking films of the year. This is what science fiction is supposed to be."
    },
    {
      "text": "An intellect-stroking sci-fi film that asks you to imagine how humanity might respond, emotionally rather than militarily, in the event of an arrival from outer space."
    },
    {
      "text": "Arrival may be just the poem we need; a departure from the dystopian visions which now appear all too real, a memory of a future in which light still shines in the darkness."
    },
    {
      "text": "...there is enough incomprehensibility to give you 'The Day the Earth Stood Still Meets 'Last Year at Marienbad.' Despite the fact that it's utter nonsense, you don't have to completely follow or accept what happens to enjoy it."
    },
    {
      "text": "The Chomsky-esque notions that language shapes our thinking even more than our thinking shapes language is conveyed in the film's own structure as well as its dialog."
    },
    {
      "text": "A superb exercise in the things that make the genre great, and a sign that \"smart sci-fi\" isn't going anywhere."
    },
    {
      "text": "Villeneuve uses sci-fi the way it's meant to be used in melding the metaphysical and the metaphoric into a timely tapestry that echoes our turbulent times."
    },
    {
      "text": "Hokey malarkey."
    },
    {
      "text": "One of the year's best!"
    },
    {
      "text": "A film that transcends the label of mere entertainment to raise a series of intriguing reflections on the importance of language and communication. [Full review in Spanish]"
    },
    {
      "text": "Takes its focus away from the invaders - for the most part - and shines it directly on human character and the questions of what might happen if we actually tried to communicate and solve the puzzle of our differences with brains, rather than brawn."
    },
    {
      "text": "If The Day the Earth Stood still (the original) were silly and derivative, this would be it. Bodes unwell for Blade Runner sequel."
    },
    {
      "text": "[Villeneuve creates] a mood of lingering unease, crafting a series of immense images set to the orchestral dread of Jóhann Jóhannsson's score that powerfully suggest the mystery at hand without indulging in obvious instincts."
    },
    {
      "text": "Arrival is not out primarily to thrill or frighten. It asks viewers instead to watch, think and reflect. It should be worth it -- if you give it time."
    },
    {
      "text": "Learning Heptapodese seems easy compared to the tough talks Americans need to have with each other."
    },
    {
      "text": "The movie engaged my brain. But it didn't capture my heart or stir my soul. (Full Content Review for Parents - Violence, Profanity, etc. - also Available)"
    },
    {
      "text": "With a \"you fill in the holes\" plot, and a must film in the dark mentality, \"Arrival\" is D. O. A."
    },
    {
      "text": "Arrival is a smart tale of alien contact that boasts great visuals and performances, if also more brains than heart."
    },
    {
      "text": "The movie is slow, but not in a dull sense. It is a brainy, step-by-step primer on learning how to reach out and begin an exchange of ideas between two vastly different life forms in a peaceful and constructive manner."
    },
    {
      "text": "Arrival is one of the best movies of the year, a moving, gripping film with startling twists and imagery. It deserves serious treatment as a work of art."
    },
    {
      "text": "Arrival is one of those movies with nary a wasted word; fitting, given the subject matter."
    },
    {
      "text": "With Arrival, Villeneuve finally finds a subject, and a script, whose magnitude matches the weight he assigns to it. All it took was an alien species' appearance on Earth."
    },
    {
      "text": "Those expecting a whiz-bang film should be prepared for a more cerebral and emotional experience, admirable for its ambition and tone, if not wholly satisfying in its payoff."
    },
    {
      "text": "We need more science fiction films like this. And given that Villeneuve is currently filming the long-awaited sequel to Blade Runner, we should now feel assured that project is in the right hands."
    },
    {
      "text": "Arrival plays with your head as gently as any sci-fi thriller I can remember."
    },
    {
      "text": "\"Arrival\" is high-minded sci-fi at its best and lands as one of the best movies of the year."
    },
    {
      "text": "Amy Adams grounds the film with a solidly engaging performance."
    },
    {
      "text": "Arrival has the look and feel of a big-ticket production, albeit torqued towards millennial melancholy, complete with a muted, blue-grey colour palette by cinematographer Bradford Young."
    },
    {
      "text": "Watching it, I was excited that such a strange piece of science fiction got made-and disappointed ..."
    },
    {
      "text": "So bang a gong. This one goes deep, and the ambient whale-like pulses of bass on the soundtrack provide the perfect score for a journey that not only satisfies any latent science-fiction craving, it may well reboot your subconscious with a jolt of love."
    },
    {
      "text": "Denis Villeneuve's latest is an artier - certainly moodier and less entertaining - version of M. Night Shyamalan's Signs."
    },
    {
      "text": "Villeneuve [delivers] a motion picture that reaches into the heavens in an attempt to grab hold of the stars, [and] the fact it comes close to doing just that cause for celebration."
    },
    {
      "text": "Avoids sloppy sentimentalism and gives the most probable contact with other beings we will likely encounter."
    },
    {
      "text": "Visually the film is as impressive as you may wish, and the sense of unease is augmented by the offbeat music score by Johann Johannsson."
    },
    {
      "text": "Decent sci-fi that wanders a bit and is kinda slow but it's darkness helps keep your interest and while good but not great, it at least is not dead on arrival."
    },
    {
      "text": "Villeneuve's indulgence in mood and melancholy mount to a conclusion that wastes its compelling premise and wallows in infuriatingly all-consuming sentimentality."
    },
    {
      "text": "It's difficult to get worked into a state of awe with this film because so much of it is so sodden."
    },
    {
      "text": "Adams' acting is masterful: she is strong, raw and vulnerable, a beating heart in the bloody mess of humanity's fear. It's a powerhouse performance in a stunning film that transcends genre to become art."
    },
    {
      "text": "A strikingly human film, one that's concerned much more with the feebleness of language and the fragility of time than with its mysterious extraterrestrial visitors."
    },
    {
      "text": "It's easy to say that Denis Villeneuve's tingly sci-fi Arrival is a whole lot of Spielberg with a little bit of Tarkovsky thrown in, but what's remarkable is how much it actually defies the conventions of its genre."
    },
    {
      "text": "Arrival is a first-rate story about first contact because it meets that great science-fiction movie test: It's less about who they are and more about who we are."
    },
    {
      "text": "Words have meaning, Arrival reminds us, and communication is the way forward for humanity, especially in times of great uncertainty when the world seems to be at a crisis point."
    },
    {
      "text": "Even when the plot has you shaking your head, expect to be moved."
    },
    {
      "text": "The real triumph of Arrival, though, is its commitment to the complexity of time and language."
    },
    {
      "text": "In the realm of big screen science fiction, \"Arrival\" feels like a mix of 2001: A Space Odyssey with a generous dose of Close Encounters of the Third Kind."
    },
    {
      "text": "... this is a hopeful tale despite it's forlorn air, one where a linguist is the hero at the end of the day, where the answer to peace is obvious and the notion that despite terrible loss, life goes on, life still exists and it will be remembered."
    },
    {
      "text": "A viewing experience that's filled with as much frustration as it is with awe."
    },
    {
      "text": "Arrival is a magnificently made movie and likely the best I've seen so far this year. See it as soon as possible and on as big a screen as you can. You don't want to miss out."
    },
    {
      "text": "When it comes to a payoff for all the gauzy head-scratching, Arrival reverts to a few basic sci-fi conventions for its finish."
    },
    {
      "text": "A thinking human's alien-invasion movie..."
    },
    {
      "text": "For a film about resolving communication gaps, ARRIVAL creates too many of them."
    },
    {
      "text": "The title works on another level, signifying the emergence of a fascinating new filmmaking talent."
    },
    {
      "text": "You'll admire Arrival far more than you'll love it."
    },
    {
      "text": "A wonderfully complex, heartfelt tale in the midst of an encounter with the unknown. One of the smartest sci-fi films to come around in years and lands as one of 2016's best."
    },
    {
      "text": "Arrival, though consistently watchable, is rarely as compelling or engrossing as one might've anticipated..."
    },
    {
      "text": "Amy Adams is a miracle worker-she makes us believe in this mesmerizing mindbender about alien communication, directed with searching mind and heart by Denis Villeneuve."
    },
    {
      "text": "This science fiction is a rarity, a cerebral film that will break your heart while expanding your mind."
    },
    {
      "text": "A twisty, cerebral drama that just happens to involve aliens, Denis Villeneuve's film is a truly beguiling take on both the sci-fi canon and what, exactly, a grown-up Hollywood film is supposed to be."
    },
    {
      "text": "It doesn't pack the punch you'd expect from an alien invasion movie; it aims higher, and in the end, it cuts deeper."
    },
    {
      "text": "Would first contact play out as imagined by Close Encounters of the Third Kind or with the gung-ho bluster of Independence Day? Denis Villeneuve's intelligent and humane sci-fi drama Arrival definitely flies the flag for the former camp."
    },
    {
      "text": "A profoundly moving, beautifully made story that presents a timely message about the importance of communication and understanding."
    },
    {
      "text": "This is science fiction for grown-ups, ready to follow three-dimensional characters grappling with deep ideas."
    },
    {
      "text": "Remarkably compelling and, at times, cosmically moving."
    },
    {
      "text": "[Villenueve has] a keen appreciation of film's ability to get at hidden truths."
    },
    {
      "text": "When it comes to welding audiences to their seats, Denis Villeneuve is on one almighty run."
    },
    {
      "text": "This sci-fi drama has an enjoyably brain-bending plot that leaves the audience almost stunned with the weight of its themes."
    },
    {
      "text": "If Arrival's ending is a little too upbeat and the explanations for the fractured narrative leave one a bit puzzled, it's still a worthy attempt to refresh a familiar story."
    },
    {
      "text": "Denis Villeneuve makes this directing lark look easy - whatever the genre he seems to effortlessly step up to the plate and deliver the goods."
    },
    {
      "text": "Sci-fi with a big emotional sweep is tough to get right."
    },
    {
      "text": "You can pick holes in the plot if you examine it closely but Arrival is so well made and acted that you are willing to suspend your disbelief, engage your little grey cells and savour one of the smarter screen epics we've seen in quite a while."
    },
    {
      "text": "By turns inviting and opaque, Ms. Adams turns softness and quiet into heroic qualities, keeping her voice low, modulated, and using stillness to draw you near."
    },
    {
      "text": "An interesting study on contemporary themes explained through science fiction and a monumental achievement for its director. [Full review in Spanish]"
    },
    {
      "text": "A film with a slow pace and sometimes, almost contemplative. It's a hypnotic movie that must be seen more than once. [Full review in Spanish]"
    },
    {
      "text": "Arrival, like the Spielberg classic it aspires to, brings the beyond to us. In doing so, it asks a challenging, prescient question: Are we ready to teach, and ready to learn?"
    },
    {
      "text": "[Amy Adams] gives Arrival the humanity that turns an interesting piece of science fiction into something that's grand beyond words."
    },
    {
      "text": "Arrival is grand, technically marvelous, solemn, spooky, somewhat unbelievable and sometimes unfathomable. Who is to say alien visitation will be any different?"
    },
    {
      "text": "Arrival fulfills on an entertainment level while feeding the mind and soul."
    },
    {
      "text": "\"Arrival\" makes a moving case that we've only scratched the surface of what we think is possible - and what we define as intelligence."
    },
    {
      "text": "Without [Adams], Arrival becomes an arid and talky exercise, but thanks to her remarkable efforts, this thoughtful science-fiction epic has human warmth at its core."
    },
    {
      "text": "Denis Villeneuve is fast becoming the go-to director for intelligent cinema; someone capable of traversing genre and putting his own stamp on things."
    },
    {
      "text": "If you're yearning for a smart, thoughtful sci-fi film that wonders how first contact with aliens might go down, this tight little gem of a film is a gift from beyond the stars."
    },
    {
      "text": "...belongs to the cinematic tradition of philosophical space flicks that ultimately turn inward."
    },
    {
      "text": "Villeneuve, cinematographer Bradford Young, composer Jóhann Jóhannsson and editor Joe Walker dole out information and color it in knowing ways, building to third act revelations that make for profoundly moving film-making."
    },
    {
      "text": "I won't describe the aliens in detail here because the reveal is 87.4 per cent of the fun. I will say only that they're monstrous but also strangely balletic and tender."
    },
    {
      "text": "Johan Johannsson's sonorous score is lovely; the performers spot on; and the philosophical concerns deep enough to confuse Christopher Nolan."
    },
    {
      "text": "Where Close Encounters of the Third Kind gazed outward in awe at the universe, Arrival asks only how its mysteries might provide succour and illumination for us."
    },
    {
      "text": "Through Adams and Renner's performances, we share dread, wonder, frustration, panic and transcendence as they begin to interact with the \"Heptapod\" aliens that evoke memories of the work of H.G. Wells and John Wyndham."
    },
    {
      "text": "That \"Arrival\" works so well is in large part due to Adams, whose fear/eagerness in confronting beings from another world registers squarely with viewers. She can project deep emotions with a minimum of expression. It's all in the eyes."
    },
    {
      "text": "Exquisitely structured in surprising ways which only gradually reveal themselves, \"Arrival\" proves thoroughly mesmerizing. Conventional action is kept to a minimum, yet 2016 has scarcely seen such an exciting film. A hauntingly brilliant tour de force."
    },
    {
      "text": "It is simultaneously old and new, revisiting many of these alien-invasion conventions but with unexpected intelligence, visual style and heart."
    },
    {
      "text": "What's remarkable about Arrival is its contemplative core -- and, of course, Ms. Adams's star performance, which is no less impassioned for being self-effacing."
    },
    {
      "text": "Arrival is the latest in a long line of \"first contact\" sci-fi stories, and yet regardless of its familiar premise, its achievements are unique."
    },
    {
      "text": "Much of the film sees the camera focusing on Adams' face as her character studies and examines the aliens and their language. The beautiful subtleties of her performance depict what she's seeing and thinking, often without her using any words at all."
    },
    {
      "text": "How far from reality is this hypothetical scenario? It doesn't seem too far removed..."
    },
    {
      "text": "Yes, there is something resembling a traditional climax, but it doesn't come at the expense of the ethereal tone established by Villeneuve. In this time of political upheaval, it's a welcome tonic."
    },
    {
      "text": "A familiar story about a close encounter, though well crafted and unusually moody."
    },
    {
      "text": "Don't worry if you can't follow every detail... Just go along for the ride with Adams, a genuinely great screen actress who anchors this movie with a beautiful, deep-souled performance that should be up for all the major prizes."
    },
    {
      "text": "After a mildly bumpy middle, the ending lands emotionally and safely in a surprisingly beautiful and satisfying climax."
    },
    {
      "text": "In its low-key lyricism with glimpses into the epiphanic, this is a beautifully controlled movie."
    },
    {
      "text": "More brain-teaser than action film, this is an elegantly-wrought piece of thinking-person's science fiction...that plays with convention in unexpected and enthralling ways."
    },
    {
      "text": "ARRIVAL is likely to become a modern day sci-fi classic."
    },
    {
      "text": "By the time it ends, Arrival is a story that could only be told in the science-fiction genre, and the result is a beautiful narrative that you find has been telling you things about itself without you ever realizing it."
    },
    {
      "text": "Fine, full-bodied filmmaking, with a sense of the alien-ness out there in the universe that flatters our intelligence while making us feel tantalizingly small."
    },
    {
      "text": "Arrival is not a linear adventure of the mind, and it is a film probably best seen twice."
    },
    {
      "text": "Muted, measured and meditative, \"Arrival\" brings taste and restraint to a genre in the midst of a mini golden age: It comes in peace."
    },
    {
      "text": "Working from a screenplay by Eric Heisserer, director Denis Villeneuve creates a richly imagined world in which the theme of extraterrestrial outreach is addressed with a refreshing dignity."
    },
    {
      "text": "[A] terrific, haunting film that plays with our expectations - and rewards us with satisfying left turns."
    },
    {
      "text": "Villeneuve draws on Close Encounters of the Third Kind for his portrayal of scientists and soldiers groping for answers and, more generally, of the celestial playing out in highly personal terms."
    },
    {
      "text": "Amy Adams is spot on in the lead role, admirably keeping the story on track and not seizing a flashy scene for the consideration of Oscar voters. She does everything right."
    },
    {
      "text": "One of a handful of movies that have legitimately fooled me; not with an abrupt twist but a dawning awareness of where it's going thematically, how deeply and how distanced from sci-fi as usual."
    },
    {
      "text": "What really stays stuck in your memory long after the movie has ended and the world has been saved, or just as likely not, is the ache at the heart of the world Villeneuve has created."
    },
    {
      "text": "An alien-invasion fantasy that operates within the genre at the same time as it subverts it - large-scale movie-star sci-fi filtered through the tricky, esoteric lens of art-house cinema."
    },
    {
      "text": "\"Arrival\" is the sort of superficially profound movie that initially seems deep and weighty but stops making sense the moment you put down the bong."
    },
    {
      "text": "Ostensibly an alien story, \"Arrival\" tackles, with confidence and clarity, conflict in whether mankind will acquiesce or aggress, come together or cloister tighter, compromise or collapse. Here is a masterwork of both the moment and the millennium."
    },
    {
      "text": "A whip-smart sci-fi movie that powers through strongly and confidently on character, an emotional human story and a performance, instead of special effects."
    },
    {
      "text": "Arrival is arguably the most emotional, thought-provoking and visceral experience [Villeneuve has] crafted yet."
    },
    {
      "text": "Arrival is at its best when pregnant with the suspense of the possible, when the unidentified stationary objects bear no trace of their intentions. But the film becomes less intriguing as the story's direction moves from teasingly opaque to crystal-clear."
    },
    {
      "text": "Arrival has come, like a visitor from the cosmos, to blow minds and break hearts."
    },
    {
      "text": "So much of the pleasure of Denis Villeneuve's poignant science-fiction drama \"Arrival\" lies in watching Amy Adams figure things out."
    },
    {
      "text": "Remember all that crap at the end of Interstellar where it tried to get clever but failed horribly? This pulls it off."
    },
    {
      "text": "A terrific example of how to put the 'science' back into 'sci-fi' without compromising pace or action."
    },
    {
      "text": "Feels deeply, cloyingly influenced by others. It's the last act of Close Encounters of the Third Kind meets Contact meets Inception / Interstellar meets The Tree of Life ... tries too hard to make you cry to actually make you cry."
    },
    {
      "text": "If Arrival succeeds at the box office, it will shine as a beacon in favor of not dumbing down every production to appease the distracted and disinterested masses."
    },
    {
      "text": "Arrival is at once majestic and melancholy. It's a grand endeavor, and Adams, at the center of it all, brings pluck and smarts and a deep-seated sorrow to her role. This is her movie, no doubt."
    },
    {
      "text": "Arrival never fully escapes from the bounds of its source material."
    },
    {
      "text": "It can seem at times intellectually impenetrable and breathily pretentious. But a movie that makes you think? What a novel idea."
    },
    {
      "text": "[Adams] delivers a heart-wrenchingly beautiful performance using her ability to communicate a half-dozen emotions just standing still... But director Denis Villeneuve sometimes gets lost in repetition and blind alleys."
    },
    {
      "text": "Adams' performance as Dr Louise Banks is terrific. She's the affecting emotional core of this. Especially once she starts her own close encounters with the inhabitants of the ship hovering above rural Montana."
    },
    {
      "text": "Elegant and ambitious, this sci-fi mystery is designed to take on life's biggest questions in the most intimate way."
    },
    {
      "text": "This deeply thoughtful, profoundly compassionate sci-fi movie beautifully mixes realism with a sense of wonder. It keeps its mysteries at bay, and, amazingly, doesn't disappoint when all is revealed."
    },
    {
      "text": "This rather wonderful science-fiction drama is very much a next-century companion piece to Steven Spielberg's 1977 classic Close Encounters Of the Third Kind."
    },
    {
      "text": "Arrival is reaching for something it can't quite grab hold of. But it comes a whole lot closer than most."
    },
    {
      "text": "Arrival is a weird flick, slow and tedious, too metaphysical for Rod Serling's The Twilight Zone and most likely to appeal to people who like to play video games and solve puzzles."
    },
    {
      "text": "...[A] message drama disguised as a science-fiction adventure. Somber and slow-paced, it has been engineered more for the mainstream than fanboys."
    },
    {
      "text": "Adams is convincing and smart-seeming, bringing appropriate queasiness to the position of being a college professor drawn into a rough military world."
    },
    {
      "text": "...a more thoughtful, more intelligent science fiction film than the mainstream usually offers."
    },
    {
      "text": "No writer or wordsmith or anyone who has studied language will be able to resist this film. In the eyes of Arrival, language can do more than connect disparate peoples, but change our very perspective on everything."
    },
    {
      "text": "Arrival is unlike any science fiction film you have seen. It builds like a slow boil into a deeply cerebral, emotionally expansive journey."
    },
    {
      "text": "Arrival arrives at a good time, as something of a salve for the ugly discourse going on and a reminder to us that thinking big is really worthwhile."
    },
    {
      "text": "I have seen no movie to which I felt more deeply connected this year. But I won't tell you exactly why. To discuss most particulars of this movie is to defeat its purpose."
    },
    {
      "text": "A science-fiction masterpiece that's largely about our perceptions of time and our struggles to communicate...unexpectedly romantic and profound in its deeper concerns, by exploring the happy-sad nature of existence itself, of being born to die."
    },
    {
      "text": "Intelligent, intense, grownup science fiction that will thrill genre lovers and satisfy fans of moving human drama. A beautiful, thought-provoking film."
    },
    {
      "text": "Enlightening, inspiring, sci-fi allegory for our times - one of the year's best!"
    },
    {
      "text": "Don't be dismayed if you can't grasp every plot point quickly and easily. The images you see and things you hear need time to ruminate and be savored."
    },
    {
      "text": "The film develops an emotional undercurrent that becomes properly overwhelming in the final reel."
    },
    {
      "text": "The sci-fi thriller not only subverts expectations in brilliant ways, it explores deeply felt themes of life, loss and love. In other words, it's light-years away from Independence Day 3."
    },
    {
      "text": "The film's searching images counterpoint the hyper-articulate methodology of its characters' sense of imbalance and uncertainty."
    },
    {
      "text": "Arrival deserves our attention for being one of the best-paced, expertly shot and awe-inspiring sci-fi dramas to arrive in theaters in quite some time."
    },
    {
      "text": "Arrival is such a beautiful and thought-provoking film that it almost singlehandedly makes up for every bad aliens-coming-to-Earth film you've ever seen."
    },
    {
      "text": "Much of Arrival - the part that sticks closest to its source, egghead sci-fi cult figure Ted Chiang's \"Story of Your Life\" - is an eerie, tantalizing, altogether superb puzzler."
    },
    {
      "text": "Cerebral sci-fi with a Spielbergian sense of wonder."
    },
    {
      "text": "Arrival has its heart in the right place. Who doesn't want smart sci-fi? Who wants to argue with a big budget drama about linguistics? And though the film is not more than sum of its parts, well, those parts are pretty great."
    },
    {
      "text": "Arrival is an alien invasion movie for grown-ups; one that's lacking in action, explosions and all-out war, but heavy on tension, drama, and raw emotion."
    },
    {
      "text": "Atmospheric and thoughtful, it's an ideal choice to introduce hard sci-fi to a wider audience."
    },
    {
      "text": "If you like thoughtful, cerebral sci-fi films that are driven by ideas, you will be in for a treat."
    },
    {
      "text": "A linguist, a physicist and a colonel walk into an alien spaceship. No joke. Just brilliance... Arrival is miraculous."
    },
    {
      "text": "Brainy yet expensive, \"Arrival\" flaunts its hope to be more like \"Close Encounters of the Third Kind\": slow, measured and filled with moments where the audience is supposed to collectively hush, open their jaws in unison and go awe."
    },
    {
      "text": "It has big ideas and an unconventional structure, and it is rather engaging when it dives deep into the trade of language translation."
    },
    {
      "text": "This isn't Close Encounters's wonder about the vastness of the universe; it's something trickier and more bittersweet about how we make our life decisions."
    },
    {
      "text": "Given that personal trauma is the prevailing throughline of Denis Villeneuve's filmmaking career so far, it's no surprise to find Arrival anchored by a familiar narrative motif."
    },
    {
      "text": "So sure is the stride of the narrative, and so bracing the air of expectation, that you feel yourself, like Louise, beginning to spin, and barely able to catch your breath."
    },
    {
      "text": "For fans of dark, cerebral, Christopher Nolan type sci-fi or even time-related sci-fi this will be right up your alley."
    },
    {
      "text": "In a breathtaking performance, Amy Adams grounds this hypnotizing sci-fi drama from Incendies director Denis Villeneuve, in which communication, purpose and time are key"
    },
    {
      "text": "For most of its running time, Arrival is entrancing, intimate, and moving - a sci-fi movie that looks not up at the stars but rather deep within."
    },
    {
      "text": "Manages to transcend its genre elements and get to the heart of our existence. It exemplifies the power of love and sorrow to work as markers for our lives."
    },
    {
      "text": "Arrival is Villeneuve's The Day The Earth Stood Still or Close Encounters Of The Third Kind, and somehow he makes it true to the tropes while also feeling like something new."
    },
    {
      "text": "An intense film that make us consider not only what it means the arrival of the visitors, but how this will alter our reality. [Full review in Spanish]"
    },
    {
      "text": "An outstanding sci-fi film with an intergalactic language lesson."
    },
    {
      "text": "With performances that have spanned a vast net of quirky and strong supporting players (i.e. \"Junebug\" and \"The Fighter\"), Amy Adams has emerged as a fully realized leading lady."
    },
    {
      "text": "The themes of the film are intricate, navigating ideas of love, loss and perception but Eric Heisserer - adapting from the short story The Story Of Your Life by Ted Chiang - keeps the exposition manageable."
    },
    {
      "text": "A super-smart sci-fi that'll blow your mind and have you on the edge of your seat without recourse to explosions or souped-up fighter jets."
    },
    {
      "text": "All this theoretical stuff is offset by some nicely unfussy performances... Still, the flick could use a little less conversation and a little more action."
    },
    {
      "text": "Denis Villeneuve's Arrival is that rare beast: an awe-inspiring sci-fi that delivers both spectacle and smarts."
    },
    {
      "text": "[Villeneuve] pushes the boundaries on what a sci-fi film really can be."
    },
    {
      "text": "Some grossly overstated dialogue keeps an immensely fascinating story and inventive visualization of a human-alien struggle to communicate from touching our tenderest sci-fi cinema soft-spots."
    },
    {
      "text": "A captivating story about an admirable protagonist in a fantastic position at the heart of a wonderful situation could actually make the world a better place."
    },
    {
      "text": "It celebrates the very best traits of humanity ... while also encouraging us to confront life's biggest questions. This is filmmaking at its most powerful and profound."
    },
    {
      "text": "Arrival can be mentioned in the same breath as 2001, Solaris and Contact. [Full review in Portuguese.]"
    },
    {
      "text": "Like all the best sci-fi, Arrival isn't really about aliens. It's about people. It's about ideas. But instead of hammering you over the head with those ideas in a bid to show how clever-clever it is, the film lets the story and characters do the talking."
    },
    {
      "text": "Denis Villeneuve's latest is smart, hopeful, and intimately devastating science fiction."
    },
    {
      "text": "Arrival is one of the best films of the year."
    },
    {
      "text": "The sheer emotional heft is downright staggering. Movies like this are what I'm here for."
    },
    {
      "text": "With Arrival, Denis Villeneuve communicates the wonder of a Steven Spielberg alien movie within a decidedly hard sci-fi milieu."
    },
    {
      "text": "A film of rare vision and beauty, Arrival is easily the most intelligent blockbuster released this year-and maybe any year."
    },
    {
      "text": "Watching Adams attempt to teach the aliens English is remarkably gripping, aided by some genuinely breath-taking shots."
    },
    {
      "text": "The combination of science and emotions that Nolan wanted to deeply explore with Interstellar, it's fully reached in this film. [Full review in Spanish]"
    },
    {
      "text": "Arrival proves to be much more than the standard first contact flick, and Villeneuve maintains his track record of turning all expectations of genre on their head."
    },
    {
      "text": "The kind of movie that Christopher Nolan wanted to accomplish with Interstellar. [Full review in Spanish]"
    },
    {
      "text": "An existentialist and theorical film similar to Inception or Interestellar. [Full review in Spanish]"
    },
    {
      "text": "Quite simply, Arrival is one of the most extraordinary, affecting films of the year, a delicate balance between intellect and passion, finding ways to entertain while opening one's mind up to possibilities."
    },
    {
      "text": "The extraordinary success of Arrival is that it combines its bravura style and grand sci-fi questions with tremendous emotional intelligence and a heart so full it's ready to burst."
    },
    {
      "text": "Sophisticated sci-fi - stunningly well-crafted and acted."
    },
    {
      "text": "Be patient. Arrival falls just short of perfect thanks to an expositional hiccup midway through the film and a climax that hinges on a borderline-hokey revelation, but the end will more than justify these ever so slightly sloppy means."
    },
    {
      "text": "Villeneuve has crafted a compelling tale which explores humanity's flaws, our own fears and impatience, in a way that is scarily realistic."
    },
    {
      "text": "Arrival challenges viewers to a brainier sci-fi conundrum than they're used to, which makes for an intellectual breath of fresh air."
    },
    {
      "text": "Arrival is quite pretentious ... but it's the good kind. It's the smart kind."
    },
    {
      "text": "A film that forces viewers to reconsider that which makes us truly human, and the impact of grief on that timeline of existence."
    },
    {
      "text": "A cerebral and emotionally resonant examination of language through the genre of science fiction."
    },
    {
      "text": "This is hard science fiction made by an artist - which means big questions, impossible concepts and difficult choices."
    },
    {
      "text": "It's heartening to encounter a science fiction thriller that is ready to deal with abstract ideas."
    },
    {
      "text": "Arrival has the heft of a literary airport novel, with enough poetry and pathos to elevate it above Michael Crichton."
    },
    {
      "text": "Arrival is a smart film, but it's not a cold or clinical one."
    },
    {
      "text": "It's the fulfillment of what great fiction can do, particularly genre fiction."
    },
    {
      "text": "For a film about language, Villeneuve smartly relies most on the cinematic language: cinematography, production design, visual effects and musical scoring. His collaborators flex some of the best work of the year in every cinematic realm."
    },
    {
      "text": "Less Close Encounters of the Third Kind and more Linguistic Encounters of the Academic Kind, this is a sci-fi movie with intelligence, cerebral and emotional."
    },
    {
      "text": "It's ingenious, and brilliantly directed, shot and scored, all of which bodes well for Villeneuve's next project, a keenly-awaited sequel to 1982's Blade Runner."
    },
    {
      "text": "Compellingly made, this is science fiction of substance, which is promising for the forthcoming new Blade Runner."
    },
    {
      "text": "Plenty of smart ideas and bravura visuals."
    },
    {
      "text": "Arrival gives us a lot to take in, and the picture is big, somber and grand, if in the end somewhat sterile."
    },
    {
      "text": "Beautiful, provocative allegory that can bump your whole worldview off balance."
    },
    {
      "text": "A high-stakes, hard sci-fi action film."
    },
    {
      "text": "Arrival is a close encounter with the best of intelligent, thoughtful science fiction."
    },
    {
      "text": "Both heartfelt and very entertaining."
    },
    {
      "text": "It's a monolith, a megalith, but like the gigantic alien craft that comes to rest somewhere above Montana at the start of the film, despite its immensity it hovers elegantly overhead. The film defies gravity."
    },
    {
      "text": "Anchored by an internalized performance from Amy Adams rich in emotional depth, this is a grownup sci-fi drama that sustains fear and tension while striking affecting chords on love and loss."
    },
    {
      "text": "In a crowded genre, Villeneuve's picture is distinguished chiefly for being so richly realised and executed, gifted with an almost symbiotic score by his regular collaborator Johann Johannsson."
    },
    {
      "text": "A fairly chilly, cerebral bit of business, from its beautifully tamped-down cinematography (by modern master Bradford Young) to Jóhann Jóhannsson's ethereal score."
    }
  ],
  "release_year": 2016,
  "duration": 116,
  "genres": [
    "Sci-Fi",
    "Mystery & Thriller",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Linguistics professor Louise Banks (Amy Adams) leads an elite team of investigators when gigantic spaceships touch down in 12 locations around the world. As nations teeter on the verge of global war, Banks and her crew must race against time to find a way to communicate with the extraterrestrial visitors. Hoping to unravel the mystery, she takes a chance that could threaten her life and quite possibly all of mankind.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/x2FJsf1ElAgr63Y3PNPtJrcmpoe.jpg"
}