{
  "movie_name": "Back to the Future",
  "movie_id": "back_to_the_future",
  "total_reviews": 102,
  "reviews": [
    {
      "text": "Robert Zemeckis' rip-roaring sci-fi comedy classic still holds up four decades on from its release and is a fitting reminder of the power of love."
    },
    {
      "text": "Strip away the sci-fi, and this trilogy is a tale as old as time. It's a classic hero's journey, the story of someone growing up and discovering where his power really lies."
    },
    {
      "text": "The ultimate American summer blockbuster. Incredibly clever, nostalgia-packed, and never gets old. To sum up BTTF in one line: \"Last night Darth Vadar came down from the planet Vulcan and said if I didn't ask Lorraine to the dance, he'd melt my brain!!!\""
    },
    {
      "text": "It remains the best of the series."
    },
    {
      "text": "Glover's George McFly is the sweetest portrait of teen klutziness ever seen."
    },
    {
      "text": "Finally, here it is the first unadulterated pleasure of the summer. Back to the Future is a kick-off-your-shoes, settle-back-in-the-seat movie of abundant humor, boundless energy, and a relentlessly good heart."
    },
    {
      "text": "What pushes Back to the Future over the edge from so-so to oh-no is its willing complicity in the continuing glorification of the '50s."
    },
    {
      "text": "Back to the Future is no more than one big joke about going where you don't belong. It has all the substance of junk food and is as harmless as your average TV show."
    },
    {
      "text": "Just when it would seem that Steven Spielberg has touched all possible forms of fantasy, he comes up with another one that not only plucks, but plays a complete symphony, on the heartstrings."
    },
    {
      "text": "Remember how Huck Finn daydreamed about going to his own funeral? Back to the Future does an inverse, witty turnabout on this theme."
    },
    {
      "text": "Michael J. Fox is bright and likeable, convincing as a 17-year-old, and excellent when he introduces rock-and-roll to a stunned high school audience only just getting over doo wop."
    },
    {
      "text": "Despite the frequent laughs, I came out of the movie vaguely dissatisfied. I expected something more original from this... and from Zemeckis, who proved in Romancing The Stone that he can produce fresh, witty and entertaining pictures."
    },
    {
      "text": "I know it sounds a bit on the Disneyesque side, but like the hero's Delorean, it's light years away from all that. The gags, which are plentiful, are served up with a nice wry touch, and the performances all round are as zesty as Zemeckis's own."
    },
    {
      "text": "Back to the Future has an irresistible playfulness."
    },
    {
      "text": "Just a joyously whimsical, ingeniously devised, well-written time-travel comedy that anyone from five to 95 should find splendidly entertaining."
    },
    {
      "text": "In the end, this film puts you in such a good mood that you're liable to forget all about its fundamental contradictions."
    },
    {
      "text": "It's all fiendishly complicated but Zemeckis is an inventive filmmaker with a knack for the happy ending. Disney would have been proud of him -- and more than a little envious of an entertainment which takes a risk or two, and has a ball doing it."
    },
    {
      "text": "What pushes Back to the Future over the edge from so-so to oh-no is its willing complicity in the continuing glorification of the '50s."
    },
    {
      "text": "A startlingly funny, enjoyably intricate piece of slapstick satire."
    },
    {
      "text": "This sci-fi blending of American Graffiti and It’s a Wonderful Life is the kind of movie that, try as you might to avoid it, you'll end up ingesting by osmosis anyway."
    },
    {
      "text": "Back to the Future is one of the most entertaining films of the year from virtually every aspect: the performances of the cast and production crew, the tongue-in-cheek comedy, the special effects, etc."
    },
    {
      "text": "Lost in confusion, director Robert Zemeckis and co-scriptwriter Bob Gale don’t know how to end the far-out fantasy they’ve created, and the smell of an equally silly sequel permeates the air like a gas leak."
    },
    {
      "text": "Back To The Future offers mild laughs and little else, making it really ready to go back to the drawing boards."
    },
    {
      "text": "Lea Thompson, Crispin Glover and Thomas F. Wilson as the 50s people are exactly in the movie image of that decade, and do a lot to give life to the film’s picture of an era when the very idea of having two television sets is science-fictional."
    },
    {
      "text": "Back to the Future is a film of many different genres. While it is mainly a science fiction film focusing on the implications of time-travel, other subplots bring in action, romance, comedy, and drama."
    },
    {
      "text": "“Back to the Future” is a film you need to see. Whether you’re 9 or 90, you will enjoy this movie. It’s old-fashioned entertainment."
    },
    {
      "text": "Superbly put together, an absolute classic.... an imaginative story filled with heart and humour."
    },
    {
      "text": "The weightlessness of Back to the Future is part of its singular charm. Marty McFly and Doc Brown's time-traveling adventure is one of our great movies because of the way it loves its characters, its story and the infinite possibilities of its universe."
    },
    {
      "text": "Back to the Future is the very definition of a summer blockbuster and the adventure-comedy is one of the best films ever made."
    },
    {
      "text": "It is perfectly 80s with its soundtrack, its fashion, and its gratuitous use of s-bombs in a PG-rated film. I imagine itll be hard for anyone who enjoys fun and mirth not to have a good time watching this movie."
    },
    {
      "text": "Fox, who was doing double duty while making the first film (he was still working on his sitcom, Family Ties at the same time) was the perfect Marty."
    },
    {
      "text": "By far one of the most competent time travel movies ever made, addressing even the most common loopholes and pitfalls."
    },
    {
      "text": "It is the perfect package of entertainment, drama, comedy, excitement, and heart, wrapped up in special effects that still look convincing."
    },
    {
      "text": "\"Back to the Future\" is the best comic-strip movie I've seen this year. It's well-made, lighthearted and is exactly the right length to give you excitement and laughs and a few surprises, and then it's over, leaving you feeling good."
    },
    {
      "text": "The play on culture swaps is neatly done, and director Robert Zemeckis keeps it all fairytale-like and family friendly."
    },
    {
      "text": "One of the few perfect films that truly deserves to sit on the pedestal it rests on. [Full review in Spanish]"
    },
    {
      "text": "There isn't a wasted scene."
    },
    {
      "text": "A great mix of fantasy, humor and drama, with a light tone but not in a ridiculous way and with well built characters you can identify with. [Full review in Spanish]"
    },
    {
      "text": "Zemeckis and Gale have cannily chosen the time periods, which are funny as much for their similarities (political and materalistic) as their contrasts (music, fashions, language)."
    },
    {
      "text": "Every bit as classy, clever and cockle-warming as it was 30 years ago."
    },
    {
      "text": "Kids and parents alike are gonna dig this wonderful fantasy."
    },
    {
      "text": "Zemeckis and Gale have given the movie a core of feeling that makes real claims on us. For all its comedy, Back to the Future is about a kid coming to terms with his parents' inadequacies, a moment familiar to everyone, and the fulcrum in growing up."
    },
    {
      "text": "This fusion of sci-fi, action, romance and comedy could have been a dreadful mess, were it not for writer-director Robert Zemeckis and co-writer Bob Gale's refusal to let a loose line or idea escape their pens."
    },
    {
      "text": "The humour, the pathos, the tension - even the blooming soundtrack - all conspire to ensure that the tale of a teenager traveling back 30 years to ensure his parents meet and ultimately mate can, given its vintage, now be fairly described as a classic."
    },
    {
      "text": "Under the splendid direction of Robert Zemeckis, who also co-authored the screenplay with Bob Gale, Back to the Future is a joyous flight into the domain of a teen-ager`s fantasy."
    },
    {
      "text": "Just sign on for the trip. Back to the Future offers the summer's most dazzling joyride."
    },
    {
      "text": "It isn't often that extremely clever moviemakers use their brains in the service of pure fun. But that's just what the people who made Back to the Future have done. This brilliant contraption of a film could become the hit of the summer."
    },
    {
      "text": "It's big, cartoonish and empty, with an interesting premise that is underdeveloped and overproduced."
    },
    {
      "text": "It's great fun most of the way and makes up in humor what it lacks in sense."
    },
    {
      "text": "Zemeckis and Gale... give us two priceless scenes in which the young time-traveler simply regards his parents-to-be with wonderment, delight and empathy. And we cannot help but share that emotion and relate it to our own lives."
    },
    {
      "text": "It was, is and always will be a true Hollywood classic."
    },
    {
      "text": "The most commercially popular of 1985."
    },
    {
      "text": "The picture packs a wonderful wallop."
    },
    {
      "text": "Undeniably one of the greatest films of the 1980s and indeed, of all time, Back to the Future has endured so well because it walks that fine tightrope of managing to appeal to just about everyone..."
    },
    {
      "text": "'80s time-travel favorite has laughs, romance, action."
    },
    {
      "text": "an undeniably fun film, one whose clever plotting, memorable characters, and deft balance of both wistful nostalgia and celebration of the here and now deserves comparisons to The Wizard of Oz"
    },
    {
      "text": "Back to the Future is one of the best popcorn movies ever made. It's ingenuity, time-traveling twist ups and wonderfully vibrant characters resonate in ways few films ever achieve."
    },
    {
      "text": "It's a timeless joke that never gets old: One day you will grow up to be your parents and they'll have the last laugh. The innovation here was in telling the joke backwards."
    },
    {
      "text": "\"Future\" fandom resonates in the public imagination because it marries innocence with high-concept fun."
    },
    {
      "text": "A little more sophistication would have been no bad thing -- but a good script keeps it zipping along."
    },
    {
      "text": "Delightful and sophisticated to a degree beyond the dreams of today's movies in similar vein."
    },
    {
      "text": "Zemeckis' popcorn classic combines watertight scripting with broad but brilliant performances, all held together by Fox's stumbling charm."
    },
    {
      "text": "The counter-Freudian drama is handled with easy wit and flair, like a Shakespearian disguise comedy, and it made a whopping star of Fox."
    },
    {
      "text": "This irresistible combination of dazzling effects and sly comedy propelled Michael J Fox to stardom and Robert Zemeckis to the front rank of Hollywood directors."
    },
    {
      "text": "This film is WASTED on kids."
    },
    {
      "text": "Boasts probably the tightest screenplay of any film in Zemeckis's body of work."
    },
    {
      "text": "Thompson's funny, carnal performance forces us all to face an ugly truth: once, our moms might have been prowling teens too."
    },
    {
      "text": "Probably the most carefully-scripted blockbuster in Hollywood history."
    },
    {
      "text": "Performances by the earnest Fox, the lunatic Lloyd, the deceptively passionate Lea Thompson, and, particularly, the bumbling-to-confident Glover, who runs away with the picture, merrily keep the ship sailing."
    },
    {
      "text": "To put it bluntly: if you don't like Back To The Future, it's difficult to believe that you like films at all."
    },
    {
      "text": "Amongst the finest family films of the 1980s."
    },
    {
      "text": "Robert Zemeckis's direction, like the technical contributions, is first-rate, and after an ambling start takes off into frenetic, non-stop fun."
    },
    {
      "text": "Director Robert Zemeckis confronts the oedipal heart of the time-travel genre with this zestfully tasteless 1985 tale about a teenager (Michael J. Fox) who is projected back to 1955 and then must arrange the romance of his parents."
    },
    {
      "text": "An unqualified success, boasting an incredibly sharp screenplay and tons of appeal."
    },
    {
      "text": "A classic adventure that holds up perfectly today."
    },
    {
      "text": "The movie has all the benign good nature of a Frank Capra."
    },
    {
      "text": "Equal parts hilarity, nostalgia, science fiction, screwball comedy, and white-knuckle suspense in a complex storyline wound tighter than a yo-yo in a centrifuge."
    },
    {
      "text": "Technically, no film is impossible to like, but this techno-romantic comedy comes about as close as you can get."
    },
    {
      "text": "An unusual time travel flick about a gifted match-maker."
    },
    {
      "text": "Part II was better, but that's just me. The first one is a fun romp too."
    },
    {
      "text": "One of the most purely entertaining blockbusters of the 1980s"
    },
    {
      "text": "Mr. Zemeckis is able both to keep the story moving and to keep it from going too far. He handles Back to the Future with the kind of inventiveness that indicates he will be spinning funny, whimsical tall tales for a long time to come."
    },
    {
      "text": "One of the best of the 1980s comedies. A career highlight for Michael J. Fox."
    },
    {
      "text": "infectiously silly and fun time-travel comedy. Lloyd and Fox are a great team."
    },
    {
      "text": "One of the most beloved movies of the Eighties."
    },
    {
      "text": "Probably the most fun Zemeckis has given the world. It's okay, I'm paying him a compliment."
    },
    {
      "text": "A hilarious romp of time travel, sentimentality and, surprisingly, some genuine suspense"
    },
    {
      "text": "Too cute, too clever, too damn smug."
    },
    {
      "text": "One of the best film's ever made. Romantic, Funny, Action-Packed and Vivacious. Michael J.Fox and Christopher Lloyd are amazing."
    },
    {
      "text": "A masterpiece!"
    },
    {
      "text": "Great performances, clever concept, deft direction, lotsa laughs, and some real heart & soul. A true Popcorn Classic."
    },
    {
      "text": "Few movies have reached this level of light comic perfection. It's the perfect blend of the novelty of the 1950's and the comic angst of adolescence."
    },
    {
      "text": "Talvez a frmula para o imenso sucesso do filme seja o fato de que ele mexe com uma curiosidade que, talvez, seja universal: como eram nossos pais quando jovens?"
    },
    {
      "text": "This is one of those movies that folds in on itself, and reveals perfect symmetry."
    },
    {
      "text": "It's undeniably formulaic but so outstandingly executed that it vindicates the formula."
    },
    {
      "text": "Good clean family fun even as the ultimate Oedipal wish."
    },
    {
      "text": "Fox's portrayal of a character with whom all ages can empathize is central to the film's timeless and magical allure."
    },
    {
      "text": "Back to the Future is a terrifically entertaining movie. It may well be the best fun any of us will have indoors this summer."
    },
    {
      "text": "So busy being clever that it trips over its own ingenuity."
    },
    {
      "text": "One of the mid-'80s most enduring and enjoyable confections: an infectious mix of comedy, fantasy, satire, excitement, and nostalgia."
    },
    {
      "text": "Crispin Glover and Christopher Lloyd are both standouts."
    },
    {
      "text": "Although the Zemeckis and Gale script has its corny moments, it's also genius -- it combines action, romance, comedy, drama and science fiction with impressive dexterity, and has aged better than most of its contemporaries."
    }
  ],
  "release_year": 1985,
  "duration": 116,
  "genres": [
    "Comedy",
    "Sci-Fi"
  ],
  "synopsis": "In this 1980s sci-fi classic, small-town California teen Marty McFly (Michael J. Fox) is thrown back into the '50s when an experiment by his eccentric scientist friend Doc Brown (Christopher Lloyd) goes awry. Traveling through time in a modified DeLorean car, Marty encounters young versions of his parents (Crispin Glover, Lea Thompson), and must make sure that they fall in love or he'll cease to exist. Even more dauntingly, Marty has to return to his own time and save the life of Doc Brown.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/vN5B5WgYscRGcQpVhHl6p9DDTP0.jpg"
}