{
  "movie_name": "Big Hero 6",
  "movie_id": "big_hero_6",
  "total_reviews": 227,
  "reviews": [
    {
      "text": "Brimming with fun humor, busy action, and imaginative science, what really wins is the story and Disney picked a winner."
    },
    {
      "text": "While a very loose adaptation of the comics, the film presents a fun, scientific approach to superheroics alongside a heartfelt story about coping with loss."
    },
    {
      "text": "[It] is an adaptation of a Marvel Comics title but the filmmakers thoroughly transform it into a Disney feature, complete with issues of loss and family at the center of the creation of a student superhero team..."
    },
    {
      "text": "It's enjoyable and, ultimately, harmless in an affectionate way that both younger audiences and their parents will appreciate."
    },
    {
      "text": "Big Hero 6 has a soul  the one thing thats keeping animated movies human in a world that wants to sell them as product."
    },
    {
      "text": "The relationship between the boy and his robot is endearing and effectively told."
    },
    {
      "text": "...there's a sentimental heartbeat and some painterly framing which mean this hugely enjoyable romp retains its unique character."
    },
    {
      "text": "There are set pieces in Big Hero 6 that rival anything from the Marvel imaginations."
    },
    {
      "text": "I'm sure many people, young and old, will go into Big Hero 6 and enjoy themselves. I just wished there was more going on here."
    },
    {
      "text": "102 minutes of perpetual amazement that greatly complicated the choice of the best animation film of 2014. [Full Review in Spanish]"
    },
    {
      "text": "There's definitely a little something for everyone in this movie. Humor that both parents and kids can enjoy... a touching story, and action in every turn."
    },
    {
      "text": "Big Hero 6 is a fun, occasionally brilliant, never boring computer-animated film from Disney."
    },
    {
      "text": "Soaring with action, adventure, charm, heart, soul and a whole lot of fun - not to mention Baymax, one of the most adorable heroes ever... Big Hero 6 is the new big screen hero!"
    },
    {
      "text": "Big Hero 6 is sweet and stunning and in Baymax, Disney has its new Totoro."
    },
    {
      "text": "The oversized and awkward, cute and caring Baymax could easily be the preferred stocking stuffing this Christmas."
    },
    {
      "text": "Though heart and humour may be ever-present, Big Hero 6's most welcome attribute lies within its gleeful sense of perpetual imagination."
    },
    {
      "text": "It is, after all, the Baymax show -- and he is cute, cuddly, comedy gold. Fortunately, although Big Hero 6 has various flaws, he's generally on hand to patch them."
    },
    {
      "text": "A really nice entry into the Disney canon."
    },
    {
      "text": "Big Hero 6 may not have the heft of other commentaries on the superhero genre, but it has an emotional heart unlike any other."
    },
    {
      "text": "Big Hero 6 will entertain and amuse most, especially if you're a 10-year-old boy, but for me, it's only saving grace was a big, huggable robot."
    },
    {
      "text": "Grandes héroes es una hilarante animación con sobra de corazón sobre un grupo de héroes en proceso."
    },
    {
      "text": "[Baymax is] funny and squishy and over-concerned and allows for the same sort of secretive wonder kids got out of E.T. a few decades back."
    },
    {
      "text": "BIG HERO 6 isn't a miserable experience by any stretch, but this effort from Disney is uninspired and has some odd political aspects"
    },
    {
      "text": "A family film that doesn't pander to its audience, a comic book film that [isn't] dark and gritty, and a Disney film without talking animals. Now that definitely IS heroic."
    },
    {
      "text": "Big Hero 6 is about dealing with loss; the symptoms it causes, what happens when that loss makes you do bad things, and how to move on comfortably."
    },
    {
      "text": "It takes a lot to make an animated movie feel heartwarming, but Disney pulled it off while not sacrificing the dazzling animations for which they are known."
    },
    {
      "text": "A smart, inventive tale... It's one of the best science-fiction films in ages."
    },
    {
      "text": "Big Hero 6 is freaking fun. It's basically the Avengers or Guardians of the Galaxy, but without all the dirty stuff."
    },
    {
      "text": "One of the few recent blockbusters of which I really expect a sequel. [Full review in Spanish]"
    },
    {
      "text": "Big Hero 6 advances lightly, but it is not superficial. [Full review in Spanish]"
    },
    {
      "text": "Hiro teaches Baymax something as basic as a fist bump, and it winds up being one of the most heartwarmingly hilarious scenes all year"
    },
    {
      "text": "Big Hero 6 is still a fun, family-friendly option for a variety of filmgoers, but sadly, its strong opening suggests the finished product could have been better."
    },
    {
      "text": "Big Hero 6 is clever, sweet and intensely likable, much like its band of heroes. I walked out of the theater happy and energized, and if the young families in my screening were any indication, just like a kid."
    },
    {
      "text": "A tremendously entertaining film that returns hope to the collective fear that Disney caused when taking ownership of big, huge, science fiction consortiums and comics. [Full review in Spanish]"
    },
    {
      "text": "The latest cartoon from Disney is a hectic adventure movie for action-lovers. See review, in this section."
    },
    {
      "text": "What you might not have heard before is the way this film laces that basic story with beautiful themes that push back against some of the assumptions of the genre."
    },
    {
      "text": "Big Hero 6 is still a boy's own wonder. Baymax is the best movie robot in years."
    },
    {
      "text": "\"Big Hero 6\" is a mish-mash of mixed messages, from its \"compassion over violence, through violence\" finale to its clumsily appropriated Japanese stylistic flourishes."
    },
    {
      "text": "To say Big Hero 6 is the toddler version of Avengers is inaccurate because that implies it's unworthy of adults' time. Disney's newest is actually one of its most inclusive."
    },
    {
      "text": "The action is slick and ingenious and although the finale follows the big, bigger, BIGGEST theory of set pieces to become a bit overblown, this is still a lot of fun."
    },
    {
      "text": "Big Hero 6, in its final stretch, becomes an almost interminable experience."
    },
    {
      "text": "A superhero tale that feels fresh and new..."
    },
    {
      "text": "Touching and amusing."
    },
    {
      "text": "Big Hero 6 also provides many moments of genuine sweetness."
    },
    {
      "text": "Big Hero 6 fails to make that special emotional connect with the audience but definitely doesn't lose out on the 'fun' quotient."
    },
    {
      "text": "The \"boy and his dog\" relationship between Baymax and Hiro becomes an emotional nexus that's part E.T. and part Johnny Sokko & his Giant Robot."
    },
    {
      "text": "It's as if Disney has taken some very traditional ingredients and blended them to come up with a new flavour entirely."
    },
    {
      "text": "A cute, entertaining tale of a hapless robot who must mend the broken heart of a young boy whose life takes a depressing turn."
    },
    {
      "text": "A new concept in fictional robots and a cartoon that goes beyond clever is a masterpiece of originality, big hug sweetness and one of the year's best surprises."
    },
    {
      "text": "It's at its most poignant and engaging when it comes to family matters, but loses points on the superheroics front."
    },
    {
      "text": "\"Big Hero 6″ is the perfect babysitter for your kids. But, animation should offer something to the adults as well. Let's find more original stories and even get experimental, folks. \"Big Hero 6″ is nothing we haven't seen before."
    },
    {
      "text": "Big Hero 6 is an exciting, action-packed adventure with plenty of heart that both kids and adults alike will find entertaining."
    },
    {
      "text": "The film deals in a subtle and moving way with grief and teenage anxiety while serving up all the thrills of a big-budget animated movie with superhero protagonists."
    },
    {
      "text": "Looking like a walking marshmallow and moving with a dainty waddle, loveable robot Baymax... gives the film its heart and humour."
    },
    {
      "text": "An origins story ripe with innocence and loss, this anime-inflected treat harks back to Disney's big-hearted heritage even as it looks forward towards new worlds of innovation."
    },
    {
      "text": "A highly enjoyable first instalment of a franchise that like it's synthetic hero, may have sturdy, chubby legs."
    },
    {
      "text": "Disney mines the Marvel Comics back catalogue for its latest animation Big Hero 6, a delightfully entertaining East/West genre blend that's a neat addition to the ever-expanding superhero genre."
    },
    {
      "text": "For all its whizzy sophistication, there's something sweetly old-fashioned about Big Hero 6 that should engage parents as much as it delights their offspring."
    },
    {
      "text": "It makes for an entertaining spectacle, though less interesting than the one we started out with."
    },
    {
      "text": "The Scooby-Doo-ish central plot is forgivable in a movie with so much visual verve, energetic action and a character so wondrously designed as Baymax."
    },
    {
      "text": "Disney has swallowed up both Pixar and Marvel and this uneven animation feels like the resulting belch."
    },
    {
      "text": "An invigorating, frequently hilarious piece of pop cinema that has a palpable heartbeat even amid its more archetypal beats."
    },
    {
      "text": "Joyous and exhilarating. A fresh and funny animated adventure that subverts genre clichés at every turn."
    },
    {
      "text": "This film is vying to appeal to a certain audience, and it's likely that both children and teenagers will adhere to this animation tremendously."
    },
    {
      "text": "The ultimate message of staying true to oneself may be familiar, but the emotional journey is raw and real."
    },
    {
      "text": "The sweet, witty main pairing focuses a potentially busy, derivative super-group tale."
    },
    {
      "text": "As exhausting as it is exhilarating, Big Hero 6 feels like an animation in step with an ever-changing world."
    },
    {
      "text": "The pudgy robot Baymax steals the show."
    },
    {
      "text": "This anime-flavoured Disney sci-fi lark is an absolute delight, a near-perfect family entertainment."
    },
    {
      "text": "Big Hero 6 is one of the best animated features to hit the big screen in some time. Forget Frozen. In fact, just Let It Go completely. This is a stunning triumph."
    },
    {
      "text": "Big Hero 6 is just another loud action flick for the kids."
    },
    {
      "text": "On the high-quality scale set by the Disney animated features in their latest Renaissance, this one doesn't quite measure up. But Big Hero 6 is sure to entertain millions of smart kids and their escort parents."
    },
    {
      "text": "It's not as lovely as Pixar's best, or remotely as complex in its storytelling, but it makes for a refreshingly simple intro course on modern superhero-movie tropes."
    },
    {
      "text": "Parts of the narrative are unavoidably clunky, but the film has humour and heart."
    },
    {
      "text": "Big Hero 6 manages to be so much fun that it's easy to forget that it's yet another superhero origins story."
    },
    {
      "text": "Baymax is one of those characters who can basically do no wrong. Every sequence he's part of is automatically funnier just because he's onscreen."
    },
    {
      "text": "Temper your expectations and focus on the movie's good qualities, and Big Hero 6 could be super fun."
    },
    {
      "text": "Kids will leave the theater wanting their own Baymax, and who can blame them? It's the rest of the \"Heroes\" that don't measure up; the robot full of air is the most real thing in the movie."
    },
    {
      "text": "It's easier to like this movie because of the casual, low stakes of the enterprise."
    },
    {
      "text": "Directors Don Hall and Chris Williams find new angles on the required action beats, playing up the human relationships and having fun with Baymax's logical, single-minded nature."
    },
    {
      "text": "Disney Animation's summer release is a futuristic sight for sore eyes, a Pixar-esque tale of a young robotics genius and his heartfelt bond with one of his automated creations."
    },
    {
      "text": "It's colorful and fun, a good, but not great Disney cartoon."
    },
    {
      "text": "That visual exuberance underscores its heroes' enthusiasm, and even when Baymax steals the show, it's hard to deny he's a charmingly squishy center."
    },
    {
      "text": "Excess leads to excitement, and exhilaration, and entertainment."
    },
    {
      "text": "It might be too much to expect Big Hero 6 to have the staying power of Frozen without the support of that film's powerful soundtrack, but it's still a highly enjoyable adventure in its own right."
    },
    {
      "text": "Big Hero 6, the first Marvel comic book to get a Walt Disney makeover, is a beguiling kids movie. It is also a beauty to behold for its skillful digital animation in 3D."
    },
    {
      "text": "The team behind Big Hero 6 clearly have good intentions, as well as being the smoothest operators around."
    },
    {
      "text": "The road to that realization makes for a super-fun path, especially with the Baymax character, who constantly issues health updates and who works to adapt to teen expressions and figures of speech."
    },
    {
      "text": "The important thing is that San Fransokyo is everything San Francisco should be."
    },
    {
      "text": "You'll believe unadulterated tweener dreams can fly."
    },
    {
      "text": "Bright and flashy, with enough energy to keep the audience entertained, this animated action-adventure movie is far too formulaic to become a classic."
    },
    {
      "text": "Big Hero 6 has style, humour and a big, squishy heart."
    },
    {
      "text": "Introducing Baymax: the most loveable, huggable character in film history."
    },
    {
      "text": "... amusing for a while, but ultimately doesn't have much narrative substance beneath the spectacle, opening a wound that even Baymax can't heal."
    },
    {
      "text": "By the time Hiro and Baymax summon some genuine emotion, 'Big Hero 6's' 93 minutes are all but finished."
    },
    {
      "text": "\"Big Hero 6\" is both a Disney cartoon and a Marvel superhero epic - though not enough of either one to be as dynamic as, say, \"Frozen\" or \"Guardians of the Galaxy.\""
    },
    {
      "text": "There is much more to this film than hyper-powered individuals belting seven shades of snot out of each other. At its heart, it's a story about grief and loss."
    },
    {
      "text": "This isn't a simple superhero story; this is a story about grief, disguised in a superhero costume."
    },
    {
      "text": "The characters are also a mash-up of East and West, promoting strong moral values in the fight of good versus evil. Like me, you will fall in love with this giant walking marshmallow - between laughs, thrills and saving the world"
    },
    {
      "text": "Do we celebrate its strides toward cultural diversity, or cringe at the christening of its setting as 'San Fransokyo', a hybrid Japanese-American town where everyone looks only a little foreign?"
    },
    {
      "text": "A lively and creative animated film about a robot with heart, empathy, compassion, and gentleness."
    },
    {
      "text": "If the plot and colorful teen heroes are familiar, the setting -- the near-future metropolis of San Fransokyo (imagine a benign 'Blade Runner') -- is intriguing, and the animation -- as always these days -- is dazzling."
    },
    {
      "text": "Speedy and stunning enough in its crystalline computer-animation, and then there's almost always Baymax's comic look or flatly inquiring voice. The super-team shtick and \"cool!\"-ness of technology are stated over and over, but aerial sequences take off."
    },
    {
      "text": "...awfully weaponized for a movie that's ostensibly about mercy and caregiving."
    },
    {
      "text": "Bouncy and beguiling, it's family fare that values brains over brawn."
    },
    {
      "text": "An animated film that really isn't a movie for kids. There is enough humor in it aimed at kids to get a few laughs from younger kids, but most of it is aimed at older kids and adults."
    },
    {
      "text": "Dull, derivative and dumbfoundingly violent."
    },
    {
      "text": "Big Hero 6, based on the comic book series of the same name lacks personality, a heartfelt story or even decent laughs. It's not a terrible movie by any means, but neither is it very good. It's just kind of there."
    },
    {
      "text": "For all its impeccable craft, it's unusually flavorless."
    },
    {
      "text": "Quite amusing, and honestly endearing."
    },
    {
      "text": "I'm basically exhausted with super hero shenanigans, whether its live action or animated."
    },
    {
      "text": "Will leave you completely satisfied with its service."
    },
    {
      "text": "The thrill of Big Hero 6 doesn't lie in guessing what comes next, it comes from being in the moment with great characters in a cool setting full of surprising details."
    },
    {
      "text": "A roller-coaster of a futuristic action movie, 'Big Hero 6' is perfect family fare to play opposite the more grownups-oriented 'Interstellar.'"
    },
    {
      "text": "A wildly entertaining animated adventure that successfully adapts the Marvel tradition to animation."
    },
    {
      "text": "It's sort of refreshing to see a movie as unabashedly optimistic about our future as Big Hero 6."
    },
    {
      "text": "Overflowing with visual invention and genuine sentiments."
    },
    {
      "text": "Here is a movie so brilliantly realized and exciting that its final act deserves far more than the traditional outlook of more recent studio cartoons."
    },
    {
      "text": "With this film, Disney expresses a willingness to test new waters in a genre flirting with stagnation."
    },
    {
      "text": "This doesn't top Pixar's The Incredibles, but doggoned it if it doesn't come close."
    },
    {
      "text": "Big Hero 6 offers something for everyone: action, camaraderie, superheroes and villains. But mostly, Baymax offers a compassionate and healing voice for those suffering, and a hug that can be felt through the screen."
    },
    {
      "text": "Awesome origin story is action-packed, deals with grief."
    },
    {
      "text": "Big Hero 6 celebrates nerd culture. And not merely the pop-culture- obsessed version (comic books) but the let's-invent-something-cool kind. Hey, kids, this PG flick asserts, it's good be taken with technology, crushed out on code, wowed by chemistry."
    },
    {
      "text": "Big Hero 6 combines Disney wonder and charm with Marvel awe and action to deliver a film that exhibits the best of both studios."
    },
    {
      "text": "Big Hero 6 doesn't set new animation standards, though it's easy to get lost gawking at the lively, colorful pastiche of sci-fi futures in San Fransokyo."
    },
    {
      "text": "It's a tale that floats, but only after sinking to the depths of a young psyche, as well as lowest-common-denominator action sequences, before popping up to the surface of a happy ending."
    },
    {
      "text": "Big Hero 6 is a playful movie that stands out from other Disney fare due to its willingness to indulge in some offbeat comedic turns."
    },
    {
      "text": "The breakthrough star of the season is here. His name is Baymax and he's impossible not to love. The 3-D animated Big Hero 6 would be a ton less fun without this irresistible blob of roly-poly, robot charisma."
    },
    {
      "text": "More Pixar than Disney and gloriously so."
    },
    {
      "text": "'Big Hero 6'... a unique blending of savvy Disney storytelling, cutting-edge action and eye-fulfilling scenery."
    },
    {
      "text": "I do plead guilty to wanting to make a lot of children's products my own (toys, comics and such). But this one is for them, and I'm just a welcome visitor in that world who shouldn't think too hard about it."
    },
    {
      "text": "A shameless crowdpleaser, big on heart, laughs and action."
    },
    {
      "text": "Big Hero 6's considerable graces as an animated film-its fantastical layouts and bouncy sense of figure and motion-are offset by its deficiencies as a second-rate superhero flick."
    },
    {
      "text": "At times, Big Hero 6 gets a little too noisy for its own good, but that never manages to drown out its many quieter charms."
    },
    {
      "text": "Come for the charming Baymax ... but stay for the film's embrace of very 21st century cultural values."
    },
    {
      "text": "Big Hero 6 qualifies as a better-than-average kids' movie with enough cross-generational appeal to make it a fine choice for a family weekend matinee."
    },
    {
      "text": "It's more emotionally sophisticated, dealing with themes of grief and finding your place in the world that are more grounded than the high-flying adventures they're surrounded by would have you expect."
    },
    {
      "text": "This is a delightful and original film for the first half and a sad imitation of a bad Scooby Doo episode the second. Delightful and original wins out and this is worth it."
    },
    {
      "text": "\"Big Hero 6\" does everything you'd expect from an animated adventure designed for families: It's big and funny and friendly and cute and exciting, and at the end it makes you cry."
    },
    {
      "text": "Big Hero 6 is nothing if not fun, a fast-paced fanboy fable that benefits greatly from a Pixar-informed blend of artistry and humor."
    },
    {
      "text": "Consider it a more family-friendly Guardians of the Galaxy, with the added kiddie appeal of a big, inflatable windbag to laugh at and love."
    },
    {
      "text": "The San Fransokyo cityscape and huggable Baymax are more than enough to differentiate this film from usual fare."
    },
    {
      "text": "It's built to amaze, and amaze it does. It'd take some 10 viewings to unravel the knockout action scenes and properly enjoy its fantasy city of San Fransokyo."
    },
    {
      "text": "More Baymax, please"
    },
    {
      "text": "Gorgeous and disturbing, Big Hero 6 is a departure for Disney: a film targeted at older kids, and the studio's first venture into straight-up comic book culture."
    },
    {
      "text": "It's shiny, colorful and entertaining, the sort of movie that will appeal to fans of animated films, superhero films and 3-D films ..."
    },
    {
      "text": "Although the film touches all the formula bases, its characters are strong, the thrills and laughs are doled out regularly and its emotional arc is tangible and true."
    },
    {
      "text": "It's fun, action-packed, and adorable."
    },
    {
      "text": "Baymax remains a pleasingly naïve medical droid, but there's still a lot of fighting and smashing for a movie with ostensibly smart protagonists."
    },
    {
      "text": "My reaction is as mixed as the architecture in this film, and the disappointment is probably couched by what could have been a really interesting, elegant movie."
    },
    {
      "text": "Fabulously entertaining, with colossal visuals and an endearing character in Baymax, who more than earns his lovable status."
    },
    {
      "text": "A good primer for filmgoers who may be too young to see something like The Avengers."
    },
    {
      "text": "a terrific film in its first half, where screenwriters...have rejiggered the characters into a bunch of science and engineering geeks, but once its super hero aspects kick in, the film becomes derivative and tedious."
    },
    {
      "text": "Have a few tissues on hand for the emotional parts. You're gonna need 'em."
    },
    {
      "text": "The material is well-trod, the story oft-told, and the characters familiar, but children don't mind in the same way that they don't mind hearing the same bedtime story every night."
    },
    {
      "text": "Big Hero 6 works precisely because it seems so familiar, with just enough fresh spin so that it feels like something new rather than a rerun."
    },
    {
      "text": "The humor and especially the charm are slowly but surely drained from the proceedings, and in their place, Big Hero 6 supplies only routine and formula."
    },
    {
      "text": "It has more heart, more fun, and more laughs than most of the last dozen live-action superhero flicks."
    },
    {
      "text": "Filled with engaging characters and imaginative touches."
    },
    {
      "text": "Hiro and Baymax are characters in the best tradition of Elliott and ET and Hogarth and the Iron Giant."
    },
    {
      "text": "A beautiful companion piece to \"Frozen,\" this film will delight and entertain audiences despite some of its heavier themes."
    },
    {
      "text": "An infectiously entertaining mash-up of sorts that's fun, funny and filled with plenty of action, not to mention some heapings of heart. (Full Content Review for Parents Also Available)"
    },
    {
      "text": "Pow, pow, kaboom, cuddle. ..."
    },
    {
      "text": "Big Hero 6 finds the studio summoning up a fresh combination of action and whimsy. It's swift, inventive, antic, and ardent, with virtuoso comic choreography and split-second slapstick timing."
    },
    {
      "text": "The screenplay is smart enough to be considered adult-friendly. This isn't \"classic Disney\" but it's an experience parents and children can enjoy together in the dark, and sometimes that's all one can ask of a big-budget animated film."
    },
    {
      "text": "What Big Hero 6 lacks in originality, it makes up for in charm."
    },
    {
      "text": "Big Hero 6 accomplishes its goal of entertaining those young enough not to notice how dispiritingly familiar it is as both an animated and superhero movie."
    },
    {
      "text": "It's a bonus that these are not only interesting characters because of the physical aspects of their new found powers, but they are also smart. It's not often when the central figures of this kind of action-heavy story are the smartest people in the room."
    },
    {
      "text": "An exciting and sometimes funny commercial for what will surely be a delightful action figure, available in three iterations: original plushie, Samurai battle mode, and full robot warrior."
    },
    {
      "text": "The convoluted story gives the villain a motive that doesn't really make sense and is patched in too late in the narrative. Still, the 3-D animation is incredible."
    },
    {
      "text": "A rousing movie that's satisfyingly infused with traditional Disney sentiment, however calculated its aims might sound."
    },
    {
      "text": "Before it ends in a frenzy of action that piles climax upon climax, it deals with subtler ideas than we get in the usual coming-of-age stories."
    },
    {
      "text": "With its appealing array of nerdy characters, inventive architecture and striking cross-cultural production design, Hero is a vibrant romp."
    },
    {
      "text": "A bright, visually sumptuous 3-D computer-animated feature that gives you a bit of an emotional workout."
    },
    {
      "text": "A total delight from Disney Animation, Big Hero 6 will have you rooting for this ragtag team originally introduced in a little -known Marvel comic. But its the overgrown marshmallow named Baymax that will steal your heart."
    },
    {
      "text": "You will believe a vinyl robot can fly. You might even fall in love with it."
    },
    {
      "text": "Seems tailor-made for a likable yet forgettable animated TV series."
    },
    {
      "text": "The real appeal of \"Big Hero 6\" isn't its action. It's the central character's heart."
    },
    {
      "text": "Aesthetically, a vision of pure, impeccable imagination. If \"Big Hero 6\" concludes on a dishonest note, there is still no denying its successes as an entertainment of tender, witty accord. And it's pretty. Really, really pretty."
    },
    {
      "text": "Basically a genial, good-natured boys' adventure, and if it stumbles somewhat in the second hour, when it becomes more derivative and action-oriented, it remains likable to the end."
    },
    {
      "text": "This engrossing, uplifting movie never runs low on battery power."
    },
    {
      "text": "Second-tier Disney/Marvel entertainment, fine for a day out with the children yet not enough, after the creative advances of Wreck-It Ralph and the emotional heft of Frozen. Unlike those comparable risks, this is built with a sequel squarely in mind."
    },
    {
      "text": "The visuals are splendid. Even close-ups of face and hair are something to marvel at."
    },
    {
      "text": "Gets glitchy. To make engineers more awesome, the movie upgrades the gang into superheroes, which scrambles the message."
    },
    {
      "text": "Unlike most Disney fables, there aren't any real morals or lessons to be learned here. This one is just pure, sheer fun."
    },
    {
      "text": "There's enough tried-and-true Disney sentiment here to counter the rampant antihumanism, and the futuristic settings look spectacular, but this left me feeling gross."
    },
    {
      "text": "Voice actor Potter, still a teenager himself, lends Hiro an authentic youthfulness and likability. But Tadashi and Baymax are the standout characters."
    },
    {
      "text": "We should be grateful for the inventions directors Don Hall and Chris Williams have brought to Big Hero 6; they've given the comic its own identity for a mainstream audience who's likely never heard of it."
    },
    {
      "text": "Big Hero 6 is a colorful and fast-paced entertainment, easily watchable and easily forgotten, like a shiny new toy that isn't much fun to play with."
    },
    {
      "text": "The storytelling is solid, propelled by characters that you come to care about. And that should make \"Big Hero 6\" a big hit."
    },
    {
      "text": "Disney plus Marvel plus Pixar's John Lasseter equals an enjoyable jumble of kid-approved action."
    },
    {
      "text": "Phase 1 of the Marvel Toons era is off to a very promising start."
    },
    {
      "text": "It's easily Disney's best computer-animated film to date."
    },
    {
      "text": "A sensitive discussion about coping with trauma and developing a support system ultimately becomes yet another loud story about how all kids totally want to be superheroes."
    },
    {
      "text": "An action adventure that puts brain ahead of brawn as a valued commodity is always reason to celebrate. Add in the considerable heart that Baymax contributes (with elements borrowed from both \"WALL-E\" and \"Up\"), and you have a winner."
    },
    {
      "text": "There's enough visual invention afoot, and enough spirited interplay among the human characters, to keep things bobbing along."
    },
    {
      "text": "May be a bit too glib to reach the heights of The Incredibles or The Iron Giant, but if you can't have Brad Bird, this is pretty much the next best thing."
    },
    {
      "text": "\"Big Hero 6\" is a fine blend of sweetness and spectacle, East and West. The meeting of Disney and Marvel sensibilities, though, is a more mixed union."
    },
    {
      "text": "Clever, colorful, fast on its feet, frequently very funny and sweet (but not excessively so), \"Big Hero 6\" mixes its myriad influences into a final product that, while in no way original, is immensely entertaining."
    },
    {
      "text": "In a film world that's quickly becoming oversaturated by superhero franchises, here's hoping we haven't seen the last of the characters from \"Big Hero 6.\""
    },
    {
      "text": "The artistry of state-of-the-art commercial digital animation has become a foregone conclusion. Then again, it's a kids' film, and that audience will enjoy it."
    },
    {
      "text": "Yes, Big Hero 6, I am more than satisfied with my care."
    },
    {
      "text": "Take my word for it, or better yet go find out for yourself: \"Big Hero 6\" is a treat."
    },
    {
      "text": "Disney Animation's first foray into Marvel territory hits all the requisite beats of hardship and teamwork while playing in a more family-friendly key."
    },
    {
      "text": "The film quickly becomes a study of grief and retribution, and the question of how exactly technology can and should be utilized in the treatment of these emotions."
    },
    {
      "text": "The artists are challenging the big ticket live action superhero/ comic book movies that occupy such an important place in contemporary popular culture, just as they challenged the fantasy films of George Lucas and Steven Spielberg three decades ago."
    },
    {
      "text": "Hall and Williams have given us one of the rare family films that can fairly boast of having it all: humor, heart and huggability."
    },
    {
      "text": "'Big Hero 6\" is one of those Disney movies in which you can practically see the hot breath of the marketing guy condensed on the neck of the screenwriter."
    },
    {
      "text": "Working through phrases in broken old-timey computer speak, [Baymax voice Scott Adsit] never raises his voice, committed to singlehandedly bringing a busy movie down to his non-speed."
    },
    {
      "text": "The result is not terribly different from a lot of other recent animated fare, though there are agreeable standout elements."
    },
    {
      "text": "Fueled by a knowing sense of humor and an eye for colorful spectacle, Big Hero 6 is fine, if sometimes too frenetic, family entertainment"
    },
    {
      "text": "A wildly imaginative action-comedy...its computer animation is both whimsical and eye-popping, creating a fantastic world with startling photorealism."
    },
    {
      "text": "Despite the Marvel-style origin story, it's derivative of better Brad Bird cartoons like The Iron Giant and The Incredibles."
    },
    {
      "text": "Your kids will love it. And frankly, they should: Big Hero 6 is zippy, beautifully made, fraught with action and peril but never scary or bloody and features a vocal team of actors so smooth and polished it verges on the criminal."
    },
    {
      "text": "A surprising step down from the filmmakers who brought us the magic of recent titles like Wreck-It Ralph and Frozen."
    },
    {
      "text": "A film that has everything: laughs, gasps, tears, and cheers."
    },
    {
      "text": "The story hits all the familiar origin beats: vengeance as a motivator, training, discovering one's powers, and some stuff at the end you'll recognize. It will be some kids' first time ever seeing this though."
    },
    {
      "text": "The relationship between Baymax and Hiro is hilarious and profound and joyful. Your heart will soar with them as they soar across Sanfransokyo, and you too might catch yourself wearing a disbelieving grin."
    },
    {
      "text": "Tadashi's school pals are an absolute blast to hang out with, and I frankly would have almost preferred a film about the Hiro, his brother, and the gang trying to win a science fair."
    },
    {
      "text": "The ace in the hole is Baymax, who scores big laughs and generates warmth and good will that ultimately proves more crucial to the film than it should have to be."
    },
    {
      "text": "Baymax turns out to be a formidable weapon in this gorgeously realised tale of boy and 'bot, and the bond that develops between them."
    },
    {
      "text": "Egregious soundtrack missteps aside, \"Big Hero 6\" is truly glorious to look at and comprises a mostly beguiling mixture of genres, story strands and cultures, though it remains a mixture rather than a wholly seamless synthesis."
    },
    {
      "text": "A melding of old and new modes of animation, in which the attentive artistry of the past coexists with the hyper-detailed, computer-generated present."
    },
    {
      "text": "Sweet and sharp and exciting and hilarious, Big Hero 6 comes to the rescue of what's become a dreaded movie trope - the origin story - and launches the superhero tale to pleasurable new heights."
    },
    {
      "text": "East meets West to immensely satisfying effect in the vibrant mash-up of an animated romp, Big Hero 6."
    },
    {
      "text": "An animated comedy-adventure that cannily combines the emotion, humour and - courtesy of a cuddly inflatable robot - cuteness expected from Disney with a heavy dose of Marvel-style superhero action."
    },
    {
      "text": "There's enough that's new and different about \"Big Hero 6\" to get excited about, especially for those still too young for Marvel's more intense live-action fare."
    }
  ],
  "release_year": 2014,
  "duration": 102,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Action",
    "Sci-Fi",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "Robotics prodigy Hiro lives in the city of San Fransokyo. Next to his older brother, Tadashi, Hiro's closest companion is Baymax, a robot whose sole purpose is to take care of people. When a devastating turn of events throws Hiro into the middle of a dangerous plot, he transforms Baymax and his other friends, Go Go Tamago, Wasabi, Honey Lemon and Fred into a band of high-tech heroes.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/2mxS4wUimwlLmI1xp6QW6NSU361.jpg"
}