{
  "movie_name": "Bohemian Rhapsody",
  "movie_id": "bohemian_rhapsody",
  "total_reviews": 418,
  "reviews": [
    {
      "text": "Bohemian Rhapsody, the new biopic on Queen’s inception and fame, with a leaning on Freddie Mercury’s life, is a cinematic Wikipedia page."
    },
    {
      "text": "With great chemistry, the cast delivers a lot of entertaining moments, both musically and dramatically. Brilliant use of an incredible soundtrack which culminates in an epic reenactment of the famous 1985's show."
    },
    {
      "text": "Rami Malek gives a mediocre performance of one of the most iconic rock stars of all time. I don’t envy anybody having to step into that role. However, when the most prominent thing about Freddie in this film is his hideous prosthetic teeth..."
    },
    {
      "text": "A sensitive film that doesn't fall into triteness. [Full review in Spanish]"
    },
    {
      "text": "You end up with a very safe and conventional biopic that aims more at being a crowd-pleaser than an in-depth character exploration."
    },
    {
      "text": "Queen was a group that broke down the rules for what a single or an album could be, and they deserved a movie that broke down the same barriers for movies, not this toothless wonder."
    },
    {
      "text": "Rami Malek is brazenly resplendent in the role, summoning Mercury’s high-energy performance antics as well as his mournful, introspective side."
    },
    {
      "text": "In trying to tell Mercury’s queer story through his straight bandmates’ eyes, the new Queen biopic ends up saying almost nothing at all."
    },
    {
      "text": "Like many biopics, it's a bit glossy when it comes to the darker moments in (Freddie Mercury's) life. but the affection for the music and the great man is absolutely there.."
    },
    {
      "text": "Bohemian Rhapsody alternates between an exceedingly bland dramatic shorthand about Queen and Mercury's life, and several long concert scenes that cannot help but enthuse the viewer."
    },
    {
      "text": "I think this movie does [Freddie Mercury] so much justice."
    },
    {
      "text": "Episode 16: The Age of Innocence"
    },
    {
      "text": "If the surviving band members had gotten out of the way, there could have been a movie that pushed boundaries the way the band did."
    },
    {
      "text": "If you are a Queen fan, I think there's a lot to enjoy in this movie, because the performance scenes are absolutely fantastic."
    },
    {
      "text": "A black green cloud of bad stuff snorted up its own fat bottom. Freddie deserved better."
    },
    {
      "text": "The film squandered its opportunity to tell a story worthy of Freddie Mercury. He was magnificent and larger-than-life, and all we got is a plateful of mediocre and average."
    },
    {
      "text": "Bohemian Rhapsody tells the dramatised history of the influential British rock band, Queen, with the limelight focused firmly on the late frontman, Freddie Mercury."
    },
    {
      "text": "So forceful and enthusiastic that it's hard not to get caught up in the momentum and the impact of one of the most enduring groups in rock history."
    },
    {
      "text": "The high wire work of Malek and the thrilling concerts sequences will make you fall in love with Queen all over again. While far from perfect, Bohemian Rhapsody was a blast."
    },
    {
      "text": "Thanks to the film's aesthetically pleasing musical sequences and Rami Malek's commanding leading performance, it still serves as an adequate reminder of both the band's musical genius and Freddie's one of a kind stage presence."
    },
    {
      "text": "The film never really strikes an original note, choosing instead to tap into all the biopic high notes."
    },
    {
      "text": "Rami Malek is the movie and the only reason why it stands out, not much beyond his acting. [Full review in Spanish]"
    },
    {
      "text": "The film clearly has its flaws, rolling out more like a \"Greatest Hits\" compilation than a creative concept album, but the experience is so nostalgically infectious as to be irresistible. Forget the mixed reviews; they're just radio gaga."
    },
    {
      "text": "More bubblegum pop than gritty heartbreaking drama, Bohemian Rhapsody may have a few flaws but it is, without a doubt, made for its hardcore fan base. It's engaging, foot-tapping and one all-around rocking respectful party."
    },
    {
      "text": "The film is either scared of alienating its audience or can't bring itself to paint Mercury in a light that isn't totally mainstream, but either way, it's shallow."
    },
    {
      "text": "Mercury's deeply flawed personality is brilliantly brought out in all its contradictions by Malek."
    },
    {
      "text": "Bohemian Rhapsody was made to pay tribute to Freddie, not to explore his personal life. [Full review in Spanish]"
    },
    {
      "text": "There are a great number of problems with Bohemian Rhapsody, but the passion for and behind the band is front and center, and that occasionally makes it a great deal of fun."
    },
    {
      "text": "It is brutally long, rushing to tell the hectic life of Freddie Mercury with very awkward creative decisions and conventional mechanics that make the journey hasty, pointless and with little time for cohesion. [Full review in Spanish]"
    },
    {
      "text": "As a biopic, Bohemian Rhapsody falls short, failing to adequately examine Mercury's life and the people in it. Malek, who put so much effort into bringing Mercury to life, and who gives such a brilliant performance, deserves better, as does the audience."
    },
    {
      "text": "Overall, this is nothing new. Neither good nor bad, but if you approach it from the right angle, it's a lot of fun."
    },
    {
      "text": "The film ends on a musical high, accurately capturing the essence of the band's energy but, despite Malek's best efforts, fails to capture the elusiveness of Freddie Mercury."
    },
    {
      "text": "Bohemian Rhapsody dives into the struggles that Freddie Mercury went through. Whether you are a Queen fan or not, it makes for a great drama (with awesome music!)."
    },
    {
      "text": "This is record label-approved hagiography, and those doing the approving seem to see Mercury's sexual orientation as a character flaw he must overcome."
    },
    {
      "text": "podcast review"
    },
    {
      "text": "Though Rami Malek (Mr Robot) obviously poured his heart into the role, he could never have won, given the source material he had to work with."
    },
    {
      "text": "Bohemian Rhapsody is an expensive cosplay. It is plotted with the passion of a Wikipedia summary article. It hums along inoffensively for 2 hours."
    },
    {
      "text": "Bohemian Rhapsody is well-crafted and exhilarating at times. It doesn't do much to break the mold of a typical biopic."
    },
    {
      "text": "...the karaoke idea does not work in a tragic biopic, even if it sets out to celebrate the life and music of the rock star Freddie Mercury."
    },
    {
      "text": "Queen's subsequent rise to global fame is told through vignettes that are jolting and badly edited together, often arriving without context or connection"
    },
    {
      "text": "Freddie Mercury was a brilliant musician who left an everlasting mark on the world. Bohemian Rhapsody offers a small insight into Freddie's world and that of the band Queen."
    },
    {
      "text": "It may be a watered down tale of one of the most 'mercurial' lives lived on earth, but it is also a beautiful tribute to the life lived only for performance."
    },
    {
      "text": "In its two hours of footage he does not get a single moment of authentic, pure and full rock and roll. [Full Review in Spanish]"
    },
    {
      "text": "All biopics are dumb and bad, but musical biopics are a very special kind of awful. At best, they are exercises in celebrity karaoke. At worst, they are lip sync battles. Actually, at worst the director of the musical biopic is fired during filming..."
    },
    {
      "text": "Rami Malek's performance carries the film, and is filled with heart even in some of Mercury's darker moments."
    },
    {
      "text": "It's worth watching for Rami Malek's performance; entertainingly informative."
    },
    {
      "text": "To its benefit, and its detriment, Bohemian Rhapsody is emphatically rooted in Freddie not as a man but Freddie as myth. So the film is a lesson in mythology.."
    },
    {
      "text": "Bohemian Rhapsody might have some spectacular moments but it never forms a cohesive whole or have anything of merit to say about its subject."
    },
    {
      "text": "It ends on a high note in every sense of the word, and by the end, you really don't want it to stop now."
    },
    {
      "text": "I loved all the songs...I thought this was a fun movie to see with the whole family, though they could have done more with an R-rated dude..."
    },
    {
      "text": "A simplistic, uninspiring reflection on Freddie Mercury's life with Queen's tremendous soundtrack doing most of the heavy lifting."
    },
    {
      "text": "If the rhapsodic moments blow in and out of the narrative, they don't prevent Bohemian Rhapsody from being entertaining."
    },
    {
      "text": "Bohemian Rhapsody finds a nice middle ground between being an unabashed and safe depiction of Queen. It could have dabbled more into the meaty contents of the band and Mercury's life, but there's enough here to sing about."
    },
    {
      "text": "I love this movie. This is the kind of film you go with friends who love Queen's music as much as you do."
    },
    {
      "text": "The discrepancies are so glaring that they're distracting and altogether misleading."
    },
    {
      "text": "If you want authentic vocal pyrotechnics with a gut-punch story, go see the Gaga-fied A Star Is Born. But if you want breathtaking mimicry, uncluttered by historical honesty, then this movie's for you."
    },
    {
      "text": "An authentic homage to Freddie Mercury. [Full Review in Spanish]"
    },
    {
      "text": "If you're looking to find our more about Freddie Mercury, his experiences, and his life, you might come away like you're missing a little something."
    },
    {
      "text": "Bohemian Rhapsody is one of the best rock dramas I have ever seen."
    },
    {
      "text": "He's just a poor boy from a poor family. Spare him his life from this monstrosity."
    },
    {
      "text": "Bryan Singer's trite, tidy but powerfully soundtracked biopic of Freddie Mercury's fantastic journey from immigrant baggage handler to rock god renders the outsize ride of his life with surprising mundanity."
    },
    {
      "text": "Unapologetically denuded of depth, \"Bohemian Rhapsody\"'s focus is clearly on the music, not what made Mercury tick. And this despite Malek's superhuman efforts to make Queen's charismatic frontman real and alive."
    },
    {
      "text": "Decent and watchable, without being nearly as resonant as it should be."
    },
    {
      "text": "The only redeeming value of Bohemian Rhapsody is it's so bad, there's plenty of room left for a much better biopic about the one and only Freddie Mercury."
    },
    {
      "text": "Bohemian Rhapsody is a soulless, predictable, conventional and emotionally extortive musical biopic, although it's all hidden behind the songs and musical sequences."
    },
    {
      "text": "Singer has been repeatedly accused of sexual assault against underage boys, leading to a thick cloud of unease that hangs over Bohemian Rhapsody."
    },
    {
      "text": "What follows is a story that any passing Queen fan already knows, and the problem arises in that the script never delves deep enough to escape what is essentially a Wikipedia entry."
    },
    {
      "text": "It features a fantastic lead performance from Rami Malek as Queen frontman Freddie Mercury, but sadly the rest of the film doesn't live up to its greater elements, playing more as a greatest hits medley that has little to say about Queen or its members."
    },
    {
      "text": "A closer look reveals dissonance in this orchestration."
    },
    {
      "text": "Rami Malek is a revelation, but his performance feels wasted in Bohemian Rhapsody, a movie that can't decide if it wants to honor Queen frontman Freddie Mercury or punish him."
    },
    {
      "text": "Joyful and occasionally moving."
    },
    {
      "text": "BOHEMIAN RHAPSODY is an affront to the music of Queen in that it lacks any of the depth the band put into every song they created."
    },
    {
      "text": "I can't say I'm going to go buy Queen albums, but I'll gladly see this film again."
    },
    {
      "text": "If you love rock and roll. If you love Freddie Mercury. If you love Queen. You are going to lose your mind over Bohemian Rhapsody!!!"
    },
    {
      "text": "Strong acting from Rami Malek and others can't hide the film's substantial plot flaws."
    },
    {
      "text": "A patronizing response to every question about Queen music that can be answered by either playing a Queen song or showing a clip of a band member discussing a Queen song."
    },
    {
      "text": "A heartfelt, family drama that is no different than any other biopic you've already seen. As with other biopic films about musicians, the music will be a plus for fans of Queen, or a nice introduction for new listeners."
    },
    {
      "text": "Maybe Sacha Baron Cohen can one day make the outrageous movie that he envisioned rather than a conventional story that's more interested in crowd-pleasing than doing Mercury justice, but such a possibility feels sadly remote."
    },
    {
      "text": "A greatest hits movie. It's the neat, easily digestible version of Queen's career, and of Mercury's professional and personal ups and downs along with them."
    },
    {
      "text": "\"Adequate\" is an accurate assessment of Bohemian Rhapsody, and you really couldn't ask for a more damning indictment of a movie about the greatest rock singer of all time."
    },
    {
      "text": "An ahistorial jam session where everything is off cue."
    },
    {
      "text": "Probably 'A Star is Born' will collect more awards, but as far as memorable music and great musical performances, nothing I've seen this year comes close to 'Bohemian Rhapsody.'"
    },
    {
      "text": "Bohemian Rhapsody is one of those films that will either make you ecstatic or thoroughly annoyed. For me it's a joy. Yet I do get the annoyance."
    },
    {
      "text": "It's a shame that Bohemian Rhapsody evinces a formal and moral conservatism so at odds with its gender-bending, boundary-pushing, larger-than-life subject. Even without the sex and drugs, however, at least there's still plenty of rock'n'roll."
    },
    {
      "text": "It's a shame that such a didactic script and the attachment of Brian Singer taints what could have been a genuine and touching story."
    },
    {
      "text": "Under performing Queen biopic."
    },
    {
      "text": "This one is an all-around crowd pleaser made for fans that, much like Mercury himself, succeeds despite its flaws."
    },
    {
      "text": "The film's approach may not be especially deep, but it's undeniably entertaining."
    },
    {
      "text": "that most conventional of biopics, the kind that moves smoothly and efficiently from one greatest hits moment to the next-in this case, literally, as many of the film's narrative shifts pivot on the creation of one of Queen's hits"
    },
    {
      "text": "A biopicture that is all about the music of Queen and lead singer Freddie Mercury."
    },
    {
      "text": "People can bop to the music, see an imitation of their beloved frontman, and have the script pump inspirational narratives into their minds. For people who have always carried a love for Mercury and his fellow misfits, the film feels empty and shallow."
    },
    {
      "text": "The film boasts a wonderful lead performance from Rami Malek, but its clichéd narrative and sloppy, safe storytelling let down the larger-than-life figure at its center."
    },
    {
      "text": "It's a bog-standard rise-and-fall-and-rise music biopic, and whatever affection has attached to it is pretty much the work of Rami Malek."
    },
    {
      "text": "Rami Malek's portrayal of Mercury should garner well-deserved awards acclaim. Undoubtedly, it was one of the most enjoyable biopics I've ever watched."
    },
    {
      "text": "Malek's portrayal is not an impersonation, but an electric homage to a man who he knew never could, or should, be duplicated."
    },
    {
      "text": "The film seems more interested in selling Queen albums to a new generation than it is depicting the complexities of the men who helped to change the face of rock music."
    },
    {
      "text": "Bohemian Rhapsody isn't the great movie it might have been. It's too sanitized, too safe. But thanks to an incredible lead performance from Malek ... it's still a pretty good time."
    },
    {
      "text": "Historical accuracy is not my problem, do what you want to serve your creative vision. My problem is that there's no creative vision."
    },
    {
      "text": "While it was great seeing how the band got together and how the iconic songs were made, the film felt rushed and too convenient in the way it all fell into place."
    },
    {
      "text": "This film is nothing but window dressing, arranging and rearranging the legend of Freddie Mercury so that it becomes an even larger myth."
    },
    {
      "text": "For everything BOHEMIAN RHAPSODY does well, it does a lot worse. If you love Queen, maybe it is worth a trip to the cinema. On the other hand, you can just watch that Live Aid set on YouTube."
    },
    {
      "text": "One of the most frustrating movies I have seen in years, Rhapsody seems bound and determined to trip over its own feet at every turn. And yet, the music and one good-if-not-great performance keep it upright, though just barely."
    },
    {
      "text": "I came away thinking, \"this could have been so much more,\" but I don't quite know how. I really didn't want a movie that solely focused on Mercury's tragedies. Malek's knockout performance is reason enough to see this."
    },
    {
      "text": "Wrong, ugly and sad in so many ways."
    },
    {
      "text": "Despite all the problems and rumoured on-set arguments, the good news is that Bohemian Rhapsody still provides comedy, tragedy and a killer soundtrack."
    },
    {
      "text": "There's a lot to like, namely Rami Malek, who is essentially Freddie Mercury reincarnated... but overall, it was far too safe for my taste."
    },
    {
      "text": "Bohemian Rhapsody -- a biography, a musical, a history -- succeeds on all fronts whether Freddie Mercury is an unfamiliar face or the object of long fandom."
    },
    {
      "text": "All these disturbances decidedly took a toll on the finished product. All-in-all, Rami Malek's superlative performance keeps you riveted throughout..."
    },
    {
      "text": "Little more than a collection of sequences built around the performance of Queen songs, occasionally with some mediocre attempts to contextualise those songs."
    },
    {
      "text": "Despite some fairly wild deviations from the true stories, Bohemian Rhapsody is still an intensely satisfying movie led by a fearless performance from Rami Malek."
    },
    {
      "text": "Mercury was making love to the audience with every bone in his body. Malek never seems like he's in his body at all."
    },
    {
      "text": "No thanks to disgraced director Bryan Singer, whose terrible fingerprints are all over the project's biggest defects, star Rami Malek makes for an impeccable Freddie Mercury."
    },
    {
      "text": "It's in the title. There's a reason Bohemian Rhapsody is not called \"Queen\" or \"Mercury\" or \"I want to break free\". It is neither harmoniously collective nor ragingly individualistic. It is, in every sense, rhapsodic."
    },
    {
      "text": "In the end, the movie belongs to Freddie Mercury, the Bohemian rhapsodiser of the title, who conquers with his voice from beyond the grave. The movie comes alive every time Mercury's sonorous voice booms out of the screen."
    },
    {
      "text": "Bohemian Rhapsody is a movie that consciously tries to position a gay man at its center while strategically disengaging with the \"gay\" part as much as it can..."
    },
    {
      "text": "[It's] too interested in providing a good time to deliver a great movie. And by making Mercury's identity issues a band detail instead of [personal], it might be a bad one."
    },
    {
      "text": "A fitting tribute to Freddie Mercury and Queen, Bohamian Rhapsody is a stirring spectacle."
    },
    {
      "text": "It's like a best selling record; very enjoyable and entertaining, but nothing extraordinary. [Full Review in Spanish]"
    },
    {
      "text": "...a surface-level extended music video that has zero interest in honestly examining its characters' inner lives, distorts timelines for cheap dramatic shortcuts, and exists to prop up a new soundtrack featuring unearthed live material."
    },
    {
      "text": "Bohemian Rhapsody is biopic agony."
    },
    {
      "text": "Yes, the narrative moves too fast, but the film is worth seeing for exactly two reasons: Rami Malek's excellent work as Freddie Mercury... and the musical sequences (especially that of Live Aid). [Full review in Spanish]"
    },
    {
      "text": "The movie falls into some of the pitfalls of telescoping events to fit the format. But it heroically depicts the Queen era (late '70s-early '80s), and the band's phenomenal creative energy and output."
    },
    {
      "text": "The biopic is never as emotional as it should be, as lively as it should be, or as heartbreaking as it should be."
    },
    {
      "text": "A toothless, compromised mess, one that doesn't seem to have more than a passing understanding of its real-life protagonist."
    },
    {
      "text": "As with all dramatized stories of real lives, artistic license hammers messy reality into a watchable film. Dramas are not documentaries. The essential emotions of Freddie's life and the history of the band are here."
    },
    {
      "text": "To play any icon is like walking a tightrope above a rapaciously protective fanbase, but Malek embodies the man and the mystery he both detested and promoted."
    },
    {
      "text": "As for Freddie Mercury, is this his real life? Is this just fantasy - not sure that really matters either. When Malek's strutting like a peacock, this movie is a decently amusing escape from reality."
    },
    {
      "text": "Freddie's genius and unapologetic way of being himself were splashed across the screen and riddled with shame and loneliness at the same time. Rami was able to bring this duality of confidence and insecurity that tugged on my heartstrings the whole film."
    },
    {
      "text": "Bohemian Rhapsody is a frustrating and disappointing movie. [Full Review in Spanish]"
    },
    {
      "text": "Bohemian Rhapsody is made up almost entirely of contrived biopic signposts - a Queen's 'Greatest Hits' of ah-ha moments."
    },
    {
      "text": "The movie itself isn't killer, but the music is worthwhile."
    },
    {
      "text": "It's a crowd pleaser in the ultimate sense - building to a rousing final act that will leave audiences tapping their feet and humming along."
    },
    {
      "text": "Whether you are or were a Queen fan, Bohemian Rhapsody stands alone as a terrific film, made the more moving and engaging by the truth of its story, complete with its pathos, melancholy, triumph and death."
    },
    {
      "text": "Queen's seductive music and Rami Malek's scene-stealing performance as Freddie Mercury make Bohemian Rhapsody into epic cinematic poetry."
    },
    {
      "text": "You should, you should, see it."
    },
    {
      "text": "They told the story very well, it moved and it certainly wasn't boring. As far as entertainment goes...yes, all the yeses."
    },
    {
      "text": "It definitely moved me, it was emotional, but while watching I kept feeling that this was a little bit bleached, a little bit edgeless...sanitized, it feels like a comic book in a way..."
    },
    {
      "text": "Helmed by Bryan Singer, a highly competent director by any metric, \"Bohemian Rhapsody\" is about as safe and conventional a musical biopic as you will find."
    },
    {
      "text": "As a solid actor, Malek is able to fill in gaps were the script falls short, he delivers introspective moments that no lines could."
    },
    {
      "text": "Malek delivers a performance of churning self-belief, swagger and loneliness. But Mercury's sexuality and illness deserve more exploration and thoughtfulness than they get. The music storms through; this is the greatest showman in more ways than one."
    },
    {
      "text": "I really liked the film, but they did miss the boat on really giving this to the community that this should be for."
    },
    {
      "text": "Rami Malek should be nominated for this movie...he carried this movie on his shoulders, and he rocked it."
    },
    {
      "text": "With such a shallow and poorly developed take on this story, this film ends up feeling like a vanilla flavored .... take on what must have been a far more interesting story."
    },
    {
      "text": "The movie never explains what turned these particular misfits into champions. As a result, it too often feels like a smug rhapsody on success."
    },
    {
      "text": "We can bitch and whine about what's not here ... or we can sit back and enjoy the way it honours Mercury and Queen. I would much prefer to do the latter."
    },
    {
      "text": "The movie's sole aim is to be a \"Queen: Greatest Hits\" crowd-pleaser, and ultimately, despite its flaws, it succeeds."
    },
    {
      "text": "Despite everything... there was something in those images that manipulated with force and precision the time, the memories, the frustrations. [Full review in Spanish]"
    },
    {
      "text": "\"Bohemian Rhapsody\" is a fun ride that will put a lump in your throat, a tear in your eye, and more than one terrific song in your heart. Go with it."
    },
    {
      "text": "[Rami Malek] owns that big stage presence energy and clearly studied Freddie down to a tee."
    },
    {
      "text": "Malek offers an utterly compelling performance as the Freddie Mercury we know, but the constraints of the film and that all-important PG-13 rating leave no time for the Freddie Mercury we don't know, and that's what we'd love to have seen more of."
    },
    {
      "text": "It is terribly conventional and does not always match Malik's commitment to the wild physicality of this supremely talented artist."
    },
    {
      "text": "Malek does an impressive job of re-creating Mercury's moves onstage, but the core of the performance is Malek's intensely thoughtful, insight-rich channelling of Mercury's hurt, his alienation and isolation even at the height of his fame."
    },
    {
      "text": "Bohemian Rhapsody will do as a start. But I still think Sacha Baron Cohen had the right idea."
    },
    {
      "text": "...has its problems but Malek delivers an engaging performance that channels the true essence of Freddie Mercury. This one is sure to please fans. Rock on."
    },
    {
      "text": "Bohemian Rhapsody is not so much a film as it is a dramatization of a Wikipedia entry, watered down and overedited."
    },
    {
      "text": "Rami Malek as Freddie Mercury is worth the price of admission!"
    },
    {
      "text": "A song-for-song, riff-for-riff re-enactment of a short stage show is a weird way to end a movie, but Bohemian Rhapsody gets away with it purely because of the go-for-broke gusto with which Malek as Mercury embraces the idea."
    },
    {
      "text": "Bohemian Rhapsody is too engaged with the spectacle to take heed of the very human, inherently mystifying and intriguing man at its core."
    },
    {
      "text": "I liked that they didn't try to sugar-coat...if you want to be listening to this soundtrack for the end of time, spend your coins on this and go see it in theaters."
    },
    {
      "text": "Even if you hadn't ever seen Freddie Mercury speak or move, Malek seems to embody him through and through and crafts a performance that does justice to the legend and the man himself."
    },
    {
      "text": "Do not miss Bohemian Rhapsody and hopefully you can watch it again. [Full review in Spanish]"
    },
    {
      "text": "Bohemian Rhapsody fancies itself like the song, ranging a gambit of genres at an inexplicable fashion and expecting its audience to love the certain absurdity of it all."
    },
    {
      "text": "I wasn't alive when Queen reigned supreme, but seeing Bohemian Rhapsody in theaters was the next best thing. This is a film for the optimists, the music lovers, and the champions of the world."
    },
    {
      "text": "Singer's take on Mercury's tumultuous life is glossy and superficial but the film's strength lies in its portrayal of Mercury's, and the band's talent."
    },
    {
      "text": "As a longtime Queen fan, I felt an ache in my chest for Mercury and his memory. More than Queen faithfuls, the one-of-a-kind talent deserved a blue-chip biopic. Sadly, Bohemian Rhapsody isn't it."
    },
    {
      "text": "Find the theater with the biggest screen with the best sound to enjoy this epic musical. [Full Review in Spanish]"
    },
    {
      "text": "You leave the cinema knowing you've been had, but still feeling uplifted."
    },
    {
      "text": "The long-awaited, much-feared biopic of Queen lead singer Freddie Mercury turns out, thankfully, to be a respectable and respectful tribute to glam rock's most flamboyant ambassador...Rami Malek carries the film with aplomb."
    },
    {
      "text": "Wildly uneven, BOHEMIAN RHAPSODY is still very entertaining. Excellent performances by stars Lee, Hardy, Mazzello, Boynton and an Oscar nom worthy Rami Malek moors the clunky script and reminds us of the magnificence that was Freddie Mercury."
    },
    {
      "text": "With Bohemian Rhapsody, what we have here is a dumb and obvious film that features a number of strong performances and Queen's astounding music. It's a highly entertaining bad movie that often works in spite of itself."
    },
    {
      "text": "An Oscar-worthy performance stuck in a mediocre script, basically a great Freddie Mercury impersonator lip-syncing Queen's greatest hits for 2 hours. Entertaining but hollow."
    },
    {
      "text": "The sort of watered-down pablum that should be embarrassed to show its face in a world where Walk Hard: The Dewey Cox Story exists."
    },
    {
      "text": "[It's] possible I hated this overblown mess of a musical biopic something fierce, and I'd rather not say another word about it."
    },
    {
      "text": "Queen's stunning, 20-minute performance at 1985's star-studded \"Live Aid\" charity concert seems perfectly re-created, too, in helping bring down the curtain on a film that might actually really rock you."
    },
    {
      "text": "Rami Malek lives up to Freddie Mercury's lavish and over-the-top persona as he belts out one hit song after another in a tribute worthy of Queen's status among rock legends."
    },
    {
      "text": "Sinuous Rami Malek's magnificent performance should be high on the list for an Oscar nomination."
    },
    {
      "text": "The film suffers from the utterly poor direction of Bryan Singer."
    },
    {
      "text": "The movie's saving grace is its leading man, Rami Malek, and his blistering recreation of Mercury's on-stage performances, both of which capture our memories of Queen with comforting fidelity."
    },
    {
      "text": "Rami Malek and the entire cast performances are pitch perfect. And then there is the power of the music! This is must see moviemaking at its best."
    },
    {
      "text": "[Malek] is endlessly charismatic and somehow pulls off the physicality needed to approximate Mercury on stage."
    },
    {
      "text": "The music sequences in this drama (especially the Live Aid performance and the recording of the title song) are electrifying, and Malek is magnetic, but overall the movie is slavishly by-the-numbers."
    },
    {
      "text": "Is this the real life? Is this just fantasy? Judging by Anthony McCarten's screenplay, the biopic falls in the \"fantasy\" category. Facts are sacrificed for entertainment in Bryan Singer's crowd pleaser which features an electrifying Rami Malek."
    },
    {
      "text": "Rami Malek's extraordinary performance and the recreation of Queen's Live Aid performance are more than worth the price of admission."
    },
    {
      "text": "Ideally, a film like this would attempt to add to, or to contextualize, a legacy. Instead, \"Bohemian Rhapsody\" tries to sanctify it, pack it in bubble wrap to protect it from causing, or being caught in, any friction."
    },
    {
      "text": "About as by the numbers and monotonous as you can expect from an end of the year musical biopic with Oscar aspirations."
    },
    {
      "text": "If you can accept that the film is going to cherry-pick certain moments from the band's career and omit others, you'll get a perfectly-entertaining, if not especially original rock biopic."
    },
    {
      "text": "Rami Malek takes over the role of Freddie Mercury without really imitating or seeming like a copy lacking personality. [Full Review in Spanish]"
    },
    {
      "text": "You might walk out of Bohemian Rhapsody with a smile, but it sells short as a biography, an exploration of their creative process or the interpretation of Mercury himself. [Full Review in Spanish]"
    },
    {
      "text": "Rami Malek blew me away."
    },
    {
      "text": "Malek is so stellar in his portrayal and the music is just so good that I found myself completely entertained from start to finish. (Full Content Review for Parents - Profanity, Sexual Content, etc. - also Available)"
    },
    {
      "text": "So in too many aspects the journey does not go beyond the superficial and judgmental, culminating in a long final sequence that is configured as the paradigm of the film for fans. [Full Review in Spanish]"
    },
    {
      "text": "The biopic treatment is not the equal of its subject, but it is still a well-made and loving tribute that will send you scurrying to dig out your old Queen LPs, to remember what all the fuss was about."
    },
    {
      "text": "A weirdly punishing portrait of Freddie Mercury."
    },
    {
      "text": "[Any]drawbacks will be forgotten once Mercury takes the stage at Wembley and delivers an electrifying performance. \"Bohemian Rhapsody\" redeems itself by letting the music speak volumes. And Malek's show-stopping concert performance makes the film sing."
    },
    {
      "text": "As a backstage story, Bohemian Rhapsody doesn't live up to its bohemian, post-glam-rock promise."
    },
    {
      "text": "If you are a Queen fan, the music is there and provides entertainment but at 135 minutes, the razzle dazzle wears thin and feels stretched."
    },
    {
      "text": "The problem is, inevitably the songs end. And when they do, you might wish you'd just put on a record instead."
    },
    {
      "text": "This powerful Rhapsody, 10 years in the making, is really more Queen than Freddie -- a spectacle of joyful and electrifying rock 'n' roll."
    },
    {
      "text": "This movie is about heart and writer/director Bryan Singer opts not to shine a light on any cracks in the veneer."
    },
    {
      "text": "The film only plays like a summary of Freddie's life, a bullet-point presentation of key moments, without angles or attitude, without ambition or even style."
    },
    {
      "text": "This is the karaoke version of Queen. All the notes are there, but not the soul."
    },
    {
      "text": "The film is surprisingly smooth. Too smooth. The way Freddie Mercury lived his life, he deserved a movie guaranteed to blow our minds. Think, say, director Ken Russell at his balls-out, gaga peak. PG-13 just won't cut it."
    },
    {
      "text": "So much here is unconvincing: the 1970s are too clean; some of the studio scenes feel fake despite approval by the real Brian and Roger; and Malek at times nearly gags on his fake chompers."
    },
    {
      "text": "With such a cultural purview, who's to say that Bohemian Rhapsody - which aspires to little beyond simply entertaining its audience in the most generalist way - isn't successful?"
    },
    {
      "text": "I can't remember the last time I have been so gripped by an actor's performance, from the first frame to the last."
    },
    {
      "text": "While in many ways the stylish film lacks the ambition of its subjects, it's quite a showcase for the music, first and foremost, which pushes boundaries and combines genres."
    },
    {
      "text": "We're supposed to settle again, this time with the sanitized, mean-spirited, gay-shaming, and altogether lame biopic of Freddie Mercury...Bohemian Rhapsody is that disappointing."
    },
    {
      "text": "The film still doesn't quite know how to capture or contain that energy, so it all just sort of goes splat on-screen. It's haphazard, and it somehow just barely works."
    },
    {
      "text": "Rami Malek's incredible turn as Freddie Mercury singlehandedly saves this too-by-the numbers musical biopic. [Full review in Spanish]"
    },
    {
      "text": "The truth is that only Rami Malek stands out, although totally delivers, making an impression with every gesture and penetrating look. [Full Review in Spanish]"
    },
    {
      "text": "It's basically Walk Hard without the parody or the jokes. It takes a particular set of balls to non-ironically string together the same exact formula more than ten years after Jake Kasdan's underrated comedy classic skewered it."
    },
    {
      "text": "Good music and the relationships with the band were my standouts."
    },
    {
      "text": "It's a film for fans, and for those who want to know more about the band and what it meant. [Full Review in Spanish]"
    },
    {
      "text": "Freddie Mercury deserves better."
    },
    {
      "text": "It's meticulously staged on a grand and exhilarating scale and the figure of Malek, strutting and capering before that swaying, chanting mass of humanity seems to embody all rock stars in both their vanity and their courage."
    },
    {
      "text": "On the one hand, we've got a muddied, even tame dramatic story. On the other hand, we've got sheer glory in the creativity and performance of Queen...Glory wins out."
    },
    {
      "text": "Bohemian Rhapsody is polite to the point of quailing, a deeply inoffensive and bland film about the life of one of the most wilfully offensive and interesting figures in the rock pantheon."
    },
    {
      "text": "A gift to Queen fans. Rami Malek is astonishing as Freddie Mercury. Live Aid ending is enormous high."
    },
    {
      "text": "Some of the liberties do Mercury and Queen an injustice, but most are harmless (if dim). A hundred small things wrong barely matter when there are one or two big things right."
    },
    {
      "text": "It takes a certain degree of, um, talent to make a crashingly dull movie about Freddie Mercury, one of the least drab humans who ever lived."
    },
    {
      "text": "The biggest failing of the movie is that it works too hard to be a movie, and not nearly hard enough at telling the tragic story of Mercury and the glory of Queen."
    },
    {
      "text": "BOHEMIAN RHAPSODY is THE cinematic experience of the year! A fully sensory explosion of movies and music and mastery. Rami Malek is transcendent and beyond Oscar-worthy. And if an Oscar were to be given for casting, hand it to Susie Figgis now."
    },
    {
      "text": "This was a legit, good peek behind the curtain of the life of a very influential artist... If for nothing else, watch it just to watch Rami Malek's performance."
    },
    {
      "text": "Bizarrely, the film plays out almost the entire set as a kind of filler, while also trying to cram in enough emotional resonance to fulfill an audience's expectation for sweet-laced closure."
    },
    {
      "text": "The film gets out of the way of Malek's performance, but it never gives him anything back. It's a film and a performance obsessed with iconography and appearance and an overall work that doesn't care in the slightest about personality or empathy."
    },
    {
      "text": "It's cautious and inoffensive. And that's exactly why it's so disappointing. The Freddie Mercury biopic is the antithesis of its subject's abundant energy, his fearless artistry."
    },
    {
      "text": "The kind of show-the-work exhausting 'meticulously-detailed imitation of a famous dead person's widely-remembered mannerisms' performance that's been known to induce priapic erections in Academy Awards voters."
    },
    {
      "text": "Bohemian Rhapsody is determined to remain an upbeat crowd-pleaser throughout, despite what history tells us."
    },
    {
      "text": "Bohemian Rhapsody may not be a great film (and I have no idea how accurate it is) but it's definitely entertaining. This is a celebration of the music Queen created and the man whose voice and presence will never be forgotten."
    },
    {
      "text": "Mercury turns in the performance of his young career, channeling Mercury's flamboyance, charisma and showmanship."
    },
    {
      "text": "In short, this is a Queen biopic for people who like their music biz stories tame, easily digestible and, in the sexuality spectrum, at least 75 percent straight."
    },
    {
      "text": "\"Bohemian Rhapsody\" is most enjoyable during its grand concert scenes where Malek does an uncanny job capturing the style and mannerisms of the great vocalist. The raw energy, burning charisma and general likeability of Mercury come across brilliantly."
    },
    {
      "text": "Bohemian Rhapsody may not totally rock you, but Rami Malek channels the thrilling, show-stopping charisma of the late Queen super singer, ensuring this inappropriately timid biopic is as entertaining as it can possibly be."
    },
    {
      "text": "Embrace the vintage silliness. It's worth it."
    },
    {
      "text": "Rami Malek, drenched with charisma and sex appeal embodied Freddie Mercury in Bohemian Rhapsody. He didn't portray him nor imitate him. He was him."
    },
    {
      "text": "Here's how Rami Malek crushes the film's by-the-numbers plotting and vapid first act."
    },
    {
      "text": "...concludes with a final sequence that is absolutely transcendent and will make you forget about the sometimes pedestrian material that preceded it."
    },
    {
      "text": "\"Bohemian Rhapsody\" never has a mundane moment. Sparked by the performance by Malek and the amazing music of Queen, this movie generates a massive amount of creative energy."
    },
    {
      "text": "More like Bohemian Parody."
    },
    {
      "text": "Has a dutiful, respectable air about it."
    },
    {
      "text": "It's not real. It's not honest. It lacks the magic to live forever."
    },
    {
      "text": "Wearing its PG-13 rating proudly, this soft biopic is aimed directly at a younger generation that discovered the chart-topping music in high school chorus class."
    },
    {
      "text": "\"Bohemian Rhapsody\" is a just-good movie with a great performance...In other words, it is entertaining, if not illuminating."
    },
    {
      "text": "The biopic reaches out for the very last row, and in doing so, it becomes unfortunately basic, flattening out the fascinating character while sanding down and rearranging elements of the story to serve the band."
    },
    {
      "text": "Bohemian Rhapsody delivers a paint by numbers but nonetheless captivating and even emotionally uplifting rendition of Queen's and Freddie Mercury's trajectory, with a stunning turn by Rami Malek"
    },
    {
      "text": "The film is so much fun yet so moving it doesn't matter if the story is not 100% accurate and doesn't truly and completely document the band's meteoric rise to fame. It rocks!"
    },
    {
      "text": "The problem with all this meticulous recreation is that, in the end, it rings hollow."
    },
    {
      "text": "While historical accuracy is not the first priority, the point of the story is sacrifice: the artist on a cross. That may seem a bit grandiose, but grandiosity was always the fuel source of Queen and Freddie Mercury-and of Bohemian Rhapsody as well."
    },
    {
      "text": "I went into the theater hoping for the best, and I got it. While not a concert film, the engaging portrayal of the band's creative process repeatedly leads to electric performances of their songs."
    },
    {
      "text": "There's nothing interesting or exciting about this portrayal of Freddie Mercury. He's a bystander in his own life, flitting from moment to moment until the movie dials up another Queen performance."
    },
    {
      "text": "The film is a decidedly mixed bag, feeling thoroughly confused, but ultimately it manages to honor Mercury's talent."
    },
    {
      "text": "Meaning that as a Mercury biopic it might be questionable, but as an extended-play music video of Queen's music it's irresistible..."
    },
    {
      "text": "Crackles with snappy dialogue, rarely plods and finds the characters' voices with little problem. If any issue exists it's courtesy of a film that lacks a plot."
    },
    {
      "text": "Glorifying and sanitizing."
    },
    {
      "text": "Despite its formulaic waltz - precipitous fame, internal fracturing, drugs, tardiness, reconciliation - the film hums along with a fantastic sense of energy."
    },
    {
      "text": "Bohemian Rhapsody provides casual fans with some raucous concert re-enactments, but those seeking insight into the band's and particularly Mercury's history should look elsewhere."
    },
    {
      "text": "It asks the question of whether or not watching this movie is any better or worse than watching a good tribute band."
    },
    {
      "text": "The final product may shortchange both sides of its equation, but fans will probably still enjoy what Singer put on the screen. As a musical biopic, \"Bohemian Rhapsody\" is ultimately more interested in the greatest hits than mining deep cuts."
    },
    {
      "text": "Generally, the film feels like it is authentic."
    },
    {
      "text": "By the skin of his prosthetic teeth, however, Malek just manages to drag Bohemian Rhapsody into competence."
    },
    {
      "text": "While \"Bohemian Rhapsody\" soars at covering the band's talent as songwriters, musicians and onstage performers, it fails to explain the source of Mercury's lyrical gifts, his ostentatious personality and gargantuan self-confidence and self-centeredness."
    },
    {
      "text": "Buoyed by the infectious Queen soundtrack and Rami Malek's killer performance, 'Bohemian Rhapsody' will rock you."
    },
    {
      "text": "A standard musical biopic with all the conventions in place... Still, the music is electrifying, and Malek is a stellar presence, as is Lucy Boynton as Mary Austin."
    },
    {
      "text": "If a film this crummy had been perpetrated on most ordinary rock stars, that would be bad enough but to present the life of someone as bold and iconoclastic as Mercury in such a formulaic manner almost feels like an insult."
    },
    {
      "text": "To think about how much is missing from Bohemian Rhapsody hurts, not simply because it doesn't paint a full picture of the man we know as Freddie Mercury, but because it paints something that doesn't feel honest."
    },
    {
      "text": "The only thing that's surprising about this film is the endeavor to turning it into one more post-mortem marketing product. [Full Review in Spanish]"
    },
    {
      "text": "[Malek creates] a soulful impression of the late great rock star, successfully channelling Mercury's sinuous stage persona in a series of charismatic concert performances underpinned by Queen's rousing back catalogue."
    },
    {
      "text": "Oh, what I wouldn't give for a little of that sense of danger, that reckless abandon in service to the beat, anywhere during the 135 minutes of \"Bohemian Rhapsody.\""
    },
    {
      "text": "Taken strictly on its terms, Bohemian Rhapsody is a credible exercise in nostalgia, if not an especially inspired one."
    },
    {
      "text": "Malek has the ineffable pixie dust the part requires (if not the teeth; the famous Freddie overbite is prosthetic)."
    },
    {
      "text": "Queen enthusiasts will probably choke on some of the egregious sins against chronology and raw facts committed to cram the real story into the format. However, where the script succeeds is in the most complicated part of Mercury: his approach to love."
    },
    {
      "text": "\"Rhapsody\" Missing a Few Vital Notes."
    },
    {
      "text": "When all was said and done, Queen just wanted to have fun. Which is why I'm inclined to cut much slack for Singer's approach, which follows a Rock 101 storytelling template: Levis to leather pants, superstardom to squabbles, leave-taking to Live Aid."
    },
    {
      "text": "Between Malek and the incredible music, the film gets the job done-but just barely."
    },
    {
      "text": "If you love great rock music presented with dynamic flair, this is one movie that will make you want to wax rhapsodically. Well worth the money for anyone who loves great rock and roll, it's like having a concert and a movie rolled into one."
    },
    {
      "text": "The film's finale is a recreation of Queen's iconic Live Aid set, with Malek performing a move-for-move re-enactment, not missing a beat. Three decades later, it still will rock you."
    },
    {
      "text": "Proves the task of trying to define Queen may be impossible."
    },
    {
      "text": "Nothing more than a conventional, old fashioned musical biography, but one done up with such verve and technical proficiency that it's engaging from beginning to end."
    },
    {
      "text": "Even as a celebration of Queen's music, Rhapsody is superficial and unconvincing, functioning only as a collection of mediocre music videos."
    },
    {
      "text": "You'll leave grinning and humming Queen anthems for days to come."
    },
    {
      "text": "By rights, this ought to be a glammed-up, sexually-charged, four-octave blowout. Instead, it's a stilted, stagy, hopelessly corny biopic, the kind of thing \"Walk Hard\" was meant to prevent."
    },
    {
      "text": "The trouble isn't really star Rami Malek, who gives a mesmerizing if opaque performance as Mercury. The problem is that the movie doesn't have anything interesting to say."
    },
    {
      "text": "What could be a strutting, fabulous testament to the glamour of Queen's arena-rock showboating is instead hamstrung with the need to explain, and then underline that explanation, and then circle it..."
    },
    {
      "text": "An entertaining movie that sometimes chastise Mercury more than honor him but gets upped by Malik's almost mystical performance (Full Spanish review in link)"
    },
    {
      "text": "[Malek] burns up the screen as Mercury whether dealing with intimate personal issues, ego-driven conflicts behind the scenes, or on stage in performance."
    },
    {
      "text": "Bohemian Rhapsody fulfils its checklist as a Queen biopic, delivering a feel-good movie that hits all the expected notes without particularly innovating otherwise."
    },
    {
      "text": "The film is the cinematic equivalent of a rudimentarily assembled greatest-hits compilation when we instead needed a collection of deep album cuts. Nevertheless, Rhapsody will rock you."
    },
    {
      "text": "Queen made great albums; Bohemian Rhapsody is just a playlist."
    },
    {
      "text": "Bohemian Rhapsody may get us to raise our voices and sing, but it won't make us raise our eyebrows in piqued interest beyond the music."
    },
    {
      "text": "Save for the music, there's nothing authentic about it."
    },
    {
      "text": "This movie is nothing but shortcuts... It's movie karaoke."
    },
    {
      "text": "It feels phony... They took a larger-than-life band... and put them in a biopic that is painfully typical."
    },
    {
      "text": "But, the film works. And I reckon that's down - mostly - to the absolutely astonishing performance by Rami Malek as Mercury."
    },
    {
      "text": "Fortunately, Malek, working with a script that is more a series of standard tropes than compelling story, presents the right mix of outrageous ego, savage wit, languid ennui, & vulnerable insecurity that makes him empathetic even Mercury is being a jerk."
    },
    {
      "text": "Great movies often have great performances, but I think it must be harder for an actor to give a great performance in the midst of a bad movie. You see where I'm going with this, don't you?"
    },
    {
      "text": "Contradictions. All I know for sure is that Queen was a magnificent band, Freddie Mercury had an incredible voice, and Radio Ga Ga is still a banger. I knew those things going into Bohemian Rhapsody, but it was nice to see it confirmed."
    },
    {
      "text": "So I enjoyed the film, even as I wished for more from the director, Bryan Singer, than lackluster cinematic and thematic choices."
    },
    {
      "text": "As turbulent as Mercury's wild life is the production of the biographical drama Bohemian Rhapsody, a tribute to the whole group, but with a clear focus on its dazzling leader. [Full review in Spanish]"
    },
    {
      "text": "Rami Malek will rock you! [Full review in Spanish]"
    },
    {
      "text": "Bohemian Rhapsody doesn't suck. There's a soul inside it, and some anguish, too."
    },
    {
      "text": "Highlighted by wonderful music and performances, Rami Malek looks like Freddie Mercury, walks like him, and performs like him."
    },
    {
      "text": "Yes, it's entertaining, even euphoric in parts but as a deep dive into the rock icon's life this biopic is disappointingly safe."
    },
    {
      "text": "While a touch too vanilla and very sanitized, BOHEMIAN RHAPSODY works the way it was intended, as a celebration of the band and its music."
    },
    {
      "text": "In struggling to make a salable PG-13 movie out of an R-rated rock life, this Queen biopic stumbles. But there's only praise to heap on Rami Malek whose tour de force performance as Freddie Mercury will definitely rock you."
    },
    {
      "text": "The story is strong, that acting is fantastic and, well, you can't beat the hit songs... Bohemian Rhapsody is a must-see classic-rock movie masterpiece."
    },
    {
      "text": "Pretty much everyone in this film is a cipher, particularly Mercury's bandmates."
    },
    {
      "text": "An exuberant celebration of not just Freddie Mercury, but the band Queen and the volatile nature of creativity."
    },
    {
      "text": "For a man and a band that were so groundbreaking, so fixated on musical revolution, this is supremely cheap work."
    },
    {
      "text": "With actor Rami Malek transforming into a larger-than-life legend like Freddie Mercury and delivering the best performance of his young career - and an Oscar-worthy one at that - he keeps the film from going completely out of tune."
    },
    {
      "text": "Care is taken to coat everything with a layer of light, self-deprecating comedy. It is as if Mercury or May are on the couch, regaling a talk-show audience with an anecdote."
    },
    {
      "text": "This isn't the deep dive Behind the Music look at Queen, but it's got enough going in its favor to be a winner, if not the champion of musical biopics."
    },
    {
      "text": "\"Bohemian Rhapsody\" winds up being giddily entertaining, first as an exercise in so-bad-it's-funny kitsch, and ultimately as something far more meaningful and thrilling."
    },
    {
      "text": "Bohemian Rhapsody is the fast food of music biopics. It looks delicious in its advertisements, but is ultimately tasteless and leaves you with nothing but dissatisfaction."
    },
    {
      "text": "Most of the non-music segments feel contrived and soap-like. There is barely a believable conversation in the entire film."
    },
    {
      "text": "The music is great, but the biographical elements come off as a deeply puritan \"Partying and gay sex are bad, mkay?\" afterschool special."
    },
    {
      "text": "On the spectrum of Queen, this is no \"Bohemian Rhapsody\" masterpiece, but it's not quite \"I'm In Love With My Car.\""
    },
    {
      "text": "Rami Malek brings warmth, humor, and a down-to-earth humanity to the larger-than-life Freddie Mercury. But it is the power of Queen's music - the rousing good cheer, its sheer rock 'n' roll joy - that fills up this pure brash entertainment."
    },
    {
      "text": "Bohemian Rhapsody might be easy come, easy go, but Malek makes for a show-stopping silhouetto of a man."
    },
    {
      "text": "The swift yet lengthy Bohemian Rhapsody often verges on becoming something as thrilling as Queen itself - and then crashes back into the off-putting, the ill-considered or the ridiculous."
    },
    {
      "text": "Bohemian Rhapsody is bad in the way a lot of biopics are bad: it's superficial, it avoids complexity, and the narrative has a connect-the-dots quality."
    },
    {
      "text": "It's flawed but Bohemian Rhapsody still manages to be gripping, mostly because of Rami Malek, whose performance as Freddie Mercury is towering."
    },
    {
      "text": "\"Bohemian Rhapsody\" does deliver what any music biopic must: convincing characters and some kick-butt simulated concert experiences."
    },
    {
      "text": "A baroque blend of gibberish, mysticism and melodrama, the film seems engineered to be as unmemorable as possible, with the exception of the prosthetic teeth worn by the lead actor, Rami Malek, who plays Freddie Mercury, Queen's lead singer."
    },
    {
      "text": "there is no denying the magnetism of Rami Malek's performance. You cannot take your eyes off him. But the film he inhabits...is mostly a paint-by-the-numbers affair, hopscotching from one important event to the next with little pause for reflection."
    },
    {
      "text": "Malek's remarkable, spellbinding performance almost makes you forget you're really watching a quasi-Queen with a faux Freddie."
    },
    {
      "text": "Why'd anyone want to watch them do the Lip Sync Challenge after two long hours, when we just wanna get out, just wanna get right outta here?"
    },
    {
      "text": "The movie is both flimsy and wholly enjoyable at the same time, in the strange manner of biopics, which follow in the jet stream of someone else's artistry while caring little for their own clunky, cuboid dimensions."
    },
    {
      "text": "[A] sprawling, jumbled and disappointingly airbrushed new movie about the legendary rock band and especially its incandescent frontman, Freddie Mercury (Rami Malek)."
    },
    {
      "text": "Bohemian Rhapsody isn't quite killer Queen but it's enjoyably close. Despite the teeth."
    },
    {
      "text": "Dazzlingly captures an era, a man and the universal quest for identity."
    },
    {
      "text": "Bohemian Rhapsody loses itself in the attempt to avoid the controversial issues in Mercury's life, leaving us with only his stage figure, but that is well worth it and if you are not very demanding, it will not disappoint. [Full review in Spanish]"
    },
    {
      "text": "Rami Malek shines as the frontman, giving a portrayal of an, ahem, mercurial lead singer, giving light to a fairly straightforward story."
    },
    {
      "text": "Malek handles a pair of dentures and Freddie's oddly plummy speaking voice with aplomb, and captures the cheeky, charming, outrageous persona with which Mercury both confronted the world and protected himself from it."
    },
    {
      "text": "Oh! my great aunt Ada, what an anodyne cop-out to reduce a man of infinite flamboyance and indulgence to the almost mundane."
    },
    {
      "text": "Most of the film is stuffed with lumps of cheesy rock-speak (\"We're just not thinking big enough\"; \"I won't compromise my vision\"), and gives off the delicious aroma of parody."
    },
    {
      "text": "Rami Malek is terrific playing Queen frontman Freddie Mercury, that's for sure, but the movie itself falls short of the intended mark. It simply has very little to say about its subject."
    },
    {
      "text": "This isn't a documentary, rather reality reimagined as a highly entertaining, bombastic fairy tale."
    },
    {
      "text": "Singer's film sure could have used more rhapsody because whenever Freddie and the band focus on the music, 'Bohemian Rhapsody' truly sings."
    },
    {
      "text": "A breathtaking performance... the eerie and exemplary portrayal by Malik ... an inspiration for accepting family (biological or tribal) regardless of its flaws. Freddie is missed and was loved, but the show must go on."
    },
    {
      "text": "Malek's sublime performance and the smashing soundtrack of Queen's greatest hits are ultimately masking a generic, by-the-numbers film that consistently plays it far too safe."
    },
    {
      "text": "It's hard to come up with someone who would have been better than Malek. To his credit, he does the one thing that would most seem impossible: In the stage scenes, he makes you believe he's Freddie Mercury."
    },
    {
      "text": "Fans of the band might enjoy watching the movie cycle through their hits (and there are many), but those, like me, hoping for a more robust appraisal of the late Freddie Mercury may find themselves disappointed."
    },
    {
      "text": "And yet, for all its faults, there's enough going on in Bohemian Rhapsody that grabs the attention. This mostly falls at the feet of Rami Malek, who goes above and beyond."
    },
    {
      "text": "Not quite guaranteed to blow your mind. However, it does have emotional heft and that extended Live Aid scene is worth it alone."
    },
    {
      "text": "Malek is electrifying in the role, and in the end Bohemian Rhapsody celebrates Queen's oeuvre and, in moments both intimate and entertaining, its creation."
    },
    {
      "text": "It delivered. I love this. Probably one of my favorite movies of the year, thus far."
    },
    {
      "text": "They don't get below the skin, per say, but it's a hell of a ride watching it...one of the more impressive performances I've seen on celluloid."
    },
    {
      "text": "The scenes with the band in the studio are among the film's finest. There are some gloriously Spinal Tap moments, particularly during the recording of the title song."
    },
    {
      "text": "No matter your age, race, sexual orientation, you name it, when you're singing along with more than 70,000 people, you're all on the same level sharing the same passion, and celebrating music and life that way for a moment in this movie felt special."
    },
    {
      "text": "It does work."
    },
    {
      "text": "It's polished, inauthentic, sanitised, and plays like a 130-minute trailer."
    },
    {
      "text": "Bohemian Rhapsody attempts to work through this moral conundrum for Queen's pious fans. And I hope they enjoy it, because I think they're the only fans who can."
    },
    {
      "text": "Malek is forced to carry this film, and much of his performance is flamboyance and kitsch masquerading as personality."
    },
    {
      "text": "It's a film that carries on (carries on), but ultimately doesn't really matter."
    },
    {
      "text": "Despite a strong performance by Malek, Bohemian Rhapsody plays out as an excessively sanitized version of Queen's story, rather than a labor of love."
    },
    {
      "text": "A pricey, showy presentation can't make up for a bargain story in Bohemian Rhapsody."
    },
    {
      "text": "...it is not necessary to like Queen's music in order to find this film watchable and mildly enjoyable."
    },
    {
      "text": "The movie is at its best when the focus is on the music ..."
    },
    {
      "text": "Rami Malek's all-encompassing performance vibrantly steals every scene he inhabits. It's an excellent portrayal of an excellent musician. A flawed movie surrounds him but his captivating acting and bustling persona smooth out the rough spots."
    },
    {
      "text": "The volatile stream of Mercury running through it holds our interest. His otherworldliness, his peacock preening and his cocky sexuality all come from tangled roots."
    },
    {
      "text": "The tears I shed in the cinema were for the glorious exhilaration of it all. Freddie shed his tears in private for his own demons and unimaginable pain - and perhaps that is the way it should stay."
    },
    {
      "text": "Rami Malek delivers an unforgettable performance in a breakout role destined to be remembered come awards season."
    },
    {
      "text": "Bohemian Rhapsody desperately wants the accolade of being a greatest hits album, and ends up playing more like a one hit wonder."
    },
    {
      "text": "The cartoon unreality of Bohemian Rhapsody will feel, to many fans, like being trapped in a Queen nightmare."
    },
    {
      "text": "The costumes and wigs are splendid, and the songs are still up to snuff. But this homage to a showman is more famine than feast."
    },
    {
      "text": "While the film is definitely entertaining because of extensive use of the group's greatest hits and Ramek's lively performance, the rest is as substantive as one of the band's concert anthems."
    },
    {
      "text": "Appropriately for a group known for its theatrical, crowd-pleasing tunes, this biopic carries itself lightly, serving up familiar plot points with panache and a sense of humor."
    },
    {
      "text": "The production has taken 15 years of pure theatrical energy and made a slog of a movie."
    },
    {
      "text": "Full of the music you will fondly remember and featuring one of the most immersive performances by an actor EVER, \"Bohemian Rhapsody\" is a musical masterpiece."
    },
    {
      "text": "A dramatisation about the making of Bohemian Rhapsody might have resulted in a much better film than what we've been given."
    },
    {
      "text": "The broad and larky tone suits the early days of wide-eyed tours and Top of the Pops. But as the script frantically scrolls through the band's Wikipedia page, the cast rarely have the chance for more than mimicry."
    },
    {
      "text": "Malek is magnetic..."
    },
    {
      "text": "Bohemian Rhapsody is a rollicking, high energy tribute. Rami Malek is the embodiment of Freddie Mercury. He carries Bohemian Rhapsody from the first frame to the last."
    },
    {
      "text": "Bohemian Rhapsody, an eight-year abomination in the making...cannot claim to have achieved even wiki-movie status."
    },
    {
      "text": "Bohemian Rhapsody is fun but entirely superficial, playing it safe rather than trying to be as bold or brazen as its larger-than-life subject."
    },
    {
      "text": "The film just about deserves the review that was given to the group's most memorable single, and which is quoted halfway through: it's \"perfectly adequate\"."
    },
    {
      "text": "The music of Queen will live forever, but this fan hopes the tonedeaf and overpriced tat will not."
    },
    {
      "text": "Toothless mass-market pop revisionism which is no where near as cool or compelling as its subject."
    },
    {
      "text": "A loud but disappointingly tame account that follows a generic by the numbers screenplay..."
    },
    {
      "text": "Queen fans will most definitely find a great deal of enjoyment, but it's the diehards and film aficionados that will come away feeling cheated out of an amazing and truthful biopic"
    },
    {
      "text": "Bohemian Rhapsody has some major issues in telling the true story."
    },
    {
      "text": "Bohemian Rhapsody is... a \"[rotten] sort of cheese waiting on the shelf.\""
    },
    {
      "text": "You don't see actors acting, but four band members working together on their music and building their careers."
    },
    {
      "text": "Rami Malek as Freddie Mercury gives a transformative performance."
    },
    {
      "text": "If, indeed, the intent of this bio-pic is to chronicle the events that led to Queen and Freddie Mercury's legendary performance at Live Aid, well, I guess the goal has been met. The movie, as it is, is fine. But it could have been so much more."
    },
    {
      "text": "\"Bohemian Rhapsody\" the song is a sonic masterpiece and \"Bohemian Rhapsody\" the movie is just a conventional rock flick, one all too ordinary for a man and a band that exemplified the extraordinary."
    },
    {
      "text": "I really can't say enough about Rami Malek ... He's why this movie works as well as it does."
    },
    {
      "text": "[It] doesn't feel like a con job; rather, it's a genuine attempt to bring Queen and the legacy of Freddie Mercury to life on the big screen for the one thing that reigned supreme in their dynasty: the music. And what music it is."
    },
    {
      "text": "It's a kind of magic any way you slice it."
    },
    {
      "text": "It is a wig-and-teeth movie, but Malek's performance really sells the entire performance."
    },
    {
      "text": "In common with The Proclaimers film, this is very much a jukebox musical which rests entirely on the viewer's tolerance (or love) for Queen's music -- don't like the band; nothing to see here -- and Rami Malek's appropriately majestic performance."
    },
    {
      "text": "I enjoyed it, but this isn't much real life, it's more fantasy."
    },
    {
      "text": "While flawed, much like the band's music, this is a film that is very easy to sit back and enjoy, even if you can appreciate that, at times, it's not particularly very good."
    },
    {
      "text": "What we ultimately wanted from Bohemian Rhapsody was not carbon-copied concerts, but behind-closed-doors insight into a deeply private, complicated, internationally beloved superstar."
    },
    {
      "text": "Like a lot of depictions of rock music on film, Bohemian Rhapsody lacks both the stylistic daring of a music video and the outright euphoria of a proper musical, but it gets closer to both with the Live Aid sequence."
    },
    {
      "text": "The critical failure of Bohemian Rhapsody is that, 134 minutes after the lights go down, the members of Queen just seem like four blokes who've been processed through the rusty machinery of a Hollywood biopic."
    },
    {
      "text": "In hindsight, it would be better if this movie didn't exist at all."
    },
    {
      "text": "A bolder film might have explored the relationship between Mercury's hedonism, his mostly closeted sexuality and his on and off-stage personas in a more nuanced way."
    },
    {
      "text": "Malek's Freddie is a musical performance for the ages, but the film he's trapped in is the three-minute radio edit that the character and real songwriter would have never settled for."
    },
    {
      "text": "Although Malek looks the part, and has Freddie's dance moves down, his performance is all stiff British accent and overbite."
    },
    {
      "text": "Despite its intentions to get close to Mercury, Bohemian Rhapsody is as intimate as a sold-out stadium show, with none of the accompanying power."
    },
    {
      "text": "What's arrived at the other side of this troubled production history is a work that's all spirit, no soul."
    },
    {
      "text": "The songs are where the movie really gets its emotional core, and that alone is perhaps worth the ticket of admission."
    },
    {
      "text": "Fortunately, the film comes to life any time that Queen take to the stage, thanks to dynamic staging and dedicated performances from all four stars."
    },
    {
      "text": "The film has a secret weapon: Rami Malek. As Mercury he is spectacular."
    },
    {
      "text": "This will rock you."
    },
    {
      "text": "The final hurrah for Mercury's genius, this huge, hubristic spectacle lets you grant his troubled film a pass: at least it keeps on fighting to the end."
    },
    {
      "text": "An object example of how a film can be entertaining and even exhilarating without being particularly good, Bohemian Rhapsody has the driving energy of a stadium anthem and the fizzy meaninglessness of a bubblegum pop song."
    },
    {
      "text": "I'm happy to report that this is not Bohemian Crapsody."
    },
    {
      "text": "Frankly, if you are not cheering along with the crowd as Mercury belts out an ultra-satisfying rendition of \"We are the Champions,\" then a doctor should check your pulse. Somewhere, an outrageous artist knows that his Queen movie rules."
    },
    {
      "text": "Bohemian Rhapsody might not be the be-all end-all story of Freddie Mercury and Queen ... but it's easily the next best thing."
    },
    {
      "text": "With a performance as commanding as Rami Malek's at its center, why isn't Bohemian Rhapsody a better movie?"
    },
    {
      "text": "Larger-than-life performances energize a shallow highlight reel."
    },
    {
      "text": "The energy of Malek's imitation helps to bind what amounts to a series of gossipy but harmless rock-world anecdotes into something vaguely coherent."
    },
    {
      "text": "Bohemian Rhapsody mistakenly believes that simply trudging through a workmanlike overview of Freddie Mercury's life will allow it to arrive at something approaching intimacy."
    },
    {
      "text": "While the foot-stomping jams and sweeping scope make this a theatrical experience, the filmmakers find few inventive nuances within the formulaic framework."
    },
    {
      "text": "To the filmmakers' credit, and even though they don't entirely avoid the clunky factoid-itis that often plagues the genre, this is a biopic that favors sensory experience over exposition. It understands what pure, electrifying fun rock 'n' roll can be."
    },
    {
      "text": "The film benefits from some uncanny performances that help it transcend all the dodgy wigs and telegraphed dialogue; and of course it has that majestic back catalogue to draw from whenever things start sagging."
    }
  ],
  "release_year": 2018,
  "duration": 135,
  "genres": [
    "Biography",
    "History",
    "Drama",
    "Music",
    "LGBTQ+"
  ],
  "age_rating": "PG-13",
  "synopsis": "Freddie Mercury -- the lead singer of Queen -- defies stereotypes and convention to become a beloved entertainer; the band's popular songs lead to Queen's rise in the 1970s; after leaving the group to pursue a solo career, Mercury reunites with Queen for the benefit concert Live Aid -- resulting in one of the most memorable performances in rock 'n' roll.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/lHu1wtNaczFPGFDTrjCSzeLPTKN.jpg"
}