{
  "movie_name": "Cats",
  "movie_id": "cats_2019",
  "total_reviews": 333,
  "reviews": [
    {
      "text": "Cats may not leave its audience in awe the way Les Miserables did but it does have its own charm. The best way to approach the movie is to go into the cinema knowing you will be about to watch a theatre production rather than a big blockbuster film."
    },
    {
      "text": "If the cast and crew wanted audiences to feel like cats– easily distracted and bothered by almost everything– they’ve succeeded."
    },
    {
      "text": "It is unlikely anyone will be feline good after witnessing this cat-astrophe because ultimately it was the morbid curiosity that killed the Cats…"
    },
    {
      "text": "I’m sure Taylor Swift’s next big hit will be a song about the jilted experience."
    },
    {
      "text": "If by some chance, “Skimbleshanks the Railway Cat” doesn’t make you want to poke your ears out and wish that music had never been invented, bless your sincere, furry hide."
    },
    {
      "text": "At best, it’s an ambitious misfire. At worst, it’s straight-up nightmare fuel that will haunt generations. Enter into the world of the Jellicles at your own peril."
    },
    {
      "text": "Ugly, annoying and inconsistent"
    },
    {
      "text": "\"I think there's a film version of \"Cats\" that could work, but this isn't it.\""
    },
    {
      "text": "I finally understand that one episode of Unbreakable Kimmy Schmidt."
    },
    {
      "text": "No disrespect to people who love this musical, this is the worst movie of the year... next year too."
    },
    {
      "text": "...unable to claw itself away from its detracting visuals."
    },
    {
      "text": "I want to tell you I at least had fun... but this movie is also so horrible it doesn't even earn the status to make fun of magicians."
    },
    {
      "text": "Watching the film version of Cats is truly mystifying, in neither a completely bad nor completely good way. Fans of the theater production may enjoy seeing their favorite songs or characters again, but there's little to recommend for anyone else."
    },
    {
      "text": "With actors who appear to have been put through the full-body Snapchat cat filter, a Ziegfeld Follies-style chorus line of dancing cockroaches and felines with human hands and feet, you'll wonder if the theatre popcorn is laced with catnip."
    },
    {
      "text": "I, for one, felt lost, grappling down a sketchy back alley for rhyme, reason and, once the credits rolled, the nearest exit."
    },
    {
      "text": "[The] stars must be coughing up hairballs after joining the film's giant litter of singing and dancing felines, whose weird digital fur and creepy features make them all look as though they've been dragged in from the Island of Dr Moreau."
    },
    {
      "text": "May be too indigestible even for a hate-watch."
    },
    {
      "text": "Enraging, unfathomable, and laughable, Cats is a masochistic experience, that this reviewer rather hesitantly recommends - if only for the gamut of emotions it will take you through, leaving you scratched all over."
    },
    {
      "text": "Cats is disjointed, unintentionally comical, and a little creepy - and folks, I love musicals."
    },
    {
      "text": "Cats may very well be the most unique film of the year, certainly released by a major studio, and you'll love it and hate it but you sure won't forget it."
    },
    {
      "text": "Dragging on for almost two hours of poor singing and predominantly forgettable choreography, Cats is Hooper's way of maliciously toying with us like a half-dead mouse wishing for sweet release."
    },
    {
      "text": "Add in the tonal shifts and performances that never feel like they're in the same movie, and out comes a cat scratch fever dream that can only be enjoyed ironically."
    },
    {
      "text": "Every ounce of goodwill built by the feline community in this economy of viral cat videos and memes has been squandered by a single movie."
    },
    {
      "text": "This is like doing too much catnip and falling asleep to the soundtrack, just surreal. Your MEMORY of the story may change, but the curiosity to see it won't kill you. Hy-ooh!"
    },
    {
      "text": "There's no use crying over spilled milk. ... It's a boo hiss - unless you're insanely curious to witness something so awesomely bad. Just remember: curiosity killed the cat."
    },
    {
      "text": "I've never used drugs but I suppose the feeling is close to what I experienced watching Cats. [Full review in Spanish]"
    },
    {
      "text": "It is an oddity all to itself, a spectacular disaster in every sense of the term. It's a drug-induced hallucination brought to life."
    },
    {
      "text": "Just don't think of it as a film, and you'll be fine."
    },
    {
      "text": "What did I just watch?"
    },
    {
      "text": "Cats might be an example that just because something can be done doesn't mean it should be, and that some titles are better left for the stage."
    },
    {
      "text": "I'm not sure what the hell I just saw, but I definitely know I wasn't high enough for whatever it was."
    },
    {
      "text": "I would not relish the opportunity to see it again and will happily forget it, as soon as possible."
    },
    {
      "text": "I was always a dog person anyways."
    },
    {
      "text": "The film is flat, without any of the camp, kitsch high energy that characterised the stage show, but its wrongness is never less than mesmerising."
    },
    {
      "text": "What worked for Andrew Lloyd Webber and the Broadway cast/crew only transcribes to the screen half the time."
    },
    {
      "text": "A film that seeks to inspire our loathing for nearly every frame it sits on the screen, and that is before we even attempt to decipher the mediocrity that is the music or the nonexistence of the story."
    },
    {
      "text": "Hooper's ill-advised creative decision of making them as human as possible, except with the face and body of a cat sure gives me the creeps."
    },
    {
      "text": "Here we get a deadening and earthbound Rebel Wilson as Jennyanydots, a comic turn that, nonetheless, calls for movement. And Mr. Mistoffelees' magic becomes a matter of special effects, not sublime dance moves."
    },
    {
      "text": "An invigorating failure. One-of-a-kind filmmaking."
    },
    {
      "text": "A money pit of terrible ideas executed terribly, Cats stands as a monument to ineptitude and unimaginativeness. Everything looks disturbingly wrong from the very first frame right through to the very last."
    },
    {
      "text": "You'd think you couldn't make a scene like 'WereCat Taylor Swift literally drugs a roomful of other cat-persons into a horny psychedlic frenzy for her suggestive burlesque number' inert and bland... but they found a way."
    },
    {
      "text": "A deranged freak-fantasia worth falling into for a couple of hours, if just to say you did. That is to say, it's Cats."
    },
    {
      "text": "Purr-fectly dreadful."
    },
    {
      "text": "What sort of fur is it? It's like cannibalism."
    },
    {
      "text": "The movie was garbage."
    },
    {
      "text": "The worst movie I have seen in my lifetime...the movie is oddly over-sexualized and the music is not moving...what was going on?"
    },
    {
      "text": "You can't believe what you're looking at because it's so hideous to behold."
    },
    {
      "text": "Clearly, Hooper's film, while riddled with glaringly awful mistakes, is not bad at all."
    },
    {
      "text": "A feast for the senses!"
    },
    {
      "text": "Seeing Jennifer Hudson's snot continue to glisten over her lips, refusing to be wiped away, made me Google, \"Can you lose an Oscar?\""
    },
    {
      "text": "The best thing here is that it's at least under two hours. [Full Review in Spanish]"
    },
    {
      "text": "The film is a triple-decker weirdburger from the twitching ears to the too-long tails that make the ensemble look like lemurs."
    },
    {
      "text": "There's a digital veneer of horror and farce and glazed looks, and it just doesn't work, it's not sensibly thought about."
    },
    {
      "text": "I struggled throughout the movie to not fall asleep. [Full Review in Spanish]"
    },
    {
      "text": "The star power likely won't save this non-Jellicle movie of 2019. A theatrical powerhouse, CATS didn't translate well from theater to film. The songs were great, but the actors struggled to find an objective with the absence of any storyline."
    },
    {
      "text": "Cats' main sin... is that it is boring. [Full review in Spanish]"
    },
    {
      "text": "The CGI turns the kitsch of the original work into something more disturbing than entertaining. [Full Review in Spanish]"
    },
    {
      "text": "In The End: Cats is a CG horror of weird cat mutants dancing and singing nonsense in weird people-sized settings with no people. Run away."
    },
    {
      "text": "As the minutes tick by clocking in almost two hours, Cats comes off as a mix of bizarre and boring."
    },
    {
      "text": "Might as well have not existed, as far as I'm concerned. Does this movie have any redeeming qualities?"
    },
    {
      "text": "Just bad, a new rating...Tom Hooper was up for thirty-six hours straight, which means he was just losing his mind...too far gone..."
    },
    {
      "text": "After an hour of Cats I began to suspect the popcorn they fed us had been laced with a psychotropic drug."
    },
    {
      "text": "It's Judi Dench as Old Deuteronomy and Ian McKellen as Gus the Theatre Cat who save the musical from mediocrity. Their voices aren't particularly strong, but their acting is the cat's pajamas."
    },
    {
      "text": "What should be a delightfully quirky romp quickly turns into a nightmarish fever dream instead. The CGI descends to the depths of the uncanny valley."
    },
    {
      "text": "This is inconsistent stuff, surely, but \"Cats\" is also rewarding enough in bursts of passion that make it a genuinely intriguing experience."
    },
    {
      "text": "A feverish and cacophonic dream that intermittently licks your senses but it always scratches your brain. [Full review in Spanish]"
    },
    {
      "text": "While the performances are brilliant and the songs are great, the story isn't as strong as it could be."
    },
    {
      "text": "It's cartoonish, a little surreal and, at least to this grumpy (cat) critic, altogether irresistible."
    },
    {
      "text": "Brilliant music, well-choreographed songs and good production value couldn't save this one from sinking."
    },
    {
      "text": "The movie \"Cats\" is-forgive the critical jargon-pretty good."
    },
    {
      "text": "However amazing the trickery may be... the characters fall awkwardly into the crack between animal and human, and the plot, which requires them to sing and dance in competition with one another, is scarcely more convincing."
    },
    {
      "text": "In it, Ian McKellan (winner of 6 Laurence Olivier Awards, a Tony, a Golden Globe, a SAG Award, 4 Drama Desks, and 2 Critics' Choice Awards, a two-time Oscar and four-time BAFTA nominee) says the words 'meow, meow', while licking the back of his hand."
    },
    {
      "text": "Sometimes a movie struts its awfulness with such glee that it almost becomes an enjoyably sadistic pleasure rather than a chore to watch."
    },
    {
      "text": "Cats absolutely does commit to every choice it made. I would like to respect it for that, but the choices were bad."
    },
    {
      "text": "There is fun to be had at this adaptation of the blockbuster stage production, and it's the holidays, so you might as well have it."
    },
    {
      "text": "Cats is not for everyone, but it is definitely for me."
    },
    {
      "text": "One of the biggest misfires I've ever seen on the big screen. [Full review in Spanish]"
    },
    {
      "text": "The filmmakers were so preoccupied with whether or not they could do a heavily CG version of Cats, they didn't stop to think if they should."
    },
    {
      "text": "The longer I watched this two hour cinematic car crash, I could begin to see inspired shards of a what could have been a masterpiece in the twisted carnage flickering in that darkened theater."
    },
    {
      "text": "The most shocking thing about Cats is that it's somehow worse than you imagined it could ever be."
    },
    {
      "text": "Inscrutable and ignominious - a veritable cat-astrophe!"
    },
    {
      "text": "While it was a challenging musical to adapt to screen, Cats was a mess and I regret not drinking a lot before seeing it."
    },
    {
      "text": "The problem with the film is that it shouldn't exist in the form that it does, and no single thing would have solved that."
    },
    {
      "text": "You thought we stopped at cat-human hybrids? Oh no...nightmares. A nightmare that does not end for two hours."
    },
    {
      "text": "There will be people, fans of the musical, that will both give them what they want and something new...so much of it plays, even in concept, to just loving cats and giving them personalities. If you have that sort of affection, you probably go with it."
    },
    {
      "text": "It is a movie that never stops throwing 50 shades of WTF at you, but never once starts making sense."
    },
    {
      "text": "For me, Cats was magical... It kept in songs I was sure would be cut and it was so boldly and confidently Cats that I had to respect it and I truly enjoyed each moment."
    },
    {
      "text": "Whether you think the imagery is beautiful or nightmarish, this is a film that demands to be looked at."
    },
    {
      "text": "It's a brave attempt to do something new, but the result is a movie that will draw an audience simply because it's such a colossal misfire. And whether you think it's good or bad, the film is packed with unforgettable moments."
    },
    {
      "text": "I can say with all sincerity that upon finally meeting Cats face to face, somewhere past the introduction of the wayfaring Grizabella and the sage Old Deuteronomy, I was dazzled."
    },
    {
      "text": "We will not see the likes of Cats again. Which, in a way is a shame. This is one of the worst films I've ever seen. I also hope that everyone goes to see it and that it wins Best Picture at the Oscars in 2020. Can't recommend it highly enough."
    },
    {
      "text": "A surreal, disturbingly sexual, and profoundly disquieting experience. [Full review in Spanish]"
    },
    {
      "text": "Pussy galore, and quite the bore."
    },
    {
      "text": "Hooper's surrealistic song-and-dance spectacle, steeped in joyous musical theatre lore and rich with the emotions of acceptance and forgiveness, is exactly what we need right now."
    },
    {
      "text": "You need to suspend disbelief. Don't fight the visuals. Movies can be fantasies, and \"Cats\" is one heck of a fantasy. The film is better than the stage production because it's more expansive. The action is opened up. The singing is gorgeous."
    },
    {
      "text": "A truly terrible 'Memory' that will haunt me for a thousand lifetimes."
    },
    {
      "text": "The movie is outlandish and sexual and confusing. But that doesn't make it a bad movie. In fact, I'm going to call it a good movie."
    },
    {
      "text": "It's just baffling and yet it must be seen... It's bad, but you've got to experience it."
    },
    {
      "text": "It's not the film-making that is wrong with Cats, it's the fact that the film even exists."
    },
    {
      "text": "Whether or not you ultimately warm to the out-there story about a tribe of cats who hold an annual sing-off to decide which of them will ascend to a new life in the heavens, Hooper's CGI-live action hybrid is oddly bewitching."
    },
    {
      "text": "Me as a teenager seeing Cats on Broadway: \"This is terrible. Easily one of the dumbest, weirdest, most incoherent and pointless things I've ever seen.\" Tom Hooper's Cats movie: \"Hold my beer.\""
    },
    {
      "text": "The feline spectacle has a dadaist feel, and in its first hour, it is truly soporific. [Full Review in Spanish]"
    },
    {
      "text": "It's already been mentioned that the visual effects are not what will annoy you the most; however, that does not mean they are good. [Full review in Spanish]"
    },
    {
      "text": "A visual event of catastrophic proportions. [Full Review in Spanish]"
    },
    {
      "text": "[Cats] is one of those absurd and crazy movies that everyone wants to see because it guarantees a good time. [Full Review in Spanish]"
    },
    {
      "text": "The movie's slow pacing might put off most people."
    },
    {
      "text": "And that is Cats' main failing - the hubris that assumes what works on stage works just as well on screen."
    },
    {
      "text": "The movie IS bad - but not enough to be interesting (Hooper is incompetent even in his incompetence). The result is a stupid and aesthetically heinous bore. [Full review in Portuguese]"
    },
    {
      "text": "Anthropomorphic cats with uncanny valley, bad cat puns, and so many crotch shots-oh so many crotch shots..."
    },
    {
      "text": "Having a literal cat claw at my eyes for an hour and forty-nine minutes would have been less painful."
    },
    {
      "text": "Furries rejoice! Tom Hooper and Universal have spent around ninety-five million dollars on your dream movie ... For the rest of us, the film is a clear misfire, misconceived and badly executed."
    },
    {
      "text": "While it's far from being perfect, or even purr-fect, it certainly doesn't warrant the abuse that has been heaped upon it. At the very least, it deserves a chance."
    },
    {
      "text": "For all of the star power on display, this is an indoor Cats: spayed, defanged and thoroughly domesticated."
    },
    {
      "text": "It instils a Lovecraftian madness in the viewer, the silver screen becomes a billowing veil of darkness."
    },
    {
      "text": "Tom Hooper's freakily phantasmagoric visualisation of an already strange West End smash is a high-wire act... And yet it never falls, sustaining a subtly hallucinatory, wholly theatrical reality."
    },
    {
      "text": "You might still want to know if it's a good movie, but that is the wrong question. Cats is sui generis."
    },
    {
      "text": "After two hours of the finished product, the animal-human hybrids redefine uncanny valley. It is hard to know where to look, or even create the desire to stare at Tom Hooper's godforsaken creation."
    },
    {
      "text": "Cats' biggest problem is its director. [Full Review in Spanish]"
    },
    {
      "text": "While it is mostly jaw-dropping, there are still a few good moments, to be relished and savoured like a stinky five-day-old fish rescued by James Corden from a bin."
    },
    {
      "text": "If you loved the play you will most probably love the movie. I abhorred the play so the movie didn't stand much of a chance. Still it was better than I expected (which wasn't much)."
    },
    {
      "text": "There are not enough redeeming qualities in this incoherent, disturbing and lifeless musical mess. [Full Review in Spanish]"
    },
    {
      "text": "How could anyone have hoped the film version would be a masterpiece when the stage musical it is based on is pretty dreadful?"
    },
    {
      "text": "If you're a fan of the musical, or a member of the cast, then by all means go see \"CATS.\" If you're not a fan of musical theatre, go stand in line and see \"Star Wars\" again."
    },
    {
      "text": "Cats has unfairly received withering criticism. If you liked the Broadway musical, you will like the film."
    },
    {
      "text": "The Andrew Lloyd Webber musical, based on T.S. Elliot's wonderfully creative \"Old Possum's Book of Practical Cats,\" played on Broadway for 18 years despite not being very good. But it was fun in a way this big screen CATastrophe isn't."
    },
    {
      "text": "As the trailer suggested, the enduring stage musical is a bad fit for the big screen."
    },
    {
      "text": "Cats is a tortured fever dream of a film...the unholy offspring of a coked-up studio executive notes session and a dark ritual intended to summon forth the Elder Gods. We are all cursed. We are all damned. We are all Cats."
    },
    {
      "text": "The definitive film adaptation of one of Broadway's most successful musicals."
    },
    {
      "text": "A borderline unwatchable mishmash of poorly conceived musical numbers and incoherent storytelling."
    },
    {
      "text": "Even Stewart's colorful sets, Weber's delightfully esoteric songs, and Blankenbuehler's beaming choreography aren't enough to sustain the interest of most who will go in knowing nothing."
    },
    {
      "text": "More is less, but sure - let's go all in... looking like a remake of The Wizard of Oz as a 1980s interpretive-dance video on MTV where all the characters have been replaced by human-feline hybrids..."
    },
    {
      "text": "The movie is literally Caligula meets The Aristocats, something all cult film fans must see. It's not great by any means, but the bad movie fan in me loves it"
    },
    {
      "text": "Perhaps the least chill Broadway musical of all time"
    },
    {
      "text": "The star-struck Cats is a rare attainment and could well be the last of the film industry's industrial-scale caprices, a follicular folly down to molecular level."
    },
    {
      "text": "Despite some clever additions to the stage musical, Tom Hooper's adaptation produces many bad, and bizarre, memories."
    },
    {
      "text": "All of it seems quite alienating most of the time. [Full Review in Spanish]"
    },
    {
      "text": "It's like watching someone watching the movie, which is itself like watching cats dry."
    },
    {
      "text": "I don't want to hear Memory again for a very long time. Miaow!"
    },
    {
      "text": "An incoherent pastiche that combines theater, film, and digital technology with virtually no skill. [Full Review in Spanish]"
    },
    {
      "text": "Every now and then a film comes along that requires a level of strength, courage and, indeed, patience, the likes of which I am simply unequipped for."
    },
    {
      "text": "You feel like sitting Hooper down in front of a film musical - White Christmas, Singin' in the Rain, anything - and saying: \"You see these bits in between the songs? That's called a 'movie'.\""
    },
    {
      "text": "That this material seems incapable of articulating any reason for its existence may be its greatest fealty to the cruel and unknowable animal kingdom. Cats is stubbornly meaningless."
    },
    {
      "text": "There's something uniquely fun about seeing the likes of Ian McKellen and Jennifer Hudson fully committing to their down-on-their-paws characters, a spirited sense of shared strangeness."
    },
    {
      "text": "[Cats] manages to unearth an extra layer of awfulness and heap it upon the source material for a nightmarish affair that could do for felines what Jaws did for sharks."
    },
    {
      "text": "If you are big fan of the musical, than Cats is a must-see for you. For the rest of us, it has some charming performances and good star power, but less visual effects dazzle than might be expected."
    },
    {
      "text": "So, in conclusion, I say to Old Deut, you have not convinced me. I remain resistant to conversion. I am now and forever, a dog person. Hiss if you will, but to you I say, arf or maybe arf and one half."
    },
    {
      "text": "Believe me when I say it more than lives up to the hype."
    },
    {
      "text": "The film is an unholy melange of humans making cat moves - like head-nuzzling - and \"cats\" doing human things."
    },
    {
      "text": "The worst thing about Cats - and I was forced to see two cat burglars sensually drape a string of pearls around the scruff of Hayward in the obvious foray to a cat threesome - is that it was made in the first place."
    },
    {
      "text": "This is a film that reeks of misjudgment."
    },
    {
      "text": "What is this movie?"
    },
    {
      "text": "Tom Hooper's Cats has potential but isn't quite there with the CGI and visuals to make this into a good movie just yet."
    },
    {
      "text": "A film of unrelenting upbeat energy, so horrible that it's only really possible to react to it with a kind of delirious manic good cheer."
    },
    {
      "text": "It lacks the depth of character and comprehensive world building needed to transcend its theatrical origins and become a complete movie with a fully realised narrative."
    },
    {
      "text": "A complete and utter artistic failure, if also fascinating enough in its awfulness to likely endure as a perversely-admired cult classic. It could've been worse - it could've been boring."
    },
    {
      "text": "You'll never forget it - though you will try."
    },
    {
      "text": "Cats might be a mess, but it's a one-of-a-kind incredibly memorable mess (for better and for worse), and for all I know that's entirely by design."
    },
    {
      "text": "Seemingly scooped out of the litter box, it's best viewed under the influence of catnip or some other hallucinogenic substance."
    },
    {
      "text": "Where do you even start with Cats? Tom Hooper's big screen version of the Andrew Lloyd Webber musical is unlike anything you've ever seen before, but not in a good way."
    },
    {
      "text": "Cats is one of the worst movie musicals of all time, a stagnant mess from start to finish."
    },
    {
      "text": "This is middlebrow film-making at its most hubristic; too inelegant to coast on spectacle alone, it's not subversive enough to be considered truly camp either."
    },
    {
      "text": "It's one of those rare cinematic events that feels like a collective hallucination - improbable and entirely indescribable."
    },
    {
      "text": "\"Cats\" is a Purr-fectly fun and truly entertaining film."
    },
    {
      "text": "Cats is a punishment."
    },
    {
      "text": "What, you may ask, the f***?"
    },
    {
      "text": "I hated this movie with every fiber of my being."
    },
    {
      "text": "Once Rebel Wilson and James Corden's bits are out of the way it's easy to settle in and enjoy the beautiful music and choreography."
    },
    {
      "text": "I spent most of Cats with my hands over my mouth, going \"What is happening?\"... I had a ton of fun with this."
    },
    {
      "text": "Hooper and company have - yes, I'm going to say it - spit up a huge hairball with their Cats. Forgoing substance in favor of the cheap buzz of spectacle rarely ever works in film, and in this case, the spectacle doesn't even work."
    },
    {
      "text": "Visually repulsive and not far behind on a sonic level."
    },
    {
      "text": "Cats is a musical extravaganza that is toe-tapping, energetic and utterly endearing."
    },
    {
      "text": "... a bewildering and curiously flat adaptation that will leave many moviegoers scratching their heads - or anything else their paws can reach."
    },
    {
      "text": "Chiefly, a terrible, terrible movie."
    },
    {
      "text": "A cat introduces themselves, sings about their one thing, Macavity shows up to be evil, rise and repeat for nearly two hours. That...that's honestly all there is to say."
    },
    {
      "text": "So bad it's destined for a box of kitty litter."
    },
    {
      "text": "In the hands of filmmaker Tom Hooper, he's turned this surreal concept concerning the meaning of life and death into something of a freak show."
    },
    {
      "text": "Our best bet is to pack it into a crate lost deep within a warehouse next to all the other dangerous artifacts man was not meant to tamper with, before it kills us all."
    },
    {
      "text": "If I should stoop to suggesting that the film is indeed a cat-astrophe, you can be assured that that's a better cat pun than any of those actually in the darn thing (and there are a bunch)."
    },
    {
      "text": "Artistically, it's a hairball. There's no story to speak of, Mr. Webber's music is immediately forgettable and, like a cat standing at an open door, it takes forever to get where it's going."
    },
    {
      "text": "Some things shouldn't be tampered with. I enjoyed Cats onstage, where the theatrical experience worked its magic to great effect. The new film never swept me up as I hoped it might; for all its rich ingredients it felt like a soufflé that wouldn't rise"
    },
    {
      "text": "Cats takes an award winning musical and dilutes it in exchange for forgettable star studded performances."
    },
    {
      "text": "Dazzlingly weird, but occasionally creepy...a phantasmagorical mongrel that fascinates even when it appalls."
    },
    {
      "text": "I can't say for sure that all productions of Cats are bad (although I have a hunch) but I can certainly say that this one is."
    },
    {
      "text": "This musical misfire sets a new low bar for adapting a Broadway hit."
    },
    {
      "text": "What did cats ever do to the tech guys?"
    },
    {
      "text": "Lowlighted by Jennifer Hudson's dismal performance of 'Memory,' there is a magnificent ballet halfway through. That's the only good thing I can say about this film."
    },
    {
      "text": "Cats is a jellicle disaster (I'm using that term about as well as the movie does). The actors appear to enjoy embarrassing themselves, but that's the only enjoyment derived from this musical hellscape."
    },
    {
      "text": "Showgirls with fur."
    },
    {
      "text": "The Cats movie did nothing for me except leave me with insane questions. Save yourself and your kids from jellicle nightmares, and skip this one. Meowy Christmas."
    },
    {
      "text": "You will likely hate Cats, but you won't regret watching it. It's a bad studio movie for the ages - and when soulless Disney franchises and remakes are dominating the box office, we should embrace an unprecedented disaster like this while we can."
    },
    {
      "text": "Cats. They're cats. They're furry and dance well. Cats. They're cats! Welcome to Cats hell."
    },
    {
      "text": "If you have no prior familiarity with the wordy, purring absurdism of \"Cats,\" it'll just hit harder, and you'll likely have a lot of questions."
    },
    {
      "text": "I felt as though I was unable to wake up, slowly sinking deeper and deeper into madness. Once it's over, like a dream (or nightmare) you will struggle to recall a detail, but that sinking feeling will leave you nauseous."
    },
    {
      "text": "The biggest weakness of the movie is that the characters look laughable. At worst, they resemble unsightly, horrifying cat/human hybrids."
    },
    {
      "text": "Francesca, sweetie, I'm so sorry."
    },
    {
      "text": "Cats is a testament to not everything should be translated to film."
    },
    {
      "text": "[Tom] Hooper is a capable, creative director, but you'd never know it from the furball he's just coughed up on the screen."
    },
    {
      "text": "Cats is not good. But the blame goes to the clumsy style of director Tom Hooper, not people wearing digital fur."
    },
    {
      "text": "I so wanted to slam this movie, but then..."
    },
    {
      "text": "It is at times extremely entertaining, with some great performances, but it's also baffling, and the effects would appear to belie the price tag, in that it frequently looks just a bit too cheap."
    },
    {
      "text": "I'll skip the obvious first question, which is just an incredulous \"Why??\" because I know the answer. It's the pervasive idea that anything popular that isn't a movie has to be turned into one."
    },
    {
      "text": "Falling short of the expected cat-astrophe, it's more flabbergasting than truly terrible."
    },
    {
      "text": "Like the Ark of the Covenant, you won't be able to look away as it melts your face off."
    },
    {
      "text": "Hooper's utterly bonkers choices make Cats feel like a movie-not from another nation-but from another planet."
    },
    {
      "text": "Yup, it's a dog alright."
    },
    {
      "text": "I suspect it's the unfathomable quality that has drawn people toCatsfor so long. In that, at least, I will give Tom Hooper credit. He's definitely captured that."
    },
    {
      "text": "The truth is, \"Cats\" is destined for cult status, misunderstood by the uninitiated, unaccepted by the \"it's-cool-to-hate\" crowd, and cherished by a special brand of audience who sees the value in art that dares to be different."
    },
    {
      "text": "It would be more entertaining to see frolicking You Tube kittens than this film of a musical that played better on the stage. You never believe the actors in their roles. It's stilted, pretend acting, diverting your attention to inconsequential things."
    },
    {
      "text": "Cats is terrible, but it's also kind of great."
    },
    {
      "text": "The whole thing is so badly misbegotten that it keeps its most entertaining elements out of sight."
    },
    {
      "text": "It's hard to know how to react to Cats, other than gape in slack-jawed amazement that the dare has continued for so long."
    },
    {
      "text": "There isn't much more to Cats than the experience of sitting back and watching weird-looking performers pretending to be cats while gyrating to Andrew Lloyd Webber songs."
    },
    {
      "text": "I am going to recommend Cats on Rotten Tomatoes because if you like Cats: The Show you are going to like or love Cats The Motion Picture."
    },
    {
      "text": "It's deliberate doggerel. It's nonsense rhymes. And, for a movie audience accustomed to traits and arcs upon which they can hang their interest, it's deeply boring."
    },
    {
      "text": "I'm still slack-jawed and trying to process what I witnessed. (Full Content Review for Parents also Available)"
    },
    {
      "text": "It's a confusing mess, but one that holds a strange fascination."
    },
    {
      "text": "What could've been beautiful imagery in an avant-garde cinema setting is a kitty-litter show of inexplicable choices, one that takes all the fun out of the industry punching bags that are [Rebel] Wilson and James Corden."
    },
    {
      "text": "Look, this is a pretty damn faithful rendition of a famously bonkers and unapologetically ridiculous stage show. It's not quite \"good,\" but it's certainly going for it."
    },
    {
      "text": "For the life of me, I cannot determine, calculate, or even divine what this movie is, what purpose it serves, and what line of thinking brought it to life."
    },
    {
      "text": "Three good things to be said about Andrew Lloyd Webber's Broadway musical Cats: It's an impressive showcase for dancers, the costumes are inventive, and the songs, while nonsense, are catchy. Tom Hooper's film adaptation neuters all three aspects."
    },
    {
      "text": "'Cats' is one of those expensive $ 100 million products that become cult pieces for the least expected reasons. [Full review in Spanish]"
    },
    {
      "text": "[Cats] doesn't really work. And, more often than not, it's a grotesque burlesque. But it does have a few warm, furry moments."
    },
    {
      "text": "It's taken the musical Cats nearly 40 years to make its way from the stage to the big screen. Now we know why."
    },
    {
      "text": "This all-star, all-awful screen take on the smash Broadway musical easily scores as the worst movie of the year and arguably the decade. Cats shouldn't happen to a dog."
    },
    {
      "text": "The parts of Cats that work work really well, while many others don't. It's still kinda magical in a goofy sort of way."
    },
    {
      "text": "Does all this work? Well, it depends on how you feel about ... \"Cats.\" Did you love the show? You'll find stuff to love here. Did you hate it? Ditto! Or maybe ... you'll have both reactions? That's possible too."
    },
    {
      "text": "\"Cats\" turns the most vacuous stage musical of the 1980s into a big-screen litter box for the hammiest of stars to unload into."
    },
    {
      "text": "The big screen version of Cats may not be purrfect, but it's lovely, wildly entertaining and sparkles with movie magic."
    },
    {
      "text": "I enjoyed the film for what it is. It's London's Got Talent for the feline set."
    },
    {
      "text": "I would rather eat glass than watch Cats again, but if someone were to put out a warts-and-all behind-the-scenes documentary on its making, I would watch the hell out of it."
    },
    {
      "text": "Are all the cast being held hostage?"
    },
    {
      "text": "The look of the actors is so strange you can't get over it: It's the Uncanny Alley. The actors have tails and fur, but also hands. The lady cats have bosoms. Millions in digital effects have yielded the strangest species mashup since Manimal."
    },
    {
      "text": "Cat-astrophic special effects ruin Tom Hooper's adaptation of the infamous stage musical Cats."
    },
    {
      "text": "Well, some aspects of the film are genuinely good, but they're counteracted by so much stupid, creepy and pretentious awfulness that it all comes together into a fascinating train wreck."
    },
    {
      "text": "Years from now, there will be late-night screenings of Cats, with pleasantly drunk moviegoers bellowing for milk alongside Jason Derulo's Rum Tum Tugger and imitating Hudson's melodramatic stylings."
    },
    {
      "text": "40% of this movie is quite good - the other 60%...not so much..."
    },
    {
      "text": "Cats is the kind of bad movie you'll tell your kids about, and they probably won't believe you."
    },
    {
      "text": "It is literally the stuff of nightmares."
    },
    {
      "text": "Structurally, thematically, rhythmically, the show is built around 'Memory.' If that song brings the house down, nothing else matters. If it doesn't..."
    },
    {
      "text": "I realize \"It's not that bad!\" won't be used in the Cats advertising campaign, but it is worth noting that the peculiar musical does indeed have merit."
    },
    {
      "text": "This ain't no cat's meow, my Jellicles."
    },
    {
      "text": "Cats may not be the worst film of 2019, but it's going to earn a spot on many 10 worst lists, and deservedly so."
    },
    {
      "text": "You do get used to the feline antics after a while, and if that were the biggest problem, \"Cats\" might still work at a certain level. The bigger issue is that the film completely lacks tension or any real semblance of plot or story."
    },
    {
      "text": "I'm not saying this is \"meow-sterpiece\" but I do think some of the critics are lying to themselves. In no way is this a good movie but it's an utterly fascinating acid trip of a film"
    },
    {
      "text": "CATS, as a film, remains as aggressively formless as the musical. It is, essentially, in film terms, all second act."
    },
    {
      "text": "brace yourself"
    },
    {
      "text": "Cats brings Webber's Broadway sensation to life as an audaciously bizarre spectacle sure to delight and divide as much as the original musical does."
    },
    {
      "text": "This part-people, part-pussycat, faux-feline Hollywood hairball is a me-ouch."
    },
    {
      "text": "This movie is a nightmare you let live out its nine lives alone."
    },
    {
      "text": "A lot of talented people have done their utmost to make Hooper's vision succeed. Sadly, it doesn't."
    },
    {
      "text": "What [director Tom] Hooper's team devised, however, while not totally perfect, does wonderfully translate what stage actors envision for themselves when taking on the roles."
    },
    {
      "text": "There are so many surreal creative decisions in Cats that one finds themselves constantly faced with the question \"what the hell am I even watching?\""
    },
    {
      "text": "Meow. Well, I suppose the appropriate term here is woof. \"Cats,\" the adaptation of the smash Broadway musical, is a real dog."
    },
    {
      "text": "What we have here is future technology that, to borrow an old Irish phrase, needs to be put beyond use. Shoo."
    },
    {
      "text": "Cats is a special kind of terrible. No matter how ridiculous it gets, the cast never once backs down. It's a trainwreck from start to finish, but the sort of trainwreck that captures your attention with its audacity and never lets you go."
    },
    {
      "text": "A surreal circus of man-animals whose insane musical ramblings frequently cross the line into the realm of madness, but somehow still manages to ensnare us, against all odds and our own best efforts."
    },
    {
      "text": "It's every bit as baffling, weird and horrifying as you expected. It's certainly something that you've never seen before - but there's probably a very good reason for that."
    },
    {
      "text": "Ill-concieved and ill-executed, this incarnation of Cats leans in on the effects to the expense of most of the performances."
    },
    {
      "text": "Cats has beautiful production design, a few great performances by James Corden. Taylor Swift and Ian McClellan and spectacular choreography by Andy Blankenbueller. But it left me just as confused as the Broadway show did regardless of its hit status."
    },
    {
      "text": "A total misfire. Nauseating, anemic and cringe-inducing. The only way to experience it while clean and sober without any suffering is to wear eye shades and ear plugs."
    },
    {
      "text": "Cats is a head on collision between movie musicals and incompetent technology in which there are no survivors, only miles of morbid curiosity and rubbernecking."
    },
    {
      "text": "Perhaps I missed what all the purring is about, but the spectacle is more farcical than anything else"
    },
    {
      "text": "By the time I left the theater, I wasn't even sure what a real cat looked like anymore."
    },
    {
      "text": "Congratulations to dogs."
    },
    {
      "text": "Cats is the kind of modern movie musical that will have you humming the visual effects as you leave the cinema...For such a feather-weight musical the direction is just too dour. It's like trying to have a skip in your step while wearing moon boots."
    },
    {
      "text": "If you can overlook the problematic CGI and enjoy the craft of the performances, Cats may be a unique blend of musical and movie. But that pure spectacle boils down to a skin and bone plot, enclosed in a strange dystopia that lacks genuine heart."
    },
    {
      "text": "Doubtless lovers of Andrew Lloyd Webber will flock to see it, but it's as messy as a cat's litter tray."
    },
    {
      "text": "The problem lies with the source material, which will make audiences want to claw out their own eyes just for a change of pace."
    },
    {
      "text": "The weirdest thing about this very weird film is how dull it feels; how devoid of spirit."
    },
    {
      "text": "Sensational performances from Jennifer Hudson to Taylor Swift to Ian McKellen to Judi Dench help make this entertaining adaptation hit all the right notes."
    },
    {
      "text": "I felt the light inside me slowly fading."
    },
    {
      "text": "Finally, a whole new generation can discover that the Cats musical is two hours of human-feline hybrids without genitals having no-touch sex and begging for death via song."
    },
    {
      "text": "I never thought I would say \"There's something for everyone.\" But really there is in this film."
    },
    {
      "text": "The ultimate effect of the neon and glitter-drenched CGI extravaganza is Hellraiser 2 by way of Roald Dahl, a family entertainment spectacularly drunk on its own supply of batshit."
    },
    {
      "text": "Will live on in every viewer's memory, now and forever. Its weirdness is unforgettable."
    },
    {
      "text": "This version is fun enough for a musical theater junkie. The songs are well done and the dancing is impressive. All the actors are trying their hardest and the visual style is unique."
    },
    {
      "text": "It's a fun watch, even if it's not... Purrfect."
    },
    {
      "text": "The weak source material paired with Tom Hooper's incompetent direction is truly a wonder to behold."
    },
    {
      "text": "There is a thin line between idiocy and genius, and Cats pukes a hairball on it and rubs its ass all over it."
    },
    {
      "text": "CATS is not a version I'd recommend being anyone's first experience in witnessing the renowned musical. And that's saying something."
    },
    {
      "text": "The plot is slight, but if you just look at it as Step Up Felines then it's fine holiday entertainment."
    },
    {
      "text": "Once Tom Hooper's 110 minutes of Cats are over, theater is dead. One lucky Jellicle cat is dead. And we unchosen ones are left, tragically, to continue living."
    },
    {
      "text": "Cats is for the dogs, but then again, even most dogs know to avoid the stinky stuff."
    },
    {
      "text": "You'll find that in the end, you're still a dog person."
    },
    {
      "text": "There is something magical about the simple fact that this movie exists, in all its obscene, absurd wonder, its terrible filmmaking choices and bursts of jaw-dropping talent."
    },
    {
      "text": "I found \"Cats\" pretty bland, but it has its moments of catnip, and as a holiday movie option that anyone could see, it might be just the ticket."
    },
    {
      "text": "By the final scene, by which my eyebrows were hurting from being raised so high (the winning cat goes to the Heavyside Layer in a chandelier? What is this, \"Phantom of the Opera\"?), I was just tired. As was \"Cats.\" Meow."
    },
    {
      "text": "A musical of course necessitates the suspension of disbelief, but Mr. Hooper seems never to have quite made up his mind on whether to approach the material with theatrics or realism and winds up with something the cat dragged in."
    },
    {
      "text": "Cats may flop but it will be found by a likeminded audience, maybe the same one that rescued The Greatest Showman. Don't be the sourpuss to tell these people they're wrong."
    },
    {
      "text": "The intended humour mostly falls flat (lame jokes like \"cat got your tongue\" are neither funny nor logical), but there's something in the garish, glorious failure of it that can absolutely be enjoyed. It is unbelievable that it even exists."
    },
    {
      "text": "Oh God, my eyes."
    },
    {
      "text": "You won't be able to look away, but you might wish you could forget the \"memory\" of Cats by the movie's end."
    },
    {
      "text": "I gasped with laughter, I covered my face, I pulled at my hair, I clasped my hands over my mouth to keep from screaming. Cats had broken me, and I'd never felt happier."
    },
    {
      "text": "Cats isn't the cat-astrophe that everyone either feared or hoped for back in July, but it isn't a triumphant vindication of Hooper's vision, either."
    },
    {
      "text": "It gives me very little satisfaction to tell you that Cats takes the prize for being one of the most excruciatingly boring films of 2019."
    },
    {
      "text": "First off, full disclosure -- I am not a cat person. Second off -- after watching this frankly mortifying film adaptation of Andrew Lloyd Webber's Cats, I'm not altogether sure I am a movie person anymore either."
    },
    {
      "text": "One of the weirdest and most garish monstrosities to be birthed out of the Hollywood studio system in this century."
    },
    {
      "text": "It all just feels so wrong."
    },
    {
      "text": "Its wild, wacky spirit and crazy creative choices make it an equal parts awful and audacious spectacle to behold."
    },
    {
      "text": "All I can say is that Mr. Mistoffelees definitely is the best, and maybe this entire movie is overtly sexual for absolutely no reason. So, you know, fun for the entire family."
    },
    {
      "text": "I'm a dog man myself. But Hooper has made a surprisingly good fist of bringing it to life."
    },
    {
      "text": "Cats succeeds on its own terms. Its own harebrained, roller coaster, what did we do last night that has me waking up in a temple in Kyoto wearing someone else's pants way."
    },
    {
      "text": "A bunch of well-known celebrities get turned into singing, scenery-chewing digital kitties in the utterly absurd yet oddly charming movie musical version of the Broadway hit."
    },
    {
      "text": "Even after 110 tumbling, tail-swishing, deeply psychedelic minutes, it's hard to know if you ever really knew anything - except that C is for Cats, C is for Crazy, and C is probably the grade this cinematic lunacy deserves."
    },
    {
      "text": "Finding any high point in Cats, though, takes some serious scratching."
    },
    {
      "text": "What I didn't know is what a formless blob it is, a jumble of musical numbers devoid of plot and pacing, and director Tom Hooper... can do nothing to change that."
    },
    {
      "text": "Without the presence of hard-working troupers in fun fur in this \"Cats,\" all that's left are canned images of fit-looking people meowing and raising their rumps high in the air."
    },
    {
      "text": "On a scale of one to Zemeckis, Hooper's Cats boldly goes beyond the uncanny valley and creates a tier of its own."
    },
    {
      "text": "Hooper is not my man for film musicals."
    },
    {
      "text": "You must witness the hubris of director Tom Hooper. You must witness the hubris of Hollywood. The hubris of these performers."
    },
    {
      "text": "This visually dense adaptation of the Andrew Lloyd Webber hit is at once too crazy for this world, and not quite crazy enough."
    },
    {
      "text": "If the goal was to provide a holiday musical event that's fun for the whole family, it's a good idea in theory, packaged in the wrong litter box."
    },
    {
      "text": "I didn't hate it."
    },
    {
      "text": "Sadly, this uneven eyesore turns out to be every bit the Jellicle catastrophe the haters anticipated, a half-digested hairball of a movie..."
    },
    {
      "text": "Director Tom Hooper's movie is a huge failure because he's completely abandoned the fundamentals of what made \"Cats\" a terrific show."
    },
    {
      "text": "A spectacular disaster...This movie feels like a prank but I don't know on whom."
    },
    {
      "text": "With its grotesque design choices and busy, metronomic editing, \"Cats\" is as uneasy on the eyes as a Hollywood spectacle can be, tumbling into an uncanny valley between mangy realism and dystopian artifice."
    },
    {
      "text": "The most inexplicably bizarre film of the year, it's jawdropping for all the wrong reasons."
    },
    {
      "text": "What happens in musical theater should stay in musical theater."
    },
    {
      "text": "As an adaptation, Cats is declawed, never delving fully into the possibilities offered by its proportion-manipulating trick photography and its animated cast. As a big-budget spectacle, it's a triumphant disaster, if one at least born from a unique idea."
    },
    {
      "text": "I found it all exhausting."
    },
    {
      "text": "It's literally incredible. I hope I never see it again."
    },
    {
      "text": "Of the thought, of the thought, of what on earth to do now. \"Pretend to be cats!\" says a director. They reply ... \"Me? How?\""
    },
    {
      "text": "Tom Hooper's jarring fever dream of a spectacle is like something that escaped from Dr. Moreau's creature laboratory, an un-catty valley hybrid of physical and digital that unsettles and crashes way more often than it enchants."
    },
    {
      "text": "As far as motion picture musicals are concerned, Cats is...a cinematic disgrace."
    },
    {
      "text": "Shoddy visual effects can be forgiven, but the biggest issue is that there isn't much energy to many of the performances, probably because even the actors were deeply puzzled as to what they were doing"
    },
    {
      "text": "Cats is the worst thing to happen to cats since dogs."
    },
    {
      "text": "The Cats movie is about cats, yes. But it also should have been about, well, Cats."
    },
    {
      "text": "Cats is a strange beast to begin with, but the combination of strange CGI makes the translation from stage to screen even worse."
    },
    {
      "text": "Cats out of the bag, let's put them back in. At best, Cats is an interesting exercise in the boundaries of filmmaking. At the worst, which it treads closer to, it's a disturbing, confusing, and misguided acid trip of a musical."
    },
    {
      "text": "This adaptation gets straight to the heart of the material, which is basically two hours of stray cats introducing themselves."
    },
    {
      "text": "Fans of the stage musical may swoon, but others will be severely allergic."
    },
    {
      "text": "Big-screen musical adaptation is both strange and magical."
    }
  ],
  "release_year": 2019,
  "duration": 110,
  "genres": [
    "Musical",
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG",
  "synopsis": "A tribe of cats must decide yearly which one will ascend to the Heaviside Layer and come back to a new life.",
  "popularity": 5.3,
  "poster_url": "https://image.tmdb.org/t/p/original/pqyY7IEWkCWNZ7EuRStQaJITEta.jpg"
}