{
  "movie_name": "Citizen Kane",
  "movie_id": "citizen_kane",
  "total_reviews": 128,
  "reviews": [
    {
      "text": "It remains as witty, tragic, unlikely, unique and fascinating as ever."
    },
    {
      "text": "Utterly unmissable."
    },
    {
      "text": "Genuinely innovative film-making."
    },
    {
      "text": "Kane innovated several filmmaking techniques. The film pioneered a genre."
    },
    {
      "text": "Everything about this movie's production and origin, the precedent-setting technical aspects, and the innovative storytelling all prove that Orson Welles was a perfectionist filmmaker far ahead of its time."
    },
    {
      "text": "Many argue it to be the greatest film ever made."
    },
    {
      "text": "What is significant is that we owe the most audacious film in the last ten years to a young man of twenty-five who had nothing to recommend him except his ideas."
    },
    {
      "text": "...the ultimate Welles film..."
    },
    {
      "text": "A monumental film in cinema history."
    },
    {
      "text": "This is an adult film, technically and psychologically adult, recognizing the ultimate obscurity in which every human life moves; one of the few, the very few, films to present not an abstraction, but a man."
    },
    {
      "text": "Orson Welles, who plays Kane, produces and directs, has driven to the heart of his subject with a fierce, thrusting energy that is rare and refreshing."
    },
    {
      "text": "A distinctly out-of-the-rut production and a great piece of cinema artistry."
    },
    {
      "text": "Perhaps the film's most resonant quality is that, through the film's story and production, Welles inspires the same investigative process about himself and his picture."
    },
    {
      "text": "\"Citizen Kane\" forever changed the way movies were made and interpreted. It's still relevant and unique 80 years after its release. Is it the greatest movie ever? Maybe, maybe not. The most influential? Without a doubt, yes."
    },
    {
      "text": "I can't think of an American-made film that stands up to multiple viewings quite like 'Kane'...it never feels like Welles and company are showing off, just showing what a movie can do."
    },
    {
      "text": "Welles is the most exciting thing that's happened since sound."
    },
    {
      "text": "I particularly like the structure of the film, especially the use of the news reel footage and the newspaper headlines to move the plot forward."
    },
    {
      "text": "We aren't going to quibble about the genius business. Time will take care of that and if Welles goes down in history as one well be happy to have been among those who enjoyed the results of his great talent."
    },
    {
      "text": "The sheer brilliance and audacity of Citizen Kane... make the film the most astounding cinematic achievement of the season. It ranks with Disney's Fantasia as a milestone in motion picture technique."
    },
    {
      "text": "Ordinary standards will not serve for Citizen Kane; extravagance of idea for serious ends is not common enough in the cinema to provide a yardstick."
    },
    {
      "text": "Citizen Kane Is a triumph not only for Orson Welles, but for his entire company as well."
    },
    {
      "text": "Everything that Welles has to say in his capacity of author, actor and director is individual and striking. The grouping of the characters, the odd camera angles, the revealing little character glimpses are all superb."
    },
    {
      "text": "Whether the story of Charles Foster Kane is a biography of one man or a composite of many, as Orson Welles claims, matters not so much as the fact that here we have a completely new approach to film biography."
    },
    {
      "text": "[It] is my opinion that Mr. Welles has been sympathetic and kind. He reveals great respect for people, and a knowledge of their powers and talents."
    },
    {
      "text": "It is daring, different, thrilling and revolutionary, a power play of startling brilliance."
    },
    {
      "text": "This first screen effort of Orson Welles is of such vast difference to other pictures, in subject material, in treatment, in technique, in cast and in performance that the best advice perhaps is, \"See what you think.\""
    },
    {
      "text": "Welles has grasped the art of the photoplay in a single venture. He has accomplished in one picture what Hollywood veterans have been aiming at tor years."
    },
    {
      "text": "I would say it is a great picture but... It is one of those things, like the Pyramids, which are impressive and definitely interesting to have seen, but one can have more fun than looking at the Pyramids."
    },
    {
      "text": "In [Citizen Kane] Welles is revealed as having absorbed a tremendous amount of the tricks and tradition of the theater, and still more, that he possesses the skill and craftsmanship to adapt such knowledge to motion pictures in a masterful way."
    },
    {
      "text": "[Orson Welles] has done a remarkable job of producing something different from the ordinary run of film fare, and in doing so has brought a number of new faces to the screen, besides appearing in the title roll himself."
    },
    {
      "text": "Mr. Welles evolves by slow, precise degrees from the' ebullient, idealistic young man out to remold the world by the power of his inherited wealth, to a grim, petty tyrant without illusions, clinging tenaciously to a life which holds little for him."
    },
    {
      "text": "It's interesting. It's different. In fact, it's bizarre enough to become a museum piece. But its sacrifice of simplicity to eccentricity robs it of distinction and general entertainment."
    },
    {
      "text": "To my way of thinking, Gregg Toland, the photographer, has accomplished the best job ever turned out by a camera."
    },
    {
      "text": "I saw Citizen Kane months ago and it sticks in my mind almost as vividly as if I had seen it yesterday. And I shall certainly see it again."
    },
    {
      "text": "The performances are of the finest, attuned perfectly to the production technique employed, although, besides Welles, the names are unknown to the average motion picture audience."
    },
    {
      "text": "Put Citizen Kane on your \"absolutely must see\" list. Whether you like it or not, it will be a film experience you won't soon forget."
    },
    {
      "text": "It sets a new style in screen biography and it also confirms the genius of Orson Welles as representative of the modern theatre."
    },
    {
      "text": "Citizen Kane is so revolutionary in all departments that it is impossible to make a comparison; it flouts all the accepted rules of Hollywood picture making."
    },
    {
      "text": "Mr. Welles took his picture, his hero, his plot, himself, and his audience for a magnificent sleigh-ride."
    },
    {
      "text": "As to the influence Citizen Kane will have upon the art and technique of the screen, it should be definite and lasting."
    },
    {
      "text": "Way ahead of its time, Citizen Kane might probably be the greatest movie ever made. What young Orson Welles accomplishes in mere 2 hours is mind-blowing. [Full review in Spanish]"
    },
    {
      "text": "Citizen Kane was a cinematic achievement for its time..."
    },
    {
      "text": "Kane is unforgettable and his intense character study is a masterpiece of cinematic sublimity that is rarely, if ever, equaled."
    },
    {
      "text": "The question of whether twenty-six-year-old Orson Welles is a genius or an accident seems to be settled for all time by his very first screen effort, written, produced, directed and acted by Welles himself."
    },
    {
      "text": "This is a great picture, any way one looks at it. And it brings to the motion picture industry an exciting new personality -- Orson Welles, a man whose talents both as actor and director will be acclaimed by adult audiences far and wide."
    },
    {
      "text": "The satire here is as savage as Swift's, and in its unrelenting light the victim becomes positively nauseous; yet the treatment is brilliant and continuously pleases the aesthetic sense."
    },
    {
      "text": "[Citizen Kane] is a stirring, magnificent movie... It is always freshly conceived in that it uses the camera in ways that have not been seen exactly that way before."
    },
    {
      "text": "If you missed Citizen Kane you really missed something which is apt to prove an important step in the development of the cinema as an art."
    },
    {
      "text": "Welles has shown Hollywood how to make movies."
    },
    {
      "text": "Citizen Kane, written, produced, and directed by a young man of 25 whom America considers a genius, is an outstanding film, amazing in its presentation and vast in its conception."
    },
    {
      "text": "Most people don't care about Kane's cutting edge techniques but there's so much more to admire, appreciate and enjoy about this cinematic edifice."
    },
    {
      "text": "The realism, the development of the scenes, and the connection that is established so that the public doesn't lose the thread of the narrative is something truly extraordinary that we have not seen before. [Full Review in Spanish]"
    },
    {
      "text": "It proves Welles' restless, reckless genius -- as exasperating as it is fascinating -- is triumphant in the new medium as it was in the old ones of theater and radio."
    },
    {
      "text": "A film in which every minute is planned, everything works, not a second wasted, not a frame too much; stripped to the gears and yet rich with cinematic decoration."
    },
    {
      "text": "There are few more endlessly engrossing character studies to be found in the history of the medium."
    },
    {
      "text": "Orson Welles was ahead of his time."
    },
    {
      "text": "Welles almost creates a mise en abyme throughout Citizen Kane, inviting but ultimately refuting the tendency to want to reduce everything to one core sentimental genesis."
    },
    {
      "text": "It is a triumph of the film, and proof of its solid value and of the sense of its director and all concerned, that a human touch is not lost. Sympathy for the preposterous Mr. Kane survives. Indeed, there is something about him which seems admirable."
    },
    {
      "text": "The construction is deliberately episodic, and individual settings often appear to owe more to the modern conceptions of stage-technique than to the cinema. But the ingenuity with which the episodes are assembled sets a new level in film-construction."
    },
    {
      "text": "Welles' performance is nothing less than astonishing. He begins as a youth of 21, goes through middle age to his death, and makes every moment believable in voice, walk, and gesture. Even in his love scenes is Welles effective."
    },
    {
      "text": "Citizen Kane helped define the language of film, and the totality of its achievement provides no end of fascinating topics to discuss at length."
    },
    {
      "text": "a visual marvel of expressionistic deep-focus cinematography, elaborate production design, and varied editing rhythms"
    },
    {
      "text": "It's a gripping and absolutely fascinating drama and Welles is utterly unparalleled."
    },
    {
      "text": "This stuff is fine theatre, technically or any other way, and along with them the film is exciting for the recklessness of its independence, even if it seems to have little to be free for."
    },
    {
      "text": "What's striking now is how utterly modern it is in structure."
    },
    {
      "text": "Citizen Kane, written, produced, directed and played by Orson Welles, is probably the most exciting film that has come out of Hollywood for twenty-five years. I am not at all sure that it isn't the most exciting film that ever came out of anywhere."
    },
    {
      "text": "The labyrinth is a central locus in the language of cinema, Welles presents himself as its Minotaur, giddy and somber"
    },
    {
      "text": "Some day, and the time won't be long in arriving, Welles will be the greatest director in Hollywood."
    },
    {
      "text": "Remarkably creative film is inventive both in story and visual style."
    },
    {
      "text": "It can be classified as, in a number of aspects, one of the most arresting pictures ever produced."
    },
    {
      "text": "Perhaps when the uproar has died down it will be discovered that the film is not quite so good as it is considered now, but nevertheless Hollywood will for a long time be in debt to Mr. Welles."
    },
    {
      "text": "An ecstasy of light and shadow, of clashing textures and graphic forms, such as hadn't been seen since the silent era."
    },
    {
      "text": "Welles's deeply haunting depiction of the life of William Randolph Hearst has long been synonymous with the director's spectacularly odd and genuinely tragic career."
    },
    {
      "text": "One of the best films out there, and certainly a high point in early cinema. The love for Citizen Kane is deserved."
    },
    {
      "text": "Above all, Welles was a showman and Citizen Kane is a three ring circus of cinematic ingenuity..."
    },
    {
      "text": "Citizen Kane may very well be the most talked-about movie in history."
    },
    {
      "text": "Orson Welles' epic film, his stunning feature debut from 1941, is an enduring masterpiece that was underestimated at the time of its release due to political reasons."
    },
    {
      "text": "Citizen Kane has been cited as the greatest film ever made from so many different quarters, it's a wonder that a Congressional law hasn't been passed making it required viewing for anyone who claims they like movies."
    },
    {
      "text": "Classic should be required for any movie lover."
    },
    {
      "text": "To revisit it now is still to marvel at its wit, audacity and sheer entertainment value."
    },
    {
      "text": "Many of the novel techniques Welles developed with cinematographer Gregg Toland were calculated to offer new angles on film space."
    },
    {
      "text": "With its spirit of visual and narrative innovation, and Welles's precocious, towering central performance, Citizen Kane almost lives up to its own reputation as the best of all time."
    },
    {
      "text": "There's no denying that [Welles's] bravura performance, both in front of the camera and behind it, is spellbindingly effective."
    },
    {
      "text": "There can hardly be anything left to say about Citizen Kane, now revived on the big screen, other than to comment on sublime moments."
    },
    {
      "text": "A ground-breaking masterpiece. It contains so many examples of cinematic brilliance that it's a shock it won only one Oscar (for the screenplay)."
    },
    {
      "text": "Truly one of the greatest films ever."
    },
    {
      "text": "It would be nice to be able to buck the critical orthodoxy and say how tired and overrated Citizen Kane is; but the dulll truth is, it's still, indisputably, one of the great masterpieces of cinema."
    },
    {
      "text": "...an impressive dramatic epic that articulates some of the myths of capitalist America in a personal and human way."
    },
    {
      "text": "Citizen Kane is the biggest cinematic landmark since pictures first started moving."
    },
    {
      "text": "It is a work of art created by grown people for grown people."
    },
    {
      "text": "Look at it from an entertainment standpoint. What you'll find is that it's a very entertaining, sometimes very funny and always extremely playful film."
    },
    {
      "text": "The amazing depth of story and richness of composition make Citizen Kane a must-see for anyone who considers themselves a lover of films."
    },
    {
      "text": "It remains a gloriously entertaining classic."
    },
    {
      "text": "It is a two-hour show, filled to the last minute with brilliant incident unreeled in method and effects that sparkle with originality and invention. Within the trade, 'Kane' will stimulate keener creative efforts by Hollywood's top directors."
    },
    {
      "text": "It is still the best place I know of to start thinking about Welles -- or for that matter about movies in general."
    },
    {
      "text": "This is the inherent paradox of Welles' film: that its ending should be so equivocal, providing a satisfying resolution that simultaneously scoffs at such over-simplification."
    },
    {
      "text": "A film that gets better with each renewed acquaintance."
    },
    {
      "text": "Citizen Kane is no relic. Pop in the DVD and you'll find what you least expect - a really cool flick."
    },
    {
      "text": "The most auspicious debut film ever for a director."
    },
    {
      "text": "Welles not only inspired the bright young men with whom he collaborated, he shamed the Hollywood hacks into a realization of just how deeply they had betrayed their talent."
    },
    {
      "text": "A cinematic perfect storm of technique and sophistication, widely hailed as the apotheosis of all the innovations and advancements of the sound era."
    },
    {
      "text": "You will not only be inspired by the film itself, but your entire knowledge and appreciation of the film making process will be all the more richer because of it."
    },
    {
      "text": "It is, as a critical benchmark, unavoidable."
    },
    {
      "text": "Citizen Kane is far and away the most surprising and cinematically exciting motion picture to be seen here in many a moon. As a matter of fact, it comes close to being the most sensational film ever made in Hollywood."
    },
    {
      "text": "The greatest film of all time now has a DVD to match."
    },
    {
      "text": "Yeah, it really IS all that good."
    },
    {
      "text": "Citizen Kane is an event in motion pictures. An intelligent and intellectual stimulus, and also an experiment."
    },
    {
      "text": "Charles Foster Kane se torna assustadoramente real à medida em que o filme tenta desvendar sua personalidade."
    },
    {
      "text": "Gregg Toland's legendary black-and-white cinematography renders Kane absolutely transcendent."
    },
    {
      "text": "A backwards detective story with Kane's lost childhood as an elusive puzzle piece in a lifetime of megalomania."
    },
    {
      "text": "No scene in Kane ever fails to amaze me, and watching it for perhaps the 15th time on this new DVD, I still felt fulfilled and happy afterward."
    },
    {
      "text": "The question has never been whether 'Citizen Kane' is one of the greatest films ever made. The question is whether it is THE greatest."
    },
    {
      "text": "It frustrates, it fascinates, and it cannot be pinned down."
    },
    {
      "text": "A potent metaphor for the betrayal of principles, the souring of the American Dream, and an intelligent mediation on the corrupting nature of power."
    },
    {
      "text": "In addition to being the first great independent movie, Citizen Kane is the first great character drama."
    },
    {
      "text": "Orson Welles' great first feature recasts the history of American yellow journalism and politics of the early part of this century through the prism of the collective memories of a William Randolph Hearst-like press lord."
    },
    {
      "text": "Reviewing Citizen Kane is like reviewing The Bible or Shakespeare."
    },
    {
      "text": "The film moves effortlessly from scene to scene, even when they are forty years apart in 'real time'; there is never a sense of artifice -- every leap fits. There are no false steps in this journey."
    },
    {
      "text": "I've always said that the greatness of a film is truly measured over time, and this is one of the few films that is truly amazing to watch, and actually lives up to all that damn hype."
    },
    {
      "text": "Motion picture archives and collections across the world would be poorer without copies of this film, which will forever be recognized as a defining example of American cinema."
    },
    {
      "text": "Its surface is as much fun as any movie ever made. Its depths surpass understanding."
    },
    {
      "text": "The fresh classic masterpiece, Citizen Kane (1941), is probably the world's most famous and highly-rated film, with its many remarkable scenes,"
    },
    {
      "text": "It is the epitome of filmmaking, a masterpiece for which Welles, one of the greatest practitioners of the cinematic art, will be forever remembered."
    },
    {
      "text": "Citizen Kane, which heads the American Film Institute's list of the top 100 films of all time, has the best of everything."
    },
    {
      "text": "Filled with intriguing layers, the story of Kane's life becomes an onion that the movie keeps peeling."
    },
    {
      "text": "If you haven't seen it on a wide screen, you should check it out. The breathtakingly innovative visuals are the point of this experience."
    },
    {
      "text": "Today, the black-and-white classic holds up as a stirring portrait of not only its main subject, but of the American Dream, success as it can only be achieved in this country -- or so we like to think."
    },
    {
      "text": "Fifty years after its release, Citizen Kane still seems richer, bolder, more spectacularly alive than any other film of the studio-system era. Regardless of how many times you've seen Orson Welles' 1941 masterpiece, it always feels like the first time."
    }
  ],
  "release_year": 1941,
  "duration": 119,
  "genres": [
    "Drama"
  ],
  "synopsis": "When a reporter is assigned to decipher newspaper magnate Charles Foster Kane's (Orson Welles) dying words, his investigation gradually reveals the fascinating portrait of a complex man who rose from obscurity to staggering heights. Though Kane's friend and colleague Jedediah Leland (Joseph Cotten), and his mistress, Susan Alexander (Dorothy Comingore), shed fragments of light on Kane's life, the reporter fears he may never penetrate the mystery of the elusive man's final word, \"Rosebud.\"",
  "popularity": 9.0,
  "poster_url": "https://image.tmdb.org/t/p/original/sav0jxhqiH0bPr2vZFU0Kjt2nZL.jpg"
}