{
  "movie_name": "Despicable Me",
  "movie_id": "despicable_me_4",
  "total_reviews": 164,
  "reviews": [
    {
      "text": "betrays some of the inherent exhaustion in any series of this size and longevity, but it also finds ample new avenues of humor and pushes enough familiar buttons to earn its stripes"
    },
    {
      "text": "It expands the saga in ways that ricochet between interesting and uninspired."
    },
    {
      "text": "The franchise does not particularly need yet another sequel, but the success of the Despicable Me series is most likely not going to stop anytime soon."
    },
    {
      "text": "Giving the villain in Despicable Me 4 a cockroach fixation is an apt metaphor for the plot, which scatters all over the place like those buggers when the lights click on."
    },
    {
      "text": "Despicable Me 4, the fourth in the series plus two Minion films, lacks in plot, but its intended audience likely won't mind."
    },
    {
      "text": "The biggest problem with Despicable Me 4 is that it isn't The Minions Movie 2."
    },
    {
      "text": "Evaporative entertainment has its value."
    },
    {
      "text": "The jokes are pretty weak, but the Minions still raise half-a-smile."
    },
    {
      "text": "Don’t look for logic or even coherency with this film. Just give into the silly and watch it like a child would. If you don’t expect too much charm, heart, or basic common sense, you can have a lot of fun."
    },
    {
      "text": "The shift to small-town anonymity breathes fresh life into the familiar domestic elements, while a parallel plot involving select Minions gaining X-Men-like superpowers ups the slapstick ante."
    },
    {
      "text": "Talk about despicable."
    },
    {
      "text": "This film is a summer gem."
    },
    {
      "text": "Its the same old same old but it still entertains."
    },
    {
      "text": "The film has little to offer beyond superficial laughs. Instead of a plot, the film is a stack of subplots. It's watchable but entirely forgettable."
    },
    {
      "text": "It's loud, fast-paced, goofy family fun."
    },
    {
      "text": "Instead, “Despicable Me 4” is best consumed like snack food. Pay attention if you must but what you see on the screen may have nothing to do with what you’ll see five minutes later."
    },
    {
      "text": "This latest installment contains the typical madcap mayhem, but don’t expect much from the plot."
    },
    {
      "text": "It may be a well-used formula, but if this is anything to go by it still works. Not every family movie has to be a Pixar classic filled with existential crises: sometimes just making you smile is enough."
    },
    {
      "text": "Despicable Me 4 also draws on a lot of tried and tested things, with the usual mix of criminal activities, humor represented by the Minions and plenty of family contemplation. [Full review in Spanish]"
    },
    {
      "text": "It's a superb mix of slapstick action, family-based comedy and blissful silliness, peppered with witty references to a range of movies."
    },
    {
      "text": "Gru's journey to earn Gru Jr.’s approval, despite the initial resistance, is a heartwarming aspect of the film."
    },
    {
      "text": "Despicable Me 4 is starting to feel its age but still offers bursts of fun that will keep kids and long-time franchise fans tickled."
    },
    {
      "text": "This is a triumph for silly voices and route one slapstick."
    },
    {
      "text": "Despicable Me 4 is as silly and nonsensical as anything else in the hugely successful franchise, but with far more scattershot plotting and maddeningly less logic than usual, it may test the patience of certain audience members."
    },
    {
      "text": "The well is clearly running pretty dry. You've seen everything in this before."
    },
    {
      "text": "A fresh or rotten review for a Despicable Me movie is essentially pointless. Families will go, regardless. It will get the job done for kids with an ADD approach to storytelling, fused with a manic amount of noise and visuals. It's exhausting."
    },
    {
      "text": "I’m sure that Despicable Me 4 will make a decent box office, but much of its business is going to be from audience members who wish they were in another room while watching.  So once again, we get a film that falls short when it really doesn’t have to."
    },
    {
      "text": "Yet it’s saved by the trademark mischief and exuberance of Illumination, the French animators who are as integral to the franchise as Steve Carell’s vaguely Slavic voice acting."
    },
    {
      "text": "When it comes to Despicable Me’s fourth movie, I won’t call this great. I won’t even call this the best of the film series, but I won’t say that I felt tired of it after watching this either."
    },
    {
      "text": "There are some funny bits and sight gags, and the usual cultural references. The animation is high quality, and the 3D is above average. While the story is familiar, it is well executed by the experienced director, actors and writers."
    },
    {
      "text": "In the ever-expanding universe of Despicable Me, we've reached the fourth installment, which can only mean one thing: more Minions, more Gru, and a plot that's spread thinner than Gru's hairline."
    },
    {
      "text": "...Despicable Me 4 doesn’t muster much satire of suburban mores, but it’s got enough pizzazz about its central and sub-plots to make sure it’s not a drag when the minions aren’t doing their thing from the side-lines..."
    },
    {
      "text": "It’s pure E numbers – 90 minutes of mad animals, disco music, violence and belching – and if a good film can be made of those things, this is what it looks like."
    },
    {
      "text": "Will Ferrell and Steve Carell try their best, but funny voices require funny lines and Despicable Me 4 falls short in the zinger department."
    },
    {
      "text": "Writers Mike White and Ken Daurio seem to have stitched their screenplay together from various drafts, an unfocused approach exacerbated by disjointed direction from Chris Renaud and Patrick Delage."
    },
    {
      "text": "I don't remember much of any of the previous movies, but I do remember that they were fun, so is Despicable me 4...even if it is chaotic, completely out of ideas, and sort of messy."
    },
    {
      "text": "Pierre Coffin still impresses doing the garbled Esperanto of the Minions."
    },
    {
      "text": "While sufficiently entertaining and, as is the Despicable way, seasoned with just the right amount of gleeful subversiveness, this latest adventure cooked up for the Fourth of July crowds isn’t the franchise’s strongest."
    },
    {
      "text": "New vamps, villains, fans, mega-minions and wicked school principals populate this busy summer film which is enjoyable to the last ‘Everybody Wants to Rule the World’ sing-along"
    },
    {
      "text": "With so many storylines competing for attention, it shouldn’t come as a surprise that Despicable Me 4 all too often feels like a series of loosely connected vignettes or episodes, tied together by Gru, his family, and the Minions."
    },
    {
      "text": "The strength of the franchise remains the Minions. Although the patchwork script brings them in and out of the story on a few occasions, they prove the only part of the production that shows any life."
    },
    {
      "text": "Those that have been previously immune to the charms of Gru and the Minions are unlikely to be swayed by this latest offering. Existing fans however, will find another consistent entry into the juggernaut franchise."
    },
    {
      "text": "Whereas none of the sequels have managed to have the emotional resonance of the original film, this sequel is definitely the most fun and entertaining of the franchise. [Full review in Spanish]"
    },
    {
      "text": "Genuinely goofy."
    },
    {
      "text": "Serviceable but unmemorable."
    },
    {
      "text": "The endless stream of minion antics does have its moments, but at 90 minutes of crammed, cacophonous silliness, there just aren’t enough jokes to warrant the onslaught of misfires."
    },
    {
      "text": "You know what you’re getting when you walk in, and as long as that’s all you want, the film will make you (pun intended) happy."
    },
    {
      "text": "Despicable Me is not Shakespeare…not even close—but it is good fun for the family and good fun for this generation."
    },
    {
      "text": "All the predictable \"noise noise noise\" left me colder than Gru's iconic freeze ray."
    },
    {
      "text": "Despicable Me 4 is, surprisingly, a tragicomedy that hovers around man-o-pause... [Full review in Spanish]"
    },
    {
      "text": "Move along: there’s nothing original to see here."
    },
    {
      "text": "This is an incoherent sequel without the slightest idea of what to do with its characters. It loses sight of what makes a movie of any genre interesting."
    },
    {
      "text": "More of the same, repetitive, annoying Minion mayhem."
    },
    {
      "text": "While a few individual episodes are amusing and/or endearing, the overall film feels overlong and somewhat tedious, even with a reasonable 95-minute runtime."
    },
    {
      "text": "“Despicable Me 4,” the latest, messily passable iteration of the deliriously successful franchise that follows the adventures of the reformed supervillain Gru."
    },
    {
      "text": "Silly, familiar fare, studded with zany visual gags that invariably elicit laughs from the little ones."
    },
    {
      "text": "Perhaps the very thing that made the first film okay — the character arc — is what makes the sequels increasingly less effective."
    },
    {
      "text": "If director Chris Renaud has not come up with the most original concept, surely the Minion mayhem, as well as the outstanding voice cast, make the weaknesses forgivable. In short, Minions make me happy, and probably always will."
    },
    {
      "text": "Illumination Studios continues to equal, if not occasionally surpass, Pixar as the leader in animated films and “Despicable Me 4” is no exception."
    },
    {
      "text": "Its jabbering banana-slug mascots are the only characters who make any kind of sense."
    },
    {
      "text": "In jump-the-shark parlance, the bringing in of baby is a familiar death knell, plus DM4 is an unfunny, overly complicated mess, ultimately feeling like it's just going thru the motions. Maybe okay for kids, but the silent preview I attended spoke volumes."
    },
    {
      "text": "\"Despicable Me 4\" won't win any prizes, but if you like this kind of thing, you'll like this thing."
    },
    {
      "text": "Despicable Me 4 is less a movie and more a series of gags. The animation for the gags all have good comedic timing though."
    },
    {
      "text": "If you like the Despicable Me franchise, then Despicable Me 4 will work for you. However, it's tough to recommend to anyone else."
    },
    {
      "text": "This easily has the most cockroaches in a movie since Joe’s Apartment. Whether or not that’s a good thing is up to you."
    },
    {
      "text": ". . .  a potpourri of subplots in an action-filled cartoon with a few haphazard moments and sparkling sound effects."
    },
    {
      "text": "[Is] Despicable Me 4 great? No. Not at all. But I did laugh. More importantly, so did all the children. Sometimes that’s enough. This is one of those “sometimes.”"
    },
    {
      "text": "Despicable 4 is serviceably sweet and enjoyable but not the best in the series."
    },
    {
      "text": "This innocuous follow-up feels like a mishmash of discarded and undeveloped ideas or subplots from prior entries in the franchise."
    },
    {
      "text": "The Despicable Me franchise might not have new ideas under its belt, but at least Illumination knows how to apply their technical skills to create a visual spectacle."
    },
    {
      "text": "It looks fantastic, Gru is still loveable, and smaller viewers will be engaged enough. But Despicable Me 4 stalls in its overstuffed plot and its lack of an interesting narrative."
    },
    {
      "text": "You will find something to enjoy here — just don’t expect anything more than the usual fare."
    },
    {
      "text": "For every thing it does well, there is something else that is left unfinished or amiss."
    },
    {
      "text": "Like they took any jokes that didn't work in the previous installments and squeezed them all into this film."
    },
    {
      "text": "In the end, there’s still a lot to like about this picture — including a funny mid-credit scene — but it’s attempts to grow-up are developing past the best parts of the franchise."
    },
    {
      "text": "Despite not having the punch of others in the franchise, this colorful film moves fast, has some snappy dialogue, a few laughs and upbeat music. But it may not be on the continuous play loop when it hits home."
    },
    {
      "text": "There are no more lessons to learn or secrets to reveal, so Gru and his wife and kids just bumble through some forgettable misadventures on their way back to the status quo."
    },
    {
      "text": "Instead of exhilaration, there is an irritated fatigue about contrived situations and a stupendous lack of wit, or even originality."
    },
    {
      "text": "If there is anything that Despicable Me 4 proves, it’s that the minions will outlast humanity."
    },
    {
      "text": "It has its moments, but overall, this installment of Despicable Me feels like it's just sort of coasting along. It has too many characters and too many plot lines that don't come together and isn't as funny as the series has been in the past."
    },
    {
      "text": "“Despicable Me 4” is more of the same, but that’s mostly a good thing."
    },
    {
      "text": "Chris Renaud, co-director of parts one and two, knows his way around the characters, and he knows what his audience wants: cartoon mayhem, mild naughtiness from the Minions, social awkwardness from Gru."
    },
    {
      "text": "There could be a funny movie to be made out of “Despicable Me 4,” by playing the video of Carell and Ferrell ad-libbing in the recording booth."
    },
    {
      "text": "It’s lighthearted, silly, and exactly what you’d expect but that’s not a bad thing during a time of unrest and an election year."
    },
    {
      "text": "Fast paced and silly, this isn’t the most original story of the franchise, but who goes to these movies for the stories? You go to see the fun and frivolous Minions tear it up and Despicable Me 4 lets them run free to great effect."
    },
    {
      "text": "Yet we have Despicable Me 4, which is a serviceable movie with some laughs and isn’t too long, but it’s definitely something you can wait for at home and not something to see over Inside Out 2."
    },
    {
      "text": "It's nothing new, but clever, steeped in film lore and boasts the extraordinary Pierre Coffin as the voices of all the minions."
    },
    {
      "text": "The heart of the Gru-niverse is slapstick and capers, but the balance is all off here. A disappointing script by Mike White and Ken Daurio, who co-wrote the first three entries, goes all-in on lame physical comedy."
    },
    {
      "text": "The poster seems to promise a Fantastic Four parody which is only a minor storyline here, but there's still a lot of laughs and family-friendly silliness as Gru hides from his school part-cockroach rival Maxime, who has escaped from prison."
    },
    {
      "text": "Despicable Me 4 is too stuffed with characters and plots to reach the same level of satisfaction as the original, but it’s packed with enough good jokes and relationships that land that it can float by as a decent family flick."
    },
    {
      "text": "Despicable Me 4 almost seems fully aware that it's more a distraction—a good-natured and occasionally amusing one, at least—than a movie."
    },
    {
      "text": "Though there are still plenty of fun/gross antics to entertain the wee ones, the supervillain animation finally seems to be running out of original ideas."
    },
    {
      "text": "The whole script feels phoned in—possibly a product of last year’s WGA/SGA work stoppage. Scenes don’t really connect, storylines don’t really follow any structure, and characters are never in any real danger. Everything’s just kind of there."
    },
    {
      "text": "This time around it’s the same characters, the same gags, the same minions, the same wacky yet bland animation style, yet all with massively diminishing returns."
    },
    {
      "text": "A bit messy but effective at provoking laughter. [Full review in Spanish]"
    },
    {
      "text": "The sequel isn’t a masterpiece of children’s entertainment by any stretch, but it is sufficiently bizarre and thrilling enough to turn the head of any kid, parent or fully grown and childless adult around and around till the room resembles a Looney Tune."
    },
    {
      "text": "It doesn’t take long before the sequel starts to feel overstuffed, and a lack of teamwork, or even family time, makes the movie play like a collection of “Despicable Me” shorts stitched together."
    },
    {
      "text": "It’s all very weak sauce."
    },
    {
      "text": "Offering heart and Minion-induced hilarity, this is another solid – if familiar – entry in the Despicable saga."
    },
    {
      "text": "Despicable Me 4 is full of good ideas, with lots of them specifically appealing to what people like about these movies."
    },
    {
      "text": "Despite a few chuckles, some capable voice work and plenty of splashy color, it proves a largely empty and exhausting ride."
    },
    {
      "text": "“Despicable Me 4” is a hallucinatorily imaginative yet overstuffed amalgam of unrelated elements."
    },
    {
      "text": "Feels like a stack of B-plots stapled together rather than a full story."
    },
    {
      "text": "On their own, all of these stories have something to recommend them, but strung together into the blandest approximation of a single feature with a cohesive narrative, Despicable Me 4 falls agonizingly short."
    },
    {
      "text": "How typical of these “Despicable” filmmakers to tug at our hearts and also remind us that the series is more about family than goons, gadgets and goofy schemes. For my money, Despicable Me 4 is the best outing of this franchise since its inception."
    },
    {
      "text": "Gru and family are still charming and delightful, but too many subplots that don't go anywhere ruin the chance for this film to be really good."
    },
    {
      "text": "Overall, “Despicable Me 4” has the classic slapstick humor from the minions for younger kids and some jokes for the older folks in the crowd about retirement funds, country clubs and plant-based milk alternatives."
    },
    {
      "text": "The Second Weakest Film in the franchise right above Minions but is very very close to being the worst. Kids will Like this though"
    },
    {
      "text": "A muddled, episodic brew in which the laughs are sporadic at best and long dry spells dominate...in comparison to more imaginative animated fare, it feels tired and formulaic, draggy despite a mercifully brief running-time."
    },
    {
      "text": "... a solid story foundation and Illumination’s trademark bring-it-all-in final act. It isn’t the best installment since the original; it’s the best of the series... pulling out all the stops."
    },
    {
      "text": "'Despicable Me 4' is as funny as it is touching. Also, a high point in a franchise that does not lose its essence. Which makes it one of the audience's favorites. [Full Review in Spanish]"
    },
    {
      "text": "Suffice it to say that you'll either like Despicable Me 4 or you won't."
    },
    {
      "text": "With fun details, vibrant animation, and strong comedic energy, it is a delightful and entertaining addition to the franchise, offering enough laughs and heartwarming moments to satisfy both longtime fans and newcomers alike."
    },
    {
      "text": "Sure it repeats everything it did the last three times, but thanks to Steve Carell’s lovable grump of a Gru and those wild and crazy Minions, the random lunacy remains hard to resist."
    },
    {
      "text": "Kids will undoubtedly chuckle at their familiar exploits; the rest will view the film as an excuse to take a nice air-conditioned nap."
    },
    {
      "text": "the screenplay needs far more of these engaging moments and less of tedious subplots that aren't funny or engaging."
    },
    {
      "text": "Illumination's animators created exceptional-looking sequences and animated visuals, but the film lacks any sense of a cohesive plot. As a result, Despicable Me amounts to a mind-numbing, unentertaining experience."
    },
    {
      "text": "Hilarious, full of love and levity, Despicable Me 4 is the best animated family film of the summer."
    },
    {
      "text": "While the Despicable Me sequels have yet to rise to the standard of the original, they're still a solid choice for families looking for lighthearted comedies."
    },
    {
      "text": "I suppose I should not be trusted on all things Minion-related. Then again, you don’t need my opinion here. If you hate the Minions, you’ll stay home. If you hate the Minions, and you have kids, you’ll have to see their movie anyway — multiple times."
    },
    {
      "text": "Take away its nostalgia bait formula, referencing other films, and recycled gags, and Despicable Me 4 is nothing more than a colorful and hellish cacophony. This film is torture disguised as family entertainment."
    },
    {
      "text": "It plays like no one actually cared about even trying to be creative. To say that Despicable Me 4 is going through the motions would be an understatement"
    },
    {
      "text": "As a fun way to kill 95 minutes with your family, \"Despicable Me 4\" is an unassailable success, even if anyone hoping for more than clearing that low bar may be left wanting."
    },
    {
      "text": "Plays like an assemblage of note cards that have been stapled together in a rough approximation of a screenplay."
    },
    {
      "text": "The saga was completely exhausted at the end of the second installment. Since then, all sequels have been an attempt to stretch the gum a little more, because people continue to chew it even though it has run out of flavor. [Full review in Spanish]"
    },
    {
      "text": "The Minions' childlike antics and nonsensical gibberish are the silly source that feeds this franchise’s river of nutty creative nonsense and makes these Despicable flicks so darn delightful for kids of all ages."
    },
    {
      "text": "In a world of myriad mindless children’s entertainment options, the stories of the Despicable Me movies have always felt particularly ramshackle, and Despicable Me 4 is no different."
    },
    {
      "text": "A tired, disjointed medley of madcap visual gags, the animated film yields roughly as many legitimate laughs as can be counted on a Minion’s three-digit hand."
    },
    {
      "text": "There isn’t an ounce of recommendable substance, soulful values or slapstick sincerity within Despicable Me 4."
    },
    {
      "text": "There’s nothing intrinsically offensive about a film with low stakes, minimal plotting, or even comedy for the blandest sensibilities. But when a film is all of those things, one has to wonder what we’re even doing here."
    },
    {
      "text": "The latest entry in the Despicable Cinematic Universe continues the saga of the once-despicable Gru with the same level of visual invention and endearing characters, with action that strikes a kid-friendly balance between exciting and silly."
    },
    {
      "text": "Familiar but fun and zippy enough for a 90-minute family-friendly entertainment."
    },
    {
      "text": "Despicable Me 4 adds yet another enemy and a new baby into the mix, but the jokes are the same."
    },
    {
      "text": "The cinematic epitome of beating a dead Minion."
    },
    {
      "text": "DESPICABLE ME 4 is great summer entertainment for the entire family."
    },
    {
      "text": "Reasonably entertaining, albeit not raucously funny."
    },
    {
      "text": "Gru and his Minions have enough laughs to keep the franchise alive - but just barely. But you shouldn't rely on the old franchise magic to keep the new sequel afloat."
    },
    {
      "text": "It isn’t a masterpiece, and no one needs Despicable Me 5, but being unassumingly enjoyable isn’t easy."
    },
    {
      "text": "Too much of a good thing is becoming more of a pressing question in Despicable Me 4, a silly and breezy installment from Illumination Entertainment that passes by with about as much to remember it as a Saturday morning cartoon."
    },
    {
      "text": "The Minions get a zany B plot that becomes one of the film’s strongest threads, and a strong voice cast keeps the film engaging and nimble."
    },
    {
      "text": "Despicable Me 4 is a fine entry to the franchise that will entertain the young audience—but it’s nothing profound, it’s simply Despicable Meh."
    },
    {
      "text": "Leaves a lot to be desired in terms of laughs and thrills. The Despicable Me franchise, much like the Kung Fu Panda franchise, has officially run out of steam."
    },
    {
      "text": "With nothing to offer in the way of growth, this entry is simply another 90 minutes spent with Gru and his family... If I found this series funnier or more engaging, I’d be happy to roll along with it as well. As it stands, I don’t."
    },
    {
      "text": "There's nothing very original here -- the adorable, scene-stealing infant Gru Jr. is a dead ringer for Jack-Jack from Pixar's The Incredibles films -- but it's hard to resist all the madcap energy and throwaway visual jokes."
    },
    {
      "text": "Despicable Me 4 features way more of some of the animated franchise's hallmarks - over-the-top villains, Minions - while losing track of others."
    },
    {
      "text": "Despicable Me 4 may be conceptually thin, but with its vibrant animation, well-directed action sequences, and enough silly slapstick to amuse young viewers, this fourth installment is another fun outing."
    },
    {
      "text": "Though no game-changer, Despicable Me 4 is colourful and entertaining, and amply proves that there’s plenty of life left in this popular animated behemoth of a film franchise."
    },
    {
      "text": "Gru and the Minions bring back memories of Adam West teaming with the Three Stooges in 1965’s The Outlaws Is Coming — come for the hammy lead, stay for the slapstick."
    },
    {
      "text": "Despicable Me 4 falls into a sequel trap of trying to cram too many things in a story. The results are an unfocused and occasionally amusing animated film that has several subplots that go nowhere."
    },
    {
      "text": "“Despicable Me 4” is just messy and wearying, even at a scant 95 minutes."
    },
    {
      "text": "Despite this film's penchant for spiraling off into tangents that mostly go nowhere, 'Despicable Me 4' is still breezily entertaining fluff that will play well with young viewers."
    },
    {
      "text": "There are quite a few Mike White-esque gags about rich people and parodies of mid-20th century set sitcoms, but the overall storyline feels like a cross between Zoolander and a B-grade version of the classic The Simpsons episode Cape Feare."
    },
    {
      "text": "The key to success, Gru is informed, is to be “less Gru-ish”. Fortunately or not, the theme is barely developed. Neither is any other theme, unavoidably given the plethora of subplots."
    },
    {
      "text": "Remarkably, Despicable Me 4 delivers plenty of proof that the deliriously inventive and genuinely amusing adventures of the reformed supervillain Gru and his ever-expanding entourage won’t be getting old any time soon."
    },
    {
      "text": "There is coherence and style in the sum of these subplots that never lose their axis. [Full review in Spanish]"
    },
    {
      "text": "Unlike the previous Despicable Me, this fourth film has more ideas, superior jokes and a more clearly constructed story. [Full review in Spanish]"
    },
    {
      "text": "Driving the pace at breakneck speed are about six frantic storylines jockeying for attention, all of which are skillfully brought together for a ripper finale. Easily as funny as the previous films."
    },
    {
      "text": "A worthy addition to the franchise. It is super cute and fun, with intriguing storylines for both the minions, and Gru and family. Both new villains, and Gru Jr, bring the comedy!"
    },
    {
      "text": "This fourth installment feels flat and forced, losing all the charm and heart from yonder by unnecessarily prioritizing a plot full of current events and a stagnant narrative. [Full review in Spanish]"
    },
    {
      "text": "More of the same? Yes, but with the effectiveness and irresistible charm that made this franchise a true crowd pleaser. [Full review in Spanish]"
    },
    {
      "text": "When they really get it right, these movies put most contemporary live-action comedies to shame, even with something as simple and gloriously juvenile as a well-placed piece of toilet humor."
    },
    {
      "text": "Granted, the Despicable Me series has never taken itself very seriously, so the fourth film is hardly the obvious place to start. But it lacks a clear reason to exist (beyond the obvious financial one)."
    },
    {
      "text": "Despicable Me 4 may not reinvent the wheel. What it does deliver is a brisk, fan-friendly romp which may be a little thin on actual plot but is stuffed to the gills with jokes."
    },
    {
      "text": "\"Despicable Me 4\" does have a few gags worth a chuckle, but this is a tired effort from a franchise that doesn't really need to try to appeal to the masses."
    }
  ],
  "release_year": 2024,
  "duration": 95,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "In the first Despicable Me movie in seven years, Gru, the world's favorite supervillain-turned-Anti-Villain League-agent, returns for an exciting, bold new era of Minions mayhem in Illumination's Despicable Me 4. Following the 2022 summer blockbuster phenomenon of Illumination's Minions: The Rise of Gru, which earned almost $1 billion worldwide, the biggest global animated franchise in history now begins a new chapter as Gru (Oscar® nominee Steve Carrell) and Lucy (Oscar® nominee Kristen Wiig) and their girls--Margo (Miranda Cosgrove), Edith (Dana Gaier) and Agnes (Madison Polan)--welcome a new member to the Gru family, Gru Jr., who is intent on tormenting his dad. Gru faces a new nemesis in Maxime Le Mal (Emmy winner Will Ferrell) and his femme fatale girlfriend Valentina (Emmy nominee Sofia Vergara), and the family is forced to go on the run.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/wWba3TaojhK7NdycRhoQpsG0FaH.jpg"
}