{
  "movie_name": "Doctor Strange",
  "movie_id": "doctor_strange_in_the_multiverse_of_madness",
  "total_reviews": 464,
  "reviews": [
    {
      "text": "There’s little to anchor any of it to earth, but Elizabeth Olsen does a fine job as the emotional core of the film, with a tragic backstory that actually resonates with her villainous motivations."
    },
    {
      "text": "...Unlike other films in the superhero film genre, this installment is not aimed at a family audience due to its themes linked to black magic and the occult, and specifically to the chaotic and at times even violent consequences of the magic."
    },
    {
      "text": "Had this been any other filmmaker these moments would have probably looked mundane, but Raimi’s personal touches elevate this into an alluring spectacle with some genuine sense of terror."
    },
    {
      "text": "Much like the bizarre, quirky, and uneven “Spider-Man 3,” this “Doctor Strange” sequel has the potential to become a cult favorite of sorts. For now, though, it’s good, bombastic fun."
    },
    {
      "text": "“Doctor Strange in the Multiverse of Madness” is a visual treat. It’s a film that knows the demands of its fanbase—and promptly delivers on its promise. Whether it makes good on what the audience needs, however, is pretty much up in the air."
    },
    {
      "text": "If Feige’s vision is to create a library of films equaling that of a comic book display, there’s no better example of that than Raimi’s return to the house he helped build."
    },
    {
      "text": "Raimi’s visual style is not an imitation or an homage. He brought his visual style, a combination like a haunted house of mirrors fun house with some cartoon goofy elements, to the MCU."
    },
    {
      "text": "With all the action and horror elements, it’s easy to lose track of the fact that the story at the heart of the film is essentially a tragedy."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a step in the right direction for Disney and Marvel, but the excitement of the franchise has dimmed just enough to make it a pyrrhic victory."
    },
    {
      "text": "Raimi brings the violence and gore that previous iterations have been missing; audiences may not have ever witnessed a director make a movie quite their own as Raimi does while retaining the MCU’s signature DNA."
    },
    {
      "text": "There’s nothing significant in the storytelling of Multiverse of Madness, and Marvel’s new fashion of introducing cameos to bring more audiences to watch these movies has become quite unremarkable."
    },
    {
      "text": "A gorgeous but ultimately forgettable, chaotic film."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a Satisfying Mess. Action packed fun, horrific/gruesome at times, & a messy script… the film itself feels as if it’s missing something.. but Elizabeth Olsen? POWERFUL, INCREDIBLE & ASTONISHING."
    },
    {
      "text": "One of the most unique installments in the MCU, thanks to Sam Raimi's distinctive visual style and his impressive ability to elude the Marvel formula by seriously venturing into the horror elements."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is supposed to be about love, but it lacks even the most basic feeling of humanity. It’s a soulless film that’s more interested in cameos and what comes next than what is happening right now."
    },
    {
      "text": "With action aplenty and a little more scare than usual, Doctor Strange In the Multiverse of Madness is nothing short of entertaining, though it struggles to feel entirely unique and is simply a tiny moving part to a larger machine."
    },
    {
      "text": "It is Raimi’s horror-based touches, his eye for visually-stunning imagery, and his ability to craft engaging action set-pieces that prevent Doctor Strange in the Multiverse of Madness from breaking in half."
    },
    {
      "text": "Where No Way Home and Moon Knight tackle similar themes and raise the bar for other Marvel titles, Multiverse of Madness brings back memories of Game of Thrones’ disastrous final season."
    },
    {
      "text": "One of 2022's biggest disappointments."
    },
    {
      "text": "Once separated from its shortcomings,  It may not be the most clean-cut or composed comic book movie and crumble beneath its own creative consequences but vows that there is more to the multiverse yet to be discovered."
    },
    {
      "text": "While the first Doctor Strange movie was an enjoyable introduction to Marvel's mystic side, I was hoping for something darker and more unique. I think that's exactly what we have here, in Doctor Strange in the Multiverse of Madness."
    },
    {
      "text": "This had some really epic moments for Scarlet Witch & brought up some real human consequence of being a hero, BUT it also changed the dynamics for Olsen's Wanda since WandaVision & left no foundation of whats coming for Marvel's multiverse saga as a whole"
    },
    {
      "text": "Even when it feels like he is being held back, Raimi still pulls Multiverse of Madness in intriguing directions through his sheer commitment to the craft."
    },
    {
      "text": "Once you pare out the scary stuff and the fan service, the story is — to coin a phrase — a nothingburger. Raimi reportedly began shooting with only a half-finished script, and it shows."
    },
    {
      "text": "“Are you happy?” Marvel asks. No, no I’m very much not happy with any of this."
    },
    {
      "text": "[T]he Doctor Strange sequel wastes little time in throwing the audience into an intensely brutal epic that is sure to reverberate through the MCU for years to come."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is one of the strongest MCU entry. Sam Raimi’s patented imprint was felt across the film. Elizabeth Olsen stole the show and will continue to be a fan-favorite."
    },
    {
      "text": "A legit comeback for Raimi...He meets the moment with the good ol' Raimi dynamism and winking movie-love savvy. [4K Blu-ray]"
    },
    {
      "text": "The MCU needed a kick in the pants, and Sam Raimi was happy to gave it one."
    },
    {
      "text": "Raimi does imprint his signature on the MCU in terms of aesthetic and tone. The need to stay attentive to accessibility and sustain continuity stops him from taking bigger narrative swings however."
    },
    {
      "text": "This film has plenty going on, though Michael Waldron's screenplay attempts not to make it too much of a Jackson Pollock splatter painting."
    },
    {
      "text": "Such a waste of Raimi's talents"
    },
    {
      "text": "It may not live up to the madness the title promises, but I thoroughly enjoyed seeing Sam Raimi's take on the MCU and Doctor Strange."
    },
    {
      "text": "We unfortunately don't live in a universe where Marvel's Phase 4 is cohesive but at least it's a decent theme park ride."
    },
    {
      "text": "[Raimi's] take on Benedict Cumberbatch’s wizard is totally goofy, endlessly inventive and often makes no sense."
    },
    {
      "text": "Marvel business as usual"
    },
    {
      "text": "This and other MCU movies are so well made, it’s easy sometimes to ignore that they’re all just a series of gobbledygook dialogue stitching together CG-enhanced fight scenes. But these days, it’s Disney/Star Wars/Marvel’s world and we just live in it."
    },
    {
      "text": "The main reason to screen this film is for the performance of Elizabeth Olsen as she struggles over the immense loss of family wreaking havoc on anything and anyone that dares to disrupt her altered reality. She's stupendous!!!"
    },
    {
      "text": "Lacks the heart of the MCU’s previous multiversal cross-over movie, but it does have some stunning imagery plus Benedict Cumberbatch and Elizabeth Olsen do a lot to hold your attention even when the plot doesn’t really exist to do so otherwise."
    },
    {
      "text": "It's eye candy all the way, but who wants a 19-course all-candy dinner? The movie is more numbing than stimulating."
    },
    {
      "text": "So great to see Sam Raimi, the director of the first Spider-man series with Tobey Maquire, back at the helm of a superhero film and he puts his trademark eye for pacing and character development on full display."
    },
    {
      "text": "Somewhere in the multiverse, Doctor Strange in the Multiverse of Madness is terrific. In a different realm, it's terrible. Here in our dimension, the 28th film in the Marvel Cinematic Universe teeters and twirls in the middle."
    },
    {
      "text": "It goes through universes where it becomes terribly dull, hackneyed, without any significant surprises on the mystical side. [Full review in Spanish]"
    },
    {
      "text": "The overlapping piece of the Venn diagram of Raimi aficionados and MCU fans will be happy. And Raimi doesn’t save or destroy the MCU, so Disney is happy, too."
    },
    {
      "text": "the tale translates poorly to the big screen, even with the filmmaker working overtime to inject his raucous appetite for horror into what still needs to be a PG-13 crowd-pleaser."
    },
    {
      "text": "In addition to a couple of hours of straightforward fun, the only thing the film leaves us with is the desire to inhabit a universe in which Marvel adaptations were self-contained pieces."
    },
    {
      "text": "A napkin gets slid Kevin Feige’s way. On it is written, “Let Raimi Be Raimi.”"
    },
    {
      "text": "So nice of Wanda to make room for Doctor Strange in this Scarlet Witch movie"
    },
    {
      "text": "On the surface, Multiverse of Madness is a notable step up from the first film. But the momentum doesn’t hold throughout."
    },
    {
      "text": "As hollow as \"Doctor Strange in the Multiverse of Madness\" can ring, it offers enough grandiose spectacle to get lost in. Being able to get lost in its story as well might have made for a more compelling film."
    },
    {
      "text": "Instead of restraining a filmmaker to stick to the status quo, \"Multiverse of Madness\" allows Raimi to let his freak flag fly to a significant degree. He delivers the goods. Now was that so hard, Mr. Feige?"
    },
    {
      "text": "If Marvel directors are often merely first among hired hands... Raimi is allowed a creative signature, delivering a family-friendly take on the chills that first made his name with 1981 cult favourite The Evil Dead."
    },
    {
      "text": "There is very little Madness in this Multiverse."
    },
    {
      "text": "While the latest adventure of the fan-favorite sorcerer delivers some incredible highlights, the final product leaves more questions than answers."
    },
    {
      "text": "The result is less a fully realized story than a stopgap turning pages to bridge past and future. The fun is thus had from tone and style."
    },
    {
      "text": "The curl is already so curled... [but] it can be enjoyed as a fun toy. [Full review in Spanish]"
    },
    {
      "text": "Director Sam Raimi works his magic by giving the audience an entertaining multiverse saga by packaging it smartly with the elements that he believes can cast a spell on them, irrespective of their love for the MCU."
    },
    {
      "text": "While the film, unfortunately, avoids becoming a fully-fledged horror film, Doctor Strange in the Multiverse of Madness redefines the globetrotting adventure by jumping from globe to globe in an action-packed thrill ride."
    },
    {
      "text": "It might be Marvel's multiverse, but Doctor Strange in the Multiverse of Madness is Raimi's plaything. And we wouldn't want it any other way."
    },
    {
      "text": "Raimi pulls the franchise aesthetic away from the transcendental psychedelia of the first film and instead layers on his old-timey spook-house schtick straight out of the 'EVIL DEAD'"
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is abstract and absurd, but that’s what makes it an enchanting installment in the Marvel Universe.  The end result is a scary sci-fi epic that projects the MCU in a new direction."
    },
    {
      "text": "Both horror buffs and superhero buffs will rejoice at Sam Raimi’s return to form. The movie has something for everyone plus it contains power-packed performances by the entire ensemble cast."
    },
    {
      "text": "The dark and messy Doctor Strange sequel brings horror-tinged multiversal chaos to the MCU."
    },
    {
      "text": "It's going to service fans... but even if you aren't a fan you can come into it and embrace it as a standalone film."
    },
    {
      "text": "When it’s fun, it’s very fun but it’s never enough to free itself from the studio’s grasp."
    },
    {
      "text": "There is an army of promotional appearances from other Marvel characters. Ultimately, a story is told that is relatively uninteresting and assuredly repetitive. It is also excessively loud and remarkably bland visually."
    },
    {
      "text": "I yawned myself silly. In my theater row were two guys who'd extended their seats into movie beds, curled up, fast asleep. This boredom is a real shame, because the subject matter is cutting edge. We actually have many selves living in other dimensions."
    },
    {
      "text": "As Marvel dives into more mature themes as projects roll out, it may need to get to break out of its mold in the way it tells stores."
    },
    {
      "text": "Does it make the best use of Mr. Cumberbatch’s considerable talents? No, but that was never the point. His job is to be witty, slightly arrogant, occasionally lovelorn, and look really cool while spinning up spells. And he does. Brilliantly."
    },
    {
      "text": "A little too much of the same old same old but still entertaining."
    },
    {
      "text": "A mild improvement over its nigh unwatchable predecessor..."
    },
    {
      "text": "Overall, this entry is extremely entertaining, fun and a ride that gets dark at times — and that makes it all the more fun to watch. Raimi leaves his fingerprints all over this, and the multiverse madness makes it one for the books."
    },
    {
      "text": "Opens up the portals so Marvel Studios continues to make superhero movies for the next fifty years... [Full review in Spanish]"
    },
    {
      "text": "Sam Raimi doesn’t need $200 million to make a great film, but when he has it, he shows everyone how it’s done."
    },
    {
      "text": "It is full of crazy, over-the-top horror imagery and violence, but it also has the same slapstick energy that the Three Stooges have."
    },
    {
      "text": "Good to see Sam Raimi back at the helm, but all the Marvel madness, which can infuriate with its tie-ins and obligatory backstories, gets double loaded with the whole multiverse shebang."
    },
    {
      "text": "[It] might not be what we expected, but there’s a lot to like. It isn’t perfect, but it’s an awfully good time at the movies (and it’s even better if you’ve done the reading … er, watching). So sit back and let the good doctor cast his spell."
    },
    {
      "text": "Key in the evolution of the Marvel cinematic universe... [Full review in Spanish]"
    },
    {
      "text": "Doctor Strange 2 does not feel like an Avengers movie, frankly, it isn’t, but it absolutely feels like a Sam Raimi film. The action scenes are like a mainlining a box of Fruit Loops on a Saturday morning in front of cartoons."
    },
    {
      "text": "The endless array of special effects, dazzling though they are, function to distract from the fact that there's no there there. The most that director Sam Raimi can get out of his cast of actors is mugging and posing so the CGI can take center stage."
    },
    {
      "text": "I'm sure Doctor Strange will be perfect for some eager to see Raimi's return, but it is an insult to the most powerful being in Marvel, cutting her off at the legs and weighing her down with a misogynist trope."
    },
    {
      "text": "A visual spectacle that is delightful to witness whenever Raimi gets experimental but is bogged down with the most lifeless stories from the MCU yet. If you look up the term “style over substance” in the dictionary, you might see a still image from this."
    },
    {
      "text": "It was a refreshing surprise to see that the latest entry to the MCU, Doctor Strange in the Multiverse of Madness is, at its core, a Sam Raimi film."
    },
    {
      "text": "It’s impressive and over-the-top, even if some scenes raise an unintentional chuckle. It’s a Raimi film, after all, and even Disney can’t fully restrain him."
    },
    {
      "text": "Even with the clunky first act, Multiverse of Madness has a lot to offer and the hard lean into the macabre is an intriguing and welcome choice."
    },
    {
      "text": "A delicious macabre feast.\n[Full review in Spanish]"
    },
    {
      "text": "It doesn’t cleanly land all of its many boundary-pushing attempts, but director Sam Raimi truly goes for broke."
    },
    {
      "text": "The horror tone is too over-the-top for a Marvel film to be enjoyable and pushes the PG-13 boundaries."
    },
    {
      "text": "One of Marvel’s most frustratingly mediocre movies."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness may lack the impact or momentum of previous Marvel Movies, but Raimi’s craft turns it into a much more dark, violent and psychedelic voyage than what we are used to have in this this PG-esque cinematic universe."
    },
    {
      "text": "It's Olsen who is the anchor of this movie's originality. She is Cate Blanchett's antagonist on steroids, at least when it comes to levels of vengeance and agony. There's a high level of commitment to the role."
    },
    {
      "text": "The result of all this is a lot of crumbling masonry and an abundance of gruesomely charred bodies that make it clear Raimi is out to honour his horror movie credentials. But for all his efforts, the effect is curiously uninvolving."
    },
    {
      "text": "It’s fun and allows for nifty variations on a Marvel theme, but it’s also a bit self-defeating."
    },
    {
      "text": "it’s so good to see Raimi with an enormous canvas, plying his trade in formalist glories, not limited to action scenes with capital coherence and camera moves that are the essence of swoon."
    },
    {
      "text": "Sam Raimi works his magic on a slightly clunky sequel..."
    },
    {
      "text": "Even if the execution left a lot to be desired, the connections between WandaVision and Multiverse of Madness are undeniable, and the film scored one of the greatest MCU villains to date thanks to the foundation that a TV show built."
    },
    {
      "text": "Out of such detritus, more Marvel movies likely will emerge. That's not magic; it's business-as-usual."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a sad attempt to keep the increasingly unwieldy MCU moving toward another Infinity War–like showdown. This cinematic mess isn’t so much a film as a lazy two-hour setup without any pay off."
    },
    {
      "text": "I like the departure of it. It felt fresh within the the MCU. It didn't feel like any of the other films that we have seen already."
    },
    {
      "text": "I found it a bit underwhelming but I did have lofty expectations. Elizabeth Olsen did a fantastic job in this and was a strong wrap-up to Wanda's story."
    },
    {
      "text": "This film really succeeds solely on the strength of Elizabeth Olsen's performance and the showcasing of her full powers. Other than that, this strangely (no pun intended) felt like an MCU placeholder..."
    },
    {
      "text": "The story is a scattered bit of chaos, built upon no cohesive emotional spine."
    },
    {
      "text": "Upgrades, and paves the way for new superheroes.\n[Full review in Spanish]"
    },
    {
      "text": "The shifting back and forth between various worlds with few distinctive differences provides for more headaches than thrills...."
    },
    {
      "text": "A symphony of horror and fantasy that in its last stretch touches levels of excellence. [Full review in Spanish]"
    },
    {
      "text": "The thrills come at you with lightning speed but it's also the closest the MCU has come to the zombie apocalypse while dipping its toe in horror film territory."
    },
    {
      "text": "A frenetic, esoteric, dark adventure with psychedelic components, demonic corpses, and body horror… will excite Marvel fans. [Full review in Spanish]"
    },
    {
      "text": "The typical cameos and action setpieces take on newfound playfulness under Raimi's guidance."
    },
    {
      "text": "Fun, spectacular, frightening, and at times profoundly dramatic. [Full review in Spanish]"
    },
    {
      "text": "Despite having some exciting sequences and solid performances, Doctor Strange in the Multiverse of Madness ends up feeling uneven, unbalanced, and unfocused."
    },
    {
      "text": "If Marvel is going to ruin culture, we might as well watch Sam Raimi fiddle while it all burns."
    },
    {
      "text": "Sam Raimi's slogging, albeit scary installment to the MCU comic-book collection..."
    },
    {
      "text": "Ultimately this film's genuinely surprising guest spots and Raimi's dalliances with his dark past are the most memorable bits."
    },
    {
      "text": "This is about as fun as these movies get, even if this never-ending story has long overstayed its welcome."
    },
    {
      "text": "The second half [is] overwhelmingly mechanical at times and at others taxing. [Full review in Spanish]"
    },
    {
      "text": "It’s basically a feature-length commercial for the WandaVision streaming series and countless other properties."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness stumbles with its script and characters as neither amounts to all that much here, but Raimi’s direction rescues it from oblivion with an equal affection for the goofy and the horrifying."
    },
    {
      "text": "Emotional enough to keep the audience entertained for two hours.  \n[Full Review in Spanish]"
    },
    {
      "text": "The spark and the strangeness of the first film are gone, and while Multiverse Of Madness’s special effects are undeniably splendid, its characterisation and plotting are weak."
    },
    {
      "text": "The cast and some atmospheric visual rendering barely manage to drag the whole thing over the line, but it still ultimately feels like a bit of a mess."
    },
    {
      "text": "Sadly, this multiverse ultimately just feels like a mess."
    },
    {
      "text": "The multiverse setup has the effect of sapping the film (and series) of stakes, allowing for endless retooling beneath a thin veneer of narrative consequence."
    },
    {
      "text": "Sam Raimi fully leaves his footprint in Doctor Strange in the Multiverse of Madness. Maybe the darkest and most violent Marvel film to date, it’s just a whole lot of fun."
    },
    {
      "text": "This movie is full of sound and fury, probably signifying nothing, but it is entertaining. At a time when most movie studios seem to have a lot of trouble making movies that present an entertaining story, Marvel knows how to cover the basics."
    },
    {
      "text": "It has a remarkably straightforward plot within its nutty parallel-realities premise. It's also directed with a sharp sense of wit and horror by Sam Raimi."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness had a lot of pieces but it's an enjoyable ride. Riami's style is bold and exciting."
    },
    {
      "text": "The multiverse itself may be left feeling significantly unexplored, but it’s hard not to celebrate a Marvel movie as streamlined as this one is, right down to its shorter runtime."
    },
    {
      "text": "“Doctor Strange in the Multiverse of Madness” eliminates the playful idiosyncrasy in the interest of formula—of Marvel’s self-perpetuating business. The new film isn’t merely branded entertainment; it’s branding as entertainment."
    },
    {
      "text": "Sam Raimi offers a Marvel film with the most personality of them all. \n[Full review in Spanish]"
    },
    {
      "text": "By the third act, when all bets are off and every design choice has come out to play, the film becomes vintage Raimi."
    },
    {
      "text": "One of the most ridiculous things to come out of the Cinematic Marvel Universe. [Full review in Spanish]"
    },
    {
      "text": "Such a clash in vision makes \"Doctor Strange In The Multiverse Of Madness\" indeed madness for better and worse"
    },
    {
      "text": "Frantic, sometimes fun, lightweight Raimi movie."
    },
    {
      "text": "In the end, this movie serves to advance the multiverse narrative and open the door for new characters and possibilities. Unfortunately, it’s an unevenly paced film that shines when Wanda is on-screen, but struggles to find its footing when she’s not."
    },
    {
      "text": "It's one of the lesser Marvel movies... Both overly-complicated and dull."
    },
    {
      "text": "Multiverse of Madness is delightful, unhinged commercial art that is as complex as the multiverse itself. It’s thoughtful as it is stylish, as icy as it is effervescent."
    },
    {
      "text": "The Multiverse of Madness is a disgrace to the idea that the MCU actually cares about building characters, a slap in the face to anyone who dared invest themselves in the idea of Wanda as anything more than a disposable commodity for all these years."
    },
    {
      "text": "While the film may not live up to the multiversal madness of its title, Doctor Strange 2 manages to be something wholly unique in the MCU; a film that stands out with its own unique directorial style that hopefully signals a new direction for Marvel."
    },
    {
      "text": "Doctor Strange In The Multiverse Of Madness is a mostly terrific return to the magical misadventures of Stephen Strange and friends."
    },
    {
      "text": "Multiverse of Madness fills the narrow space of imagination with everything it has, pushed on by a director who has always known how to play the studio game."
    },
    {
      "text": "There’s a lot to enjoy in this interdimensional romp, not the least because it has Raimi’s bonkers handprints all over it."
    },
    {
      "text": "I felt uninvolved after 15 minutes and dangerously close to bored as we ran into the second hour."
    },
    {
      "text": "An entertaining if rather undemanding Marvel filler that pleasingly fills the gaps as we wait to discover the real overarching villains and plotlines of Marvel Phase Four and beyond."
    },
    {
      "text": "Raimi gives the film a manic energy and the occasional spark of B-movie horror."
    },
    {
      "text": "Sam Raimi...has made a film with breakneck pacing, goopy effects, and some impressive visuals."
    },
    {
      "text": "Sometimes its reach exceeds its grasp, but when it’s really working, “Multiverse of Madness” proves to be one of the most technically impressive, and emotionally satisfying, superhero movies I’ve seen in years."
    },
    {
      "text": "There is only the mess, without the fun. And we are bored!"
    },
    {
      "text": "'Doctor Strange in the Multiverse of Madness' is entertaining and artistic, but in many ways feels like a step backward."
    },
    {
      "text": "This Doctor Strange sequel, possibly the next great Halloween cult classic, will get many unintended laughs and eye rolls. The whiplash from the chaotic journey will have many hesitant for another Strange saga any time soon, in this universe or another."
    },
    {
      "text": "The aesthetic vibe here is definitely Raimi, and even the demands of Marvel’s style of shared-world filmmaking don’t dilute his style to any great degree."
    },
    {
      "text": "How can something with moments of such visual weirdness feel so ordinary? Raimi's occasional swerves are sidelined for a banal approach to magic that only underwhelms. Where are the swathes strangeness? Where's the spark madness? Too brief, too brief."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is more over-the-top spectacle than it is heart."
    },
    {
      "text": "The dedicated fan, apparently, can believe in Doctor Stephen Strange as a man thwarted in love, or Wanda the witch as a woman whose frustrated maternal urges have led her to try to take over the universe – or in this case, the multiverse"
    },
    {
      "text": "It’s definitely the darker side of magic and fantasy, and Raimi manages to infuse a surprising amount of his “Evil Dead” self into this."
    },
    {
      "text": "The Doctor Strange sequel is a bloated comic book event in movie form that still manages to showcase some of the MCU's best ideas."
    },
    {
      "text": "For a movie with the title “Multiverse of Madness,” this doesn’t live up to its title. The film feels disjointed, concise, and with no substance or heart. Also...I can’t help but notice the poor handling of the female characters."
    },
    {
      "text": "Once rampant, the movie cannot be tamed."
    },
    {
      "text": "It's like an incomplete version of a film that could have been more interesting and daring, but that would have needed more pre-production time to complete. It isn't bad, but I suggest you lower your expectation before seeing it. Full review in Spanish."
    },
    {
      "text": "I’ve seen all these movies and watched some of the shows, yet still found 'Doctor Strange in the Multiverse of Madness' nigh-incomprehensible most of the time, like I was bluffing my way through a class for which I hadn’t done the reading."
    },
    {
      "text": "With Dr. Strange in the Multiverse of Madness, Sam Raimi has successfully navigated the Disneyfication of the multiverse and emerged with his horror cred intact."
    },
    {
      "text": "‘Doctor Strange’ sequel finds magic in Sam Raimi’s direction, but Marvel doesn’t seem to trust it enough."
    },
    {
      "text": "Despite the numerous positives, the biggest negative is Doctor Strange in the Multiverse of Madness' screenplay [which] threatens to bring the whole house of cards toppling down."
    },
    {
      "text": "This film requires an encyclopedic knowledge of Marvel minutiae and world-class cross-referencing skills to fully work. And who, outside the diehard fanbase, has the bandwidth for that level of commitment?"
    },
    {
      "text": "The MCU isn’t going anywhere anytime soon. For the fans who have been loyally following every entry, this one casts enough of a spell."
    },
    {
      "text": "At the end, we’ve had a good time, but our eyes and ears have had more of a workout than our emotions did."
    },
    {
      "text": "Doctor Strange In The Multiverse of Madness is visually imaginative but underwhelming."
    },
    {
      "text": "…the multiverse promises all kinds of interesting metaphysical questions, but the slam-bam nature of the MCU doesn’t allow many answers…"
    },
    {
      "text": "The thought provoking affects of a multiverse take a back seat to obligatory action sequences, rushed storytelling, and even more intriguing narrative choices and cameos that are too quickly retconned."
    },
    {
      "text": "There's nothing particularly awful, but the title says it all, and so does a warning from a pivotal character who quips, \"Rule number one of multiversal travel is you don't know anything.”"
    },
    {
      "text": "“Madness” is far from a perfect movie. At times it is quite messy, but it’s easy to overlook its flaws because of the fresh infusion from Raimi."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is too jumbled and overanxious for coherent amusement. Hard to believe that Marvel is still churning out this garbage so long after Man of Steel rooted its characters to humane instinct throughout time."
    },
    {
      "text": "It lacks a cohesive arc, but in the hands of director Sam Raimi -- returning to the genre he helped birth with 2002’s Spider-Man -- this messy movie is a fun ride, with occasional flashes of personality."
    },
    {
      "text": "Best in show is Elizabeth Olsen by such an impressive margin that it almost ought to have been called Scarlet Witch in the Multiverse of Madness ."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is one of the messiest, most chaotic Marvel movies to date. It is also the most gnarly, scary, gonzo, insane thing the studio has ever allowed to happen."
    },
    {
      "text": "This “Dr. Strange” epic is one of the best examples yet of how the empire Kevin Feige created manages to keep succeeding over and over and over again. Perhaps its rivals should take notes."
    },
    {
      "text": "[...]Multiverse of Madness is a beautiful blend of the superhero and horror genres brought to life through Sam Raimi’s skilled direction, a hauntingly beautiful score, and memorable performances, especially from Elizabeth Olsen and Benedict Cumberbatch."
    },
    {
      "text": "Some of its boldest choices don't fully work, but it's hard not to appreciate a Marvel blockbuster that strives to stir the pot and really lets Raimi be Raimi."
    },
    {
      "text": "Save for one cool (and brief) visual sequence, this multiverse feels less mad than studio-mandated."
    },
    {
      "text": "Raimi and Waldron have managed, on a scene-by-scene basis, to create something which often feels truly fresh and original."
    },
    {
      "text": "Strange is never given a chance to go on regular adventures or explore the boundaries of mysticism. He just has to keep cleaning up other superheroes’ poopies. When can Doctor Strange have his own poopies?!"
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is at its best when it embraces Sam Raimi's horror style."
    },
    {
      "text": "Despite some big moments in the multiverse and Raimi raising Cain in some glorious spots, this movie conjures frustration.  For starters, the title character feels like a secondary one."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is everything you could reasonably expect from a Sam Raimi-Kevin Feige collaboration, but not much more."
    },
    {
      "text": "Spectacle and fan service over characterization has always been the MCU's biggest Achilles heel."
    },
    {
      "text": "Multiverse of Madness is a triumphant return to the director's chair after a nine year absence for Sam Raimi."
    },
    {
      "text": "While Raimi injects as much soul into this sequel as the Marvel blueprint will allow, it’s difficult to see the film as anything other than a cog in a bigger machine."
    },
    {
      "text": "The mad dash through the multiverse in the first act is wildly creative, but once the characters start prolonged visits to the alternate universes ad nauseam, they start to lose their intrigue. This could be one of Marvel's lightest and darkest films yet."
    },
    {
      "text": "Despite an overly cluttered script, Doctor Strange in the Multiverse of Madness shines with great direction by Sam Raimi, whose style is a nice change of pace from recent MCU installments."
    },
    {
      "text": "As much fun as this was at times, I couldn’t help feeling that a better movie was lurking somewhere underneath."
    },
    {
      "text": "'Oz the Great and Powerful' had more personality."
    },
    {
      "text": "At the end of the day, this campy and action-packed movie is the second-strongest MCU Phase Four film -- after Spider-Man: No Way Home (obviously)."
    },
    {
      "text": "Director Sam Raimi delivers on taking audiences through a fun and sometimes edge-of-seat-gripping experience, while also having you feel enthralled by its scope."
    },
    {
      "text": "This isn't the best, the funniest, or the most star-studded Marvel film, but it is memorable, melancholy, and good for a fright."
    },
    {
      "text": "I’m so here for the weird."
    },
    {
      "text": "Overall I thoroughly enjoyed Multiverse of Madness: It was a psychotic thrill ride with a strikingly, pleasantly different tone from any Marvel movie before it, and I was entertained from start to finish."
    },
    {
      "text": "This Doctor Strange is a creation with layers, and that is more than welcome."
    },
    {
      "text": "Try as Raimi might, there's only so much directorial verve he can bring to a project designed to erect another stone in the wall of Marvel's Phase 4, to wrangle a story that's at once complicated and incredibly dull."
    },
    {
      "text": "There are few directors... who could have provided the tone that this film needed to succeed, and that’s because Raimi has not only proved that he knows how to provide chills and thrills, but he does so in a manner that presents a subtle sense of humor."
    },
    {
      "text": "Give it up for horror-schlock auteur Sam Raimi, who does the impossible and makes a corporate-owned cash cow look like something he furiously scrawled into his dream journal."
    },
    {
      "text": "[Dr. Strange] is perhaps Marvel's first film that dives deep into more supernatural, dark fantasy elements as Raimi's signature styles of weirdness and spookiness are on full display from start to finish here. It's quite refreshing to see something new."
    },
    {
      "text": "MCU diehards will surely be entertained by all the impressive multiverse designs, performances and Raimi-isms found in Doctor Strange in the Multiverse of Madness. But as a standalone movie, its madness leans a little too close to maddening."
    },
    {
      "text": "Dr. Strange opens and closes on some crashingly powerful notes, and in the intervening two hours delivers a fast-paced, universe-hopping, nicely self-contained tale."
    },
    {
      "text": "It's a mad, mad, mad, mad world in Marvel's gruesome superhero adventure \"Doctor Strange in the Multiverse of Madness.\""
    },
    {
      "text": "This is the superhero film disappearing down the rabbit hole; pop cinema eating itself."
    },
    {
      "text": "Even one of the Marvel Cinematic Universe's clunkiest films so far can provide an entertaining experience."
    },
    {
      "text": "It’s scary, it’s brutal, it’s mind-bending, and it’s incredible to look at. Even with the lackluster storytelling, I already have a genuine need to see this in a theater again, due to just how immersive and compelling the visuals are."
    },
    {
      "text": "There are certainly worse examples than this direct sequel to Scott Derrickson’s 2016 Doctor Strange, but it’s merely another special effects extravaganza about superhuman forgetting how to administer the human portion of the formula."
    },
    {
      "text": "While undeniably manic, the film often feels like a whiteboard full of notes and themes that the writer forgot to connect lines through. This could represent a big storytelling problem for Marvel going forward cinematically."
    },
    {
      "text": "Despite his sorcerer bona fides and voluminous cape, Cumberbatch’s Doctor Strange isn’t strange enough, and trying to parse the convolutions of the Marvel multiverse is more exhausting than engaging."
    },
    {
      "text": "a bit of a fizzle"
    },
    {
      "text": "Raimi pulls off an extremely thorny assemblage with Doctor Strange in the Multiverse of Madness, adding just enough of his own visual flair and madcap stylings to bolster an otherwise spotty script from Michael Waldron."
    },
    {
      "text": "In many ways the film is an amusing reimagining of The Wizard of Oz from the director of The Great and Powerful Oz. Olsen is a huge asset. Wong should have had more to do."
    },
    {
      "text": "My frustration levels were growing even in the scenes that worked, because so much surrounding those moments didn't match them in tone or quality. I'm still mostly on board with this film, but it was a much closer call than it should have been."
    },
    {
      "text": "While not the best Marvel offering (it meanders at times and could have used some tightening), I liked the changeup and new addition as well as fresh coats of paint applied to the usual trappings."
    },
    {
      "text": "This makes me excited for MCU movies again."
    },
    {
      "text": "This story collage is uneven and sometimes forced, as it delivers fan service in the film’s baggy middle section. But when Raimi is permitted to revisit elements from his storied film history, the movie finds its footing."
    },
    {
      "text": "Even occasional bits of Sam Raimi-infused horror fun aren’t enough to right the lilting ship of Doctor Strange in the Multiverse of Madness."
    },
    {
      "text": "When the film enters the multiverse (which is a stunning sequence) everything revs up & it doesn’t let up, leaving tantalizing questions in the end that are not unsatisfying for a change. The movie is an imaginative & visionary comic book great big WOW!"
    },
    {
      "text": "Raimi offers up a film that becomes deliciously twisted and macabre but ends up feeling restrained by the MCU formula...We all go a little mad sometimes, but this is an instance where we all could have stood to go just a little bit madder."
    },
    {
      "text": "Sam Raimi follows the Marvel bible but still manages to have his own directorial flair…. Action is almost non-stop, and you might just be gasping for air as you stick it out through the final credits."
    },
    {
      "text": "There is no mistaking that \"Multiverse of Madness\" is a Sam Raimi film, and his trademark style lends itself to the best moments in the film."
    },
    {
      "text": "The return of Benedict Cumberbatch to the world of Strange may seem chaotic madness to the uninitiated, but it’s thrilling to see livewire director Sam Raimi breathe hilarity and juicy horror into the Marvel formula that so needed a shakeup. This is it."
    },
    {
      "text": "The first half is clunky and could have used a stronger opening to ground this story. I wonder if Michael Waldron or Marvel head honcho Kevin Feige were relying too heavily on WandaVision and No Way Home as the catalyst for this."
    },
    {
      "text": "On the one hand, I'm a little over the Marvel \"Multiverse.\" On the other hand, this newest adventure of Marvel's mystical mage is a lot of fun."
    },
    {
      "text": "Raimi's penchant for mind-bending visuals and macabre fun is given free, fantastical rein."
    },
    {
      "text": "Barely feels like a Raimi film — until it goes full Evil Dead 2/Drag Me to Hell."
    },
    {
      "text": "The good news is that this is a Sam Raimi Movie. Kinda. Sorta. Around the edges. There’s a filigree of Sam Raimi-dom to the picture, a nice patina of the old charms."
    },
    {
      "text": "\"Doctor Strange in the Multiverse of Madness\" is going to be polarizing. Part chaotic action film, part horror film, this has Sam Raimi’s name all over it, but the scattered tones prevent the film from fully coming together in the end. Olsen shines."
    },
    {
      "text": "A disjointed and unconvincing turn from Cumberbatch buckles under the weight of its chaotic storyline, making you mad in the multiverse."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness largely lives up to the promise of its title thanks to the wildly inventive, entertainingly chaotic visual style that Raimi honed on his Evil Dead slapstick horror trilogy."
    },
    {
      "text": "Marvel fans are gonna love all those fan-servicing, momentum-sapping cameos, but Raimi fans are going to find themselves liking the film more and more the longer it goes, because the director seems most firmly in control later on..."
    },
    {
      "text": "[Cumberbatch] brings a lot more intensity than you'd think possible to moving his fingers an inch or two as digital sparks fly."
    },
    {
      "text": "As for “story points,” I saw nothing that answers to that description. All we get is a grab bag of oddments."
    },
    {
      "text": "This is clearly not just Raimi directing a Marvel movie, this plays more like a Sam Raimi movie set in the Marvel Universe....The film is perhaps let down a little by the shorter runtime as we don't get to have much back story for the new characters"
    },
    {
      "text": "There is some beauty in the carnage of Doctor Strange in the Multiverse of Madness, but ultimately they did Wanda dirty. It's a trippy ride, like being in the freaky funhouse except when you find your way out, you realize it wasn’t that fun."
    },
    {
      "text": "This is the most violent MCU movie to date. Marvel Studios really pushed the boundaries on the line of R vs PG-13. Everything is an upgrade from the first film, however being called the Multiverse of madness wasn't explored enough making me long for more."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness certainly is the MCU’s first true horror movie and something completely unique for the franchise."
    },
    {
      "text": "More concerned with delivering a spectacle than a story. While far from a total disaster, this confusing, jumbled film manages to suck most of the fun right out of one of Marvel's most interesting characters."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness gets lost in its multiverse shenanigans, and forgets that great stories are ultimately about people and their relationships."
    },
    {
      "text": "It's just not as ... Strange as the first one."
    },
    {
      "text": "Despite some great parts, it's what I was afraid No Way Home would be - a middle piece in the MCU packed with meaningless cameos and stuffed with story threads that don't really service the film."
    },
    {
      "text": "Raimi has long been a master at balancing mirth and macabre, and the colossal budget of a studio tentpole provides a massive canvas upon which he can paint -- it's too bad we're forced to slog through the rest of the muck to get to the good stuff."
    },
    {
      "text": "I’m thinking of a moment in the original movie in which Stephen looks skeptically at a deeply corrupted individual nattering about the greater good and retorts, “No. I mean, come on—look at your face.” Nobody says that in the sequel—but they should."
    },
    {
      "text": "Raimi sprinkles in as much horror as the generally family friendly Marvel will allow him. The result is actually a somewhat refreshing overlay on the formulaic template (that we know and love). Also shout out to Xochitl Gomez who is a breath of fresh air."
    },
    {
      "text": "The multiverse concept is discombobulating enough as it is, so when so many things are hurled together at maddening speed, it can be pretty exhausting. Despite some good performances, this MCU movie isn’t one I’m keen on revisiting anytime soon."
    },
    {
      "text": "Finally, the true power of the Scarlet Witch is unleashed upon the MCU -- and Elizabeth Olsen absolutely crushes every scene. There are horror elements, but this still remains a superhero movie. Thankfully, the cameos don't overshadow the story."
    },
    {
      "text": "Sam Raimi’s cycling through his filmography within the film combined with Elizabeth Olsen’s performance keeps this sequel evolving despite its messy chaos."
    },
    {
      "text": "Under Sam Raimi's watch, Multiverse of Madness feels like the first MCU movie in a while to be fueled by a genuine filmmaking vision."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a unique creature that is as fascinating to watch as it is thrilling to experience."
    },
    {
      "text": "Magnificent visuals."
    },
    {
      "text": "The entertainment value here is undeniable, but Marvel fatigue is starting to set in."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness certainly lives up to its title in delivering yet another diverting chapter of the MCU, but there’s an unfortunate lack of method to the…well, you know."
    },
    {
      "text": "... an obligatory Marvel Cinematic Universe installment until it becomes possessed, quite literally, by a horrific spirit."
    },
    {
      "text": "This movie is quite fast-paced but not to the point where it feels rushed. Elizabeth Olsen is a standout in this movie. Sam Raimi brought elements of horror to the MCU! Absolutely catch it opening night!"
    },
    {
      "text": "It’s a funhouse ride, thanks to Raimi, who enlivens the Marvel template with his visual flourishes and macabre horror-tinged humor."
    },
    {
      "text": "[Doctor Strange] deserves credit for pushing the Marvel Cinematic Universe into new territory. While, thanks to some of the twists and turns, it also suggests that more ambitious storytelling and surprises might, thankfully, be on the horizon, too."
    },
    {
      "text": "It's great to see a Marvel film that has a balance between the director's style and the needs of the studio. It's great to see a Marvel film that pops with colour and feels close to its comic book origins without being too obvious."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is one of Marvel’s boldest gambles yet. Probably because it’s one of the first of these MCU movies to confidently proclaim itself as something it isn’t really for everyone..."
    },
    {
      "text": "You know who I loved in this movie? Elizabeth Olsen."
    },
    {
      "text": "Watching it is an exercise in whiplash, going from being delighted to frustrated across the entire runtime."
    },
    {
      "text": "The characters are done a disservice, the potential of the Multiverse is squandered, and even the finale proves anticlimactic. Our only solace is that, in some faraway universe, Sam Raimi was given complete creative control to make a good film."
    },
    {
      "text": "Too often, \"Doctor Strange\" is muddled, sluggish and ordinary."
    },
    {
      "text": "I was thrilled about the idea of a new Sam Raimi comic book movie, but Doctor Strange 2 suggests that these days, Marvel characters are the Apes and directors are just the Slurp Juice."
    },
    {
      "text": "As gleefully outlandish as any independent cult movie."
    },
    {
      "text": "After the sheer joy of Spider-Man: No Way Home, Marvel’s Doctor Strange in the Multiverse of Madness feels like a second-rate carny ride."
    },
    {
      "text": "Whenever Raimi gets the space to set his own terms, the slapstick comedy and anything-goes macabre spirit of the Evil Dead films and Drag Me to Hell acts as a creative defibrillator for the MCU."
    },
    {
      "text": "Haunted-house frights gussied up with Marvel bombast? Count me in."
    },
    {
      "text": "Every good magician knows that the real trick is making the audience care. For all of Doctor Strange in the Multiverse of Madness’s mind-bending universe jumping, that particular magic never manages to arrive in the theater."
    },
    {
      "text": "A fast-moving, sometimes thrilling and often messy adventure."
    },
    {
      "text": "If, in the end, this is more a Marvel movie than a Sam Raimi joint, it demonstrates once again that the director can comfortably and confidently handle the demands of mega-franchise filmmaking."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness sees the Marvel Cinematic Universe take a tentative step into the world of horror. What results is one of the more emotionally dark and dour yet striking entries in to the MCU."
    },
    {
      "text": "There are clearly some geniuses that work for Marvel...but their collective effort seems unable to keep the MCU continuity from tangling itself up in giant knots, resulting in an increasingly tiring exercise for the loyal viewers to take part in."
    },
    {
      "text": "'Doctor Strange in the Multiverse of Madness' is at its best when Sam Raimi is set loose to incredible effect, but can all too regularly be found creaking under the weight of the MCU machine."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a one of a kind blockbuster experience and a pure, unadulterated Sam Raimi movie that, while not quite the crazy ride through the Multiverse we expected, delivers a fun, horror-tinged trip."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness doesn’t have the weight of Everything Everywhere All At Once, another recent examination of the multiverse, but despite its unevenness, it’s a good, and sometimes gory, time at the movies."
    },
    {
      "text": "While In The Multiverse of Madness isn’t quite a horror movie, it certainly has horror elements that may come as something of a shock to younger viewers (and their parents)."
    },
    {
      "text": "The strongest MCU outing since Black Panther... as much Marvel Machine as it is Raimi enjoying his return to the big screen after almost 10 years away, deploying every trick he keeps up his sleeve."
    },
    {
      "text": "The MCU sprawls dizzyingly sideways into parallel universes and alternate timelines before settling into a more intimate story of self-doubt and self-reflection, about the choices we make and the alternatives we’re haunted by."
    },
    {
      "text": "There might be plenty of trippy imagery and Raimi’s style bleeds through, but this is a film with more style than substance."
    },
    {
      "text": "Sam Raimi's dimension-hopping horror adventure lives up to the weirdness that is true to the title character."
    },
    {
      "text": "The script’s a messy sort of mess. There are also clear signs of a nervy director at work."
    },
    {
      "text": "The Multiverse of Madness is a frustrating mix of eclectic elements that at times feel more like Raimi referencing his Evil Dead movies than his previous superhero work."
    },
    {
      "text": "Marvel's most comic book movie yet. Anything goes at this point."
    },
    {
      "text": "Michael Waldron’s script is cumbersome in translating the comic book characters created by Stan Lee and Steve Ditko for the big green screen treatment. And while the visuals get high marks, the emotional connections needed to elevate the film aren’t there"
    },
    {
      "text": "Its primary concerns are the bizarre, the mischievous, and the occasionally gruesome. Let's be grateful ... for something decidedly different."
    },
    {
      "text": "Despite Raimi’s involvement, this muddled mess rivals the weakest of the entries in the MCU      ...the movie is like a coercive commercial for Disney+."
    },
    {
      "text": "... there are too many multiverse storylines bouncing off cinema screens these days. Marvel TV series’ seem to have time to allow the stories to develop better at a more manageable pace. In Multiverse of Madness, it’s just too frantic, and exhausting!"
    },
    {
      "text": "An often dull, uneven and overproduced spectacle. In a double feature with Everything Everywhere All At Once, this would be the inferior B-movie."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a bonkers visual triumph, hindered only by some unfulfilled emotional throughlines."
    },
    {
      "text": "Despite the seduction of multi-verse possibilities, the story remains grounded, focused, and delightfully Sam Raimi."
    },
    {
      "text": "Playful, carnivalesque and occasionally funny nods to Sam Raimi’s canon aren’t exactly evidence that a director got to exert authorial control over Marvel’s factory-line green screen assault. It’s more like giving a dog a treat for fetching your slippers."
    },
    {
      "text": "Never quite a full-blown horror or as weird as it could be, but nowhere near as rote as the first one, 'Doctor Strange In The Multiverse of Madness' is a swirling mixture that only Sam Raimi could possibly concoct and make this good."
    },
    {
      "text": "“Doctor Strange 2” extends no mercy to those who merely seek escapist superhero entertainment. Study up or risk suffering complete disorientation."
    },
    {
      "text": "Some of Raimi’s signature camp feels out of place in the MCU setting, but his visuals and thrill-a-minute scares are on point."
    },
    {
      "text": "The story makes apocalyptic stakes — the fate of the multiverse; the struggle between good and evil — seem curiously trivial."
    },
    {
      "text": "\"Multiverse of Madness” is still a Marvel movie, meaning it’s more fun than anything else and winds up being a special treat for those who like to take a walk on the weird side."
    },
    {
      "text": "While Benedict Cumberbatch’s original solo outing delivered a cerebral LSD trip with a sinister inflection, here Sam Raimi’s penchant for gore is executed to euphoric effect."
    },
    {
      "text": "It doesn’t happen immediately, but when it matters most, Raimi unleashes all of the crazy, comedically vaudevillian, blood-soaked, visually audacious tricks fans expect from him, and this sequel comes alive like no other MCU entry in recent memory."
    },
    {
      "text": "The ideas that hold a gleam of potential are shot down by the film’s rank ugliness, its incessant pace of exposition, the utter slog of the first hour, and the insistence on special effects that render the horrifying as textureless."
    },
    {
      "text": "There’s too much narrative, too many universes, and too much CGI. The MCU is becoming everything, everywhere, all at once. And it’s simply too much. Madness indeed."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness in the best way is a legit movie roller coaster ride, and I had a blast riding the entire time."
    },
    {
      "text": "It’s a wonder that Multiverse of Madness works as well as it does, given all of the things behind-the-scenes that are working against it."
    },
    {
      "text": "It might not leave you spellbound but you're likely to be charmed."
    },
    {
      "text": "You have to go back to The Rise of Skywalker to find something that commits to destroying itself so early and with such earth-scorching choices."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is an odd and quite brave entry into the Marvel universe."
    },
    {
      "text": "It’s delicious melodrama at times, cut alternately by straight humor and gravitas. As messy as it looks on paper, it’s never less than visually stunning."
    },
    {
      "text": "Like No Way Home, this movie feels like coming home -- these are heroes who do not have to introduce themselves, so the story can kick off right away."
    },
    {
      "text": "A wacky comic-book spinoff that knows it can get away with whatever it wants."
    },
    {
      "text": "At one stage Strange finds himself in a mystic duel where notes from sheet music are hurled like ninja stars: a few more ideas like that and this really would have been magic."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is not without its problems, but Raimi injects more than enough macabre fun to overcome an uneven script and ensure that his sequel emerges as a consistently entertaining watch."
    },
    {
      "text": "Cumberbatch steps up the challenge of being various versions of Stephen Strange...the film belongs to Olsen, who builds on her promise from Wandavision."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is an oddly-named, poorly-written, and too-bizarre-for-its-own-good movie that may end up only being enjoyed by those who love the comic books."
    },
    {
      "text": "Leaning into the sideshow kitsch of a superhero movie about a flying magician in an anthropomorphic cape, Raimi — in a marvelous act of movie prestidigitation — has pulled a cute rabbit from the old Disney hat."
    },
    {
      "text": "Another $250 million lump of cinematic tofu."
    },
    {
      "text": "The morbid joy Sam Raimi manages to induce here is undeniable. The madness, perhaps, is that he must manifest his violent delights through a content delivery system for babies."
    },
    {
      "text": "This is a solid film with some absolutely stunning ideas and creations peppered throughout."
    },
    {
      "text": "Sam Raimi's technically dazzling, horror MCU film (with great help from Danny Elfman's brilliant score), impressively overcomes the low-level stakes that typically plague these scripts.  Elizabeth Olsen is magnificent."
    },
    {
      "text": "“Madness” is decidedly a Raimi film, packed with his specific sense of direction, editing, and staging, resulting in a cinematic rollercoaster ride filled with shocks delightful, gruesome, and delightfully gruesome."
    },
    {
      "text": "[Doctor Strange in the Multiverse of Madness is] a crummy-looking, mostly incoherent slog peppered with hints of “director” Sam Raimi’s visual idiosyncrasies."
    },
    {
      "text": "Being the most powerful doctor in the universe, it seems, is some serious, ponderous business, and not a lot of fun."
    },
    {
      "text": "A Marvel entry meant for mega-fans, but with intriguingly dark shadings and moments of emotional power."
    },
    {
      "text": "Expecting filmgoers’ appreciation of character motivation to be based on prerequisite media that they haven’t consumed fully — or dutifully — enough doesn’t just feel bad. It feels unfair."
    },
    {
      "text": "Clocking at just two hours (not counting the end credits), Doctor Strange in the Multiverse of Madness is briskly paced in most parts with enough visual distractions to keep you occupied."
    },
    {
      "text": "Sam Raimi marries his macabre sensibility with his love of the wild possibilities of comic books to create a Marvel movie that is expansive, ambitious and overwhelming."
    },
    {
      "text": "The film's wild mesh of body horror, gore and creepiness is pure gold"
    },
    {
      "text": "One crazy, dangerous and frightening journey made even more so by the fabulous soundtrack courtesy of Danny Elfman. A plethora of scary creatures abound, along with some interesting characters loyal MCU afficionados will be thrilled to see."
    },
    {
      "text": "A marvelous cast --- including cameos that cannot be revealed in a review --- jaw dropping special/visual effects, and incredible set designs make this an effort that will challenge the biggest of the MCU’s blockbusters for gross proceeds."
    },
    {
      "text": "It was a nice surprise how free Marvel Studios allowed Sam Raimi to play in their backyard. I enjoyed the ride...mostly thanks to Olsen and Cumberbatch's work, but especially seeing Raimi be Raimi in 2022. Full review in Spanish."
    },
    {
      "text": "It's simple enough for a multiversal travel movie. Raimi gives us an incredible MCU film filled with horror genre hints and an amazing score by Danny Elfman. The villain feels a little incoherent, but serves a development purpose. [Full review in Spanish]"
    },
    {
      "text": "I didn’t much like Doctor Strange in the Multiverse of Madness a whole lot. \n\nBut I didn’t dislike it enough or in a way that would make my tomato rotten."
    },
    {
      "text": "As stunning as the film looks, the characters are the ones who brings this movie to life. Benedict Cumberbatch elevates Dr. Strange to new heights and Elizabeth Olsen as Scarlet Witch is better than ever, exploring new depths to her character."
    },
    {
      "text": "A messy, chaotic mix of a dozen ideas that don't quite all gel together harmoniously, the film still deserves admiration for taking plenty of mighty big swings of the bat. Stylistically and thematically, it's unlike any MCU film thus far."
    },
    {
      "text": "The convoluted narrative about multiple MacGuffins and multiple universes that only make sense if you’ve seen every MCU TV show and film prior all added up to a rather dull experience for me."
    },
    {
      "text": "… destined to be the Marvel film most appreciated by stoners, goth kids, horror fans and twitchy weirdos."
    },
    {
      "text": "Entertaining, yet messy & surprisingly tame. For better or worse Sam Raimi's horror vision & style leave their mark on the MCU, while Elizabeth Olsen gives a great performance in what really works as the true WandaVision finale. [Full review in Spanish]"
    },
    {
      "text": "Multiverse of Madness feels uncharacteristically accommodating of the whims of one Sam Raimi, complete with genuinely gleeful horror, shockingly brutal violence, and a terrifying surprise villain."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is the most Sam Raimi outside of his horror films."
    },
    {
      "text": "\"Doctor Strange in the Multiverse of Madness\" is filled with mind-bending visuals and huge action sequences, but it's also destined to be Marvel's most divisive film in years."
    },
    {
      "text": "Sam Raimi's 'Doctor Strange in the Multiverse of Madness' is frenetic, zany, ghastly, and absolutely thrilling, a pure, full-on Sam Raimi movie."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is dark, silly, and fan pleasing. The film is at is most bewitching when Sam Raimi can let his horror roots be showcased."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a creature feature loaded with surprises. The uneven visual effects fuels nearly non-stop action in a brisk runtime. Tremendous lead performances aid a script with gaping plot holes."
    },
    {
      "text": "Wanders from MCU standards without completely losing the trail, and every strange cranny it finds proves ... enlivening."
    },
    {
      "text": "You can feel the production and overall plan seeping into the storytelling in ways that Doctor Strange in the Multiverse of Madness doesn’t entirely have the strength to overcome."
    },
    {
      "text": "Multiverse of Madness hurtles its characters from one reality to another, shedding the blandness of its opening stretch and giving Raimi, bless him, room to do things his way. As the film unfolds, Raimi’s hiring proves ever more inspired."
    },
    {
      "text": "Multiverse of Madness is overstuffed with the usual fan bait, but it’s also undeniably a Sam Raimi movie, and a remarkably good one at that."
    },
    {
      "text": "Everyone's excitement welcoming Raimi back to the superhero fold was well worth it... Marvel's latest entry is worth seeing just to watch an adept at his craft cast his signature dark magic."
    },
    {
      "text": "Brisk, messy, and campy genre fare that feels caught between studio-mandated story beats and its director's love for intimate horror. The result -- a reasonably diverting superhero flick that never fully taps into Raimi's morbid imagination."
    },
    {
      "text": "A psychedelic mind-flip masterpiece."
    },
    {
      "text": "This isn't a multiverse of madness, but of mundanity."
    },
    {
      "text": "Madness is one of the last adjectives that come to mind when describing Doctor Strange in the Multiverse of Madness"
    },
    {
      "text": "This is one of the weirder Marvel movies yet."
    },
    {
      "text": "'Doctor Strange in the Multiverse of Madness' is not your typical cookie-cutter Marvel offering. And that is mostly because of Raimi, who is not afraid to upset his audience or at least make them feel uncomfortable."
    },
    {
      "text": "'Multiverse of Madness' doubles down on Spidey's intergalactic exploits to exhausting effect."
    },
    {
      "text": "Another stellar example of Marvel Studios fan service, unexpected thrills and a mini epic contained in a just over two-hour film. There's a reason why Marvel dominates the box office -- the filmmakers deliver above and beyond what fans want to see."
    },
    {
      "text": "This is an odd entry in the MCU - a sequel which could almost be a standalone, a welcome bit of director Sam Raimi’s patented comic grand Guignol and a movie that leans a bit too heavily on a Disney+ television series (‘Wandavision’)."
    },
    {
      "text": "Unfortunately, the magic – excuse the pun – is missing, as Sam Raimi’s curious misstep never has a feeling of urgency, a film that spins its wheels...leaning on prolonged, needless action sequences meant to distract us from its flimsy narrative."
    },
    {
      "text": "Clearly, these superheroes are never going away... However, if all Marvel movies are as smart as \"Doctor Strange and the Multiverse of Madness,\" it won't matter."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness might not be a perfect film, but it is hard to argue against it being one of the most inspired and enjoyable MCU projects in years."
    },
    {
      "text": "The weirdest, grossest movie in the Marvel Cinematic Universe to date, filled with tons of different ideas, looks, and tones. It may not be particularly even or cohesive—but when it works, it really works. And even when it doesn’t, there’s still charm."
    },
    {
      "text": "A summertime sequel that proves way too messy and geeky until it manages to double back around again into pleasurable absurdity."
    },
    {
      "text": "Two supreme filmmakers, Kevin Feige and Sam Raimi, conjure up an exhilarating, horror-infused, fantasy adventure. Am I happy? HELL YES!!!"
    },
    {
      "text": "Raimi’s stunning visuals and style reinvigorates the typical MCU movie. His signature trademarks involve a blend of horror and comedy, quick cuts, extreme close-ups, tilted cameras, and match cuts."
    },
    {
      "text": "What keeps it under the level of the best of these films, though, is what has been an increasing issue in superhero movies. The powers are not clearly defined, so the stakes are not clearly defined."
    },
    {
      "text": "Sam Raimi makes the most Sam Raimi movie Marvel would allow, which works to liven otherwise heavy exposition in a more formulaic script focused on connecting multiverse dots."
    },
    {
      "text": "The blockbuster movie equivalent to reading a trade paperback collection of single issue comics where a beloved superstar artist is repeatedly replaced by a lackluster fill-in dragging the rest of the work down. Frustratingly inconsistent."
    },
    {
      "text": "The story is confusing and filled with endless MacGuffins and mumbo jumbo while confining most of its best ideas to throwaway moments. The dialogue is full of endless exposition, but more often than not it makes things less clear."
    },
    {
      "text": "The souls of the damned binary view of diversity threaten this film  despite obvious efforts to makeup for the whitewashing fiasco for the first Doctor Strange film."
    },
    {
      "text": "Raimi is humble enough to color within the MCU lines, but Doctor Strange provides plenty of situations in which Raimi's sensibility is suitable."
    },
    {
      "text": "If anything, Raimi leans hard into comic book imagery, even more so than in any of his three Spider-Man movies. In fact, Multiverse of Madness might be the most outright comic book-y film in the entire MCU to date."
    },
    {
      "text": "It used to be that superhero movies  Marvel Cinematic Universe movies in particular  were about saving the Earth. Then, they were about saving the universe. Now theyre about saving the universes. Is it possible to suffer from apocalypse fatigue?"
    },
    {
      "text": "Somewhere towards the middle of the mania, Doctor Strange in the Multiverse of Madness settles into being first and foremost a Sam Raimi film - and promptly begins to offer some of the most entertaining, wackadoo visions of the Marvel World thus far."
    },
    {
      "text": "It's a convoluted but entertaining experience that should not be a viewer's first Marvel Cinematic Universe movie. It's a movie that can be considered the tipping point where at least one Marvel show on Disney+ is essential viewing to understand the film."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is MCU's darkest installment yet that delivers thrilling horror moments and memorable appearances."
    },
    {
      "text": "... the story is deadite simple, the framework for a character piece exploring the consequences of ego, power, and grief. Sam Raimi injects a welcome dose of gothic horror into the MCU... parental guidance is highly suggested."
    },
    {
      "text": "With Doctor Strange in the Multiverse of Madness, the soul-deadening bloat of these films becomes ever clearer, mostly because you can see a great, inventive filmmaker trying, and failing, to style his way out of it."
    },
    {
      "text": "Waving his arms in front of his face as if directing the worlds tiniest traffic, Cumberbatch cant quite shake the impression of an old-school conjurer in a tacky end-of-the-pier revue."
    },
    {
      "text": "Sam Raimi's return to the comic-book dimension conjures up a spell in Doctor Strange in the Multiverse of Madness that can only come from the horror maestro."
    },
    {
      "text": "The weirdness, the goofiness, the bizarre, the humor, and yes, the horror of comics is all there in one of the most ambitious, and certainly the most terrifying, MCU films to date."
    },
    {
      "text": "Doctor Strange and the Multiverse of Madness is a spectacle to watch, but it seems to be just that. It brings something new to the superhero genre, but overstuffed and rushed with content that it loses on the character development."
    },
    {
      "text": "Sam Raimi's 'Doctor Strange' sequel subversively rubs viewers' noses in the notion of the MCU being anything more important than a well-crafted big-budget blockbuster brand."
    },
    {
      "text": "In terms of Raimi’s back catalogue, it’s more Spider-Man 3 than The Evil Dead."
    },
    {
      "text": "By the last act we might as well be watching Army of Darkness II for how deep Raimi's deliciously dastardly vibe, big on goop and goof, has infected the typical flat-ironed and steel-bellied tone of the MCU... What a great goddamned time at the movies!"
    },
    {
      "text": "Its a trip into multiple universes, with major character reveals, massive set pieces, and enough risky attempts to forgive its many flaws."
    },
    {
      "text": "The Marvel Cinematic Universe has officially jumped the Stark."
    },
    {
      "text": "With all of the infinite possibilities of a multiverse, this episode explores very few  dwelling on a couple of dull ones at that (complete with plot holes and inconsistencies and time-stalling tactics)."
    },
    {
      "text": "There may be a universe in which I feel the barest thread of emotional connection to even one thing that happens during the 126 minutes of loud, smeary nonsense that is Doctor Strange in the Multiverse of Madness. But I doubt it."
    },
    {
      "text": "If you’ve dreamed of diving into a live-action issue of EC Comics or Doctor Strange, then get ready for a new fave."
    },
    {
      "text": "Hits the ooh-and-aah marks we expect from a well-crafted Marvel adventure, but even with Sam Raimi at the helm, this entry goes heavy on the spectacle but light on the humanity."
    },
    {
      "text": "'Doctor Strange in the Multiverse of Madness' clearly bears the fingerprints of director Sam Raimi, who infuses the material with the same trippy, giddy spirit which has guided his best work."
    },
    {
      "text": "While Cumberbatch is certainly no slouch, the films runaway MVP is without question Elizabeth Olsen as the grief-stricken Wanda Maximoff, whose quest for happiness drives her insane  fully transforming into the Scarlet Witch."
    },
    {
      "text": "The most inventive, chaotic and scariest film in the 28-movie history of the MCU."
    },
    {
      "text": "Perhaps the Marvel universe is finally starting to feel like a long running comic book series. Or maybe Phase 4 just hasn't kicked into gear just yet."
    },
    {
      "text": "Sam Raimi didnt make a Marvel movie. Marvel made a Sam Raimi movie."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness pushes the boundaries in a way that enables its audience to get a taste of the multiverse in action."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness was a thrilling adventure of wild imagination that became next-level MCU."
    },
    {
      "text": "Best Marvel film or sequel? No. Its not going to be that big in the MCU memory bank, but its important. At best, it achieves what many fans have been hoping for and rewards everything that the franchise has been setting up."
    },
    {
      "text": "Sam Raimi has given this film a comic book feel, irreverent and jaunty, and meta enough to feel smart."
    },
    {
      "text": "Happily, the answer to the question, \"How much of a Sam Raimi movie is it going to be?\" turns out to be \"Quite a bit of a Sam Raimi movie, actually.\""
    },
    {
      "text": "Multiverse of Madness employs two powerful assets for Stranges latest outing: Sam Raimi and Elizabeth Olsen. Raimi easily slips back into his horror filmmaking roots and manages to infuse this sequel with as much horror as the MCU allows him."
    },
    {
      "text": "A film that constantly pushes back against its own possibilities ... both WandaVision and Loki took more creative risks. Significantly."
    },
    {
      "text": "This is a Sam Raimi horror film first and an MCU effort second, with his wild visual flourishes and penchant for shocking violence serving this sequel in a manner many will be unprepared for"
    },
    {
      "text": "It was a joy to watch Raimi exert his vision in this highly conscripted universe, especially when it felt just slightly out of control and anarchic."
    },
    {
      "text": "While Doctor Strange in the Multiverse of Madness buckles under its own weight, particularly where carrying its wealth of cameos and fan service are concerned, it still manages to be something utterly engrossing and unique at the same time."
    },
    {
      "text": "As events unfold, Raimi’s hand becomes more and more apparent, and that’s a good thing."
    },
    {
      "text": "If you love explosions, special effects, and these characters, \"Madness\" will be up your alley, but if youre looking for a story filled with meaning or even just entertainment, skip this one."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is the most adrenaline-pumping and action-packed MCU movie yet."
    },
    {
      "text": "I was delightfully surprised by how much it leaned into its ghoulish angle, thanks to some signature Raimi horror moves and the wild visuals that come with them."
    },
    {
      "text": "Like The Force Awakens, Raimi puts enough things in play here that it would really suck to have a follow-up filmmaker simply treat them all as disposable red herrings."
    },
    {
      "text": "The anything-goes aspects of that can be alternately thrilling, disorienting and occasionally, a little silly. All told, this sequel proves highly entertaining, if not quite worthy of the pent-up demand for it."
    },
    {
      "text": "If you enjoy watching a handful of randomly selected branded characters wisecrack, squabble and mope while pretending to fly around and shoot fireballs at the virtual scenery, here comes another two hours of that."
    },
    {
      "text": "Its potentially dazzling, though the reality of watching the movie becomes wearisome."
    },
    {
      "text": "There's some premium Raimi-ness to shake up the Marvel Cinematic Universe, presenting them with their first horror-tinged story that actually feels frightening at times."
    },
    {
      "text": "A useful rule of thumb in watching “Doctor Strange in the Multiverse of Madness” is that if Cumberbatch (or Wong) isn’t in a scene, go for popcorn... the plot will be almost impossible to follow. But that’s probably going to be the case anyway."
    },
    {
      "text": "The film is entertaining nonetheless even though I do suspect that it will divide some viewers."
    },
    {
      "text": "Even down to the last obligatory post-credit scenes Raimi forges his own weird, irreverent magic, a method in the Madness."
    },
    {
      "text": "an interpretation that is often more weird gory horror than the usual superhero fodder weve come to expect from the franchise."
    },
    {
      "text": "Marvel's most deranged and energetic movie yet, as much of a winning comeback for director Sam Raimi as it is a mega-budget exercise in universal stakes-raising."
    },
    {
      "text": "There are enough crowd-pleasing moments to reward the faithful, Cumberbatch remains enjoyable in a role he’s played in five previous films (and a season of What If…?) and Gomez hints at a bright future in the MCU."
    },
    {
      "text": "Raimis film is like a twisted trip into an Escher painting  particularly when Strange and America are sucked through the multiverse in a brilliant sequence that is a true highlight in the Marvel canon."
    },
    {
      "text": "The doctor is in...SANE?! Marvel switched genres on us. Good for horror fans, but bad for parents."
    },
    {
      "text": "It doesn't reach the heights of Spider-Man: No Way but there is a lot to really enjoy here, first and foremost the Sam Raimi of it all."
    },
    {
      "text": "A surprisingly weak MCU entry, but it still gets the job done. Cumberbatch & Olsen do a lot of heavy lifting despite being undercut by director Raimi and writer Waldron. Oddly, hit show WandaVision seems largely ignored. Very good mid credits scene."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is a Sam Raimi movie from top to bottom, for better and worse."
    },
    {
      "text": "While the Marvel-ness of “Madness” will make your head spin, Raimi’s signature style, penchant for the macabre and sense of humor oddly ground the film."
    },
    {
      "text": "Sophisticated, beautifully-acted, emotional and very funny..."
    },
    {
      "text": "Raimi has found in this sequel a surprisingly accommodating vehicle for his ecstatic love of horror filmmaking (to say nothing of a darkly exultant score by Danny Elfman)."
    },
    {
      "text": "Marvel made a Sam Raimi horror movie! It's weird, scary and very much earns the title \"Multiverse of Madness.\""
    },
    {
      "text": "This movie is a mess, but messes aren’t always bad. It’s not bad, I just don’t really know what to do with it, and it feels like it should belong to the Marvel of another era, not helping to kick off a new one."
    },
    {
      "text": "Even in the midst of its typically (for Marvel movies) convoluted plot, The Multiverse of Madness has a Raimi-like sense of bleak humor..."
    },
    {
      "text": "This feels like the most auteur-driven Marvel movie yet... not afraid to deviate from the expected MCU marching orders, but also quite faithful to the comic book bible in keeping the story in line with the overall arc of these intertwined things."
    },
    {
      "text": "Second-tier Marvel but still entertaining. The movie seems to exist mainly for the cameos, which should please fans."
    },
    {
      "text": "\"Doctor Strange and the Multiverse of Madness\" is a ride, a head trip, a CGI horror jam, a what-is-reality Marvel brainteaser and, at moments, a bit of an ordeal. It's a somewhat engaging mess, but a mess all the same."
    },
    {
      "text": "Its simply full of boring unpleasantness. A strange blip in the Marvel filmography. This is a multiverse of Madness? More like lazy, mediocre, and clumsy misguidedness."
    },
    {
      "text": "Though unsatisfying in some respects, the film is enough fun to make one wish for a portal to a variant universe in which Marvel movies spent more time exploiting their own strengths and less time trying to make you want more Marvel movies."
    },
    {
      "text": "Strip away all the sparks, and Multiverse of Madness is simply leaning on the same cross-referential thrill-of-recognition joy-button that the Marvel Cinematic Universe has been frantically pressing for more than a decade now..."
    },
    {
      "text": "Once you get past the foundational legwork and Raimi leans into the narratives horror elements, \"Multiverse of Madness\" allows for some imaginative set pieces and gonzo \"Evil Dead\" inspiration as if a Marvel movie were trapped inside a haunted house."
    },
    {
      "text": "Feels like a Sam Raimi film first and a Marvel film second. Fans of Wandavision may be disappointed, but it's a fun (and surprisingly violent) ride throughout."
    },
    {
      "text": "As a larger piece in the ever-expanding Marvel Cinematic Universe, the Multiverse of Madness starts to show the cracks in trying to continually attempt to build and one-up what came before."
    },
    {
      "text": "The multiverse madness is treated with genial high-energy panache, though I have to say that this infinite profusion of realities does not actually feel all that different... from the shapeshifting, retconning world of all the other Avengers films."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is probably as close as Marvel will ever get to making a horror movie, courtesy of Sam Raimi. Plus, the film actually does a really good job of leaving you wanting more."
    },
    {
      "text": "A film about broken people who are searching for the strength to get by without the things that made them what they are, in a franchise that has finally started to figure out how to do precisely that."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness feels like a film made by committee, and while Raimi still has a strong voice it doesnt feel like his heart is too invested. That makes Multiverse of Madness entertaining, but not much more than that."
    },
    {
      "text": "A horror-tinged trip that is as macabre and gnarly as Marvel has ever been, and as muted as Raimi has ever been."
    },
    {
      "text": "Any opportunity to really put the “madness” in this multiverse is spoiled by the crowded, intersecting desires of its three main characters."
    },
    {
      "text": "Raimi imbues his vision with a certain kind of visual hypnotism that keeps you swaying with wide eyes as you watch how bad things can truly get when the Darkhold is involved and our desires outweigh our humanity."
    },
    {
      "text": "The action sequences are fun. Paired with the films visual style and horror elements, it fares well enough, though the personal journeys are lacking."
    },
    {
      "text": "The Marvel version of an Evil Dead movie. Full review in French"
    },
    {
      "text": "Sam Raimi's footprint is all over this film, as it exudes his style from start to finish. Olsen's Scarlet Witch is the heart and soul. There is a lot at play, but it may not be the \"madness\" that some are expecting."
    },
    {
      "text": "If anything, this sequel to Strange’s original 2016 solo joint seems to have liberated Raimi to do what he does best, while still sticking to the predetermined marks he’s gotta hit for however many installments this sets up."
    },
    {
      "text": "Raimis dark manic force fits the material as well as Strange's cloak."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness doesn't have enough multiverse or madness and a story that is a mess, but the moments when it works, it works like gangbusters, despite some creative issues that are going to be very divisive."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness fully goes horrorjump scares, body horror, a smattering of diabolical kills and all. Its a Marvel Cinematic Universe movie through and through but has Sam Raimis creepy groovy campy deranged DNA all over it."
    },
    {
      "text": "For a multiverse movie, it feels like we barely stretched those possibilities. Overall it's a rushed mess that doesn't grasp the importance of its characters and moments."
    },
    {
      "text": "A Sam Raimi movie through and through."
    },
    {
      "text": "For this one, you're going to need a Ouija board, a witch doctor, a semester's worth of Disney+ homework, and either a giant Ambien or the PASIV machine from \"Inception\" to join the dream party."
    },
    {
      "text": "To put it simply, Doctor Strange in the Multiverse of Madness is the MCU equivalent of a heaping plate of food at a buffet  it'll give you a lot to chew on for the moment, but it's only a small sampling of the delicious things that are out there."
    },
    {
      "text": "Filled with hugely entertaining sequences, character-driven heft and trippy, vivid visuals, this picture has the auteurs signature written all over it."
    },
    {
      "text": "Does a fine job playing in the sandbox of magic and sorcery with just the right amount of Raimi horror sensibilities thrown into the superheroics."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness' plot and script start out strong but become overburdened with details."
    },
    {
      "text": "It's absolutely a Sam Raimi movie and is definitely the MCU's first horror movie, resulting in some unique sequences. However, the story lets it down and could prove divisive for fans."
    },
    {
      "text": "The multiverses infinite possibilities mindboggling, dangerous, and terrifying are explored to their nth degree in Marvels aptly titled \"Doctor Strange In The Multiverse Of Madness,\" for better and for worse."
    },
    {
      "text": "Doctor Strange in the Multiverse of Madness is the Marvel Cinematic Universe's darkest and most devastating film yet, boosted by A-list performances from leads Benedict Cumberbatch and Elizabeth Olsen as well as a return to form for director Sam Raimi."
    },
    {
      "text": "In the hands of director Sam Raimi, Multiverse of Madness is a marvellously assured balancing act of bizarre weirdness and affecting human drama."
    },
    {
      "text": "At its finest, this psychedelic, horror-strewn romps artistry perfectly reflects the intensity of Strange navigating endless alternate realms."
    }
  ],
  "release_year": 2022,
  "duration": 126,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy",
    "Horror"
  ],
  "age_rating": "PG-13",
  "synopsis": "In Marvel Studios' \"Doctor Strange in the Multiverse of Madness,\" the MCU unlocks the Multiverse and pushes its boundaries further than ever before. Journey into the unknown with Doctor Strange, who, with the help of mystical allies both old and new, traverses the mind-bending and dangerous alternate realities of the Multiverse to confront a mysterious new adversary.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/ddJcSKbcp4rKZTmuyWaMhuwcfMz.jpg"
}