{
  "movie_name": "Dumb and Dumber",
  "movie_id": "dumb_and_dumber",
  "total_reviews": 37,
  "reviews": [
    {
      "text": "It isn’t nonstop hilarity; there are quite a few dead spots. But I liked it a lot."
    },
    {
      "text": "The teaming and the formula are often copied but rarely matched."
    },
    {
      "text": "What makes this fantasy of anti-social behaviour so painfully funny, is the gulf between etiquette and vulgarity, the desire to be a child whooping it up in the adult world."
    },
    {
      "text": "You cannot deny a laugh, and Dumb and Dumber has plenty."
    },
    {
      "text": "...a modern classic of the comedy genre..."
    },
    {
      "text": "The plot, of course, is merely an excuse for an endless series of gags, and the percentage of them that score is fairly high."
    },
    {
      "text": "From the puns to the slapstick to the toilet, Dumb and Dumber is performed at such a high level that it transcends many of its influences."
    },
    {
      "text": "Easily one of the funniest (and most quotable) movies ever made..."
    },
    {
      "text": "The caviar of low-brow, gross-out comedy."
    },
    {
      "text": "The Farrellys' knack for stupid, Three Stooges-esque comedy writ larger by an infusion of heart excels with the complementary screen teaming of manic Jim Carrey and consummate screen actor Jeff Daniels. [Blu-ray]"
    },
    {
      "text": "...it tickles the funny bone often enough to merit serious consideration among lowbrow comedies."
    },
    {
      "text": "[Featrues] a plethora of memorable scenes."
    },
    {
      "text": "Dumb and Dumber, which features Carrey and Jeff Daniels as nitwits traveling cross-country, is a frayed string of gags posing as a movie. Carrey, though, does literal-minded doofdom with peerless enthusiasm."
    },
    {
      "text": "This gleefully lowbrow film is best enjoyed by the young, and by those who can still laugh at the passing of gas."
    },
    {
      "text": "The wholeheartedness of this descent into crude and rude humor is so good-natured and precise that it's hard not to partake in the guilty pleasures of the exercise."
    },
    {
      "text": "This is a long way from the social comedy of Jerry Lewis. The characters here are ultimately turned into punching bags or punch-line dispensers."
    },
    {
      "text": "Well titled and, for its purpose, a total success."
    },
    {
      "text": "Gone are the days of John Belushi, where rudeness was raised to an art form."
    },
    {
      "text": "Given American cinema's current obsession with innocence and ignorance, at least this never romanticises its protagonists. They are genuinely, irredeemably, 100 per cent no-hopers."
    },
    {
      "text": "A gross-out classic."
    },
    {
      "text": "we can see a lot of these laughs coming, and they don't hold much staying power"
    },
    {
      "text": "The 'limo'driver' line made the rest of the movie worth the trouble."
    },
    {
      "text": "a bit too dumb"
    },
    {
      "text": "The funniest movie in the world."
    },
    {
      "text": "Released before I started reviewing, but I would be remiss if I didn't say: it's a fine film. Had me buckling over in laughter, often, little plot, 100% pure stupid genius."
    },
    {
      "text": "A movie that fully lives up to its name, right down to an opening credit sequence rife with intentional misspellings and grammatical errors."
    },
    {
      "text": "The title says it all"
    },
    {
      "text": "Dumb, but funny. Very funny."
    },
    {
      "text": "Despretensiosamente ingnuo, 'Dbi & Lide'  a maior prova de que um filme nem sempre precisa ter uma trama elaborada para agradar."
    },
    {
      "text": "Inspired, irreverent, spark-driven comedy that takes you places you never thought a movie would go -- even a Jim Carrey movie."
    },
    {
      "text": "Carrey, I am now convinced, is a true original. In The Mask, he had the screenplay and production to back him up. Here, the filmmaking is more uncertain."
    },
    {
      "text": "Farrelly, quite simply put, does not appear to have the slightest clue about comic timing."
    },
    {
      "text": "An execrable catalogue of doody jokes, Dumb and Dumber is an abominable, abdominal comedy."
    },
    {
      "text": "Maybe it's indicative of my end-of-the-year brain-fry, but this dopey comedy about two of the dumbest guys in the universe on a road trip to misadventure is a hoot."
    },
    {
      "text": "While I won't claim to have gone through this entire film without laughing, there are some long periods between chuckles."
    },
    {
      "text": "This virtually laughless movie makes rude junior high school pranks seem positively sophisticated."
    },
    {
      "text": "An uneven collection of bodily function jokes, facial gyrations, sexual jibes and pedestrian slapstick."
    }
  ],
  "release_year": 1994,
  "duration": 106,
  "genres": [
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "Imbecilic best friends Lloyd Christmas (Jim Carrey) and Harry Dunne (Jeff Daniels) stumble across a suitcase full of money left behind in Harry's car by Mary Swanson (Lauren Holly), who was on her way to the airport. The pair decide to go to Aspen, Colo., to return the money, unaware that it is connected to a kidnapping. As Harry and Lloyd -- who has fallen in love with Mary -- are pursued across the country by hired killers and police, they find both their friendship and their brains tested.",
  "popularity": 8.4,
  "poster_url": "https://image.tmdb.org/t/p/original/4LdpBXiCyGKkR8FGHgjKlphrfUc.jpg"
}