{
  "movie_name": "E.T. the Extra-Terrestrial",
  "movie_id": "et_the_extraterrestrial",
  "total_reviews": 141,
  "reviews": [
    {
      "text": "Even forty years after its original release, E.T. the Extra-Terrestrial still holds up as a special, emotional and heart-warming family film upon first viewing."
    },
    {
      "text": "Steven Spielberg’s E. T The Extra-Terrestrial envelops you in the way that his Close Encounters of the Third Kind did. It’s a dream of a movie -- a bliss-out."
    },
    {
      "text": "E.T. The Extra-Terrestrial is a spellbinding foray that reminds us of human compassion and the eternal joy of cinema."
    },
    {
      "text": "Steven Spielberg has given audiences dozens of great films over the years, but no movie has captured childlike wonder quite like E.T."
    },
    {
      "text": "... while far tamer in its final presentation, \"E.T.\" is a scary film and would’ve likely made for a terrifying time, though I do think, all things being equal, that history is better for what we’re given versus what could have been."
    },
    {
      "text": "Spielberg has made a handful of films I would rate higher than E.T., but in terms of emotional investment for the whole family, this one is peerless in his canon, evoking laughter, tears, and everything in between."
    },
    {
      "text": "The classic moments are still there, large and small."
    },
    {
      "text": "Is…is this Spielberg’s best movie?"
    },
    {
      "text": "The film has more heart, finesse, performance, and magic in single scenes than some movies have in their entire running time, and does it with an animatronic special effect as a main character."
    },
    {
      "text": "I laughed, cried and clapped my way through all 95 minutes of it."
    },
    {
      "text": "One of the most important films of the 1980s, one that has continued to have influence in the four decades since."
    },
    {
      "text": "It's a magically wonderful movie. Children and adults will love Steven Spielberg's film about a person from outer space, stranded on earth. It's humorous and marvelous all the way."
    },
    {
      "text": "After doing not much more in Raiders [of the Lost Ark] than flexing his muscles, Spielberg has come through again -- he's the Fellini of our electronic games culture."
    },
    {
      "text": "Don't be intimidated by those long lines. E.T. is worth standing in line for. Steven Spielberg's story is the essence of fairy-tale simplicity."
    },
    {
      "text": "E.T. is such a strange looking puppet, but his sweetness and wonder make him so lovable."
    },
    {
      "text": "E.T. the Extra-Terrestrial is one of the greatest films ever made."
    },
    {
      "text": "A parable and a fairy tale that speaks to the child in us all, and wishes that we could all be more like Elliot, and less like the grown-ups."
    },
    {
      "text": "A family-friendly, heartwarming science-fiction adventure, full of iconic sequences."
    },
    {
      "text": "Like the spirits in Poltergeist, suspended between one state of consciousness and another, Spielberg hovers somewhere between childhood and adulthood, unable and unwilling to go over the other side. But then, where would the movie industry be if he did?"
    },
    {
      "text": "E.T. is a unique movie capable of captivating different audiences. [Full Review in Spanish]"
    },
    {
      "text": "Spielberg's visual inventiveness in much of E.T. is of sufficiently high quality to make one regret those passages where he falls below his best."
    },
    {
      "text": "Some of the performances are part of the reason why it works so well... I can't think of a child actor that that pulls off such emotional depth."
    },
    {
      "text": "This is a real movie, with all those elements that have proved sure-fire through history; Laughter, tears, involvement, thrills, wonderment. Steven Spielberg also adds a message: Human beings and spacelings should learn to co-exist."
    },
    {
      "text": "Director Steven Spielberg knew we'd all fall in love with E.T. for one very good reason: he embodies what we hope all aliens will be like when they finally visit our planet."
    },
    {
      "text": "No matter how much time passes, E.T. will always be right here."
    },
    {
      "text": "Spielberg has crafted with warmth and humor a simple fantasy that works so superbly on so many levels that it will surely attract masses of moviegoers from all demographics."
    },
    {
      "text": "Steven Spielberg's E. T., The Extra-Terrestrial is the best cinematic fairy tale since The Wizard of Oz."
    },
    {
      "text": "E.T. ...comes to a beleaguered industry like a gift from the gods. Not only does it get bums on seats but it encourages the kind of shared enjoyment that suggests the cinema still has something unique to offer."
    },
    {
      "text": "The marvel of this extraordinary movie is that it captures for even the most jaded grownup that pleasurable state of innocence and awe that only children are fortunate enough to experience."
    },
    {
      "text": "Spielberg works well with children, but never before has he directed them with such reticence or such appreciation of their humor, intelligence and decency."
    },
    {
      "text": "It lifts you into its make-believe in the wonderfully enriching way that only movies can do. I wouldn't be surprised if 'E.T.' eventually turned into the kind of durable classic that can be revived indefinitely for future generations."
    },
    {
      "text": "It's connection, its life, and it's about feelings of love that tends to transcend species and stars."
    },
    {
      "text": "With a touching relationship at the core of its compelling narrative, along with a brilliant score and nostalgic special effects, E.T.: The Extra-Terrestrial remains one of director Steven Spielberg's most beloved films."
    },
    {
      "text": "It's a fantastical adventure with a grounding in the modern (circa 1982) world of suburbia, divorce, and adolescent anxiety, and E.T. is the ultimate imaginary playmate come to life."
    },
    {
      "text": "One of the purest and most emotionally direct of all American movies, with not a whit of adult condescension nor any self-protecting irony, which might be why it hits grown-ups harder than kids."
    },
    {
      "text": "Without a doubt, I can say this is a masterpiece. [Full review in Spanish]"
    },
    {
      "text": "Spielberg would seem to be groping towards a virtual theology of space, space as Heaven, offering solace to a world which has foolishly renounced its traditional God but still aches to extend its own spiritual frontiers."
    },
    {
      "text": "E.T. is essentially a spiritual autobiography, a portrait of the filmmaker as a typical suburban kid set apart by an uncommonly fervent, mystical imagination. It comes out disarmingly funny, spontaneous, bighearted."
    },
    {
      "text": "Captivating, endearingly optimistic and magical at times, Steven Spielberg's fantasy about a stranded alien from outer space protected by three kids until it can arrange for passage home is certain to capture the imagination of the world's youth."
    },
    {
      "text": "What's perhaps most amazing about E.T., what distinguishes it from many of the other fantasy films of its era, is its ability to put an audience under a spell of childlike wonderment without infantilizing it."
    },
    {
      "text": "Spielberg's direction and Melissa Mathison's script never lose sight of the realistic, low center of gravity world of childhood, in which such marvelous adventures happen every day."
    },
    {
      "text": "It holds up beautifully."
    },
    {
      "text": "There are many big moments in E.T., but also plenty of magical small ones that make it work after all these years."
    },
    {
      "text": "My heart still soars as Elliott goes airborne and pedals across the face of an impossibly full harvest moon on his bike."
    },
    {
      "text": "The movie is emotionally tumultuous and evenhanded and serene."
    },
    {
      "text": "It is a hugely enjoyable romp, but compellingly spiked throughout with little stabs of anxiety."
    },
    {
      "text": "Time has done little to diminish the power of E.T.'s signature moments."
    },
    {
      "text": "The film is full of funny scenes and magical moments."
    },
    {
      "text": "Though marred by Spielberg's usual carelessness with narrative points, the film alternates sweetness and sarcasm with enough rhetorical sophistication to be fairly irresistible."
    },
    {
      "text": "E.T. remains Spielberg's finest demonstration of his ability to merge the feelings of suburban dissatisfaction - alienation, if you will - that permeates a lot of his work, with a unique sense of childhood wonder and imagination"
    },
    {
      "text": "It is the kind of film that young people are going to want to see again immediately after they've seen it."
    },
    {
      "text": "This is a special, delightful adventure, in which Spielberg manages not only to entertain young children but also reach out to the child in all of us."
    },
    {
      "text": "You're still gonna need those tissues."
    },
    {
      "text": "E.T. the Extra-Terrestrial still evokes laughter, tears and that heart-lifting surge of joy only a great movie can bring."
    },
    {
      "text": "Unchecked goodness has its price, after all, and childhood wonder wouldn't be nearly as sweet if it didn't fade. That may explain the film's appeal. It trapped that feeling, and its sense of possibility, in amber -- then, now, and for any time."
    },
    {
      "text": "among all that corniness, there's a great little movie"
    },
    {
      "text": "...a celebration of kid culture from a time when fun meant riding your bike and playing D&D with your friends."
    },
    {
      "text": "It makes us believe in magic again even as grizzled, cynical adults."
    },
    {
      "text": "One of Spielberg's two or three masterpieces, an extremely satisfying sci-fi fable."
    },
    {
      "text": "Steven Spielberg at his most pure."
    },
    {
      "text": "An appealing film this new one is, with some charm, some glee in the childrens' triumphs, some share in their friendship with E.T."
    },
    {
      "text": "Spielberg triumphantly succeeds in bringing the magical to the everyday."
    },
    {
      "text": "More than the work of any other filmmaker, Spielberg's output seems uniquely designed to induce in me this queasy false-memory syndrome."
    },
    {
      "text": "On inherent merit, the movie would not warrant such a highly publicized re-release, but this is one of those films that transcends what's on the screen."
    },
    {
      "text": "A contemporary classic."
    },
    {
      "text": "It helped alter the course of sci-fi movies by suggesting that intergalactic aliens might not be monsters but friendly, even loving, creatures. This doesn't make it a masterpiece, but it's fun."
    },
    {
      "text": "Though marred by Spielberg's usual carelessness with narrative points, the film alternates sweetness and sarcasm with enough rhetorical sophistication to be fairly irresistible."
    },
    {
      "text": "What I see is simply a timeless story about friendship, loss and maturity -- and, perhaps, an idealized America of the kind Hollywood and politicians strive to convince us could really exist."
    },
    {
      "text": "...a bona fide classic that has something to offer moviegoers of all ages."
    },
    {
      "text": "Although conclusively demonstrating Spielberg's preeminence as the popular artist of his time, E.T. finally seems a less impressive film than Close Encounters."
    },
    {
      "text": "E.T. is a film I will continue to watch over and over for the rest of my life. It is one I will never grow sick of, no matter how many times I watch it."
    },
    {
      "text": "It's a simple beautiful story about loneliness, friendship, and the bittersweet pangs of childhood."
    },
    {
      "text": "What do Ernest Hemingway, Carl Sandburg, Albert Einstein, and E.T. have in common? The eyes, according to Spielberg."
    },
    {
      "text": "Steven Spielberg's E.T. The Extraterrestrial touches the heart, engages the senses, and playfully challenges us to cavort with its allusive meanings."
    },
    {
      "text": "What E.T. does so well is to capture that moment in life when childhood seems to be slipping away."
    },
    {
      "text": "The OOOOOs and Ahhhhhhhhs are contagious, the cheering as Elliot, Michael and their friends take to the air as they're being chased by the Feds will still raise a cheer."
    },
    {
      "text": "Now that's entertainment."
    },
    {
      "text": "The simple truth is, no other movie has the same power to unite audiences in wonder and fulfilment."
    },
    {
      "text": "Come 2022, I'm sure I'll be seeing it again with my kids."
    },
    {
      "text": "E.T. isn't my favorite movie; it's not even my favorite Spielberg movie, but no one can deny the powerful effect it had on the film industry, our attitude toward extraterrestrial life, and our culture."
    },
    {
      "text": "The film remains pure cinematic enchantment in every sense of the word."
    },
    {
      "text": "I doubt if the public that fell so much in love with this cute Disney-like tale had looked too deeply at this religious parable and examined how overwrought and crude it really is."
    },
    {
      "text": "The story itself holds up fairly well though, twenty years later, does come off as thinner than I recalled."
    },
    {
      "text": "Most importantly of all things, the ORIGINAL unaltered, unblemished, and gloriously widescreen 1982 version is included, so all complaints are tempered with a sense of overall satisfaction."
    },
    {
      "text": "[It] may become a children's classic of the space age."
    },
    {
      "text": "One of the great children's movies of all time has lost none of its charm in this 20th anniversary re-release."
    },
    {
      "text": "An uplifting tale appealing to child inside us all."
    },
    {
      "text": "This is Spielberg's masterpiece, a near perfect film directed with astonishing skill and unafraid to get sentimental ... without crossing the line into syrup."
    },
    {
      "text": "Definitely worth seeing in the theater whether you've seen it before or not."
    },
    {
      "text": "A film that connects so beautifully to our sense of wonder and joy."
    },
    {
      "text": "An astonishingly warm and enjoyable family film full of genuine sweetness and heart."
    },
    {
      "text": "For the most part, however, Spielberg and Mathison have their priorities straight."
    },
    {
      "text": "To dismiss an artist the caliber of Spielberg solely on the accusation of treacly sentimentalism is to dismiss the great American poets of our history."
    },
    {
      "text": "When a movie has stuck around for this long, you know there's something there. It's that good."
    },
    {
      "text": "Like Peter Pan, who also took children flying until it was time for them to grow up, E.T. represents the wonder of childhood, of a time that we must all leave behind."
    },
    {
      "text": "The newly enhanced effects cannot affect what's most important to the film. Its heart is still there, completely intact, and that's really all that matters."
    },
    {
      "text": "A few moments seem clunky in retrospect, but overall, the film has aged well. Its still-strong emotional impact is now reinforced with a sense of nostalgia for an age when life was simple."
    },
    {
      "text": "There is hope for the movies, even if that means that the best film currently playing in theaters in 2002 happens to be one of the greatest films to emerge in 1982, or any year."
    },
    {
      "text": "Don't forget to bring tissues."
    },
    {
      "text": "The film remains the kind of unabashed delight that can make even the most cynical filmgoer feel like a kid wrapped up in the fantasy of it all."
    },
    {
      "text": "Oda a la inocencia de la niñez, la aventura de la juventud, la majestuosidad del universo y la magia que envuelve a los jóvenes de corazón."
    },
    {
      "text": "A devastating rebuke to anyone who has presumed to patronise this great film-maker."
    },
    {
      "text": "As I watched this film 20 years later, it was chastening to note how little of what innocence we once possessed has survived."
    },
    {
      "text": "I'm a tough guy; I can handle this stuff. That's not even a real alien. It's a puppet. Pffff."
    },
    {
      "text": "Twenty years after smashing box-office records, Steven Spielberg's gentle sci-fi fable returns to screens as vital and accomplished as ever."
    },
    {
      "text": "Make no mistake about it: The magic of E.T. the Extra-Terrestrial is best appreciated on the big screen."
    },
    {
      "text": "Spielberg's movie effectively shows adults a world as seen from the point of view of a excited boy."
    },
    {
      "text": "Don't phone home, phone the theater and buy tickets early."
    },
    {
      "text": "If we approach with sympathy and curiosity, we will be rewarded with same. And our souls, not to mention our bicycles, will soar to the heavens."
    },
    {
      "text": "The hard, cold, cynical me now realizes how precious and rare things like friendship and gentleness can be that the film touched me in different ways than when I was 13."
    },
    {
      "text": "Viewers returning to it, as well as those discovering it, will find it an enduring children's film -- but one whose impact has diminished with the passage of time."
    },
    {
      "text": "The tenderness of the piece is still intact."
    },
    {
      "text": "It's a movie with a stationary camera and spare gestures, reminding us of Spielberg's genius for simplicity."
    },
    {
      "text": "It's also a better -- no, make that far better -- movie than nearly everything else that's currently in theaters."
    },
    {
      "text": "A sophisticatedly sappy masterpiece."
    },
    {
      "text": "Forsaking the overload of special effects and high adventure that marked his previous successes to focus instead on a small story propelled by heart and imagination, Spielberg has made a film that will touch audiences for years to come."
    },
    {
      "text": "The new effects might not be to your liking, but the strength of the filmmaking, the power of the story and the wonder of E.T. should be more than enough to warmly remind you of the last time an honest film about childhood innocence was made."
    },
    {
      "text": "Unquestionably a classic."
    },
    {
      "text": "This is an outstanding family movie, with themes of loyalty, friendship, trust, and caring. One of the most purely magical scenes in the history of film is when Elliott's bicycle lifts off up into the sky."
    },
    {
      "text": "A masterwork."
    },
    {
      "text": "We have yet to recover from his revelation: that there is nothing more real than sitting in your own back yard -- waiting for the unreal to come down, take a handful of candy, and fly you to the moon."
    },
    {
      "text": "For the most part, the film does hold up pretty well."
    },
    {
      "text": "Steven Spielberg's masterful film has lost none of its power to sweep the viewer away in the most 'excellent' late-20th century boy's adventure one could hope for."
    },
    {
      "text": "The film is a pure gem, proving once again what an incredible visionary Spielberg truly is."
    },
    {
      "text": "A masterpiece that deserves to be seen and appreciated on a big screen."
    },
    {
      "text": "A sublime modern fairy tale, a movie that, if anything, looks subtler, darker, and more intimate now than it did when originally released."
    },
    {
      "text": "A magical film."
    },
    {
      "text": "Feel free to go sob in your popcorn."
    },
    {
      "text": "Real classics improve with age as does E.T."
    },
    {
      "text": "What's intact is the film's powerful yet unmushy message of friendship, unconditional love, helping those in need... geez, what doesn't this film have that an impressionable kid couldn't stand to hear?"
    },
    {
      "text": "...the \"old-fashioned\" puppeteering still works and you do believe in the little guy."
    },
    {
      "text": "It is an exceptionally visual film and an exceptionally emotional film, but the kind that most of us don't mind being manipulated by."
    },
    {
      "text": "Steven Spielberg's E.T. The Extra-Terrestrial showed me for the first time in my life the power of movies."
    },
    {
      "text": "Only the most hardened heart should be able to resist the glow from the one that anchors this classic."
    },
    {
      "text": "E.T. The Extra-Terrestrial (1982) is the immensely popular magical fantasy movie myth..."
    },
    {
      "text": "It remains a classic."
    },
    {
      "text": "All the right strings are pulled: one cries, laughs and cheers at all the right places -- just like Spielberg intends us to do."
    },
    {
      "text": "It's the epitome of true cinematic art, a movie that touches you on all levels."
    },
    {
      "text": "Sweet, heartwarming, adventuresome, and joyful."
    },
    {
      "text": "Spielberg left it open for all of us. That's the sign of a great filmmaker: He only explains what he has to explain."
    },
    {
      "text": "It works because it touches that (uncritical, non-analytical) childlike part of us that we often need to be reminded is still there."
    }
  ],
  "release_year": 1982,
  "duration": 115,
  "genres": [
    "Kids & Family",
    "Sci-Fi",
    "Adventure"
  ],
  "age_rating": "PG",
  "synopsis": "After a gentle alien becomes stranded on Earth, the being is discovered and befriended by a young boy named Elliott (Henry Thomas). Bringing the extraterrestrial into his suburban California house, Elliott introduces E.T., as the alien is dubbed, to his brother and his little sister, Gertie (Drew Barrymore), and the children decide to keep its existence a secret. Soon, however, E.T. falls ill, resulting in government intervention and a dire situation for both Elliott and the alien.",
  "popularity": 7.2,
  "poster_url": "https://image.tmdb.org/t/p/original/an0nD6uq6byfxXCfk6lQBzdL2J1.jpg"
}