{
  "movie_name": "Fantastic Beasts and Where to Find Them",
  "movie_id": "fantastic_beasts_and_where_to_find_them",
  "total_reviews": 344,
  "reviews": [
    {
      "text": "Rowling throws her audience into the fray without developing personalities we grow to love. As a result, Fantastic Beasts feels underwhelming, if diverting for the duration."
    },
    {
      "text": "Fantastic Beasts and Where To Find Them is an unexpected return to Rowlings wizarding world but with anything, the unexpected surprises are sometimes the best."
    },
    {
      "text": "...a predominantly worthless endeavor that seems to serve no purpose other than to lay the groundwork for future installments."
    },
    {
      "text": "So, in this horror show, otherwise called reality, what to do? Perhaps some escapism is not unwarranted."
    },
    {
      "text": "Fans of the Harry Potter books and films will enjoy the new offering from first-time screenwriter, J.K. Rowling..."
    },
    {
      "text": "It's tempting to warily eye this film and see nothing more than a blatant cash-grab ... But it eventually hits its stride, and the end result proves to be a welcome addition to the fantasy field."
    },
    {
      "text": "With its message that magic is all around us if we know where to look, the movie is a handsome, entertaining and ultimately sequel worthy piece of work."
    },
    {
      "text": "There are a few interesting ideas at play, but they're typically neglected for some interruptive commotion."
    },
    {
      "text": "Rowling knows how to play into the comedy and injects the film with a playful sense of humor..."
    },
    {
      "text": "Delivers the kind of blockbuster fun and energy that was sorely lacking during the summer months this year."
    },
    {
      "text": "The film may seem well known for the references in the Harry Potter saga, but the story's own identity tells us that we are in a renewed territory that, as we already anticipated, has bewitched us with an amazing spectacle. [Full review in Spanish]"
    },
    {
      "text": "I thought it was pretty boring."
    },
    {
      "text": "It was a horrible, awful misstep."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a genuinely interesting, sometimes thrilling new world that still feels vaguely familiar."
    },
    {
      "text": "If it is a fantasy story that includes historical elements but isn't strict about accuracy then there is no reason for the casting to not reflect the diversity of modern audiences..."
    },
    {
      "text": "All of the action around Newt's missing beasts is enjoyable, and many of the creatures (more Nifflers, please) are irresistible."
    },
    {
      "text": "While Fantastic Beasts and Where to Find Them isn't all the way a good movie, it has promise."
    },
    {
      "text": "Redmayne is a compelling central presence, and the story is head-and-shoulders above anything else in the blockbuster world this year. But... it suffers sorely from the missing chemistry at its core."
    },
    {
      "text": "The film is lush and Rowling-esque enough - with plenty of wonderfully animated fantastic beasties - to satisfy Potter fans."
    },
    {
      "text": "Is it a blatant cash grab from Warner Brothers or a creative return to an expansive world we all knew J.K. Rowling couldn't abandon entirely? Of course it's both."
    },
    {
      "text": "A refreshing addition to the Potterverse, it serves as an appropriate foundation for its forthcoming sequels that will hopefully open up more opportunities for the ever-expanding franchise."
    },
    {
      "text": "Everything is built to draw you in, enthrall, and connect you to the action."
    },
    {
      "text": "A bloated hodgepodge of tangential creature-related asides distract from a tedious ho-hum narrative."
    },
    {
      "text": "An immensely entertaining film."
    },
    {
      "text": "With Yates at the helm, fans should expect an assured, polished and cohesive watch which fuses the old and the new, the magic with reality, and the spectacle with heart."
    },
    {
      "text": "I want to be up front with Harry Potter fans - this movie is not Potter caliber. But I still found it to be absolutely lovely and enchanting, with much to admire."
    },
    {
      "text": "When it comes to wizards, J.K. Rowling can do no wrong."
    },
    {
      "text": "One of 2016's best blockbusters, Fantastic Beasts and Where to Find Them is a lot of fun and a, well, fantastic start to what looks set to be a franchise every bit as exciting as, and perhaps more so, than Harry Potter."
    },
    {
      "text": "The film triumphs when it focuses on the nourished and surprising naturalistic adventure. [Full Review in Spanish]"
    },
    {
      "text": "Fantastic Beasts is an unnecessary installment of a beloved franchise that features a stupid caricature doing slapstick comedy, a repetitive villain, racist characters, and poor acting. Sorry Potterheads, you just got Phantom Menace-d."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them makes the wizarding world feel fresh again."
    },
    {
      "text": "There is fun to be had with the magical beasts and characters like Queenie but it's hard to endorse a movie when I can't understand the lead character most of the time."
    },
    {
      "text": "It is suitably magical."
    },
    {
      "text": "Its shortcomings notwithstanding, Fantastic Beasts and Where to Find Them is thoroughly enigmatic and essential to be experienced on the big screen."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a worthy addition to the Harry Potter canon, bringing a whole new perspective to a beloved universe. With plenty of humor and heart, it is a delightful cinematic experience."
    },
    {
      "text": "Rowling's storytelling, as always, is full of wonder and amazing moments."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is proof that the Harry Potter universe still has much to give. [Full Review in Spanish]"
    },
    {
      "text": "Does it reach the extremely high standards of the first Harry Potter film? I would say no, it does not. But it is extremely likeable, and there was not one second in the entire two-hour run that I was bored."
    },
    {
      "text": "While the film itself is fun, its place in the wizarding world continuity requires some more thought overall."
    },
    {
      "text": "The perfect compliment to children who grew up with Harry Potter and are now adults ... The series looks back with the trappings of a film more tailored for adults in tone."
    },
    {
      "text": "Director David Yates knows this world well and is able to bring this world to life with the same sense of wonderment."
    },
    {
      "text": "Stirring Johnny Depp into the mix is not the solution I would have hoped for and gives me legitimate cause for concern going forward."
    },
    {
      "text": "The closest thing to the grotesque incestuous f***pile that defines the deeper recesses of modern \"fanfic\" culture ever to grace a movie screen: a Doctor Who meets Pokemon mash-up rewritten into a tangential Harry Potter prequel."
    },
    {
      "text": "As the credits rolled and the foreknowledge of a collective eight-to-ten more hours of this stuff hit me, all I felt was fatigue."
    },
    {
      "text": "With its lush visual style, fascinating themes, and real sense of magical wonder, Fantastic Beasts and Where to Find Them is a pretty good start to a further expanding universe."
    },
    {
      "text": "This is all a lot of fun, with the colorful and imaginative creatures standing out against the beiges and grays of the city. The beasts all have a great deal of personality, and several have large impacts on the plot as well."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is an excellent adventure story that fans and non-fans alike can enjoy."
    },
    {
      "text": "Thoroughly fun, innovative, and a crowd pleasing new look at the Wizarding World that only J.K Rowling masters at writing and David Yates masters in directing."
    },
    {
      "text": "As the audience, we have developed no connection whatsoever with the characters that we are about to see, yet the film is trying evoke memories of a deep past that earned its affection over the course of a decade."
    },
    {
      "text": "The burden of the vast story behind and ahead of this film slows it down at times, but the concept of film \"universes\" seems to be here to stay. If you're going to dwell in a universe, this is a gorgeous and delightful choice."
    },
    {
      "text": "The film is a decent trip back into the world of magic, but it isn't a strong film on its own."
    },
    {
      "text": "I must say that the film is not without its charm. The beasts themselves are wonderful, the score by James Newton Howard is one of the best of the year. And a couple of characters/actors really stood out in the chilly, ho-hum cast."
    },
    {
      "text": "She expands into a mystical, magical world using some existing storylines to dip into its past for an intelligent, gripping and fully entertaining prequel that only deepens the Potter universe... and its characters into a fresh and bold direction."
    },
    {
      "text": "Great if you fear change but if you're looking for depth, fresh eyes, or diversity, this ain't the film for you."
    },
    {
      "text": "Despite all the spell-casting, this Harry Potter prequel offers some of the most realistic representations of environmental research field work you're likely to see in a movie this decade."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them creates a new page that will bewitch us in new exciting adventures. [Full Review in Spanish]"
    },
    {
      "text": "Fantastic Beasts feels like a missed opportunity for Rowling...While there are flashes of wonder and whimsy, there seems little in these characters that would support an ambitious, five-part franchise."
    },
    {
      "text": "[Dan Fogler] is so good. He's funny, he brings a lot of heart to the movie, and he plays the part of us, the audience. I thought it was a brilliant move to have someone in the movie who can't do magic be a part of this adventure."
    },
    {
      "text": "The chemistry between the trio as they scour the city in search of Newt's creatures is sure to be a crowd-pleaser."
    },
    {
      "text": "The movie is sweet but sometimes it's on the fringe lines like, \"Oh, is it sweet or is it kind of sappy and cheesy?\" Yeah, [it] goes there too."
    },
    {
      "text": "I laughed, I cried, I felt literally every emotion, because that is what J.K. Rowling does to you."
    },
    {
      "text": "Anyone unconvinced that J.K. Rowling is a brilliant storyteller needs to see Fantastic Beasts and Where to Find Them."
    },
    {
      "text": "J.K. Rowling's ingenuity, now free of old Hogwarts, gets a real workout in Fantastic Beasts and Where to Find Them."
    },
    {
      "text": "Fantastic Beasts is a charm, excelling when it's allowed to be its own creature and falling short only when it's forced to pay its franchise dues."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them might as well be a crossover between Pokémon Go and Doctor Who"
    },
    {
      "text": "The film breathes, and while it's overlong, the important thing is you never feel like you're suffocating with too much information or plot. A new series beckons and the magic is back."
    },
    {
      "text": "Much of the film's rapid-fire entertainment value and slick filmmaking style do a lot towards covering up the weak narrative excuses."
    },
    {
      "text": "All in all, audiences new and old alike are treated to an endearing adventure with the promise of more to come from J.K. Rowling."
    },
    {
      "text": "The worldbuilding is as detailed and transporting as you expect from JK Rowling, who wrote the script, but you can tell she's a writer used to expansive novels where there's a lot more room to play."
    },
    {
      "text": "Welcome back, Potter fans-it's going to be a truly great adventure!"
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is just fabulously fantastic."
    },
    {
      "text": "\"Annoying\" is the perfect term for his portrayal of Fantastic Beasts' hero, Newt Scamander, a shrugging, slumping sack of stammers and tics."
    },
    {
      "text": "For a movie based on a fictional encyclopedia, Fantastic Beasts and Where to Find Them is anything but tedious."
    },
    {
      "text": "Rowling imbues Fantastic Beasts from start to finish with a sense of discovery."
    },
    {
      "text": "[It] will make for a marvelous theme park attraction someday. But as a movie, as a vessel for narrative and ideas enacted by recognizably human characters, it fails to tap into the same simple potency that Harry and Co. wielded from book one."
    },
    {
      "text": "Fantastic looking, fully realized, and thoroughly absorbing, this extension of J.K. Rowling's wizarding world surpassed my expectations exponentially."
    },
    {
      "text": "Towards the end, the film gets a little too action-packed, with the city of New York (once again) on the verge of destruction. But there are enough moments of magic in the rest of the movie to make up for it."
    },
    {
      "text": "There are a few other minor gripes throughout the film...but I was so enamored with this world and these characters, I didn't care. I just wanted to see more."
    },
    {
      "text": "The film wants so badly to be fun and silly, but I'm sorry to say it's an old-fashioned dud."
    },
    {
      "text": "It has been made with a lot of style and skill and comes across as much more than the simple cash-in opportunity that it might have initially appeared to be when it was first announced."
    },
    {
      "text": "The great fantasy in Fantastic Beasts is that everything can be put back how it was, no matter what happened."
    },
    {
      "text": "This new movie, while slight, is also dazzling, diverting and wonderful fun."
    },
    {
      "text": "Like the first chapter of any story, it has the burden of making you want to come back; and not just for the desperate satisfaction of knowing what's next"
    },
    {
      "text": "Rowling may be back, but her magic has largely been lost."
    },
    {
      "text": "Potterheads can rejoice as JK Rowling takes another journey into the wondrous world of wizards and witches."
    },
    {
      "text": "What a marvelous foray into the world of J.K. Rowling. Its period setting helps set it as an astute parallel political commentary while the progressive undertones make for a more enjoyable experience."
    },
    {
      "text": "This is the beginning of a series, and it offers passable entertainment for fans, but let's hope it gets better."
    },
    {
      "text": "The same-same beasts are only one of the many 21st-century cliches that hobble this over-long, under-whelming film"
    },
    {
      "text": "It feels more like a knowledge building history lesson rather than an exciting, free-flowing adventure."
    },
    {
      "text": "The beasts are fun, the magic exciting and the story engaging. We're off to another good start in this universe."
    },
    {
      "text": "David Yates directs a movie that is entertaining but never garners all that much excitement, and it's an emotional flatline for the bulk of the film."
    },
    {
      "text": "The ever fertile mind and imagination of Ms JK Rowlings opens a portal to a world of hilarious anthropomorphism and high eccentricity."
    },
    {
      "text": "The plot loses its foothold just as the momentum should be taking over, leading us into a barrage of meandering episodes that lack the compelling gravity you would expect out of this ambitious world."
    },
    {
      "text": "A visual and magical delight that isn't enough to be enchanting for all muggles; It doesn't petrify emotions as a good spell. [Full review in Spanish]"
    },
    {
      "text": "A solid, self-contained piece of basic, honest blockbuster filmmaking."
    },
    {
      "text": "I've long wondered what defines her world, but this confirms my suspicions: all it is really is deep, dribbling nostalgia, cut with an absorbingly intricate plot, delivered in the purest speedball form from Rowling's soothing pen."
    },
    {
      "text": "It's just too bad this feels more like the set-up for later films than a strong, standalone movie, with lead characters who feel thinner than some of the smallest cameo roles in Rowling's novels."
    },
    {
      "text": "The plot of Fantastic Beasts seems so disinterested in the urgency of their conflict, that quickly infects us with that disinterest. [Full review in Spanish]"
    },
    {
      "text": "The movie doesn't hold by itself, it only makes sense in the films to come, which makes it ideal for condescending fans. [Full review in Spanish]"
    },
    {
      "text": "An entertaining film where the star is the special effects, the story is well told and managed to separate it from the Potter universe. [Full review in Spanish]"
    },
    {
      "text": "I hope Steve Kloves decides he wants to write the next one."
    },
    {
      "text": "At one point, it looks like a giant sex rhino impregnates a tree by shooting his load of magical horn seed into it."
    },
    {
      "text": "Maybe there's more to this story, and perhaps the keen observer is meant to understand that things are very wrong, but does it have to feel so hopeless?"
    },
    {
      "text": "Fantastic Beasts is perfectly acceptable mainstream fare. A refreshingly non-cynical family-friendly film - it has enough charm, great new characters, and entertaining scenes."
    },
    {
      "text": "Achieves the one thing it must: finding the right magic to entertain in its own right, and to keep interest in the next instalment bubbling."
    },
    {
      "text": "This is reportedly the first of five movies. Well, Rowling's audience is hard to alienate, but we'll just see about that."
    },
    {
      "text": "There's a timely, if somewhat clunky moral about fear and bigotry and it looks amazing. The performances are very good and it is a full cinematic experience."
    },
    {
      "text": "Funny, well-acted, but mostly full of heart, this film is the ultimate proof that there's still much to see from J.K. Rowling's universe of wizards and witches. [Full review in Spanish]"
    },
    {
      "text": "An unintentionally hilarious scene in which Redmayne is almost violated by an ovulating magical rhino is scant compensation for how beige the rest of the film is."
    },
    {
      "text": "Those of us without the pre-existing condition of fandom will likely be left cold by the film... it's strangely empty."
    },
    {
      "text": "A turn against the cantankerous adventure movies being shoved down consumers throats, Rowling and Yates choose instead to prominently display tempered heroes."
    },
    {
      "text": "This new feature lacks the magic and the idealism of the \"Harry Potter\" films."
    },
    {
      "text": "The plot is silly, the stakes are indeterminate, the pace is sluggish and none of the creature designs are especially impressive. (Splice Today)"
    },
    {
      "text": "I found the beasts...they weren't fantastic. They were actually kind of boring."
    },
    {
      "text": "With dazzling effects and wondrous new characters, J.K. Rowling's world of witchcraft and wizardry is back with a 1920s steampunk feel."
    },
    {
      "text": "Fantastic Beasts leaps into ludicrous territory without regret far too often. Its formulaic and ridiculous display tarnishes a fifteen year old franchise that leaves you with the question, \"Is J.K. Rowling just milking it?\""
    },
    {
      "text": "Funny, Inventive, Redmayne excells again"
    },
    {
      "text": "I was surprised at how good this film is, being an extension of the Harry Potter \"Cinematic Universe,\" to borrow a phrase. I was expecting that familiar downward spiral of destiny, but this is more upbeat and unpredictable."
    },
    {
      "text": "It will clearly work for its target demographic. That said, a more focused screenplay and a greater reliance on character wouldn't go amiss in the obligatory sequel."
    },
    {
      "text": "A very interesting movie that manages to feel different from the films of the Harry Potter saga. Potterheads will defenitely love it. [Full review in Spanish]"
    },
    {
      "text": "Apart from being a guaranteed money-spinner, Fantastic Beasts and Where to Find Them is a wholly entertaining movie which, free from the burden of adaptation, is entirely its own thing."
    },
    {
      "text": "From the effects to the music to the performances to the battle scenes, Fantastic Beasts and Where to Find Them is a worthy follow-up to the Harry Potter juggernaut."
    },
    {
      "text": "A new chapter in the expanded universe of J. K. Rowling is born and, I must be say, is a pleasant surprise. [Full review in Spanish]"
    },
    {
      "text": "No need for viewers to have immersed themselves in the seven books to understand and like this film. Yet there are enough hints of Rowling's world to give those in the know some satisfaction."
    },
    {
      "text": "It can't quite rank with the best of the Harry Potter films, but it's certainly in keeping with the traditions that made them so special."
    },
    {
      "text": "This is a true ensemble piece, with Redmayne taking a back seat to the rest of the troupe ... including, sometimes, the fantastic beasts."
    },
    {
      "text": "While it has sown the seeds for the films to come, as a standalone piece, it fails to really wow."
    },
    {
      "text": "It has its flaws, but it's a fun, fully-realised film that can stand firmly on its own."
    },
    {
      "text": "As Yates halfheartedly shepherds \"Beasts\" towards its inevitable sequels, there's only one real surprise: that the screenplay, by Rowling herself, is the weakest link."
    },
    {
      "text": "The story itself is unwieldy, padded and almost entirely reliant upon CGI for forward momentum."
    },
    {
      "text": "An enchanting tale of magical mayhem."
    },
    {
      "text": "In all, the movie is a cunning and peppy surprise, dulled only by the news that no less than four sequels await."
    },
    {
      "text": "To its considerable credit, Fantastic Beasts is not the Potter retread it could easily-and very profitably-have been."
    },
    {
      "text": "I couldn't help but feel there was something a bit cynical in the production of a New York-based Harry Potter spin-off."
    },
    {
      "text": "...represents the Marvelization of the Harry Potter universe."
    },
    {
      "text": "Move over Harry. The Potterverse has a new hero. Newt Scamander, played with bags of beguiling, diffident charm by Eddie Redmayne, takes on the boy wizard's mantle and proves that JK Rowling has conjured up another winner."
    },
    {
      "text": "Amongst all the colourful flim-flam, and with that stop-start narrative throwing us around like a theme park ride, the humans never get drowned out by the spectacle."
    },
    {
      "text": "This film has it all: a cracking story, a morality tale and moments of ripe comedy."
    },
    {
      "text": "With impeccable production design and special effects it's always a feast for the eyes and Newt Scamander is such a decent sort, charmingly played by Redmayne, you never stop caring."
    },
    {
      "text": "This highly entertaining twist on jazz age America breathes fresh life into the Potter franchise - and, with its themes of society divided and the persecution of minorities, the film finds itself to be perfectly timed."
    },
    {
      "text": "Rowling has no grasp of screenwriting. Her characters are flat and underdeveloped, her plotting scattershot and her action scenes tired and derivative. It's boring, and -- except for Fogler and Sudol -- utterly lacking in fun."
    },
    {
      "text": "Redmayne's enviable acting range makes Newt Scamander a far more engaging and emotionally- accessible character than Harry Potter ever was. Heavens to Hogwarts!"
    },
    {
      "text": "One has to wonder how J. K. Rowling comes up with all of this stuff, but it appears her imagination is limitless."
    },
    {
      "text": "Based on just the sheer magnitude of \"Fantastic Beasts and Where to Find Them\", far be it for me to not give the film a positive rating."
    },
    {
      "text": "\"Beasts\" bursting with potential."
    },
    {
      "text": "This whimsical adventure more than delivers on what the title promises."
    },
    {
      "text": "watching Redmayne do a mating pas de deux with a mountainous cross between a rhino and a firefly is almost worth the price of admission on its own"
    },
    {
      "text": "Visually delightful film that makes that practically nothing feels a repetition with respect to the Harry Potter saga. [Full review in Spanish]"
    },
    {
      "text": "A surprising film of great visual display, where Redmayne manages to carry the two hours of the plot on his shoulders. [Full review in Spanish]"
    },
    {
      "text": "A magical adventure that introduces new characters and adopts a style and a tone that the previous films about / with Harry Potter didn't usually had: action comedy. [Full review in Spanish]"
    },
    {
      "text": "Overall this is an enjoyable opening to what promises to be another popular film series about a world that, while not quite ours, seems close to it."
    },
    {
      "text": "A film of attractive staging surrounded by art deco elements and covered by gray and dark blue tones accentuating the mysterious atmosphere. [Full review in Spanish]"
    },
    {
      "text": "The film strains considerably under the weight of all its plot lines-it's never fun to be the movie with the origin story."
    },
    {
      "text": "In this new film of the Potter universe, the special effects, designs and staging are amazing and really stand out. [Full review in Spanish]"
    },
    {
      "text": "With a script by Rowling herself, Fantastic Beasts is as bewitching in its imagination and attention to detail as the Harry Potter movies."
    },
    {
      "text": "A film that is, at the same time, prequel and spin-off of the original saga suggested by the homonymous textbook, in which the writer gave in to imagine her own creatures. [Full review in Spanish]"
    },
    {
      "text": "Newt Scamander is a rather charmless wizard boy-man. A lot of gratuitous CGI to make up for derivative story."
    },
    {
      "text": "A solid and intelligent piece of entertainment with a great cast, that surpasses any Potter film. [Full review in Spanish]"
    },
    {
      "text": "Suffice to say Fantastic Beasts has taken the Potter franchise and migrated itself into an adult series of its own initiative."
    },
    {
      "text": "All this plot grows a little tiresome at times, but some of the players are strong (Alison Sudol is cool as Porpentina's mind-reading sister Queenie), and the beasts have enough CG personality once they break out."
    },
    {
      "text": "Like Newt's battered suitcase it's frequently unhinged. And it's that strangeness is what makes this proto-Potter enchanting and a promising first chapter."
    },
    {
      "text": "Rowling creates an incredibly immersive world that unfolds at a leisurely pace but is never boring because it does not get bogged down by the weight of audience expectations created by adaptations of the Potter books."
    },
    {
      "text": "The film is determined to do so much, introduce so many, and wow with such abundance that viewers may feel more fatigue than wonderment by the time its two-plus hours are done. Even director David Yates... can't quite rein everything in."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a solid Harry Potter series movie but often prioritizes setup over memorable drama or spellbinding action."
    },
    {
      "text": "Every illustrated chapter of fantastical bestial behaviour interrupts the other half of the movie, resulting in a milk run of a narrative - stopping every few minutes to take on new creatures and offer cute bits of visual."
    },
    {
      "text": "An entertaining if flawed first entry into a new wizard-based adventure."
    },
    {
      "text": "It proves there's still new ground to tred in J.K. Rowling's magical world -- for now, at least."
    },
    {
      "text": "Though slapdash in terms of story [...], Fantastic Beasts is enjoyable enough to offset many of its problems."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them may not offer up the depth and the complexity of Rowling's other wizarding tales, but that doesn't make it any less of a good time."
    },
    {
      "text": "If nothing else, it's fun to see that there's a Potterverse outside Harry Potter himself. His world has always been big enough to sustain other stories. Finally, it has a chance to."
    },
    {
      "text": "Decent enough as the introductory chapter to what's hopefully something a bit more engaging, captivating and magical. (Full Content Review for Parents - Violence, Scary Stuff, etc. - also Available)"
    },
    {
      "text": "This introduction of the planned franchise gets it right by dropping us at the starting line of a great adventure -- a magical beginning that whets the appetite for the next time Ms. Rowling decides to cast a cinematic spell."
    },
    {
      "text": "Whimsical but never wondrous, amusing but never affecting...[The] HP films showed us things we had never seen before. Fantastic Beasts just made me wish I were watching Doctor Strange again."
    },
    {
      "text": "The Potter imagination is also on full display, mostly through the introduction of Scamander's myriad beasts, which blend familiar physical characteristics with human foibles."
    },
    {
      "text": "Hhardcore Potter nerds will enjoy the world-building that goes into Fantastic Beasts."
    },
    {
      "text": "Rowling has a voluminous imagination and Yates keeps things humming along, although, as was also true of many Potter movies, there is often too much of a good thing."
    },
    {
      "text": "Delightful but dark Potter prequel is more grown-up."
    },
    {
      "text": "Rowling demonstrates that her eye for character is as sharp as her imagination."
    },
    {
      "text": "Rowling gives us new characters and creatures to fall in love with, and Newt and company will keep you coming back for more."
    },
    {
      "text": "It's spectacular and promising, though at first exposure its characters (human and otherwise) are often as grating as charming."
    },
    {
      "text": "Lacks the coming-of-age resonance of the HP series, but this first chapter is good fun."
    },
    {
      "text": "Briskly-paced, the whimsical and thrilling 'Fantastic Beasts and Where to Find Them' is bewitching."
    },
    {
      "text": "A weak kickoff..."
    },
    {
      "text": "Despite some amazing special effects, Fantastic Beasts remains inert and uninvolving."
    },
    {
      "text": "Even with the Potter pedigree, creator Rowling, director Yates and talented Redmayne ... Fantastic Beasts isn't all that fantastic after all. Harry would be disappointed."
    },
    {
      "text": "Rowling, Yates and company will have to cast a different spell to bring the series up to Potter standards."
    },
    {
      "text": "Fantastic Beasts and Where a Can't Miss Franchise Does Just That."
    },
    {
      "text": "The next Harry Potterfranchise kicks off with Fantastic Beasts and Where to Find Them, which tries to combine a light-hearted heist with the rise of dark fascism. The combination doesn't quite work."
    },
    {
      "text": "...comes across less as an opportunity to squeeze every last dollar out of the franchise and more like Rowling has many more stories to tell..."
    },
    {
      "text": "Rowling, a first-time screenwriter, seems accustomed to viewers who come in already knowing a lot of backstory and will be delighted to see certain characters depicted at all."
    },
    {
      "text": "Makes a convincing and frequently stunning argument that there's (magical) life after Harry Potter. While it's got a few issues, this is a charming kickoff to the franchise."
    },
    {
      "text": "At least the monsters, when compared with their co-stars, have some personality."
    },
    {
      "text": "A lavish visual feast that nonetheless fails to cast any new spells over its audience."
    },
    {
      "text": "The joyful absurdities and frightful images peppering the self-described 'Fantastic Beasts and Where to Find Them' are reason enough to see this fun flick."
    },
    {
      "text": "Gives the impression that this is just a warm-up - a dip of the toe back into the pool to see if the Potter fans are keen for another swim."
    },
    {
      "text": "The resulting film is rather forgettable and ends up feeling like more of a set up for the sequels that we'll be seeing in a few years."
    },
    {
      "text": "Mildly engaging with a talented, charismatic cast, but it's overstuffed and suffers from the ailment that most blockbusters suffer from: too much spectacle and not enough truth."
    },
    {
      "text": "Watching Fantastic Beasts is like being guided by Rowling herself, our hand placed gently in hers, in a world that is as warmly familiar as it is excitingly fresh."
    },
    {
      "text": "The film exists resolutely outside of salience and doggedly within the comfort of escapism."
    },
    {
      "text": "Almost every scene has something ingenious and beautifully designed for you to gasp at, and the supernatural hijinks are all underpinned by Rowling's sincere pro-tolerance message. But it's all at the expense of the supposed protagonists."
    },
    {
      "text": "The film has enough lively humour to keep things entertaining, but the movie itself is thin and derivative, never quite engaging the audience with its magic."
    },
    {
      "text": "Fantastic Beasts is a solid if unspectacular introduction to a new franchise."
    },
    {
      "text": "Every time Fantastic Beasts has to move the story forward, it stumbles along like a restless kid dragging herself to school when all she wants to do is play with her coloring books."
    },
    {
      "text": "For everything that works in the film, there are two things that don't, and those things all tie back to how laborious it must be to lay the foundation for the next four films in the series."
    },
    {
      "text": "Fantastic Beasts manages to be both comfortingly familiar and brand shiny new."
    },
    {
      "text": "Like its hero it's full of magic, but endearingly modest with it."
    },
    {
      "text": "Rowling has conjured up another classic-in-the-making."
    },
    {
      "text": "J.K. Rowling's Harry Potter prequel is more fun than the films made from those books. Fun. Yes. But it's not exactly magical."
    },
    {
      "text": "Not only opens up a whole innovative universe of dark cinematic surprise but also exciting new territory for Potterphiles as the wizarding world moves from sedate rural England to the helter skelter jazz age of prohibition era New York."
    },
    {
      "text": "Yates has fresh tricks up his sleeve as he preps for four more planned films. Five years after the last Potter movie, his 20-something fans can age alongside wizards and witches again. Magical."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them turns out to be a hyperbolic name for a pretty so-so movie -- one with entertaining passages, but which mostly feels like a big-budget prequel to the better, more cohesive film that's yet to come."
    },
    {
      "text": "Set against all the thunderous themes are the antics of a bunch of uninspired imaginary animals - sorry, fantastic beasts - and an astonishingly winning cast that very nearly atones for everything else."
    },
    {
      "text": "Extravagant creatures of digital descent can't sustain a story that does little more than set the scene for a long string of sequels."
    },
    {
      "text": "Comparatively, Fantastic Beasts and Where to Find Them ranks as the weakest Potter film, and probably one of the least kid-friendly. But the teenagers who grew up on Rowling's stories will adore it, and what comes next should be fascinating."
    },
    {
      "text": "Redmayne, who often comes off as too mannered in his performances, is a nice fit for Scamander, eccentric and smart, a little naive but also firmly resolute when the chips are down."
    },
    {
      "text": "Rowling and her studio are not so much telling a story as erecting another \"tentpole,\" the Hollywood name for a \"franchise\" that becomes a virus - but is nonetheless regarded as a remedy for red ink. I only wish there were a vaccine."
    },
    {
      "text": "Forget about magical creatures: Fantastic Beasts and Where to Find Them could use some help finding itself, and in figuring out who its protagonist is."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a perfectly suitable launch for what promises to be another lucrative franchise."
    },
    {
      "text": "In true franchise style, it welcomes newbies to this addictive world with wonderful imaginative constructs, developing story lines and intriguing characters while also managing to build upon what hardcore fans have seen before."
    },
    {
      "text": "While big screen spectacle is appealing, the material just isn't as deeply felt as previous Wizarding World adventures, making it appear as more of a business decision than rip-roaring new beginning."
    },
    {
      "text": "Absent the thrill of learning something new and wonderful, Rowling's world is commonplace."
    },
    {
      "text": "The plots may never convincingly join in [J.K.] Rowling's screenplay, but separately, each one is effective in its own way."
    },
    {
      "text": "Fantastic Beasts may be entertaining and often mesmerising but, ultimately and obviously, it's not Harry Potter."
    },
    {
      "text": "An entertaining film where the Oscar-winning actor Eddie Redmayne brings the necessary dash of extravagance. [Full review in Spanish]"
    },
    {
      "text": "For all the sophisticated special effects, it's rather like being trapped in a two-hour game of Pokémon Go."
    },
    {
      "text": "A new saga has been born and the start, luckily, lives up to the expectations. [Full review in Spanish]"
    },
    {
      "text": "The balance between the recognizable elements of the Potter saga and those that unfailingly show a new facet of the magical universe of Rowling really work together. [Full review in Spanish]"
    },
    {
      "text": "Fantastic Beasts offers a good intro to Potter-iffic times ahead, some of them suitably creepy (note the parental guidance rating) as the dark wizard Gellert Grindelwald threatens to bring his evil doings across the Pond from Europe."
    },
    {
      "text": "The plot thickens, along with the emotional tension, which was always the best part of the Potter universe, and not the dazzling special effects."
    },
    {
      "text": "The most complete and entertaining entry so far in the franchise. Fantastic Beasts is a delightful and fun return to the magical world of Harry Potter. [Full review in Spanish]"
    },
    {
      "text": "Redmayne makes for a tender, unique, heart-warming hero who can sometimes seem more Time Lord than wizard (complete with Tardis-like luggage)."
    },
    {
      "text": "The movie opens up a rich, multilayered world that holds the promise of interesting stories to come."
    },
    {
      "text": "It's enchanting, romantic, dark and retains that Potter-like spirit."
    },
    {
      "text": "A whole new franchise is off to a positively ripping start."
    },
    {
      "text": "Redmayne gives a tender performance that quietly infuses the movie with a lot of heart."
    },
    {
      "text": "It's thoroughly enjoyable and a guaranteed crowd-pleaser"
    },
    {
      "text": "This is the first time that David Yates-who directed the final four movies in the Potter series-has been defeated while dueling his wizardly material."
    },
    {
      "text": "This new franchise is supposed to be comprised of five movies. Consider \"Fantastic Beasts\" an awkward introduction. Perhaps when we get to know Newt better, we will embrace him more closely."
    },
    {
      "text": "What might have been a cynical cash grab is a delightful romp through new but equally spellbinding territory."
    },
    {
      "text": "It's ... not hard to feel a twinge of skepticism, a nagging suspicion that this busy, proficient, uninspired movie is soliciting not our sense of wonderment so much as our brand loyalty."
    },
    {
      "text": "Rowling proves to be a good, sharp hand with dialogue while still having a ways to go in terms of shaping a movie; that said, you can feel her enjoyment in exploring the terrain she has created."
    },
    {
      "text": "The dull special-effects gloss of a fantasy blockbuster only throws [Fogler's] charming performance into greater relief."
    },
    {
      "text": "A less than magical introduction to the new series...a slightly misshapen piece in which the secondary characters are more immediately appealing than the central ones."
    },
    {
      "text": "While Fantastic Beasts suffers from some symptoms [as other] recent high-profile Hollywood spectacles: too many set-pieces, various plotlines stitched together like a quilt, and one-note supporting roles, it is also really fun."
    },
    {
      "text": "J.K. Rowling has much to learn about writing a script versus writing a novel."
    },
    {
      "text": "As much as it is Newt leading us through this adventure, the film entirely owes its charms to the new cast of supporting characters, including the scene-stealing CGI beasts."
    },
    {
      "text": "It is best to simply sit back at some point and enjoy the ride."
    },
    {
      "text": "You can't help but feel that this eighth movie in the series may perhaps be more of a financial exercise than a necessary extension of the story."
    },
    {
      "text": "A disappointment that underlines how great the original Harry Potter films were."
    },
    {
      "text": "It has moments of humor, whimsy and fun, but its overall tone is dark, casting its fantasy adventure against a very serious backdrop of dread, paranoia and oppression."
    },
    {
      "text": "There are no emotional stakes here, because Rowling and the dully efficient director have failed to put in the required groundwork to make these relationships mean something."
    },
    {
      "text": "For all the pressure bearing down on it - how badly the creaking movie industry could do with five sure-fire box office smashes - it feels, remarkably, like a tale told for the fun of it."
    },
    {
      "text": "Is there an irony to the fact that Yates, who has become the de facto film interpreter of Rowling's stories, has shown the most gusto in the movie where he was given the least material to work with?"
    },
    {
      "text": "Yates ... has brought some of his old Potter crew with him and gives this new machine a steady, smooth hand."
    },
    {
      "text": "Doesn't make a strong case for itself as an essential addition, but it's an entertaining ride nonetheless."
    },
    {
      "text": "Fantastic Beasts and Where To Find Them is a rollicking, cheekily funny picture that doesn't shy away from grim realities, resulting in something profound. Now that's magic."
    },
    {
      "text": "Muggles, we're a long way from home."
    },
    {
      "text": "This eye-popper gets the new franchise off to a magical enough start."
    },
    {
      "text": "While it falters and even bogs down at moments in the storytelling, Beasts is a dazzling spectacle overall and more often spellbinding than not."
    },
    {
      "text": "It's certainly the best blockbuster I've seen in some time and great fun."
    },
    {
      "text": "Fantastic Beasts seems less an extension of Harry Potter's universe than a Hollywood attempt to lay the foundation for another standard-issue, visual effects-laden franchise."
    },
    {
      "text": "This is rousing filmmaking that combines astonishing special effects with plenty of humour and pathos."
    },
    {
      "text": "It efficiently takes us back to the brilliant imagination of J.K. Rowling. [Full review in Portuguese.]"
    },
    {
      "text": "It's tremendous fun, too. Rather than opting for a conventional prequel, sequel or (shudder) reboot, Fantastic Beasts delves back in time and shifts the action to the other side of the Atlantic."
    },
    {
      "text": "If you are looking for a fantastic movie and don't know where to find one, look no further than \"Fantastic Beasts and Where to Find Them.\""
    },
    {
      "text": "The next four movies will likely only get better from here, and that might be the most fantastic thing of all."
    },
    {
      "text": "There's an awful lot of world building to do in \"Fantastic Beasts,\" so future installments - this is the first of a planned five-part series - should run smoother. But there's already plenty to like about Newt and the gang."
    },
    {
      "text": "It is guaranteed be a worldwide hit -- not just because it is part of the Potterverse, but also because it is tremendous fun to watch."
    },
    {
      "text": "Good news: the beasts have been found, and they are indeed fantastic. JK Rowling delivers a magical universe as chiaroscuro as ever, but with plenty of slapstick and surreal hilarity in Prohibition-era New York."
    },
    {
      "text": "What I realized watching this was how much the Potter movies relied on the skill and charisma of Daniel Radcliffe, Emma Watson, and Rupert Grint. The actors here are introducing new characters from scratch, and so far they're not that gripping."
    },
    {
      "text": "The magic here is a little more grown-up, given the wizards are not children, but still playful and inventive."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them does exactly what it needs to do, introducing new characters and setting up ongoing plot threads. It's certainly more nimble and entertaining than the first couple of Potter movies."
    },
    {
      "text": "The movie itself is a bit of a push-me-pull-you - a properly magical experience (the production design, including the animals, is enchanting) tugged in other, darker directions by Rowling's sometimes unwieldy screenplay."
    },
    {
      "text": "It's not Hogwarts, but Rowling still has some magic in her."
    },
    {
      "text": "Fantastic Beasts is forlorn and captivating, a rare blending of cheery, witty entertainment with a troubled worldview."
    },
    {
      "text": "The sumptuously-designed Harry Potter spinoff is lush, thrilling and warmly welcome. The next installment of Fantastic Beasts, and its timely themes of acceptance and unity couldn't possibly arrive fast enough."
    },
    {
      "text": "The best parts of Fantastic Beasts are those that deal with the immediate storyline. Those that seek to extend the narrative are less interesting."
    },
    {
      "text": "The result is an effective if not everlasting magical spell."
    },
    {
      "text": "[There's] a refreshingly light tone competing with the sinister themes, thanks especially to two exceedingly appealing supporting characters headed for a sweet confection of a romance."
    },
    {
      "text": "Jacob, and his interactions with Queenie in particular, give the film the spark it so desperately needs to succeed."
    },
    {
      "text": "Fantastic Beasts and Where To Find Them... is best at capturing a world out of balance and an unease that's as timely as today's tweets."
    },
    {
      "text": "As pre-Christmas escapism Fantastic Beasts is a first rate romp."
    },
    {
      "text": "Newt Scamander doesn't have the charm or gravitas of Harry Potter, but Fantastic Beasts still proves to be an enthralling expereince."
    },
    {
      "text": "While the spectacle is certainly there, and with it a hint of the grandeur of those earlier films, there's something empty at this movie's heart."
    },
    {
      "text": "There's never been a better time to escape into J.K. Rowling's world of magic. Unfortunately, the cast of characters you'll find here is a pale imitation of her Hogwarts heroes."
    },
    {
      "text": "Fantastic Beasts And Where To Find Them is to the Harry Potter franchise what The Phantom Menace was to Star Wars. And that does not bode well."
    },
    {
      "text": "While it does pass muster well enough in terms of establishing a fresh franchise to carry the prestige Rowling brand, none of her fans in their heart of hearts will rank Fantastic Beasts over any past Potter production."
    },
    {
      "text": "Fantastic Beasts and Where to Find Theme introduces us to a wondrous world outside of our cinematic Potter knowledge, and works as a prime set-up even if substance is a bit slight."
    },
    {
      "text": "A great movie that recovers the essence of Harry Potter universe to create its own without getting disconnected never from it. [Full review in Spanish]"
    },
    {
      "text": "Nothing in Fantastic Beasts rivals Harry's journey from the cupboard under the stairs to the towers of Hogwarts. That brand of wizardry -- the truest magic in Rowling's world -- has vanished."
    },
    {
      "text": "This is Marvel imitation at its most tedious."
    },
    {
      "text": "Engaging and enchanting, a fun-filled return to the wizarding world...."
    },
    {
      "text": "A magic-tinged parable on prejudice and oppression, the film is so airy and light-hearted it verges on inconsequential. That is not to suggest it isn't enjoyable, though, because it is."
    },
    {
      "text": "It feels great to revisit Rowling's creation, even in spin-off form."
    },
    {
      "text": "David Yates's film proves to be more coherent and emotionally grounded than any of the Harry Potter episodes."
    },
    {
      "text": "Solidly extending the Harry Potter franchise to a different era with new characters, \"Fantastic Beasts\" starts slowly before finding its groove, delivering sufficient spectacle alongside a little emotion."
    },
    {
      "text": "\"Fantastic Beasts\" feels very much like its own thing, worthy of its own attention and box-office. It's an entertaining, visually stunning film that doesn't require Potter knowledge to enjoy (though it would probably help)."
    },
    {
      "text": "The directing-editing team of David Yates and Mark Day did the last four Potter movies, and they understand how to evoke the atmosphere of that world without replicating it in a different setting."
    },
    {
      "text": "There are scenes, typically the most destructive ones, that could be plopped into any old \"X-Men\" movie. But director Yates knows his way around this stuff."
    },
    {
      "text": "The movie feels like cramming for an examination from the coolest textbook, guided by the most engaging professor at the school."
    },
    {
      "text": "There's so much going on in Fantastic Beasts that after the first act, you almost can't be bothered to care what happens next."
    },
    {
      "text": "The players may be different but the magic of J.K. Rowling's wizarding world remain the same."
    },
    {
      "text": "David Yates...maintains an orienting aesthetic that welcomes us back as Rowling spins out new characters which continue her themes of fighting against fascism, oppression and child abuse...but it also displays a whole new level of uproarious playfulness."
    },
    {
      "text": "...rich with ideas and imagination..."
    },
    {
      "text": "Whether you're a Potterhead or not, Beasts creates a story that's both original and enchanting."
    },
    {
      "text": "Rowling's screenplay skilfully balances the dark and light; the cheerful frolics, friendship and romance serve as a reminder to the characters of just what they are fighting for."
    },
    {
      "text": "Redmayne is superb in the lead, and there's real emotion, comedy and romance in his blossoming friendships."
    },
    {
      "text": "Even if you, like me, are a bit Pottered out and wish Rowling would devote herself instead to her marvelous Cormoran Strike detective-novel series (magic comes in many forms) - it's still a pleasure to revisit the author's world."
    },
    {
      "text": "[Rowling and Yates] have created a delightful adventure movie that doubles as a franchise launching pad, and they did it by adapting a fictional textbook."
    },
    {
      "text": "I have heard the cash cow moo...the sort of movie many will feel obliged to like more than they actually want to clamor right back onto the ride."
    },
    {
      "text": "Style overtakes substance in J.K. Rowling's new era of Wizarding Worlds, when an overload of special effects and confused storytelling hinders the film from soaring like the winged beasts of the title... of course there are some good things too."
    },
    {
      "text": "Newt Scamander is indeed the hero who we need right now, and Rowling is the storyteller we need now more than ever."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a fun treat for Harry Potter fans, especially when the CGI creatures grace the screen."
    },
    {
      "text": "Yates and Rowling skillfully weave their bleak - and very blunt-edged - message into the fabric of the story. It might be wildly out of place in a fantasy aimed at tweens, but it's a welcome change from the usual vapid blockbuster."
    },
    {
      "text": "Not even J.K. Rowling can say abracadabra and make a worthwhile movie franchise appear. The lightning that struck Harry Potter once merely grazes Fantastic Beasts and Where to Find Them, turning the sorcerer's mentor into a fantasy apprentice."
    },
    {
      "text": "Rowling's script is thrillingly immersive, plunging us into a world of wizarding that's instantly familiar to die-hard Potter fans yet dizzyingly inventive at the same time."
    },
    {
      "text": "It looks great and has a firm moral backbone, but thin characters, pacing issues, and a main narrative that is less interesting than the worldbuilding bring this well-intentioned blockbuster down."
    },
    {
      "text": "From the opening music to the sweet final beat, it's a joy to be back in Rowling's world. Open the suitcase, we're coming in."
    },
    {
      "text": "Even with a smaller, more compact story, \"Fantastic Beasts\" hobbles around, trying to get all its characters in order, all while enacting the now obligatory world building. They're charming characters, though."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them remains engaging, and the visual effects are mightily impressive, while some of the set-pieces are gloriously immersive."
    },
    {
      "text": "Mix magic and monsters with Muggles and the result is the movie we've all been waiting for since Harry Potter hung up his wand."
    },
    {
      "text": "This is a busy but brilliant re-introduction to one of the most successful franchises in the world."
    },
    {
      "text": "It's every bit as good as Potter and quite possibly even better. I absolutely loved it."
    },
    {
      "text": "Stumbles aside, Fantastic Beasts and Where To Find Them is enthralling, enchanting and joyful."
    },
    {
      "text": "Rowling, who wrote the screenplay, has layered a sophisticated and surprisingly dark origin story that will appeal more to grownups than the younger set."
    },
    {
      "text": "J.K. Rowling's \"Harry Potter\" spinoff is sheer magic, a grand fantasy-adventure that already feels like an old family favorite."
    },
    {
      "text": "The \"Potter\" movies were so well conceived that they contain endless possibilities for more entries, and \"Fantastic Beasts\" takes the bait right on cue, not repeating a formula so much as enriching it with a spellbinding polish."
    },
    {
      "text": "Fantastic Beasts and Where to Find Them is a fine time, but it won't exactly sweep you up into New York City's wizarding world."
    },
    {
      "text": "With this heavy lifting done, there's every reason to hope for an even more magical adventure next time."
    },
    {
      "text": "Fantastic is right."
    },
    {
      "text": "Rowling, who also wrote the script, nimbly lays out her world, but that world isn't nearly as rich as the world of Hogwarts."
    },
    {
      "text": "I'm not sure which is more adorable, Eddie Redmayne as Newt Scamander, or the creatures he smuggles into the US in his battered leather briefcase."
    },
    {
      "text": "Rowling's latest trick is to cross Doctor Who with Doctor Dolittle. Newt and his menagerie provide just enough surprises for an action-packed couple of hours. But the magic man isn't quite as spellbinding as the wizard boy."
    },
    {
      "text": "Has all the makings of a huge family blockbuster, but all the bloated traps of those, too. It hasn't quite got the balance right, but, like the title hints, surely knows where to find the magic formula over the ensuing movies."
    },
    {
      "text": "A worthy, but much different, successor to Harry Potter."
    },
    {
      "text": "Rowling and Yates succeed at transporting you to a magical world you don't want to leave."
    },
    {
      "text": "Rowling and Yates have given us a terrifically good-natured, unpretentious and irresistibly buoyant film."
    },
    {
      "text": "Who needs Harry Potter? With 'Fantastic Beasts', it's undeniable that the clear star is screenwriter and 'Harry Potter' author J.K. Rowling."
    },
    {
      "text": "Likely to draw in just about everyone who followed the Potter series and to please most of them, the picture also has things to offer for fantasy-friendly moviegoers who only casually observed that phenomenon."
    },
    {
      "text": "This first instalment showcases just enough of them to make you sign up for the full expedition."
    },
    {
      "text": "As a feat of world-building and character-shaping, it sets an appealing stage."
    },
    {
      "text": "\"Fantastic Beasts\" has clearly been designed for the most devoted of Rowling's fans, and though it may prove confusing to newcomers, the faithful will appreciate the fact the film never talks down to its audience."
    },
    {
      "text": "Diehard fans will likely adore it and its familiar Rowling magic, which gently rolls through the 1920s Jazz Age... and toward the darkest of tunnels up ahead."
    },
    {
      "text": "There's just enough romance, whimsy, creativity and eye-catching visuals to enchant in Fantastic Beasts And Where To Find Them, but its flaws ultimately come close to ruining it all."
    }
  ],
  "release_year": 2016,
  "duration": 127,
  "genres": [
    "Fantasy",
    "Adventure"
  ],
  "age_rating": "PG-13",
  "synopsis": "The year is 1926, and Newt Scamander (Eddie Redmayne) has just completed a global excursion to find and document an extraordinary array of magical creatures. Arriving in New York for a brief stopover, he might have come and gone without incident, were it not for a No-Maj (American for Muggle) named Jacob, a misplaced magical case, and the escape of some of Newt's fantastic beasts, which could spell trouble for both the wizarding and No-Maj worlds.",
  "popularity": 7.9,
  "poster_url": "https://image.tmdb.org/t/p/original/fLsaFKExQt05yqjoAvKsmOMYvJR.jpg"
}