{
  "movie_name": "Fifty Shades of Grey",
  "movie_id": "fifty_shades_of_grey",
  "total_reviews": 279,
  "reviews": [
    {
      "text": "As dodgy, ludicrous and funny, as the film might be, as a public spectacle it’s probably not as embarrassing as being seen reading the book"
    },
    {
      "text": "Here's a film that is offensive only in how inoffensive it proves to be."
    },
    {
      "text": "Feels like an elegantly made - the cinematography and score are top notch - night time soap opera."
    },
    {
      "text": "At least, the film goes out of the way to show the use of condoms."
    },
    {
      "text": "If this is love, no thanks."
    },
    {
      "text": "In terms of story and character, this film is in desperate need of a safe word."
    },
    {
      "text": "Overlong, too clinical in design, and based on lowest common denominator entertainment (or so I'm told), Fifty Shades of Grey still manages to be engaging, funny, and unexpectedly human."
    },
    {
      "text": "Given that this is her second film, [Sam] Taylor-Johnson directs the film with taste and care by focusing on the interactions between Ana and Christian rather than the sexual side of the story and the film looks stunning."
    },
    {
      "text": "Fifty Shades of Grey will draw you in out of curiosity and possibly hopes of a good movie, then leave you wondering why you agreed to such a thing in the first place, much like the main character."
    },
    {
      "text": "Funny that no one seemed to understand in the making of Grey that watching two vaguely defined characters engage in ceaseless rounds of conservatively filmed grimaces and stifled moans gets tiresome quickly."
    },
    {
      "text": "There is little more critical than to say a third of the film had people laughing at dialogue, and the other two thirds wiggling in their seats, not from discomfort or innervation, but from boredom."
    },
    {
      "text": "You've seen worse; you've imagined better."
    },
    {
      "text": "Nice as it looks, this movie tastes bad..."
    },
    {
      "text": "Most of the actual sex has less erotic value than what can be found on late night HBO, and it certainly doesn't hold a candle to the graphic content of the novels or the erotic-charged hype surrounding the film."
    },
    {
      "text": "You would've put the book down after reading the character's name on the third page: Anastasia Steele? Puh-lease!"
    },
    {
      "text": "[General audiences] might need to be handcuffed to their seats and wonder how something so wildly popular could be so stiflingly unerotic."
    },
    {
      "text": "Every fiber of my being is screaming at her to send this man packing."
    },
    {
      "text": "The dialogue is terrible and Dornan's Grey is so humourless that any vaguely funny lines fall utterly flat. On the plus side Johnson does her best with what she's been given, Ana is a Thomas Hardy fan, and Grey has a nice kitchen."
    },
    {
      "text": "The entire palate of the film was cool and gray, which doesn't do much to incite passion. and I don't think we should blame the actors."
    },
    {
      "text": "Fifty Shades of Grey is that hot date you bring home to discover (s)he's a cold fish between the sheets."
    },
    {
      "text": "This is worth going to the cinema for, leave your expectations behind and relax and enjoy a visually beautiful film."
    },
    {
      "text": "Sometimes a book should just remain a book and in the case of \"Fifty Shades of Grey\" that is exactly the case."
    },
    {
      "text": "[Fifty Shades of Grey] simply never gets anything right."
    },
    {
      "text": "Among the many mind-bogglingly implausible fantasies Fifty Shades of Grey sells, the one I think that most accounts for its popularity is the promise that shame of sexual sin can be alleviated by surrendering to it more fully."
    },
    {
      "text": "I'm really worried about the fact that some people (especially girls) regard Mr. Grey as an object of desire, as some sort of ideal man. [Full review in Spanish]"
    },
    {
      "text": "The second half of the film devolves into something that resembles tedious, melodramatic daytime TV."
    },
    {
      "text": "Grey is not a character, but a cluster of clichés... [Full review in Spanish]"
    },
    {
      "text": "It's superficial, it's manipulative, it's off-putting and embarrassing. But there's no denying that this says something about the moment in which the book was published and the movie released."
    },
    {
      "text": "The script is abysmally bad, filled with Shakespearean dialogue such as \"I won't touch you until I have your written consent\", and \"I don't make love, I f***... HARD\""
    },
    {
      "text": "Dakota Johnson shines in this clunky, boring and domesticated sex ruse. [Full review in Spanish]"
    },
    {
      "text": "There is an awful lot of rose-tinted nostalgia here for a time when women sat passively while powerful men threw wealth at them, but the interesting difference here is that the power dynamic between Red Riding Hood and the Wolf shifts."
    },
    {
      "text": "Shortage of exotic shenanigans apart, artist-turned-director Sam Taylor-Johnson has delivered a decently acted and technically well-made adaptation of what remains a fundamentally silly and, at times, simply rather unpleasant story."
    },
    {
      "text": "I've seen way worse movies aimed at men and boys, so I think everyone can chill out about a mediocre movie aimed at women."
    },
    {
      "text": "It may not be your conventional Valentine's Day date movie, but it looks set to give audiences more pleasure than pain."
    },
    {
      "text": "The retention of the style of the book and its settings merges with a cinematic story more focused on buildup than execution."
    },
    {
      "text": "The film's a hell of a ride, often a fun and thought-provoking one, even though it's all such camp."
    },
    {
      "text": "In the run-up to [Fifty Shades of Grey]'s opening, I was surprised at the promotional efforts of NBC's \"Today\" show in the daily banter of the hosts and beyond."
    },
    {
      "text": "Fifty Shades of Grey is so much smarter than its source material, but smarter in this case doesn't mean better. Not where it counts, at least."
    },
    {
      "text": "Alas, I was a reluctant Dominant because the movie itself is such a mousey, uninvolving little thing that somebody had to step up."
    },
    {
      "text": "The most anticipated release of the year is not much more than a spanking great bore."
    },
    {
      "text": "Then the lights went down, and guess what? Fifty Shades of Grey turned out to be not just entertaining-at least until the clunky, exasperating final minute-but it also knows exactly what it's doing."
    },
    {
      "text": "Not as dirty as we were led to believe by the ads."
    },
    {
      "text": "Girls memorize the lines! But it's not a 'Rocky Horror' type cultural event; it's a lukewarm soft-core-porn soap opera-basically 'Pretty Woman' with spanking."
    },
    {
      "text": "I wish it had either been much better or much worse."
    },
    {
      "text": "In the lacking of an engaging subjectivity, the narrative of sexual awakening falls flat."
    },
    {
      "text": "While the film is arguably no better or worse than its literary source, it does shatter the fantasies of sexual desire and sexual pleasure constructed within the novel."
    },
    {
      "text": "A guilty, if not particularly memorable, pleasure."
    },
    {
      "text": "Funny (often intentionally!), ferociously unsexy, and roundly entertaining from beginning to end."
    },
    {
      "text": "It's a warped, disturbingly abusive adult fairy tale from start to finish."
    },
    {
      "text": "Certainly there is an audience out there for this kind of story, and with any luck neither you nor I will ever have to interact with it."
    },
    {
      "text": "This is a wannabe tragedy (with whips) about the knightly failure to commit to the maiden's romantic narrative."
    },
    {
      "text": "Fifty Shades of Grey delivers, however ponderously, on its promise of pop transgressiveness."
    },
    {
      "text": "Ultimately, Fifty Shades of Grey spends two hours describing a relationship that is bound to fail and doesn't even seem all that fun while it's occurring."
    },
    {
      "text": "Fortunately the two leads have real chemistry. Dornan makes Christian less creepy and more angsty than on the page and Johnson brings a surprising depth to Anastasia. They also know how to play certain scenes for laughs, making the film come alive."
    },
    {
      "text": "Let's talk about Dakota Johnson... she's the perfect blend of innocence and confidence; a stealthy heart-breaker who at first comes across as mousey and innocent, but suddenly and convincingly becomes confident and coquettish."
    },
    {
      "text": "I was more aroused by the immaculate shine on Christian's piano than anything in his boudoir of bondage: a set designer must have spent hours buffing those ivories."
    },
    {
      "text": "Rather than anything to do with sexual connoisseurship or philosophy in the bedroom, all that comes across through Fifty Shades of Grey's absence of erotic heat is a lust for the appurtenances of luxury, something that's more commonplace than singular."
    },
    {
      "text": "It's cheap, misogynist, Z grade exploitation masquerading as the romance of a woman trying to tame the ultimate man, who by all accounts should be alone left to his own demented fantasies"
    },
    {
      "text": "It's not overstating the case to say that Dakota Johnson achieves stardom with this role. She mines moments of humor that help offset the soul-searching and weeping, and she's appealing without being impossibly beautiful."
    },
    {
      "text": "This movie is a mess. It's glacially slow, boasts a laughably clichéd soundtrack -- Beast Of Burden, anyone? -- and is plainly a cash-grabbing set-up to promote a full trilogy."
    },
    {
      "text": "Yes, there's tons of nudity, but erotic? No."
    },
    {
      "text": "This alien quality is what makes Dornan so effective as Christian."
    },
    {
      "text": "Fifty Shades of Grey is one of the landmark works of the new millenium, the novel that proved definitively Americans will suffer through anything for a few fleeting moments of titillation."
    },
    {
      "text": "One day, it may become a bad movie/cult classic -- the kind of film that people go to laugh at, like Showgirls. But for now, it's so boring it feels endless."
    },
    {
      "text": "The film is about the best adaptation that could have been drawn from this rather dull source material -- at least until it slows to a crawl on the deathly serious and dull home stretch."
    },
    {
      "text": "Unexpectedly delightful."
    },
    {
      "text": "It was less terrible than I feared, but still fell well short of being good."
    },
    {
      "text": "When Christian sweeps the demure Anastasia off her feet and into his world of penthouse-and-helicopter luxury and sadomasochistic sex, what lies in store is two hours-plus of glossy tedium."
    },
    {
      "text": "There's a really funny, sexy comedy here that might have been wonderful, were it not also stuck with being an adaptation of this loathsome novel."
    },
    {
      "text": "Both actors are trapped by the rigid banality of their characters, and they fail to manufacture any chemistry -- without that heat, this is just a story about a contract negotiation."
    },
    {
      "text": "When you take a close look at Fifty Shades of Grey, it becomes painfully clear that it's basically a plethora of sex scenes strung together with a bare minimum of support."
    },
    {
      "text": "It's pretend bondage. Caffeine-free Diet BDSM."
    },
    {
      "text": "It's rare when a movie is better than a book, but in this case, only because this movie is better than its source material doesn't mean it's good."
    },
    {
      "text": "If they added foreboding opening and closing monologues by David Duchovny, the whole thing could easily be mistaken for a long-lost episode of Red Shoe Diaries."
    },
    {
      "text": "Johnson brings some wonder and vulnerability to her part, but even with a listenable soundtrack, the song that most comes to mind is Peggy Lee's \"Is That All There Is?\""
    },
    {
      "text": "Grey may be crass and calculated, but Johnson saves it from being completely forgettable."
    },
    {
      "text": "Without the baggage of having read the book, the synopsis or even the film's Wikipedia page, Fifty Shades of Grey unspools as a surprisingly engaging story about sexual naivety, concepts of consent and, ultimately, power."
    },
    {
      "text": "Actress Dakota Johnson brings humor, sensitivity and vulnerability to Anastasia, making her the clear breakout performance of Fifty Shades [of Grey]."
    },
    {
      "text": "A monumentally boring motion picture."
    },
    {
      "text": "Who would have thought, a Twilight ripoff actually being inferior to its already inferior inspiration."
    },
    {
      "text": "... isn't nearly as terrible as E.L. James' novel would make you expect. There's perverted, like the sado-masochistic sex games played by tycoon Christian Grey, and then there's perverse, like the pleasure of watching trash so glossily compacted."
    },
    {
      "text": "Basically, they made a lousy, mid-2000s-era Katherine Heigl romance with a handful of explicit sex scenes spliced throughout the familiar clichés."
    },
    {
      "text": "A syrupy softcore melodrama with perhaps too much dialogue."
    },
    {
      "text": "My biggest grip with the film was that I didn't find the two leading characters all that interesting."
    },
    {
      "text": "He's a wealthy tycoon named Gray who takes a woman to her limits. I'm talking, of course, about '9 1/2 Weeks.'"
    },
    {
      "text": "Perhaps it's time for all of us to recognize that fantasies come in a great many more than 50 shades - and that they're not real."
    },
    {
      "text": "One suspects that Taylor-Johnson was never free even to push at the edges of sexual representation, and the film's lack of explicit imagery and grit is one of its disappointments."
    },
    {
      "text": "What emerges in Fifty Shades of Grey is perhaps the best finished product that could rise from the depths of a compromised starting point."
    },
    {
      "text": "Taylor-Johnson has made a film that is both sexy and stylish."
    },
    {
      "text": "I fault no one for whatever it is that gets their crank turning, but if this movie is working you need to take that thing out for a spin far more often."
    },
    {
      "text": "It's a bondage movie without much perversion, a love story without much passion, and ultimately, a film burdened with expectations it could never fulfill. It never quite hits as hard as you want it to."
    },
    {
      "text": "I can only say that boredom set in early."
    },
    {
      "text": "While there's some meat to Dakota Johnson's role of the ingenue, Jamie Dornan is given absolutely nothing to work with for most of the film."
    },
    {
      "text": "In the end, Fifty Shades of Grey isn't so much terrible as it is timid and tame."
    },
    {
      "text": "The much-hyped film adaptation, in which James was closely involved, sticks closely to the novel, but is both strengthened and weakened by what director Sam Taylor-Johnson and screenwriter Kelly Marcel decided to omit."
    },
    {
      "text": "What is this thing called love? That's a question asked by Cole Porter. In 'Fifty Shades of Grey,' the initially virginal heroine has a very different if not entirely unrelated query: 'What are butt plugs?'"
    },
    {
      "text": "Oh...my...god."
    },
    {
      "text": "Sam Taylor-Johnson's movie adaptation gets so caught up in the intrigue and melodrama that it never really finds its groove. Even the film's raw sex appeal is lacking, which just leaves a poorly plotted story and laughable dialogue."
    },
    {
      "text": "...a lukewarm exercise in timidity that - if not exactly embarrassed by its subject matter - is extremely wary of diving too deeply into it."
    },
    {
      "text": "\"Fifty Shades of Grey,\" which gingerly crosses over into the questionable subject mark, may not be the film some of the book's readers were hoping to witness."
    },
    {
      "text": "There is a very good chance that I will see nothing worse all year. I'm pretty sure I will see nothing more brain-witheringly stupid and boring -- or less sexy."
    },
    {
      "text": "The movie is simply a profitable pop culture movement with the only good thing coming out of it is Beyoncé's remix of 'Crazy in Love.'"
    },
    {
      "text": "If this fanchise plans on being the \"Saw\" of Valentine's Day, I hope the next installment doesn't torture the audience so much."
    },
    {
      "text": "This is a film that should have gone direct to Cinemax."
    },
    {
      "text": "Fifty Shades the movie seems destined to inspire more eye-rolling than lip-biting, even if there's no denying that its protagonist is better served by the film than the book."
    },
    {
      "text": "Think of it as the \"Downton Abbey\" of bondage, designed neither to menace nor to offend but purely to cosset the fatigued imagination."
    },
    {
      "text": "A wimpy, wounded billionaire sadist - correction \"dominant\" - with a cleanliness fetish and no friends stalks with gifts a passive-aggressive virgin."
    },
    {
      "text": "It realizes this story is ridiculous in ways the book itself never could. It has an actual sense of humor."
    },
    {
      "text": "It's supposed to be a romance, but plays like a long, boring business meeting in which the naughtiest bits are raised not in the bedroom, but the boardroom, where contract negotiation stagger on over the proposed merger of his manacles to her wrists."
    },
    {
      "text": "This adaptation of EL James's BDSM potboiler struggles to make a spanking cinematic silk purse out of its notoriously tin-eared source."
    },
    {
      "text": "A charm-free hero with control issues and a passive, fretful heroine have coy and tediously vanilla pretend-sex. This is meant to be erotic?"
    },
    {
      "text": "Panders to Twilight's housewives and teens demo using that story's template, but with sex! Kinky sex! The sex is incredibly boring and the alleged \"romance\" between a naïve college student and her stalkerish zillionaire suitor is deeply troubling"
    },
    {
      "text": "As silly and, yes, sanctimonious as this adaptation is, it deserves mention as one of the first major studio releases in ages to promote sex over vigilante violence or superherodom ... And that, in a peculiar way, makes the film a refreshing departure."
    },
    {
      "text": "A desultory dud, that swaps out [the novel's] prolonged and explicit intercourse for tame (conceived as tasteful) inserts, padded out by the troubled relationship between a straw man and blow up virgin."
    },
    {
      "text": "Beneath its curious surface, \"Fifty Shades of Grey\" is an uninformed and unrealistic \"romance\" set in the BDSM world that dangerously dramatizes sexual violence and glamorizes domestic abuse."
    },
    {
      "text": "I expect most viewers would rather see the filmmakers take this franchise in a different direction. How about Fifty Shades of The Grey, with the two vapid protagonists forced to contend with Liam Neeson and a pack of ravenous wolves?"
    },
    {
      "text": "Such silliness."
    },
    {
      "text": "A monochromatic misfire featuring only one shade: blushing pink."
    },
    {
      "text": "Frankly, after watching the film, I felt ambivalent. The film's not exhausting, at least. It's not quite fifty shades of dreck."
    },
    {
      "text": "Perfectly capturing the tone of E.L. James' sensational best-selling novel, this tale of control, sex and submission is tantalizing, titillating and provocative"
    },
    {
      "text": "Part of the appeal of the tawdry romance novel is that the visuals are left to the imagination for its legions of fans, whose expectations for steam and sizzle will inevitably be left unfulfilled here."
    },
    {
      "text": "It's an episode of Red Shoe Diaries with a major studio budget. It's a Lifetime movie with insider art pretensions. A Harlequin romance with anal play."
    },
    {
      "text": "It's been said that the movie contains 20 minutes of sex; if this is the case, it must contain at least 40 minutes of Ana biting her lip or putting a pencil in her mouth."
    },
    {
      "text": "There's no escape from the silly, pulpy predictability of Fifty Shades of Grey."
    },
    {
      "text": "The best they can do for dirty talk sounds like 'wear the panties your mother laid out for you.'"
    },
    {
      "text": "Presumably the sequels will explore forbidden taboos like \"character development\" and \"plot.\""
    },
    {
      "text": "A cynical, perfunctorily directed, guileless, sexless and artless re-tread of the novel - the worst kind of fan, and potential franchise, service."
    },
    {
      "text": "A relatively chaste, arguably feminist interpretation of the BDSM fairy tale."
    },
    {
      "text": "\"Fifty Shades of Grey\" has turned out to be more like 50 shades of blah."
    },
    {
      "text": "The sex scenes merely serve as a basis for the real appeal of the film, that is, the shifting emotions and back-and-forth of \"who's got the edge?\""
    },
    {
      "text": "[I]t promotes female \"empowerment\" within the safe culturally approved traditional female roles as submissive and as seeking a powerful Prince Charming to rescue them from \"ordinary\" lives."
    },
    {
      "text": "Still not bad for being based on a book with a narrator who exclaims \"jeez\" while in the throes of orgasm and talks about her \"bottom\" like she's a 4-year-old."
    },
    {
      "text": "Who would have imagined that a movie about sex could be so boring?"
    },
    {
      "text": "Anastasia Steele becomes a woman. Christian Grey? Bimbo. It's a gorgeous conceit, and I can't wait to read a raft of writing by smart female essayists about the film, and its cheeky subversion of its tin-eared source material."
    },
    {
      "text": "Unfortunately for the Fifty Shades of Grey movie, a solid cast, good director and unique premise only help to expose the inherent weaknesses of the source novel."
    },
    {
      "text": "Less interested in sexual power dynamics than in lassoing this guy into what the movie perceives as \"normalcy.\""
    },
    {
      "text": "The film doesn't culminate in anything. It's a bunch of scenes that end before any kind of satisfying conclusion."
    },
    {
      "text": "There really isn't enough meat here to cobble together a real movie, but you can't blame Taylor-Johnson for not trying. She somehow gives it all a movie-type sheen."
    },
    {
      "text": "If soft core porn is your thing go for it but that's about all you'll get. Not a lot of grey matter used writing the script of Fifty Shades of Grey."
    },
    {
      "text": "I guess what I found to be so surprising is how a movie about weird, erotic, passionate sex could wind up being so dull."
    },
    {
      "text": "Were it not based on a massive best-seller, no one would have made such a thematically reprehensible movie. If you think rape is a turn-on, this is the film for you. Personally, I'm perfectly happy not to be included in your ranks."
    },
    {
      "text": "Attempts to capture the appeal of a classical Victorian romance - tragedy and all - but has neither the complexity nor the historical context necessary to live up to its ambition."
    },
    {
      "text": "Thelanguage of 50 Shades is actually of the financial deal and the job interview, replete with the kind of counter-intuitive sloganeering we hear in advertisements. So much of what Christian Grey says is what money would say if it could talk."
    },
    {
      "text": "Every line of dialogue is loaded. Loaded like a diaper."
    },
    {
      "text": "An Ambien pill...While a follow-up is likely, it's a bit presumptuous, and if it's anything like the first installment, it's about as welcome as a splintered paddle."
    },
    {
      "text": "What's worse than the boring sex scenes, however, is the rest of the boring movie."
    },
    {
      "text": "Bland and dull, except for the rare moments when it is unintentionally hilarious, all Fifty Shades has to teach the curious is that it doesn't matter how many shades of grey you use, you will just end up with a drab, colorless blob."
    },
    {
      "text": "Given the constraints and need to please its considerable fan-base, this sleek, fairly trim and occasionally sensual adaptation is the best imaginable outcome."
    },
    {
      "text": "Lackluster take on best seller is way too graphic for kids."
    },
    {
      "text": "It is unashamed tosh but at least director Sam Taylor-Johnson has fashioned it into tosh with a touch of class."
    },
    {
      "text": "Like some mutant spawn of THE BACHELOR"
    },
    {
      "text": "Yawnography."
    },
    {
      "text": "Neither a camp laughing stock nor a shocking study of sexual obsession, Fifty Shades Of Grey starts well but fumbles in the dark. See it for Dakota Johnson. For the rest, find your safe word."
    },
    {
      "text": "Absolutely ludicrous, dramatically clumsy, fifty shades of wrong, but...If audiences can cool their loins long enough, they may have a productive think about the nature of their desires..."
    },
    {
      "text": "Sleek sets, sadomasochism, a few spankings and an overall blandness"
    },
    {
      "text": "...a passable adaptation that could (and should) have been much better..."
    },
    {
      "text": "\"Grey\" has about as much steam as a day-old cup of Earl Grey. The sexual scenes are ordinary and fail to push the envelope; they definitely do not arouse any viewer."
    },
    {
      "text": "After all the hype, it's impossible not to expect steam from this adaptation of E.L. James' mommy-porn bestseller"
    },
    {
      "text": "In the annals of sexually-charged event cinema, \"Fifty Shades of Grey\" barely lights a candle let alone combusts with unbridled forbidden passion."
    },
    {
      "text": "Fifty Shades of Grey may be the first film in history made specifically for the purposes of hate-watching."
    },
    {
      "text": "To put it plainly, there's nothing redeeming here - not the acting, writing, directing or even the, um, \"action\" scenes, during which you just feel bad for the characters, actors and everyone on the set who had to be a part of them."
    },
    {
      "text": "Hopeless twaddle, but sleekly made and sometimes funny. An honorable effort, and better than it needed to be."
    },
    {
      "text": "It's a bland experience occasionally interrupted by bouts of nudity and related naughty bits. (Full Content Review -- Sex, Profanity, Violence, etc. -- for Parents also available)"
    },
    {
      "text": "Although Dakota Johnson and Jamie Dornan lack erotic chemistry, this fetishistic fantasy remains faithful to the provocative novel."
    },
    {
      "text": "Will you sign the necessary paperwork to enjoy Fifty Shades of Grey?"
    },
    {
      "text": "... had James been overruled more often Fifty Shades of Grey could have been something genuinely extraordinary: an adult blockbuster in every sense."
    },
    {
      "text": "If this was written by Adam Sandler, groups of offended ladies would be outside theaters protesting with pitchforks and torches. Also, we wouldn't be laughing as much."
    },
    {
      "text": "I never thought I'd say this about a bigscreen adaptation of 50 Shades Of Grey, but it's true: the damn thing's just not trashy enough."
    },
    {
      "text": "\"50 Shades\" has its sexy moments, but never attempts to be romantic, and isn't ambitious enough to deliver romance and sex appeal simultaneously. ...Jamie Dornan is given the thankless task of playing a monotone misogynist."
    },
    {
      "text": "Nobody sweats or pants or experiences onscreen ecstasy, which is presumably how a movie about violent sex manages to avoid an NC-17 rating, but the result feels like 50 shades of beige."
    },
    {
      "text": "Isn't the stuff of bondage and discipline, sexual role play, silky blindfolds, and whips and floggers supposed to be, well, exciting?"
    },
    {
      "text": "My mind screams Noooooooo! This movie sucks and is offensive on so many different levels, but damn my lady parts....Jamie Dornan's abs beat me into submission. Every time I think about them any common sense I have goes out the window."
    },
    {
      "text": "Fifty Shades of Grey is by no means a masterpiece. Yet there are moments where it rises above the material thanks to the lovely Dakota Johnson who is luminous, and a director that helps paint a very pretty picture."
    },
    {
      "text": "Fifty Shades isn't ha-ha cheesy fun. It isn't tee-hee quasi-dirty fun. It's terrible. On almost every level."
    },
    {
      "text": "Fifty Shades of Grey only has one shade: tedious self-pity. The other 49 shades promised in the title are missing from the movie version of the infamous novel."
    },
    {
      "text": "I have seen more heat and more skin in late-night offerings on Cinemax. I've seen more realistic romance in young-adult movies, and I've seen better acting by furniture."
    },
    {
      "text": "How can a movie this controversial be this painfully boring?"
    },
    {
      "text": "While the movie talks dirty, what materializes on the screen is soft focus and barely soft core."
    },
    {
      "text": "Advertises itself as edgy and titillating, but proves fatally tepid and boring."
    },
    {
      "text": "Jamie Dornan is going to get crushed for his performance here, but it's not all his fault. His character, as it's written, has the charm of a toaster. There's not much Dornan can do about that."
    },
    {
      "text": "Johnson has a natural warmth, intelligence, and humor that come across on screen and go a long way toward making the movie less silly than it could have been."
    },
    {
      "text": "Anastasia is a problem. Christian is one, too. We spend most of the movie trying to figure out which character is the bigger one."
    },
    {
      "text": "We're constantly told in life that women long for humor, tenderness and honesty, yet that doesn't seem to be the case here."
    },
    {
      "text": "Dornan simply doesn't have the ability to truly offer up deep, unimaginable pain and self-loathing. He's just not that talented an actor, and if the part were recast for the next two movies, no one would bat a blindfolded eye."
    },
    {
      "text": "A generic romance cynically engineered to appeal to the lowest common denominator of female fantasy."
    },
    {
      "text": "Johnson is rather sweet, though, and if she played a role that required her to look more than alternately smitten and poleaxed, she could score big. But now that Fifty Shades is poised to be a franchise, will she have that chance?"
    },
    {
      "text": "Johnson does a lot of moaning and groaning...leading me to visualize a director wearing plus fours with a megaphone...out of camera range, yelling, \"Moan!\" and \"Groan!\" The idea of sitting through two sequels is almost more than one can bear."
    },
    {
      "text": "The director of the much-anticipated adaptation, Sam Taylor-Johnson, made what could have been a trashy TV movie into well-conceived cinema."
    },
    {
      "text": "...director Sam Taylor-Johnson attempts to make a silk purse out of a sow's ear, but while she leavens the experience with some well mined character humor and gives the production a glossy sheen, you can only put so much lipstick on a pig."
    },
    {
      "text": "Yet the film's biggest problem is its two stars. Despite all the ripped abs and exposed breasts, blindfolds and cuffs, there are few sparks between them. Without that, Fifty Shades of Grey feels as cold and sterile as Grey's sleek penthouse."
    },
    {
      "text": "Those who take their significant others to see it this Valentine's Day may find the evening ends with a soft kiss on the cheek rather than a night full of boot knockin'."
    },
    {
      "text": "Confunde fetiche com abuso."
    },
    {
      "text": "Sam Taylor-Johnson's Fifty Shades of Grey is total trash. Noble trash. The amusing kind of trash, actually."
    },
    {
      "text": "No one said the masochism part of the story in Fifty Shades of Grey had to do with what the audience would be put through."
    },
    {
      "text": "The dashes of momentum are just a tease. It's hard to remember the last time this much sex was this tedious."
    },
    {
      "text": "I'll go see the next movie quite happily."
    },
    {
      "text": "Sam Taylor-Johnson's film version is neither as bad as it could have been nor as good as it needs to be."
    },
    {
      "text": "Actors Dakota Johnson and Jamie Dornan make an appealing couple and battle mightily against the flat, linear plotting, though when the story ended inconclusively I wasn't eager to follow them through the inevitable sequels."
    },
    {
      "text": "In the interest of consumer reporting, I'll say this: The book isn't better than the movie, and the film isn't better than the book."
    },
    {
      "text": "Oddly enough, Sam Taylor-Johnson's movie version of E.L. James' phenomenal sexy best-seller begins as an intriguing, exciting, even eroticizing experience before its S&M engine jumps the rails."
    },
    {
      "text": "[A] supremely silly film."
    },
    {
      "text": "In the end, there's nothing here we haven't seen before. But there's also nothing as agonizingly awkward as James's prose."
    },
    {
      "text": "Some aspects might be off-putting, but the actors and filmmakers handle the topic in a surprisingly tasteful way."
    },
    {
      "text": "Leads Jamie Dornan and Dakota Johnson, both of whom spend the majority of the film supposedly desperately longing for each other, have so little chemistry that it gives the sexy goings-on a rather clinical feel."
    },
    {
      "text": "A great movie? Not even close. Is it the best movie that could have been made from its source material? It probably is."
    },
    {
      "text": "A flaccid S and M movie that's more infuriating than titillating? Happy Valentine's Day."
    },
    {
      "text": "The likably coy Johnson has no chemistry with the dreary, self-serious Dornan. He's a casting disaster ..."
    },
    {
      "text": "The sex scenes are the best bit because the story is so abjectly terrible."
    },
    {
      "text": "The biggest disappointment for those non-readers of the book is the feeling of is-that-all-there-is? A bit of rope, some hanging around, six smacks - it's tame enough to make Tyrion Lannister of Game of Thrones smirk."
    },
    {
      "text": "All in all, this is really tame."
    },
    {
      "text": "The movie as glossy as a Topps trading card. Real BDSM enthusiasts will roll their eyes at its chaste exploitation. But it's got something going on."
    },
    {
      "text": "When you look at is as nothing more than horny housewife erotic fiction, it serves its purpose."
    },
    {
      "text": "\"Fifty Shades of Grey\" the movie, for the record, is not quite as bad as \"Fifty Shades of Grey\" the book. But that's not saying much."
    },
    {
      "text": "In the closing moments, \"Shades\" goes from being dull to disturbing, but only slightly."
    },
    {
      "text": "Sam Taylor-Johnson's drably competent adaptation of EL James's appalling mucky novel offers Nitrazepam for the libido throughout."
    },
    {
      "text": "While Fifty Shades Of Grey is a memorable and society-shifting cultural event, it's in no way a memorable movie."
    },
    {
      "text": "Despite what you might fear, the movie is not torture. And even if it doesn't inspire lust, you will breathe a warm sigh of relief, thinking: This could have been so much worse."
    },
    {
      "text": "Creating a genteel R-rated film from a very X-rated book is like making a Mamma Mia! movie without the songs."
    },
    {
      "text": "\"Fifty Shades of Grey\" should be fun and frisky and, most of all, hot. Instead, it is a reserved, sanitized, overinflated downer, as sterile as Christian's sleek luxury penthouse."
    },
    {
      "text": "Unofficially titled, So, Can I Spank You or What?, Grey leaves you with a question you don't want to ask after a movie or after sex: Is that it?"
    },
    {
      "text": "About an hour in, it finally dawned on me that perhaps the movie was giving me insights into masochism after all. As the minutes slowly, painfully ticked by I came to accept my punishment."
    },
    {
      "text": "What's important is that the novel began life as Twilight fan fiction. That tells you everything you need to know."
    },
    {
      "text": "It needed to take the plunge, strengthen the sexual moments, and submit to the book's \"mommy porn\" reputation. Instead, it played it too safe."
    },
    {
      "text": "For a movie that traffics in the promise of sexual adventure, it's founded upon a woefully conservative narrative."
    },
    {
      "text": "There's a big problem with \"Fifty Shades of Grey,\" and his name is Jamie Dornan."
    },
    {
      "text": "The book has a reputation for being a compendium of ridiculous lines. The film is entertaining because it understands the humour of the material and milks the exchanges with knowing delight."
    },
    {
      "text": "\"Fifty Shades of Grey\" turns out to be an intriguing tussle - not in the sack, or in the Red Room of Pain, but in its internal war between the dubious erotica of James' novel (the first of three) and the far craftier trash offered by the movie."
    },
    {
      "text": "I'm not going to pretend I didn't like this movie, just as I can't pretend there's nothing wrong with it. But try thinking of it this way: It's an event movie that's also a relationship drama, and that's rare."
    },
    {
      "text": "I expected a lot of things from \"Fifty Shades of Grey,\" but I didn't expect to be bored."
    },
    {
      "text": "An unashamed and genially preposterous fairy tale, a kind of \"Cinderella\" with restraints, \"50 Shades\" is about as believable as \"Jack and the Beanstalk,\" albeit considerably more kinky in intent."
    },
    {
      "text": "Vainly seeking to reach the widest possible audience, the makers of this exercise in banality stripped it of almost anything that could cause offence."
    },
    {
      "text": "For a movie where people are naked for a large chunk of time and play at bondage and dominance (without ever really seeming all that committed to it), it sure is boring."
    },
    {
      "text": "It may be perfectly sufficient that, above all else, Fifty Shades of Grey captures the shallow essence of its source material."
    },
    {
      "text": "These two star-crossed lovers have a lot more to negotiate than just the path to true love."
    },
    {
      "text": "Fifty Shades of Grey feels like two, distinct films grappling for dominance over the screen: one a sensual and stylish romance, and the other a numbingly explicit Harlequin bodice-ripper brought to life."
    },
    {
      "text": "I can't help but feel that if this was subtitled and in Polish or French or something, then critics would be losing their collective minds over it."
    },
    {
      "text": "There's undoubtedly more nudity than in a standard 21st Century Hollywood movie, but it's less explicit and less passionate than what Michael Douglas and Sharon Stone got up to in Basic Instinct more than 20 years ago."
    },
    {
      "text": "What's troubling and somewhat dangerous is that underneath the twisted sex, this story contains the same template of every aspirational romance."
    },
    {
      "text": "I'm shocked - shocked, do you hear me?!? - that the film version of E.L. James' Fifty Shades of Grey is such a dull, decorous affair, about as erotic as an ad for Pottery Barn. Strictly intended for gluttons for punishment-by boredom."
    },
    {
      "text": "It has an impressive performance from Dakota Johnson (daughter of Melanie Griffith and Don Johnson, granddaughter of Tippi Hedren.) But it doesn't really feel like a date movie."
    },
    {
      "text": "Overall, no-one's going to be needing a cold shower after this. However, half a glass of something beforehand in the company of like-minded friends is definitely recommended."
    },
    {
      "text": "There is no denying that Fifty Shades, for the most part, is nonsensical and absurd, but it's undoubtedly good fun."
    },
    {
      "text": "The only thing Dakota Johnson can't pull off is her character's over-dramatic name - she introduces herself as Anastasia Steele like an apology."
    },
    {
      "text": "[Taylor-Johnson] has very professionally rendered this potent rubbish much less ridiculous, much more of a marketable proposition, than could have been expected."
    },
    {
      "text": "Maybe in future installments there will even be something that resembles a plot. For now, the entire movie is about as sexy as a root canal."
    },
    {
      "text": "I wouldn't say that Taylor-Johnson has made a good movie from \"Fifty Shades of Grey,\" precisely. That's asking too much."
    },
    {
      "text": "Johnson has a great knack with comedy, salting silly lines with witty humor, and giving ridiculous moments just the right roll of the eyes."
    },
    {
      "text": "It looks and feels like a sequel to Twilight, with deadly dull talk about S&M replacing endless consternation over turning into one of the undead."
    },
    {
      "text": "Think World of Interiors meets The Little Book of Bondage, and you may get the picture, which starts out hilarious, becomes ludicrous and finally dubious."
    },
    {
      "text": "Obsessed with money, willfully wrongheaded about sex and crippled by its own construction, Fifty Shades of Grey is too many kinds of awful to work as anything but accidental sociology: We get the smut we deserve."
    },
    {
      "text": "It proves that age-old saw that great books rarely make great films, whereas barely-literate junk can turn into something ripe and even electric on screen."
    },
    {
      "text": "My God, this thing goes on. By the time the two get busy in Christian's \"playroom,\" the oomph has gone out of the whole erotic setup ..."
    },
    {
      "text": "The film's intense commitment to being dull makes you long for sparkly vampires and werewolves."
    },
    {
      "text": "If this were a parody of romance, the film might be considered valid; but somehow the cast and crew appear to treat the venture as realistic."
    },
    {
      "text": "Easily amongst the seven or eight best Hollywood productions ever made about a woman contemplating whether or not to sign a dominant/submissive contract."
    },
    {
      "text": "A limp bore."
    },
    {
      "text": "\"Fifty Shades of Grey\" might not be a good movie - O.K., it's a terrible movie - but it might nonetheless be a movie that feels good to see, whether you squirm or giggle or roll your eyes or just sit still and take your punishment."
    },
    {
      "text": "To her credit, Taylor-Johnson proves that graphic images are not needed and this is the first mainstream Hollywood film that successfully shows female pleasure in bondage scenes. Unfortunately, we have to wade through an awful lot that is trite."
    },
    {
      "text": "Fifty Shades of Grey is an entertaining, witty, and yes occasionally sexy fable of female assertiveness disguised as a tale of submission."
    },
    {
      "text": "Maybe the smoulderingly sado-obsessed hero does not have a penis. It could account for his tastes. And his decor."
    },
    {
      "text": "Jamie Dornan somehow manages to render his sculpted beauty moot, which throws a major wrench in the gears for a film dependent on eroticism."
    },
    {
      "text": "It's no Clint Eastwood's superheroic saving of 'The Bridges of Madison County,' but it'll do."
    },
    {
      "text": "We may have all been curious going in, but by the time the credits roll, there's another question that springs to mind: Is that all there is?"
    },
    {
      "text": "Despite the endless sex, a highly unsatisfying encounter. Cold as a fish and almost as dumb."
    },
    {
      "text": "Fifty Shades of Grey is not the lame, hot-and-bothered fantasy romance many, including myself, thought it would be. It's got wit and humor and a modest intelligence about human behavior that, say, the Twilight movies never had."
    },
    {
      "text": "The movie Fifty Shades of Grey is considerably better written than the book. It is also sort of classy-looking, in a generic, TV-ad-for-bath-oil way."
    },
    {
      "text": "Sitting through the turgid and tedious S&M melodrama that is Fifty Shades of Grey may feel like its own form of torture."
    },
    {
      "text": "\"Fifty Shades Of Grey\" is embarrassing and depressing, especially when considering the picture as a reflection of the quality and state of mainstream modern romance today."
    },
    {
      "text": "\"The stylish and mostly satisfying film will be [a blockbuster], and deservedly so. Starring a vivacious Dakota Johnson and a game Jamie Dornan, Taylor-Johnson's erotic romance is a skillful distillation of James' first book.\""
    },
    {
      "text": "After the reams of commentary EL James' books have inspired (and recent faith-based protests) this big screen adaptation still manages to be about people, and even a little bit sweet."
    },
    {
      "text": "Lacks any of the raunch or controversy promised, and is instead tiresome, banal and as thinly plotted as a porno."
    },
    {
      "text": "The fine line between abuse and pleasure is so thin it's almost non-existent. Here is a Valentine's Day movie that will certainly make bank, but you aren't helping yourself or anyone else by seeing it."
    },
    {
      "text": "Gone are the truly dreadful aspects of the book, and the biggest surprise may be that Ana and Christian have developed senses of humor."
    },
    {
      "text": "No amount of polished technical ingredients can salvage a relatively faithful screenplay that lifts much of the book's painfully rudimentary dialogue verbatim."
    },
    {
      "text": "Glossy, well cast, and a consistent hoot until it becomes a serious drag."
    },
    {
      "text": "Accept this genuinely sexy, somewhat silly, relatively timid romantic drama on its own escapist terms and you'll find sufficient pleasure."
    },
    {
      "text": "Fifty Shades of Grey is a sex-positive but hopelessly soft-core erotic drama that fails to be even a fraction as titillating as the E.L. James books that inspired it. And yet, that's exactly why it works."
    },
    {
      "text": "Aiming to please, the filmmakers submit without hesitation to the bold yet hokey source material, with leads Jamie Dornan and Dakota Johnson breathing a crucial third dimension into cutout characters."
    },
    {
      "text": "Johnson is a true find: She's so committed, she makes Ana's every discovery - in or out of the bedroom - convincing."
    }
  ],
  "release_year": 2015,
  "duration": 125,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "When college senior Anastasia Steele (Dakota Johnson) steps in for her sick roommate to interview prominent businessman Christian Grey (Jamie Dornan) for their campus paper, little does she realize the path her life will take. Christian, as enigmatic as he is rich and powerful, finds himself strangely drawn to Ana, and she to him. Though sexually inexperienced, Ana plunges headlong into an affair -- and learns that Christian's true sexual proclivities push the boundaries of pain and pleasure.",
  "popularity": 4.1,
  "poster_url": "https://image.tmdb.org/t/p/original/63kGofUkt1Mx0SIL4XI4Z5AoSgt.jpg"
}