{
  "movie_name": "Finding Nemo",
  "movie_id": "finding_nemo",
  "total_reviews": 262,
  "reviews": [
    {
      "text": "Outside of being one of the greatest animated films of its generation, it’s got a delightful sense of humor."
    },
    {
      "text": "Pixar's Finding Nemo elevated their already visionary and pioneering output to the thematic level of Hayao Miyazaki."
    },
    {
      "text": "Easily Pixar's most colorful and joyous movie."
    },
    {
      "text": "Finding Nemo teaches the classic Pixar/Disney lessons about the importance of family, acceptance, kindness, and love, but it also an exciting tale of adventure, overcoming adversity, and teamwork."
    },
    {
      "text": "In its story, characters, and visuals, Finding Nemo reminds us of how remarkable- and poignant- a well made family film can be."
    },
    {
      "text": "The visuals are as sharp as the scripting, succeeding with laughs, thrills, heartache, and unforgettable characterizations to craft an animated masterpiece."
    },
    {
      "text": "Compared to other Pixar films, this may not be as good as the Toy Story franchise, but it's awfully close."
    },
    {
      "text": "A family film that is truly for the whole family - from grandpop to grandson. Finding Nemo is a precious gem in the Pixar and Disney vaults. Exquisitely stunning, enchanting and magical from start to finish."
    },
    {
      "text": "It's downright curmudgeonly to remain focused on the negatives when the rest of the picture is saturated with invention and wit."
    },
    {
      "text": "Pixar really knocked it out of the park on this one."
    },
    {
      "text": "Most of all, Finding Nemo is a touching tale which reassures you that even though things may look bleak, it will all turn out well in the end."
    },
    {
      "text": "Finding Nemo offers as much in terms of thrills, frights, humour and psychological insight as it does in pure technical skill, proving that a movie can be art without being an \"art\" movie."
    },
    {
      "text": "This gem of a film is the one with which Pixar asserted their supremacy over the animated world."
    },
    {
      "text": "...a good-but-hardly-great animated endeavor from Pixar."
    },
    {
      "text": "Finding Nemo is ultimately a rewarding, engaging, compelling, and even spiritual adventure that works charismatically on multiple levels."
    },
    {
      "text": "It looks great, of course: All the Pixar movies do. But the genius of those other movies lay in their actual stories -- stories as inspired as the animation."
    },
    {
      "text": "Visually, Finding Nemo is spectacular. The animators render theses scenes with exquisite detail and vibrant color, reaching beyond mere CGI-wizardry to artistry."
    },
    {
      "text": "A beguiling piece of storytelling and creates a magical underwater world through its imaginative graphics and sound effects."
    },
    {
      "text": "Artistically, it's up there with the all-time animated greats."
    },
    {
      "text": "A splendid eco-friendly comedy set in the Great Barrier Reef."
    },
    {
      "text": "The animation in Finding Nemo is quite breathtaking and this movie, created by Pixar, the same outfit that made Toy Story, looks like The Undersea World of Jacques Cousteau."
    },
    {
      "text": "The tropical pleasure is a beautifully imagined adventure that beguiles children and tickles adults."
    },
    {
      "text": "A spectacular comedy-adventure that's never less than totally immersive. Not quite the masterpiece that Toy Story was, but it's the closest Pixar have come since."
    },
    {
      "text": "Finding Nemo is a wonderment, certainly not human, yet humorously humane."
    },
    {
      "text": "A lavish feast and the best family catch of the summer blockbuster season."
    },
    {
      "text": "Finding Nemo is distributed by Disney, and it has what the most heartfelt Disney animated features used to have: rapturous imagery matched with real wit."
    },
    {
      "text": "Deliriously inventive and soaked in a warm and generous wit."
    },
    {
      "text": "Pixar's turned in an instant classic."
    },
    {
      "text": "Pixar's fourth feature for Disney is yet another miracle of computer animation, an instant classic, but with less of the surface brightness of Toy Story or Monsters, Inc."
    },
    {
      "text": "Pixar continued its run of superb computer-generated animated features with this jaw-dropping underwater adventure."
    },
    {
      "text": "[Dory's] throwaway lines are funnier than anything that comes out of all the other fish combined, balancing out the dull father-son-must-be-reunited story at the core of Nemo that threatens to make this just another cartoon."
    },
    {
      "text": "The latest flood of wizardry from Pixar, whose productions, from Toy Story onward, have lent an indispensable vigor and wit to the sagging art of mainstream animation."
    },
    {
      "text": "Finding Nemo is laced with smart humor and clever gags, and buoyed by another cheery story of mismatched buddies: a pair of fish voiced by Albert Brooks and Ellen DeGeneres."
    },
    {
      "text": "Like Pixar's previous films, Finding Nemo mines humor from the oddities of an unknown world but stays grounded in a familiar one, finding recognizable elements of heartbreak and happiness amid the ink-jetting octopi and irritable flounders."
    },
    {
      "text": "While Mr. Brooks is very funny, Ms. DeGeneres gives a bravura comic performance, as well as a touching one."
    },
    {
      "text": "The animation is so sleek and the action so perfectly paced that even the sharpest viewer could be forgiven for overlooking some unimportant lapses in internal logic."
    },
    {
      "text": "It looks more stunning than ever."
    },
    {
      "text": "An Easter treat."
    },
    {
      "text": "This is a classic - bring on the sequel!"
    },
    {
      "text": "Every frond and fin pokes out at you."
    },
    {
      "text": "Re-releasing Nemo in 3D gives a whole new generation the chance to enjoy it in cinemas for the first time - as well as adding extra depth to the wonderful scenes from the ocean deep."
    },
    {
      "text": "Though some scary parts may make the very young fret unduly, the film also puts forward some thoughtful messages for both children and their parents. [Blu-ray 3D]"
    },
    {
      "text": "Detail is what holds your attention from frame to frame: the panorama of soft and hard corals, the different textured sea bottoms, the undulating seaweed, and the schooling sardines that look flashy and real as can be."
    },
    {
      "text": "I don't exactly worship Pixar, but \"Finding Nemo\" is truly a great film."
    },
    {
      "text": "Gill is Platoon's Sgt. Elias if he'd survived Sgt. Barnes' treachery and returned to civilian life weary and hard-bitten from his experiences. And also a fish."
    },
    {
      "text": "Finding Nemo 3D is a quality post-conversion experience that successfully enhances the 2003 film's original standout visuals."
    },
    {
      "text": "The 3D gives the images a little more depth but they already had heft and weight. The 3D is a money-making gimmick, nothing more."
    },
    {
      "text": "A great blend of storytelling and technology."
    },
    {
      "text": "It's bright, it's beautiful and it hasn't aged a day. So why, then, do we need to see it in 3-D?"
    },
    {
      "text": "A rare example of a movie that not only survives its 3-D conversion but benefits from it"
    },
    {
      "text": "It was as funny as I remember and brilliant because it is subtle. It just knocks it out of the park. I love everything about this movie, one of my favorite Pixar movies of all time, 5/5 Schmoes. The new sound/3D adds to the greatness that is Nemo."
    },
    {
      "text": "If you're fishing for fun in an ocean of movie mediocrity, grab the kids or the grandkids, fork out a few extra bucks and see this one in three-dimensions."
    },
    {
      "text": "It's a great movie, so much fun, an acheivement that should be enjoyed by children of all ages and worth seeing it in 3D."
    },
    {
      "text": "Sea-worthy w/enhanced visual lure and rich, humorous characters set in a double narrative; this 3D revisit allows us to fall overboard all over again."
    },
    {
      "text": "If ever there was a film that wasn't broke, this is it. So naturally they converted it into 3D for a special re-release this weekend. (Stupid irony.)"
    },
    {
      "text": "A timeless delight."
    },
    {
      "text": "I believe my sensitivity to certain creative choices of the picture has dulled some, while age has opened my eyes to its complex relationships and tireless sense of exploration."
    },
    {
      "text": "When the blunt head of Bruce the shark slams into the screen like a hammer, everyone -- adults included -- gasps"
    },
    {
      "text": "At its best, the added dimension is merely harmless, making the movie blurry enough that you need special glasses to make it sharp again."
    },
    {
      "text": "[VIDEO ESSAY] Disney/Pixar's 3D upgrade of its classic animated children's movie - using the expensive Xpand 3D format - has the duel effect of darkening the film's vibrant colors while adding considerable depth to the screen."
    },
    {
      "text": "If the Pixar vault was on fire and they could only save one film, it'd be this eminently re-watchable modern fairy tale...Looks all the more stunning with this state-of-the-art 3D retro-fit."
    },
    {
      "text": "I could write an entire dissertation on how much I love this movie."
    },
    {
      "text": "Not worth the trip to the cinema but is worth every cent as a home entertainment blu ray purchase."
    },
    {
      "text": "Sweet father-son tale with some very scary moments."
    },
    {
      "text": "Tremendously well-made, marshaling the techniques of live-action filmmaking better than any CGI feature up to that point ever had."
    },
    {
      "text": "In this seamless blending of technical brilliance and storytelling verve, the Pixar team has made something as marvelously soulful and innately, fluidly American as jazz."
    },
    {
      "text": "A dynamic and entertaining film for all ages..."
    },
    {
      "text": "Wonderful writing generates several layers of humour -- from the innocent joys of childish fun to more complex comedy, but never at anyone's (or any fish's) cruel expense -- as well as an engaging dramatic plot."
    },
    {
      "text": "Nemo, with its ravishing underwater fantasia, manages to trump the design glamour of earlier Pixar films."
    },
    {
      "text": "Very clever and imaginative indeed."
    },
    {
      "text": "[An] aquatic joyride."
    },
    {
      "text": "A visual marvel, every frame packed to the gills with clever details, Finding Nemo is the best big-studio release so far this year."
    },
    {
      "text": "Terrific-looking and sweet, it's certainly up to the superior standard Pixar has set for prime family entertainment."
    },
    {
      "text": "I was swept up in its dazzling stream of rainbow corals, amused by the stoner turtles going with the flow, sharks battling their own regressive instincts and DeGeneres' scatterbrained Dory."
    },
    {
      "text": "a good family film"
    },
    {
      "text": "Magical. God knows how they do it, but Pixar is easily the most consistent, most intelligent movie shop in Hollywood."
    },
    {
      "text": "A joyous delight for audiences of all ages."
    },
    {
      "text": "Enthralling, and gorgeous, from start to finish."
    },
    {
      "text": "Brilliantly conceived Pixar movie is loaded with family values, albeit the salt water variety."
    },
    {
      "text": "A fish tale the whole family can enjoy."
    },
    {
      "text": "The creators are cracking themselves up first, the way the Warner Bros. animators did in Bugs Bunny's golden age; it works for anyone with a sense of humor."
    },
    {
      "text": "Finding Nemo is a triumph, with a different, richer feel than any previous Pixar film. Aided by a smart, evocative score by Thomas Newman, the story is funny, moving and completely engrossing."
    },
    {
      "text": "Fantastic animation, a great cast, and hilarious laughs make Finding Nemo a must see movie for the summer."
    },
    {
      "text": "'... excellent storytelling with superb, eye-popping animation...'"
    },
    {
      "text": "Click to read review"
    },
    {
      "text": "It's all tremendously entertaining stuff, with oodles of wonderful detail and superb direction by Andrew Stanton."
    },
    {
      "text": "As the voice of the forgetful Dory, Ellen DeGeneres shows us how Memento could have been a comedy in this entertaining and visually stunning family flick."
    },
    {
      "text": "Each obstacle is a fabulous set piece with not-always-obvious lessons to be learned and smart, original humor."
    },
    {
      "text": "If it's not quite a tidal wave of entertainment, it's a welcome dip in the ocean nonetheless."
    },
    {
      "text": "Debutant writer-director Andrew Stanton, crams the feel-good fable with wondrous visuals while ensuring that the life lessons are schmaltz-free."
    },
    {
      "text": "It's all beautiful, all right. But before long I began to feel beaten against the rocks of that beauty -- Finding Nemo smacks of looky-what-I-can-do virtuosity, and after the first 10 minutes or so, it's exhausting."
    },
    {
      "text": "It's a whale of a tale that's well worth catching. Even if fish isn't usually your dish."
    },
    {
      "text": "The best father-son story in all of Hollywood animation, and maybe animation generally...exploits the potential of computer animation like no film before it and few films after it."
    },
    {
      "text": "This stonking film is a perfect example of Total Cinema, combining tragedy, excitement and humour, all wrapped up in one amazing looking package."
    },
    {
      "text": "Enchanting, heartwarming and terrifically made."
    },
    {
      "text": "Finding Nemo may be the most beautiful and detailed animated movie ever made."
    },
    {
      "text": "'Like a road movie, only wetter.'"
    },
    {
      "text": "Ellen Degenerous and Albert Brooks lend their voices to the craziest fish ever to talk on screen, and Dame Edna (Barry Humphries) performs a turn as a vegetarian shark!"
    },
    {
      "text": "Fin-tastic -- hilarious, moving and beautiful to look at, this is another instant classic."
    },
    {
      "text": "Every single frame of the film is rendered with such detail and warmth that even without a compelling plot it would be a joy to watch."
    },
    {
      "text": "This is not the first time Pixar's animators have been engaged with the natural world, but they've never been as deeply immersed as they are in this undersea Fantasia."
    },
    {
      "text": "Is this kid's stuff? That's a complicated question but the answer is a thing of beauty that will have children enchanted hook, line and sinker."
    },
    {
      "text": "There are so many subtle jokes, or little bits of insight into these fish's minds, it proves yet again that Pixar strives to make a complete experience instead of just 'some cool-looking graphics.'"
    },
    {
      "text": "There are 3.7 trillion ideas in Hollywood for an animated film; Disney and Pixar have found another one audiences won't be able to resist."
    },
    {
      "text": "Finding Nemo will please audiences of all ages with its raucous spirit and outrageous moments."
    },
    {
      "text": "There is beauty and brilliance in every frame."
    },
    {
      "text": "La originalidad de sus universos y personajes, lo disparatado y divertido de sus situaciones, la inteligencia de muchos dilogos, y la reconocible humanidad con que los animadores visten a sus criaturas, son los principales ingredientes que contribuyen a"
    },
    {
      "text": "It was one of those instances where I found myself recounting out loud the funniest moments to someone who just saw the movie with me."
    },
    {
      "text": "A expressividade dos personagens  tamanha que os dilogos tornam-se at mesmo dispensveis."
    },
    {
      "text": "For obvious reasons (no toys!), this feels like a much more grown-up film than previous Disney-Pixar movies."
    },
    {
      "text": "Crafted with such care that the story, characters and colours positively pulsate."
    },
    {
      "text": "'Entraable, divertida y profundamente humana, es una obra de arte imprescindible.'"
    },
    {
      "text": "You know exactly how this one ends; yet getting there is such an enjoyable delight."
    },
    {
      "text": "Beats any Disney animated film through 1960 and probably a good deal later."
    },
    {
      "text": "Finding Nemo might just be [Pixar's] best effort yet."
    },
    {
      "text": "This movie reaffirmed my love for the cinema."
    },
    {
      "text": "It's the brilliant animation and witty script that lift this film from retread material to sublime entertainment for kids and - equally - their parents."
    },
    {
      "text": "Pixar's masterpiece. It feels dizzy with color and drunk on its own otherworldly creation. Sure, it derives most of its splendor from what actually exists on our ocean floors, but that doesn't make it any less wondrous."
    },
    {
      "text": "Each frame of Finding Nemo is a visual delight."
    },
    {
      "text": "[Once again Pixar] ensures that the label 'family film' isn't 'a movie only your tots will enjoy' but something that actually is for everyone."
    },
    {
      "text": "\"Finding Nemo\" was funny and a little scary, at least for the little tykes."
    },
    {
      "text": "The amazing thing about Pixar is that in every film, I go in with incredibly high, unrealistic expectations, & they always excel beyond them."
    },
    {
      "text": "Simply the most entertaining movie you'll see all year."
    },
    {
      "text": "I don't know how the staff of Pixar does it, but this is their fifth overwhelming achievement in a row."
    },
    {
      "text": "A clown fish without a punchline, a blue tang without a memory, a scarred prison hero fish, and a stoner dude sea turtle make for this summer's tallest fish tale."
    },
    {
      "text": "...the movie is chock-full of color and fun, ambitiously gliding through one vibrant scene after another as it reveals an engaging and beautiful world..."
    },
    {
      "text": "Like Toy Story, A Bug's Life, and Monster's Inc., it features amazing animation, great characters, sharp wit, smart humor, and a story both timeless and timely."
    },
    {
      "text": "An enchanting animated feature."
    },
    {
      "text": "Latest computer-animated offering from Pixar is a giant leap forward visually, even if the story treads familiar ground ... uh, water."
    },
    {
      "text": "Although Finding Nemo reaches a new watermark in animation, it doesn't have the endearing characters or driving plot of Toy Story and Monsters, Inc. But then, classics are tough acts to follow."
    },
    {
      "text": "...Finding Nemo\" captures the audience with vastly touching characters the audience really cares about."
    },
    {
      "text": "A thing of beauty, hugely entertaining and way cool."
    },
    {
      "text": "The artwork is gorgeous and the characters are strong."
    },
    {
      "text": "Another extraordinary effort from the unbeatable Disney/Pixar team."
    },
    {
      "text": "The animation team gives weight and depth to the sea itself, filling it with specks of life and creating a sense of movement with currents and bubbles."
    },
    {
      "text": "The junior set will most definitely enjoy the jokes and the yarn, but it will be the adults who learn the biggest lessons this time around."
    },
    {
      "text": "The peerless partnership of Disney and Pixar is officially five-for-five."
    },
    {
      "text": "Pixar respects both kids and parents-which cannot be said for certain big green ogres of animation."
    },
    {
      "text": "Several scenes are scarier than Edward Norton's mustache in \"The Italian Job.\""
    },
    {
      "text": "The latest feature from Pixar Animation is another splendid, eye-filling installment in the studio's unbroken string of classics."
    },
    {
      "text": "More than just high calorie viscera, Finding Nemo is the best American comedy in two years."
    },
    {
      "text": "Finding Nemo is undoubtedly another jewel in the Pixar crown and another example of the Disney conglomerate's ability to ride that company's coattails to success."
    },
    {
      "text": "\"Finding Nemo\" is a whale of a treat."
    },
    {
      "text": "Finding Nemo captures a level of wonderment and dark sentiment unmatched even by the previous great works of Pixar. Walt Disney's throne is very much at risk."
    },
    {
      "text": "Winning, invigorating entertainment for the entire family -- technically brilliant, attentive to detail, and precisely tuned between story and character."
    },
    {
      "text": "Proof that Pixar is the Babe Ruth of animation. Still batting a thousand."
    },
    {
      "text": "Finding Nemo is terrific entertainment."
    },
    {
      "text": ". . . the computer animation reimaginings of the undersea orgies of color orchestrated by nature are mind-blowing."
    },
    {
      "text": "C'mon, it's Pixar. Would you expect anything less than perfection?"
    },
    {
      "text": "Visually stunning but dragged down somewhat by insipid dialogue."
    },
    {
      "text": "There's real heart in this movie without needing lots of superficial whiz-bang stuff."
    },
    {
      "text": "Continually floods the viewer with more extraordinary sensory input than anything previously."
    },
    {
      "text": "Colorful and entertaining for kids and witty enough to engage adults."
    },
    {
      "text": "I have never been to Australia, but I just can't imagine scenery more beautiful."
    },
    {
      "text": "Fast, funny and brackisly beautiful."
    },
    {
      "text": "If Pixar was fishing for another big catch in their stable of entertaining hits, Nemo is the prized filmmaking flounder that takes the absolute bait."
    },
    {
      "text": "The plot is delightful, the animation spectacular ... the colors gorgeous, the message positive and the score by Thomas Newman fitting."
    },
    {
      "text": "A gem of a movie, and exactly what we expect from our friends at Pixar."
    },
    {
      "text": "It turns out that Pixar does fish like nobody does fish."
    },
    {
      "text": "Finding Nemo is superlative family entertainment, joyous and alive in a way few films are."
    },
    {
      "text": "..the computer animated imagery is once again exquisite... The bad side, the story line is only pleasant."
    },
    {
      "text": "The computer graphics create a visual world that you would actually see if you dived down 50 feet on a coral reef"
    },
    {
      "text": "With its phenomenal animation and heart-warming story, Finding Nemo is a resounding hit with this daddy-daughter combo."
    },
    {
      "text": "My fondest wish is that Pixar doesn't hire or fire anyone for the next 25 years. What these magicians are capable of is nothing less than pure cinematic gold."
    },
    {
      "text": "A hundred different little moments constantly impress either with their use of movement and light or their use of stillness and darkness."
    },
    {
      "text": "far more sophisticated and ambitious than what typically passes for 'family entertainment.' ...manages to be extremely funny, thrilling and sometimes a little scary as well."
    },
    {
      "text": "As notable for its well-crafted story as it is for its breathtaking animation."
    },
    {
      "text": "A captivating and richly resonant aquatic fable, with characters whose gills and fins belie their deliciously human (that is, flawed) personalities."
    },
    {
      "text": "Finding Nemo will engross kids with its absorbing story, brightly drawn characters and lively action, and grown-ups will be equally entertained by the film's subtle humor and the sophistication of its visuals."
    },
    {
      "text": "The visuals pop, the fish emote and the ocean comes alive. That's in the first two minutes. After that, they do some really cool stuff."
    },
    {
      "text": "In not just a crowd-grabber but an instant classic, Albert Brooks achieves a new height vocally as Marlin, the dad."
    },
    {
      "text": "DeGeneres does vocal duties by which all future voiceovers and dubs will be judged."
    },
    {
      "text": "Strikes the perfect balance between the charm and childlike innocence of Disney animation and the cutting-edge humor and hipness of the old Warner Brothers cartoons."
    },
    {
      "text": "On its visual elements alone, Finding Nemo could get almost any kid started on a love of nature -- even if us older specimens know that it's a deep understanding of human nature that keeps the whole thing swimming."
    },
    {
      "text": "More familiar in its story line and characters than previous Pixar films, it's nevertheless stuffed with wit, energy, charm and clever touches."
    },
    {
      "text": "A captivating little adventure that gives its animated characters as much heart as personality and that's a heaping helping in both cases."
    },
    {
      "text": "PIxar's fifth feature-length film continues an uninterrupted string of winners; and from a visual standpoint, it's the studio's finest effort."
    },
    {
      "text": "Even though Finding Nemo isn't Pixar's best, this animated comedy-adventure is still more imaginative and more clever in any five of its 100 minutes than most films manage in a full 90 minutes... or 120, for that matter."
    },
    {
      "text": "An exquisitely touching saga about a father tracking down his lost son."
    },
    {
      "text": "One of those rare movies where I wanted to sit in the front row and let the images wash out to the edges of my field of vision."
    },
    {
      "text": "Finding Nemo isn't quite up there with the company's finest work -- there's finally a sense of formula setting in -- but it's hands down the best family film since Monsters, Inc."
    },
    {
      "text": "For a computer-generated cartoon to provoke laughs, thrills and a few tears, that's not just a great movie -- that's perfection in pixels."
    },
    {
      "text": "What's unique and joyous is that it creates a whirl of slapstick and sentiment all its own, in an environment so otherworldly and beautiful that leaving the theater will give you the bends."
    },
    {
      "text": "Absolutely beautiful to look at, even when it has a bad case of the cutes."
    },
    {
      "text": "I really can't remember an animated feature in which the voice work sounded so accomplished, redolent with emotional subtleties and crack comic timing."
    },
    {
      "text": "A superb animated film."
    },
    {
      "text": "A vivid charmer of a movie that makes a welcome addition to the growing gallery of computer-generated animated features."
    },
    {
      "text": "Add water and you have an instant Disney/Pixar classic."
    },
    {
      "text": "Pixar is so consistent that reviews of their films basically write themselves. Finding Nemo is greatness!"
    },
    {
      "text": "Just when you thought they couldn't possibly do it again, the guys at Pixar bat it out of the park with Finding Nemo."
    },
    {
      "text": "What a catch - this whopper of a fish tale takes you beyond the sea."
    },
    {
      "text": "A gem, popping with cool tropical colors and wondrous sea creatures."
    },
    {
      "text": "The moment all the gorgeously rendered inhabitants of this beautiful undersea realm open their mouths, they sound surprisingly, and rather depressingly, human."
    },
    {
      "text": "One of the strongest releases from Disney in years, thanks to the work of Andrew Stanton, possibly one of the most successful directors you've never heard of."
    },
    {
      "text": "Enchanting; written with an effortless blend of sweetness and silliness, and animated with such rainbow-hued beauty, you may find yourself wanting to freeze-frame it."
    },
    {
      "text": "A near perfect example of movie magic that will appeal to viewers of all ages."
    },
    {
      "text": "It's business as usual -- the usual being stunning visuals, a charming story, and a dab of emotional resonance thrown in for good measure."
    },
    {
      "text": "Constantly delights and refreshes the eye -- it's a summer vacation in itself."
    },
    {
      "text": "A dazzling, computer-animated fish tale with a funny, touching script and wonderful voice performances that make it an unqualified treat for all ages."
    },
    {
      "text": "Once again, the team at Pixar proves that the freshest, most entertaining films coming out of Hollywood today are the animated kind."
    },
    {
      "text": "As with all of Pixar's earlier efforts, the animation in this movie is superb. They just keep getting better."
    },
    {
      "text": "A simple test of humanity: If you don't laugh aloud while watching it, you've got a battery not a heart."
    },
    {
      "text": "The creatures in Finding Nemo are more real than some flesh and blood actors."
    },
    {
      "text": "Those Pixar strengths -- story, humor, characters, and art ... shine through, more dependable than rising of the ocean tides."
    },
    {
      "text": "Saying that Finding Nemo is Pixar's weakest effort to date is like a starving man telling you the third piece of pizza you've given him wasn't as good as the first."
    },
    {
      "text": "Isn't quite as clever and wonderful as we've come to expect. Even as such, it remains pretty clever and wonderful."
    },
    {
      "text": "Lives up to Pixar's high standards for wildly creative visuals, clever comedy, solid characters and an involving story."
    },
    {
      "text": "Basically another winner, though it can't quite muster the kind of emotional tug that appeals to all generations and made several of the earlier Pixar films such instant classics."
    },
    {
      "text": "Pixar has done it again."
    },
    {
      "text": "Treats family audiences to a sweet, resonant story and breathtaking visuals."
    },
    {
      "text": "As we now expect from Pixar, even the supporting fish in \"Finding Nemo\" are more developed as characters than any human in the Mission: Impossible movies."
    },
    {
      "text": "So advanced - with lifelike motion and imagination-tingling artwork stroked with a silicon paintbrush - that it makes its predecessors come off as crude, ancient scrawlings on a cave wall."
    },
    {
      "text": "...a parable for parents terrified at the thought of preschool."
    },
    {
      "text": "Rarely matches the emotional depth or richly textured worlds of predecessors Monsters, Inc. and A Bug's Life, but it has a sly sense of humor and evocative voice acting."
    },
    {
      "text": "Pixar heads under the sea and finds subject matter that couldn't be more perfectly suited to its vivid style of computer animation."
    },
    {
      "text": "There may be plenty of fish in the sea (for now, anyway), but few films can manipulate you like Finding Nemo and have you not mind."
    },
    {
      "text": "Visual imagination and sophisticated wit raise Finding Nemo to a level just below the peaks of Pixar's Toy Story movies and Monsters, Inc.."
    },
    {
      "text": "Erupts with sea creatures that showcase Stanton and company's gift for character and peerless eye for skewering contemporary culture."
    },
    {
      "text": "A fish story that hooks you from the opening scene."
    },
    {
      "text": "Delivers with a colorful, lush and witty world under the sea."
    },
    {
      "text": "The best animated underwater picture since The Little Mermaid."
    },
    {
      "text": "As eye-popping as Nemo's peepers and as eccentric as this little fish with asymmetrical fins."
    },
    {
      "text": "Parental anxiety may not be the kind of stuff children's films are usually made of, but this perfectly enchanting movie knows how to cater to its kiddie audience without condescending to them."
    },
    {
      "text": "Pixar's employees, masters of computer-generated animation, capture the look of the ocean like no artists before."
    },
    {
      "text": "There wasn't one element I didn't love about this captivating movie."
    },
    {
      "text": "Fish, schmish. This is a movie about humanity, and I doubt if we'll see a more compelling father/son relationship this year."
    },
    {
      "text": "Spectacular visuals, non-stop laughs and action -- plus a PC message. That's some package, no?"
    },
    {
      "text": "Pixar's super genius continues to flow with no ebb in sight."
    },
    {
      "text": "Lives up to the proud, relatively new tradition of Monsters, Inc., A Bug's Life and the Toy Story films."
    },
    {
      "text": "The underwater backdrops take your breath away. No, really. They're so lifelike, you almost feel like holding your breath while watching."
    },
    {
      "text": "Proves that even when Pixar is not at the top of its game, it still produces better animation than some of its competitors on their best days."
    },
    {
      "text": "As gorgeous a film as Disney's ever put out, with astonishing qualities of light, movement, surface and color at the service of the best professional imaginations money can buy."
    },
    {
      "text": "A treasure trove of visual splendor."
    },
    {
      "text": "You connect to these sea creatures as you rarely do with humans in big-screen adventures. The result: a true sunken treasure."
    },
    {
      "text": "It's full of bright visuals, inventive animation and enough cute characters to fill, well, an ocean."
    },
    {
      "text": "Finding Nemo is a witty and epic adventure packed in unlikely wrapping."
    },
    {
      "text": "Is Pixar capable of making a bad film? Whether a serendipitous confluence of talent or. . .some divine being at work in our world, either way, the answer, I think, must be no."
    },
    {
      "text": "There's nothing fishy about its success. It's got intriguing anthropomorphic characters, a compelling story and Pixar's fanciful computer-generated animation. It's fun, bubbly, fantastic. Sea it!"
    },
    {
      "text": "You won't need a map to unearth the treasures buried in Nemo."
    },
    {
      "text": "Thanks to a solid script by director Andrew Stanton (a Pixar regular), many of the human actors who give voices to the computer-generated fish wind up becoming more engaging than when they appear in flesh-and-blood."
    },
    {
      "text": "Unlike the greatest children's films, I never once forgot who the target market for Finding Nemo really was."
    },
    {
      "text": "The concept of a fish with short-term memory loss sounded dubiously annoying, but DeGeneres just swims off with it"
    },
    {
      "text": "It's the give-and-take between DeGeneres and Brooks that gives the saga its big heart."
    },
    {
      "text": "Children and adults alike should be enchanted...as quietly charming, cheekily amusing a family feature as you're likely to encounter this summer."
    },
    {
      "text": "... with Father's Day just a few weeks away...'Nemo' swims off with hearts of all ages."
    },
    {
      "text": "With the release of Finding Nemo, the creative team at Pixar has redefined what is known as being 'on a role.'"
    },
    {
      "text": "Further proof that the folks at Pixar are ceaselessly, unflaggingly more clever and imaginative than anyone else working in big-budget feature animation."
    },
    {
      "text": "A rousing underwater adventure set in the Great Barrier Reef that celebrates youthful independence and lances the illusion that parents can make the world safe for their children."
    },
    {
      "text": "It's an ocean of eye candy that tastes fresh even in this ADD-addled era of SpongeBob SquarePants."
    },
    {
      "text": "Yet another quantum leap for the Pixar folk."
    },
    {
      "text": "I can't say that this movie was as exciting, original or captivating as many of its predecessors and would recommend it more to the toddlers."
    },
    {
      "text": "A great film for its timeliness, and a greater film for its timelessness."
    },
    {
      "text": "Pixar has interlaced its energetic storyline with the moody strains of a classic Thomas Newman score, lending an element of darkness that ingeniously penetrates the perpetual submarine light."
    },
    {
      "text": "Finding Nemo is cute and clever, but it's no Toy Story, A Bug's Life or Monsters, Inc."
    },
    {
      "text": "Creates a very high benchmark for this summer's other films to strive to best, and I don't think any of them will."
    },
    {
      "text": "Could have been stronger, but it's still fun and has good heart. Ditto to what Steve Rhodes said."
    },
    {
      "text": "Another masterful piece of family entertainment from Pixar."
    },
    {
      "text": "A wonderfully engaging entertainment that is a visual masterpiece as well as a darn good tale with loads of humour and excitement to appeal to the child in all of us."
    },
    {
      "text": "Finding Nemo merely transplants human suburban anxiety to an underwater realm."
    },
    {
      "text": "Another terrific Pixar pic for all generations."
    },
    {
      "text": "Finding Nemo is like a great foreign film, its visual and energy having such clarity that subtitles (or words or stories) are almost unnecessary."
    },
    {
      "text": "No doubt, Finding Nemo marks yet another huge advance in the world of animation. The technical term for these advances, in layman's language, is \"Holy mackerel!\""
    }
  ],
  "release_year": 2003,
  "duration": 100,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "synopsis": "Marlin (Albert Brooks), a clown fish, is overly cautious with his son, Nemo (Alexander Gould), who has a foreshortened fin. When Nemo swims too close to the surface to prove himself, he is caught by a diver, and horrified Marlin must set out to find him. A blue reef fish named Dory (Ellen DeGeneres) -- who has a really short memory -- joins Marlin and complicates the encounters with sharks, jellyfish, and a host of ocean dangers. Meanwhile, Nemo plots his escape from a dentist's fish tank.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/eHuGQ10FUzK1mdOY69wF5pGgEf5.jpg"
}