{
  "movie_name": "Five Feet Apart",
  "movie_id": "five_feet_apart",
  "total_reviews": 130,
  "reviews": [
    {
      "text": "There’s some quality production design, and the occasional amiable scene. But as a whole, the movie is dull and saccharine, despite the efforts of its magnetic lead actors."
    },
    {
      "text": "But that ending. It doesn’t quite kill the good that comes before it, but it comes mighty close."
    },
    {
      "text": "Five Feet Apart suffers from the same clichés as most of the decade’s YA romantic dramas while having to stomach the manipulation of trivializing an illness that can be terminal."
    },
    {
      "text": "Five Feet Apart uses illness as a plot device to heighten emotions rather than simply allowing compelling characters to tell their own stories."
    },
    {
      "text": "No one in the project can overcome the sick-flick genre's cliches..."
    },
    {
      "text": "Although I appreciate the authenticity the movie wishes to shove down my throat, I wish it gave me something to take away, a moment to save in the filmic moments that reel away in my mind."
    },
    {
      "text": "This young-adult tear-jerker is bogged down by cliche and a lack of vision, buoyed only by a fresh performance from lead actress Haley Lu Richardson and an honest conversation about the loneliness of disease."
    },
    {
      "text": "The predictability of its plot and sweet but adolescent love story may infect the older audience members with chronic eye roll syndrome."
    },
    {
      "text": "There's a sincerity here that undoes many of its excesses, thanks largely to the grounded chemistry of its leads."
    },
    {
      "text": "The film never really delivers unless you're under 13 years old due to the tone of artificiality overlaying the entire story."
    },
    {
      "text": "I blame the writing for this colossal miscalculation, but I'll forever associate one of the most gifted young actors working today with this schmaltzy nonsense; she and the other actors raise the material to a degree, but that's about as good as it gets."
    },
    {
      "text": "Commendably highlights the issues of Cystic Fibrosis sufferers, you'll learn a thing or two about this illness as well as be sappily charmed."
    },
    {
      "text": "I hated this movie."
    },
    {
      "text": "It wasn't an enjoyable watch."
    },
    {
      "text": "Ask any high school teacher - or, for that matter, any high schooler - and they'll tell you the surest way to get two teenagers to fall in love is to tell them they can't see each other."
    },
    {
      "text": "There's a million books like this and a million movies like this, where people are beautiful -- but they're sick!"
    },
    {
      "text": "Despite its best efforts including those from Haley Lu Richardson with a brilliant performance, the film inevitably begins to sink. [Full Review in Spanish]"
    },
    {
      "text": "Ultimately, Five Feet Apart was peak emotional manipulation...but, like, it worked."
    },
    {
      "text": "If a little too much of the dialogue sounds like a teenage inspirational instagram post, then at least the film knows its target audience"
    },
    {
      "text": "There are parts that are very Hallmark movie and schmaltzy. And yet you do end up being swept along with the emotions in it because the acting is so note-perfect."
    },
    {
      "text": "If you're expecting anything remotely deep or intelligent, you best stay clear as this sick-lit, doomed romancer delights in the bittersweet to the point of overindulgence"
    },
    {
      "text": "The latest terminal teenager love story, keeps it's distance from originality."
    },
    {
      "text": "Directed with manipulative precision by Justin Baldoni, the film fashions its doomed romance drama with an emphasis on hope and how being denied a future can serve to strengthen one's resolve to have one."
    },
    {
      "text": "The problem with Five Feet Apart is that it chooses to focus on the weakest narrative - a dull, sappy romance that is heavy on melodrama and light on realism."
    },
    {
      "text": "Sure, it's sappy and maybe the storyline is overplayed, but this film hits you in that squishy place where your emotions live."
    },
    {
      "text": "A nauseatingly shallow look at a life-shortening genetic disorder and never rises above being a banal teen drama.v"
    },
    {
      "text": "It becomes clear early on that Five Feet Apart benefits substantially from the almost unreasonably charismatic work of its two stars..."
    },
    {
      "text": "[A] treacly teen romancer... has all the compelling poignancy of a broken charm bracelet...wrapped around in the sweetness and sacrificial sorrow of its corny convictions"
    },
    {
      "text": "It may not be as successful (or good) as The Fault in Our Stars, but this still delivers a decent movie through all of the convention and its formulaic narrative."
    },
    {
      "text": "The plot is believable - right up to the heart-in-the-mouth turns near the end - and the dialogue sounds real. That is a good start in any movie, but in this case it powers on from there because of the A-grade performances of the two young leads."
    },
    {
      "text": "The spiritual takeaway here, for our modern understanding, is that if you could never touch the one(s) you love, the pain of that would take over your whole life. So have gratitude that you can just reach out any time you like, and touch your loved ones."
    },
    {
      "text": "Five Feet Apart feels like a movie that's somewhat out of place, searching for an audience that won't quite be found."
    },
    {
      "text": "Throw in a so hip-it-hurts soundtrack and Five Feet has enough charisma and chutzpah to set it apart from your bog-standard, manipulative disease-of-the-week drama that now seems to dominate streaming services."
    },
    {
      "text": "Five Feet Apart manages to be engaging due to its performances, and is more than likely to pull on heartstrings in some unexpected places."
    },
    {
      "text": "Richardson and Sprouse are delightful and go a long way to holding together this slightly drawn out romantic drama; their chemistry covering much of the clichés and predictability."
    },
    {
      "text": "When push comes to shove, Five Feet Apart wants its audience weeping ASAP, and will stop at nothing to get eyeballs leaking."
    },
    {
      "text": "The film successfully sucks its audience into the insular hothouse of a long-term hospital ward and the drama and tension inherent in the characters' plight is sustained by a strong and empathetic performance from Richardson."
    },
    {
      "text": "Five Feet Apart is a film for the tumblr generation. It's just a shame it's seven or eight years late."
    },
    {
      "text": "Sprouse proves he's more than a child star while Baldoni, the novice director, rushed the emotional scenes but still displayed a rare ability to be sweet without being syrupy."
    },
    {
      "text": "Sprouse and Richardson are proven heavyweights in the young-adult pocket of Hollywood, but this soft-hearted teen romance spreads on sugary sentiment too thickly to leave a lasting message."
    },
    {
      "text": "The contrast between human love and the hospital environment is what seduced me most of all. For those people who know what it's like- as a patient or visitor -Five Feet Apart does a tender job of articulating the unique experience of long term ward life."
    },
    {
      "text": "I cried. I was moved by it... the film was done in a manner that seemed good-hearted."
    },
    {
      "text": "Five Feet Apart is clearly aspiring to reach the heights of recent projects like John Greene's The Fault in Our Stars, but these kind of narrative stumbles keep it grounded."
    },
    {
      "text": "The film's biggest enemy is that this type of fateful romances burdened by the latent presence of death already feel worn out. [Full Review in Spanish]"
    },
    {
      "text": "Richardson and Sprouse attack their roles with gusto, never patronising the material."
    },
    {
      "text": "The subject matter won't suit all tastes, but lovers of weepies of the first water will lap it up; there won't be a dry eye in the house."
    },
    {
      "text": "While the film is doubtless well intentioned, there is no forgiving the atrocious dialogue, tacky ballads, and cheesy exploitation of the situation..."
    },
    {
      "text": "[Richardson] surely realises, as Fault's Shailene Woodley did before her, that this is the kind of marshmallow martyrdom that has to be briskly worked through before they let you at the grownup scripts."
    },
    {
      "text": "The performances almost make the journey bearable."
    },
    {
      "text": "Perhaps the fault lies not in our stars, but in our shameless need for a sappy ending."
    },
    {
      "text": "A flawed and deeply contrived story about an impossible love which adds almost nothing to the current trend for Sick-Lit adaptations."
    },
    {
      "text": "Well acted... Hews pretty closely to reality while checking off the boxes for what a weepy teen romance is supposed to look like."
    },
    {
      "text": "[Five Feet Apart] is so formulaic, so boilerplate, that it almost feels algorithmically-generated - a product of maudlin mathematics."
    },
    {
      "text": "Five Feet Apart is basically the bloodless horror flick nobody asked for."
    },
    {
      "text": "It's the best tear-jerker in a long time; one box of tissues might not be enough. On a deeper level, it earns some of that emotion through a story based on a real dilemma."
    },
    {
      "text": "Unfortunately, Haley Lu Richardson's charm and Cole Sprouse's presence aren't enough to distract from the accumulation of cliches. [Full Review in Spanish]"
    },
    {
      "text": "Haley Lu Richardson and Cole Sprouse turn what could have been a melodramatic teen flick into a compelling and emotional drama."
    },
    {
      "text": "There are many baffling things about the new teen weepie Five Feet Apart, but the most mind-boggling is how little it resembles itself in its unintentionally hilarious third act, when it completely comes apart at the seams."
    },
    {
      "text": "The plot twists make cystic fibrosis feel like more of a device to get the tears rolling than an altruistic focus. It's too bad, because Five Feet Apart\" has enough going for it to suggest that it might have been better than the usual tearjerker routine."
    },
    {
      "text": "Its heart is in the right place, but its brain runs from it..."
    },
    {
      "text": "Rises far above terminally ill teen clichés for much of its running time thanks to a smart script and touching performances from Cole Sprouse, Moises Arias, and, most notably, lead actress Haley Lu Richardson."
    },
    {
      "text": "Five Feet Apart is by first-time screenwriters Mikki Daughtry and Tobias Iaconis, and the lack of experience shows."
    },
    {
      "text": "I found the movie enjoyable partly because of the actors."
    },
    {
      "text": "Sprouse and Richardson say more with their body language and eyes than any dialogue would allow them. They anchor this young adult weepie in reality."
    },
    {
      "text": "'Five Feet Apart' is a ridiculous melodrama that demands you leave your brain at home."
    },
    {
      "text": "Like a heart monitor's beep, it fades into the background quickly."
    },
    {
      "text": "Jaded adults will not be overly impressed with the film's manipulation, but teenage girls will flock to see it, keeping Kleenex in business. They could make worse choices."
    },
    {
      "text": "Strong performances from Haley Lu Richardson and Cole Sprouse can't redeem a plot that encourages sacrifice as love-an idea so many teen-focused romances can't seem to advance past."
    },
    {
      "text": "While mawkishness should not be a prerequisite for the sick-teens-in-love genre, the popularity of the two in concert has likely convinced many filmmakers that the opposite is true."
    },
    {
      "text": "Five Feet Apart gives us a love story with heart. While some of it can be telegraphed, the writers give us insight into cystic fibrosis & Haley Lu Richardson with Cole Sprouse bring enough authenticity making it worth the risk of getting a little closer"
    },
    {
      "text": "What starts as an insightful glimpse into CF and its ramifications turns manipulative and stuffy in the final act."
    },
    {
      "text": "Fans of other teen tearjerkers like The Fault In Our Stars and anything in the Nicholas Sparks oeuvre will find plenty to enjoy here"
    },
    {
      "text": "Despite the standard and seemingly obligatory relationship arc, Richardson and Sprouse make for an engaging and attractive couple. (Full Content Review for Parents - Profanity, Sexual Content, etc. - also Available)"
    },
    {
      "text": "Sparked by a bubbly performance by Haley Lu Richardson , the movie never really conquers the formula that dominates it."
    },
    {
      "text": "Due credit... should be given to Sprouse and particularly Richardson for selling all of these reheated tropes to their full potential."
    },
    {
      "text": "Haley Lu Richardson cements her status as one of the most inordinately talented actresses of her generation."
    },
    {
      "text": "The film never finds the right rhythm to present the passion of the young couple onscreen. [Full Review in Spanish]"
    },
    {
      "text": "...phoney emotions and baloney contrivances..."
    },
    {
      "text": "Offers a solid showcase for its young leads, Haley Lu Richardson and Cole Sprouse, while laboring to flesh out a complete movie."
    },
    {
      "text": "Richardson may be the best thing about this Velveeta-slathered heap of lukewarm cliche, but she is merely a vicarious vehicle for thwarted teenage longing directed at the bad-boy dreamboat heartthrob of countless high-school-girl fantasies."
    },
    {
      "text": "...Richardson is a star-on-the-rise but Five Feet Apart  feels a bit disingenuous and a missed opportunity."
    },
    {
      "text": "The cast makes this maudlin and predictable film version of what has become known as \"sick lit\" appealing."
    },
    {
      "text": "We've seen worse movies of its kind but ultimately \"Five Feet Apart\" will make you wonder: haven't we seen enough?"
    },
    {
      "text": "Five Feet Apart is a heavy-handed and forced romantic drama that may lure in young teens, but is sure to lull adults to sleep."
    },
    {
      "text": "It's hard to hate on a well-intended movie about life and love, but by the end, we're neck-deep in Nicholas Sparks territory, with not a lifeline in sight."
    },
    {
      "text": "A melodrama without any bite to it, Five Feet Apart is clichéd and exploitative."
    },
    {
      "text": "That doesn't dampen the work of Richardson and Sprouse, or the romance at the film's center. \"Five Feet Apart\" works hard for its tears. But it's the honesty of the performances that makes it worth the investment."
    },
    {
      "text": "Apparently, Hollywood has another dire problem on top of everything else: They are running out of dramatic, life-threatening diseases with which to inflict upon fetching teens falling in love."
    },
    {
      "text": "Those seeing the heartfelt \"Five Feet Apart\" may laugh, they may cry, and they might even swoon, sometimes all at the same time."
    },
    {
      "text": "This teen romance can't avoid a crush of convenient calamities before the end credits roll."
    },
    {
      "text": "It is tempting to dismiss this story as 'sick-lit' but director Justin Baldoni balances the compelling specifics of CF with the larger questions we all face."
    },
    {
      "text": "Sprouse and Richardson make for one of the more adorable pairs in recent films. You not only want what's best for them, but believe it can actually happen."
    },
    {
      "text": "Richardson gives a rich performance - she creates an authentic, deglamorized human being."
    },
    {
      "text": "I'm not sure what's more stupid, the final 30 minutes or the outrageously incompetent hospital staff"
    },
    {
      "text": "Richardson can do just about anything, and her performance in \"Five Feet Apart\" demonstrates a new depth to her range. She brings a knowing soulfulness to every aspect of Stella's journey"
    },
    {
      "text": "Where it falters is in some big dramatic gestures...but overall I still enjoyed it. If it sounds like your thing you'll probably like it!"
    },
    {
      "text": "\"Five Feet Apart\" does connect as a something gentle, periodically invested in real feelings of frustration and attraction that sustain when the third act goes haywire with melodrama."
    },
    {
      "text": "While it's tempting to regard the film as the Cystic Fibrosis version of The Fault in Our Stars, the comparison undermines many winning aspects, not least committed performances by its gifted leads and an absolute conviction in itself."
    },
    {
      "text": "Five Feet Apart is a movie you go to for a good, cathartic cry and that's exactly what you'll get."
    },
    {
      "text": "Haley Lu Richardson and Cole Sprouse manage to generate convincing chemistry in challenging roles where they can't touch each other."
    },
    {
      "text": "This movie gets so much right ... that it's a genuine shame the filmmakers stumble so much in the third act."
    },
    {
      "text": "The honesty of the actors and their commitment to each other bails the movie out. They manage to find truth in a highly manipulative situation, and that's something even the least stardust-sprinkled among us can appreciate."
    },
    {
      "text": "Strong acting saves predictable, sentimental love story."
    },
    {
      "text": "\"Five Feet\" is often understated and modest, and very upfront about the hard truths of living with a serious chronic illness. It also features two appealing lead performances. One of those performances is good, the other is truly great."
    },
    {
      "text": "[I]t's Richardson, with whom critics fell in love as the architecturally savvy teen in the indie darling \"Columbus,\" who really shines as Stella, her smile and sass and vulnerability make this often manipulative melodrama feel like a breath of fresh air."
    },
    {
      "text": "Five Feet Apart is not a great film, but it has greatness within its grasp thanks to Haley Lu Richardson."
    },
    {
      "text": "Cutting through the thick curtain of recycled lovey-dovey remarks and the proficiently dull craftsmanship of the production, Richardson's radiant charisma acts as a lifeline."
    },
    {
      "text": "Five Feet Apart is an exhausting experience, one that relies on the shameless manipulation of the audience more often than not."
    },
    {
      "text": "Suitable only for those ready to tear up over soap operas about teens with deadly ailments. Others are advised to skip this weepy hospital visit."
    },
    {
      "text": "Yes, Five Feet Apart is a cliché teenage love story, but Baldoni reminds us why we love them so much."
    },
    {
      "text": "It's just another three-hankie teen weepie, albeit one with the saving grace of another excellent Haley Lu Richardson performance that gooses the film just past serviceable into the realm of slightly better than average."
    },
    {
      "text": "Even amidst the sniffles and tears, there's a sense that the experience could have been more wrenching and emotionally honest had the filmmakers showed a greater trust in their material and audience."
    },
    {
      "text": "There's something a wee bit icky about how cleverly its premise exploits the quirks of a terminal affliction, but there's no way around the fact that this movie has a future beyond its profit margins."
    },
    {
      "text": "This is a film that hinges almost completely on the strengths of the two leads, and they deliver by showing a love that is selfless, true and profound."
    },
    {
      "text": "Beautiful teens fall in love while dying prettily in this year's tragic young romance, one that medical necessity renders refreshingly chaste. Best bit: Star Haley Lu Richardson is genuinely charming."
    },
    {
      "text": "What Five Feet Apart does well is detail the daily drudgery endured by those with CF without ever turning it into a dreary disease-of-the-week movie."
    },
    {
      "text": "while Baldoni's direction of his actors is assured...his inability to rein in the screenplay's more outlandish scenarios and on-the-nose symbolism renders \"Five Feet Apart\" more shamelessly manipulative teen romance than authentic drama."
    },
    {
      "text": "In the film, hardly any fact about cystic fibrosis is raised without being doubly, even triply, underlined for viewers."
    },
    {
      "text": "It's predictable, and over the top, but you kind of knew that going in."
    },
    {
      "text": "First-time feature director Justin Baldoni treats the tidy if increasingly shameless script as sincerely as possible, albeit with as many hackneyed montage sequences as possible."
    },
    {
      "text": "Let's not waste time: This movie is a disaster ... It has nothing at all to say about anything. It is an exercise in unadulterated misery."
    },
    {
      "text": "Five Feet Apart is a well-acted YA romance and provides some welcome representation, but eventually finds itself bogged down in shlocky melodrama."
    },
    {
      "text": "At 116 minutes, \"Five Feet Apart\" is too much of a just-OK thing. All the same, I want to see Haley Lu Richardson's next movie."
    },
    {
      "text": "What starts as a promising film that takes the disease seriously and might even raise awareness about its challenges quickly turns into a romantic melodrama that checks all the familiar boxes."
    },
    {
      "text": "The last act is a supernova of shamelessness. But even then, this weepie is tough to resist entirely."
    },
    {
      "text": "It's a weird little genre, the sick-teen romance. \"Five Feet Apart\" winds up as just a pedestrian entry in it, because it tries way too hard on the melodrama front."
    },
    {
      "text": "In the end... even Richardson and Sprouse can't fully overcome the clumsy mawkishness around them."
    },
    {
      "text": "A first-rate teen romance with engaging characters and appealing stars."
    },
    {
      "text": "The two leads here make the premise plausible and resonant."
    },
    {
      "text": "Richardson gives a star turn every bit as charismatic and assured as the film is formulaic and forgettable, bringing soul, style and nuance to a character that could have easily been a condescending caricature."
    }
  ],
  "release_year": 2019,
  "duration": 116,
  "genres": [
    "Romance",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Seventeen-year-old Stella spends most of her time in the hospital as a cystic fibrosis patient. Her life is full of routines, boundaries and self-control -- all of which get put to the test when she meets Will, an impossibly charming teen who has the same illness. There's an instant flirtation, though restrictions dictate that they must maintain a safe distance between them. As their connection intensifies, so does the temptation to throw the rules out the window and embrace that attraction.",
  "popularity": 7.9,
  "poster_url": "https://image.tmdb.org/t/p/original/kreTuJBkUjVWePRfhHZuYfhNE1T.jpg"
}