{
  "movie_name": "Forrest Gump",
  "movie_id": "forrest_gump",
  "total_reviews": 154,
  "reviews": [
    {
      "text": "Flaws and all, the movie unfolds like a book of short stories and that choice ushered in a confidence the script is able to pull off."
    },
    {
      "text": "When analyzing the ultimate endurance that “Forrest Gump” has left in the decades since it first came out, it’s obvious that approaching it with a more inquisitive perspective leaves it with a much shallower impact than it did upon its initial release."
    },
    {
      "text": "Forrest Gump is Hollywood film-making at its most corn-fed, sucrose-enriched and calorific; you’ll need a sweet tooth for it."
    },
    {
      "text": "Forrest was an ordinary man in extraordinary circumstances."
    },
    {
      "text": "Zemeckis has made a fast movie about a slow hero; he transforms Forrest's daffy misconceptions into lyrical flights. Forrest Gump has a softer, more delicate touch and a richer current of feeling than any of the other holy-innocent movies."
    },
    {
      "text": "What makes Forrest Gump a stunning triumph, a departure from the mediocre norm? A big reason is the way the film provides a fresh perspective on the familiar experience, through the eyes of its unforgettable protagonist."
    },
    {
      "text": "Forrest Gump isn't a movie for cynics. Instead, it's one of those rare films that seduces viewers into overlooking its faults with the sheer goodness of its heart."
    },
    {
      "text": "Hanks' performance [is] a triumph of dignity, decency, and warm-hearted humor... Even more than his Oscar-winning achievement in Philadelphia, this is a role that will be remembered as long as people care about great acting."
    },
    {
      "text": "Forrest Gump is a very fine hour for everybody involved. And it's concrete evidence that Tom Hanks is the best actor working in American film today."
    },
    {
      "text": "Forrest Gump is for big kids what playing Nintendo is for little ones -- that is, the neato thing about Robert Zemeckis' film is the clever techno-wizardry produced by Ken Ralston and Industrial Light and Magic."
    },
    {
      "text": "Hanks never strikes a false note, never panders to his mentally slow character nor tries to make him more than he is, despite a script that occasionally calls on him to utter what presumably are intended to be simple profundities."
    },
    {
      "text": "There's an undeniable kick to the idea of recapitulating to the Boomerography as a tale told by an idiot, but the thrill inexorably fades."
    },
    {
      "text": "Intended as a paean to simplicity and a meditation on the quirks of destiny, \"Gump\" is instead simple-minded and calculated, a cloying, reactionary fable in praise of stupidity."
    },
    {
      "text": "Forrest Gump is about as good as Hollywood movies get."
    },
    {
      "text": "Hanks' immersion in character and his convincing interaction with fellow players make Forrest Gump -- gimmicks and all -- a pleasure."
    },
    {
      "text": "The best art takes the biggest chances, thereby losing people who can't stretch with it. Forrest Gump is worth the effort."
    },
    {
      "text": "Forrest Gump is going to touch a lot of people's lives. It also has a good shot at bringing Tom Hanks a second Oscar for best actor."
    },
    {
      "text": "Loosely adapted from Winston Groom's satirical novel, Forrest Gump provides an incredibly rich and daffy historical pastiche."
    },
    {
      "text": "Forrest Gump is a rare treat: a movie that delivers a message of hope and faith without delving into preachiness. Much of that success is due to Hanks' majestically deadpan performance."
    },
    {
      "text": "It turns tedious toward the end... But when it's good, it's very good, and the way it blends star Tom Hanks, who plays the title character, into actual historical film footage will tickle you to no end."
    },
    {
      "text": "Forrest Gump manages to examine some of the basic questions of human life and to add perspective to the two most disruptive decades in modern history."
    },
    {
      "text": "Director Robert Zemeckis is no stranger to spectacular effects. But seldom do knockout technology, superb acting and witty writing meld so satisfactorily."
    },
    {
      "text": "It requires a delicate touch to keep from becoming precious. Director Robert Zemeckis is up to the task."
    },
    {
      "text": "Far more impressive than Zemeckis' techno-sleight-of-hand is the steadying integrity of Hanks' portrayal. His Southern-fried Holy Fool brings the movie into focus, giving it a heart to make up for its lack of brains."
    },
    {
      "text": "Warm and winning, the spare, simple \"Gump\" shows the honor that exists in decency and loyalty."
    },
    {
      "text": "The conviction behind this film is so strong that the sprawling panoply of time and place that it encompasses takes on an intimate and personal flavor -- as if Forrest is real."
    },
    {
      "text": "Forrest Gump takes its own sweet time getting where it wants to go. But it's a journey worth taking, with a traveling companion you'll never forget."
    },
    {
      "text": "By turns silly and sensitive, romantic and ridiculous, schmaltzy and sincere, this biography of a fictional character is entertaining and touching."
    },
    {
      "text": "Aided by his cast and a fine script by Eric Roth, Zemeckis delivers his best directorial performance."
    },
    {
      "text": "Forrest Gump is directed with patience and good humor by veteran Robert Zemeckis. He gently mixes state-of-the-art, high-tech special effects with this absorbing story."
    },
    {
      "text": "For all the film's excess, both social and sentimental, it remains an extremely moving experience, and that's because of the unabashed humanity at its core."
    },
    {
      "text": "Yes, its intended climax is not as powerful as the rest of the film. Yet Rob Zemeckis' movie serves up so much fun for such a long time that you hardly mind its sentimental conclusion. It's a delightful trip, this excursion into the mind of Forrest Gump."
    },
    {
      "text": "It is a triumph for Tom Hanks, who surely deserves to become the first person since Spencer Tracy to win back-to-back best-actor Oscars."
    },
    {
      "text": "When director Robert Zemeckis decides not to numb us with the unnecessary lingering melodrama, he manages to move us for the right reasons with super story quirks, old-fashioned romance and hysterically funny irony."
    },
    {
      "text": "Forrest Gump has some nice surprises and its message about common decency is bound to warm hearts everywhere, but as a view of the world, it has an IQ of about 75."
    },
    {
      "text": "A tasty mix of the comic and the absurd. You never know what you're gonna get, but you can always be sure Hanks will deliver the goods in mint condition."
    },
    {
      "text": "Hanks shows the gears turning in Forrest's head -- and the limits of just how far they will turn. Even as luck rises again and again to save Forrest and push him forward, Hanks maintains a simplicity and openness that keeps Forrest real -- and engrossing."
    },
    {
      "text": "Forrest Gump doesn't wake people up to their times; it sends them to sleep thinking all is well with them. It makes one feel there's something to be said after all for Oliver Stone."
    },
    {
      "text": "Hanks pulls another stunning coup as the dim-witted, sweet-natured Gump. Speaking in a thick, gulping Southern accent, Hanks creates a character \"dumb\" enough to be mistreated and ridiculed by other but smart enough to know what's up."
    },
    {
      "text": "From his ramrod-straight posture to the high stride of his running, from his wide-eyed curiosity to his totally guileless personality, Hanks has fashioned one of the most unusual and endearing characters in recent film history."
    },
    {
      "text": "Forrest Gump is a winning, unabashedly sentimental fable that somehow manages to bring Frank Capra and Oliver Stone to mind in the same breath."
    },
    {
      "text": "One of the best films of the year, bar none. Nearly 30 years of American history are woven into this droll, tearful, honest search for the American dream and the lost innocence that gave birth to it."
    },
    {
      "text": "The film's attitude is that intellectual deficiency is not something to be treated with understanding: it should be worshipped as the highest quality to which Americans can aspire."
    },
    {
      "text": "It's part elegy for a nation that likes to gun down its leaders, part Buster Keaton or Harold Lloyd comedy... The mix is kind of irresistible, because comedy with such texture is rare."
    },
    {
      "text": "More of interest for what it says about how Americans wish to regard themselves than for its qualities as comedy or drama. Movies can be a magic mirror, and America has been mightily pleased with what it has seen in this tricksy bit of silvered glass."
    },
    {
      "text": "As sweet and satisfying as a slice of apple pie, Forrest Gump is just about as wholesome."
    },
    {
      "text": "I never looked at my watch once. It really is a must-see movie. And, as Forrest would say, that's all I have to say about that."
    },
    {
      "text": "Forest Gump is far from being a grand movie. Tom Hanks is very close to being a grand actor. Balance one with the other and go see it, either way. [Full review in Spanish]"
    },
    {
      "text": "Forrest Gump is not without its amusing and felicitous moments, but the way it brings together Main Street and Woodstock, middle American and the counter-culture, in one great clammy embrace is glib and dishonest."
    },
    {
      "text": "Forrest, with Hanks in serious danger of winning a second successive Oscar for his performance, is an Everyman and one of life's innocents, too. He tells a colourful story but that doesn't necessarily mean it's all true."
    },
    {
      "text": "It pretty much sums up Tom Hanks' sweetly judged performance to note the sentimental nostalgia trip that is Forrest Gump would not have worked without him."
    },
    {
      "text": "Forrest, we twig instantly, will be as free as that feather, as he bobs on the breezes of history. He'll also, however, be as lavishly artificial and airily bogus a construction, this being a very costly computer-generated feather."
    },
    {
      "text": "Gump is an endearing and enduring character, even if the extraordinary path is too far-fetched for the cynical mind. Sit back and try not to overthink this fanciful tale and you might just get soaked up in its wistful charm."
    },
    {
      "text": "Eric Roth has fashioned a beautiful screenplay from a novel by Winston Groom, paying as much attention to the smallest detail as to the big picture."
    },
    {
      "text": "Forrest Gump remains an American staple thanks to Tom Hanks' affecting performance and Robert Zemeckis' ability to canvass history with a galavanting story about patriotic perseverance and optimism."
    },
    {
      "text": "The performance I had forgotten was Sally Field as Mama. As always Field brings commitment and passion to her role and she is great as the protective but empowering mother of a special needs child."
    },
    {
      "text": "Its timelessness, poignancy, and hilarity are infectiously powerful."
    },
    {
      "text": "Forrest Gump may have its own problems some 26 years later but the film features one heck of a soundtrack."
    },
    {
      "text": "It's too specific to be a proper allegory, and too vague to provide a satisfactorily millennial perspective on the last 50 years. Neither is it caustic enough to make one cry, nor soppy enough to make one laugh."
    },
    {
      "text": "The narrative is so programmed it is like watching software. Forrest Gump is a medley of sound bites-clever, cute, amusing, silly, sentimental-and irritatingly phony..."
    },
    {
      "text": "Self-ingratiatingly, and for this viewer maddeningly, it blends the comic with the Christly, the satirical with the sentimental, the free-thinking with the fuddy-duddy."
    },
    {
      "text": "[Forrest Gump] works primarily because of Tom Hanks’ intuitive performance in the lead role and director Robert Zemeckis’ wizardry behind the camera."
    },
    {
      "text": "Forrest Gump has layers and nuances and ironies, and it's far bleaker than it is given credit for. Just because a movie is a monster hit doesn't mean it isn't interesting."
    },
    {
      "text": "It remains a bad movie that gets worse with age."
    },
    {
      "text": "I can't see how people with low I.Q.s or those who love them are in any way comforted by all this hogwash. I can easily see how such people might be offended by its smug unreality."
    },
    {
      "text": "Fifty years from now, Forrest Gump will probably seem hopelessly quaint, cryptic, even ridiculous. Today, however, Gump, the much talked about summer fable starring Tom Hanks, is a tonic for an age of cancerous cynicism."
    },
    {
      "text": "Only in America could you envision a film with the conceit of a simpleton as conduit through a swathe of that country's socio-history, and for it not to be a colossal satire."
    },
    {
      "text": "Contrasting Forrest's unassuming innocence with the upheavals and rancor of the times, the film is a wisely goofy commentary on the stupidity of smartness."
    },
    {
      "text": "Forrest Gump, the new Tom Hanks movie directed by Robert Zemeckis, is a one-of-a-kind treat. Larky, yet carefully balanced and far from mindlessly upbeat."
    },
    {
      "text": "That's the triumph of Zemeckis and his scriptwriter Roth. They took a moderately funny and satiric yahoo novel about the redneck view of America and made a hilarious, large-spirited and tender epic out of it."
    },
    {
      "text": "Hanks' power as an actor makes us believe in Forrest. He also draws us into Forrest's mind and morality system. And he sets out a singular film persona who will be watched and loved as long as people embrace movies."
    },
    {
      "text": "An instant classic. [Full Review in Spanish]"
    },
    {
      "text": "Forrest Gump is, for all of it's graces, undeniably broken thanks to [its] shameless ideological manipulation of historical truths. [Full review in Spanish]"
    },
    {
      "text": "Tries very hard to be all things to all people, and as a result fails to be anything at all."
    },
    {
      "text": "A weirder, darker, and better movie than its reputation suggests."
    },
    {
      "text": "It's a lovely and wise story told with honesty and acted out with unassuming grace. To his collection of medals, trophies and kudos, Forrest Gump should add an Oscar or two."
    },
    {
      "text": "A dark and driven work, haunted by violence, cruelty and a sense of the tragically absurd."
    },
    {
      "text": "This is the well-told tale of a gentle, lovable soul who succeeds. And Hanks' quirky Forrest is just plain fun to watch"
    },
    {
      "text": "Forrest Gump is never sure of what it is or what it wants to be."
    },
    {
      "text": "Pulling the supremely naive yet mystically wise Gump off is a feather in Hanks' hat."
    },
    {
      "text": "One of my all time favorite films."
    },
    {
      "text": "It might hit you right in the feels, even as your eyes are rolling. To quote one of Forrest's truest pieces of wisdom: Maybe both is happening at the same time."
    },
    {
      "text": "So afraid to dredge up debate that when Forrest is handed a mic at an antiwar rally, someone unplugs the speakers so we can't hear him -- fitting for a movie with nothing to say."
    },
    {
      "text": "It's most successful when it is being off-center, a state of grace it doesn't quite have the nerve to maintain."
    },
    {
      "text": "Hanks is brilliant in evoking Forrest's good-heartedness; he cannot really perceive evil in men, and yet he is so untainted by bigotry or ideology that he makes the perfect witness."
    },
    {
      "text": "This isn't the meaningful movie it pretends to be. But as a goofy entertainment that speeds through the latter half of the 20th century, stopping here and there to snap a photo or two, Forrest Gump does just fine."
    },
    {
      "text": "Forrest Gump is a schmaltz-Zelig, a Being There engineered from the genetic material of a Hallmark card."
    },
    {
      "text": "Good as Wright and Sinise are in their roles as Forrest's near-suicidal soulmates, the movie always comes back to Hanks, and director Robert Zemeckis helps him to achieve some of his finest emotional moments."
    },
    {
      "text": "The performances of Hanks, Gary Sinise, Mykleti Williamson and Robin Wright are worthy. What's missing, though, is a philosophical context in which to gauge what we're watching."
    },
    {
      "text": "Zemeckis has an exuberant sense of humor, an ability to use good ideas from other movies (he steals from Being There and Zelig) and an unmatched mastery of the technical."
    },
    {
      "text": "As played to perfection by recent Oscar winner Tom Hanks, who is fast proving that he has no acting limits, this film is a social comedy that reaches heights of wit and cleverness."
    },
    {
      "text": "America's loss of innocence as filtered through the eyes of an innocent -- that's the theme of this plodding, heavy-handed parable."
    },
    {
      "text": "The movie supports its optimistic agenda by evading or overlooking many hard realities of the historical period it supposedly wants to explore and understand. The result is a winning but ultimately dishonest portrait."
    },
    {
      "text": "The movie's technical tricks are great fun, as is its musical soundtrack, which captures the essences of the eras it traverses. But when you come right down to it, it's the oddly magnetic personality of Forrest himself that is the biggest draw."
    },
    {
      "text": "Forrest Gump is a perfectly competent movie. Its major failure is one of morals and ideas, and the fact that so many, many people did not seem to notice or care, is what really flummoxed me."
    },
    {
      "text": "Taken as a sweet, occasionally sickly, modern fairytale, it's largely enjoyable."
    },
    {
      "text": "This tall tale may reach monumental proportions, but Forrest Gump always keeps its magical airiness and grace."
    },
    {
      "text": "Credit for the success of the film has to start with director Robert Zemeckis, who has taken his Back to the Future and Who Framed Roger Rabbit success and parlayed it into a more mature, yet equally entertaining, film."
    },
    {
      "text": "Warm, wise, and wearisome as hell."
    },
    {
      "text": "One can sneer at it, but one can't ignore it."
    },
    {
      "text": "All this might have seemed like pressing optimism a bit without the bland but still potent presence of Tom Hanks at its centre, clearly on his way to another Oscar nomination."
    },
    {
      "text": "The greatest pleasure the picture affords Americans is most likely a sense of relief; Forrest Gump assures us that we've awakened from the nightmare of history; that all is forgiven, and most has already been forgotten."
    },
    {
      "text": "...not a wishful paean to a fantasy version of America, but a portrait of America - its awfulness and beauty, promise and pain - as seen through the eyes of an innocent."
    },
    {
      "text": "This Oscar-winner divided critics in its chronicle of the long journey taken by a slow-witted boy through American history and politics, but there was consensus about the high-caliber acting of Hanks, who won a second, consecutive Best Actor Oscar."
    },
    {
      "text": "Moving and wonderful, but parent preview a good idea."
    },
    {
      "text": "Forrest Gump is a beautiful looking film, one that moves at a stately pace, and one stuffed with pat-sounding quotable lines like, well, “life is like a box of chocolates.” Beneath all that, however, lies a pretty dark movie."
    },
    {
      "text": "Forrest may be dumb, but he ain't stupid."
    },
    {
      "text": "For all its ambition, the movie ends up using great historical events in the service of a dubious sentimentality."
    },
    {
      "text": "This is a mediocre mawkish conservative film that goes out of its way not to offend anyone in its attempt to make some coin, say as little as possible that has any weight and be well-liked. But why is it I feel offended?"
    },
    {
      "text": "Unashamedly sentimental, this is a technically triumphant tear-jerker."
    },
    {
      "text": "For all its mush and meandering, this is among the stand-out audience pleasers; Hanks outdoes himself in the loveable dolt department with unforgettable, utterly disarming work."
    },
    {
      "text": "Its flaws don't do it any great harm; it's as comforting as an afternoon nap, but also as refreshing."
    },
    {
      "text": "A picaresque story of a simpleton's charmed odyssey through 30 years of tumultuous American history, Forrest Gump is whimsy with a strong cultural spine."
    },
    {
      "text": "See website for more details."
    },
    {
      "text": "Better to not exist in the Descartisian sense than to risk idealism: the path to riches, fame, and reproductive success begins with zero critical facility and ends with recycled platitudes."
    },
    {
      "text": "Frank Capra once fared well promoting similar values, but his films were far darker, conflicted, and ambiguous. Zemeckis's film has lots of heart but little in the way of guts or brains."
    },
    {
      "text": "Now that this movie has become one of the top grossers of all time, there are plenty of reasons to suspect that its “stupidity as redemption” message is telling a good many Americans exactly what they want to hear."
    },
    {
      "text": "Forrest is what we all occasionally wish we could be -- someone who goes through life without second-guessing himself and dwelling on what might have been."
    },
    {
      "text": "As this mawkish conservative movie ultimately goes to prove: ignorance is bliss."
    },
    {
      "text": "A great film."
    },
    {
      "text": "This film is both serious and funny, entertaining and thought-provoking and it could make people laugh and cry with equal degree of ease."
    },
    {
      "text": "Forrest Gump has the elements of an emotionally gripping story. Yet it feels less like a romance than like a coffee-table book celebrating the magic of special effects."
    },
    {
      "text": "The press kit says Gump brings a rare clarity to what we went through in the '50s, '60s and '70s. But I only saw a pitiful stooge taking the pie of life in the face, thoughtfully licking his fingers."
    },
    {
      "text": "The good-natured humor is wonderful in the film, but the thing that makes it so entertaining is how it hits all the human emotions dead-center without resorting to cheap melodrama."
    },
    {
      "text": "Forrest Gump overflows with creativity and intelligence, but it all revolves around Tom Hanks. Not even Hanks' Oscar-winning performance in Philadelphia could prepare you for his work here."
    },
    {
      "text": "Exquisitely made, expertly crafted... and a work of purest, blackest evil."
    },
    {
      "text": "Stupid is as stupid does, and this movie is, indeed, stupid."
    },
    {
      "text": "Gets my vote for the most offensive, morally repugnant film ever made."
    },
    {
      "text": "Forrest Gump is still an entertaining film, though one of little importance."
    },
    {
      "text": "Clever, sweet and frequently very funny. I think it's a darn good movie."
    },
    {
      "text": "Skillfully adapted by screenwriter Eric Roth, the story belongs in the company of such sweet classics as Rain Man and Harvey."
    },
    {
      "text": "The result is an enormously accomplished piece of sentimental glop."
    },
    {
      "text": "An enchanting and creative parable about a contemporary holy fool whose brand of selflessness is free of reason's madness and the ego's frivolous grandeur."
    },
    {
      "text": "I may never fully understand the awe some Gump fans feel over this movie, but it's still a whole lot of good, sweet, silly fun."
    },
    {
      "text": "views the world with such an open eye and optimistic attitude that you're willing to overlook how much it simplifies complex phenomena just because it makes you feel so good"
    },
    {
      "text": "A movie heart-breaker of oddball wit and startling grace."
    },
    {
      "text": "There's something in the centre of Forrest Gump, and soft is one thing it definitely ain't."
    },
    {
      "text": "Forrest Gump has an intricacy and depth that is more rewarding while still being enormously engaging."
    },
    {
      "text": "The worst thing is the film goes for brilliance when it really isn't."
    },
    {
      "text": "It was competently made but overlong and occasionally infuriating."
    },
    {
      "text": "Forrest Gump never fails to be a feast for the senses. It's also frequently a feast for the funny bone, but unfortunately Zemeckis succumbs to... a desire to throw in too many winking cultural asides."
    },
    {
      "text": "It could be said that Forrest Gump is the definitive American movie."
    },
    {
      "text": "Passionate and magical, Forrest Gump is a tonic for the weary of spirit."
    },
    {
      "text": "Forrest comes across as a sweeter Zelig, a candied Candide, as the film strains to find America's inner child. But Hanks holds it together because he is working to discover Forrest's inner adult -- the mature man under his infantile guilelessness."
    },
    {
      "text": "I can't think of anyone else as Gump, after seeing how Hanks makes him into a person so dignified, so straight-ahead. The performance is a breathtaking balancing act between comedy and sadness, in a story rich in big laughs and quiet truths."
    },
    {
      "text": "Hanks is so charming as Gump, so heroic in his guilelessness and belief in simple virtues, that you want to excuse the film's excesses and overlook Zemeckis' weakness for easy, maudlin sentiment."
    },
    {
      "text": "It was almost like it was written by a committee and everybody got to write 10 minutes of the story."
    },
    {
      "text": "It's no exaggeration to call Forrest Gump a celebration of life, and it's been awhile since we've had a movie that offered so much and generally managed to deliver on all counts."
    },
    {
      "text": "It sure seemed great at the time, but Gump is aging, and it's starting to show a wrinkle or too."
    },
    {
      "text": "For the most part, however, this is a captivating experience. Hanks is superb, reemploying the childlike presence he brought to Big."
    },
    {
      "text": "This story of a simple man's journey through life and the turbulent events of post-war America is both dark and sweet, with a center that is soft but also rich and surprising."
    },
    {
      "text": "This is one summer movie that doesn't evaporate the minute you leave the theater."
    },
    {
      "text": "Forrest Gump is a modern classic. It is epic in scope and effortlessly combines humor with pathos, like all the best movies do."
    },
    {
      "text": "Reduces the tumult of the last few decades to a virtual-reality theme park: a baby-boomer version of Disney's America."
    }
  ],
  "release_year": 1994,
  "duration": 142,
  "genres": [
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG-13",
  "synopsis": "Slow-witted Forrest Gump (Tom Hanks) has never thought of himself as disadvantaged, and thanks to his supportive mother (Sally Field), he leads anything but a restricted life. Whether dominating on the gridiron as a college football star, fighting in Vietnam or captaining a shrimp boat, Forrest inspires people with his childlike optimism. But one person Forrest cares about most may be the most difficult to save -- his childhood love, the sweet but troubled Jenny (Robin Wright).",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/arw2vcBveWOVZr6pxd9XTd1TdQa.jpg"
}