{
  "movie_name": "Frozen",
  "movie_id": "ghostbusters_frozen_empire",
  "total_reviews": 301,
  "reviews": [
    {
      "text": "With thinly spread plot and characters, Ghostbusters: Frozen Empire is a nostalgia-choked highlight reel that’s for the fans and for the fans only."
    },
    {
      "text": "It's more or less what I was afraid it was going to be based on the trailers."
    },
    {
      "text": "The thing about Ghostbusters: Frozen Empire is that it tries to do far too much all at once, and ends up feeling utterly overstuffed."
    },
    {
      "text": "The weight of the film is largely carried by McKenna Grace's Phoebe, who chafes at being excluded from the specter battling shenanigans because of New York's strict paranormal child labor laws, or something."
    },
    {
      "text": "If this is the level of quality we can expect from Ghostbusters going forward, then maybe Walter Peck was right."
    },
    {
      "text": "Ghostbusters: Frozen Empire resorts to jingling keys in front of viewers’ faces instead of honing its more vital elements. If this is what the Ghostbusters franchise, or any other franchise for that matter, has to do to stay relevant, then good riddance."
    },
    {
      "text": "I didn’t hate “Frozen Empire” like apparently many others did. I liked it. I just wish there was more thinking outside of the box."
    },
    {
      "text": "When it comes to straight-up storytelling, “Frozen Empire” lacks anything substantial or original, resulting in a film that, despite a few moments of fun, ultimately leaves audiences a bit cold."
    },
    {
      "text": "After the success of Ghostbusters: Afterlife, Sony brings the old gang back together, but the film struggles to justify their inclusion as it makes the new characters fail to impress."
    },
    {
      "text": "Frozen Empire proves that Ghostbusters doesn’t need to cling onto dated and toxic nostalgia. It has everything it needs right here."
    },
    {
      "text": "The tedious Afterlife was so distracted with not offending sensitive fanboy man-boys that it even bungled its throwbacks to the 1984 original. This one at least does OK with its nostalgic chants, provided one can ignore Bill Murray’s bored expressions."
    },
    {
      "text": "It’s forgettable, and some of the worst of what franchise filmmaking has to offer in 2024."
    },
    {
      "text": "Ultimately, \"Frozen Empire\" is fine. It’s not going to blow your house down or ruin your day, which is perfectly acceptable for a movie. But a \"Ghostbusters\" movie is never truly bad, it’s just a matter of understanding what it seeks to do ... ."
    },
    {
      "text": "Ghostbusters: Frozen Empire may cut down on the nostalgia overload that the previous entry suffered from, but it's still plagued with a lazily-written storyline that doesn't explore its characters nearly enough."
    },
    {
      "text": "Offers frosty fun but lacks narrative cohesion. Enjoyable for fans, but not a standout in the supernatural fantasy genre."
    },
    {
      "text": "It's just so frustrating to see the shape of something that could fully work as a 21st century spin on Ghostbusters, but watch it whittle down to the dullest version of itself."
    },
    {
      "text": "As a review, this film is fun and family-friendly with nothing glaring on the good or bad side."
    },
    {
      "text": "The action scenes are the least interesting parts of the film, and, as the action increases, the film becomes increasingly uninspired."
    },
    {
      "text": "With each movie that’s churned out, it’s becoming more and more obvious that there’s only so much you can do with this world."
    },
    {
      "text": "For long-time series fans, Frozen Empire provides two more hours of Ghostbusters content."
    },
    {
      "text": "Considering the talent on hand and the eternal goodwill of the original film, it's hard not to deem Afterlife another missed opportunity for the franchise."
    },
    {
      "text": "Ghostbusters: Frozen Empire has many aspects that sound good on paper but don't work in execution."
    },
    {
      "text": "Although rich with potential, the film is a mishmash of fan service, underdeveloped characters, and underwhelming humour."
    },
    {
      "text": "Ghostbusters was a huge movie for many people and brought a lot of joy with every repeated viewing. It was fun, fresh, quotable, and a joy to watch. This is none of those things."
    },
    {
      "text": "...the picture begins its slow-but-steady descent into irrelevance as it progresses into a meandering and distressingly uninvolving midsection..."
    },
    {
      "text": "What remains is a film that does many things well, but does not find a necessary balance.  [Full review in Spanish]"
    },
    {
      "text": "While Frozen Empire raises spirits and smiles, it even falls below the far-from-perfect Afterlife ."
    },
    {
      "text": "[Ghostbusters: Frozen Empire] is caught between nostalgic fan service and a new-generation family adventure. It tries to be both by having too many characters and too much story, little of it thrilling, parts of it passably entertaining."
    },
    {
      "text": "Here’s hoping that if we are afflicted with another Ghostbusters film, it gives us something to really be scared of."
    },
    {
      "text": "Fans will have some fun, but there are too many subplots for this story to thrive as intended. It spreads itself so thin, and the lack of focus is distracting."
    },
    {
      "text": "I'm at a point where I'm completely apathetic with this franchise."
    },
    {
      "text": "Frozen Empire will satisfy fans who want to see the gang back, but as a film this is a corporately-minded muddle that may gross at the box office but lacks the heart of its predecessors."
    },
    {
      "text": "Busting makes me feel good. At the end of the day, it’s Ghostbusters, whaddaya want?"
    },
    {
      "text": "While the film does have too many characters and subplots, I had a ton of fun spending time with these characters at the firehouse."
    },
    {
      "text": "After so many mishandled or abandoned series — from “Fantastic Beasts” to “Narnia” to “Percy Jackson” — it’s nice to see one that’s heading in the right direction."
    },
    {
      "text": "While there are several promising action set pieces and a collection of genuine creepy poltergeists, Ghostbusters: Frozen Empire disappointingly fumbles the landing due to an oversized cast and a reluctance to move away from the franchises’ past."
    },
    {
      "text": "When all is said and done, Ghostbusters: Frozen Empire stumbles under the weight of expectations. While it is such a joy to see some of these characters reunite, the film struggles to keep the new story moving forward."
    },
    {
      "text": "While the ghostbusting of the Spengler family is great entertainment, when the Garraka appears, the film becomes serious, with fear-provoking scenes taking on a horror-film tone."
    },
    {
      "text": "A little slow in parts but the combination of the old with the new is a winner."
    },
    {
      "text": "I don't think we need any more of this. I think that's enough 'Ghostbusters.'"
    },
    {
      "text": "All the ideas that they were presenting I think were good ideas; just give them time to breathe."
    },
    {
      "text": "A boring rehash of familiar beats for nostalgia's sake."
    },
    {
      "text": "I thought it was really boring. I wasn't invested in any of the characters and by the end I was like 'does everybody get to be a ghostbuster?'"
    },
    {
      "text": "We get some rather uninspired CGI, a villain that reeks of Guillermo del Toro envy and a bored looking Bill Murray phoning it in. Thanks, but no thanks for the memories."
    },
    {
      "text": "Alas, despite the wobbly plot, I had a great time with this film. Lot's of subtle humor, even in the reactions shots. Listen and watch carefully.👻"
    },
    {
      "text": "A convoluted but reasonably fun and entertaining sequel."
    },
    {
      "text": "While things do play in fast forward sometimes, almost as if it’s in a crunch to be everything to everyone, Frozen Empire does get the basics right and its own evolution more so. It’s a give-and-take kind of flick, enjoyable to the last."
    },
    {
      "text": "... creaky and overstuffed. Full of references to the 1984 original, it has a plot that’s more complicated that it needs to be, jarring errors in continuity and logic, and characters with little to do."
    },
    {
      "text": "Until Ghostbusters decides if it wants to throw its lot in with one era or the other, it’s always going to be between two worlds. And that purgatory makes for a middling experience that doesn’t quite satisfy."
    },
    {
      "text": "This sequel looks to be seriously under baked, which is not surprising given its relatively short development time, plus the damaging effects of the pandemic and the writer's strike in Hollywood."
    },
    {
      "text": "This newest franchise entry is built on nostalgia and a stacked cast, but not enough to make it worth watching."
    },
    {
      "text": "Ghostbusters: Frozen Empire falls short of its predecessor, but the members of the classic and new cast inject enough energy, charm, and emotion to compensate for the narrative inconsistencies and pacing issues."
    },
    {
      "text": "I did like the ensemble -- it seemed like they were having a great time."
    },
    {
      "text": "There so much potential for this Ghostbusters as a franchise to take off into different and new territory. Ghostbusters: Frozen Empire is a step in the right direction that leaves us waiting for a leap in that same direction."
    },
    {
      "text": "Ghostbusters: Frozen Empire is a bit of a mixed bag. While it does offer some fun and enjoyable moments there are issues that keep it from reaching its full potential."
    },
    {
      "text": "If you thought the 2021 feature was dull and full of cheap nostalgia dumps, hold on to your hats because this one is far worse."
    },
    {
      "text": "An enjoyable sci-fi-comedy romp. It doesn’t top the 1984 original (what could?), but it entertains. The new cast embraces the spooky thrills and the old guard gets moments to shine. Yes, there's shameless fan pandering, but who you gonna call?"
    },
    {
      "text": "To quote the Ghostbusters theme song, \"I ain't afraid of no ghosts!\" ... but when the main action and resolution are crammed into the last quarter of the film, it will leave you feeling like maybe you wanted to be a little afraid."
    },
    {
      "text": "I’ve some respect for films that sacrifice character work for plot development -- moviemaking is a balancing act, after all -- but in this case, the story is clumsy and the payoff, underwhelming."
    },
    {
      "text": "I feel like a grumpy old Gen X'er, but enough already. If you're still going to stoop to gratuitous cameos then at least give me a story to nail them to -- and some fresh ideas to colour it in."
    },
    {
      "text": "Kenan and co. aimed for something different, a risk which should be commended, but it didn’t entirely work leaving Ghostbusters: Frozen Empire as a fun but highly flawed effort."
    },
    {
      "text": "The investments are too large to risk someone choking on nuance, after all."
    },
    {
      "text": "Bustin' makes me feel nothing."
    },
    {
      "text": "It's Grace who stands out as the emotional centre of the film, and while the subsequent tugging of heartstrings may not be to every viewer's liking, it never overwhelms the default setting of gag after gag after gag."
    },
    {
      "text": "Some will be drawn to its heavy nostalgia; other to its playful spirit and fun visual effects. But those things alone can’t save “Frozen Empire” from its overstuffed story, too many characters, and its overall lack of anything original."
    },
    {
      "text": "Frozen Empire is a step in the right direction, but it’s still too reliant on the glories of the past."
    },
    {
      "text": "The transition from a comedy to a more world-building fantasy for a new generation was working with Afterlife because there was still a healthy share of laughs. That is subdued now with a lot of story and an overstuffed cast."
    },
    {
      "text": "It's like the scriptwriters just devoured some plates of Ghostbusters' stuff and went barf... none of it makes any sense."
    },
    {
      "text": "This movie is overstuffed with too many characters and subplots...They were trying to do too much at one time and it made the film feel stilted, slow, and plodding."
    },
    {
      "text": "Ghostbusters: Frozen Empire is a disjointed mess, bloated with too many scattered storylines."
    },
    {
      "text": "There's still fun to be had with the Ghostbusters world, but Frozen Empire crumbles under the amount of characters and plot lines it's trying to juggle. There's some good ideas and a few bad ones but they're all equally undercooked."
    },
    {
      "text": "Bill Murray was right: Ghostbusters should’ve never been sequelized."
    },
    {
      "text": "There is just enough emotional pull there to stop the Ghostbusters empire from crumbling."
    },
    {
      "text": "Frozen Empire gets lost in a clumsy script, an excess of characters and a swamp of nostalgia. [Full review in Spanish]"
    },
    {
      "text": "As far as Ghostbusters: Frozen Empire goes, it is exciting… enough and is carried by the fun cast and design work."
    },
    {
      "text": "It’s not very funny, frightening, exciting or ambitious, and visually flat... There is something kindly and well-meant in its script and performances, though, a lack of cynicism starting with the cast, which makes it amiably involving."
    },
    {
      "text": "The cast is strong enough to keep us smiling, but the movie is neither funny nor scary enough to be much more than a bit of over-egged fluff."
    },
    {
      "text": "Rudd and Aykroyd bring the energy, but Mckenna Grace’s Phoebe gives the sequel a heartbeat. The focus shifts back to the comedy aspect of the original, which is great.  However, there are too many subplots and players on the field."
    },
    {
      "text": "Ghostbusters: Frozen Empire clones the style of the Reitmans' stock, lets the actors speak, and prefers not to polish most of the comic situations by trusting everything to the charisma of its stars... [Full review in Spanish]"
    },
    {
      "text": "Most of you reading this aren’t going to dissect the minutiae of the filmmaking, lore, or legacy. You’re just looking for a pleasant way to spend a few hours that won’t actively insult your intelligence. As blockbusters go, you could do a lot worse."
    },
    {
      "text": "As far as strained continuations go, this one could have been worse. If you put aside any attachment to the original classic, this one comes close to working as a well-produced popcorn escape."
    },
    {
      "text": "Frozen Empire is a perfectly serviceable slice of bright and breezy low-intensity horror."
    },
    {
      "text": "For the moment, there is much more action in this film than in the previous one. And to instill nostalgia, Ghostbusters: Frozen Empire includes appearances from old acquaintances... [Full review in Spanish]"
    },
    {
      "text": "The Ghostbusters franchise obviously isn’t ready to let go of the past."
    },
    {
      "text": "We might as well let AI make the soulless nostalgia fare at this point; you'd get roughly the same result as 'Ghostbusters: Frozen Empire,' and that $100 million budget could have been spent on movies worth spending it on."
    },
    {
      "text": "The plot is pretty much a cut-and-paste duplication of the original film."
    },
    {
      "text": "Ghostbusters: Frozen Empire tries to carry the baton of the franchise but it spectacularly drops it, with its lack of humour or originality leaving the Ghostbusters – and its foreseeable future – on thin ice."
    },
    {
      "text": "Ghostbusters Part 1 concludes with an epic battle against a giant marshmallow kaiju, Part 2 sees the Statue of Liberty spring to life, and now Frozen Empire wraps up anticlimactically in a garage... Felt like a Disney+ adaptation of the classic IP."
    },
    {
      "text": "Doesn’t take itself too seriously and is simply trying to have fun along with its audience. Not everything lands, but there are worse ways to spend a couple of hours."
    },
    {
      "text": "Ghostbusters - Frozen Empire is a dull, forgettable piece of work that goes to show that some ghosts need to be put to rest."
    },
    {
      "text": "\"Ghostbusters: Ghost Apocalypse\" wants to be many things at once and is none of them. Nor is it funny, terrifying, exciting or touching [Full Review in Spanish]"
    },
    {
      "text": "This is a prime example of a film being good enough without coming anywhere near great."
    },
    {
      "text": "Despite an intriguing subplot for Phoebe, Ghostbusters: Frozen Empire is an incohesive, unoriginal entry. It coasts on fan service to carry a paper-thin plot and a lukewarm crop of characters, new and old."
    },
    {
      "text": "The gatekeepers of this franchise seem to have no idea what makes GHOSTBUSTERS ... spirit surprises and comedy ... not constant special effects, complex stories, snail pacing and a cast that could fill Grand Central Station. Somebody haunt Bill Murray!"
    },
    {
      "text": "It works best when it apes the grounded tone and smart assery of the original, but the writing isn’t anywhere near as sharp as the 1984 film."
    },
    {
      "text": "Ghostbusters: Frozen Empire does have its redeeming factor as an entertaining Ghostbusters movie, but it really could have benefitted from more time fleshing out the newer characters. The experience is still somewhat satisfying, but it feels overstuffed."
    },
    {
      "text": "Ghostbusters: Frozen Empire emerges as a fun sequel but is burdened by juggling too many ideas."
    },
    {
      "text": "Overstuffed yet supernaturally charming... a miniseries of fresh concepts (shoehorned) into a feature film locked in at a mere two hours... (the ads) never give away the most meaningful subplot..."
    },
    {
      "text": "A few of the apparitions will look familiar, too, in what might be called a reunion of kindred spirits."
    },
    {
      "text": "As scattershot and uneven as it is unnecessary, it fails to effectively build on the foundation laid in Afterlife while at the same time relegating the “old timers” into oddly-integrated super-cameo appearances."
    },
    {
      "text": "As much as I liked the cast, this movie lacked the character connections that were created in Afterlife."
    },
    {
      "text": "There are definitely moments of enjoyment and hints at what could have been — but by falling into the trap of trying to do too much, the movie ends up doing not enough."
    },
    {
      "text": "There's a lot of self-referential backslapping throughout the film, but overall the problem is that there's too much going on. It's like the filmmakers couldn't figure out what story to tell, so they just threw everything into the mix."
    },
    {
      "text": "It’s passable entertainment that struggles between nostalgia and adjusting the series canon."
    },
    {
      "text": "Beneath the effects-driven mayhem, this latest sequel is more about recycling and recombining old ideas."
    },
    {
      "text": "A no-Gozer..."
    },
    {
      "text": "The 1984 original was original and entertaining. This fifth instalment is not the former and barely the latter. The Ghostbusters song asks \"Who ya gonna call?\" My suggestion is call it quits, but I suspect there's a ghost of a chance of that happening."
    },
    {
      "text": "Judging by this edition, there seems little need for another Ghostbusters. Passing proton packs from generation to generation has its limits."
    },
    {
      "text": "The original stars are utilized to a greater extent than they were in Ghostbusters: Afterlife, especially Dan Aykroyd, who gives a touching performance as Ray."
    },
    {
      "text": "“Frozen Empire” may not make a profound impact, but if you are a fan of the franchise, it will certainly make you feel good."
    },
    {
      "text": "The result of this ever-growing pastiche of characters is that nobody gets the amount of attention they need, leaving it uncertain what Frozen Empire is trying to achieve."
    },
    {
      "text": "“Ghostbusters: Frozen Empire” reassembles most of the original cast along with the cast of “Afterlife” in a craven “just play the hits” Ghostbusters retread that lacks any of the joy or originality that made the original film so beloved."
    },
    {
      "text": "If only the filmmakers could’ve shoehorned some actual jokes into this overstuffed confection, or served up action that didn’t look like it was edited in a digital shredder!"
    },
    {
      "text": "While this, the fifth installment of the strange in the neighborhood franchise, may not be the strongest, it's still spooktacular fun. Ultimately, bustin' makes us feel good."
    },
    {
      "text": "It’s apparently not enough for Frozen Empire to simply follow our new Ghostbusters on an adventure—we must make many, many, many stops off at Fan Service Central... continually clobbering any forward momentum this thing has right in the crotch."
    },
    {
      "text": "While not great, Ghostbusters: Frozen Empire, is still quite good and entertaining enough."
    },
    {
      "text": "Never mind her billing; as in AFTERLIFE, [McKenna] Grace is the real star of FROZEN EMPIRE and...gives the movie an emotional anchor in the midst of all the spectacle and narrative chaos."
    },
    {
      "text": "Anyone haunted, nay, scared witless by Hollywood’s risk averse dependence on sequels, franchises and spin-offs will turn white at this latest soulless manifestation of the once proud Ghostbusters."
    },
    {
      "text": "The end result is entertaining, with a full-tilt opening and a strong finale, bolstered by some good performances -- Rudd is on his best likeably goofy form -- but it sags in the middle."
    },
    {
      "text": "[The problems] are threefold. Firstly, it adds nothing new to a flimsy formula, and neglects newer characters; secondly, it is paced as urgently as a snail’s funeral; and thirdly, its ancient villain is so unsatisfying I felt like booing it."
    },
    {
      "text": "I’m trying to be charitable here, because if I’m being honest -- despite understanding the business case for them -- I’m baffled by the existence of reverent, unfunny Ghostbusters movies."
    },
    {
      "text": "Ghostbusters: Frozen Empire returns the franchise back to its rightful Manhattan home. The result is a moderately fun action adventure that weaponizes nostalgia."
    },
    {
      "text": "Add it all together, and Frozen Empire is a film that does justice to neither the past nor the present."
    },
    {
      "text": "If one is being blunt, the only reason for it to exist aside from those delightful miniature Stay-Puft marshmallow imps, is the delightful discovery that Kumail Nanjiani may very well be the cinematic heir of Bill Murray."
    },
    {
      "text": "The latest attempt to turn Ghostbusters into a legitimate franchise is basically your worst coworker. It’s lazy, stupid, and does everything it can to look busy while not actually doing much of anything."
    },
    {
      "text": "It's been a long time between buckets of popcorn, but it feels like Ghostbusters is back in safe hands."
    },
    {
      "text": "Frozen Empire isn’t nearly as glacial or tepid as Afterlife, but it does suffer from a similar desire to drown us in Easter eggs."
    },
    {
      "text": "The Achilles heel of Ghostbusters: Frozen Empire is in its very essence: It wants to cover so much (adding new and old characters to the story) but does not fully develop the multiple protagonists who come to life in the plot [Full Review in Spanish]"
    },
    {
      "text": "There are just too many characters, old and new. Even the poster is overloaded. It feels long, with action and special effects that are not so special."
    },
    {
      "text": "Is Ghostbusters: Frozen Empire a serviceable entry in the franchise? Sure, but they... because water down the characters and story for the sake of special effects, which means Ghostbusters has become a cliché of itself."
    },
    {
      "text": "This busting will not make you feel good."
    },
    {
      "text": "Ghoulish reboot sequel has lots going on; language, scares."
    },
    {
      "text": "The Spenglers have moved to New York City and before you can say “Back off, man. I’m a scientist,” they’re up to the ECTO-1’s wheel wells in paranormal terrors."
    },
    {
      "text": "... a recycled narrative that brings the gang back together but without a discernable purpose."
    },
    {
      "text": "On the whole the movie, directed by Gil Kenan from a script by Kenan and Jason Reitman, is an enjoyable lavish no-brainer."
    },
    {
      "text": "While there are enjoyable moments & fun camaraderie between the old + new Ghostbusters, Frozen Empire barely has any of the spark of the original to justify its existence."
    },
    {
      "text": "This film will not for a moment let us forget how important its progenitor was."
    },
    {
      "text": "Much better than the wobbly reboot, with plenty to delight both long-time fans and newcomers."
    },
    {
      "text": "Counting one character's otherworldly powers, there are TWELVE GHOSTBUSTERS fighting in the final battle. The insane amount of narrative incidents could tip into incoherence. But director / co-writer Gil Kenan corrals it for a fun, somewhat bumpy sequel."
    },
    {
      "text": "Ghostbusters: Frozen Empire has its flaws, but Sony shouldn't put the franchise on ice just yet."
    },
    {
      "text": "It’s far too much narrative, all crammed into a franchise that’s also relying on a lot of fan service as dialogue, gags, and more from previous outings are woven into the film to elicit easy laughs, hoots, and hollers."
    },
    {
      "text": "it’s so overstuffed ... we lose sight of the best part of Afterlife, which was the family dynamic between Callie and her kids and the delightfully named Gary Grooberson."
    },
    {
      "text": "The reverence for the past here does nobody any favours. It is as if a 1984 kids’ film tried to get them interested in the collected lore and backstory of Abbott and Costello."
    },
    {
      "text": "Frozen Empire turns its lemons into lemonade with novel character arcs — which, coincidentally, help distract from the fact that there are no ideas left to mine in the Ghostbusters franchise."
    },
    {
      "text": "I really enjoyed some parts of Ghostbusters: Frozen Empire, but I'm disappointed again. Nostalgia is what is sidetracking any good ideas that are going on."
    },
    {
      "text": "As far as I'm concerned, it's time to put the long-running franchise to bed."
    },
    {
      "text": "Despite the amazing talent on and off camera, Ghostbusters: Frozen Empire is a soulless film because it is a business decision first, and a work of art second."
    },
    {
      "text": "Sadly, the more it expands the less I care, and although Ghostbusters: Frozen Empire is not the lowest point, it feels like the least creative of the series."
    },
    {
      "text": "With Ghostbusters: Frozen Empire, busting still makes me feel good."
    },
    {
      "text": "Admittedly, we’ve pretty much seen it all before, but it’s still good fun."
    },
    {
      "text": "Perhaps it’s time to put this franchise on ice."
    },
    {
      "text": "Bustin’ no longer makes me feel good."
    },
    {
      "text": "This beloved series continues down an unfulfilling and humor-deprived family adventure path and none of the new characters will be as adored 40 years from now as Peter, Ray, Egon, and Winston remain 40 years after the original."
    },
    {
      "text": "In its favor, Frozen Empire scales way back on reverence for Ghostbuster minutia and lore...On the other hand, [it's] overly busy, flatly-lit, and plasticky-looking, with...little feel for action sequences, creature design, pacing, or building suspense"
    },
    {
      "text": "A blunt Gen X nostalgia play -- a tribute act grinding out the oldies on a cruise ship to nowhere."
    },
    {
      "text": "Gil Kenan doesn't so much shepherd a story as he does manage the \"Ghostbusters\" brand for 115 minutes. We get a few winks, a few ghosts, and that's about it."
    },
    {
      "text": "The real problem with Frozen Empire is that there is no pressing reason for the film to exist."
    },
    {
      "text": "Aykroyd, who co-wrote the summer of 1984 blockbuster with the late Harold Ramis, is the heart and soul of a film that sets new against old."
    },
    {
      "text": "My fingers have taken to their death bed simply typing out the basics. Yet, “Frozen Empire” is an eclectic, enjoyable barrage of nonsense — a circus act that kicks off with a Robert Frost poem and climaxes with Ray Parker Jr.’s titular synth banger."
    },
    {
      "text": "Its excessive focus on the past, rather than looking toward the future, seriously hurts an unnecessary film. [Full review in Spanish]"
    },
    {
      "text": "As a Ghostbusters movie, this is worse than anything that has come before it: a befuddled, chaotic... downright incoherent assortment of only loosely connected scenes and gags crashing into each other and desperately hoping for laughs and chills."
    },
    {
      "text": "It’s all too much of nothing special and all too little of anything funny or fun."
    },
    {
      "text": "Aykroyd and Grace are the soul of the thing, to whatever degree a soul exists. At this point, Aykroyd has shed any pretence of ironic distance, emerging as the mournful weirdo he surely always was."
    },
    {
      "text": "The fun of the known makes up for lack of originality... [Full review in Spanish]"
    },
    {
      "text": "Seeing the OG Ghostbusters team strapping on their proton packs was a hoot, but this latest installment in the franchise made some odd plot choices."
    },
    {
      "text": "Other than Aykroyd, who admittedly displays a characteristic glee at being in his comfort zone here, nobody seems to want to be there or going through these motions again."
    },
    {
      "text": "A very busy movie that lacks the emotional hook of its predecessor, while spending too much time on the wrong characters in a way that yields a rather lifeless, chilly affair."
    },
    {
      "text": "A significant upgrade from “Afterlife,” which relocated the action to Oklahoma and forgot to pack any comedy. \"Frozen Empire,” back, thankfully, in New York, is a breezier, more serviceable sequel that has a modest charm as an ’80-tinged family adventure."
    },
    {
      "text": "An agreeable franchise entry."
    },
    {
      "text": "The humor still falls flat, the action is still uninteresting, and the mythos remain as formless and plain as it’s always been."
    },
    {
      "text": "Grace captures the confusions of being 15 and out of sorts, and she provides more than enough of an emotional through line to pull the film together, especially when complimented by the eternally charming Rudd."
    },
    {
      "text": "Sometime around the eighth or ninth round of expository mumbo jumbo concerning the ectoplasmic nightmare about to happen, the movie starts moving sideways, not forward. Hate to say it, but: hold that ghost, indeed."
    },
    {
      "text": "It's tough to balance the casual vibe required for comedy to work with the effortfulness of huge special effects, but \"Frozen Empire\" pulls it off."
    },
    {
      "text": "The new film is professionally made, well-acted, entertaining enough, and possessed of no earthly reason to exist aside from the care and feeding of intellectual property."
    },
    {
      "text": "If you are a “Ghostbusters” completist, you’ll want to see this, and it’s just competent enough that you won’t feel that your time was entirely wasted."
    },
    {
      "text": "It’s a franchise reduced to nothing more than a parade of hollow, familiar images, lightly repackaged in hopes that we’ll buy another ticket and try to revisit the emotions we felt when we encountered this world for the first time"
    },
    {
      "text": "Ghostbusters: Frozen Empire is busting at the seams, and not just with ghosts. A jumble of old and new characters, mythology and fan service, it’s overstuffed and yet feels like something is missing."
    },
    {
      "text": "I thought it was alright, but it definitely suffered from nostalgia overload. In my opinion, the new cast and old cast didn't mesh as well as they did in the previous one and lacks the emotional depth and heart of the prior movie."
    },
    {
      "text": "A family horror comedy that is neither scary nor funny. [Full review in Spanish]"
    },
    {
      "text": "Frozen Empire is an effective, nice, enjoyable, and harmless new chapter in the series that, however, falls short when it comes to resolving the expectations that it creates... [Full review in Spanish]"
    },
    {
      "text": "Grace is by far the best here, showing the same kind of twitchy emotional energy that first got Kristen Stewart noticed; her and Lind’s interplay is the only remotely blithe spirit on show."
    },
    {
      "text": "Lay this series to rest in a proton pack, please!"
    },
    {
      "text": "This franchise really belongs in the rearview mirror."
    },
    {
      "text": "perfectly fine but incredibly dull"
    },
    {
      "text": "Fun, but fails to capture the magic of the originals. A mixed bag for Ghostbusters fans."
    },
    {
      "text": "The plot is filled with elaborate twists, excessive exposition and unnecessary drama between characters, feeling more like a way to fill time than telling a real story. [Full review in Spanish]"
    },
    {
      "text": "Crammed with characters familiar and new, overstuffed with clunky CGI and hysterical action but distressingly short of laughs, “Frozen Empire” is less cool than moldy."
    },
    {
      "text": "Ghostbusters: Frozen Empire simply cannot let go of the past, making us wonder what the point of the franchise's present is and if it actually deserves a future."
    },
    {
      "text": "“Ghostbusters: Frozen Empire” delivers a fun, action-packed adventure in the world of ghostbusting. With family at its core, this movie is a perfect blockbuster film that pays homage to the franchise while also appealing to newcomers."
    },
    {
      "text": "There is enough here - probably - to placate the hardcore fans, even if it's clear that the filmmakers aren't looking to re-invent the wheel...in fact, they're so content with the wheel that they're passing up opportunities to really fly."
    },
    {
      "text": "There's more to like here than in the last film, but this is still undoubtedly a franchise that's living in the past"
    },
    {
      "text": "Between laughs, nostalgic moments and the one-two punch of jump scares and intense ghost encounters, there’s a nice pace of action and comedy from the beginning. We’re reminded of what originally made this franchise fun."
    },
    {
      "text": "Ghostbusters: Frozen Empire is too much fun to skip and watching these Ghostbusters makes me feel good."
    },
    {
      "text": "Gil Kenan isn’t above leaning on the familiar, but he certainly tries to let this supernatural actioner find its own identity too, with the results being a mixed bag of potential unrealised"
    },
    {
      "text": "A silly and confusing nostalgia-infused stew that suffers from ingredients well past their sell-by dates, “Ghostbusters: Frozen Empire” is an erratic mess of plot and pacing, with too many layers and too many characters."
    },
    {
      "text": "Not as good as the previous installment, but fun enough to entertain both longtime and new fans alike. McKenna Grace and Dan Aykroyd shine the most, while the mythology and design of the new big baddie are pretty cool. [Full review in Spanish]"
    },
    {
      "text": "I hate to say it, but bustin' just doesn't make me feel good anymore."
    },
    {
      "text": "While at times messy and overstuffed with characters, the exploration of new Ghostbusters lore and charming cast made this still rather enjoyable."
    },
    {
      "text": "As fun as it is nonsensical, there's enough charm to make this installment enjoyable."
    },
    {
      "text": "A lackluster, overproduced, and forgettable entry in the Ghostbusters franchise."
    },
    {
      "text": "\"It’s like one lick of a big soft-serve ice cream cone with your second favorite flavor. You know what it tastes like, it is tasty, but it leaves you wanting more and preferably, with your very favorite flavor.\""
    },
    {
      "text": "The movie has too many characters and too few new ideas, and it’s more concerned with cramming mass appeal into the picture than telling a good story."
    },
    {
      "text": "… artless, soulless, joyless concoction of corporate vapidity."
    },
    {
      "text": "This ‘busters made me feel okay."
    },
    {
      "text": "[Aykroyd] practically glows. It's enough to make you want to see the actor make \"Ghostbusters\" movies forever — so long as they're better than \"Ghostbusters: Frozen Empire.\""
    },
    {
      "text": "Despite its weaknesses, this sequel is well above the poorly stretched bubblegum of Ghostbusters 2 and the overdose of nostalgia of Ghostbusters Afterlife. [Full Review in Spanish]"
    },
    {
      "text": "With nostalgic warmth and a jolt of laughter, Frozen Empire saves us from the emotional hypothermia that other blockbusters can cause.\n[Full Review in Spanish]"
    },
    {
      "text": "Although it is not a complete failure, there is something infuriating in the producers' obsession with continuing to squeeze out a franchise that clearly has run out of artistic juice. [Full review in Spanish]"
    },
    {
      "text": "When the spark goes out and the humor doesn’t garner laughs anymore, it’s time to consider putting this one in the grave."
    },
    {
      "text": "Despite some inconsistencies and conveniences as compared to its predecessor, it is still a fun offering with a strong core. [Full review in Spanish]"
    },
    {
      "text": "There’s too many characters, too many arcs, and not enough development. The main cast is underutilized, while the veteran Ghostbusters make glorified cameos that don’t add to the story. {...} This was a disappointing turn in the Ghostbusters franchise."
    },
    {
      "text": "... Losing momentum as it goes, Frozen Empire raises the increasingly frustrating suspicion that Kenan and Reitman couldn't choose which of their various story ideas to use, and so decided to use them all."
    },
    {
      "text": "It’s so confused by its own lore, by its incessant callbacks to the past and by its uncertainty around how to address the present that it mostly unfolds as a series of loosely connected “Ghostbusters-themed” sequences rather than an actual coherent movie."
    },
    {
      "text": "[Gil] Kenan and [Jason] Reitman have a better sense of incorporating our favorite legacy characters and the new cast while retaining that classic Ghostbusters feeling."
    },
    {
      "text": "It’s still somewhat amusing to see the old cast yet again (perhaps more so for anyone who has forgotten the previous film, which did the exact same thing)."
    },
    {
      "text": "This is another cluttered sequel that lets down the aspects that are working, consistently freezing itself in its tracks"
    },
    {
      "text": "Amusing sequel spits out Easter eggs between modest comic morsels."
    },
    {
      "text": "Despite some pacing troubles and a few characters deserving a little more screen time, Ghostbusters: Frozen Empire is an excellent entry in a storied franchise."
    },
    {
      "text": "Frozen Empire is arguably “just” a sequel to Ghostbusters, but that in itself is an achievement because, in a way, we’ve never actually had one before."
    },
    {
      "text": "Ghostbusters: Frozen Empire has strong family dynamics with Mckenna Grace being the standout, but a sluggish pace and weak story overshadow the charm. The underwhelming villain also takes too long to show up making this a forgettable experience."
    },
    {
      "text": "How do you service the past while not packing so much into the future that each element drowns out the others? This is a tricky balance to strike, and Frozen Empire isn’t able to manage it."
    },
    {
      "text": "Exhibiting a tone and setting being closer to the late Ivan Reitman’s classic franchise starter, [Ghostbusters: Frozen Empire] isn’t merely a nostalgic throwback, it’s a rekindling of a legend."
    },
    {
      "text": "Overall, I enjoyed it. It was fun."
    },
    {
      "text": "Ghostbusters: Frozen Empire is simply a product of its time, a modern-day sequel chock full of references and nostalgia bait but with no clear vision as to where it's going, or why."
    },
    {
      "text": "Ghostbusters: Frozen Empire makes for a serviceable entry in this now four-decade-running franchise."
    },
    {
      "text": "For those who watch Frozen Empire not as an exercise in nostalgia, but as a proper film with its own character arcs and story beats, then Phoebe’s act of defiance offers the first suggestion Ghostbusters might actually mean something in the year 2024."
    },
    {
      "text": "Frozen Empire still has plenty of nostalgia for the 1984 movie. It's only about 50% nostalgic callbacks, which is better than Afterlife's 90%, but the new stuff isn't funny."
    },
    {
      "text": "There are more than enough ghouls, goo and goofy wisecracks to justify yet another movie, which should be recommendation enough."
    },
    {
      "text": "The best I can say about Ghostbusters, Frozen Empire is, it’s not the worst. That would be Ghostbusters: Afterlife."
    },
    {
      "text": "Unfocused and overstuffed, Ghostbusters: Frozen Empire is proof that fan-service nostalgia and too many underdeveloped characters cannot make up for a shoddy story. Bill Murray has the worst jokes in the movie."
    },
    {
      "text": "The first Ghostbusters movie that feels obligatory, scattershot and devoid of any real soul."
    },
    {
      "text": "An energetic, funny continuation of the franchise and the first that truly feels like it’s found the right groove."
    },
    {
      "text": "Ghostbusters: Frozen Empire is so focused on making sure that it hits every single bit of nostalgia possible that the new characters and the story get pushed aside until the last twenty minutes."
    },
    {
      "text": "There are protracted moments of humor, fright, and pathos in Frozen Empire, but as it’s all so scattershot and disconnected, the film ends up being defined by its lack of conviction when it comes to exploring its ideas to the fullest."
    },
    {
      "text": "This overcrowded mashup and its complicated, convoluted plot feels like a franchise that may have finally run out of ghostbusting gas."
    },
    {
      "text": "This sequel didn’t need to exist, but it’s working very hard to make you like it, and only the iciest of hearts won’t crack a smile at least once."
    },
    {
      "text": "Kenan delivers a lively continuation with “Frozen Empire,” doing his best to maintain the needs of community members and the development of a major threat, showing some serious love for the series, personalities, and equipment in the process."
    },
    {
      "text": "Ghostbusters: Frozen Empire chills and thrills in an ectoplasm-fueled sequel that's sure to delight audiences. Old and new school cast members return to familiar New York City haunts with big laughs and a surprisingly emotional storyline."
    },
    {
      "text": "With its blend of supernatural spectacle, engaging characters, and a touch of nostalgia, it's a worthy addition to the Ghostbusters legacy. So, grab your proton pack and prepare for a thrilling adventure that's sure to leave you frozen in awe."
    },
    {
      "text": "Like Slimer shoving snacks in his ravenous maw, “Ghostbusters: Frozen Empire” tries to cram way too many characters, storylines and iconic images into its two-hour runtime."
    },
    {
      "text": "Though the ensemble is too large, Frozen Empire does successfully find a decent balance between the multiple generations featured here, letting the younger cast drive most of the action without leaving the older characters on the sidelines."
    },
    {
      "text": "The tone is muddled, to be sure, but that is just the state of “comedy” on the big screen these days. Gone is the willingness to push the boundaries, as is the sense of in-universe intelligence."
    },
    {
      "text": "Ever get the feeling you’ve just been slimed with something other than ectoplasm?...Like so many of the post-content films crammed down our throats over the past 30+ years, [it] is not so much a film as an extended exercise in brand recognition."
    },
    {
      "text": "Frozen Empire offers familiar set pieces, callbacks, and references aplenty, but the nostalgia tank is now running on empty."
    },
    {
      "text": "The reliance on nostalgia weakens the plot, but the graphics and special effects help to reinforce the spectral oddities while the old and new casts blend well to create a loveable extended family."
    },
    {
      "text": "It often favors tone and attitude over a propulsive story, which can drag things a bit, but that tone and attitude nail the indescribable feeling of a Ghostbusters movie...And busting makes us feel good, even when it’s messy."
    },
    {
      "text": "Ghostbusters: Frozen Empire is a joyous and inspired continuation of the Ghostbusters franchise. The cast additions and the inventive storytelling make Frozen Empire feel fresh and new."
    },
    {
      "text": "What it lacks in intelligence it makes up for with good vibes and great casting."
    },
    {
      "text": "Everyone is here—Bill Murray, Dan Ackroyd, Paul Rudd, the list goes on—so it's less who you gonna call than why?"
    },
    {
      "text": "\"Like Afterlife, Frozen Empire ultimately succeeds because it’s so much fun to watch\""
    },
    {
      "text": "Ghostbusters: Frozen Empire manages to outdo 2021’s Ghostbusters: Afterlife thanks to a stronger script with less reliance on callbacks to carry so much of the weight of the film."
    },
    {
      "text": "Ghostbusters: Frozen Empire doubles down, fully committing to its existence as a cynical nostalgia raid masquerading as a movie."
    },
    {
      "text": "About half way through things begin to click together a bit more but there's too many characters and too much set up and the movie isn't as funny as it could be."
    },
    {
      "text": "Never mind a death chill, Frozen Empire feels more like the death rattle for the franchise. The sad truth is bustin’ doesn’t really make us feel that good anymore."
    },
    {
      "text": "Like many reboot sequels before it, reminds us why this franchise died when it did. Please put it back in the Containment Unit immediately."
    },
    {
      "text": "If you ever wondered what a live-action version of The Real Ghostbusters animated series might look like, Frozen Empire is the answer."
    },
    {
      "text": "Nothing can ever live up to the original but Ghostbusters: Frozen Empire is another solid outing for the franchise in bringing the scares and fun."
    },
    {
      "text": "“Ghostbusters: Frozen Empire” is messy, visually unappealing, and worst of all, unfunny, and is further evidence that major studios too often rely on brand recognition to make them money rather than putting together a film worth audiences’ time."
    },
    {
      "text": "Overall, Frozen Empire banks on the nostalgic fan-service a little too much. What is the point of creating a new legacy of heroes when everyone is still stuck in the past?"
    },
    {
      "text": "Even more so than Jason Reitman’s “Ghostbusters: Afterlife,” this latest breezier iteration of the ‘Ghostbusters’ franchise leans into the series’ peculiar weird and quirky corners with unhurried patience."
    },
    {
      "text": "Frozen Empire is a notable improvement on Afterlife – funny, silly, and a little scary, with its pockets full of hand-built doodahs and the occasional excursion into the realm of pseudo-mythology and parapsychology."
    },
    {
      "text": "Although “Frozen Empire” improves upon the previous film and there's plenty to dig especially for young fans, it falls short of the 1984 classic's high bar."
    },
    {
      "text": "The Ghostbusters franchise continues to be one of the worst offenders of peddling cheap and easy nostalgia for laughs and poignancy."
    },
    {
      "text": "...Ghostbusters: Frozen Empire is hardly worth hating; it’s a lightweight, amiable, will-this-do? fantasy…content to recycle dialogue, musical, special effects and situations from the first film rather than figure out what made it work in the first place."
    },
    {
      "text": "The clumsy mixture of nostalgia, scares, set pieces, sincerity and wisecracks never gels, tempting a conclusion that it is perhaps time for Sony to give up this particular ghost."
    },
    {
      "text": "Ghostbusters: Frozen Empire races onto thin ice overburdened with disparate, uninspired ideas  – and no one behind or in front of the camera quite knows what to do once the movie’s flailing in the water."
    },
    {
      "text": "Elsewhere original Ghostbusters stars Dan Ackroyd and Ernie Hudson do most of the fan-service heavy lifting... Bill Murray pops up late on with the air of a veteran celebrity going through the motions to pocket an exorbitant appearance fee."
    },
    {
      "text": "The film's pacing is slow, and the plot doesn't truly rear its head until the end, which results in a fairly dull experience."
    },
    {
      "text": "Frozen Empire is burdened by too many characters telling bad jokes to be good, but it at least put them all in the New York City firehouse. That’s where the Ghostbusters, both old and new, belong."
    },
    {
      "text": "While “Frozen Empire” sometimes overdoes it with the 21st-century green-screen stuff, and there are a few lags in the action around the midway point, this is a big and boisterous and just plain fun amusement park ride of a movie."
    },
    {
      "text": "One could only make the case that Kenan and Reitman are pivoting from comedy to action if either the action or the comedy played more effectively."
    },
    {
      "text": "Too many characters and callbacks plus a formulaic plot means Frozen Empire doesn’t touch the original movies, but it’s a likeable-enough brand extension."
    },
    {
      "text": "An innocuous, family-friendly supernatural adventure with too many characters and a severe shortage of jokes."
    },
    {
      "text": "Everything about the film is undercooked and lazy, and one is led to hope that this franchise is put back in the deep freeze for a very long time."
    },
    {
      "text": "There is a noxious undead pong emanating from this latest entry in the 1980s franchise, which is now being necromantically sustained through force of sheer commercial desperation, and nothing else."
    },
    {
      "text": "“Frozen Empire” has enough going on in it to connect, but now that Jason Reitman and company have brought this series back to life, it’s time to re-infuse it with the spirit that Kumail Nanjiani brings."
    },
    {
      "text": "Poorly paced and incredibly ill-conceived, it’s utterly baffling that, in this day and age of creative fan fiction, no one could come up with a more inventive, innovative tale than this one chosen."
    },
    {
      "text": "Feels like it exists as a studio imperative first — “Make a Ghostbusters movie with the cast of the old movies and the cast of the new movie!” — and a compelling story a very distant second."
    },
    {
      "text": "It is confusing at times, and not everything works, but Frozen Empire does a very good job of keeping the flame alive, 40 years after the fact."
    },
    {
      "text": "Frozen Empire isn’t terrible, but it’s also just not as much fun as the previous movie, and because of that, it just might not have the same amount of rewatch value either."
    },
    {
      "text": "Simply showing a character, making a somewhat similar joke, or even recreating a scene from the first film isn’t helping this film in any way. It’s lazy and only reminds the audience that they’re not watching that film instead."
    },
    {
      "text": "This franchise might not be entirely dead just yet, but its latest resurrection doesn’t make nearly enough good arguments to keep pumping life into it."
    },
    {
      "text": "Ghostbusters: Frozen Empire doesn’t mess with the well-honed formula, carefully balancing its laughs and scares in the breezy manner that makes for pleasurable, if lightweight, viewing."
    },
    {
      "text": "If they keep making bland and unoriginal entries like this, it proves that if you've seen one Ghostbusters, you've seen them all."
    },
    {
      "text": "There was potential here, but Frozen Empire is an overpopulated mish-mash, with too many heroes to wrangle. What’s left is a bit of a gooey mess. We’ve been slimed."
    },
    {
      "text": "I ain't afraid of no ghosts - but I am afraid of how this sequel is going to be received by fans. Who ya gonna call? I'm calling the 80's. And parents, this Ghostbusters may NOT be for kids this time."
    },
    {
      "text": "The time has come for Hollywood to allow the spurious Ghostbusters franchise to join Jurassic World and Aquaman in the bin and think of something new."
    },
    {
      "text": "They spend way too much time setting up an extended universe that may never happen, and don't focus enough on the characters established by Afterlife."
    },
    {
      "text": "While there are aspects of \"Frozen Empire\" that may remind fans of the expanded spiritual lore that came with \"The Real Ghostbusters\" animated series, it never coalesces into a solid blockbuster. It's dogs and cats, living together. Mass hysteria."
    },
    {
      "text": "The widespread criticism of the \"Ghostbusters: Frozen Empire\" trailer, that it looked like the filmmakers thought they were creating the next part of a sci-fi saga rather than a comedy one, bears out in the finished product."
    },
    {
      "text": "If one were to strip away the callbacks to Slimer and the walking Statue of Liberty — everything from all the previous films except for the 2016 movie … — this two-hour movie probably would clock in around 20 minutes."
    },
    {
      "text": "Ghostbusters: Frozen Empire has a lot of potential and a chilling new villain, but too many characters and a slower plot leads to dimmed thrills."
    },
    {
      "text": "Ghostbusters: Frozen Empire takes the training proton packs off and allows the cast to embrace more of an original story this time around, although there are still plenty of nostalgic references abound. Bustin' still makes me feel good."
    },
    {
      "text": "'Ghostbusters: Frozen Empire' is dragged down by its obsession with the past. If the franchise is to continue, its caretakers could learn something from another 'Frozen' and let it go."
    },
    {
      "text": "While it is a bit too long, and certainly has its slow moments at the start, this movie is a whole lot of fun with some fantastic visuals. At its core, it is all about family, both blood and chosen."
    },
    {
      "text": "An incredibly serviceable instalment, offering up all the hallmarks of the 40-year-old film series... While it’ll hold up as one of the better Legacy Sequels of the era, it does tumble for the usual pitfalls... OG fans will have a great time."
    },
    {
      "text": "Ghostbusters: Frozen Empire is imperfect (though entertaining) evidence that busting still makes me feel good."
    },
    {
      "text": "Frozen Empire has some charming performances and moments from McKenna Grace (steals the movie again) and Paul Rudd. But it is a bit overstuffed, even more so than Afterlife. The biggest shame is the wasted use of Bill Murray, yet again."
    },
    {
      "text": "It all resembles a lot of cosplaying, although its central failing is foregrounding cacophonous mayhem and middling melodrama over the drollness that defined the first two Ghostbusters movies."
    },
    {
      "text": "I wanted more from Frozen Empire. An Entertaining delight that frustrated me at the same time. As a Ghostbusters fan there is fun to be had but there are multiple issues that hold the film back from the greatness that Afterlife had brought in. A Mixed Bag"
    },
    {
      "text": "Ghostbusters: Frozen Empire is not the original movie and never would be, but it's an entertainingly spooky blockbuster that proves there's life in this franchise yet."
    }
  ],
  "release_year": 2024,
  "duration": 115,
  "genres": [
    "Comedy",
    "Fantasy",
    "Adventure"
  ],
  "synopsis": "In Ghostbusters: Frozen Empire, the Spengler family returns to where it all started -- the iconic New York City firehouse -- to team up with the original Ghostbusters, who've developed a top-secret research lab to take busting ghosts to the next level. But when the discovery of an ancient artifact unleashes an evil force, Ghostbusters new and old must join forces to protect their home and save the world from a second Ice Age.",
  "popularity": 8.1,
  "poster_url": "https://image.tmdb.org/t/p/original/e1J2oNzSBdou01sUvriVuoYp0pJ.jpg"
}