{
  "movie_name": "Girls Trip",
  "movie_id": "girls_trip",
  "total_reviews": 175,
  "reviews": [
    {
      "text": "It does have a little issue with its comedic tone but for the most part this is a film that works pretty well. There are moments that will make you chuckle and there is enough heart to win over any audience."
    },
    {
      "text": "I want at least three more sequels and a series after this."
    },
    {
      "text": "Moviegoers who endured a rough night watching the recent Rough Night will fare significantly better with Girls Trip."
    },
    {
      "text": "Expect start-to-finish hilarity, of both a sexual and scatological nature."
    },
    {
      "text": "These grosser gags may put some off, but most will cry with laughter. When these four share the screen, sparks fly and the chemistry is perfect."
    },
    {
      "text": "It's a raucous ride, unlike anything I've ever seen in theaters."
    },
    {
      "text": "Girls Trip is clearly not the product of comic actors haphazardly riffing on set until they reach their joke quota. Here, instead, is a movie that feels like having fun with real people."
    },
    {
      "text": "If you need a good deep belly laugh, this is your movie."
    },
    {
      "text": "A perfect example of a film where the cast truly matters."
    },
    {
      "text": "A refreshing, charming and often very funny getaway with the girls!"
    },
    {
      "text": "Saucy laughs land rapid fire"
    },
    {
      "text": "It was really funny. Go see it."
    },
    {
      "text": "This movie is hilarious."
    },
    {
      "text": "Girls Trip has an appeal that goes beyond the limp plot devices and superfluous storylines. There's certainly the \"about damn time\" quality that runs through the whole movie, and a great number of the R-rated jokes land."
    },
    {
      "text": "... The bond between the four women - and occasional lack thereof - demands repeat viewing much more than the sporadic shocks of gross-out (and grapefruit) humor."
    },
    {
      "text": "It's frequently filthy fun that provides countless laughs and all the emotions. There's meaning behind the laughs though, a celebratory message of female friendship that will resonate universally."
    },
    {
      "text": "It's pretty cool to see a comedy starring black women getting to do all the raunchy, fun humor that usually we see white men do all the time, occasionally black men and that one time we saw white women."
    },
    {
      "text": "This is a film that takes Bridesmaids and Trainwreck up a notch."
    },
    {
      "text": "The film, in both explicit and implicit ways, is a necessary celebration of women as partners and not competitors."
    },
    {
      "text": "Girls Trip accomplishes much thanks to the charisma and chemistry of the four lead actresses."
    },
    {
      "text": "The jokes work because you like these characters."
    },
    {
      "text": "Girls Trip is a great two hours of pure escapism with some disgustingly hilarious and joyful moments, but we could really have done without so much schmaltz being piled on top."
    },
    {
      "text": "Girls Trip is a film that is a hilarious time at the movies thanks to the energetically raunchy script, the wonderful cast and the dynamite chemistry."
    },
    {
      "text": "Girls Trip turns caricatures into characters and leaves us with the best comedy so far this summer."
    },
    {
      "text": "It's always a pleasure when a film portrays its female characters with a warmth and realism that makes you long to hang out with them if they existed in the real world."
    },
    {
      "text": "It's just too bad that a film purporting to espouse female empowerment has to resort to simulated fellatio, public urination, and full-frontal male nudity in order to get its biggest laughs."
    },
    {
      "text": "The sparkling and heartfelt performances from the four leads, plus the sheer boisterousness of the script, makes this a proper laugh-out-loud watch."
    },
    {
      "text": "Girls Trip is raunchy comedy performed to perfection."
    },
    {
      "text": "Watch this movie if you haven't. It's a goddamned national treasure."
    },
    {
      "text": "Well, the latest free-wheeling feminine-induced frenzy is presented in the form of filmmaker Malcolm D. Lee's infectiously bouncy and boisterous, soulful sisterhood romp Girls Trip."
    },
    {
      "text": "Tiffany Haddish is a comedic hurricane. [Full Review in Spanish]"
    },
    {
      "text": "Girls Trip never feels like it is judging its characters, even at their most outlandish. Instead it repeatedly sends a message that being yourself and living your truth are the way to find happiness."
    },
    {
      "text": "Despite a generic title and a somewhat formulaic plot, \"Girls Trip\" emerges as the best raunchy comedy since \"Bridesmaids.\""
    },
    {
      "text": "This is a film in which the cast has so much fun that the audience can't help but have fun as well."
    },
    {
      "text": "Movies such as Girls Trip challenge the confines of the ways women are allowed to be funny-especially Black women."
    },
    {
      "text": "The film is caught in this weird headspace of succeeding at its basest level despite missing the opportunity to excel at its loftiest instead."
    },
    {
      "text": "It's one of those things that probably would have flown under the radar had it not been for Haddish."
    },
    {
      "text": "A refreshingly hilarious raunchy comedy that proves that raunchy comedies can be fun."
    },
    {
      "text": "While predictable, the film makes up for it in all the right ways - this comedy rivals any of its \"bromance\" predecessors."
    },
    {
      "text": "Y'all, this movie is one wild ride that must be taken. Everybody needs to see it. Unless you can only enjoy a movie in a completely silent theater... then you may want to try to catch an empty screening."
    },
    {
      "text": "Never before have I wished a film was subtitled, as the audio just could not compete with the thundering roar of the crowd."
    },
    {
      "text": "Girls Trip surprised me. It was funny, heartfelt, and had a couple of good messages in it."
    },
    {
      "text": "[Tiffany] Haddish is a genius technician of physical comedy, at once subtle and gigantic."
    },
    {
      "text": "The MVP of Girls Trip, however, is Tiffany Haddish. This should be a huge break-out role for her, and she is so insanely funny that she'll send you into a rabbit hole of YouTube videos from her stand-up routines after the movie."
    },
    {
      "text": "The film is remarkable for its willingness and ability to flaunt its generic premise and go to far stranger, more empowering places than its simple setup might suggest."
    },
    {
      "text": "It's a beautiful tribute to Black womanhood, friendship, and joy in a hilarious package."
    },
    {
      "text": "Girls Trip isn't a perfect movie - it's kind of sloppily made in spots and, like most comedies lately, 20 minutes too long but it's hard to care about flaws when a movie is this much fun and the friendships this engagingly portrayed."
    },
    {
      "text": "By far the best comedy of the summer, if not the year, it strikes comedy gold. It's that ridiculously good."
    },
    {
      "text": "It's served well by a likable cast."
    },
    {
      "text": "It will be way too much for some, but does have a heart, ends on a nice note and you certainly won't forget the totally un-embarrassable Haddish in a hurry."
    },
    {
      "text": "Expect plenty of raunchy moments and outrageous drunken situations. The story is a no-brainer too."
    },
    {
      "text": "Girls Trip is the breakout comedy of 2017. Do not let the summer end without going to see this movie."
    },
    {
      "text": "Girls Trip is as pure as Old School or Bridesmaids, and like both, boasts a breakout star. Haddish steals every scene."
    },
    {
      "text": "It's another Bridesmaids-inspired stumble through the tropes of bad-girl comedy, which includes the mandatory set-piece involving the expulsion of bodily waste...and plenty of blue talk, which is now a regular, if not defining, feature of female comedy."
    },
    {
      "text": "It's able to balance genuine insight with comic punctuation and shameless resolution; they get high and heartfelt."
    },
    {
      "text": "Malcolm D. Lee's exuberant Girls Trip easily outclasses the likes of Bad Moms and Rough Night."
    },
    {
      "text": "Girls Trip's overriding focus is that of friendship -- in its all its raw, bawdy, compromised glory."
    },
    {
      "text": "As silly, crude and debauched as the antics get, the warmth and joy surrounding the four protagonists continually sets the movie apart from its predecessors."
    },
    {
      "text": "Girls Trip is everything you want out of an R16 buddy-reunion movie. It is truly funny, touching when it needs to be, relentlessly filthy and gleefully puerile at times. But it is also something more."
    },
    {
      "text": "IF you missed the girls-gone-bad comedy of Rough Night earlier this year, don't worry. Go and see Girls Trip instead."
    },
    {
      "text": "Girls Trip is better plotted than the similarly themed, Scarlett Johansson-vehicle Rough Night from earlier this year. It has a looseness to its structure that helps the momentum move from one crazy set-piece to the next."
    },
    {
      "text": "However, for all of its ferocious sexual frankness and ear-burningly colourful language, Girls Trip not only knows how to land a big laugh, but also how to sustain and magnify it."
    },
    {
      "text": "Bridesmaids for black people, Girls Trip is high energy raucous fun in praise of girl-power, complete with brash, crude dialogue and sexual connotations"
    },
    {
      "text": "Girls Trip doesn't tread into the realm of body horror like The Beguiled or Rough Night (or hormonal horror, like 20th Century Women), but it allows four charismatic and well-matched leading ladies to give audiences an evening of good, unclean fun."
    },
    {
      "text": "Raunchy comedies aren't everyone's favorite, but for those who like them, Girls Trip will do quite nicely. It may even turn out to be one of summer's few real surprises."
    },
    {
      "text": "Is Girls Trip a hilarious, turnt-up celebration of Black womanhood and sexuality? YAS! But at its core, it's about personal integrity, self-love, and female friendship."
    },
    {
      "text": "The film lives or dies based on the chemistry between the actors, which is just off the charts."
    },
    {
      "text": "Girls Trip is the perfect example of star charisma elevating the material they're working with."
    },
    {
      "text": "These four hilarious ladies prove that, when done right, low brow humor can be an art in itself. [Full review in Spanish]"
    },
    {
      "text": "Girls Trip proves that a good laugh can cure anything, including the common case of a familiar script. [Full review in Spanish]"
    },
    {
      "text": "The journey is surprisingly fun, owing to cut-above efforts by the principals and a story that, for all its absurdity, essentially spins on traditional themes of sisterhood, kindness and love."
    },
    {
      "text": "There have undoubtedly been more polished, stylish movies released this summer than Girls Trip - even among comedies. But were any of those movies this much fun?"
    },
    {
      "text": "Girls Trip presents laugh-a-minute bawdy humour."
    },
    {
      "text": "Girls Trip is a riotous celebration of Black female sexuality."
    },
    {
      "text": "It's loud, at times unwatchably gross and sometimes lingers on the verge of hysteria. But it's also a warm-hearted and optimistic celebration of black womanhood. Maybe friendship can save us all."
    },
    {
      "text": "The success of Girls Trip comes from the chemistry of the cast."
    },
    {
      "text": "It's already shaping up to be the surprise hit of the summer, which really isn't surprising at all once you've seen it. This is the kind of movie people tell their friends about."
    },
    {
      "text": "Like a cross between Bridesmaids and The Hangover it pokes a little fun at the self-help business and is enjoyably un-PC."
    },
    {
      "text": "[Girls Trip] isn't especially funny, and its sentimental sisterhood stuff is done by rote, but at least it's not one of those movies that fancy themselves as being terribly rude yet don't really have the nerve."
    },
    {
      "text": "Some of the comedy veers into the absurd, but each joke squarely hits its mark."
    },
    {
      "text": "The longer it goes on, the louder and shriller Girls Trip becomes."
    },
    {
      "text": "Haddish shoves everyone aside and fires a resounding shot across the bow of female comedians everywhere."
    },
    {
      "text": "There's nothing embarrassing about the Posse in Girls Trip, which depicts the friendships these characters have sustained not as vestigial remnants, but as a guiding force toward being true to oneself."
    },
    {
      "text": "... amuses primarily because of its scattered big laughs, unique cultural perspective, and the breezy chemistry between its stars"
    },
    {
      "text": "A trip well worth taking, though you may never look at a grapefruit quite the same way again."
    },
    {
      "text": "The movie is about a group of old college friends who take off for a long overdue girls' weekend in New Orleans, but, thanks to the smart script and Lee's slick direction, we're emotionally invested in each of their journeys."
    },
    {
      "text": "A raunchy comedy that's high on the raunch, but rather low on the comedy."
    },
    {
      "text": "Girls Trip is crude and veers towards soap opera but there is a chemistry between the stars, some funny situations and Haddish steals the show as the unrelentingly vulgar Dina."
    },
    {
      "text": "Girls Trip is the funniest movie this summer, and Tiffany Haddish is the breakout here, inducing a riot of laughs in this ensemble comedy."
    },
    {
      "text": "Newcomer Haddish takes Girls and, like Melissa McCarthy in Bridesmaids, puts it in her pocket as scene-stealing sexually aggressive Dina, who is unfiltered, unfettered and unapologetically wild."
    },
    {
      "text": "Perhaps it's best to embrace rave, raunch and riot, and go with the flow. Just try to avoid the flow in the Boulevard."
    },
    {
      "text": "Like Bridesmaids meets The Hangover, with the raunch factor turned up to eleven."
    },
    {
      "text": "Girls Trip may take us on a narratively familiar journey, but it more than makes up for it with comedic companionship and socially conscious, sexually liberated approach"
    },
    {
      "text": "Paired with a few good friends and a strong beverage or two, it's an absolute scream."
    },
    {
      "text": "What Girls Trip does have going for it is an irrepressible energy and an absolute lack of embarrassment about its own crudity and pants down humour."
    },
    {
      "text": "It's one of those movies that we just don't see made successfully as much anymore because the tone between humor, raunch and heart is more difficult to balance than you think."
    },
    {
      "text": "For all its X-rated gags, Girls Trip never strays far from its main messages: The importance of female solidarity and living your truth."
    },
    {
      "text": "No film with a cast this strong could fail to raise laughs. But the actors are wasted in a huge bloated mess."
    },
    {
      "text": "There is a severe shortage of comedies being made that can actually illicit an audible laugh and Girls Trip is here to make up for it."
    },
    {
      "text": "Throughout the film, there's a sharp specificity to the women's various emotional travails that cuts across its occasionally baggy construction."
    },
    {
      "text": "While conventional comedy fodder, Girls Trip surpasses all expectations with its ability to remain unapologetic even when you expect it to dial the gross out jokes down a notch."
    },
    {
      "text": "The interpersonal dramas are labored, but the movie earns laughs whenever it goes for them."
    },
    {
      "text": "Haddish's energy leaves a lasting impression. She makes Dina's outrageousness infectious. Although in keeping with the movie's humor, we may have to add infectious like a bad rash. The pleasures of Girls Trip aren't quite worth it."
    },
    {
      "text": "An indecently refreshing tonic of a film."
    },
    {
      "text": "Hot on the high-heels of \"Rough Night\" is \"Girls Trip,\" another female-driven raunch fest. Where they defer in their twin celebrations of sisterhood is that this one is all-caps FUNNY."
    },
    {
      "text": "Girls Trip may deal in broad comedy, but it's an example of broad comedy done well, and delivered by utterly committed performers."
    },
    {
      "text": "In all the ways 'Rough Night' went wrong, 'Girl Trip' goes hilariously right. Regina Hall, Jada Pinkett Smith, Queen Latifah and-yowza!- Tiffany Haddish let laughs bubble out of character instead of blunt-force farce. It makes all the difference."
    },
    {
      "text": "There is no raunchier, more raucous, filthy and truly crass movie out this summer than Girls Trip - and I loved every minute of it."
    },
    {
      "text": "The dynamic between the four friends leaps off the screen and makes \"Girls Trip\" a journey well worth taking."
    },
    {
      "text": "Unfortunately, the jokes stop being funny about 30 minutes before the end credits roll and the character-based elements are never better than overly familiar."
    },
    {
      "text": "Perhaps a cliché'd premise, but director Malcom D. Lee's Girls Trip manages to work with the well-worn narrative to create something fresh and fun."
    },
    {
      "text": "Screenwriters Kenya Barris and Tracy Oliver seem to be following a gross-out comedy template, but the two come up with just enough naughty gags to make the familiar journey work."
    },
    {
      "text": "Hall, Latifah, Haddish and Smith a comedic dream team I hope get the opportunity to reunite soon."
    },
    {
      "text": "Pinkett Smith and Queen Latifah are as reliable as ever onscreen. And Regina Hall gives one of her best performances as Ryan, who keeps on telling everyone you can \"have it all\" even as her own marriage tells a different story."
    },
    {
      "text": "Girls Tripisn't just notable for its foul-mouthedsense of humor; it tells a story that celebrates black sisterhood, female sexuality, and most rewardingly, self-respect."
    },
    {
      "text": "For some reason with this film, the wildness feels wilder, the vulnerability rawer and the sisterhood stronger."
    },
    {
      "text": "Girls Trip is funny and consistently entertaining, with female-empowering sexual content that will take your breath away."
    },
    {
      "text": "Warm-hearted but raunchy comedy has nudity, sex, language."
    },
    {
      "text": "The ladies-on-the-loose comedy that everyone needs right now, even if they don't know it yet."
    },
    {
      "text": "Malcolm D. Lee's film at least it goes down easy. Easy like a Sunday-morning hangover."
    },
    {
      "text": "It's hard to dislike a picture about four zany women that includes a reference to \"Indiana Jones and the Temple of Doom.\""
    },
    {
      "text": "\"Girls Trip\" is the funniest movie of its kind since \"Bridesmaids.\" (Full Content Review for Parents - Profanity, Nudity, Sexual Content, etc. - also Available)"
    },
    {
      "text": "After watching Girls Trip, it's a battle for second place for the funniest comedy of 2017. Nothing else is going to come close."
    },
    {
      "text": "'Girls Trip' is about friendship and loyalty. But that warm foundation is also fertile ground for ladies on the loose in the Big Easy. Director Malcolm D. Lee and his quartet of ready-to-play actresses hit the streets running."
    },
    {
      "text": "Haddish is so incandescently filthy that a new ratings system should be developed to accommodate her."
    },
    {
      "text": "\"Girls Trip\" accomplishes exactly what it sets out to do: shock and amuse. Along the way, it reminds us how important old friends can be."
    },
    {
      "text": "One thing is for certain: Girls Trip should make a star of Tiffany Haddish..."
    },
    {
      "text": "For the most part, \"Girls Trip\" balances sincere sentiment and boisterous comedy with honesty and skill, and for people who like their comedy a little nasty, this one's a blast."
    },
    {
      "text": "Now this is how you do a female raunch comedy."
    },
    {
      "text": "Girls Trip is just fun, a movie that-even within the context of its broad, exaggerated humor-never seems to be trying too hard."
    },
    {
      "text": "Sexy, sharply written and beautifully acted ..."
    },
    {
      "text": "Among the funniest movies of the year, period."
    },
    {
      "text": "Bridesmaids proved that women could be just as smutty onscreen as men, but this fast-paced comedy is ruder, cruder, funnier, and more explicit."
    },
    {
      "text": "\"Girls Trip\" is a hilarious reminder that we all need a Flossy Posse to make us laugh until our sides ache and give it to us straight when no one else will."
    },
    {
      "text": "Girls Trip is a very good time."
    },
    {
      "text": "The film is audacious and unabashed in its determination to draw laughs from material that takes vulgarity to the extreme. Some of it works while a lot of it is just head-shakingly awful."
    },
    {
      "text": "[the screenwriters] give us four cliched characters with the usual friendship and life obstacles, mix in pee showers and a couple of penises, then wrap it all up in sisterhood. If all it takes to make you laugh is a naked man, this one's for you."
    },
    {
      "text": "By trying to be both grossly outlandish and sweetly endearing, the movie is alternately crass and mawkish."
    },
    {
      "text": "Fierce and funny, Girls Trip will inspire real-life Flossy Posse girls to go on their own getaway without dudes or kids - even if it's just to the corner bar."
    },
    {
      "text": "Haddish is a wild-card actress that Lee keeps playing in Girls Trip, and he draws an inside straight nearly every time."
    },
    {
      "text": "While there isn't a whole lot distinguishing the film from all the other movies featuring women behaving... however the f--- they want to behave, it does try and elevate itself a little by asking the age-old question: What does it mean to have it all?"
    },
    {
      "text": "The no-holds-barred comedy generally works, largely thanks to a game cast that plunges into the raunchy material with gleeful abandon."
    },
    {
      "text": "A concerning four writers worked on the script, which may be why it's so long and heavily episodic. But they created many quotable lines, a must for any comedy."
    },
    {
      "text": "At its best, \"Girls Trip\" takes you someplace as entertaining as it is familiar."
    },
    {
      "text": "Pops with next-level ribaldry and smack talk, especially in its first half. But in the remaining hour, the laughs arrive less often as the gender politics grow weirder."
    },
    {
      "text": "Consistently manages to rework and even reinvigorate some severely worn-out conceits, setups and character types, mostly by complicating gender roles with class issues."
    },
    {
      "text": "A raunchy, good-hearted celebration of friendship; as funny as it needs to be, and possibly funnier."
    },
    {
      "text": "Each time the script wobbled into cliché, I cringed. The actresses are too talented to flail on hallucinogens. But they launch into idiocy with so much energy that even the dumbest scenes lift-off."
    },
    {
      "text": "I can't wait to see this film again (and again), and to watch Haddish in whatever she does next."
    },
    {
      "text": "In a summer starved for quality comedy, Girls Trip is a welcome blast."
    },
    {
      "text": "The girls of \"Girls Trip\" prove that women can be many things: powerful, naughty, gross, hilarious and sexy, while still lifting each other up."
    },
    {
      "text": "A big crowd-pleasing comedy that's a little too long, squishy, and sloppy for its own good."
    },
    {
      "text": "It might not transcend the friends-behaving-badly genre, but it does manage its share of naughty laughs and token emotion, all with New Orleans serving as a fetching backdrop."
    },
    {
      "text": "A potent mix of crass, sass, and (whoa) class."
    },
    {
      "text": "An important reminder of how the rest of American culture needs to catch up when it comes to cultural appropriation and the way black women are talked about and portrayed."
    },
    {
      "text": "Girls Trip turns a familiar formula into something funny, fresh and hugely charming."
    },
    {
      "text": "\"Girls Trip\" doesn't hesitate to earn its R rating, and some of its best moments are its bawdiest (thanks largely to Tiffany Haddish). The movie has its flaws, but they're tough to remember in the face of the fun it provides for two hours."
    },
    {
      "text": "Tiffany Haddish gives the kind of turn - like Michael Keaton in \"Night Shift\" or Jack Black in \"High Fidelity\" - that makes you want to see her in everything and wonder why she isn't everywhere already."
    },
    {
      "text": "It's very unique and will leave its own lasting imprint on the good-girls-gone-wild genre."
    },
    {
      "text": "The vulnerability displayed by the female characters is touching without veering into saccharine territory."
    },
    {
      "text": "This not-so-original but well executed and hilarious comedy is sparked by breakout actress Tiffany Haddish. This is the funniest and raunchiest film featuring a group of actors to come out since Bridesmaids!"
    },
    {
      "text": "Girls Trip wants to be shocking but is so pedestrian it has no surprise."
    },
    {
      "text": "I saw the film in a theater full of sisters who laughed so loudly that I must have missed half the picture's punchlines."
    },
    {
      "text": "Girls Trip's black female quartet confirms the all-American commitment to life, liberty, and the pursuit of happiness."
    },
    {
      "text": "Were the jokes in Girls Trip funnier it would be far easier to overlook the flaws which mar the experience. There are some laughs to be had in the movie, but the balance of serious elements and humor never feels right."
    },
    {
      "text": "There's a genuine sense of friendship, and comedy throughout, that make the film one of this summer's most surprising comedies."
    },
    {
      "text": "Hall, Queen Latifah, and Pinkett Smith are sensational, but it's Tiffany Haddish's performance as Dina that will solidify [Girls Trip] as one the best comedies of the summer."
    },
    {
      "text": "I never expected Girls Trip to be the funniest film of the year but it is. Girls Trip is not only raunchy comedy done right but feminism done right."
    },
    {
      "text": "Where Rough Night apparently failed, Girls Trip succeeds, perfectly capturing what it feels like when women who genuinely love each other let their hair down together and just have a good time"
    },
    {
      "text": "The Bridesmaids ain't got nothin' on these girls... The funniest movie of the summer."
    },
    {
      "text": "\"Girls Trip\" has something for everyone - provided that they're old enough to see a hard-R-rated comedy, and not so easily offended that an explicit demonstration of the so-called \"grapefruit technique\" would send them running for the exits."
    },
    {
      "text": "The progression from raunchy, raucous laughs into dramatic conflict and then out the other side into the uplifting empowerment of sisterhood and self-worth isn't entirely seamless, but there's too much dizzy pleasure here to get hung up on the flaws."
    },
    {
      "text": "Unlike some similar comedies about grownup friends, the four core characters are actually likeable."
    },
    {
      "text": "Tiffany Haddish is the best thing going in a film that has plenty else to recommend it, especially for audiences eager to see a truly wild summer comedy."
    },
    {
      "text": "We're in it for the ride, the company, and the pure pleasure of watching these women, and the actresses playing them, embrace an independence Hollywood doles out too grudgingly."
    }
  ],
  "release_year": 2017,
  "duration": 122,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Best friends Ryan, Sasha, Lisa and Dina are in for the adventure of a lifetime when they travel to New Orleans for the annual Essence Festival. Along the way, they rekindle their sisterhood and rediscover their wild side by doing enough dancing, drinking, brawling and romancing to make the Big Easy blush.",
  "popularity": 7.8,
  "poster_url": "https://image.tmdb.org/t/p/original/mdsHCFt2PeZacEr38y2p5RRf6Hl.jpg"
}