{
  "movie_name": "Gladiator",
  "movie_id": "gladiator_ii",
  "total_reviews": 392,
  "reviews": [
    {
      "text": "Mescal is stoic, Pascal is tragic, and Nielsen is pointless, but Denzel is having a fucking blast. Nobody told him this was another redemptive revenge story, or if they did, he simply doesn't care."
    },
    {
      "text": "Paul Mescal brings plenty of intensity to the role of Lucius, but he ultimately pales in comparison to Russell Crowe’s towering performance in the original."
    },
    {
      "text": "There are hints of what Gladiator II could have been in the more intimate scenes between star Paul Mescal and Connie Nielsen–thanks to the actors, not the leaden script which insists on keeping their relationship as black and white as possible."
    },
    {
      "text": "Once free to enjoy the sequel on its own merits, it is easy to find a smart, deliberately excessive Hollywood blockbuster with its own elaborate, idiosyncratic style and appeal."
    },
    {
      "text": "While Gladiator II operates in the shadow of its predecessor, it isn’t exactly a carbon copy."
    },
    {
      "text": "And \"Gladiator II\" is an epic. Love, vengeance, loyalty, betrayal, lost faith, returned conviction — all things that make this story of an empire’s fall and return to the people powerful in its telling."
    },
    {
      "text": "While all of this marks Gladiator II as an unequivocal failure as a sequel and remake, it is admittedly still an adequate actioner."
    },
    {
      "text": "Director Ridley Scott’s historical epic ramps up swords-and-sandals violence, delivering a visual spectacle of decapitation, dismemberment, and free-for-alls that include battles at sea. Yet the story doesn’t have the same resonance as the original."
    },
    {
      "text": "Sadly, Gladiator II fails to recapture what made the first film special. While it isn't egregiously terrible, it's forgettable and dull, which is arguably worse."
    },
    {
      "text": "Watching Gladiator II, it is hard not to be a little suspicious about exactly what we are longing for in our Roman fantasies."
    },
    {
      "text": "Paul Mescal delivers a primal, combustible performance in this disappointing sequel from Ridley Scott. Denzel chews a colosseum's worth of scenery that almost saves this uninspired rehash of 2000's GLADIATOR with terrible CGI and a flat finale....almost."
    },
    {
      "text": "Gladiator II is a great watch for anyone who hasn't watched the first part. This one is grander, more spectacular, and even more visceral than the first one, turning it up by a few notches in every department."
    },
    {
      "text": "It’s telling that it takes two actors, Quinn and Hechinger, to approximate the levels of insanity and menace that Phoenix achieved all by himself. And Mescal … doesn’t bring the same brooding charisma that Crowe had in abundance."
    },
    {
      "text": "By the end, you’ll have to answer the question: Were you not entertained?"
    },
    {
      "text": "It’s curious how little of the story is new, compared with the former film. Gladiator-slave in Rome, fighting to stay alive but also to prove a point: that Rome just ain’t what it used to be."
    },
    {
      "text": "A sequel to the 2000 hit focusing on two charismatic leaders who could determine the future of Rome."
    },
    {
      "text": "Despite its shortcomings, Gladiator II delivers a full-bodied adventure that skillfully balances responsiveness to its audience’s expectations with a reverence for the epic grandeur of its predecessor."
    },
    {
      "text": "It is Denzel Washington, who steals the scenes."
    },
    {
      "text": "Washington’s gleeful wheelings and dealings, as Macrinus whispers poison into the ears of the emperors, are easily the best thing about Gladiator II. He seems to know exactly the level of camp to bring to the proceedings."
    },
    {
      "text": "Overall, Gladiator II is a fun ride and worth watching. Sure the action sequences jump the shark, but perhaps the film should have done even more shark-jumping. I just wouldn't recommend rewatching Gladiator in the leadup."
    },
    {
      "text": "You walk out of Gladiator II feeling at least vaguely how you felt at the end of Scott’s 2023 biographical epic, “Napoleon.” Scott’s just given you stretches of filmmaking that only he can deliver but an overall experience that feels less than cohesive."
    },
    {
      "text": "This film destroys much of the first film's legacy and some of that is hinted at even in the trailers. With men riding rhinos and sharks in the stadium, this film has gone CGI-mad and taken the franchise into the fantasy genre."
    },
    {
      "text": "Washington's brazen, over the top, and electric performance is the biggest reason this movie rates fresh. The rest of it is a pale imitation of the original."
    },
    {
      "text": "It is a relentless entertainment, but ultimately it rises as a Colosseum-sized \"yes, but no\"."
    },
    {
      "text": "Scott is determined to deliver an epic of blood, violence and political conspiracy set in Ancient Rome, but the often rushed approach does not even possess a trace of its predecessor's soul. [Full review in Spanish]"
    },
    {
      "text": "It’s at the very least transporting and highly watchable despite its flaws, the mark of a director who’s spent the last decade content to churn out movies that you don’t regret seeing, but probably won’t be compelled to see again."
    },
    {
      "text": "In every important scene, the music and sound announce loudly and repeatedly the emotions to feel. There's no trust in independent thoughts or reactions."
    },
    {
      "text": "That’s a lot of movie, right there. But Scott manages to keep the overstuffed narrative humming along between volleys of shock-and-awe bombast... Are you not entertained? I was. And you will be too. Just not as much as the first time around."
    },
    {
      "text": "Not a bad film, but one that comes down firmly on the side ofspect acle rather than substance. And, yes, in answer to the inevitable question, you are entertained."
    },
    {
      "text": "Scott’s latest ambitious spectacle struggles to overcome a case of diminishing returns with a familiar retread of violent delights cast under the shadow of conniving political machinations."
    },
    {
      "text": "There is little to no characterization, it leans heavily on GLADIATOR (2000) or tropey politics to explain who these characters are and what their role may be here. And I absolutely love (genuinely) that Ridley Scott just does not care."
    },
    {
      "text": "Paul Mescal knows how to squeeze the sentiment (is it those puppy-dog eyes?) and give the story more than a little heft. He’s good in the arena, too, and captures just enough of Russell Crowe’s swagger to make you believe there’s a connection."
    },
    {
      "text": "All battle and fight scenes are expertly choreographed with surprise moves and situations__here’s where the film stands on its own."
    },
    {
      "text": "Filmmaker Scott's visuals are as sumptuous (and obviously expensive) as usual, but this is plainly a rehash of familiar material."
    },
    {
      "text": "We already saw this vision for a Romanic swords-and-sandals epic 24 years ago."
    },
    {
      "text": "...a predominantly (and disappointingly) underwhelming sequel..."
    },
    {
      "text": "Still very much a big-screen spectacle that spends two and a half hours unsuccessfully trying to justify its existence."
    },
    {
      "text": "As product, Gladiator II emulates both peplum entertainment and the classics. Mescal’s Lucius is a runty hero, Denzel’s undignified hamminess falls short of Shakespearean grandeur, and only the small roles achieve human dimension."
    },
    {
      "text": "Ridley Scott's 'Gladiator' follow-up is timely and appropriately angry, but its reverence for the original film's protagonist eventually undercuts its narrative and its convictions."
    },
    {
      "text": "I walked out of the theater wondering who exactly was this film for ... toga bros? Despite an epic scale it felt as if there was no \"there\" in this overlong sword and sandals complexity. If there is metaphor in the rise and fall of Rome, here we are."
    },
    {
      "text": "See it for the spectacle."
    },
    {
      "text": "For all its faults, Gladiator II is an extraordinary film, the kind that demands to be seen in theaters."
    },
    {
      "text": "As the wackiest, most bloodthirsty Roman emperors seem to have lodged themselves in the public imagination, Scott gives the people what they want."
    },
    {
      "text": "And, although the film falls short of the heights achieved by its predecessor, it is nevertheless a serviceable swords-and-sandals adventure and arguably the most entertaining film Scott has made in the past nine years."
    },
    {
      "text": "In a cast of veteran actors and extremely talented up-and-comers, Washington steals the movie. He takes the throne."
    },
    {
      "text": "Fast, brutal and absorbing, the shocker opener sets the template for the rest of the movie, which plays — and often feels — like one long, inventively diverse, elaborately imaginative fight."
    },
    {
      "text": "There’s something real in history that Gladiator II gestures toward subtly without mentioning it explicitly more than once. It’s the looming transformation of Rome from pagan decadence and conquering bloodlust to an unlikely accelerant of Christianity."
    },
    {
      "text": "Denzel Washington is the main reason why Gladiator II surpasses its original... [Full review in Spanish]"
    },
    {
      "text": "Someone saw the “how often dudes think about the Roman empire” TikTok shenanigans and said “Get Ridley on the phone.” And Ridley said, “I’ll only do it if we can fill the colosseum with water and have the gladiators fight sharks.”"
    },
    {
      "text": "The sheer force of talent in front of and behind the camera ultimately wins out, and drawbacks aside, this is a movie you’ll want to experience on a massive screen. Let Ridley Scott’s directorial prowess wash over you, and you won’t be disappointed."
    },
    {
      "text": "Paul Mescal just seems overwhelmed. At a lot of points, this film winds up feeling like an echo of the first film."
    },
    {
      "text": "This movie belongs to Denzel Washington. It was campier than the first one, and consequently I liked it better."
    },
    {
      "text": "The story and drama of Gladiator II may be fairly dull, but its superb action, visual spectacle and outlandish historical inaccuracy are where the film truly shines."
    },
    {
      "text": "Watch it purely for Denzel's performance."
    },
    {
      "text": "I wasn't the biggest fan of Paul Mescal's performance and the somewhat lackluster battle scenes, Denzel brings enough energy and fun to the screen to make this an entertaining watch."
    },
    {
      "text": "This film is \"Fresh\" strictly off of the performance of the great Denzel Washington. He elevates everyone around him in each scene he appears in. Despite its long run-time and forced callbacks to the first film, this is a solid watch because of Denzel."
    },
    {
      "text": "This sequel manages to be its own thing, and its jaded attitude feels right for the moment."
    },
    {
      "text": "If it doesn't quite match the staggering highs of Crowe's biggest movie star moments in the original, it comes pretty close."
    },
    {
      "text": "Instead of amplifying a by-the-numbers story with Pascal & Washington just waiting with more well-rounded ambition and arcs, it focuses entirely on the wrong protagonist, a basic revenge-driven Maximus-lite through action more ridiculous than adrenalized."
    },
    {
      "text": "It's Washington who ultimately makes \"Gladiator II\" stand apart from the first film and makes it a lot more fun than it has any right to be."
    },
    {
      "text": "It can't fill \"Gladiator's\" sandals."
    },
    {
      "text": "Where the original was a masterpiece of grit, vengeance, and sweeping drama, this sequel feels like it’s been cobbled together from a last minute brainstorm of, \"What if we just... added sharks?\""
    },
    {
      "text": "There’s an interesting throughline between the two films that, while they both have different identities that favor a progression in time, make sense together in a franchise."
    },
    {
      "text": "Impresses with stunning visuals and a stellar cast but struggles to match the emotional depth and originality of its predecessor, leaving mixed impressions despite its ambition."
    },
    {
      "text": "Ridley Scott’s sequel is entertaining, but it feels more like a remake."
    },
    {
      "text": "Gladiator II is a solid entertaining popcorn blockbuster story of rage, strength and honor with grisly impressive battle sequences but it still falls into the shadows of the monumental standards set by its predecessor."
    },
    {
      "text": "In the end, Gladiator II doesn’t live up to the Academy Award-winning Gladiator, but it is a solid addition to the family story and history."
    },
    {
      "text": "Gladiator II is fine, it’s a big spectacle executed mostly well, it has a number of pretty fun and/or good performances, Paul Mescal is certainly a movie star, and Denzel Washington is having the time of his life. Are you not reasonably entertained?"
    },
    {
      "text": "Paul Mescal and Denzel Washington's performances are the clear standouts in Sir Ridley Scott's sequel."
    },
    {
      "text": "I found this movie to be entertaining, a heady mixture of action and drama. It is very well acted by the lead actors, with strong supporting performances. Ridley Scott's direction, and production values are both solid, and the movie looks just great."
    },
    {
      "text": "Without his [Ridley Scott's] iconic visual eye or his interest in anti-capitalist stories, Gladiator II feels like his most anonymous film in decades."
    },
    {
      "text": "If you are looking for big spectacle entertainment it works"
    },
    {
      "text": "There’s ambition in “Gladiator II,” to be sure. There’s also a temptation to burden itself with the mere implications of conflict so we can’t see the absence of conflicts' roots."
    },
    {
      "text": "Mescal’s Lucius doesn’t quite live up to Crowe’s Maximus, but he has his moments, and Scott directs this with so much exuberance. After a shaky start, featuring a scattered plot, it finds its footing and balances its emotions beautifully."
    },
    {
      "text": "You WILL be entertained."
    },
    {
      "text": "The scale of the distractions correlates to the scale of dissoluteness and corruption. It’s almost as if history repeats itself."
    },
    {
      "text": "It’s aggressively fun, nothing more and occasionally less."
    },
    {
      "text": "It’s bonkers, but in a very good way, indeed."
    },
    {
      "text": "That insistence in creating parallels between the two “Gladiator” films—and between Lucius and Maximus—occasionally yields poetic results, though in general the outcome is contrived."
    },
    {
      "text": "\"'Are you  not entertained!?' - no, I'm not, but some people will be.\""
    },
    {
      "text": "Gladiator II whisks its audience away to the past while reflecting on the present and future. Could it have improved what we’ve witnessed before beyond simply tweaking parts here and there? Yes. But it’s one hell of an entertaining show."
    },
    {
      "text": "Gladiator II exudes so much … Capital-M Movie … that you are forgiving of the shadow the original casts over it."
    },
    {
      "text": "It’s thoroughly mediocre, not worthy of being reviled or glorified."
    },
    {
      "text": "Gladiator II commits the cardinal sin of legacy sequels: it adds something that actually diminishes the original. That is the film’s true travesty. And no, with that, I was not entertained."
    },
    {
      "text": "I liked the sharks. That's about it."
    },
    {
      "text": "A sequel fighting for two-and-a-half hours to justify its existence."
    },
    {
      "text": "It’s quite epic, engaging, and worth a trip to the theater. Minus some bizarre CG primate and shark additions in the ring that take you out a bit, it really is a worthy sequel that will keep you into the thrill of it all."
    },
    {
      "text": "Feels messy and unfocused; a narrative content to live in the past, in search of a hero who never really rises."
    },
    {
      "text": "The concept of following Lucius’ homecoming had potential, but it doesn’t quite fulfill his father’s promise to return glory to Rome."
    },
    {
      "text": "dared to make jumping the shark into an entertaining, literal and spectacle filled challenge. If you love it when someone embraces melodramatic ridiculousness and goes over the top, then you will love “Gladiator II.”"
    },
    {
      "text": "Best of all, as usual, is Denzel Washington. You can see he’s having a ball as the crafty, conniving, chuckling villain Macrinus. But he isn’t hammy or over-the-top; it’s a sly, subtle, carefully wrought performance."
    },
    {
      "text": "Ridley Scott's return to the coliseum is an entertaining, imperfect mosaic of tones and ideas that never quite fit together."
    },
    {
      "text": "Some of Mescal's best roles are his quietest, where we can imagine the complicated thoughts dancing behind his sad eyes. It's strange then, to see him super-sized into this heroic He-Man of a warrior, slicing and dicing nameless centurions."
    },
    {
      "text": "Mescal is easy to root for, soft-spoken and soft-eyed, convincing in the fight scenes, and holding the screen with authority even when paired with Denzel Washington, the movie’s real draw."
    },
    {
      "text": "While this sequel remains consistently watchable, Scott and Scarpa (who recently collaborated on the disastrous Napoleon) never catch the electrifying vibe of its progenitor."
    },
    {
      "text": "Instead of the sword-and-sandal thrills of solemn and deadly gladiatorial contests in the Roman arena, we get cartoonish computer-generated excesses that are more ludicrous each time the gladiators step out into the ring."
    },
    {
      "text": "If you’re paying attention, despite the copious gore, Denzel Washington having the time of his life as a scenery-chewing villain, and of course the sharks, you’ll leave the movie with a far deeper grasp of Rome as it actually was."
    },
    {
      "text": "Thanks to the actors who play them, Lucius and Marcus are affable chaps, but you can’t imagine why anyone would follow either of them into the ring."
    },
    {
      "text": "It could've stirred a conversation to add needed density to this simplistic popcorn blockbuster encased in middling CGI and an underwritten and frankly dull lead."
    },
    {
      "text": "The only surprise is that Mr. Scott, who has directed four movies in the last five years despite being in his mid-eighties... has chosen to devote his dotage to channeling fury like this. But it, and his star, are absolutely equal to the moment."
    },
    {
      "text": "It all works, and it's all because of Denzel."
    },
    {
      "text": "To believe in (and enjoy) Gladiator II is to suspend all knowledge on the Roman Empire and ignore everything about great storytelling… I simply cannot do it."
    },
    {
      "text": "Denzel Washington especially seems to be having a blast, hamming it up panto style as a plotting Iago-esque figure who steals every scene he’s in -- no mean feat considering how clunky the majority of the dialogue is. Solid, if overly broody."
    },
    {
      "text": "Gladiator II won’t have the lasting power of Gladiator. It’s a well-made & very entertaining sequel, but it’s chained to a hackneyed script. Scott proves that he still has the directorial expertise to turn average scripts into above-average movies though."
    },
    {
      "text": "Gladiator 2 is the one movie this year other than Wicked that absolutely been screened on a big screen! Denzel Washington delivers the crown jewel of his career with the cinematic gift of  Macrinus."
    },
    {
      "text": "It seems that this time around, Scott sacrificed soul for spectacle. There is a decent amount excitement here, but precious little emotion."
    },
    {
      "text": "Like Scott's last film, the curiously untethered Napoleon, Gladiator II is a display of elephantine emptiness.  No wonder it feels about 45 minutes too long."
    },
    {
      "text": "The good part about all of the overindulgences Scott granted himself in making “Gladiator 2” is that this is all piled upon a very solid foundation."
    },
    {
      "text": "It's an eye-popping, barbaric, sword-and-sandal, cinematic spectacle, featuring ferocious baboons, a saddled rhino and savage sharks...along with scene-stealing Denzel Washington, who should get a Best Supporting Actor Oscar nomination."
    },
    {
      "text": "If you're going to see Gladiator II, go see it in the biggest screen possible."
    },
    {
      "text": "Gladiator is a masterpiece, while Gladiator 2 is simply a sword-and-sandals action flick you'll forget about almost instantly."
    },
    {
      "text": "It's bigger, badder, and more violent... (with) Denzel doing his Macrinus thing (and) having the best time ever... Spectacle is the point... less serious, more entertaining."
    },
    {
      "text": "Paul Mescal, as Lucius, the muscular adult son of original \"Gladiator\" hero Russell Crowe, is supposed to be the star, but he gets upstaged almost from the get-go."
    },
    {
      "text": "Rome lives and breathes through Scott’s bravura filmmaking and Scarpa’s incisive script…Throw in a fiery Paul Mescal and a Denzel Washington performance for the ages, and you have the most entertaining big screen blockbuster of the year."
    },
    {
      "text": "History might keep repeating itself, but there's no reason for cinematic retreads to be this tiresome too."
    },
    {
      "text": "A worthy successor to the original Best Picture film. Definitely entertains via spectacle, blood, nostalgia and an excellent cast, that includes a brilliant Denzel Washington stealing every scene. [Full review in Spanish]"
    },
    {
      "text": "A sequel that knows exactly what it is: an unapologetically masculine continuation of a cinematic legacy built on violence, power, and epic battles. It works because it doesn’t force itself to be more than that."
    },
    {
      "text": "‘Gladiator II’ fights but fails to capture the magic of the first film."
    },
    {
      "text": "Once you get past the dazzling visuals, it basically just resets the mythology for a new set of heroes and villains in similar settings, dealing with many of the same themes and sociopolitical struggles as its predecessor."
    },
    {
      "text": "Scott and his collaborators pander so unabashedly to our bloodlust that it rings all the more hollow when Gladiator II suddenly fancies itself a civics lesson."
    },
    {
      "text": "Even if Gladiator II is essentially an unapologetic retread of its predecessor, all of these actors are fun to watch -- though none stands taller, literally or figuratively, than Denzel Washington."
    },
    {
      "text": "At the very least, you will walk out of “Gladiator II” entertained – but you won’t be much else."
    },
    {
      "text": "It’s so grandiose, the audience at my screening started applauding before a single fight had begun."
    },
    {
      "text": "Sir Ridley is 87 years old, and we only mention this because there's a vibrancy and verve to so much of this sequel that you'd swear the unbelievably prolific filmmaker has a personal fountain of youth in his Malibu mansion's backyard."
    },
    {
      "text": "Its existence makes the original film even better. The two pictures complement each other well, and taken as one whole story it becomes the high art epic that we all incorrectly remember the original film being."
    },
    {
      "text": "Gladiator II strips away the artsy veneer and simply exists as an action picture. I think it’s far more entertaining than the original."
    },
    {
      "text": "A movie bursting with just enough spectacle to keep it from being boring but, when you try to get anything out of it thematically, slips through your fingers like the sand in a warrior's hands."
    },
    {
      "text": "The long belated sequel begins with a series of painterly depictions of various clips of its far superior predecesor, and from that point on it never ceases to remind you that you've already seen a better version of all of this. [Full Review in Spanish]"
    },
    {
      "text": "Strong as Washington is, this is firmly Mescal’s movie."
    },
    {
      "text": "Gladiator II does not take itself seriously, and in many ways it is absolutely ridiculous. And that's probably why I liked it."
    },
    {
      "text": "Without a star who can summon a little more of that Crowian command, it’s a fool’s errand. Sad to say, no one is unleashing hell at Mescal’s signal."
    },
    {
      "text": "Lucius’s glorious, bloody, twisty, escapist Roman road to victory holds audiences captive from beginning to end."
    },
    {
      "text": "Cleary leaned into \"let's make a gripping action/adventure flick\" instead of a prestige sword-and-sandals epic like the original. Still quite enjoyable on that level, with a slithery charismatic turn from Denzel Washington buoying the non-fighting scenes."
    },
    {
      "text": "Gladiator II might not be its predecessor’s equal in all regards, but Scott remains unparalleled at threading the needle between myth and history without sacrificing any of the spectacle. That, folks, is entertainment."
    },
    {
      "text": "There are bad movies that are entertaining and bad movies that are a drag, and I wish I could tell you which one this unasked-for sequel to the best-picture-winning 2000 film is. The truth is, it's both."
    },
    {
      "text": "It functions like a pale imitator."
    },
    {
      "text": "The visual splendors of this new film easily equal and sometimes exceed the indelible visions of the first film"
    },
    {
      "text": "My complaint isn't so much that this one doesn't reach the same heights as the first but that the drop-off is so steep, it signals a lack of ambition that comes across as almost cynical."
    },
    {
      "text": "The dialogue can be uttered with a straight face, for the most part, and the visual effects look appropriately pricey (big tusky battle rhinos and snarling death baboons don't come cheap nowadays). What the movie lacks is a reason to be."
    },
    {
      "text": "Washington gives a baddie for the ages."
    },
    {
      "text": "The performance by Washington alone is worth the price of admission, and when combined with the great sword fight, it creates an unforgettable box office experience."
    },
    {
      "text": "This isn’t the dream of Rome, but at least it’s not a complete nightmare."
    },
    {
      "text": "It may be unfair to judge Mescal boring here, because unlike Washington or Pascal he just isn’t given anything interesting to play."
    },
    {
      "text": "The film is so vast and monumental you almost forget the first movie’s artful use of mindful design; battles, intrigue and alliances that happen for a reason, and actor’s performance’s that are central to the storyteller’s core."
    },
    {
      "text": "If Denzel Washington was not in this movie it would be a particularly forgettable film."
    },
    {
      "text": "A himbo movie: dumb as hell, but so beautiful I didn't care. It's accidental fascist apologia, and I'll probably see it twice."
    },
    {
      "text": "Now, to be honest, I was not all that jazzed about seeing Gladiator II...So, was I pleasantly surprised? Um…sure."
    },
    {
      "text": "Like its predecessor, Gladiator II features some of the most epic and action-packed battles of the year. It does struggle, however, when it gets too caught up in trying to connect all the dots with the first film."
    },
    {
      "text": "“Gladiator II” is saddled by callbacks that weigh it down with soapy drama when it should be showcasing the sword, the sandal, and the arena."
    },
    {
      "text": "With Gladiator II, Scott throws everything he can at the screen to ensure viewers are suitably… entertained. Just don’t expect to dwell on a lot of this long after it ends."
    },
    {
      "text": "A qualified thumbs up for this sequel that can’t match the Oscar-winning best picture that spawned it, but the crowd will roar thanks to razzle-dazzle director Ridley Scott and a sensational, scene-stealing Denzel Washington as a villain worth cheering."
    },
    {
      "text": "Ridley Scott's late-coming sequel 'Gladiator II' stakes few claims to necessity, but the action epic definitely entertains."
    },
    {
      "text": "Stories told in the same world can echo each other and, if done well, overcome those similarities. But Gladiator II is shockingly boring for a purported sword-and-sandals epic."
    },
    {
      "text": "If there’s justice, Washington will be awarded on Oscar night."
    },
    {
      "text": "Scott strikes out by both hewing too closely to the source material and by toeing the line between drama and comedy. A failure that further tilts his filmography towards the bloated, CGI-heavy period-pic failures that have come to define his later work."
    },
    {
      "text": "[For] all my misgivings, I was entertained by Gladiator II."
    },
    {
      "text": "While Gladiator II does fall short in many ways, yes, we are still entertained."
    },
    {
      "text": "On my short list of film directors who criminally have never won an Academy Award for their work, Ridley Scott is right at the top."
    },
    {
      "text": "The very best and worst of Ridley Scott is on display here. It sways too much into tedious and bland rather than poignant or audacious."
    },
    {
      "text": "Every element in Gladiator II says, “How about we try the same things we did before, only not as well?” Mr. Scott wants to be thrilling, but the effort is more palpable than the results."
    },
    {
      "text": "It’s two-parts impressive spectacle and one-part implausible hokum."
    },
    {
      "text": "There’s no slack to the yak in this dramatically turgid and inadvertently comical miscalculation, easily the dumbest, detail-challenged sword-and-sandal release of the century so far."
    },
    {
      "text": "I loved every battle sequence, but there aren’t enough of them to justify the 2.5-hour running time or the endless hours of empty chatter"
    },
    {
      "text": "After all this time, the most that Scott can come up with is a mediocre echo of what he's already accomplished."
    },
    {
      "text": "“Gladiator II’s” biggest failures are its absence of depth and gravitas."
    },
    {
      "text": "...if you are going to take a Best Picture winning title and slap a \"II\" on the end of it, people are going to expect more. Something elevated. Something worthy. ​This is not that."
    },
    {
      "text": "I hung there, for some of the acting, for some of the callbacks, and for the many individual moments, or single shots, that could only have come from Ridley Scott. And in the end, yes, you too may be moderately entertained."
    },
    {
      "text": "One of the prime reasons that “Gladiator II” works despite all the familiar plot points and the near-corny late developments is that these great actors pour themselves into their respective roles, never winking at the camera."
    },
    {
      "text": "Scott’s increasingly leaden direction can’t add any nuance, and instead sloppily lumps together the po-faced grandeur of Quo Vadis and the unhinged debauchery of Caligula."
    },
    {
      "text": "It’s not on par with its 2000 predecessor, but the script by David Scarpa, who collaborated last year on “Napoleon” with director Ridley Scott, does connect the dots smartly with blood and purpose."
    },
    {
      "text": "Gladiator II is another handsomely made but emotionally inert historical epic."
    },
    {
      "text": "A slightly silly but entertaining sequel to Ridley Scott’s Oscar-winning \"Gladiator.\""
    },
    {
      "text": "Gladiator II can't replicate the sorrows of the first movie or reach its noble heights."
    },
    {
      "text": "Scott has made the act of movie watching an enjoyable one—even if you forget just about everything a week after watching it."
    },
    {
      "text": "The cgi was awful, and characters aren't as strong, but still a worthy sequel to the original with tons of fun action!"
    },
    {
      "text": "Nostalgia is another character that interweaves itself in this storyline. It makes the film a popcorn blockbuster that will pass the time, but I’m not sure it will stand the test of time as a classic like Gladiator."
    },
    {
      "text": "Those overbaked and confounded conveniences were not necessary to dramatically revisit a successful legend such as this one, which already had adrenaline and spectacle on its face value alone."
    },
    {
      "text": "In this way, “Gladiator II” coasts: never good, never terrible, always a little disappointing, with speeches that fall flat and gladiator battles that are like watching the World Series when your team isn’t in it."
    },
    {
      "text": "Scott strives mightily to recapture the magic that the 2000 movie created for so many people, but falls short, despite one spectacular performance."
    },
    {
      "text": "Although Gladiator II doesn’t quite reach the lofty heights of Gladiator, it reminds audiences what Ridley Scott can do behind the camera, with solid performances and eye-popping visuals guaranteed to entertain audiences."
    },
    {
      "text": "Sure Gladiator II has some head-scratching moments. But that's par for the Ridley Scott course. Its balanced very well, maybe even better than the first, with great blood thirsty action and heart."
    },
    {
      "text": "[W]e've seen this all before—done better 24 years ago and as part of the ongoing trend of legacy sequels."
    },
    {
      "text": "A cautionary tale about what happens to lightweight TV actors when they come up against a bona fide movie star."
    },
    {
      "text": "Gladiator II doesn’t need to scream “are you not entertained” because it knows we are. Gladiator II delivers exactly what you want from a blockbuster."
    },
    {
      "text": "Scott once again creates an epic film \"fit for the Gods,\" ensuring accuracy."
    },
    {
      "text": "If one were to engage with the deeper meanings being explored throughout the film, beyond the blood and gore of the arena, Gladiator II would be hailed as a truly remarkable piece of cinema."
    },
    {
      "text": "Bigger, louder and longer than the original film, Ridley Scott’s Gladiator II has sword and sandal sequelitis."
    },
    {
      "text": "For fans of the original, the nostalgic callbacks and epic set pieces may be enough to satisfy, even if this sequel rarely achieves the soul-stirring impact of its predecessor."
    },
    {
      "text": "The film itself is a son, made from the same DNA, in the same image. It is the only “Gladiator” sequel that could possibly exist and exactly what you expect, for better or for worse. Are you not entertained?"
    },
    {
      "text": "Most dismayingly, the grand emotional sweep of the first film is nowhere to be found in Gladiator II; the sequel is epic in length and spectacle, but not in feeling."
    },
    {
      "text": "Enjoying the evil wit of Macrinus and figuring out what motivates him gives Gladiator II whatever scant novelty it possesses. The film otherwise is mostly violent déjà vu, selling moviegoers the same story it peddled nearly a quarter-century ago."
    },
    {
      "text": "A weak, inconsequential film. [Full review in Spanish]"
    },
    {
      "text": "Crafted with care & ambition, the follow-up to Ridley Scott’s iconic 2000 film has finally arrived & it delivers. Cinematic experience designed not just to ride on the coattails of its predecessor but to stand on its own as an entry worth experiencing."
    },
    {
      "text": "For fans of the original it’s more of the same. For everyone else it’s all Denzel and little else."
    },
    {
      "text": "That's not to say that Mescal doesn't have magnetism; in fact, his performance is one of the highlights of the film. But his character is under-written."
    },
    {
      "text": "From action sequences filled with kinetic energy to powerful performances, Gladiator II makes its mark as a must-see movie of 2024. Action-packed, thrilling, and a must for fans of the original film."
    },
    {
      "text": "Gladiator II is absurd, stale, and, sadly, not a little bit pathetic in this day and age."
    },
    {
      "text": "Scott... is still skilled enough to turn what amounts to the same script you’d have seen in a direct-to-DVD sequel circa 2005 into something that looks expensive and professional, he’s no longer at the point where he can make it sing"
    },
    {
      "text": "Don’t go to Ridley Scott’s sequel for historical accuracy. Go for the thrills of another underdog Colosseum fighter (Paul Mescal) battling the Empire. The film doesn’t quite match the Oscar-worthy heights of the 2000 original, but it’s still entertaining."
    },
    {
      "text": "Big, brawny, blood-spattering and furiously entertaining, to (just like the Roman Colosseum) keep the crowd roaring, revved and ripped for the eye-popping, head-lopping, flesh-tearing show they’re watching."
    },
    {
      "text": "I was entranced by the performances and thrilled by the set designs and intensity of the action pieces. The story is a little overcomplicated, reducing the impact of its entirety thanks to a lack of development and focus on the many established arcs."
    },
    {
      "text": "While Gladiator II does not dazzle, it's quite convincing. [Full review in Spanish]"
    },
    {
      "text": "If you adhere to the philosophy of some of the Roman emperors — and modern-day leaders — as long as it’s entertaining and a sensory overload, there’s enough here with which to have a good time. Just don’t think too hard about it."
    },
    {
      "text": "Denzel Washington’s extravagant performance likewise makes Gladiator II worthwhile. Still, not even its excessively violent action sequences, beautiful cinematography, and masterful set and costume design can save the sequel from how boring it is."
    },
    {
      "text": "It is ultimately enlivened, if only to a point, by the sheer nuttiness of some of the imagery presented and the sight of Denzel Washington cheerfully chewing much of the scenery in a supporting turn."
    },
    {
      "text": "Since Paramount, Scott, and good old-fashioned corporate greed kick-started the idea of continuing the “Gladiator” franchise, you would think we’d get something more than a rehash of the first film."
    },
    {
      "text": "Foibles and fumbles and all, however, “Gladiator II” is still dumb fun. But it’s no match for the high standards set by the original."
    },
    {
      "text": "It’s not a bad movie, they’re not bad performances. It’s OK. It’s fine. I guess, it’s mostly good enough. But is this way you want to feel about a big budget historical epic from the director who has previously brought you iconic cinema? Not even close."
    },
    {
      "text": "Gladiator II is a big, brawny, and sprawling epic film that should make a lot of audiences happy with action and just the right amount of drama and theme."
    },
    {
      "text": "Don't we all love a great sword-and-sandal spectacular? Mescal, Nielsen, Washington and Pascal are terrific. Baboons, a rhinoceros, two Caligulas, this film has it all."
    },
    {
      "text": "In the end, the sequel’s biggest sin is its familiarity, which confirms just how unnecessary it is."
    },
    {
      "text": "This just keeps following the plot points of his first Gladiator. With these outlandish characters and frivolous detours mixed with such stoic characters, it’s uneven. But Ridley Scott, Maestro of Action, is still in the fight, and he’s done it again."
    },
    {
      "text": "These fights and performances land Gladiator II on the more positive end of Scott’s mid-tier filmography: fun to watch, but never quite displaying the heart that made Gladiator, Alien, and Blade Runner classics."
    },
    {
      "text": "Gladiator II arguably will not have the same effect [as the first film], but it is a handsome continuation of the story with some fabulously crafted set pieces."
    },
    {
      "text": "The Ridley Scott sequel delivers exactly what fans want: a gripping story, brutal action, and compelling performances. It answers Maximus’ iconic question, “Are you not entertained?” with a resounding yes."
    },
    {
      "text": "Feeling like a remake of the first film, Gladiator II is not as epic or politically savvy as you'd think a \"fighting for control of Rome\" story would be."
    },
    {
      "text": "Ridley Scott reminds us that reliving the successes of the past is a dangerous task and that sometimes the coliseum is best left in memory, intact in its glory. [Full review in Spanish]"
    },
    {
      "text": "Gladiator 2 (or as it’s spelled in the opening title, GladIIator) sadly comes off as less a reinvention of the original than a curiously literal retread of its plot beats, characters, and themes."
    },
    {
      "text": "A very enjoyable movie that's well-tied to its predecessor. [Full review in Spanish]"
    },
    {
      "text": "With Sir Ridley Scott once again directing the Colosseum extravaganza, could it possibly be as good as his first Roman spectacular? Well, it’s not. But, boy, does it put up a good fight."
    },
    {
      "text": "Although not as fresh or original, this sequel is filled with charismatic, odd, and attractive characters... [Full review in Spanish]"
    },
    {
      "text": "GLADIATOR II is an absolute epic. Ridley Scott is in top form with masterful directing and incredible set pieces.\n\nPaul Mescal delivers a career best performance alongside a tour de force showing by Denzel Washington. Nielsen and Pascal were great as well"
    },
    {
      "text": "That’s the film all over: bloodier, more fiendishly stuffed with neoclassical badassery than its predecessor."
    },
    {
      "text": "It’s equal parts compelling, ridiculous and uproariously pleasurable, often to the point where you can almost hear director Ridley Scott shouting, “Are you not entertained?” And, in truth, there are very few viewers who will not be."
    },
    {
      "text": "This has everything one would want from a Ridley Scott film. It is just as engaging as the original film and has such a wonderful ensemble. One of the best films of the year!"
    },
    {
      "text": "Relying heavily on past glory, rather than charting its own unique way, Scott’s film entertains in spurts but swiftly leaves one’s mind once you exit the arena."
    },
    {
      "text": "While Ridley Scott delivers spectacular gladiatorial action and Denzel Washington steals every scene, 'Gladiator 2's derivative plot and inability to escape its predecessor's shadow prevent it from achieving the same legendary status as the original."
    },
    {
      "text": "In such a spectacle, corny dialogue, campy performances, ridiculous scenarios and liberties with historical fact aren’t bugs, they’re features."
    },
    {
      "text": "Consider me somewhat entertained."
    },
    {
      "text": "Denzel Washington steals the movie. He is so much fun to watch."
    },
    {
      "text": "At the age of 86, the old boy still knows how to craft a sword-and-sandals epic, so to hell with the facts."
    },
    {
      "text": "The cast brings their A-game but this sequel is heavy on CGI spectacle, light on logic + emotional resonance. Gladiator II barely lives up to the greatness of its predecessor."
    },
    {
      "text": "In conceptual terms, Scott perceives Gladiator II as the cinematic equivalent of an opera. [Full review in Spanish]"
    },
    {
      "text": "Ancient Rome has been recreated on film many times, but Scott’s realisation of it, with a specially-built reproduction of the Colosseum, can convince you that you’re right there, right now."
    },
    {
      "text": "If we are entertained, it’s not because of the sharks or the apes chowing down on the supporting cast, but because of Washington gnawing chunks out of the scenery every time he’s in shot."
    },
    {
      "text": "But here strength and honor are non-existent, and the script is as disparate as it is unintentionally funny... [Full review in Spanish]"
    },
    {
      "text": "...director Ridley Scott returns twenty-four years after his Oscar winning gladiator movie with a film full of spectacle and violence that feels very much a faded echo of the first."
    },
    {
      "text": "“Gladiator II” doesn’t quite live up to its predecessor’s standards. Achieving that was an unenviable, almost impossible task. However, Scott has done everything he could to at least develop a sequel worthy of that 2000s classic. Full review in Spanish."
    },
    {
      "text": "For those craving their fix of head-hewing, sword-swinging Roman barbarity, \"Gladiator II\" capably fills the bill. Just don't expect much more than that."
    },
    {
      "text": "The great Ridley Scott swings and misses in this melodramatic sequel whose main cinematic crime is set pieces featuring low-budget and outdated-looking CGI."
    },
    {
      "text": "Gladiator II is just a shell in terms of narrative and drama compared to its predecessor, although it works as a visual spectacle and light entertainment."
    },
    {
      "text": "Someone should tell Ridley Scott that movie magic means you can just cast an actor old enough to play a son, you don’t have to wait 25 years."
    },
    {
      "text": "Washington is brilliant even in films that are undeserving of his talent, but even if he is the best thing about Gladiator II, the film itself more than lives up to his almost unparalleled star quality."
    },
    {
      "text": "With a strong performance from Mescal and a story that keeps you on the edge of your seat, this action-packed period epic sends a clear message: sequels can be just as good as the original."
    },
    {
      "text": "Gladiator II is an entertaining spectacle that delivers two-fold on its promise of epic and often bonkers blockbuster action, with its earnest execution and fun performances helping it triumph over its overly busy storytelling."
    },
    {
      "text": "or those hoping for another Maximus-esque tour de force, Lucius is a millennial echo of his predecessor’s fiery vengeance—a thoughtful avenger who broods more than he bellows."
    },
    {
      "text": "GLADIATOR II is a gorgeous --- and staggering --- production.  Scott has defied the odds and made a remarkably gratifying film."
    },
    {
      "text": "I must say that GLADIATOR II overstays its welcome at 148 minutes, but at least it is sufficiently entertaining."
    },
    {
      "text": "Ridley Scott (who is 86) has not lost his Midas touch and delivers a massy-actioner and a visual spectacle with a compelling narrative at a great pace combining ample goosebump moments along with emotional and surprising elements."
    },
    {
      "text": "\"Gladiator II\" works better as an action flick than a focused historical drama. If you're here to watch Paul Mescal and Pedro Pascal go at it in the ring — or Denzel Washington gossip and plot his way through Roman court — you're in the right place."
    },
    {
      "text": "Overall, watch Gladiator II for the brilliantly crafted action scenes and for its visual imagery. And for Denzel Washington’s performance, of course."
    },
    {
      "text": "Pedro Pascal is a charmer, while Denzel Washington is wonderfully slinky as the mysterious Macrinus."
    },
    {
      "text": "Ridley Scott may not be able to lift Gladiator 2 out of the shadow of its titanic predecessor, but it is certainly an impressive experience. The talents that have been assembled to achieve an epic are worthy of Olympus. [Full review in Spanish]"
    },
    {
      "text": "Like the arrows that end the lives of more than one heroic character, the almost two-and-a-half hours of this movie fly by. [Full review in Spanish]"
    },
    {
      "text": "Exciting, visually appealing, and features a half-dozen outstanding action setpieces, but beneath all that, the film is uncommonly hollow and ephemeral"
    },
    {
      "text": "The sheer silliness of it all might be forgivable, if the film possessed a compelling story. Alas, it does not."
    },
    {
      "text": "Given the current state of Hollywood, that Scott could create something that holds together at all feels like a small miracle."
    },
    {
      "text": "In the final count, while the battles and arena clashes are halfway thrilling, and Washington swishes through scenes like the consummate professional he is, Gladiator II is let down by lackadaisical execution."
    },
    {
      "text": "It’s a film brimming with warrior spirit, exploring power, deception, and the rise of a new hero."
    },
    {
      "text": "Gladiator II is Ridley Scott’s best films since The Martian, and it’s a treat to see a director of his caliber continue to execute a massive film like this at this stage of his career. It’s the kind of entertaining escapism many could use right now."
    },
    {
      "text": "Much of “Gladiator II” is based on the ideas of the film released in 2000. But Ridley Scott achieves what seemed impossible: giving the story a rejuvenated feel. [Full Review in Spanish]"
    },
    {
      "text": "As a spectacle, it’s dazzling and entertaining despite lacking the emotional punch of its predecessor. [Full Review in Spanish]"
    },
    {
      "text": "All the main characters have compelling stories behind them, but they are not realised in an emotionally satisfying way. In short, I couldn't care less what happened to any of them."
    },
    {
      "text": "Compared to the original it is plainly, and disappointingly, not as goodus."
    },
    {
      "text": "When in Rome it seems Ridley Scott feels apt to repeat himself in this somewhat turgid sequel which plays the same tunes as its predecessor, depending upon the conniving machinations of a devious Denzel Washington to amuse."
    },
    {
      "text": "[Denzel Washington] chews up every scene and steals the show with each conniving smile or sly twinkle in his eye. The American actor deserves another Oscar nomination for this performance."
    },
    {
      "text": "Lousy coverage, stagnant VFX, and some of the blandest-looking cinematography strip Scott of his aesthetic mastery."
    },
    {
      "text": "Gladiator II is a spectacle that is worthy of its prestigious predecessor, even if it never quite surpasses it."
    },
    {
      "text": "David Scarpa’s screenplay wisely keeps the political machinations on a slow simmer, so that they are easily followed and don’t get in the way of the nicely worked set-pieces Scott has in store."
    },
    {
      "text": "Ridley Scott once again showcases his mastery in blending narrative, action, and thematic depth, delivering a sequel marked by superb technical execution and standout performances, particularly from Denzel Washington."
    },
    {
      "text": "Gladiator II relies far too heavily on nostalgia for the original as a cheap substitute for well-rounded characters and storytelling, and the narrative fails to forge its own unique identity. It's not a worthy legacy sequel."
    },
    {
      "text": "You can’t take it seriously, but you can’t have fun with it either."
    },
    {
      "text": "I like Gladiator II for what it is. And I am sad about what it is not."
    },
    {
      "text": "Gladiator II is an underwhelming film. Yes, it is epic and spectacular at times. But the writing is unambitious - and unoriginal - by choice. After a 24-year-wait, with a rumoured quarter-billion-dollar budget, we could have expected more."
    },
    {
      "text": "Denzel Washington excels in the film's most ambitious, treacherous and grateful role, which also features stellar performances by Paul Mescal, Pedro Pascal and Connie Nielsen. [Full review in Spanish]"
    },
    {
      "text": "Pascal does his gentle, charismatic best with his limited screen time while Mescal plays his white saviour with aggressive broodiness and an earthy accent that rarely inspires or lifts the, albeit, humdrum dialogue – even when reciting Virgil."
    },
    {
      "text": "Playing like a tribute concert to the maddest excesses of the Roman Empire, what Gladiator II lacks in gravitas it makes up for in scenery chewing and sharks."
    },
    {
      "text": "In an era of remakes and reboots, Gladiator II is a good old-fashioned sequel. Which is to say, it's a step down from the first film while still having enough going on to make it watchable"
    },
    {
      "text": "Gladiator II is a fun flick for adults that doesn't need to be anything more than that."
    },
    {
      "text": "A fabulous, big-screen spectacle made by one of the few directors who actually knows how to make and pace an epic, mass-market crowd pleaser...also imparts a nifty lifehack on how best to handle yourself in case you ever get charged by a giant rhinoceros."
    },
    {
      "text": "Clunky, shallow and unfocused. Director Ridley Scott effectively captures the physical grit much more than emotional grit. Even the action thriller The Carpenter is more entertaining and imaginative B-movie than this overproduced and overlong B-movie.."
    },
    {
      "text": "Ultimately, Gladiator II swings for glory, but it gets a thumbs down in the end."
    },
    {
      "text": "Stylish, sexy, and just a little homoerotic."
    },
    {
      "text": "Nobody else is making movies like this anymore. I may have quibbles but Gladiator 2 is compelling and, most importantly, entertaining."
    },
    {
      "text": "Overall, is Gladiator II more of the same but different? Yes. A needless sequel? Yes. But are we not thoroughly entertaining? Entirely."
    },
    {
      "text": "Great villainous performance by Denzel Washington."
    },
    {
      "text": "Although it never reaches the highs of its predecessor, Gladiator II is an admirable attempt to recapture the action-packed and emotional scale that director Ridley Scott achieved 24 years ago."
    },
    {
      "text": "Ridley Scott, we salute you."
    },
    {
      "text": "There’s no Crowe, but in every other way it follows the template remarkably closely. Short report: it’s a triumph, therefore. Loyalists rejoice: it is chock-full of fighting once again."
    },
    {
      "text": "And, in the end, 'Gladiator II' manages to stand up in the arena, raising its sword, knowing it is inferior, but also moving forward as an absolute triumph... [Full review in Spanish]"
    },
    {
      "text": "'Gladiator II' exists, in its narrative insanity and in its demolition of the laws of the sequel, and of the blockbuster, simply because Scott has allowed it. [Full review in Spanish]"
    },
    {
      "text": "Brimming with stellar performances, well-directed action sequences, and effective themes, it shows what a potent legacy sequel should be like."
    },
    {
      "text": "[Scott] knows what really thrills the mob is the chance to indulge their primal instincts, just as he knows the same is true of movie audiences. The cinema is his Colosseum."
    },
    {
      "text": "However, while the film is a violent delight to watch, it's best suited for the big screen. The action and acting live up to the original, but unfortunately, the story and dialogue don't have the legendary feeling the original did."
    },
    {
      "text": "There is nothing wrong with a grunting, violent, ancient Roman holiday, especially when it boasts a supporting performance as delicious as Denzel Washington’s Machiavellian Macrinus."
    },
    {
      "text": "“Are you not entertained!?” The answer is no, not really, and no amount of digital gladiatorial carnage or bug-eyed overacting can mask the prevailing air of exhausted, decadent imperial decline."
    },
    {
      "text": "If you were hopeful that Gladiator II has the same emotional stakes as the first, you will be pleased with Mescal’s performance but what really makes Gladiator II shine is the supporting cast."
    },
    {
      "text": "There are all kinds of ambiguities in Washington’s performance as Macrinus, which is loose and playful to an unexpected degree, especially in comparison to the huge, lumbering movie around him."
    },
    {
      "text": "Joaquin Phoenix’s psychologically complex brand of villainy is much missed. But in the flamboyant Washington, it has a trump card that pays off in a gripping and slickly executed final stretch."
    },
    {
      "text": "This is crowd-pleasing cinema at its most pleasing; a bacchanal for the eyes and ears that leaves you in a stupor from glorious excess."
    },
    {
      "text": "The staleness of “Gladiator II” is difficult to ignore."
    },
    {
      "text": "Denzel Washington's scene-stealing performance elevates this entertainingly operatic sequel."
    },
    {
      "text": "A worthy successor to Scott’s original, even if it occasionally stumbles under the weight of its own ambitions."
    },
    {
      "text": "Thank whatever gods you do or don’t pray to for the inclusion of Macrinus and Denzel Washington. Although Gladiator II is not offensively awful dreck, it is at best engaging folly."
    },
    {
      "text": "Surprisingly mid… less a sequel to the iconic 2000 Oscar winning film and more the latest generic Ridley Scott movie. Washington and Pascal come off best, but the script is extremely convoluted.  The score, visuals and sound mix are all weak."
    },
    {
      "text": "It’s the grand journey [of Gladiator II] that makes for the most entertainment, and in that regard, you cannot fault this rousing, well-acted sequel. For all its minor faults, it’s well worth the price of admission."
    },
    {
      "text": "A cinematic orgy to be sure, but this visual feast might leave you hungry for more."
    },
    {
      "text": "Often adheres to a similar narrative as the original, but makes up for any familiarity with a welcome dosage of camp sensibility."
    },
    {
      "text": "...big screen entertainment of the first order..."
    },
    {
      "text": "It’s far from his best work, but the return to form by Scott is notable, proving that he still has the cinematic power to visually engage and excite audiences. Are you not entertained? Well, Scott still possesses the magic."
    },
    {
      "text": "Gladiator II is not as emotionally gripping as 2000's Gladiator, but this action sequel delivers the expected epic battle scenes and competent acting. Shallow characters and phony-looking fight beasts are part of this predictable story."
    },
    {
      "text": "Twenty-four years on, Ridley Scott has achieved that rare feat: a sequel that lives up to the original."
    },
    {
      "text": "CGI rhinos, apes, sharks and warships take up space in [Ridley Scott's] digitally re-rendered Colosseum, but he’s at a loss with what to do with them. It’s just a bunch of pixels at war with each other, with human stakes left to bleed out."
    },
    {
      "text": "Gladiator II has its twists and turns and if nothing else a bravura sense of scale only studio epics have ever managed (and only a handful of working directors can do as well) but also a studied refusal to ignore how much of the original it is repeating."
    },
    {
      "text": "While 'Gladiator II' does entertain, it departs from its predecessor's original tone and character development in favor of a sequel that goes to absurd lengths to win the crowd."
    },
    {
      "text": "The story feels thrown together and hard to take seriously or invest in, even if some of its wackiness is admirably imaginative. Those sharks are a nutty idea, but this film deserves to be fed to them and forgotten about"
    },
    {
      "text": "GLADIATOR II only works when it’s weird."
    },
    {
      "text": "Gladiator II is bigger, louder, and more fragmented than its predecessor but not better. It looks strong but lacks emotion and concludes with a terrible finale."
    },
    {
      "text": "People were understandably very wary of a sequel to Gladiator, but it justifies its existence. It's a more complex story that initially feels like it might just repeat the first film's plot but then turns out to be doing something different."
    },
    {
      "text": "Gladiator II may indeed lack Maximus, yet compensates handsomely with its maximalist approach in this rousing continuation."
    },
    {
      "text": "It still has the capacity to entertain, amuse and distract with ease, but makes hard work of delivering much that is truly original or memorable."
    },
    {
      "text": "A film that aspires to be so much that it ends up being too little. [Full review in Spanish]"
    },
    {
      "text": "The movie definitely has some entertaining stuff in it."
    },
    {
      "text": "While we can, we should appreciate Gladiator II. It’s huge without being lumbering, old-fashioned without feeling stodgy, and made with immaculate craftsmanship. Go see this sucker on the biggest screen you can find."
    },
    {
      "text": "It’s as adventurous and stimulating in specific moments as it is frivolous and redundant in others."
    },
    {
      "text": "While far from profound, Gladiator II is simply too entertaining and sweeping to ignore."
    },
    {
      "text": "Ridley Scott returns to bloody greatness with an ass-kicking sword and sandals sequel. Gladiator II recaptures the thrilling epic violence, Machiavellian ruthlessness, and superb lead performances that made the original a Best Picture winner."
    },
    {
      "text": "Not without its flaws, it delivers plenty of intense, jaw-dropping moments. With standout performances from Denzel to Paul Mescal, the film keeps you thoroughly entertained from start to finish, offering sharp dialogue and expertly crafted fight scenes"
    },
    {
      "text": "Gladiator II, a well-conceived, highly-entertaining, opulent spectacle that is missing a couple of key ingredients to fully restore the glory of Rome, but adds one that nearly does on its own."
    },
    {
      "text": "Though nowhere near as potent or memorable as its predecessor, Gladiator II boasts strong fight sequences and an encouraging spirit of perseverance and survival."
    },
    {
      "text": "Gladiator II has a similar vibe to this year’s Beetlejuice Beetlejuice. When all else fails, fall on what worked before."
    },
    {
      "text": "Gladiator 2 made me a believer in Ridley Scott again!\nA tried and true swords epic that follows up the original in an almost perfect manner! Paul Mescal is PHENOMENAL \nDenzel Washington is devilishly great"
    },
    {
      "text": "Macrimus is the most flamboyant character Washington has played since Training Day. He embodies Roman decadence, but with more class than the vulgar legends or movies like Caligula."
    },
    {
      "text": "Not the instant classic the original was, but still a blast."
    },
    {
      "text": "Gladiator II is a rehash of its predecessor that entertains on the Colosseum grounds but falls narratively flat."
    },
    {
      "text": "All I am left with are the words of Emperor Commodus: 'It vexes me. I’m terribly vexed.'"
    },
    {
      "text": "Gladiator II does not come remotely close to capturing the glory--for lack of a better word--of its Oscar-winning predecessor, Gladiator."
    },
    {
      "text": "Unfortunately, Scott has chosen not to fill every one of the 148 minutes with quotable moments or with a strapping Paul Mescal taking on soldiers, sharks, or mad monkeys, and when Gladiator II is being neither wild nor crazy, it’s all a little dull."
    },
    {
      "text": "…takes a while to build up a head of steam, but Gladiator II gets over the line in style by showcasing an excellent cast, and remixing elements of the 2000 film,  with a fresh story of epic combat which creates roughly the same degree of satisfaction..."
    },
    {
      "text": "A series of bloody melees that culminate in a flat advocation for peace, without any deeper meaning."
    },
    {
      "text": "Ridley Scott's sequel is a middling remake with one incredible performance."
    },
    {
      "text": "Gladiator II may lack the elegance of the first, but it is fully Ridley Scott’s vision, and that is to be respected. Come for the sweeping storytelling; stay for Denzel Washington’s gleefully anarchic performance."
    },
    {
      "text": "Disappointing ‘Gladiator II’ offers bread and circus."
    },
    {
      "text": "The film succeeds far better as a historical action movie than one worth taking seriously regarding the political dealings...It’s another action-heavy melodrama that flourishes based on Scott’s incredible craft and a few notable performances."
    },
    {
      "text": "Gladiator II doesn’t reach the same emotional heights as the original movie. However, for all the highly entertaining madness it has going for it, this legacy sequel is more than worthy."
    },
    {
      "text": "Gladiator II jumps the shark — and the rhino, and the rabid baboons."
    },
    {
      "text": "If this decades-in-the-making sequel feels better than the original, it’s because there are no prestige aspirations here––Scott follows the formula of the first to a tee, turning up the dial so each set piece is bigger and stupider than before."
    },
    {
      "text": "Ridley Scott’s long-awaited sequel is good enough to feel like more than a carbon copy of its predecessor and be a successful blockbuster in its own right."
    },
    {
      "text": "Big, bold and bordering on the unbelievable, Gladiator II delivers, big time."
    },
    {
      "text": "Ridley Scott obviously wanted Gladiator II; the reason why is less clear, but Denzel Washington's hammy performance almost justifies it."
    },
    {
      "text": "What could have been a ponderous, predictable sequel to a much-loved Oscar-winner instead turns out to be a fun romp."
    },
    {
      "text": "Washington’s relaxed command of this juicy role translates into pure pleasure for the audience: every gesture radiates movie-star ease; every line comes with an unexpected flourish. Unfortunately he’s so good he rather eclipses the rest of the cast."
    },
    {
      "text": "If you can get past the lack of emotional punch and connection with its characters, Gladiator 2 is a terrifically fun watch."
    },
    {
      "text": "At times, Gladiator II is pure camp. To insist that it shouldn’t be is to hold on too tightly to the dour expectations of the 21st-century blockbuster. It has a modern outlook but provides a throwback, too, to the genre’s florid history."
    },
    {
      "text": "Scott meticulously recreates the splendour and brutality of the Roman Empire."
    },
    {
      "text": "Scott has created another epic worthy of the 24-year gap from its predecessor"
    },
    {
      "text": "Unfortunately, the film’s action sequences, arguably the biggest audience draw, do little to distract from the lackluster narrative."
    },
    {
      "text": "Scott’s most disappointing “legacy sequel” since Prometheus. It’s a scattershot effort with half-formed characters (with one exception) and undernourished plotlines that seem to exist only in conversation with the Russell Crowe original."
    },
    {
      "text": "It's a darker, more vicious film for a darker, more vicious time."
    },
    {
      "text": "Scott’s vision of ancient Rome explodes into widescreen life with a sprawling cast and a sense of scale and majesty."
    },
    {
      "text": "Despite occasional flashes of inspiration – the baboon fight, some pleasingly visceral gore – this sequel lacks both the impact of its inspiration and the fresh ideas necessary to stand on its own two feet."
    },
    {
      "text": "Next to its predecessor, Gladiator II may not be an all-timer or award winner, but it’s easy to get caught up in this 150-minute epic, regardless of its sequelisms and sameness. This is a good movie, not a great one. And that’s a little disappointing."
    },
    {
      "text": "Now, 24 years after \"Gladiator,\" Scott has made \"Gladiator II,\" a film that plays out almost like a beat for beat remake of the original movie ... until it doesn't."
    },
    {
      "text": "Scott just keeps on trucking either way. The best of the film is its sheer bloody-minded heft, a blockbuster fuelled by an insistence on bigger, sillier, movie-r."
    },
    {
      "text": "Gladiator 2 picks up the story of Ridley Scott’s Rome, providing plenty for fans of the original to enjoy but missing some of the majesty that made its predecessor a classic."
    },
    {
      "text": "This sequel is watchable and spectacular, with the Colosseum created not digitally but as a gobsmacking 1-to-1 scale physical reconstruction with real crowds. Yet this film is weirdly almost a next-gen remake."
    },
    {
      "text": "It's more a swaggering, sword-and-sandal epic that prizes the need to entertain above all else."
    },
    {
      "text": "Gladiator II is one of 2024's best blockbusters, but at times, it falters under the pressure of the standards set by its predecessor."
    },
    {
      "text": "What makes Gladiator II successful in its own right are the ways it differentiates itself. The humorous tone and embrace of the absurd and the fantastical, combined with the ferocious blood spattering, make for a rousing, fist-pumping cinematic spectacle."
    },
    {
      "text": "The screenplay is mere scaffolding on which to mount endless samey – albeit delightfully disgusting – exercises in competitive viscera-letting."
    },
    {
      "text": "Every fight has some kind of interesting twist on it that makes it feel fresh and inventive.\n\nI wish I could say the same thing about the script, which is mostly a remix of the first film but somehow feels edited to shreds in the final cut."
    },
    {
      "text": "While some of the plot points may leave a queasy feeling in the pit of your stomach given their modern parallels, one truth rises above the rest: With a movie this meticulously made, there's no way to not be entertained."
    },
    {
      "text": "Washington radiates a showman's delight, relishing his character's deviousness. Inside or outside of the Colosseum, Gladiator II has no greater attraction."
    },
    {
      "text": "If Scott decides to make a third movie, I’ll be there for sure."
    },
    {
      "text": "Gladiator is a hard act to follow but Sir Ridley Scott proves still to be a master working up a Roman orgy of excitement that proves a worthy successor in every way."
    },
    {
      "text": "An elaborate imitation of its predecessor. If little more than a cover song, however, it’s a majestic and malicious one that reaffirms its maker’s unparalleled gift for grandiosity."
    },
    {
      "text": "Full of spectacle and spectacular performances, Gladiator II is by far the best popcorn film of the year."
    },
    {
      "text": "Gladiator II can't live up to the lofty expectations Gladiator set up, yet the sequel is at its best when it tries to carve its own path in this Roman world."
    },
    {
      "text": "Legacy means nothing if you squander its potential, and that's precisely what Gladiator 2 does. It's a bloated mess of a sequel to a film that deserves better."
    },
    {
      "text": "A schizophrenic film, and therefore as irregular as it is unique. [Full Review in Spanish]"
    },
    {
      "text": "If you loved Gladiator, it’s odds-on you’ll enjoy this too. It’s got all of the same exciting bits – swordfighting, rousing speeches, nasty poshos getting what they deserve. The problem is that’s all it gives you."
    },
    {
      "text": "There’s betrayal, scandal, power plays aplenty and oodles of revenge, with Paul Mescal as the enslaved guy who finds new purpose as a gladiator and Washington an unhinged delight as our hero’s ambitious boss."
    },
    {
      "text": "Gladiator II might not have a protagonist with the scorching glower of Crowe’s Maximus, but it has plenty of the eye-popping spectacle and operatic violence audiences will want."
    },
    {
      "text": "The thrill of the action sequences just underscores the hollowness of the rest of the enterprise. Sure, not all of us spend a lot of time thinking about the Roman Empire, but those who do deserve better than this."
    },
    {
      "text": "Gladiator II finds strength and honor in a familiar story, with enough fresh perspective to feel relevant and an unmissable Denzel Washington supporting turn which practically screams “are you not entertained!?”"
    },
    {
      "text": "Gladiator II boasts a phenomenal cast, but Denzel Washington continuously steals the show. The cinematography, costumes, and sets all come together to make something unforgettable. See it on the biggest screen you can!"
    },
    {
      "text": "Scarpa’s hokey dialogue doesn’t always suit him, but Mescal works hard, and it’s an interesting turn – edgy, soulful and quietly powerful, and I can’t think of another performer who might have done a better job with the role."
    },
    {
      "text": "From the decadent costume design by Janty Yates and David Crossman to Arthur Max essentially recreating the Colosseum, Scott can always elicit the best work from the artisans he surrounds himself with."
    },
    {
      "text": "It’s a Saturday-night epic of tony escapism. But is it great? A movie to love the way that some of us love “Gladiator”? No and no. It’s ultimately a mere shadow of that movie. But it’s just diverting enough to justify its existence."
    },
    {
      "text": "Like so many latter-day Ridley Scott films, Gladiator II at once feels half-baked and overstuffed, and the lack of internal consistency robs its action of sustained tension and its comedy of bite."
    },
    {
      "text": "Gladiator II is the grandest spectacle of the year, a stirring epic and Paul Mescal is a worthy successor to the throne."
    },
    {
      "text": "Gladiator II is FEROCIOUSLY entertaining and the type of MYTHIC and MASSIVE filmmaking only Ridley Scott can deliver. Paul Mescal, Pedro Pascal, & Joseph Quinn are bloody glorious and bring raw charisma to every scene in this worthy sequel."
    }
  ],
  "release_year": 2024,
  "duration": 148,
  "genres": [
    "History",
    "Drama",
    "Adventure",
    "Action"
  ],
  "age_rating": "R",
  "synopsis": "Years after witnessing the death of Maximus at the hands of his uncle, Lucius must enter the Colosseum after the powerful emperors of Rome conquer his home. With rage in his heart and the future of the empire at stake, he looks to the past to find the strength and honor needed to return the glory of Rome to its people.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/2cxhvwyEwRlysAmRH4iodkvo0z5.jpg"
}