{
  "movie_name": "Gone with the Wind",
  "movie_id": "gone_with_the_wind",
  "total_reviews": 97,
  "reviews": [
    {
      "text": "Gone with the Wind stands around on its own foot purely out of size and story complexity... They threw in many good things, and everything else but a towel."
    },
    {
      "text": "The performances, set designs, costumes, Technicolor photography, and Max Steiner’s exhilarating score keep this film as bewildering and extravagant a film today as it ever was."
    },
    {
      "text": "It remains the most seen film in cinema history, not only because Selznick produced a monumental motion picture of immaculate quality, but because he knew how to sell it as an event."
    },
    {
      "text": "The entire cast is about as flawless as I have ever seen in one picture."
    },
    {
      "text": "It is a film so misguided and ignorant that odds are that if you have seen it, you likely only remember one or two iconic scenes and have nary a recollection of the rest. Gone With The Wind is quite literally not worth giving a damn."
    },
    {
      "text": "One of the first technicolor films made by Hollywood, the panning shot of injured and dead soldiers littering a street remains unforgettable..."
    },
    {
      "text": "One of the first technicolor films made by Hollywood, the panning shot of injured and dead soldiers littering a street remains unforgettable..."
    },
    {
      "text": "No other movie has had quite the impact, the influence, or the epic feel (perhaps as only a nearly four-hour-long production could create) of this unmistakable masterpiece."
    },
    {
      "text": "True to the book, the film of Gone With The Wind is held together by its heroine."
    },
    {
      "text": "\"Hey kids, wanna watch a four-hour-long romantic melodrama, told from the sympathetic perspective of the racist slave owners who lost the Civil War?\""
    },
    {
      "text": "Victor Fleming's direction has abundant artistic successes. [Full review in Spanish]"
    },
    {
      "text": "In casting Vivien Leigh as Scarlett O'Hara, Clark Gable as RhettButler, Olivia De Havilland as Melanie and Leslie Howard as Ashley Wilkes, [David O. Selznick] brought the major characters to life just as they existed in the book."
    },
    {
      "text": "Miss Mitchell used 475,000 words to tell her story. Three hours 45 minutes is not a second too long in which to recount it in the film transcription."
    },
    {
      "text": "Clark Gable sends a refreshing blast of cynicism through a narrative which otherwise would have been over-sweet."
    },
    {
      "text": "This danger-fraught material should be left to inspired writers... Mediocre reactionary writers shouldn't play around with so much dynamite for the mere sake of giving the sensation-loving masses a thrill."
    },
    {
      "text": "The only help we can give [a future researcher] is to explain that the burning question of our day was not a question of the value of this work as a piece of historic documentation: our public was concerned chiefly with the techniques of histrionic art."
    },
    {
      "text": "It's corny and blowsy and phony, the slide trombone in the cinematic orchestra, and yet it is not boring."
    },
    {
      "text": "I enjoy watching it but I acknowledge all those flaws."
    },
    {
      "text": "\"Gone With the Wind\" offers the kind of big, rich, opulent experience the movies are in a unique position to offer but seldom do."
    },
    {
      "text": "For anyone older who wants a reminiscent trip into the early war years, and how it felt to look at someone else's high-coloured war when you had no idea what your own was bringing, again this is it."
    },
    {
      "text": "There is a kind of dispassionate confidence in the film's own destiny: the last tycoon, making the last of the dinosaurs."
    },
    {
      "text": "If the story had been cut short and tidied up at the point marked by the interval, and if the personal drama had been made subservient to a cinematic treatment of the central theme, then Gone With the Wind might have been a really great film."
    },
    {
      "text": "I was swept away by the drama about a selfish, beautiful Southern belle who loses everything in the Civil War but claws her way back after vowing - backed by composer Max Steiner's trumpets - \"As God is my witness, I'll never be hungry again.\""
    },
    {
      "text": "Now it can be told that out of the pages of a magnificent book has leaped a magnificent motion picture."
    },
    {
      "text": "I still find the movie vile and offensive in every important part. It purports to show us the lamentable fate of \"gentility\" in the old South which, as a pre-teen, only made me wish General Sherman godspeed on his appointed rounds in Georgia."
    },
    {
      "text": "Gone with the Wind, one of the most beloved and revered of American classics, showcases the best and worst of old Hollywood."
    },
    {
      "text": "The film's subtle racism is insidious, going to great lengths to enshrine the myth that the Civil War wasn't fought over slavery - an institution the film unabashedly romanticizes."
    },
    {
      "text": "There are infinite highs, beginning with Vivien Leigh's extraordinary performance as Scarlett O'Hara, one of the most fully developed characters ever depicted in American cinema."
    },
    {
      "text": "There has never been a picture like David O. Selznick's production of Gone With the Wind."
    },
    {
      "text": "Clark Gable and Vivien Leigh create their own sizzle as Rhett Butler and Scarlett O'Hara in a lavish four-hour epic that juxtaposes scenes of jaw-dropping majesty with moments of elegant intimacy and playful verbal jousting."
    },
    {
      "text": "No one watches Gone with the Wind for historical accuracy. What keeps us coming back is four-hours of epic romance in gorgeous Technicolor."
    },
    {
      "text": "I love Scarlett O'Hara. She's so full of life and energy, it's hard not to be swept up in her personality."
    },
    {
      "text": "Too clumsy a thing to be taken seriously, with its romanticisation of slavery and its problematic approach to rape, Gone With The Wind is nevertheless a work of considerable power."
    },
    {
      "text": "Running to nearly four hours and boasting at least three directors, this epic American Civil War romantic drama is more of a symbol of the Hollywood studio system than a mere movie."
    },
    {
      "text": "It's remarkable that after spending almost eight hours of my existence in front of this film, I can remember only two points vividly."
    },
    {
      "text": "Boasts epic visuals (the civil war, Atlanta on fire etc) as sweeping as Max Steiner's score."
    },
    {
      "text": "The performances of eternally glittering movie stars Vivien Leigh and Clark Gable ... exist in a league of their own, demanding rapt attention in scene after scene."
    },
    {
      "text": "Ginormous in both scale and emotional wallop, MGM's epic is still a cinematic event to be savoured."
    },
    {
      "text": "Gone With the Wind endures and deepens with the passing of time because Scarlett and Rhett are as modern as its open ending."
    },
    {
      "text": "Brimming with colour and passion, it pulls its emotional kick from tremendous performances, not least from Vivien Leigh and Clark Gable as the love-hate lovers."
    },
    {
      "text": "The cast, in the main scenes as in the episodes, is excellent."
    },
    {
      "text": "[VIDEO ESSAY] ...a closer reading finds a cutting commentary on the South's hypocritical, opportunistic, and racist attitudes that continue to infect American culture."
    },
    {
      "text": "The golden standard for classic Hollywood bombast, this one."
    },
    {
      "text": "If ever the phrase, \"They don't make 'em like they used to\" could fit a film, this is it."
    },
    {
      "text": "The epic film that to this day stands as the benchmark against which all other epics are judged."
    },
    {
      "text": "Gone with the Wind is still dated, but it's a dynamite kind of antiquity."
    },
    {
      "text": "Coordinating six filming units at once and presiding over 50-hour editing sessions, [Selznick] subsisted on a regular diet of thyroid extract, Benzedrine, and B-12 shots."
    },
    {
      "text": "It's impossible not to be carried away by the rich arterial force of this storytelling."
    },
    {
      "text": "One of the truly great films, destined for record-breaking boxoffice business everywhere."
    },
    {
      "text": "Grand old Hollywood at its most magnificent and melodramatic. Say what you like about the soapy characterisation and plotting, the spectacle flattens all in its wake."
    },
    {
      "text": "A lost Hollywood art: the epic melodrama."
    },
    {
      "text": "A critic-proof movie if there ever was one: it isn't all that good, but somehow it's great."
    },
    {
      "text": "Terrificly acted, staged and designed, Gone WIth the Wind remains one of the greatest period epics ever filmed."
    },
    {
      "text": "Despite the star power of Vivien Leigh and Clark Gable, Wind has lost some of its bluster, yet it survives as a glorious Technicolored window into America's dusty, bygone past."
    },
    {
      "text": "What more can one say about this much-loved, much discussed blockbuster?"
    },
    {
      "text": "Forget it, no Civil War film has made a nickel, producer Irving Thalberg told Louis B. Mayer about a melodrama that would break records and become a unique cultural phenom"
    },
    {
      "text": "This is a film that never fights shy of clichés. Rather, it collects them all up in one glorious heap so you can cherry-pick those that appeal."
    },
    {
      "text": "...producer David O. Selznick's crowning achievement and a film that stands up as one of the screen's finest classics."
    },
    {
      "text": "One of the classic films that defined American cinema, Gone With the Wind is a rare example of a collaboration involving hundreds of talents and egos that turned out great."
    },
    {
      "text": "Possibly the best loved movie spectacle ever."
    },
    {
      "text": "Never, never bores me. Glabe is fabulous!"
    },
    {
      "text": "Rhett Butler and Scarlett O'Hara remain the greatest pairing of irresistible force and immovable object in Hollywood romance."
    },
    {
      "text": "'It' has arrived at last, and we cannot get over the shock of not being disappointed; we had almost been looking forward to that."
    },
    {
      "text": "As God is my witness ... it's back."
    },
    {
      "text": "Treat yourself to one of the greatest cinematic experiences ever created."
    },
    {
      "text": "The brilliant epitome of corporate filmmaking."
    },
    {
      "text": "The film is a monumental job in every department."
    },
    {
      "text": "It could be -- and should be -- viewed from a dozen different perspectives, but it is, above all, a story about adapting to the most challenging circumstances possible."
    },
    {
      "text": "Clear an evening and indulge yourself in one of the few films that can justifiably be called an epic."
    },
    {
      "text": "Superb acting talent was followed by superb production values."
    },
    {
      "text": "It's the kind of movie that simply turns a movie reviewer's brain off. You get swept up in the majesty, the grandeur, the history, and the emotion."
    },
    {
      "text": "A seductive mish-mash of epic spectacle, social commentary and pure, character-driven enjoyment."
    },
    {
      "text": "On the whole, I thought the picture was OK."
    },
    {
      "text": "They just don't make 'em like that anymore."
    },
    {
      "text": "The artistic aspects of the film's production are as stunning as its acting."
    },
    {
      "text": "It's a classic because it's not dated at all; it has effortlessly stood the test of time."
    },
    {
      "text": "The most beloved, enduring and popular film of all time is Gone With The Wind (1939) - its script by Sidney Howard was derived from Margaret Mitchell's"
    },
    {
      "text": "The best remembered and most publicized film in Hollywood's flamboyant history, the biggest of David O. Selznick's grand obsessions, and quite probably the most beloved movie of all time."
    },
    {
      "text": "It is a bore."
    },
    {
      "text": "To see Gone With the Wind on a big screen again is to weep for the fearlessness with which Hollywood once believed the sublime was possible."
    },
    {
      "text": "Everything about it is big."
    },
    {
      "text": "All of the drama of GWTW is successfully combined with dazzling production values."
    },
    {
      "text": "Even though the habits of movie- goers have changed over the years, it's easy to see why this film provoked such an outpouring of praise and adulation during its initial release, and why its stature has grown with the passage of decades."
    },
    {
      "text": "It is still a towering landmark of film, quite simply because it tells a good story, and tells it wonderfully well."
    },
    {
      "text": "The first new Technicolor print in 37 years, digital sound and moments of digitally cleaned-up footage scattered throughout its three hours and 42 minutes all make for a gorgeous sight-and-sound experience."
    },
    {
      "text": "It's that rare film that has overshadowed its own hype."
    },
    {
      "text": "Victor Fleming's 60-year-old movie looks like it was shot this year."
    },
    {
      "text": "Let us say simply that there is something in most of us that will always treasure Selznick's flair for old-fashioned, full-bodied narrative even as we pay lip service to the most anemic forms of cerebration in the modern cinema."
    },
    {
      "text": "But once the story kicks in and Leigh and Gable slip into their characters, it's difficult not to be caught up in what is still one of the most vivid depictions of civil war (and its destructive aftermath) ever committed to film."
    },
    {
      "text": "Everything old is new again with this re-release of Gone With the Wind, and it reminds us that the Golden Age of Hollywood was a beautiful time."
    },
    {
      "text": "Yes, frankly, you should give a damn. The performances are legendary, the story is satisfying and the dialogue is still great."
    },
    {
      "text": "Gone With The Wind is among my favorite movies of all time, and it would be useless to go on and on about how great I think it is."
    },
    {
      "text": "At the film's center, of course, is Leigh's strikingly sympathetic portrayal as Scarlett O'Hara, the irascible, manipulative bitch."
    },
    {
      "text": "Undoubtedly still the best and most durable piece of popular entertainment to have come off the Hollywood assembly lines."
    },
    {
      "text": "The movie plays its role in movie history, becoming one of the great box-office performers in the pre-Steven Spielberg and George Lucas days."
    },
    {
      "text": "The passionate saga of Scarlett O'Hara and Rhett Butler, played out against the flaming red backdrop of the Civil War, generates enough romance, historic drama and deep emotion to fuel a dozen great films."
    },
    {
      "text": "This movie is pure soap opera. But what a soap opera!"
    }
  ],
  "release_year": 1939,
  "duration": 222,
  "genres": [
    "Romance",
    "History",
    "Drama"
  ],
  "age_rating": "G",
  "synopsis": "Winner of eight Academy Awards® (plus two special achievement Oscars) Celebrate the 85th Anniversary of one of the most celebrated motion pictures of all time, Gone With the Wind! Clark Gable, Vivien Leigh, Olivia de Havilland and Hattie McDaniel star in this classic epic of the American South. On the eve of the American Civil War, rich, beautiful and self-centered Scarlett O'Hara (Leigh, in her Oscar winning role) has everything she could want--except Ashley Wilkes (Leslie Howard). But as the war devastates the South, Scarlett discovers the strength within herself to protect her family and rebuild her life. Through everything, she longs for Ashley, seemingly--unaware that she is already married to the man she really loves (Gable)--and who truly loves her--until she finally drives him away. Only then does Scarlett realize what she has lost... and decides to win him back.",
  "popularity": 9.2,
  "poster_url": "https://image.tmdb.org/t/p/original/lNz2Ow0wGCAvzckW7EOjE03KcYv.jpg"
}