{
  "movie_name": "Happy Death Day",
  "movie_id": "happy_death_day",
  "total_reviews": 157,
  "reviews": [
    {
      "text": "It's about time we had a fun, fast, and femme-led time loop movie for this millennium. The slasher is easy, breezy, and deadly as it wastes no time getting to its end game."
    },
    {
      "text": "Happy Death Day is a blast, a pure delight. It perfectly straddles the lines between comedy, horror, and romance, somehow juggling all of these genres to create a breezy romp of a movie. It’s a well-deserved addition to the time loop genre."
    },
    {
      "text": "The tongue-in-cheek approach by the filmmakers and their willingness to laugh at themselves makes this a better experience than the corny title would have you believe."
    },
    {
      "text": "The inspired hook fails to make the most of its chosen genre."
    },
    {
      "text": "If not for the tight direction and a few moments of good character choices, this would be a total snore."
    },
    {
      "text": "You won't want to re-live seeing this movie over and over again, but there are worse movies you could be stuck with in life."
    },
    {
      "text": "Morphs from time loop murder mystery to spiritual rebirth story to romance to revenge all in a tight 90 minutes."
    },
    {
      "text": "A fresh, funny spin on the slasher sub-genre made even better by the force of nature that is Jessica Rothe. She walks away with the film."
    },
    {
      "text": "I love the B-movie production design, subdued score, and overall energy of the film."
    },
    {
      "text": "If it simply presented itself as a comedy without any scenes played for actual scares, it could have sharpened both its college satire and genre parody."
    },
    {
      "text": "Its appeal lies in how it fully embraces the cheesiness"
    },
    {
      "text": "Good, not great, but some times good is enough."
    },
    {
      "text": "It's a concept that we've seen before, but with a twist, good direction and some excellent character development. [Full review in Spanish]"
    },
    {
      "text": "Yes, Happy Death Day is just Groundhog Day meets...well...every college-set slasher movie you can name. The thing is, though, that is a simple, brush-off description to what turns out to be a surprisingly entertaining little horror film."
    },
    {
      "text": "Happy Death Day is an inventive, violently smart movie that will renew your love for slashers."
    },
    {
      "text": "A breezy, peppy, gore-lite affair that survives mostly on the strength of its own sense of humour."
    },
    {
      "text": "Happy Death Day is a slasher flick that oozes charm, humour and surprisingly little blood and gore. It's like Mean Girls meets Scream meets Groundhog Day."
    },
    {
      "text": "[Happy Death Day] has a very indolent and superficial perception of what it's like to be a young woman at college. [February 1, 2018]"
    },
    {
      "text": "Despite all the failures, the experience of surrendering to the empty and imperfect pleasures of 'Happy Death Day' is far from unsatisfactory. [Full Review in Spanish]"
    },
    {
      "text": "Derives a fair amount of mileage out of its canny premise."
    },
    {
      "text": "A certified Tuesday night time-waster whenever it finally makes it to Netflix."
    },
    {
      "text": "Happy Death Day didn't need to be as smart as the movies it brazenly stole from in order to be entertaining. It did, however, need to be smarter than this."
    },
    {
      "text": "An act of cinematic sadism, a mean-spirited, self-satisfied piece of teeny-bopper schlock that attempts to clothe its snickering immaturity in a half-baked moral."
    },
    {
      "text": "Strong female character involved in a mysterious plot, which features comedy effectively spared throughout."
    },
    {
      "text": "It may leave horror fans wanting more but Happy Death Day is a very entertaining feature."
    },
    {
      "text": "Happy Death Day is a fun, action-packed hour and a half."
    },
    {
      "text": "Turns out being a shameless Groundhog Day rip-off is not the worst thing that can happen to your movie."
    },
    {
      "text": "As fixes for reviving the slasher genre apart from \"make them good again\" go, this is actually a pretty ingenious one."
    },
    {
      "text": "Happy Death Day does not reinvent the wheel when it comes to time loop films. However, it does shock the audience when it chooses to divert."
    },
    {
      "text": "With a PG-13 rating, Happy Death Day... misses out on any semblance of gleeful violence. There's virtually no gore...and very little violence in general, especially for a movie about a girl repeatedly stabbed, shot, beat, and bludgeoned to death."
    },
    {
      "text": "Happy Death Day is a fun romp that skirts cliches and keeps you guessing about the identity of the would-be killer until the very end."
    },
    {
      "text": "It's fun, wickedly cheeky and ultimately entertaining. But, I wouldn't want to relive it again."
    },
    {
      "text": "Happy Death Day isn't very original... But it still manages to provide an original spin in a surprisingly fun manner."
    },
    {
      "text": "What if \"Groundhog Day\" was a horror thriller? That's the question poised by slasher \"Happy Death Day,\" and for the most part, it's a concept that works quite effectively."
    },
    {
      "text": "A fun and campy romp on the horror genre for a new generation of teens that'll definitely have a great time."
    },
    {
      "text": "The stalking is competent but not terrifying, and the jokes seldom rise to the level of being funny."
    },
    {
      "text": "\"Happy Death Day\" winds up being a happiness indeed."
    },
    {
      "text": "Hollywood, please. Don't make this movie over and over again."
    },
    {
      "text": "Happy Death Day is a fun and frightening spin on the time-loop trope. Enjoyable and entertaining, this is one film destined to join the ranks of other classic teen slashers."
    },
    {
      "text": "I don't know about you, but if I was continually murdered and woke up only to start the day over again, that would probably be the first thing on my mind: who the eff killed me!?"
    },
    {
      "text": "Don't get me wrong, Happy Death Day is a pretty dumb movie. But for a wide-release, PG-13 movie on a Friday the 13th in October, it is just the type of dumb, fun, horror tryst you hope to find for a mindless night at the cinema."
    },
    {
      "text": "The film's ploy still resounds, lessening the chances of whatever ambition it has to be anything more than a novelty act."
    },
    {
      "text": "It's the perfect film to see if you want a fun movie this Halloween that won't give you nightmares."
    },
    {
      "text": "The scariest and most mysterious thing about it is that midway through we find out the film takes place in Louisiana. That's what you call a random reveal."
    },
    {
      "text": "When it gets into the actual premise, it takes a turn....You get some action scenes, some self aware humor, just a different tone all together and it actually becomes pretty funny."
    },
    {
      "text": "Happy Death Day embraces its slavish devotion so utterly it actually...sort of...works? It's a horror-comedy that veers more toward the latter (especially in the second act), and succeeds as much as it does because of a solid foundation."
    },
    {
      "text": "Knowing \"Happy Death Day\" is a \"Groundhog Day\" retread before seeing it is a positive. You might even enjoy this slasher film more than I did. I found it to be annoyingly unoriginal and tedious. Where's Bill Murray when you need him?"
    },
    {
      "text": "As the slasher flick it's trying to be, it kind of falls flat...but it's enjoyable enough."
    },
    {
      "text": "The temporal loop is the plot's stem, while its slasher angle is that of self-consciousness. [Full review in Spanish]"
    },
    {
      "text": "Although it's gleefully superficial, Happy Death Day never removes its tongue from its cheek, and is all the better for it."
    },
    {
      "text": "It's disappointing that Happy Death Day is unable to come up with a successful blueprint for a spin on Groundhog Day, as placing that concept inside of a horror film isn't necessarily a bad idea"
    },
    {
      "text": "The mixture is quite attractive, although Christopher Landon is not Wes Craven. [Full Review in Spanish]"
    },
    {
      "text": "[It's] simplicity and honesty are it's charm. [Full Review in Spanish]"
    },
    {
      "text": "This film has the right idea. [Full Review in Spanish]"
    },
    {
      "text": "Happy Death Day is disposable cinema at its best."
    },
    {
      "text": "Happy Death Day offers fun twists on horror customs while blending them with smart dark comedy."
    },
    {
      "text": "... a clever psychological horror mystery that dares to ask, \"Why aren't you living every day as if it were your last?\" ... a horror film with heart."
    },
    {
      "text": "Jessica Rothe is... a very charismatic Scream Queen that alone carries the weight of the show. [Full review in Spanish]"
    },
    {
      "text": "A pure B-movie. [Full Review in Spanish]"
    },
    {
      "text": "Whoever looks for something more than mere ingenuity will have to look elsewhere. [Full Review in Spanish]"
    },
    {
      "text": "The protagonist doesn't know how to get out of her loop because the creators don't either. [Full Review in Spanish]"
    },
    {
      "text": "...a decent effort that hits more than it misses."
    },
    {
      "text": "The film has its share of flaws, plot holes (and a terrible villain), but it's so much fun that these are easily overlooked."
    },
    {
      "text": "Happy Death Day isn't particularly scary, and clearly isn't meant to be - the pleasure lies in the games it plays with its basic storyline, along the way tossing in enough offbeat humour and whodunnit twists to keep us entertained."
    },
    {
      "text": "A bloody 'déja vu', nothing original but very funny. [Full review in Spanish]"
    },
    {
      "text": "Although this high concept slasher pic borrows elements from [other] films, it blessedly does a few original things to make the formula feel fresh and fun."
    },
    {
      "text": "Stimulating entertainment. [Full Review in Spanish]"
    },
    {
      "text": "Rothe is the closest thing to a saving grace here; she has presence and wit and looks. If she can manage to drag herself clear of having to do junk like this, she may even have a future."
    },
    {
      "text": "The idea of ​​a Groundhog Day slasher film version was interesting and funny at times. [Full review in Spanish]"
    },
    {
      "text": "If you can't enjoy [Happy Death Day], give up on film."
    },
    {
      "text": "On another level, Happy Death Day is a low-key celebration of cinema. Landon and Lobdell revel in how their story could only happen in the movies, piling on preposterous complications with self-aware glee."
    },
    {
      "text": "Happy Death Day is a harmless horror film that will content slasher fans."
    },
    {
      "text": "Have you ever laughed when somebody died? I did, multiple times, in this film."
    },
    {
      "text": "If you can meet it halfway, \"Happy Death Day\" works well as an entertaining genre twist on a classic comedy."
    },
    {
      "text": "By the standards of slasher films, an accomplished one; by the standards of PG-13 slasher films, an extravagant masterpiece."
    },
    {
      "text": "While Happy Death Day starts well enough and is very proud of its sense of humour, it's too lazy to bother its arse when the time comes to justify its premise."
    },
    {
      "text": "It's nicely played -- as you'd expect from a film co-produced by genre king Jason Blum -- and it should entertain a younger crowd. And it does, eventually, acknowledge its debt to Bill Murray's classic."
    },
    {
      "text": "There's better horror out there. There's better horror-comedy out there, too. What it all really comes down to, though, is if there's going to be another Groundhog Day film attempt, there has to be a better justification for it."
    },
    {
      "text": "If you're looking for outright scares, you might be disappointed; for a slasher, Happy Death Day is also very light on bloodshed. But it's got real heart - for a film about death, it's surprisingly life-affirming."
    },
    {
      "text": "Sometimes you just like a movie even though it kind of sucks."
    },
    {
      "text": "One of the most breezily enjoyable teen movies of recent years."
    },
    {
      "text": "If we're doomed to watch the same movies over and over (and we evidently are), at least this one makes an effort."
    },
    {
      "text": "A slasher comedy that allows its leading lady to flip the bird at the usual clichés, instead of simply and sadistically punishing her."
    },
    {
      "text": "Happy Death Day is stupid, but not in the fun way."
    },
    {
      "text": "The film's ability to not take itself too seriously is probably what makes it most enjoyable."
    },
    {
      "text": "\"An energetic and engaging piece of poppy PG-13 horror, made with a clear knowledge and affection for the genre.\""
    },
    {
      "text": "Landon's scary movie offers a short, sharp shock to the system. Let it make your day."
    },
    {
      "text": "The whole thing is basically Gossip Girl as seen through the lens of Nietzsche's theory of eternal recurrence, only not as fun as that sounds."
    },
    {
      "text": "Director Christopher Landon and screenwriter and comics veteran Scott Lobdell maintain modest tension and humor as they deliver tried-and-true genre standbys like loud music jump-scares, an unnaturally deserted hospital and red-herring suspects."
    },
    {
      "text": "If you ignore the plotholes, you'll get drawn into the whodunnit (you'll probably be right) - and it's as funny as it is scary - like a slasher Mean Girls."
    },
    {
      "text": "Happy Death Day might be the cheeriest slasher film ever made. It doubles as a romcom, trebles as campus satire, quadruples as anything else you like, really."
    },
    {
      "text": "But the film doesn't just find a clever way to refresh a maybe-calcified genre. It also overturns some of the genre's more puritanical tendencies."
    },
    {
      "text": "Happy Death Day is a fun, if silly, blending of various genre tropes that is fueled by a strong lead performance from Rothe."
    },
    {
      "text": "In a world where bad news cascades through our various screens and seems to compound every week, there's something comforting about the notion of not moving forward until this one damn problem gets definitively solved."
    },
    {
      "text": "[Happy Death Day] is an unrewarding slog."
    },
    {
      "text": "If only this movie were as smart as its inspiration."
    },
    {
      "text": "I'll be the first to admit that Happy Death Day maybe isn't going to be for everyone, but as someone who has a deep appreciation and admiration for horror comedies and murder mysteries, I thought the latest from Christopher Landon was an absolute blast."
    },
    {
      "text": "Director Christopher Landon not only has fun with the high-concept premise, but he also ably turns Theresa from helpless brat to brassy detective in a short period."
    },
    {
      "text": "While Happy Death Day isn't perfect by a long shot, the film definitely does a great job in making its audience hanker for all those '90s slashers nobody seems to be interested in making nowadays."
    },
    {
      "text": "It is ingeniously structured in its own right, even if some of its plot twists and contortions don't entirely stack up."
    },
    {
      "text": "Unlike the guilty pleasure Final Destination franchise, the recurring death scenes don't even have the decency to be entertainingly ingenious."
    },
    {
      "text": "Its best asset is the comical performance by its likable heroine played by Jessica Rothe. as the sassy sorority girl."
    },
    {
      "text": "Happy Death Day is about 90 minutes long and, past the first half-hour, every minute is dumber than the one before it."
    },
    {
      "text": "Happy Death Day is as much a dark comedy as it is a horror film. And it's a pretty darn funny one, at that."
    },
    {
      "text": "It's a refreshing piece of light horror that eschews gratuity for the sake of efficient storytelling that occasionally allows for both tongue-in-cheek and knife-in-gut and effectively stands astride multiple genre boundaries."
    },
    {
      "text": "Neither scary nor funny enough to survive even to Halloween."
    },
    {
      "text": "Happy Death Day underestimates the fun in Tree's experimentation, and gets there too late."
    },
    {
      "text": "If you're looking for a fun and harmless option heading into Halloween, Happy Death Day won't leave you disappointed."
    },
    {
      "text": "Will be an exciting treat for some, and a frustrating trick for others."
    },
    {
      "text": "It's all a humorous gloss on teen self-discovery."
    },
    {
      "text": "Happy Death Day cannot decide what kind of film it wants to be. It lacks the amount of comedy to be a proper horror comedy, and it lacks the scares and terror necessary to make it an effective horror film."
    },
    {
      "text": "One of 2017's most unforeseen gems, this freewheeling bit of slasher craziness is an amusing genre miracle worth celebrating."
    },
    {
      "text": "Though it obviously borrows from Groundhog Day, this gleefully silly slasher movie has a playful spirit, likable characters, and even some half-decent life lessons."
    },
    {
      "text": "It's John Hughes with a side of stabbing."
    },
    {
      "text": "[Christopher] Landon tries to create chills the way Harold Ramis crafted chuckles in Groundhog Day, but Tree's various demises just get more and more anticlimactic each time."
    },
    {
      "text": "Maybe screenwriter Scott Lobdell didn't realize he was on the same track as this year's earlier release \"Before I Fall,\" but it is uncanny how similar they are - sprinkle a little of the 1950 noir \"D.O.A.\" on the latter and voila!"
    },
    {
      "text": "There's a spunky charm to the Scream-meets-Groundhog Day thing, and the film is well-built. The problem is its chipper message."
    },
    {
      "text": "[Screenwriter Scott Lobdell] finds ways of evolving the simplistic gimmick into something more."
    },
    {
      "text": "If you're looking for a terrifying horror/thriller, It will keep you up for many nights. But for a vintage 90s era scare, this will leave a smile on your face."
    },
    {
      "text": "Anyone looking to enjoy some scares while trying to figure out a very clever mystery should plan on seeing Happy Death Day."
    },
    {
      "text": "It's a pleasant enough time-waster, but it's hard to recommend."
    },
    {
      "text": "Don't tell anybody, but I closed my eyes a few times when the music signaled the killer was on his-or-her way. And there's an unexpected death that caused me to jump and, ahem, audibly exclaim."
    },
    {
      "text": "[Happy Death day] is fun and energetic, and god knows you could do worse for a Halloween distraction."
    },
    {
      "text": "\"Who's Bill Murray?\" is the most honest line in \"Happy Death Day.\" Its heroine, Tree, and young girls plunking down babysitting cash to watch may not know about Murray or \"Groundhog Day\" but the movie does little to live up to the gaffled idea."
    },
    {
      "text": "What's lurking beneath the surface of this ruthlessly violent horror movie is a glimmer of gold."
    },
    {
      "text": "The movie is no big deal, but its Groundhog Day conceit is kind of irresistible, and the genre blend seems right for this age of women seeking stability and empowerment."
    },
    {
      "text": "The material's juvenile tonality only takes minutes before it begins to feel like multiplex imprisonment."
    },
    {
      "text": "What makes Death Day feel so fresh is that this is all played with a whopper of a wink, pulled off by the considerable comedic talents of star Jessica Rothe, who successfully juggles the horror/comedy mash-up."
    },
    {
      "text": "This is one movie that no one needs to relive."
    },
    {
      "text": "Doesn't seem to enjoy its own ridiculous concept enough, and yet refuses to stage any set pieces that feel honestly scary either."
    },
    {
      "text": "The reveal is a bit predictable, but a couple of fake-outs keep things interesting along the way."
    },
    {
      "text": "The movie has inventive elements to it and lots of positives like creative editing and strong performances, but it ultimately underwhelms due to its lack of urgency or an underscoring point."
    },
    {
      "text": "Nobody will bother reliving this movie over and over again, but it's a refreshingly good time while it lasts."
    },
    {
      "text": "Becoming a decent person requires an awful lot of dying in \"Happy Death Day,\" a snappy horror-comedy with a gentle romantic spine."
    },
    {
      "text": "It won't scare you, but it will entertain you with a cynical sense of humor and a few clever new twists on a familiar formula."
    },
    {
      "text": "Lobdell's horror-comedy isn't scary or funny, boasting jump scares and jokes that might have felt fresh twenty years ago."
    },
    {
      "text": "Once the novelty of the genre swap wears off, you're just watching another inferior variation."
    },
    {
      "text": "A sick, slimy and noxious stalker-slasher, terribly repetitive and not even amusing accidentally. Built joylessly by and for men - about the mean pretty girl who must change"
    },
    {
      "text": "Ultimately Happy Death Day isn't quite the film it could have been."
    },
    {
      "text": "Campy, clever, thrilling and, most important, a delirious amount of horror fun that kicks off with the opening Universal logo and never slows down."
    },
    {
      "text": "Happy Death Day twists the inherent repetitiveness of slashers to its advantage by exaggerating it to an impossible degree."
    },
    {
      "text": "I expect Jessica Rothe just stenciled her name alongside Amy Adams, Hilary Swank, and other big-time screen actresses who got an early break in a forgettable horror movie, but went on to bigger and better things."
    },
    {
      "text": "Cleverly, the filmmakers know we'll all gonna keep watching to see what happens, even if it is against our better judgment."
    },
    {
      "text": "[It] harnesses knife-taking-life clichés to produce a merry ride of Halloween silliness with far more chuckles than chills"
    },
    {
      "text": "If you're prepared to take your brain off the hook, then I reckon this film ticks a lot of boxes as an enjoyably daft way to spend a couple of hours."
    },
    {
      "text": "If it's not scary enough, bloody enough, or funny enough, then what is it? Just another slasher movie hardly worth celebrating."
    },
    {
      "text": "Although concentrating on delivering easily digestible situations and scene progressions, Landon does demonstrate some enticing visual flair that gets rather diminished by the repetitiveness of the plot."
    },
    {
      "text": "\"Happy Death Day\" is \"Groundhog Day\" dipped in blood, and if the movie isn't all that clever, it's just clever enough to get by."
    },
    {
      "text": "Once you get past the premise - and granted, that takes some doing - \"Happy Death Day\" turns out to be goofy good fun."
    },
    {
      "text": "The film's biggest issue is not knowing exactly what kind of movie it wants to be - and ends up being a hodgepodge. Nothing \"Happy\" about that."
    },
    {
      "text": "Happy Death Day is a generic PG-13 horror purgatory that's lived on repeat until even weaker motivations take us farther out of any semblance of storytelling thrills."
    },
    {
      "text": "It's Groundhog Day meets Scream, although lacking the first film's novelty and the latter's postmodern smarts."
    },
    {
      "text": "It's hard to tell if Happy Death Day is a smart movie masquerading as a dumb one or vice versa."
    },
    {
      "text": "Live.Die.Enjoy"
    },
    {
      "text": "Happy Death Day may actually be too beholden to its forebears, if only because this horror film is at its very best when it's being funny."
    },
    {
      "text": "An involving, vivaciously written morality chiller. \"Happy Death Day\" is fun, plain and simple, injecting welcome devilish mirth into a genre—and a bleakly discordant 2017 landscape—when we need a little cathartic levity more than ever."
    },
    {
      "text": "In a genre filled with countless tales of unhinged killers stalking and slaying pretty young things, part of Happy Death Day's appeal stems from both leaning into and playing with the usual tropes."
    }
  ],
  "release_year": 2017,
  "duration": 96,
  "genres": [
    "Horror",
    "Mystery & Thriller",
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "Tree Gelbman is a blissfully self-centered collegian who wakes up on her birthday in the bed of a student named Carter. As the morning goes on, Tree gets the eerie feeling that she's experienced the events of this day before. When a masked killer suddenly takes her life in a brutal attack, she once again magically wakes up in Carter's dorm room unharmed. Now, the frightened young woman must relive the same day over and over until she figures out who murdered her.",
  "popularity": 6.7,
  "poster_url": "https://image.tmdb.org/t/p/original/hcCX4zqu5b8v7DuDCJGcmI3MmlA.jpg"
}