{
  "movie_name": "Harry Potter and the Philosopher's Stone",
  "movie_id": "harry_potter_and_the_sorcerers_stone",
  "total_reviews": 197,
  "reviews": [
    {
      "text": "The acting is not great, the story's cookie-cutter, but some of the graphics still held up and there are interesting aspects of the wizard world. I think I may have missed the boat on this by watching this as a grown man, but I get why people like this."
    },
    {
      "text": "This is a solid foundation for the film series but the pacing and acting make this a slog to get through."
    },
    {
      "text": "Harry Potter and the Sorcerer's Stone remains a memorable debut for one of the biggest fantasy franchises of all time. Not only does it hold after over 20 years, but this movie is still a benchmark for world building by any standard."
    },
    {
      "text": "... a painstakingly literal translations of J.K Rowling’s first novel, a near-perfect replica created with a kind of funhouse spectacle of the wonders of the magical world come to life."
    },
    {
      "text": "...a decent-enough first installment that admittedly does a nice job of establishing Rowling's impressively detailed world and characters..."
    },
    {
      "text": "An exceptional big-screen half-term treat."
    },
    {
      "text": "The Harry Potter movies are the rare series to defy the notion that the books are always better."
    },
    {
      "text": "It's always thrilling to see kids taking matters into their own hands, outthinking their peers, outwitting adults, and defeating superior enemies."
    },
    {
      "text": "Does a magnificent job in bringing to life the unique world of magic and fantasy that, until its mega-hyped release, existed only in the imaginations of author J.K. Rowling's devoted readership."
    },
    {
      "text": "Harry Potter and the Sorcerer's Stone is truly a tale for all ages that will last for ages."
    },
    {
      "text": "Good film directed for a teenage audience in which not only is magic taught but also how stereotypes affect it while the film itself recreates some British stereotypes. [Review in Spanish]"
    },
    {
      "text": "The introduction to Hogwarts and the magic world is very charming and fun."
    },
    {
      "text": "This is the world-building moment for Harry Potter, and I loved it. It's sweet and endearing...the set-up is so enjoyable to see."
    },
    {
      "text": "Harry Potter's first venture onto the screen is a solid blockbuster."
    },
    {
      "text": "Chris Columbus has created an extraordinarily detailed look that's both fantastic and yet has its own reality - exactly like an English public school, come to think of it, especially in your first term ."
    },
    {
      "text": "Harry Potter and the Sorcerer's Stone is, despite its trickery, that plainest and least surprising of artifacts: the work of art that is exactly the sum of its parts, neither more nor less."
    },
    {
      "text": "Harry Potter's adventures in wizard-land are cozy and comfortable in Chris Columbus' faithful adaptation."
    },
    {
      "text": "This faithful rendition of the inaugural Potter book demonstrates that the franchise is in safe, sensible hands."
    },
    {
      "text": "A surprisingly excellent exciting fantasy flick..."
    },
    {
      "text": "First Potter movie is a magical ride but also intense."
    },
    {
      "text": "A near-perfect commercial and cultural commodity."
    },
    {
      "text": "I hear the J.K. Rowling books are great, and on the basis of this 2001 movie I'm ready to believe it."
    },
    {
      "text": "Robbie Coltrane, Richard Harris, Zoe Wanamaker and Maggie Smith, to name but a few, all put in an appearance and it is these old hands who are the best aspect of the film."
    },
    {
      "text": "Suffering from too much fantasy over too little reality, Sorcerer's Stone sets Harry Potter up for a longer and fruitful career as a screen legend."
    },
    {
      "text": "Because the film is so glossy, so flippant in its presentation of the world that author J.K. Rowling has spent her sizable novels dissecting, that I still don't have a good idea what all the fuss is about."
    },
    {
      "text": "The quickest, zappiest two and a half hours of entertainment you'll ever see."
    },
    {
      "text": "Even though a few of the book's scenes have been cut, fans probably couldn't hope for a better adaptation. It bodes well for the rest of the series, when strong stories start taking precedence over set-up."
    },
    {
      "text": "A spectacular franchise takes flight."
    },
    {
      "text": "I couldn't find one mis-step, one wrong move, or one disappointment in the transition from print to celluloid."
    },
    {
      "text": "Columbus' rendition of the first Harry Potter is a slavish adapation of the book, lacking imagination or vision, though not as bad as to be insufferable to watch"
    },
    {
      "text": "The special effects aren't overwhelming and the ideas aren't too far-fetched, but the story will reel in just about anybody."
    },
    {
      "text": "Unfortunately, many fine performances are nearly wasted by Columbus's predictable direction and an overbearing, relentless soundtrack."
    },
    {
      "text": "Even though this movie impresses and delights on it's own, it is more exciting to view it as a teaser for the films to come"
    },
    {
      "text": "Even without a whit of singing, it is the 'Wizard of Oz' of our time. (Published 12-22-01)"
    },
    {
      "text": "A sense of loss accompanied my appreciation of the movie. The images created by my own imagination...will now be changed forever."
    },
    {
      "text": "Though generally overrated, it's a good start to what will undoubtedly become an epic film franchise."
    },
    {
      "text": "A Xerox copy of the book, and a copy is never as good as the original."
    },
    {
      "text": "Full of well-designed atmospheric charm, full of wondrous, expensive effects and mediocre-at-best acting, full of media hype and holiday-season merchandising opportunities."
    },
    {
      "text": "The two biggest elements that keep the film from attaining a \"classic\" level of moviemaking have to do with its lack of sustained momentum and wit."
    },
    {
      "text": "Surefire crowd-pleaser, with a terrific, note-perfect cast and impressive use of special effects."
    },
    {
      "text": "The story is not only faithfully but wonderfully translated to film."
    },
    {
      "text": "Faithful to book, film conjures up magical moments for fans to savor."
    },
    {
      "text": "Like the Ewok TV movies of the mid 80s, Harry Potter meaninglessly shoestrings a new fantastical event with every scene."
    },
    {
      "text": "Sorcerer's Stone is that rare effort that successfully breathes cinematic life into a children's classic."
    },
    {
      "text": "Harry Potter manages to avoid sloppy sentimentality, but weaves the perfect balance, allowing us to not only enjoy this fabulous fantasy on a visual level, but also on a satisfying emotional one."
    },
    {
      "text": "For the non-fan, Harry Potter and the Sorcerers Stone serves up a memorable diversion, but it's hard to ignore the potholes."
    },
    {
      "text": "It offers more delights than disappointments -- and that qualifies as one of the year's great reliefs."
    },
    {
      "text": "An admirable spectacle, a real thriller for the kids and the kid in all of us, but ... straightforward and workmanlike."
    },
    {
      "text": "What director Chris Columbus hasn't brought to it is any kind of inherent wonder or more palpable reason for being"
    },
    {
      "text": "As directed by Chris Columbus and written by Steve Kloves, Harry Potter and the Sorcerer's Stone\" is a film with no personality of its own, despite being filled with many unforgettable personalities."
    },
    {
      "text": "Emotionally, this Harry Potter is just as inert as the popcorn-munching masses watching him."
    },
    {
      "text": "good enough to please those who already love the books (there's a few million happy faces right there) while giving those who've resisted the Potter craze a tantalizing taste of what they've been missing out on."
    },
    {
      "text": "A parte tcnica de Harry Potter e a Pedra Filosofal  impecvel."
    },
    {
      "text": "The film comes off uncannily like the book; the scenes are exactly as you would imagine them. This, however, probably says more about the writing abilities of Rowling as an author than Columbus as a director."
    },
    {
      "text": "There is such a thing as being too faithful to a novel. Many things that were amusing on the page are laborious and redundant in the film... but they're there anyway."
    },
    {
      "text": "This whimsical film offers compelling proof that magic and movies go together like ABRA and CADABRA."
    },
    {
      "text": "...certainly an entertaining and recommendable film, but it never soars to the heights of filmmaking or imagination."
    },
    {
      "text": "So reverentially faithful to the first book that however you feel about the book is a pretty reliable indicator of how you'll feel about the movie."
    },
    {
      "text": "Great fun, even if it's not a particularly good movie."
    },
    {
      "text": "The relatively hands-off treatment of any pathos is an unfortunate side effect of the film's travelogue feel."
    },
    {
      "text": "If you enjoyed the book (or at least can take some kids with you who did), go watch it played out on screen -- just don't expect magic to happen."
    },
    {
      "text": "My suggestion: Sit down and read the book again."
    },
    {
      "text": "A wondrous achievement whose life, wit and vision made me grin"
    },
    {
      "text": "The filmmakers want to show us a magical world that is, at the same time, wholly believable. They want to create matter-of-fact miracles, but what they end up with is mostly just plain matter-of-fact."
    },
    {
      "text": "Quiz la cinta no es perfecta, pero es un claro ejemplo de entretenimiento familiar y de que la imaginacin es algo de lo ms preciado que tiene el ser humano."
    },
    {
      "text": "The blame for this is a too heavy directorial hand. Originality might have flowered under a lighter touch and the original literary work better served."
    },
    {
      "text": "'Harry' does indeed fly--just don't expect the movie soar into the higher altitudes of imagination."
    },
    {
      "text": "It's a good sign that Harry Potter and the Sorcerer's Stone feels rushed at two-and-a-half hours. I would easily have sat twice as long."
    },
    {
      "text": "The tone is right, the pacing is right, and most significantly, the look is right"
    },
    {
      "text": "Columbus ... has assembled a wizardly cast and crew."
    },
    {
      "text": "By not screwing up, Columbus has fulfilled his most important job requirement."
    },
    {
      "text": "And yet, all things considered, the team behind this film seems to have done the best job possible."
    },
    {
      "text": "Successfully imposes its imagery of the highly fictionalized reality of Harry Potter, and capitalizes on the charming qualities of its popularized protagonist."
    },
    {
      "text": "No se saca un 10, pero s una buena nota.... un 9 3/4 :)"
    },
    {
      "text": "Watson is witty, wise, and irresistible to watch, while Grint plays the comic relief to the many edge-of-your-seat situations that the kids find themselves in."
    },
    {
      "text": "It's a great movie for kids and pre-teens, as well as being an enjoyable diversion for adults."
    },
    {
      "text": "For a movie about magic, there's not much magical about it."
    },
    {
      "text": "[A] complete triumph..."
    },
    {
      "text": "A very good movie, and a faithful adaption of the book."
    },
    {
      "text": "the film adaptation is too faithful to the book, which may be a turnoff to the less-than-hard-core fans."
    },
    {
      "text": "a beautifully mounted adventure movie that adheres almost fetishistically to its source material"
    },
    {
      "text": "While Chris Columbus has done what Warner Brothers, Rowling and most of her readership wanted...he's ironically lost some of the magic"
    },
    {
      "text": "The good news is that the film is about as careful an adaptation as can be imagined, one that takes next to no liberties with the original text."
    },
    {
      "text": "You can't expect perfection from muggles."
    },
    {
      "text": "Its efforts to set itself above the bar are rather admirable, if not quite charming or endearing in their eventual failures."
    },
    {
      "text": "Will not disappoint Rowling's legions of fans."
    },
    {
      "text": "Has scattered, enthralling, entertaining individual moments."
    },
    {
      "text": "Fans of the novel will have great fun reliving its adventures, and newcomers will receive a rollicking welcome to its magic-touched realm."
    },
    {
      "text": "The grandfather and grandson sitting next to me in the third row loved this film. That says it all."
    },
    {
      "text": "I almost wish I hadn't read the novel first. In an effort to please the Potter-philes, the filmmakers end up offering very few surprises."
    },
    {
      "text": "I am now officially a Harry Potter fan. And that, I think, is the highest compliment a movie can get."
    },
    {
      "text": "It delivers exactly what you would expect from a popular fairy tale in this age of digital animation."
    },
    {
      "text": "Your appreciation of the film is likely to be colored by whether or not you've read the book(s)."
    },
    {
      "text": "Visually the film is just about all you could hope for."
    },
    {
      "text": "Rarely has a movie seemed more beholden to its roots, or required so much outside help to give it its spark."
    },
    {
      "text": "Professional entertainment with just enough human moments to squeak by."
    },
    {
      "text": "It's the smaller touches, transposed in whole from the book, that make the film as good as it is."
    },
    {
      "text": "The narrative is a scattershot sprint through the book's events with little regard for character motivation."
    },
    {
      "text": "\"Harry Potter\" stands on its own as an accomplished cinematic achievement."
    },
    {
      "text": "I can safely say, with nary a qualm, that if you read this book, you will, at worst, really like this movie. Non-readers might find it slow."
    },
    {
      "text": "Runs over two-and-a-half hours, but is so entertaining that it feels much shorter."
    },
    {
      "text": "Turns out to be delightful entertainment."
    },
    {
      "text": "I doubt that most Harry Potter fans will mind a film that attends to their wishes so splendidly."
    },
    {
      "text": "Yet for all its faithfulness to the concrete details of the book, the film is missing something when it comes to capturing the most important detail of all: its sense of magic."
    },
    {
      "text": "It is good enough to satisfy the frenzy and hype of the moment."
    },
    {
      "text": "Like Jake Lloyd starring in a Willy Wonka remake."
    },
    {
      "text": "Here's the long and short of it: Harry Potter and the Sorcerer's Stone is good, but not great."
    },
    {
      "text": "Though the film will undoubtedly please the young viewers who flock to it, ultimately many of the book's readers may wish for a more magical incarnation."
    },
    {
      "text": "The film is what Hollywood magic is all about."
    },
    {
      "text": "As a movie, Harry Potter and the Sorcerer's Stone has no inner life -- no pulse -- of its own: It's secondhand."
    },
    {
      "text": "The trickiest magic of Harry Potter and the Sorcerer's Stone was performed by the casting directors."
    },
    {
      "text": "It's absolutely possible to have nothing but fun at Harry Potter and the Sorcerer's Stone, particularly if you're a fan of the books and you're not looking for cinematic revelations."
    },
    {
      "text": "The magic mostly works."
    },
    {
      "text": "A shapely, exciting show, driven but not ruled by sets and effects."
    },
    {
      "text": "If every movie that's greedily earmarked as a cinematic franchise could be as immaculately conceived as Chris Columbus' Harry Potter and the Sorcerer's Stone, there would be no reason to complain about the crass commercialization of films."
    },
    {
      "text": "Remarkably faithful, consistently entertaining if overlong adapatation."
    },
    {
      "text": "As it is, Harry's gotten a ride. But at a much lower altitude than his fans might have wished."
    },
    {
      "text": "Harry Potter and the Philosopher's Stone is grand, joyous, beguiling entertainment."
    },
    {
      "text": "Eye-poppingly gorgeous sets and spectacular special effects make Harry Potter And The Philosopher's Stone a magical experience."
    },
    {
      "text": "Despite the movie's pedestrian direction, our cranky old critic finds he can't deny kids the right to be enthralled."
    },
    {
      "text": "The movie needs to be stronger dramatically, with a much more appealing central performance, to be the great family-oriented screen fantasy so many wanted."
    },
    {
      "text": "They got it right."
    },
    {
      "text": "During Harry Potter and the Sorcerer's Stone, I was pretty sure I was watching a classic, one that will be around for a long time, and make many generations of fans."
    },
    {
      "text": "It is nothing if not a stunning achievement in set design, costumes, make-up, special effects and a well-chosen cast rendering perfectly and vividly an iconic and universally renowned fantasy world."
    },
    {
      "text": "For every flight, the film serves up equal amounts of flattened-out shortfall."
    },
    {
      "text": "Rowling's exceptional world ... transfers to the screen with a general creativity and charm in the hands of director Chris Columbus."
    },
    {
      "text": "Spellbinding."
    },
    {
      "text": "An imaginative spiritual tale about the huge antagonisms of good versus evil that challenges us to hallow the sacred energies of friendship, fearlessness, and love."
    },
    {
      "text": "A good, solid adventure film, no doubt one of the defining movies in the generation growing up now"
    },
    {
      "text": "The picture isn't inept, just inert."
    },
    {
      "text": "Moves along rather herkily-jerkily, bouncing from one special effect to another, from one character or scene to another, with seemingly little connection between them."
    },
    {
      "text": "There's no denying that the much-hyped, big-budget adaptation will appeal to those who are already converted."
    },
    {
      "text": "I can't really say that this film taught me anything about why this character is so loved by so many around the world."
    },
    {
      "text": "In a perpetual state of Petrificus Totalus, Columbus contributes a pedestrian direction as if he was looking for his own place in Hufflepuff \"where they are just & loyal.\""
    },
    {
      "text": "A lavish and proficient adaptation that nevertheless falls short of the first rank of children's fantasies."
    },
    {
      "text": "A series of rich CG adventures in a narrative that does not cohere."
    },
    {
      "text": "Retains (and in many cases, boosts) as much of the spirit [of the book] as you could reasonably expect."
    },
    {
      "text": "It may be long, but it's not boring."
    },
    {
      "text": "The movie version of Harry Potter and the Sorcerer's Stone is, as the Brits might put it, quite good."
    },
    {
      "text": "Nothing short of amazing from a visual standpoint -- what with all of the fun, amusing and imaginative details -- but isn't quite there from a storytelling perspective."
    },
    {
      "text": "The Sorcerer's Stone is the first of what will almost certainly be the most popular series of fantasy films since Star Wars."
    },
    {
      "text": "Fans will welcome the mostly reverent translation, but the uninitiated will find the movie cramped and static."
    },
    {
      "text": "The new, much-anticipated movie is a faithful, literal, only mildly imaginative rendering of that book. While no disgrace, it is certainly no classic."
    },
    {
      "text": "Everything else is present and accounted for, which explains the two-hour, 25-minute running time."
    },
    {
      "text": "Poorly paced and frequently dull."
    },
    {
      "text": "Lovers of the book will find most of their favorite moments beautifully realized, perhaps even bigger and more wondrous than they imagined them."
    },
    {
      "text": "A perfect introduction to the series for the ten or so kids who haven't read the actual books."
    },
    {
      "text": "Potterrific!"
    },
    {
      "text": "Visually stunning Harry Potter stays true to the book but falls short of classic status."
    },
    {
      "text": "Rowling's glorious contribution to the world with the 'Harry Potter' series was in exciting a young generation to the pleasures of reading. What Columbus has managed is to get that same generation to accept blandly workmanlike, outsize Hollywood product."
    },
    {
      "text": "Enough mythic archetypes and heroic quest stages emerge here to make Sorcerer's Stone seem like Star Wars on broomsticks."
    },
    {
      "text": "Columbus and screenwriter Steve Kloves are so careful to avoid offending anyone by excising a passage from the book, the so-called narrative is more like a jamboree inside Rowling's head."
    },
    {
      "text": "The sheer magic of the movie's spirit saves the day."
    },
    {
      "text": "This manages to keep not just the heart of the story, but the characters and the storyline intact--and make it work on the screen."
    },
    {
      "text": "...Columbus could have cut out the entire middle hour...and if you hadn't read the book, you'd never know the difference."
    },
    {
      "text": "The ultimate example of a synergic multi-media construct: a familiarity with the source lends the film the depth, conflict, and resonance it fails to otherwise provide."
    },
    {
      "text": "It does the obvious well enough, but ironically--considering the subject--it lacks the touch of magic....a picture that, while well crafted, is ultimately uninspired."
    },
    {
      "text": "The powers that be, in their zeal to include as much from the book as is humanly possible, have overstuffed the film almost to the breaking point."
    },
    {
      "text": "Usually, films encumbered of this much hype can never live up to the lofty expectations of eager fans, but Harry Potter and the Sorcerer's Stone is, thankfully, a rare and welcome exception."
    },
    {
      "text": "A handsome, faithful, cautious film that delivers in most of the ways you'd hope it would."
    },
    {
      "text": "It's eye-filling, well-cast, often very funny and executed with great imagination and flair."
    },
    {
      "text": "At its best, the film's visual dazzle equals the tasty wordplay of the novel. But it is overlong, overscored, and curiously misshapen."
    },
    {
      "text": "Its success and its failure come in how literally it interprets the material -- Hogwarts and Quidditch and Hagrid and nearly Headless Nick look pretty much as you'd expect them to look, and the story goes as you'd expect it to go."
    },
    {
      "text": "The values and lessons from the novels have translated to the film, as well as the magic."
    },
    {
      "text": "This is the Harry Potter you imagined while reading."
    },
    {
      "text": "A nice film with some sparkling moments; however, I had expected an overall zappier stream of wand light and more heart."
    },
    {
      "text": "The movie has two serious flaws ... Daniel Radcliffe, as Harry, is almost devoid of personality ... [and] the film is a full hour too long."
    },
    {
      "text": "As George Lucas did with The Phantom Menace, Columbus understood that he didn't have to make a particularly good movie. He just had to avoid making a really lousy one. And that's exactly what he's done."
    },
    {
      "text": "Entertaining on almost every level."
    },
    {
      "text": "This film is capable of a certain brand of magic: it may turn the faithful into Muggles."
    },
    {
      "text": "An imaginative and remarkably faithful adaptation."
    },
    {
      "text": "No, I didn't think (Columbus) would be able to do it this well, either, but I stand corrected."
    },
    {
      "text": "Hiring nonhack screenwriter Steve Kloves (Wonder Boys) pays dividends."
    },
    {
      "text": "If you believe in magic, you'll love Harry Potter and the Sorcerer's Stone. And if you don't, you will, and you will."
    },
    {
      "text": "It's pleasant, and not nearly as hollow as, say, The Phantom Menace, but it's never truly captivating."
    },
    {
      "text": "The effects are special, but too often they're the only thing that is. They seem to drive the story, instead of the other way around."
    },
    {
      "text": "It's tremendous fun, not simply the hollow shell that most giant movies like this turn out to be."
    },
    {
      "text": "Many charms, but few surprises."
    },
    {
      "text": "A thumping good adaptation of the work of a creative genius."
    },
    {
      "text": "Even a Muggle director can't spoil the book's magic."
    },
    {
      "text": "I suspect that Harry Potter is appropriate for any child above the age of seven or eight... Anyone older than that will be charmed."
    },
    {
      "text": "At almost two-and-a-half hours, this movie's a little flabby around the middle, but so is my kitty cat and I love her."
    },
    {
      "text": "Two and a half hours of pure, uninterrupted enchantment."
    },
    {
      "text": "Columbus has done a fine job casting the major characters."
    },
    {
      "text": "I envy kids the discovery they're about to make, about the power of movies to dominate the imagination, to air our secret fears and desires, to become cornerstones of our psyches."
    },
    {
      "text": "Solid but uninspired, Harry lacks brio."
    },
    {
      "text": "I was a big fan of the original book, and I was incredibly impressed with the movie."
    },
    {
      "text": "It's way too long, there's no story, no logic, no villain, all the supporting characters are more interesting than Potter, and I learned nothing about being a wizard."
    },
    {
      "text": "Just as the Harry Potter books have reached a wide audience, so too does the movie appeal to audience members of all ages."
    },
    {
      "text": "Gets most of the book's events in, but loses much of the lightness and charm of Rowling's vision."
    },
    {
      "text": "A success by any standards."
    },
    {
      "text": "Brilliant, but scary."
    },
    {
      "text": "Fortunately, all hands involved in the production have faithfully observed the mantra, \"It's the book, stupid.\""
    },
    {
      "text": "Harry Potter makes a satisfactory, albeit unspectacular, celluloid debut."
    },
    {
      "text": "The wonderfully imaginative, fabulously eccentric world of Hogwart's School of Witchcraft and Wizardry has been brought to the screen with spectacular success."
    },
    {
      "text": "If the movie Harry Potter and the Sorcerer's Stone were released in a parallel universe in which J.K. Rowling's book didn't exist, its richly envisioned world and inventive, engaging story could be appreciated in their own rights."
    },
    {
      "text": "As far as stuffy Oxford dramas go, Harry Potter has them all beat."
    }
  ],
  "release_year": 2001,
  "duration": 152,
  "genres": [
    "Kids & Family",
    "Fantasy",
    "Adventure"
  ],
  "synopsis": "Adaptation of the first of J.K. Rowling's popular children's novels about Harry Potter, a boy who learns on his eleventh birthday that he is the orphaned son of two powerful wizards and possesses unique magical powers of his own. He is summoned from his life as an unwanted child to become a student at Hogwarts, an English boarding school for wizards. There, he meets several friends who become his closest allies and help him discover the truth about his parents' mysterious deaths.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/wuMc08IPKEatf9rnMNXvIDxqP4W.jpg"
}