{
  "movie_name": "Inception",
  "movie_id": "inception",
  "total_reviews": 365,
  "reviews": [
    {
      "text": "Overall, “Inception” is a triumph, a perfectly oiled dream machine that can blow minds on first viewing and satisfy cinephiles on repeat viewings."
    },
    {
      "text": "Nolan is exploring dreams and the possibilities are endless, which is why it’s a little disappointing that so much of the film feels like a generic CGI action movie, albeit a high-class one."
    },
    {
      "text": "It is, simply put, a cerebral masterpiece from Christopher Nolan. [Full review in Spanish]"
    },
    {
      "text": "As the corridor spins the characters as well as the audience have to grapple with the blurred boundaries between reality and the subconscious."
    },
    {
      "text": "There are thrillers, and then there are thrillers. Gripping every second and couching its pages of exposition in the smartest way possible, Inception is original filmmaking at its finest."
    },
    {
      "text": "\"Inception\" delivers twists that fit the evolving context of the story it's creating and commandingly wins your attention enough to not turn you off.  While it may not seem like it, there is a point and a light at the end of the tunnel to this maze."
    },
    {
      "text": "This film must be revisited, talked about, analyzed, and rewatched again and again. It will surely grow upon each viewing, but it proves instantly enthralling the first time."
    },
    {
      "text": "Still one of the best original films of the last 25 years, Inception is a groundbreaking action drama with some of the most intricate plot mapping this side of dreams and reality."
    },
    {
      "text": "Fresh, innovative stories told in non-traditional ways..."
    },
    {
      "text": "This is Christopher Nolan's insane, original concept..."
    },
    {
      "text": "[This] caper film that heists dreams instead of treasure is surely the most cerebral action thriller to become a blockbuster."
    },
    {
      "text": "Tech achievements duly noted (and their scale is certainly not nothing), I’m drawn back to Nolan’s 2001 fixation, unveiled to truly embarrassing effect in the dire, airless Inception..."
    },
    {
      "text": "Confusing nightmare.  [Full review in Spanish]"
    },
    {
      "text": "Inception’s inspiring imagination and ingenious innovation are still as staggering and stimulating today as they were ten years ago."
    },
    {
      "text": "...a modern cinematic masterpiece."
    },
    {
      "text": "Blows up completely the notion of reality based on an extraordinary overlay of Borgian levels... [Full review in Spanish]"
    },
    {
      "text": "Nolan's \"dream within a dream\" heist film, not only keeps you on the edge of your seat with incredible visual effects and memorable action set pieces, but also makes you a part of the puzzle-solving team from beginning to end. [Full review in Spanish]"
    },
    {
      "text": "It's not nearly as confusing as many make it out to be, but if you do find yourself losing the plot a bit, remember you're at the movies and just let it overwhelm you. That's part of the fun."
    },
    {
      "text": "Inception engaged on a mainly intellectually level, but that isn't to say that film didn't pack an emotional impact."
    },
    {
      "text": "\"They say we only use a fraction of our brain's potential\" we are told in Inception. The same will never be said of Nolan."
    },
    {
      "text": "Inception is an intriguing, frustrating film, but ultimately satisfying."
    },
    {
      "text": "Mind-blowing doesn't even begin to describe director Christopher Nolan's latest foray into the mystifying realm of the subconscious."
    },
    {
      "text": "Joseph Gordon Levitt gives the film's workhorse performance with tremendous heart and muscle."
    },
    {
      "text": "A multilayered, self-reflexive action film that fires on all cylinders, manipulating time through meticulous editing to deliver a hard-hitting cinematic experience."
    },
    {
      "text": "One of the best movies of 2010."
    },
    {
      "text": "Inception is a different kind of heist film but it is hard to imagine it coming from any filmmaker other than Christopher Nolan."
    },
    {
      "text": "Ten years later, Inception continues to function as a thrilling sci-fi heist film, but its deeper secrets are what has cemented it as Christopher Nolan's masterpiece."
    },
    {
      "text": "Overall, the film is one of a kind, a masterpiece and a work of art so to speak. The superior musical score that accompanies the film heightens the suspense and adds to the mystery sequences."
    },
    {
      "text": "Nolan masterfully weaves all these elements together, creating a second act that is breathtaking, suspenseful and thought-provoking...unfortunately, it takes us a good hour for us to get there."
    },
    {
      "text": "Lose yourself in Chris Nolan's dream-world. You may never want to wake up."
    },
    {
      "text": "A smart summer thriller filled with visionary set pieces, grand imagery and exciting twists, but its lack of an emotional center keeps it just short of greatness."
    },
    {
      "text": "A mind-bending thriller that is a complete original, cementing Nolan's status as one of this generation's brightest filmmakers."
    },
    {
      "text": "Imagine watching a bank heist in someone's brain, with layers upon layers upon layers (repeat) of deep meaning, suspense, action, mystery and ohmyf*ckinggod-what-the-HELL-is-happening moments, and you can imagine what it's like to watch Inception."
    },
    {
      "text": "...there are few directors operating on Nolan's level within modern-day Hollywood."
    },
    {
      "text": "It's the kind of conception that can only come from a mastermind such as Christopher Nolan."
    },
    {
      "text": "Inception is the apotheosis of Nolan's directorial signature whereby he seeks to merge ingenious narratives containing weighty psychological themes with genre-inflected cinema"
    },
    {
      "text": "Nolan's Inception triumphs in the manner of the best summer blockbusters: it's awesomely original, hugely intelligent and, above all, enormously enjoyable."
    },
    {
      "text": "While elaborate, it's never indulgent. While involved, it's never impenetrable. Inception is a feast for the mind and the senses -- the kind of movie experience we dream of."
    },
    {
      "text": "It is the subplot involving Dom's wife, Mal (Marion Cotillard), that does the intellectual heavy lifting."
    },
    {
      "text": "No matter how you look at it - as a new take on the heist film, as a narrative mind game, or as a metaphor for filmmaking itself - Inception will thrill you into thinking about weird new ideas."
    },
    {
      "text": "Inception succeeds in convincing us for two and a half hours that somehow our dreams and lives are exactly like all the bad action movies we have ever seen. The film has none of the vivid unpredictable banality of dreams or life."
    },
    {
      "text": "This endlessly fascinating swirl of a film could have come only from Nolan, who blends the cerebral twistiness of Memento (his thriller that moves backward in time) with the spectacular action of his Batman megahit, The Dark Knight."
    },
    {
      "text": "One of the best things about Nolan is that he writes his own material. He is in total control of the story. He isn't interpreting someone else's vision, he's translating his own thoughts to the screen."
    },
    {
      "text": "Awesome doesn't even begin to describe the sleek, clever, mind-blowing madness that is director Christopher Nolan's aptly titled psychological (read: trippy) thriller Inception."
    },
    {
      "text": "This is a brainy, brawny popcorn pleaser at its best. And one not easily forgotten."
    },
    {
      "text": "The main tension of the story is a constant vuvuzela-like interruption in the suspension of disbelief."
    },
    {
      "text": "If nothing else, this big brain-teaser of a movie is a great conversation piece."
    },
    {
      "text": "A spectacular fantasy thriller based on Nolan's own original screenplay, Inception is the smartest CGI head-trip since The Matrix."
    },
    {
      "text": "Invention runs lower once we're on those snowy slopes, and the hard narrative punch keeps disintegrating into a floating cloud of pixels. But what a display they make."
    },
    {
      "text": "The film's imaginative freefall is ruinously anchored to a bogus sense of deep feeling."
    },
    {
      "text": "Nolan is so eager to make the movie work as an action blockbuster that he sacrifices storytelling to set pieces. Still, what set pieces."
    },
    {
      "text": "Like Memento, the most intellectually demanding of Nolan's previous films, Inception demands and rewards our total attention as well as our emotional engagement."
    },
    {
      "text": "It's a brain-bender, all right. One of the more audacious narrative experiments since his own Memento, writer-director Nolan's seventh feature is every bit as intelligent as it is gripping."
    },
    {
      "text": "Christopher Nolan might just end up as the most alluring and enigmatic film maker of contemporary cinema."
    },
    {
      "text": "Inception is as lucid and heartfelt as summer blockbusters get these days."
    },
    {
      "text": "Nolan does here for the heist film what he did for the comic book movie in his 2008 hit The Dark Knight. He layers a fantasy premise with provocative ideas and serious intent."
    },
    {
      "text": "What's exciting about the movie has nothing to do with content, or a coherent style; it has to do with watching a master crafts person conjure tricks with the best the modern movie tool box has to offer."
    },
    {
      "text": "We can only marvel at what writer-director Nolan has thought up and executed so well. But he doesn't know when to stop. Every level leads to another level."
    },
    {
      "text": "This is finally a big-budget film where the money feels well spent."
    },
    {
      "text": "Nolan makes his far-fetched (and even occasionally ridiculous) dialogue and plotting utterly, absolutely believable within the film's finely structured framework, while never losing his grip on the dense, multi-layered narrative."
    },
    {
      "text": "Inception is dark, thrilling and bold, and most importantly, it will reach well beyond your highest expectations and wildest dreams."
    },
    {
      "text": "The central concept affords the director some splendid opportunities for visual chutzpah."
    },
    {
      "text": "Inception is the kind of information-packed movie that creates the painful/pleasurable sensation that there's no time to think."
    },
    {
      "text": "Inception nails you to your seat for two of the best hours of cinema you'll see this, or any, year and there's never a dull moment."
    },
    {
      "text": "Inception isn't a dud but nor is it a masterpiece. It's like a very ambitious, overlong potboiler: visually beautiful, ingenious in parts and dragging in others."
    },
    {
      "text": "It's an exceptional effort, so dense, it practically demands a second viewing to suss out whether the film is just a bunch of high-concept psychobabbled hooey or a profound sci-fi excursion into the human psyche. I'm banking on the latter."
    },
    {
      "text": "The only thing for sure is that this Inception was nothing but a stratagem, a cheap trick, if you will. Leading me to wonder: Where are the Dream Police when you need 'em?"
    },
    {
      "text": "Inception is a grown-up thriller ride through the dreamscapes of the mind, with Leonardo DiCaprio in the lead. The movie is a sign that Hollywood retains some intellectual oomph."
    },
    {
      "text": "DiCaprio manages to put that fever(ed) dream behind him to tap a well of melancholy yearning that keeps Inception anchored."
    },
    {
      "text": "The real cause of wonder, though, is why Nolan should have embraced technocratic complexity in the service of such a puny story."
    },
    {
      "text": "It's one of the most beautiful, well written, and fully realized high dollar films of the last five years. Inception, is close to perfection."
    },
    {
      "text": "Inception is as wildly visionary as it is smart. If only all \"big\" movies could be this haunting. We can dream, can't we?"
    },
    {
      "text": "If it's the dreamer whose subconscious fills in the details, as the film claims, why the absence of silliness, sex, horror and general abandon?"
    },
    {
      "text": "This is tremendous, full-throttle filmmaking."
    },
    {
      "text": "Directors have been trying to replicate the world of dreams since the beginning of cinema... With his ingeniously inventive psychological thriller Inception, Christopher Nolan stakes his claim on this ambitious cinematic territory."
    },
    {
      "text": "The result is something almost as thrilling to contemplate as it is to watch."
    },
    {
      "text": "Inception is as exhilarating as any movie we'll see this summer -- and twice as exhausting."
    },
    {
      "text": "I'm looking forward to seeing Inception again."
    },
    {
      "text": "Don't be surprised if your brain hurts. In a good kind of way."
    },
    {
      "text": "A heist film of thrilling, almost delirious complexity."
    },
    {
      "text": "Inception is a complicated film, but it follows its own logic so seriously and insidiously that we are completely drawn into its point of view."
    },
    {
      "text": "Mercifully, Inception is short on \"is-this-a-dream-or-is-this-reality\" pseudo-philosophizing, allowing the near-Kubrickian visual stimuli to drive the exposition and action. And it works."
    },
    {
      "text": "In its final hour, Inception becomes more conventional and less imaginative. The rules of the dreamworld still frame the action, but they provide fewer surprises, for the team or the audience."
    },
    {
      "text": "Inception is the best film of the year and one of the best films of the decade, this is Nolan's masterpiece and it is perfect in every regard."
    },
    {
      "text": "Nolan's eyes here were a little too big for his stomach."
    },
    {
      "text": "A smart and inventive thriller, this drama is one of the year's best movies."
    },
    {
      "text": "Nolan has cemented himself among the great filmmakers of our time, not only with this film, but with most of his other works as well."
    },
    {
      "text": "Just like a great dream you don't want to wake up from, even after the end credits start, you'll desperately crave five more minutes."
    },
    {
      "text": "Ambitious, sure, but ultimately too far-fetched for its own good."
    },
    {
      "text": "Rangy and intellectually muscular, Inception is flawed in the ways that only a brilliant, overreaching work can be."
    },
    {
      "text": "A prediction: The market demand for mind-altering substances is about to take a dive. For, once Inception takes hold at the cinema -- and it surely will -- this movie will have its attendees happily dazed for days, possibly weeks, afterwards."
    },
    {
      "text": "The technical virtuosity pouring from every frame is astounding."
    },
    {
      "text": "It's intentionally, thrillingly, disorienting."
    },
    {
      "text": "Flaws aside, there's a lot to like about Inception and Nolan keeps his eye on the ball throughout, offering up a lush treat of a thriller with nerve and wit"
    },
    {
      "text": "An excellent example of a great Summer Blockbuster."
    },
    {
      "text": "It is the film by which to measure the density of all others."
    },
    {
      "text": "What is the point of having an imagination, I ask you, if the only thing that can be imagined is mayhem, perpetrated without regard for even the appearance of human life?"
    },
    {
      "text": "The problem with Inception -- and it's a biggie -- is that despite all the clever concepts, the dream worlds just don't ever feel like dreams; they feel like, well, a slightly trippy Roland Emmerich movie."
    },
    {
      "text": "A brain-twister to be sure. But the fact that the plot demands attention only adds to the exhilaration. This is a story about dreams that requires the audience to stay awake."
    },
    {
      "text": "It's a bold, stunning feature of impossible technical virtuosity. It also has the tendency to be about as emotionally stimulating as a college lecture."
    },
    {
      "text": "Christopher Nolan has created a Lynchian fantasy set in the mind that is devastating in its originality and innovation..."
    },
    {
      "text": "...there's no denying those special effects. They are spectacular and creative in the extreme."
    },
    {
      "text": "The reality isn't quite as enthralling as one would hope."
    },
    {
      "text": "The action set pieces are deliriously spectacular; one involving a gravity-impaired Gordon-Levitt in an ever-rotating hallway is wondrous to behold."
    },
    {
      "text": "A trippy, complex, thrill-driven action-adventure that demands (and rewards) repeat viewings."
    },
    {
      "text": "Un thriller inteligente aunque algo menos complejo de lo que aparenta, que cae en varios excesos narrativos y visuales. Probablemente la película más ambiciosa de Nolan hasta la fecha."
    },
    {
      "text": "See it more than once, you'll see something different every time."
    },
    {
      "text": "I'm somewhat disappointed that Nolan didn't make a different movie, I heartily enjoyed the one he did make."
    },
    {
      "text": "Nuevamente Nolan nos sorprende con un ejercicio inteligente y vibrante, con un DiCaprio maduro y un cast perfecto. La cinta del año para Hollywood."
    },
    {
      "text": "Nolan gledateljima prua zabavu za osjetila i intelekt na način koji se čini iznad mogućnosti najvećeg broja njegovih kolega"
    },
    {
      "text": "full review at Movies for the Masses"
    },
    {
      "text": "Conceptually alluring but laborious and visionless"
    },
    {
      "text": "A classic-in-waiting that will keep you guessing and thinking while you pick your jaw up off the floor."
    },
    {
      "text": "Nolan's script keeps the parallel narrative threads concise, and through gorgeous cinematography by Wally Pfister and sharp editing by Lee Smith."
    },
    {
      "text": "Is the movie over-thought? Sometimes, yes. But challenging material is rarely as satisfying as in this blockbuster from one of the dream factory's most gifted artisans."
    },
    {
      "text": "It's one thing to simply make up a story, but it's another to come up with a scenario and actually make it feel real and that's exactly what Nolan achieves here."
    },
    {
      "text": "A marvelous, highly enjoyable film that continues Nolan's climb toward the very top of the list of the best filmmakers working today."
    },
    {
      "text": "An always-tense, extremely suspenseful sci-fi action film that respects a viewer's intelligence."
    },
    {
      "text": "Intelligent and imaginative Inception is eye bending and mind bending in equal measures."
    },
    {
      "text": "It's too easy to see not only that Mal is trouble, but also that Dom will walk right into that trouble she is."
    },
    {
      "text": "Uma ficção científica que faz jus aos melhores do gênero, apresentando-nos a conceitos intrigantes e dedicando-se, então, a explorá-los até suas conseqüências mais extremas."
    },
    {
      "text": "Inception, which has been talked up to crazy heights and showcases the best, as well as the most problematic, aspects of Nolan's directorial chops."
    },
    {
      "text": "If you think \"Lost\" was complicated, let's just say it's kitten chow when compared to this."
    },
    {
      "text": "Inception made my brain hurt. And it hurt in the most wonderful way."
    },
    {
      "text": "Must-see? Absolutely. But let's not get carried away. Primer was every bit as challenging but populated with characters who seemed real and spoke like human beings."
    },
    {
      "text": "Especially recommended for diehard film lovers, this cinematic archaeological dig will interest anyone fascinated by one of filmdom's great might-have-beens."
    },
    {
      "text": "Brain, meet spasm. Inception is the cleverest, most original use of a Blockbuster budget we've seen in years. Shame some of the characters are a bit underdeveloped."
    },
    {
      "text": "Visually stunning Inception trips on its own cleverness, sacrificing character development in the pursuit of ingenuity. One can forgive its hubris and give it credit for being a thinking man's action movie."
    },
    {
      "text": "Nolan has spun an elegantly cerebral story that is primal, compelling, and as visually disconcerting as it is completely captivating"
    },
    {
      "text": "This is a long film with a lot of fiery explosions, intelligent ideas, sputtering machine guns, and violent car crashes."
    },
    {
      "text": "The best, most believable entry to date in an inherently imaginative genre. Excellent cast."
    },
    {
      "text": "An at-times dizzying Mobius strip of a sci-fi thriller, it's both a tremendously challenging and tremendously rewarding movie, the type that will have audiences talking -- and debating -- long after the credits roll."
    },
    {
      "text": "A giant win for audiences and the degree to which filmmakers can respect their intelligence."
    },
    {
      "text": "Inception may be the most intelligent action film you will ever see."
    },
    {
      "text": "The film has a dark, sad emotional puzzle at its core, and the suspense of this held me as much as the planning of the ultimate caper. DiCaprio and Cotillard between them resonate grief."
    },
    {
      "text": "Nolan repousse les limites de son cinéma pour nous offrir - une fois de plus - son oeuvre la plus dense et stimulante à ce jour."
    },
    {
      "text": "This metaphysical 'Mission: Imposible' is motivated by a challenge as great as that facing its heroes: It's Nolan's attempt to crack the Great Film vault. Mission accomplished? Yes -- and more crucially -- no."
    },
    {
      "text": "Inception a dynamic, moving mind-bender."
    },
    {
      "text": "A heist movie about manipulating dreams, Inception could well be the summer's smartest film -- and surely is the one you'll fight about most."
    },
    {
      "text": "For all of its capacity to bewilder and befuddle, Inception still must be endorsed purely on the strength of its ambition, and the awesome heights to which it sometimes soars."
    },
    {
      "text": "Nolan is having the time of his life in his own personal playground and, for all its heavy technical and narrative machinery, Inception remains one of his lightest films."
    },
    {
      "text": "It is irritating for an hour, being so gloomily lit that you need fog lights, then it opens up into a marvellously inventive, somewhat silly but enjoyable heist movie, with a good cast doing things I doubt even they could explain."
    },
    {
      "text": "It's just streets ahead of anything I've seen in a long time."
    },
    {
      "text": "One of those films, like Blade Runner or 2001 A Space Odyssey, that will repay many viewings in order to grasp all the intricate details of these multi-layered trips into the dreams and nightmares of the central characters."
    },
    {
      "text": "[Nolan] has planted the idea that his film is the most brilliant, original and smart film in years. And everyone thinks they realized this on their own."
    },
    {
      "text": "And [Nolan] said, \"let there be originality\", and there was originality. He called it Inception and audiences and critics alike saw that it was good."
    },
    {
      "text": "Even its flaws are brilliant -- and without its flaws and a few evidences of self-mocking humor, I'm not sure I'd like it nearly as well as I do."
    },
    {
      "text": "Nolan clearly has great fun with the action stuff - zero gravity fights in a hotel corridor, an assault on an artic fortress and a car chase through a dreamed city are all cracking - and it all looks as spectacular as you'd hope."
    },
    {
      "text": "I thought this film was going to be a real brain-twister like \"Memento\" or \"The Prestige,\" but \"Inception\" is not all that complicated, which is helpful, given all those special game-type rules you have to keep track of."
    },
    {
      "text": "The film's promise is watered down in the execution by a sense of it being a novelty, a plaything for Nolan to bamboozle his audience with his clever mind trick"
    },
    {
      "text": "A scintillating exploration of dreams, reality and the fine line that divides them, Inception toys with our minds on a massive scale, sending us on a dizzying trip which makes all our preconceptions spin relentlessly"
    },
    {
      "text": "Indeed, Hollywood's obsession with 3D has extended to the storytelling process, and with Inception, it also reminds us that story and characterization still rule in the land of a thousand digital vistas."
    },
    {
      "text": "Nolan borrows from classic heist and caper movies to design the clockwork tension but this particular clock is more like Dali's dripping watch."
    },
    {
      "text": "Cinematically, this is a keeper, a fireworks grand finale that goes on flashing and booming for two hours and twenty-eight minutes. But, oh, for some genuine heart."
    },
    {
      "text": "Once in the dreamspace, Nolan's command of multi-layered storytelling is nothing short of astounding."
    },
    {
      "text": "the balance of philosophical ideas and narrative tension are more than enough to keep the film not just engaging, but utterly riveting for its entire duration"
    },
    {
      "text": "Inception is the exception to a boring summer!"
    },
    {
      "text": "A well-constructed, narratively audacious blockbuster released at a time when such things are in depressingly short supply."
    },
    {
      "text": "An astonishment, an engineering feat, and, finally, a folly."
    },
    {
      "text": "A patently-preposterous, endlessly-elliptical mindbender that's worth the investment just to be able to say you sat through it, even if you can't follow all of its meandering machinations. It's that hip!"
    },
    {
      "text": "Despite the fact that some details of the labyrinthine plot are simply too obscure to comprehend on a first viewing, Nolan sells the emotion -- and the consequences -- visually."
    },
    {
      "text": "Cinema is rarely this engaging on so many levels."
    },
    {
      "text": "This is the kind of film studios need to green light more often... all orchestrated by the crafting hand of a director who knows what he wants and makes it happen."
    },
    {
      "text": "Preposterous, but so ingeniously done that it's an entertaining ride."
    },
    {
      "text": "Just like a spinning top, you keep hoping Christopher Nolan's movie will last a little bit longer."
    },
    {
      "text": "It's heartening to see that the quirky sensibility Nolan brought to 'Memento' has never left him."
    },
    {
      "text": "It's bold. It's exciting. It makes you think. It engages. It impresses. It frustrates. And it does it all a helluva lot better than Shutter Island."
    },
    {
      "text": "The first masterpiece of 2010. A perfect blend of performance, story, music and effects."
    },
    {
      "text": "A dream within a dream."
    },
    {
      "text": "The complexity of the plot works to make the film a must see, but it also ends up frustrating the audience because it all can't be figured out on the first viewing"
    },
    {
      "text": "...one of the strongest science-fiction concepts to come along in some time..."
    },
    {
      "text": "I suspect even repeat viewings won't be enough to nail this one down: Like 2001, it's both knotty enough and ambiguous enough to lead to conflicting opinions. Besides, our dreams are open to different interpretations, so why not some of our films as well?"
    },
    {
      "text": "The ending will leave you debating in that glass half-full, half-empty kind of way. Let's just say, it's a movie that needs to be seen more than once."
    },
    {
      "text": "Only someone who never saw (or appreciated) Dark City would be able to call it visionary."
    },
    {
      "text": "This is not only the best movie ever made about dreams, it is also one of the best films of 2010, and certainly one of the most entertaining pictures I've seen in a decade."
    },
    {
      "text": "It is a fascinating visual feast, The Matrix with heart and soul, a rollercoaster ride into layers of the subconscious mind that challenges our ability to keep up."
    },
    {
      "text": "What it is (an action-heavy heist movie with several mind-blowing setpieces) is an entirely pleasant substitute for what it isn't (a psychologically complex investigation into dream logic)."
    },
    {
      "text": "Nolan has basically done the impossible. He's taken $200 million and, instead of coming up with a highly generic product, he's made a real movie."
    },
    {
      "text": "There are plenty of reasons to like Inception, whether you found it obvious or impenetrable. You'll wish you could dream as lucidly as this, but be grateful here you have Nolan as your tour guide."
    },
    {
      "text": "If you recall the scene in Dahmer (2002) where Jeremy Renner as the deranged killer drills holes into his victims' heads, you'll know what watching this Freudian claptrap of a thriller is like."
    },
    {
      "text": "It makes 'The Matrix' look like a Dick & Jane book."
    },
    {
      "text": "It requires more concentration to just figure out what's going on than most summer blockbusters do."
    },
    {
      "text": "This is a drama built around ideas and images; it is a cinematic maze that Nolan makes his audience traverse in order to follow, understand and appreciate his world."
    },
    {
      "text": "It's hard to connect with a movie when it tries so hard to fool you; is this a dream, is it not, is it a dream within a dream? Who cares? Just commit to something and get on with it. A crushing bore."
    },
    {
      "text": "The film is a thing of cold and sweeping beauty, wonderfully rendered and constantly engaging. Like all good dreams, it's over too quickly."
    },
    {
      "text": "Inception is a nightmare for audiences looking for coherent fiction."
    },
    {
      "text": "A groundbreaking, intriguing, exhilarating and brilliant sci-fi thriller that's destined to become a timeless classic. Mark my words: It will be remembered for years to come."
    },
    {
      "text": "Who are we to complain when a filmmaker lets his thoughts get the better of him, especially when most summer blockbusters aren't thinking at all."
    },
    {
      "text": "The movie is almost hypnotic -- a mind-bending experience laced with palpable tension and fueled with drama. Sweet dreams."
    },
    {
      "text": "Inception is elegantly realised. DiCaprio powerfully embodies a tortured soul while Gordon-Levitt has all the fun in the best action sequence."
    },
    {
      "text": "After a couple of days' reflection, while I still would happily recommend the film as one of the best blockbusters I've seen this year, the flaws of the movie became increasingly apparent."
    },
    {
      "text": "Inception is an intense, complex story, but it's always coherent, imaginative, and entertaining."
    },
    {
      "text": "More time wasting than time bending, Inception is a shoot 'em up masquerading as a thinking person's sci-fi film."
    },
    {
      "text": "This sophisticated and uniquely clever cinematic concoction is a refreshing change from the usual lineup of mindless summer fare. The acting and dialogue take a back seat to the mind-blowing action that is..."
    },
    {
      "text": "DiCaprio and co. manipulate thematic fetishes like a dream of Mission Impossible envisioned by Phillip K. Dick"
    },
    {
      "text": "\"Inception\" is a sci-fi psychological thriller that doesn't always know when to coast or how to take emotional advantage of its over-the-top visual effects."
    },
    {
      "text": "Nolan is a very clever fellow, no argument there. He's skilled at juggling big ideas and making us think. Now if he can just make us feel."
    },
    {
      "text": "The final half-hour alone is a miracle of clockwork-precise showmanship."
    },
    {
      "text": "It's only the latest indication that Christopher Nolan might be the slyest narrative tactician making movies today."
    },
    {
      "text": "This seems to be the year of taking visuals in movies up a notch. Cameron did it with 'Avatar,' Nolan does it with 'Inception.'"
    },
    {
      "text": "Pretty good, not bad, but brilliant it surely ain't."
    },
    {
      "text": "Inception is a boldly constructed wonder with plenty of -- as one character describes it -- \"paradoxical architecture.\""
    },
    {
      "text": "I found myself admiring the movie's stubborn adherence to its own universe and logic."
    },
    {
      "text": "Nolan, like Cobb, is an assiduous extractor, and he knows how to wow audiences. But scaling big and thinking big are not the same thing. And dark, just because it's dark, isn't more artistic than light."
    },
    {
      "text": "Nolan's tale is not only a trip through mental labyrinths but a reminder that memories may cripple us, unless we learn to let them go."
    },
    {
      "text": "Nolan hypnotizes us with his elegant dreamscapes, but uses them to draw attention back to the figures at the heart of it all."
    },
    {
      "text": "Inception, the latest in Nolan's long list of awe-inspiring films, proves to be his most ambitious and satisfying project to date."
    },
    {
      "text": "The good news is, I'm not going to give away any of the mind-bending twists at the center of Inception. The bad news is, that's because there aren't any."
    },
    {
      "text": "Like his protagonist, Nolan excels as an implanter of subversive ideas. This time, alas, he didn't dig quite deep enough for them to take root."
    },
    {
      "text": "Inception is so slow and so confusing that you may actually fall asleep. Or wish you were really dreaming and could wake up and dream another movie."
    },
    {
      "text": "Mixes arcane talk about dreams with traditional action sequences resulting in strange and ineffective hybrid."
    },
    {
      "text": "DiCaprio is his usual terrific self. He is the Paul Newman of this generation."
    },
    {
      "text": "Visually spectacular, without resorting to 3-D."
    },
    {
      "text": "Are they handing out joints at the box office for this?"
    },
    {
      "text": "There are so many dreams within dreams, I thought I might've been dreaming. 'Inception' isn't a bad movie, but I could never sit through it again. It's up to the viewer to decide whether or not they will ride it out with Prince Valium."
    },
    {
      "text": "A what's on your mind invasive sci-fi noir specializing in homo sapien interior decorating, that operates at a level way beyond viewer comprehension. Though this messing with your head nap time thriller boasts intermittent mind bending imagery."
    },
    {
      "text": "This is a movie people will go see and then argue about and then, very likely, go see again. It is instantly the must-see film of the summer."
    },
    {
      "text": "By turns overpowering, spectacular and truly awe-inspiring. Nolan has just taken it to the next level."
    },
    {
      "text": "Inception is that rare film that can be enjoyed on superficial and progressively deeper levels, a feat that uncannily mimics the mind-bending journey its protagonist takes."
    },
    {
      "text": "By convoluting the various planes of experience, by overlapping and obscuring ostensible realities and ostensible dreams, Mr. Nolan deprives us the opportunity of investing emotionally in any of it."
    },
    {
      "text": "You know how much of a cheat it is when a movie concludes with a character waking up and realizing it was all a dream? Inception goes another way: Its characters wake up from their dreams to figure out what's real."
    },
    {
      "text": "The most audacious and multifaceted Hollywood entertainment for grown-ups I've seen in years."
    },
    {
      "text": "It wins points for trying to convey difficult, ambitious themes, and even more points for actually succeeding."
    },
    {
      "text": "Wrapped up in the logistics of various dreamscapes and the technical details of dream sharing and inception, the picture all but abandons its most essential thread."
    },
    {
      "text": "Inception becomes its own nightmare by trying to be \"too\" smart."
    },
    {
      "text": "The visual effects are outstanding, including a fight scene that rivals any ever put on film."
    },
    {
      "text": "Christopher Nolan's films are things of beauty, precisely constructed and expertly executed. But you wouldn't want to live there."
    },
    {
      "text": "Inception is the most astonishing thing you will see all year. It may be one of the most astonishing things you will ever see."
    },
    {
      "text": "The first of [Nolan's] films that I would call flat-out fun."
    },
    {
      "text": "Does the long-anticipated Christopher Nolan film Inception deliver what we've been hoping for? In a word: Yes."
    },
    {
      "text": "t has all of Nolan's strengths, and some of his weaknesses, and it is undeniably his. It is a $160 million action film about loss and regret, and it is exciting in part because of its flaws."
    },
    {
      "text": "Inception is often thrilling to watch, but there's something hollow at its center."
    },
    {
      "text": "(S)tories should show, not tell, and Nolan keeps telling us that he can't tell this story."
    },
    {
      "text": "The first of many major achievements in this memorable and haunting film is to render other people's dreams - not the most interesting of topics normally - absolutely riveting."
    },
    {
      "text": "In a decade dominated by the three dreaded Rs of remakes, reimaginings and reboots comes a truly original blockbuster."
    },
    {
      "text": "The most intelligent and visually stunning film of the year. Literally mind-bending."
    },
    {
      "text": "All it asks of viewers is that they do something rare: engage the intellect."
    },
    {
      "text": "In it we see the promise of a brilliant career realized undeniably. It's a great achievement, and, yes, a great film."
    },
    {
      "text": "A grandiose exploration of the subconscious and a blazing piece of puzzlemaking."
    },
    {
      "text": "Nolan's greatest aspect might be his own ability to show restraint when he could easily over blow everything. It worked miracles in Dark Knight and it has crafted a masterpiece in the form of Inception."
    },
    {
      "text": "It's the kind of thing that only comes along once every few decades."
    },
    {
      "text": "Like any traditional narrative, it starts at point A and ends at point B. It just goes backward through the alphabet to get there."
    },
    {
      "text": "A rather juvenile brain-teaser lacking an effective emotional core but bursting with cool visuals. Unlike the most powerful dreams it doesn't stick with you."
    },
    {
      "text": "Nolan dares the viewer to jump into his multi-layered world, his own maze, and dedicated moviegoers will not be able to resist - even for a second, third, or fourth time."
    },
    {
      "text": "Worth every penny spent in the making, and worth every dollar forked over for a ticket, Inception may just be the best movie of 2010."
    },
    {
      "text": "A smartly scripted, big-budget action/heist movie of the sort you'd expect from the director of The Dark Knight."
    },
    {
      "text": "A heist picture at heart, the dream-world-set thriller harkens back to the reality-shifting days of \"The Matrix,\" but edges toward intelligence in all of the places the Wachowski brothers opted for visceral popcorn thrills."
    },
    {
      "text": "Rule of thumb: if a movie uses the word \"deep\" as much as this one does, it probably isn't."
    },
    {
      "text": "I absolutely loved every minute of it."
    },
    {
      "text": "The ambition on display is so huge, and the filmmaking so intelligent, you'll emerge feeling as if you've just watched an entire season of the greatest sci-fi series never made."
    },
    {
      "text": "You have to love a movie that dares people to think big."
    },
    {
      "text": "This is a popular entertainment with a knockout punch so intense and unnerving it'll have you worrying if it's safe to close your eyes at night."
    },
    {
      "text": "A superior summer movie, one with heart and brains and loads of razzle-dazzle."
    },
    {
      "text": "Meanwhile, explanations are offered, buildings collapse on themselves, DiCaprio frets moodily, henchmen fall over and that white van keeps falling off that bridge ... It's all very beautiful, and mostly very empty."
    },
    {
      "text": "With its James Bond-on-acid action scenes and puzzle-within-a-maze-within-a-puzzle mind games, Inception is certainly the most daring and original blockbuster of the year, as well as a visual tour de force. If it only had a heart."
    },
    {
      "text": "unlike anything you've seen"
    },
    {
      "text": "As the dreams build upon each other and Cobb's past creeps through, Nolan has us just where he wants us -- deliriously lost in a world where dreams and reality are indecipherable, and curious enough to stand in line for another showing."
    },
    {
      "text": "This is what movies can be like if you try."
    },
    {
      "text": "Inception is the blockbuster we've all been thirsting for, a sleek brain-twister that makes the other 2010 mainstream releases look puny, drab and empty-headed in comparison."
    },
    {
      "text": "Inception delivers dazzling special effects and a boatload of stars, but it sags and eventually buckles under the weight of its complicated premise."
    },
    {
      "text": "Nolan is a thinker, all right, a very busy explorer of mind functions, but capable merely of diagrams when it comes to the heart and soul."
    },
    {
      "text": "Inception is an extraordinarily ambitious work. It's a bit overlong at 148 minutes, but I couldn't tell you what I would have cut out of it."
    },
    {
      "text": "Arguably the best film of the summer and most likely all year, the latest film from writer/director Christopher Nolan is a heady trip that comes off as a thinking person's action flick. (Parental Review also Available)"
    },
    {
      "text": "Beautiful and bloodless. Like a dream, it doesn't implant ideas you'll carry with you outside of the multiplex"
    },
    {
      "text": "With its cityscapes hinged like drawbridges, \"Inception\" resembles something Dutch illusionist M.C. Escher might have conceived. At other moments, the film invokes the great Stanley Kubrick, another artist specializing in chilly mind-mazes."
    },
    {
      "text": "Mr. DiCaprio exercises impressive control in portraying a man on the verge of losing his grip, but Mr. Nolan has not, in the end, given Cobb a rich enough inner life to sustain the performance."
    },
    {
      "text": "Inception is the rare blockbuster entry as sophisticated and intelligent as it is exciting and spectacular."
    },
    {
      "text": "If the career of Christopher Nolan is any indication, we've entered an era in which movies can no longer be great. They can only be awesome, which isn't nearly the same thing."
    },
    {
      "text": "..it all becomes a bit too much, a little exhausting, even a little boring...gets by on its Escher-esque visuals which Nolan tries to give more import to by cranking Hans Zimmer's doom laden, fog horn score."
    },
    {
      "text": "One way to salvage some fun with this blunderbuss would be to fall asleep while watching and dream up a better movie yourself. Try it. You'll avoid a headache."
    },
    {
      "text": "The fact that it manages to be both unmissable and maddening doesn't kill the immediate buzz, since half the film's thrills consist of simply keeping up with it."
    },
    {
      "text": "In this smart sci-fi puzzle box, director Christopher Nolan transports the audience to a dreamscape that begins with the familiar and then takes a radical, imaginative leap."
    },
    {
      "text": "Like a dream, Nolan's film fades swiftly in the light -- but while it lasts, it feels like there's nothing more important to decipher."
    },
    {
      "text": "Leonardo DiCaprio's new thriller is as good as live action cinema gets...and you're about to have some very deep dreams to prove it."
    },
    {
      "text": "This truly remarkable movie represents imagination of the highest order conducted by a true master of the art of motion pictures."
    },
    {
      "text": "Without a substantial story to support the whole, the piece is as weightless as the 'Zzzzzz team' itself, floating through the multiple levels of dreams within dreams."
    },
    {
      "text": "Even minor roles are filled by sterling talent (including Michael Caine as Cobb's mentor), which is testament to the originality and precision of Christopher Nolan. His is a mind that's definitely worth getting lost in."
    },
    {
      "text": "Inception may be the brainiest hokum ever released in a cinematic summer. Imagine Last Year in Marienbad wandering into the orbit of producer Jerry Bruckheimer."
    },
    {
      "text": "Inception is one of the most original, thought-provoking, intense, mind-blowing pieces of entertainment I have ever seen. I would pay money to watch people's reactions."
    },
    {
      "text": "After thinking it'd take \"a couple months\" to ink, director Christopher Nolan took eight years to painstakingly write the \"Inception\" script. And you can tell. It's his first pure masterpiece."
    },
    {
      "text": "Nolan's concept is as irresistible as its execution."
    },
    {
      "text": "It was a brave move to follow The Dark Knight, one of the biggest hits of all time, with something so incredibly complex, but Nolan can relax -- it's worked like a dream."
    },
    {
      "text": "Writer-director Christopher Nolan swims into the swirly sea of the subconscious in this beautiful, blindingly clever film."
    },
    {
      "text": "A conceptual coup that, in dealing with the shifting logic and fractured reality of dreams, frees itself from the need to satisfy any conventions, formulae or expectations."
    },
    {
      "text": "The idea of moviegoing as communal dreaming is a century old. With Inception, viewers have a chance to see that notion get a state-of-the-art update. Take that chance: dream along with Christopher Nolan."
    },
    {
      "text": "Inception may have been directed by Christopher Nolan, but Nolan's dreams are apparently directed by Michael Bay."
    },
    {
      "text": "It's a long movie (2.5 hours) but doesn't feel so, and is the rare would-be blockbuster that demands close attention and would surely reward rewatching."
    },
    {
      "text": "With Inception, writer/director Christopher Nolan not only cements his status as Hollywood's most innovative filmmaker, he has created a daring genre: the surrealist heist thriller. Or, maybe he has developed the dream invasion action epic."
    },
    {
      "text": "At the end of Inception, I hadn't lived through the grueling emotional journey Nolan seemed to think I had, but I'd seen a bunch of cool images and admired some technically ambitious feats of filmmaking."
    },
    {
      "text": "Plays like Ocean's 11 on Elm Street as written by Philip K. Dick, and that's mostly a good thing."
    },
    {
      "text": "...part heist caper, part Jungian fugue-state where dreams stack up inside each other like Russian nesting dolls."
    },
    {
      "text": "Personally, I got more thrills out of the simple animation of Richard Linklater's Waking Life."
    },
    {
      "text": "Whether [DiCaprio] confronts lost love or the dream world crumbles in a glorious symphony of exploding fruit and buildings, Inception is beautiful, high-class chaos."
    },
    {
      "text": "The less you know going in, the better you will appreciate the unfolding, doubling-back, and overall mind-bending stories within stories in one of the year's best films."
    },
    {
      "text": "It is that rarest of beasts: a slippery, cerebral summer blockbuster that slaloms from illusion to reality and back again and leaves its viewer bewitched, bothered and bewildered."
    },
    {
      "text": "One of the best things about Nolan as a director is that he's not self-conscious. His movies unfold and fold in on themselves without the strain of labor or flash. But that lack of self-consciousness is also Nolan's downside."
    },
    {
      "text": "The movies have produced one of their rare works of great art, disguised as an action thriller -- a thoughtful and thought-provoking meditation disguised as a con game carried out in a dream ... within a dream ... within a dream."
    },
    {
      "text": "An imposing, prismatic achievement, and strongly resistant to an insta-reaction; when it's over, Nolan still seems a few steps ahead of us."
    },
    {
      "text": "The dream logic of Inception -- which deals, like Nolan's far more intriguing Memento, with the architecture of memory and the nature of reality -- is stymied by a clunking script, crammed with expository exchanges and urgent blather."
    },
    {
      "text": "It's gratifying to experience a summer movie with large visual ambitions and with nothing more or less on its mind than (as Shakespeare said) a dream that hath no bottom."
    },
    {
      "text": "It's said that Christopher Nolan spent ten years writing his screenplay for Inception. That must have involved prodigious concentration, like playing blindfold chess while walking a tight-wire."
    },
    {
      "text": "Surely the most intellectually and viscerally engaging action film in years."
    },
    {
      "text": "Inspired at times by movie classics, modern and otherwise - 'Dark City' and 'Minority Report,' but also 'Metropolis,' 'Citizen Kane' and the best 007 adventures - it earns its place in the same conversation, a tribute to Nolan's ingenuity."
    },
    {
      "text": "A singular film that seeps into your brain so much so that you might leave the theater looking at the world differently."
    },
    {
      "text": "This movie isn't about dreaming, it's about the dreams inside of the dreams inside of the dreams. It's about how many layers there are to the human psyche, how the demons which haunt our subconscious can inflict a very conscious harm."
    },
    {
      "text": "Writer/director Christopher Nolan is too obsessed with the mechanics of the gimmick and plot of Inception to make any intellectual leaps off the screen."
    },
    {
      "text": "A remarkable achievement in ingenuity and storytelling."
    },
    {
      "text": "For a motion picture set within the boundless reaches of the subconscious, Inception is depressingly lacking in imagination."
    },
    {
      "text": "Nolan's film delivers on all scores. The writer/director of Memento continues to show that action blockbusters don't have to check their brains at the door. ... Lots of directors blow stuff up real good; but Nolan blows stuff up real interesting."
    },
    {
      "text": "Nolan handles the mechanics of his Russian-doll worlds expertly, but it's not clear whether he's taken his own advice and put a single, simple idea at the center of his elaborate labyrinth."
    },
    {
      "text": "Consider this as a form of inception from a film review: see it again, and while you're at it, see it a third time."
    },
    {
      "text": "No matter how high your personal expectations for \"Inception\" may be, the film not only meets but wildly exceeds them."
    },
    {
      "text": "It's an affecting movie; quite a piece of art in a world of also-rans and marketing plans."
    },
    {
      "text": "Inception is the first masterful video game movie (never mind that it isn't based on a video game)."
    },
    {
      "text": "Inception is a film about a man who wants to implant an idea in another man's mind. The reason it's a masterpiece is because Christopher Nolan somehow found his way into mine."
    },
    {
      "text": "A masterpiece on a grand scale that is not just an ingenious work of science fiction but may be the best film since Rear Window to play along with your mind's eye on how we view movies altogether."
    },
    {
      "text": "Inception is either a great, mind-bending movie or one big swindle. Let's go with the former."
    },
    {
      "text": "It's a challenge and a minor chore to follow Nolan's cerebral lead, but anyone complaining that Hollywood lacks bold inspiration can shush for a while."
    },
    {
      "text": "Christopher Nolan's existential sci-fi heist flick is always riveting, if not always comprehensible."
    },
    {
      "text": "Inception is Instruction Manual Cinema, a film that spends so much time explaining the rules of its narrative conceit that it fails to either emotionally engage or, except in a few notable spots, viscerally thrill."
    },
    {
      "text": "The simplest way to sum up the greatness of Inception is to identify it as a new classic of science-fiction cinema (and, for that matter, the heist genre)."
    },
    {
      "text": "Brilliantly directed and superbly conceived, this is a genuinely exciting, intelligent thriller with stunning visuals, gripping action scenes, a brilliantly constructed script and terrific performances from a note-perfect cast."
    },
    {
      "text": "None of this prattling drivel adds up to one iota of cogent or convincing logic. You never know who anyone is, what their goals are, who they work for or what they're doing."
    },
    {
      "text": "A sublime brain-twister of a movie that plays out so intricately on so many levels simultaneously that a bathroom break comes at your own peril."
    },
    {
      "text": "A master stroke from a director in his prime. Inception is leagues above any live action film released in 2010."
    },
    {
      "text": "How can it be that a bunch of people sitting around scheming nonsense can prove so compelling? Only David Fincher knows how to take a studio's money and spin it as stylishly as Nolan."
    },
    {
      "text": "Like Grand Theft Auto's quasi-cinematic extension of noir and action-flick plots, Inception manipulates the digital audience's delectation for relentless subterfuge."
    },
    {
      "text": "While the mind-bending story might not be as cerebral as it seems, it completely envelops us"
    },
    {
      "text": "A huge movie full of meaty ideas and eye-popping special-effects, yet much like Dark Knight, the go-for-broke ambition becomes a bit of a grind."
    },
    {
      "text": "Awesome design, effects and stunts, but where's the story?"
    },
    {
      "text": "Nolan is at his most beguiling here playing with, in the meta sense, movies as dreams, messing with the physics of narrative time, reminding us on multiple levels that movies are not to be trusted beyond our experience in the moment of them..."
    },
    {
      "text": "Watching Inception is like striking a match and setting your brain on fire."
    },
    {
      "text": "It's obvious that Nolan either can't articulate or doesn't believe in a distinction between living feelings and dreams -- and his barren Inception doesn't capture much of either."
    },
    {
      "text": "It is not that I don't understand (well, pretty much, anyway) or appreciate the intense ambition of Christopher Nolan's trip into the world of dreams. But why did a movie designed to blow your mind, leave mine, while originally tickled, ultimately unmoved"
    },
    {
      "text": "Huh? Beautifully executed with DiCaprio's intensity but what does it mean?"
    },
    {
      "text": "In this wildly ingenious chess game, grandmaster Nolan plants ideas in our heads that disturb and dazzle. The result is a knockout. But be warned: Inception dreams big."
    },
    {
      "text": "At first, Inception left me cold, feeling as if I'd just eavesdropped on somebody's bad acid trip. Now I find I can't get the film out of my mind, which is really the whole point of it, isn't it?"
    },
    {
      "text": "One of the year's best films, one that will surely get even better upon repeated viewings."
    },
    {
      "text": "So now I've watched Inception, had my mind splattered all over the theater just like I knew it would be, and I still don't really know what it's about. That's just how amazing this movie is."
    },
    {
      "text": "Can a summer blockbuster with a multi-million dollar budget really be this smart, moving and intellectually thrilling? Pinch yourselves, we could still be dreaming."
    },
    {
      "text": "The best major release of the summer, the most fully imagined, dramatically enthralling piece of sci-fi movie-making since The Matrix."
    },
    {
      "text": "The next step in [Christopher] Nolan's evolution as one of the master filmmakers of our time ... combines the jaw-dropping action of The Dark Knight with the ingenious plotting of Memento."
    },
    {
      "text": "Roll with the journey and trust that it will take you where you want to go."
    },
    {
      "text": "Nobody can deny that Christopher Nolan's \"Inception\" is a thinking man's blockbuster."
    },
    {
      "text": "Mind-bending and time-twisting, it's the most exciting thrill-ride of the summer."
    },
    {
      "text": "The visuals, with their sweeping grey-blue Gotham-like cityscapes and preference for real-life stunts over computer trickery, are jaw-past-yer-knees outstanding."
    },
    {
      "text": "As engrossing and logic-resistant as the state of dreaming it seeks to replicate, Christopher Nolan's audacious new creation demands further study to fully absorb the multiple, simultaneous stories Nolan finagles into one narrative experience."
    },
    {
      "text": "I wanted to surrender to this dream; I didn't want to be out in the cold, alone. But I truly have no idea what so many people are raving about."
    },
    {
      "text": "A film erupting with ideas, ambition and intelligence, one that credits the viewer with the capacity for some mental heavy lifting."
    },
    {
      "text": "It is hugely impressive that, given what was at stake, Nolan has managed to not only pull this out of the bag, but to absolutely nail it. The film is as all-encompassing as the concept of its title: grand, epic, smart and unforgettable."
    },
    {
      "text": "More admirable in intellectual ambition and technical execution than in emotional impact, Inception is an unusual blockbuster, driven by ideas rather than CGI action, but also excessive and overwrought in the last hour."
    },
    {
      "text": "With physics-defying, thunderous action, heart-wringing emotion and an astonishing performance from DiCaprio, Nolan delivers another true original: welcome to an undiscovered country."
    },
    {
      "text": "Nolan's most personal and daring film, \"Inception\" contains some of Nolan's most innovative ideas since \"Memento.\" It's also his most successful movie in terms of being able to fully realize every nuance of such a rich concept."
    },
    {
      "text": "Inception could very well be Nolan's masterpiece."
    },
    {
      "text": "Beyond a taut suspense thriller, Inception is also a moving love story."
    },
    {
      "text": "Inception doesn't just dream bigger than most movies even dare, but it leaves the audience feeling inspired to do the same."
    },
    {
      "text": "There are times in Christopher Nolan's somnolent crime caper where you'll find yourself recognizing moments from your own subconscious on the screen, to a thrilling, frightening and ultimately inspiring effect."
    },
    {
      "text": "I didn't get my mind blown by Inception but I enjoyed it. I mean, it's no Total Recall."
    },
    {
      "text": "I expected a lot,but still walked out hypnotized. Here's a movie that's 3 steps ahead of you, on 4 different levels, at 5 blinding speeds. Best of 2010 thus far. (No Spoilers)"
    },
    {
      "text": "A wildly entertaining and dazzling mind-trip not to be missed. Kubrick would have been proud."
    },
    {
      "text": "If movies are shared dreams, then Christopher Nolan is surely one of Hollywood's most inventive dreamers, given the evidence of his commandingly clever Inception."
    },
    {
      "text": "A devilishly complicated, fiendishly enjoyable sci-fi voyage across a dreamscape that is thoroughly compelling."
    },
    {
      "text": "Inception is a masterpiece. Making a huge film with big ambitions, Christopher Nolan never missteps and manages to create a movie that, at times, feels like a miracle."
    },
    {
      "text": "a stunning achievement and the most completely entertaining film I've seen in years."
    },
    {
      "text": "Inception is an exhilarating cinematic experience that suggests there is still room, even in the blockbuster world, for big ideas and dangerous emotions, and that may be the single most thrilling thing about it."
    }
  ],
  "release_year": 2010,
  "duration": 148,
  "genres": [
    "Sci-Fi",
    "Mystery & Thriller",
    "Action"
  ],
  "synopsis": "Dom Cobb (Leonardo DiCaprio) is a thief with the rare ability to enter people's dreams and steal their secrets from their subconscious. His skill has made him a hot commodity in the world of corporate espionage but has also cost him everything he loves. Cobb gets a chance at redemption when he is offered a seemingly impossible task: Plant an idea in someone's mind. If he succeeds, it will be the perfect crime, but a dangerous enemy anticipates Cobb's every move.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/ljsZTbVsrQSqZgWeep2B1QiDKuh.jpg"
}