{
  "movie_name": "Interstellar",
  "movie_id": "interstellar_2014",
  "total_reviews": 376,
  "reviews": [
    {
      "text": "While detractors have often accused Nolan of being all brains and no heart, “Interstellar” shows that his intellect and his emotions are not at odds—they are inextricably linked."
    },
    {
      "text": "Nolan, a fan of narrative devices and metaphors, uses this bending of time to create tension, drama and suspense across a multitude of spaces and timelines. [Full review in Spanish]"
    },
    {
      "text": "[A] gorgeous, heartbreaking epic."
    },
    {
      "text": "Humbling and epic in scope, designed and conceptualised brilliantly, but a tad too stand-off-ish emotionally. While the father-daughter dynamic works in parts, the Cooper–Brand relationship is never given the right treatment and collapses."
    },
    {
      "text": "This is a film where complex concepts of quantum physics and powerful human emotions are inextricably intertwined and the ghost that haunts the farmhouse has both a scientific explanation and a sense of supernatural power."
    },
    {
      "text": "\"Interstellar\" pushes the limits for personal interpretation of both science and fiction. Both elements are wildly heightened to a bold scale to address the internal opposites between logic and spectacle, science and sentiment, and brains and emotion."
    },
    {
      "text": "…uses sci-fi to go beyond into the philosophical and spiritual beyond that few other epics can reach…."
    },
    {
      "text": "Nolan’s most openly emotional film, he fully lived up to his “Stanley Kubrick’s eye and Steven Spielberg’s heart” identity with this grand sci-fi epic about the sheer force of will that we have for those we love."
    },
    {
      "text": "Interstellar utilizes science in a way that strives for authenticity in a science-fiction thriller and it's why we're still discussing the Christopher Nolan film today."
    },
    {
      "text": "As Robert Bresson once said, “I’d rather people feel a film before understanding it.” Interstellar moved me, and I didn’t find myself fact checking the science so I could complain on Twitter."
    },
    {
      "text": "Staggeringly beautiful, bafflingly complex, this is proper event cinema."
    },
    {
      "text": "The film demands quite a bit of time from its viewers too, but its big ideas and wondrous sights are ample reward."
    },
    {
      "text": "When Mann appears to explain man, it collapses under the weight of a repeated thesis that doesn’t merit such explicit, redundant reiteration."
    },
    {
      "text": "It’s a contemplative adventure and an emotional exploration that captivated me from its opening moments."
    },
    {
      "text": "Rarely do epics of this scope and intelligence reach theaters anymore; such serious commercial filmmaking seems like a market almost exclusively maintained by Christopher Nolan."
    },
    {
      "text": "While not all-together perfect, the film represents a monumental cinematic achievement that deserves to be placed high within the caliber of Nolan’s filmography."
    },
    {
      "text": "The inherent message of the film brings hope, but it can definitely get waterlogged by intellectual speak and long-winded scenes."
    },
    {
      "text": "The film is indeed a sight to behold -- and one that demands to be seen on the biggest possible screen."
    },
    {
      "text": "Nolan reaches for the stars with beautifully composed shots and some mind-bending special effects, but the dime store philosophy of the story never achieves lift off."
    },
    {
      "text": "Audiences are sure to lose their suspensions of disbelief over the nearly impenetrable climax."
    },
    {
      "text": "...an often insanely ambitious science fiction epic that that remains mesmerizing for most of its (admittedly overlong) running time..."
    },
    {
      "text": "Scientists will debate, theologians will contemplate, philosophers will wonder, and cinema lovers will bask in the glory of another remarkable Christopher Nolan achievement."
    },
    {
      "text": "A big-budget reprise of ideas Nolan has been exploring since the beginning of his career. Not only is it a film about the passage of time, it's also a film about memory."
    },
    {
      "text": "None of these characters feel fully-fledged... for a film so rife with schmaltzy musings on the meaning of life, it's alarming how lacking it is in this department."
    },
    {
      "text": "Interstellar is not Christopher Nolan's best film but what I will say is that you can't deny his ambition."
    },
    {
      "text": "As spectacular as it is flawed."
    },
    {
      "text": "Interstellar is not only a grand space adventure worthy of the big screen, it's also a powerfully emotional story about the bond between a father and daughter, and how that love can drive one to attempt the impossible."
    },
    {
      "text": "One of the boldest science-fiction movies I've ever seen, both in narrative and visual terms. [Full review in Spanish]"
    },
    {
      "text": "It was a blockbuster movie-going experience."
    },
    {
      "text": "I guess the take away is all you need is love... and morse code?"
    },
    {
      "text": "Interstellar is, all in all, a very fine science fiction film."
    },
    {
      "text": "Interstellar is 120 minutes of good movie stuffed into 170 minutes."
    },
    {
      "text": "Interstellar is Nolan at his most humane. It's a good look for him."
    },
    {
      "text": "Overall, Interstellar looks nice but ultimately lacks substance. Nolan essentially loses his way by going to space."
    },
    {
      "text": "The space voyage is easily one of Nolan's most thought-provoking films yet. It's definitely his most ambitious."
    },
    {
      "text": "As far as a masterful visualization of space and an exploration of profound theory, it belongs on a shortlist of must see films which it's comparably akin to... But Nolan's film falls short in other realms, namely the human component."
    },
    {
      "text": "It's as grand as it is introspective and as grounded as it is existential. By the end of the nearly three-hour running time - it goes by in a flash - you feel as if you've experienced something that is so rarely captured on film."
    },
    {
      "text": "Christopher Nolan more than deserves however much money the studios are willing to keep giving him to make these brainy beautiful blockbusters."
    },
    {
      "text": "Preposterous, pseudointellectual, poorly constructed, clichéd, impenetrably masculine, goofy and possessed of an indecipherable ending, Interstellar is the mother of all misfires."
    },
    {
      "text": "Moreso than any of his previous projects, Interstellar left me largely confounded, wondering if Nolan had finally \"lost it.\""
    },
    {
      "text": "The old saying \"shoot for the moon - even if you miss you'll land among the stars\" has never rung quite as true as it does here."
    },
    {
      "text": "There is absolutely a breathlessness to Interstellar, although perhaps too much of that is huffing and puffing."
    },
    {
      "text": "I found it emotionally moving and... what I wanted in a good sci-fi movie."
    },
    {
      "text": "Interstellar may not be perfect, but tent-pole filmmaking with such ambition and grandeur is always worth celebrating."
    },
    {
      "text": "With the likes of Anne Hathaway, Jessica Chastain, Michael Caine, Casey Affleck, Ellen Burstyn and John Lithgow as supporting players, it is redundant to say that the ensemble adds so much more to a film that boasts excellence in all departments."
    },
    {
      "text": "A contrived science fiction film without authenticity, emotionally and narratively."
    },
    {
      "text": "A celestial tapestry of space exploration, time bender and heartfelt human story, it earns its place among the stars."
    },
    {
      "text": "Literally reaches for the stars -- and comes up short. Despite the best efforts of a talented cast and writer/director Christopher Nolan, this film just can't overcome a script with black hole-size plot craters."
    },
    {
      "text": "Interstellar is impressive. It is superbly made, and combines compelling thought about everything from ecology to the nature of time to a child's belief in ghosts into something cohesive and mostly engrossing."
    },
    {
      "text": "The summary work of Nolan: apotheosis of his signature where he attempts to merge the philosophical and emotional in entertaining genre packages."
    },
    {
      "text": "It's the rare combination of a film that's both enjoyable in the theater and afterward, hashing through it over a drink"
    },
    {
      "text": "Interstellar magnifies Nolan's style to a tremendous degree, but that also means enlarging his own flaws too."
    },
    {
      "text": "For this critic, Nolan hits shy of the mark for cinematic brilliance but still manages to land a visually stunning entertainment in its own right."
    },
    {
      "text": "Succeeds on a level that has been largely foreign to the celluloid-loving director: the emotional."
    },
    {
      "text": "The planets in the new galaxies are creatively different yet familiar, beautiful and ugly, habitable but not habitable. They have their own histories and realities and have no interest in being colonised by the US of A."
    },
    {
      "text": "The enchantment of a Christopher Nolan film, the sheer majesty of it, if you will, is surrendering to it."
    },
    {
      "text": "Interstellar is an ambitious story, and while the theme of love transcends time and space is a bit shoehorned into the script, it still rings true. Matthew McConaughey delivers one of the finest pieces of acting on film."
    },
    {
      "text": "I think the reason why I connected so deeply with it is the extent to which Nolan evokes iconic moments from silent films."
    },
    {
      "text": "What is wrong with the movie - some of the messages are lathered on so thickly... yet the Nolan brothers assume that all viewers have a keen grasp of quantum physics, relativity, time dimensions and gravity."
    },
    {
      "text": "The result is a mess. But it's a beautiful mess, and one that I wouldn't want you to miss for the world."
    },
    {
      "text": "Watching Christopher Nolan fall short is still more exciting than watching most other directors succeed."
    },
    {
      "text": "Nolan's refreshing love affair with self-determination goes too far."
    },
    {
      "text": "...visually spectacular, complex, and both intellectually and emotionally stimulating...[Full review in Spanish]"
    },
    {
      "text": "Visually striking, with an impressive cast... [Full review in Spanish]"
    },
    {
      "text": "Christopher Nolan's spectacular film is filled with frustration, anger, and guilt, and also strives for acceptance and even redemption."
    },
    {
      "text": "Eye-popping visuals, an ambitious narrative, and a heart-racing soundtrack; one of Nolan's best"
    },
    {
      "text": "Interstellar is why we go to the movies."
    },
    {
      "text": "This intergalactic extravaganza is clearly in a class by itself."
    },
    {
      "text": "Big Ideas served in a movie that is ultimately unsatisfying."
    },
    {
      "text": "With all the rampant think pieces questioning the probability of every science fiction film that comes out, it's comforting to across a movie that doesn't really claim to have any of the answers."
    },
    {
      "text": "Interstellar is a beautiful, irritating, awe-inspiring mess. It's the kind of movie Hollywood simply doesn't make any more - and that's exactly why you should see it."
    },
    {
      "text": "Nolan does (to his credit) and his failure to engage us as fully as he intends... takes us to infinity and beyond, but it's likely you cared more about Buzz Lightyear than you will about anyone in Interstellar."
    },
    {
      "text": "It's flawed, certainly, but its vision is undeniably appealing and ultimately the film's saving grace."
    },
    {
      "text": "A film made with meticulousness and ambition, that achieves its tasks both narrative and visual with singular efficiency and grandiloquence that never feels forced. [Full review in Spanish]"
    },
    {
      "text": "Naturally, Nolan's desire to unite high and low culture doesn't always pay off, yet even when he gets pretentious, I don't hate him for it. Better a filmmaker who fails while overreaching than one who has a hit with Transformers."
    },
    {
      "text": "Interstellar, though ambitious and thrilling at points, is too complicated and doesn't reach its full potential."
    },
    {
      "text": "Interstellar has more of absolutely everything: more plot, more (stupid) words, more acting and much more bad acting (Anne Hathaway) than nearly all the year's films put together, as well as the most idiotic storyline of the decade."
    },
    {
      "text": "It is a wondrously beautiful movie, with intense sci-fi sequences, a solid and talented cast, and even some thought-provoking ideas. This is not one to be missed."
    },
    {
      "text": "Christopher Nolan is incredibly good at making science-fiction movies for people who think they don't like sci-fi."
    },
    {
      "text": "Interstellar never feels overly long despite its almost three hour running time. It also packs an emotional wallop, if you let it."
    },
    {
      "text": "It's his 'White Album,' overlong and overwritten, corny and self-important, and also a great movie. And yes, it can be all of those things at once."
    },
    {
      "text": "Can we fly a spaceship through a galactic wormhole to Saturn? We haven't even put a man on Mars yet! It's another 342,077,666.43 miles from Mars to Saturn! Fuggeddaboudit!"
    },
    {
      "text": "Perhaps it would have been wiser to trim back on several of the ideas and present a more cohesive, not to mention coherent, story."
    },
    {
      "text": "Interstellar feels like a collection of arresting moments and ideas that don't quite hang together."
    },
    {
      "text": "The result is a flawed but highly engaging experience that is as frustrating as it is astonishing."
    },
    {
      "text": "A blockbuster that's profound, poignant and exhilarating."
    },
    {
      "text": "Too literal-minded, too conspicuous to leave us with a sense of doubt and apprehension."
    },
    {
      "text": "Nolan's Interstellar waxes poetic about the universality of love and lingers beautifully on worlds beyond ours."
    },
    {
      "text": "A dynamic left-right combo of spectacle and heart that efficiently covers over the screenplay's various cracks and crevices."
    },
    {
      "text": "Interstellar needs to be seen on the biggest screen you can get your eyes on for maximum impact."
    },
    {
      "text": "When the essential property of film forces us to believe in an illusion, [Nolan] has become the least-spiritual director in contemporary cinema."
    },
    {
      "text": "This epic film will still leave its mark on our collective memories, for it succeeds in affecting us. However, a bit of humor and humility would have been appreciated in this journey, which takes itself far too seriously."
    },
    {
      "text": "I can't remember an apocalyptic film that's taken less interest in this planet as it's destroyed."
    },
    {
      "text": "This is a film rife with mistakes that even a rookie director wouldn't make. How this ended up being made by Nolan blows my mind."
    },
    {
      "text": "This is one of the most beautiful films I have ever seen."
    },
    {
      "text": "[Interstellar] is a mighty science fiction epic built upon seriously shaky science. Yet that's hardly the point when this strives so hard, so achingly, to be profound. And very nearly is too."
    },
    {
      "text": "Interstellar may be a failure on a story level, but Nolan's visual virtuosity is still enough to take your breath away and root you to your chair."
    },
    {
      "text": "Let's be plain. Christopher Nolan has made a lopsided soufflé of a film, but one with such fine ingredients you can hardly complain about the shape when you're enjoying the taste."
    },
    {
      "text": "Interstellar dares it viewers to come along on a perilous adventure that is immersive, impressive, and intelligent."
    },
    {
      "text": "Nolan is a well-appointed mainstream fabulist who uses a great deal of money and technology to no great artistic purpose."
    },
    {
      "text": "...after building up the drama of personal sacrifice, it feels too much like a cheat no matter how many endings are tacked on before the credits..."
    },
    {
      "text": "It's just a really weird film, the strangest and most misguided fake-Spielberg picture since Super 8."
    },
    {
      "text": "Visual splendor does not entirely make up for failures in plotting and characterization."
    },
    {
      "text": "Interstellar is a frustratingly flawed film that reaches for the stars but winds up lost in space."
    },
    {
      "text": "Interstellar is chockablock with philosophical ideas, visual effects and theoretical physics from Nolan and his brother, Jonathan, who co-wrote the script."
    },
    {
      "text": "Interstellar is a grand gesture in every way. And yet, it's Nolan's most humane film to date."
    },
    {
      "text": "For all the themes intended to rocket our minds into a futuristic escape plan, it's too overloaded with hopelessness and bent logic to get off the ground."
    },
    {
      "text": "Nolan is one of the few directors with the ambition to tackle big topics -- like the fate of humanity or our need to explore -- and the artistic clout to bring that vision to a mass audience."
    },
    {
      "text": "There are many words to describe Interstellar. Entertainment isn't one of them."
    },
    {
      "text": "This sort of hammering, a determination that you'll \"get it\", distracts from Interstellar's effort to transport."
    },
    {
      "text": "Though the family ties don't quite hold, Interstellar gives us an epic of space travel as desperate necessity, at a time when its science fiction hits perilously close to home."
    },
    {
      "text": "You'll feel the cold on the Hoth-like ice planet. It's pure movie magic -- impressive and astonishing and deserving of all the out-of-this-world hyperbole. Too bad the rest of it is mostly empty space."
    },
    {
      "text": "While it definitely feels as though Nolan over-reached and under-edited, there's enough eye candy and emotion to keep you from being bored."
    },
    {
      "text": "This is a Nolan film, so nothing is simple -- or quick to the point. At nearly three hours, the film piles on the twists, wonky physics, heartfelt speeches and pseudoscience."
    },
    {
      "text": "Watching Nolan's latest attempt to create something artistic, intelligent and entertaining on such a massive scale, I couldn't help but think that with \"Interstellar,\" he's outsmarted himself."
    },
    {
      "text": "\"Interstellar\" is flawed, but has the kind of scope that makes going to movies fun."
    },
    {
      "text": "I urge you to stop seeking out information on this film, and instead wait until this Thursday and see it, on the biggest screen within reach. You won't be sorry."
    },
    {
      "text": "McConaughey and his co-stars do a terrific job of underplaying the tech-nobabble and selling their individual moments... and Nolan's trademark big-picture confidence propels Interstellar through its near-three-hour running time with breathless style."
    },
    {
      "text": "You go in to Interstellar hoping to be mind-blown, thrilled, and smartened-up. Although it's beautifully made, brainy and sometimes insanely gorgeous, you may find yourself wondering what the big whoop was all about."
    },
    {
      "text": "As undeniably ambitious and technically accomplished as it is bloated, ponderous and ludicrous, Interstellar finds Christopher Nolan struggling in the shadow of Kubrick, Malick and other visionary filmic philosophers."
    },
    {
      "text": "It's an enthralling, provocative, ambitious film."
    },
    {
      "text": "Interstellar's themes are universal and some of the dialogue really resonates too."
    },
    {
      "text": "I learnt a lot about wormholes and, while I can be entranced by the idea of saving the human race, I want a little bit of drama to go with it."
    },
    {
      "text": "This is not only a tremendously exciting space adventure... It's also a rich and thoughtful meditation on time and space and gravity."
    },
    {
      "text": "\"Interstellar\" is a grand undertaking, but in shooting for the stars, it loses its footing. It goes to infinity and beyond, when infinity would have been plenty."
    },
    {
      "text": "That the universe contains phenomena eons beyond us while at the same time intimately close is a beautiful concept and Interstellar seeks to orchestrate its own moment of revelation."
    },
    {
      "text": "Interstellar is a visual feast that explores the universe and an intimate drama that explores why love and devotion are qualities that make the human race worth saving."
    },
    {
      "text": "There's a certain clumsiness to Nolan's longest and most personal film, a kind of earnest self-seriousness that opens it to parody and snark. But at its center beats a human heart."
    },
    {
      "text": "It's a fairly s----y science-fiction movie, but as a metaphor for love it's kind of great."
    },
    {
      "text": "Having set out to be a journey into what can hardly be depicted at all, Interstellar must find oblique ways of suggesting further imperceptible dimensions of the real. It is worth the journey to see what Nolan has constructed as a model of the unknowable."
    },
    {
      "text": "Big on ideas and concepts but falls apart in the 3rd act."
    },
    {
      "text": "A graceful, stirring epic and while it may not set new standards for the genre, it does give today's audiences a reminder of what visionary filmmaking looks like."
    },
    {
      "text": "A remarkable achievement in filmmaking that will have you on the edge of your seat"
    },
    {
      "text": "Despite some awkward pacing, easy sentimentality, and pandering it's still hard to resist. It's not just Nolan's ambition that should be admired. He actually pulls off scene after scene of unforgettable drama in colossal scale, both in space and on Earth."
    },
    {
      "text": "After the first hour, with its poignant depiction of humanity's decline, Interstellar always seems to be rebuilding its momentum, offering plenty to think about but little to hold on to."
    },
    {
      "text": "Ultimately, Interstellar shoots for the stars but barely gets us past the soundstage."
    },
    {
      "text": "Christopher Nolan's latest exercise in devising narrative lines that run laboriously in different locations and on multiple timescales to no great effect, other than to tell you that love will find a way."
    },
    {
      "text": "The sentimentality and Hollywoodized convenience of the storytelling prevent this mostly admirable film from achieving the escape velocities of Kubrick or Tarkovsky."
    },
    {
      "text": "[O]nce our explorers pass into another galaxy...things take on a new dimension of banality and the film, however magnificently conceived in visual terms, becomes just another space adventure."
    },
    {
      "text": "A bombast-and-crisis megamovie, rocket-fuelled by gobbledygeek. The pummelling of plot turns and ratcheting of emotion-wrenches rarely relent. Forgets that we mere humans don't yet possess infinite patience for hyper-epic hokum."
    },
    {
      "text": "It's a film I didn't exactly enjoy and can't say I would recommend. And yet as an event, as a singular movie-watching opportunity, it's undoubtedly worthwhile."
    },
    {
      "text": "nothing if not grandly ambitious, and while that ambition is certainly admirable, especially in an industry that is choking even more than ever on interchangeable big-budget franchises and starving for original ideas"
    },
    {
      "text": "There's no denying that director Christopher Nolan's challenging space odyssey is exquisitely made. He's one of painfully few filmmakers whose every effort fills me with a sense of awe."
    },
    {
      "text": "A combination of spectacular special effects, marginal physics and grindingly slow treacle, McConaughey pulls this one out of the fire."
    },
    {
      "text": "The movie is complex and maddening, filled with concepts over the heads of most mere mortals, yet grounded in barely enough humanity to stimulate our senses."
    },
    {
      "text": "Some of what ensues in a galaxy far, far away is gripping, but other sequences are prosaic."
    },
    {
      "text": "The pace is gripping, the central performances compelling and the action sequences thrilling."
    },
    {
      "text": "Good special effects and acting but I didn't understand one bit of the plot. It is all Geek to me."
    },
    {
      "text": "The spectacle is far more satisfying than the story ... Gorgeous, infuriating, exciting, confusing, stirring, boring, it's the film that's got it all! Totally worth your twenty bucks. Whether it's worth three hours of your time will be up to you."
    },
    {
      "text": "Not your usual Christopher Nolan film. It is epic, has a sharp-eyed view of the future, and characters with real human emotions. I really like this ambitious, thought-provoking, uplifting film."
    },
    {
      "text": "There's something weirdly touching about the movie's corny proclamations, because they contrast so sharply with the hell scapes Nolan keeps showing us."
    },
    {
      "text": "With Interstellar, Nolan builds on the high-concept blockbuster template forged so impressively by his 2010 work Inception."
    },
    {
      "text": "While the ride is a bumpy one and the destination is a bit of a letdown, getting there is a trip."
    },
    {
      "text": "Interstellar is much like space itself - a beautiful, promising void."
    },
    {
      "text": "The spirit of exploration and discovery lives in Interstellar and that alone makes it a cinematic trip worth taking."
    },
    {
      "text": "There is no sound in space, but 'Interstellar' blasts its music, hammers in three voiceovers its centennial birthday boy Dylan Thomas message, and overstays its welcome."
    },
    {
      "text": "An unsatisfying blend of Gravity, 2001: A Space Odyssey, Solaris and The Collected Poems Of Dylan Thomas."
    },
    {
      "text": "Even more mind-blowing than his 'Inception,' Christopher Nolan's 'Interstellar' emphasizes the importance of love in a science-fiction tale."
    },
    {
      "text": "If a movie is outsized in its ambitions to an absurd, awe-inspiring degree, how much credit does it get for only making it, oh, 75 percent of the way there?"
    },
    {
      "text": "If it's spectacle you want, then Interstellar delivers, particularly when viewed in Nolan's preferred 70mm Imax format."
    },
    {
      "text": "It's an experience."
    },
    {
      "text": "Cornpone existentialism ... Overlong, talky and, depending on the crisis, either dopey or pretentious ... a New Age-y, fuzzy-headed sci-fi'er that borrows liberally from Kubrick, 'Contact' and Nolan's own \"Inception.\""
    },
    {
      "text": "After stretching the boundaries of incomprehension with Inception, a narrative arc that challenges yet remains accessible is a welcome relief."
    },
    {
      "text": "This is probably the most audacious science fiction film anyone has ever made or even tried to make."
    },
    {
      "text": "'Interstellar' is really great science fiction. It tugs at our heartstrings while exploring our humanity, and at the same time it blows our minds with the wonders and complexities of intergalactic space travel."
    },
    {
      "text": "I'm not too proud to admit I couldn't follow the convoluted storyline... Think, a remake of Gravity with a bunch of polysyllabic brainiacs borrowed from The Big Bang Theory."
    },
    {
      "text": "What makes Interstellar one of the best, most enthralling, intelligent and moving science-fiction films of modern cinema is not so much the inter-galactic journey it takes you on as the emotional journey."
    },
    {
      "text": "Nolan's attempt at trumping Kubrick's ultimate trip falls short because it lacks the old master's laser-like focus and magnetic solemnity."
    },
    {
      "text": "It intelligently and in a masterful cinematic way weaves together a story that explores both the cosmic world and the real world."
    },
    {
      "text": "The general feeling I'm left with after seeing Interstellar (is) a sensation of indecision."
    },
    {
      "text": "Ultimately, it is human emotions not quantum physics that propels Nolan's movie to its destination."
    },
    {
      "text": "While [...] imperfect in many ways, the whole proves to be far more than the sum of its parts."
    },
    {
      "text": "Heartfelt Story, Great Visuals, Science Overkill"
    },
    {
      "text": "It's deeply flawed but also wholly absorbing, and it marks Nolan as one of our most ambitious, go-for-broke directors, unafraid to attempt Sistine Chapel ceilings while his fellow filmmakers are working with Crayolas."
    },
    {
      "text": "The combination of NO green screen, incredible practical effects, Zimmer's score and a solid emotional core makes this Nolan's most complete flick to date. I had major nerd tears! See in 70mm IMAX film!"
    },
    {
      "text": "Leaving aside the flaws as film (underdeveloped characters, etc.), it is worse as a message. Deriding agriculture and hyping space exploration is even more fascist than \"The Dark Knight Rises\"."
    },
    {
      "text": "Christopher Nolan can do whatever the hell he likes. He's earned that right now. And if he uses that clout for films like Interstellar, we all win."
    },
    {
      "text": "Whenever Christopher Nolan has something to say, it pays to listen."
    },
    {
      "text": "Its strengths are as gargantuan and overpowering as its mighty flaws, and just as impossible to miss."
    },
    {
      "text": "Ambitious and inspired visually, thematically and emotionally, Nolan's space odyssey may not complete its mission, but its shot at the stars is no less awesome."
    },
    {
      "text": "This film is meant to be Nolan's 2001: A Space Odyssey, but he's tilting at windmills here. Still, Interstellar is worth seeing."
    },
    {
      "text": "For all its sci-fi trappings...Interstellar comes down to one thing, and one thing alone: the notion of following your heart. Yes, it really is that simple."
    },
    {
      "text": "Interstellar may be a preposterous epic, but it is an epic nonetheless."
    },
    {
      "text": "The film is confident enough to take us on a thrilling adventure witho ut resorting to huge action sequences, in which the spectacle is delivered on an intergalactic scale, but from a very human point of view."
    },
    {
      "text": "Ambitious intergalactic drama focuses on a father's promise."
    },
    {
      "text": "The Nolans plant some actual characters onto that landscape, but it's too arid for anything interesting to grow."
    },
    {
      "text": "Not Christopher Nolan's best film by a long shot, yet also proof that 'not Christopher Nolan's best film' is still better and more thrilling than many directors' finest work."
    },
    {
      "text": "Interstellar is an imaginative movie, but a heavy-handed mix of personal sacrifice and theoretical physics doesn't leave much room for subtle storytelling."
    },
    {
      "text": "If humanistic pop science is a religion, then Christopher Nolan is its high priest and Interstellar its rapture story."
    },
    {
      "text": "Interstellar is thrilling to watch across its moments but ultimately unmemorable; I feel it slipping away from me even now."
    },
    {
      "text": "Dazzling, frightening and thrilling. Pure cinematic magic. But the philosophical points presented - love and survival - are contradictory."
    },
    {
      "text": "In Christopher Nolan's Interstellar, sci-fi fans are treated to a true cinematic anomaly: an impeccably crafted slice of escapism driven by scientific concepts that fascinate and thrill in equal measure."
    },
    {
      "text": "Interstellar is as cinematically epic as it is dramatically intimate."
    },
    {
      "text": "Marrying the brains of \"Inception\" with the epic splendor of \"The Dark Knight,\" Christopher Nolan's \"Interstellar\" asks vastly important brain-scratching questions, inspires your forward thinking and treats you to one hell of a mind-altering thrill ride."
    },
    {
      "text": "Interstellar is escapism in its purist form."
    },
    {
      "text": "Interstellar is a marvel of congruency from the opening shot to the final frame."
    },
    {
      "text": "Nolan's Vision Exceeds his Grasp."
    },
    {
      "text": "Nolan lays out a narrative path between Odysseus, Albert Einstein and Buck Rogers, then paints it with bold cinematic brushstrokes inspired by the masters-Stanley Kubrick, Steven Spielberg, John Ford."
    },
    {
      "text": "Interstellar is not a terrible movie, it's just such a chore."
    },
    {
      "text": "This majestic film retains a human heart."
    },
    {
      "text": "It is dazzling to look at, properly intelligent, and, when you can follow what's going on, profoundly thought-provoking."
    },
    {
      "text": "Christopher Nolan's movie about time has time troubles of its own. It's too long and drags to a convoluted climax. However, getting there is riveting and worth the trip."
    },
    {
      "text": "As emphatically as Nolan writes PROSE PROSE PROSE PROSE PROSE, in the largest possible font, it never verges into poetry."
    },
    {
      "text": "Fails to trigger much in the way of awe and emotion, at least not the obviously manipulative kind. Nolan's ambition doesn't match his material this time around, leaving the picture strangely inert as it seeks to dissect the heavens."
    },
    {
      "text": "Fails to launch..."
    },
    {
      "text": "While it has some problems, Nolan aims higher than most filmmakers would dare attempt and comes oh so close to creating another undeniably classic space masterpiece."
    },
    {
      "text": "Forget about what it means and just go for the mind blowing, heart wrenching ride."
    },
    {
      "text": "Lacking a sense of awe or of the astronomic passage of time, \"Interstellar\" provokes more \"huh?\" moments than it does \"ah!\" moments."
    },
    {
      "text": "Interstellar is sufficiently grand and challenging to bear comparison with those two touchstones of mind-bending epic sci-fi: Kubrick's 2001: A Space Odyssey and Tarkovsky's Solaris."
    },
    {
      "text": "Much as Nolan's characters often fail to reconcile their grandest desires, so, too, does Interstellar fall short, particularly in its trying-to-have-it-all finale. But, damn, if we shouldn't applaud Nolan for aiming big."
    },
    {
      "text": "A movie that feels like being tangled up in a pile of infinitely-unfolding some-assembly-required instructions in the watching, full of dialogue that's like the recital of a How To manual."
    },
    {
      "text": "Interstellar is beautiful, dazzling and astonishingly loud, but, alas, it is remains something of a mess at the level of the script"
    },
    {
      "text": "Nolan, a director often accused of coldness, finally got all mushy when he went to outer space. I can't solve that equation, but I've enjoyed trying to scratch it out."
    },
    {
      "text": "Christopher Nolan outdoes himself with this thrilling , and emotionally moving. sci-fi drama that has echoes of 2001 but carves out its own gripping story by smartly focusing on the human element so often missing in this genre."
    },
    {
      "text": "Christopher Nolan's 168-minute odyssey through the space-time continuum is stuffed with stuff of bewildering wrongness."
    },
    {
      "text": "Nolan creates overwhelming, often breathtaking suspense in a number of sequences."
    },
    {
      "text": "Uma obra inquestionavelmente problemática."
    },
    {
      "text": "What the neg-heads are missing about Interstellar is how enthralling it is, how gracefully it blends the cosmic and the intimate, how deftly Nolan explores the infinite in the smallest human details."
    },
    {
      "text": "A science-fiction (heavy on science) adventure steeped in Einstein's theory of relativity that is equal parts enigmatic, exhilarating, elaborate and emotionally wrenching."
    },
    {
      "text": "Stanley Kubrick had the right idea. When making a philosophical space epic steeped in scientific theory, don't explain everything. Be bold but be vague; fewer corners to back into that way. And don't let Hans Zimmer do the music."
    },
    {
      "text": "A thought experiment writ large."
    },
    {
      "text": "Interstellar tries to ground its corn-pone mush in quantum theory and paper over its planet-sized plot holes with enormous vistas and the most egregious use of Dylan Thomas ever committed to screen."
    },
    {
      "text": "Boldly swinging for the rafters and face-planting half the time, [Nolan is] uncharacteristically willing to embarrass himself here. There's a lot to admire in that."
    },
    {
      "text": "Brainy blockbuster maestro Christopher Nolan heads into deep space with this epic adventure, which is packed with thoughtful ideas and big emotions even if the plot wobbles badly in the middle."
    },
    {
      "text": "Nolan has created nothing less than his own personal 2001: A Space Odyssey, a mind-expanding, imagination-challenging excursion into alternate galaxies where we skip through the fourth dimension and plunge headlong into the fifth."
    },
    {
      "text": "Mostly, Interstellar is super-dull and super-annoying and super-dumb because it posits itself as a film of many big ideas when it doesn't even possess a single decent one."
    },
    {
      "text": "If Nolan were as deft a director when the action dies down, Interstellar might be a formidable work. But his film has a lot of dialogue, pages of the stuff, explanations and exposition, none of it overlapping with recognisable human speech."
    },
    {
      "text": "Interstellar is an entertainment disaster for reasons that have dogged our films since they began: ridiculous story; implausible segues; laughable dialogue; the absence of character, drama, and command."
    },
    {
      "text": "You never know what's coming in Interstellar. It stokes and maintains a sense of anticipation often missing in Hollywood blockbusters intent on being formulaic and thus global audience-friendly."
    },
    {
      "text": "In space no-one can you hear you scream, but they can certainly see you cry. Never before have I seen more blubbering in a movie than director Christopher Nolan's Interstellar."
    },
    {
      "text": "The best thing about Nolan is that he inspires you to think magically. The worst thing about him is that he requires you to, since his convoluted plots don't work without it."
    },
    {
      "text": "There is something exciting about a film that tries to fill your mind and then blow it, even if it's only filling you full of hot air."
    },
    {
      "text": "Christopher Nolan's epic is visually stunning and offers some ingenious ideas on time and space as it plays on our darkest fears about the end of life on Earth."
    },
    {
      "text": "Interstellar surprises you with a high ratio of scenes of people sitting around tables (sometimes on board spaceships) to moments of flight or danger."
    },
    {
      "text": "You thought Gravity was an immersive lost-in-space experience? Just you wait."
    },
    {
      "text": "At its best, the film is illuminating in the way that \"Contact\" was, at its worst it's dull, pedantic and overly expositional the way \"Contact\" was."
    },
    {
      "text": "What many had hoped would be Christopher Nolan's 2001: A Space Odyssey is, instead, 2014: An Exposition Odyssey."
    },
    {
      "text": "Christopher Nolan's sci-fi epic is a beautiful, ambitious, ultimately flawed film about nothing less than the survival of the human race."
    },
    {
      "text": "A grandiose, audacious, exciting, sentimental, impassioned, philosophical, metaphysical, dense, epic mess. And you probably need to see it."
    },
    {
      "text": "Interstellar is terrible, wonderful, sensational, thrilling, imbecilic. In any order you want."
    },
    {
      "text": "If only the plot and the corny, exposition-heavy dialogue - where characters speak in fortune cookie - could hold up to the cinematography."
    },
    {
      "text": "The film's self-seriousness is, in fact, its great ally: the conviction with which Nolan directs prevents us questioning the absurdity as it unfolds."
    },
    {
      "text": "In the age of shopping-centre cinema, Christopher Nolan builds cathedrals."
    },
    {
      "text": "With its intellectually stimulating ideas and profound emotional ballast, Interstellar makes a solid impact, albeit without the Wow Factor"
    },
    {
      "text": "... it's the best science fiction movie you're likely to see this year, and quite possibly one of the best films period."
    },
    {
      "text": "...way too long...The first two hours are tolerable, but the ending requires an advanced degree in theoretical physics to understand, and even then I would think it would be ludicrous."
    },
    {
      "text": "The most brilliant editing of the year revs you up as it interlaces the apex of story lines, and then explodes into a giant orgasm of emotional and physical movie making only to roll over, light a cigarette and stop paying attention to you."
    },
    {
      "text": "Interstellar can be pretty fun when it wants to be. The trouble is, 'fun' has never been atop director Christopher Nolan's list of priorities."
    },
    {
      "text": "Never has a nearly-three-hour blockbuster enthralled me in the way that Interstellar did."
    },
    {
      "text": "Christopher Nolan's Interstellar is desperately reaching for Stanley Kubrick 2001 greatness and achieving Robert Zemeckis mediocrity in Contact. It's no small bit of irony that both films star Matthew McConaughey and his southern drawl."
    },
    {
      "text": "Interstellar may be a blockbuster spectacle but it's also a puzzle that bends the laws of space and time to create different kinds of links between images, like Nolan's early hit Memento or Shane Carruth's recent Upstream Colour."
    },
    {
      "text": "[Nolan's] most ambitious movie ends up in the least satisfying way of his nine features, but the ride up to that point has taken us to a more interesting destination than four-fifths of the pictures coming out this year."
    },
    {
      "text": "Nolan's gigantic exercise soars and sinks"
    },
    {
      "text": "Interstellar is not perfect, but it's the bold, electrifying and provocative cinema with rocket scientist smarts and a sentimental heart."
    },
    {
      "text": "Often fascinating, sometimes thrilling, sometimes tedious, but always strangely aloof, despite its best efforts. The movie's easy to admire, hard to love."
    },
    {
      "text": "\"Interstellar\" feels like someone else's film, a Spielberg retread."
    },
    {
      "text": "Illustrious of vision but even grander of ideas, \"Interstellar\" is majestic science-fiction done right. Mostly."
    },
    {
      "text": "By the closing credits, it seems possible that Nolan himself hails from another planet, and while he has tried diligently to show humanity in a flattering light, he lacks enough inside information to get it right."
    },
    {
      "text": "The film is at its best when it's unafraid of challenging storytelling, particularly since Interstellar never has trouble finding visuals to match its heady concepts."
    },
    {
      "text": "It's almost impossible to resist recommending Interstellar, but it's equally tough to deny a galactic sense of disappointment."
    },
    {
      "text": "A roller-coaster for the mind and spirit... Twenty years from now we may think of it as a classic, even if it takes a bit of time for it to sink in."
    },
    {
      "text": "There's clear ambition here, but no direction; emphasis, but no meaning."
    },
    {
      "text": "This isn't Nolan's best movie, but his ambitions and trust in the audience keep getting bigger. He's one of Hollywood's few true remaining visionaries, and he's only getting warmed up."
    },
    {
      "text": "You can certainly respond to its craft, but its attempts at emotional depth and cosmological profundity fall short."
    },
    {
      "text": "Love is what's really between the stars, y'all."
    },
    {
      "text": "The story doesn't hold together very well, but most viewers will be more interested in the movie's state-of-the-art visuals, which do not disappoint."
    },
    {
      "text": "[Nolan's] new picture is his biggest: biggest event, biggest spectacle, biggest pastiche, biggest disappointment."
    },
    {
      "text": "Twice as long as Gravity and half as good."
    },
    {
      "text": "A lot of sound and fury, signifying not much."
    },
    {
      "text": "From the grand master of films about the mysteries of human nature, a disappointing exploration of family, science, and human survival."
    },
    {
      "text": "An intense epic that seeks to deliver both an \"experience\" and a movie. In my book, it succeeds on both counts. (Full Content Review for Parents Also Available)"
    },
    {
      "text": "A spectacle of outrageous proportions, Nolan's creativity has reached new levels with this latest achievement."
    },
    {
      "text": "Ambitious, provocative, thoughtful, and highly entertaining--all things considered (believe me, ALL things are considered), it holds together very well."
    },
    {
      "text": "That's the essential question facing the viewer, whether Nolan's mission is a success because it takes us farther than most filmmakers could, or a disappointment because it doesn't quite make it all the way."
    },
    {
      "text": "It's frustrating because there's so much to look at, so much money well spent in every frame, but \"Interstellar\" wears out its audience long before it ends."
    },
    {
      "text": "an ambitious film, but it's difficult to get swept up in its sweep."
    },
    {
      "text": "There are genuinely spectacular and tension-filled scenes, none more so than when the crew is confronted by massive waves. We have come to expect jaw-dropping effects like this from Nolan."
    },
    {
      "text": "Interstellar is a unique, sometimes enthralling, often thoughtful piece of filmmaking from one of our best directors."
    },
    {
      "text": "...a unique film to be sure, and one that is probably best experienced on the largest screen available."
    },
    {
      "text": "Comes closer to mimicking the feel and structure of 20th-century hard sci-fi in the Arthur C. Clarke mode that just about any other movie."
    },
    {
      "text": "It's ambitious and not entirely successful but there is a lot to like about \"Interstellar.\""
    },
    {
      "text": "For a movie about transcending all manner of dimensions, \"Interstellar\" ultimately falls surprisingly flat."
    },
    {
      "text": "It's a mass audience picture that's intelligent as well as epic, with a sophisticated script that's as interested in emotional moments as immersive visuals. Which is saying a lot."
    },
    {
      "text": "Even a cool cat like Christopher Nolan can cough up a furball - and with his sci-fi adventure Interstellar, it's blockbuster-sized."
    },
    {
      "text": "At 165 minutes feels both rushed and overlong."
    },
    {
      "text": "The human qualities that can corrupt the perfect science experiment, it's heartbreaking yet life affirming. We will ultimately triumph over cold science precisely because of, not in spite of, our humanity."
    },
    {
      "text": "Nolan has always been a director who loves big, big ideas, but one occasionally gets the sense that he would almost rather make a movie of the characters explaining those ideas to one another with flow charts and diagrams."
    },
    {
      "text": "The parts of Interstellar that don't work -- a third act (out of four) that descends into suspense-movie silliness, an increasing reliance on mystical mumbo-jumbo -- struggle against the many parts that do."
    },
    {
      "text": "The climax contains some tangled magic. If you're not exhausted by almost three hours of intergalactic lecturing, you may even be able to feel it."
    },
    {
      "text": "While it's not a perfect movie by any means, it's a grand accomplishment of sorts."
    },
    {
      "text": "What good is that adventurous spirit if Nolan doesn't trust the audience enough to see it through to the end?"
    },
    {
      "text": "It's rare for a film to deliver a scene of such emotional power that the hardened critic is fighting back tears. It's even less common for a celluloid image to have that effect. Interstellar does both."
    },
    {
      "text": "Nolan tries to pair the cosmic esoterica with this father-daughter tussle, but the mix doesn't jell. Visionary movies require a bigger vision."
    },
    {
      "text": "All the talk of Kubrick and 2001 is light years off the mark: Interstellar is the kind of space odyssey that has only shameless, monolothic entertainment on the agenda."
    },
    {
      "text": "The movie sucks you into its orbit and promptly shuttles you to the event horizon of the unknown, where the only thing you can really do is appreciate the scenery and hang on for the bumpy ride."
    },
    {
      "text": "It's an amazing achievement that deserves to be seen on the biggest screen with the best sound system possible. Nolan has crafted Interstellar as a movie theater experience. Watching it at home, no matter how good the sound system is, won't match."
    },
    {
      "text": "A knockout one minute, a punch-drunk crazy film the next, Interstellar is a highly stimulating mess."
    },
    {
      "text": "\"Interstellar\" may not be Nolan at his best, but it's still Nolan, and there's much to be said for that."
    },
    {
      "text": "This is epic cinema that begs to be compared to \"2001: A Space Odyssey.\" But unlike Stanley Kubrick's psychedelic joyride, this journey is powered by a human heart."
    },
    {
      "text": "Interstellar is an experience. Nolan's vision of our galaxy, and galaxies beyond, is daunting, majestic; the hardware of space travel looks right, almost familiar."
    },
    {
      "text": "The plot here is not as much the problem as Matthew McConaughey's mumbling. At times it's as if he's auditioning for a dinner theater version of Brokeback Mountain."
    },
    {
      "text": "Whereas 2001 is enigmatic and ethereal...Interstellar is far more prosaic and pedestrian...Still, it has moments of bombastic brilliance, an often moving performance from Matthew McConaughey, and, boy, at its best, is it something to look at."
    },
    {
      "text": "[T]his is a film with the weight of space, time, and humanity on its shoulders. It is unafraid of stumbling and soldiers forward with the conviction of its audacity."
    },
    {
      "text": "Interstellar is the most ambitious, intelligent and daring space epic since Stanley Kubrick's masterpiece, 2001: A Space Odyssey."
    },
    {
      "text": "It's hard to talk about certain elements without giving away some of the film's secrets. Let's just say the ending would be laughable if it wasn't so incredibly bad."
    },
    {
      "text": "Despite its many virtues, Interstellar feels as if it doesn't quite hit the target."
    },
    {
      "text": "The film offers grand visuals, including a bizarre-beautiful key scene in a location I couldn't describe if I wanted to."
    },
    {
      "text": "Christopher Nolan's film, about a trip to deep space to find a habitable place for humans to live, doesn't always live up to its ambition, but then again, its ambition is huge."
    },
    {
      "text": "To this point, I have enjoyed many of Nolan's films but Interstellar's script is terribly inconsistent."
    },
    {
      "text": "Interstellar is one of the most ambitious films in this genre that I've ever experienced."
    },
    {
      "text": "Shows that long doesn't mean epic and serious doesn't mean deep."
    },
    {
      "text": "\"Interstellar,\" full of visual dazzle, thematic ambition, geek bait and corn (including the literal kind), is a sweeping, futuristic adventure driven by grief, dread and regret."
    },
    {
      "text": "An intellectual and technical feat, this undeniably ambitious Christopher Nolan movie reaches for the stars and reaches them more often than not."
    },
    {
      "text": "With Interstellar, Christopher Nolan has fallen into a trap that has caught many before him: the pitfalls of autonomy."
    },
    {
      "text": "This is a film of great ambition and vision, from a filmmaker who takes risks and gets out of his comfort zone in search of a new way to tell his story."
    },
    {
      "text": "Audaciously ambitious and awesome, it's a speculative, mind-bending sci-fi adventure through the celestial space-time continuum."
    },
    {
      "text": "Overstuffed and sometimes undercooked, it still manages to envelop you in worlds and situations you've never seen before.. with human feelings that can't help but move you."
    },
    {
      "text": "Christopher Nolan's head-spinning blockbuster Interstellar is a super-charged \"what if?\" SCI-FI that treats outer space as a giant intellectual and philosophical playground."
    },
    {
      "text": "It's far from Christopher Nolan's best work, but those rare moments when Interstellar is firing on all cylinders make up for its often inert characters and shaky sentimental storytelling."
    },
    {
      "text": "Much like his hero, Christopher Nolan's goal seems to be to take the humor and wildness out of imagination, to see invention in rigidly practical and scientific terms."
    },
    {
      "text": "A soulful, must-see masterpiece, one of the most exhilarating film experiences so far this century."
    },
    {
      "text": "\"Interstellar,\" a spectacular, redundant puzzle, a hundred and sixty-seven minutes long, makes you feel virtuous for having sat through it rather than happy that you saw it."
    },
    {
      "text": "Even as \"Interstellar\" becomes a beautiful mess, its wannabe-deep impact will hit everyone differently. We need far-reaching artists like Nolan, since, as they say, Earth without art is \"eh.\""
    },
    {
      "text": "\"Interstellar\" deserves credit for aiming for the stars, but the hard realities of filmmaking and storytelling pull it right back to Earth."
    },
    {
      "text": "An impressive, at times astonishing work, and one of a handful by Nolan that overwhelmed me to the point where my usual objections to his work melted away."
    },
    {
      "text": "INTERSTELLAR might not be Nolan's best film, but it's certainly his most ambitious."
    },
    {
      "text": "This is a long film that's constantly worried about time passing, but it's not self aware enough to turn that into a joke"
    },
    {
      "text": "For a film completely drenched with sentimentality about faith, hope and human-kind's resolve, \"Interstellar\" is at times as cold and lifeless as a vacuum."
    },
    {
      "text": "The mix of wonky physics, mysticism, and genetically modified corn is so clunky it's ... fabulous."
    },
    {
      "text": "The script comprises stiff scientific discussion, clunky exposition and cinematic clichés and, frankly, it all gets a bit silly."
    },
    {
      "text": "The final stretch may be just a little too hard to swallow. But fans of smart, spectacular sci-fi will still gulp down this astonishing trip through the cosmos."
    },
    {
      "text": "Space in your face. Beautiful, beautiful space. An awe inspiring journey across the cosmos that travels to the heart of humanity; flaws and all."
    },
    {
      "text": "As the rare director whose singular vision is buoyed by infinite artistic freedom, Christopher Nolan would be derelict if he didn't take gargantuan risks. It's good for us that he does."
    },
    {
      "text": "Dramatically awkward and visually ravishing -- often within the same sequence -- Interstellar is director Christopher Nolan's ninth and most ambitious film to date."
    },
    {
      "text": "Thrilling intellectually and viscerally, full of stirring notions of what humanity is capable of, and full of hope. A wonderfully refreshing sort of SF."
    },
    {
      "text": "As space operas go, this may yet be accounted one of the classics: dream material even."
    },
    {
      "text": "In the end you can only applaud its sheer sense of scale, drama, excitement and willingness to take that extra step."
    },
    {
      "text": "Interstellar begins to feel more like those disaster movies that Irwin Allen used to make, bulging with enough star wattage to keep our eyes on the screen and not rolling to the back of our heads."
    },
    {
      "text": "Whatever his strengths may be, Nolan lacks the human touch."
    },
    {
      "text": "Whereas most science fiction withers out in space, \"Interstellar\" rockets home."
    },
    {
      "text": "The most mind-bending movie of 2014 contains a third act that will be pondered and debated for at least as long as the finale of Stanley Kubrick's '2001: A Space Odyssey.'"
    },
    {
      "text": "Tthe film falters at minor points as the script creaks under the weight of its own ambitions but there are a great many moments in this film where it transcends its genre conventions and achieves a pure cinematic profundity and sense of overwhelming awe."
    },
    {
      "text": "I can imagine, in some other galaxy or dimension, a more exciting Interstellar, one that is more coldly curious about all that lies beyond human perception."
    },
    {
      "text": "A movie I snickered at more than once but never stopped staring at in wonder."
    },
    {
      "text": "It's a sometimes poignant, but more often pandering, ode to American exceptionalism."
    },
    {
      "text": "Nolan's complex story, his most visually pleasing genre piece and arguably his most complex film to date."
    },
    {
      "text": "Brainy, barmy and beautiful to behold, this is Stephen Hawking's Star Trek: a mind-bending opera of space and time with a soul wrapped up in all the science."
    },
    {
      "text": "Double-domed and defiantly serious, Interstellar is a must-take ride with a few narrative bumps."
    },
    {
      "text": "Nolan reaches for the stars in spectacular fashion, delivering a mesmerising sci-fi epic that, despite a testing running time and few too many flights of fancy, is grounded by an on-form McConaughey."
    },
    {
      "text": "The vaulting ambition and shoot-for-the-stars bravery of this latest film from the director of The Dark Knight and Inception is to be admired, but its attempt to cover life, the universe and everything in nearly three hours is rather enervating."
    },
    {
      "text": "Nolan's aesthetically beautiful, large-scale sci-fi drama is admirable in its ideas and style, but lacking in its storytelling and execution."
    },
    {
      "text": "Some of the parts of this mega-fantasy are awesome. The sum of all parts? Not so stellar."
    },
    {
      "text": "Interstellar is an imperfect film, but like its central characters, aims about as high as one can. The ambition, execution, and craftsmanship are all to be admired."
    },
    {
      "text": "The story is ever-ambitious, sometimes riveting and thought-provoking, but also plodding and hokey and not as visionary as its cutting-edge special effects."
    },
    {
      "text": "So few blockbusters have an IQ over 50. It's important to celebrate this one, even if it comes up a little short."
    },
    {
      "text": "Not every film need address the possibility of human extinction with the gung-ho silliness of Armageddon, but at least that was a space adventure. This is a science report."
    },
    {
      "text": "Love or hate Interstellar - or fall, like me, into a wishy-washy middle ground - you will feel like you've been on a grand journey by the end."
    },
    {
      "text": "Nolan thrives in the limbo between logic and emotion."
    },
    {
      "text": "I was moved by Interstellar, and there are stretches where it is as good and as pure as anything Nolan's made."
    },
    {
      "text": "It combines abstruse ideas about gravity, matter and time with old fashioned, hyper-charged family melodrama."
    },
    {
      "text": "The movie is most powerful when it's at its least abstract."
    },
    {
      "text": "Interstellar would be a stunning piece of cinema if you weren't supposed to think about it."
    },
    {
      "text": "Reaffirms Nolan as the premier big-canvas storyteller of his generation, more than earning its place alongside \"The Wizard of Oz,\" \"2001,\" \"Close Encounters of the Third Kind\" and \"Gravity\" in the canon of Hollywood's visionary sci-fi head trips."
    },
    {
      "text": "What pulls you in is its hugely confident architecture as a piece of storytelling - its brave fictitiousness. Nolan comes very close here, one might almost say agonisingly close, to forging his masterpiece."
    },
    {
      "text": "Never less than engrossing, and sometimes more than that."
    },
    {
      "text": "An emotional powerhouse when it isn't hokey, and a stunning spectacle when it doesn't get bogged down in plot logistics, \"Interstellar\" binds its strengths and weaknesses into a riveting whole."
    },
    {
      "text": "A spine-tingling blend of brains and heart, a high concept sci-fi opera that's as unafraid of cerebral ideas as it is of heart-on-sleeve emotion."
    },
    {
      "text": "May represent an apotheosis of sorts, as it illustrates the very best and the very worst of Nolan as a writer-director."
    },
    {
      "text": "Nolan's love letter to space travel and the exploration of the stars may require some patience, but it offers an incredible emotional payoff along with its visual spectacle."
    },
    {
      "text": "It's a movie designed for people who watched the bedroom sequence in 2001: A Space Odyssey and wished there was more exposition about who built the room, how, why and what thread count was on that bed."
    },
    {
      "text": "Nolan's \"Interstellar\" spends hundreds of millions to take the audience on a journey to the farthest parts of the cosmos ... so they can be told sentiments as close, and as cheap, as any of the offerings at your local Hallmark card retailer."
    },
    {
      "text": "A two-pronged blockbuster comprised of smarts and sentimentalism like nothing else out there."
    },
    {
      "text": "Interstellar is not quite a success. I can't insult those involved by grading on an admiration-based curve."
    },
    {
      "text": "A masterful sleek vision of the future, Nolan's epic is a vigorously entertaining piece that stands as one of the best experiences of the year. Immersive, but admittedly overwhelming at times, Nolan controls the film with confidence."
    },
    {
      "text": "A bold, beautiful cosmic adventure story with a touch of the surreal and the dreamlike."
    },
    {
      "text": "There is an odd shallowness that reduces all the intellectual power of this endeavor to a \"you mean, one atom of my fingernail could be an entire universe?\" stoner joke."
    }
  ],
  "release_year": 2014,
  "duration": 165,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action"
  ],
  "age_rating": "PG-13",
  "synopsis": "In Earth's future, a global crop blight and second Dust Bowl are slowly rendering the planet uninhabitable. Professor Brand (Michael Caine), a brilliant NASA physicist, is working on plans to save mankind by transporting Earth's population to a new home via a wormhole. But first, Brand must send former NASA pilot Cooper (Matthew McConaughey) and a team of researchers through the wormhole and across the galaxy to find out which of three planets could be mankind's new home.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg"
}