{
  "movie_name": "It's a Wonderful Life",
  "movie_id": "its_a_wonderful_life",
  "total_reviews": 83,
  "reviews": [
    {
      "text": "Frank Capra's classic is a perfect movie, and almost 80 years on, Jimmy Stewart's masterpiece has lost absolutely none of its magic."
    },
    {
      "text": "\"an enduring classic... timeless\""
    },
    {
      "text": "...earned their climactic waterfall of happy tears..."
    },
    {
      "text": "This is movie that gives you a lot of hope and inspires you to get through the darkest of times. Very effective and such a \"feel good\" movie."
    },
    {
      "text": "I really enjoyed the film despite it being a bit overlong. Jimmy Stewart gives a very endearing and honest performance that stands the test of time."
    },
    {
      "text": "The involvement of Jennifer Jones doesn’t hurt and Joseph Cotten never looked dreamier. If you have ever been attracted to the idea of doomed, obsessive love then this might be for you."
    },
    {
      "text": "It's a Wonderful Life to this day stands as one of the strongest holiday features ever made."
    },
    {
      "text": "Everything about it works and it snugly fits into the category of timeless."
    },
    {
      "text": "Capra, in fact, shrinks, as Ford and Wyler have shrunk, from pursuing the inquiry into human nature; so far as the easy superficial goodness, but no farther."
    },
    {
      "text": "Jimmy Stewart's performance is the reason we keep coming back decade after decade."
    },
    {
      "text": "Capra remained true to classical Hollywood narrative, conceived and directed here, it is true, with almost hallucinatory skill. The scenes of tenderness are capable of penetrating the armor of even the most skeptical critical mind."
    },
    {
      "text": "It is watched over and over by many. A Christmas tradition since 1946."
    },
    {
      "text": "There are a number of fantastic performances in the film, led by Jimmy Stewart. Stewart captures the many faces and phases of George Bailey..."
    },
    {
      "text": "\"One of the most influential films in the history of Hollywood was a box office failure, not winning a single one of the five Oscars for which it was nominated\". [Full review in Spanish]"
    },
    {
      "text": "Forget the Christmas connection: This all-timer can be watched any time of the year."
    },
    {
      "text": "You can really see Capra's feelings come through on the screen after George wishes he had never been born."
    },
    {
      "text": "... It's a Wonderful Life is a story about how being the best version of yourself, the one who looks out for others, is what it means to be a citizen in any town in any state in our country."
    },
    {
      "text": "When watching It's A Wonderful Life it is easy to see that film is a legitimate art form and that Hollywood really doesn't make them like this anymore."
    },
    {
      "text": "Capra enriches his picture with sharp social satire and Dickensesque comments on human behavior. Those who are wearying of Scrooge and Bob Cratchit may find it a closer-to-home version of A Christmas Carol."
    },
    {
      "text": "Like a nice snifter of the Christmas brandy, it warms the heart and makes you feel good."
    },
    {
      "text": "Although it's regularly viewed as a prime example of director Capra's perspectives on the everyman and human ideals, it's a grand accomplishment in romantic comedy."
    },
    {
      "text": "Not only does [It's a Wonderful Life] truly exhume the holiday spirit, but it also reminds you that you should be good to everyone. Even when the world turns you down again and again."
    },
    {
      "text": "Frank Capra's century-defining masterpiece is a treasure of Classical Hollywood cinema."
    },
    {
      "text": "It's just such a joyous picture."
    },
    {
      "text": "The film shows all Capra's strength, in warm and tender detail, and his weakness, in the whimsey that turns real evil to the ogre of a tinselled, happy-ending tale."
    },
    {
      "text": "A movie people will have a good time watching with their families for enduring decades."
    },
    {
      "text": "There's sex and death here, elation and depression, hope and despair."
    },
    {
      "text": "One problem with the film is that it's only in the acquisition of money and the community subjugating their own savings and needs for George, that his rebirth can be complete."
    },
    {
      "text": "Paralyzing joys are the very heart of George Bailey's dilemma; they are, to borrow words from George's father, \"deep in the race.\""
    },
    {
      "text": "While it isn't the best picture to come out of Hollywood this year, nor is it Capra's masterpiece, it tells a good story and its conclusion has a heart-warming effect on the audience."
    },
    {
      "text": "It's a Wonderful Life is a wonderful title for a motion picture about which practically everyone who sees it will agree that it's wonderful entertainment."
    },
    {
      "text": "The inspirational, thoroughly festive ending is guaranteed to bring tears to the eyes."
    },
    {
      "text": "The most well-loved of all Christmas movies."
    },
    {
      "text": "It's both a summation of Capra's own career and a peak of achievement for a gentler kind of American cinema"
    },
    {
      "text": "I love it, corny as it may be, because it reminds every one of us that we all make contributions to the people around us, contributions we ourselves don't even realise."
    },
    {
      "text": "This masterpiece from Frank Capra still has a lot to say about community spirit and is a film with much more to it than feel-good sentimentality."
    },
    {
      "text": "This is the all-time great, curl-up-on-the-sofa-with-a-cup-of-tea movie. Not only is it beautifully photographed, but it also contains enough emotional strength to hold your attention for all of its two-hour running time."
    },
    {
      "text": "It's a Wonderful Life is about hunger. It's about greed. It's about the many ways a good man is stymied. Finally, it's about George Bailey, whose decency prevents him even from killing himself."
    },
    {
      "text": "I wasn't able to get reasonably straight about it for quite a while. I still think it has a good deal of charm and quality, enough natural talent involved in it to make ten pictures ten times as good, and terrific vitality or, rather, vigor."
    },
    {
      "text": "Capra is an old-time movie craftsman, the master of every trick in the bag, and in many ways he is more at home with the medium than any other Hollywood director. But all of his details give the impression of contrived effect."
    },
    {
      "text": "This classic delivers warmth all year long."
    },
    {
      "text": "Is the movie corny? Often. Is it moving in the most basic, moral way? Every year we watch it."
    },
    {
      "text": "One could use It's a Wonderful Life to teach their children values: compassion, selflessness, loyalty, and self-respect."
    },
    {
      "text": "Raise your hand if you think 'It's A Wonderful Life' is mushy, sentimental, over-praised hokum. Now, go to your room. Both of you."
    },
    {
      "text": "If you can separate - or rescue - It's a Wonderful Life from its niche as a Christmas classic, you might discover a film that swings wildly from noirlike starkness to saccharine bathos."
    },
    {
      "text": "A genuine American classic."
    },
    {
      "text": "You'd have to possess a very hard heart not to find something to love in this story."
    },
    {
      "text": "It ain't just hype; it really is a true holiday classic."
    },
    {
      "text": "Without overlooking its lapses into populist bathos, it's necessary to rescue It's a Wonderful Life from its spot at the centerpiece of untouchable American \"classics.\""
    },
    {
      "text": "George Bailey and Bedford Falls never looked so good!"
    },
    {
      "text": "The epiphany of movie sentiment and a transcendent experience."
    },
    {
      "text": "The April-air wholesomeness and humanism of this natural bring back vividly the reminder that, essentially, the screen best offers unselfconscious, forthright entertainment."
    },
    {
      "text": "History vindicated Capra: Though failure at the time of release, the superbly acted film (terrific Jimmy Stewart) is recognized today as undisputable masterpiece; the film's message didn't fit the disillusioned mood of the country right after WWII"
    },
    {
      "text": "As warm and comforting as a scarf knit by Grandma."
    },
    {
      "text": "Deserving of one viewing per year, preferably without the interruption of commercials."
    },
    {
      "text": "Funny, compelling and moving."
    },
    {
      "text": "Not only as one of the best Christmas movies, but THE Christmas movie."
    },
    {
      "text": "By now everyone knows Frank Capra's holiday classic and the tears it so effortlessly conjures up year after year -- but it's easy to forget how truly vicious the film is, and how brilliantly James Stewart rises to the challenge."
    },
    {
      "text": "As God as my witness, I get teary eyed every time Harry Bailey offers that toast to his \"big brother, George. The richest man in town.\""
    },
    {
      "text": "The film's entire premise can be summed up with a bit of text from the film: \"Remember, George: no man is a failure who has friends.\""
    },
    {
      "text": "Director Frank Capra's perennial plum."
    },
    {
      "text": "Frank Capra's classic bittersweet comedy/drama plays as a testament to the family values of small-town America just after WW11."
    },
    {
      "text": "Often remembered as sentimental holiday-themed 'Capra-corn'... but in fact leavened by darker themes and a more rigorous moral about self-sacrifice."
    },
    {
      "text": "If you don't cry at this Capra classic, you probably don't have tear ducts...."
    },
    {
      "text": "Sometimes we need sweetness, like when we've just eaten a ration of bitter Neil LaBute or Ridley Scott movies."
    },
    {
      "text": "Resistance is futile."
    },
    {
      "text": "Surprising when actually analyzed. It's mostly buildup and only the last half hour is the ghost story. But it works."
    },
    {
      "text": "As the hero, Mr. Stewart does a warmly appealing job, indicating that he has grown in spiritual stature as well as in talent during the years he was in the war. And Donna Reed is remarkably poised and gracious as his adoring sweet-heart and wife."
    },
    {
      "text": "It suits a lot of people, but I find it hypocritical and false."
    },
    {
      "text": "This sentimental perennial is a holiday chestnut."
    },
    {
      "text": "There are hokey moments galore and the ten minutes preceding the final five are almost too corny but nothing can diminish the overall effect of this heartwarming tribute to an ordinary man."
    },
    {
      "text": "Despite any nay saying that I might work up, I enjoy watching the film. It has an uncanny ability to silence cynics like myself."
    },
    {
      "text": "The story not only stands strong half a century later, but it continues to show up today's formulaic Hollywood films for the vacuous use of celluloid that they are."
    },
    {
      "text": "It's a Wonderful Life achieves a fine balancing act between pathos and feel-good that is delivered by an outstanding cast."
    },
    {
      "text": "a truly classic, timeless film, one of the few that quite simply never grows old"
    },
    {
      "text": "The enshrinement of the greatest Twilight Zone episode never made as a yuppie icon and feel-good weepie overlooked the fact that it's one of the darkest, most self-abasing stories ever told in Hollywood."
    },
    {
      "text": "Although sometimes bordering on the maudlin, it remains a beautifully uplifting story and a sweet little comedy as well."
    },
    {
      "text": "What is remarkable about It's a Wonderful Life is how well it holds up over the years; it's one of those ageless movies, like Casablanca or The Third Man, that improves with age."
    },
    {
      "text": "It's A Wonderful Life (1946), originally made for Liberty Films, is one of the most popular and heartwarming films ever made by director Frank Capra. Frank Capra regarded this film as his own personal favorite - it was also James Stewart's favorite"
    },
    {
      "text": "Combine the characters, the story, the message, and the acting, and it's easy to see why It's a Wonderful Life isn't just a holiday favorite, but a great movie by almost any standards."
    },
    {
      "text": "This great American fable is buoyed by its unwavering faith in the wealth of the human spirit."
    },
    {
      "text": "It isn't a terrible film by any means, and it's easy to see why people revere it."
    },
    {
      "text": "It's a gem for any time of the year and, as such, a vital part of any film fan's collection."
    }
  ],
  "release_year": 1946,
  "duration": 129,
  "genres": [
    "Holiday",
    "Comedy",
    "Drama"
  ],
  "age_rating": "PG",
  "synopsis": "After George Bailey (James Stewart) wishes he had never been born, an angel (Henry Travers) is sent to earth to make George's wish come true. George starts to realize how many lives he has changed and impacted, and how they would be different if he was never there.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/bSqt9rhDZx1Q7UZ86dBPKdNomp2.jpg"
}