{
  "movie_name": "Joker",
  "movie_id": "joker_folie_a_deux",
  "total_reviews": 363,
  "reviews": [
    {
      "text": "a courtroom drama, musical hybrid that puts the Joker character and Joker the film itself on trial. Sadly, and surprisingly, this is conducted in quite safe fashion, the more inflammatory elements of Joker a distant memory"
    },
    {
      "text": "Todd Phillips delivers an inspired, thought provoking and challenging sequel that works so well until it completely falls apart in its final third with confounding character choices and plot resolutions and a final twist that insults fans of 2019's JOKER."
    },
    {
      "text": "There’s little to zero point to any of it! Ask me what this sequel produces for the people who wanted more of the brilliant chaos from the original, and I’d have to think on it while trying to decipher if a shoulder shrug would suffice as an answer."
    },
    {
      "text": "I found it enthralling, a bold genre mix ... [and a] subversion of expectations for a sequel, giving us not another gleeful retaliation against the slings and arrows of a mixed-up, muddled-up, shook-up world but a meditation between outer and inner selves"
    },
    {
      "text": "Joaquin Phoenix, an Academy Award winner for Arthur Fleck, delivers another powerful performance in Joker: Folie à Deux."
    },
    {
      "text": "Seeking a minority opinion? Here’s one: Joker: Folie à Deux is superior to 2019's Joker in just about every way. There’s still plenty that’s wrong with it, but it’s no wonder incel supporters of the first film as well as fanboy critics hate it."
    },
    {
      "text": "It starts out as a twisted, exhilarating love story between Joker and Lee, which is then forced to make room for a dull courtroom drama that mostly discusses the events of the first film."
    },
    {
      "text": "A failed musical courtroom melodrama, whose bloated agenda betrayed Phoenix’s singular creation, a living entity of its own, haunting the popular mythos, which is possibly the worst thing storytellers can do."
    },
    {
      "text": "When all is said and done, you may catch glimpses of the ambitious vision that Phillips had for this eagerly-awaited sequel, but it also becomes quite clear that he went a little overboard with his approach and tried to do far too much with it."
    },
    {
      "text": "Phoenix doesn’t execute a single successful soft-shoe routine."
    },
    {
      "text": "Joker: Folie a Deux is a masterpiece. Not a once-in-a-generation masterpiece but an ambitious and emotionally intelligent film that challenges everything it touches."
    },
    {
      "text": "A tedious legal drama bolstered by dull musical numbers that lacks the audacity of its predecessor. [Full Review in Spanish]"
    },
    {
      "text": "Longer than it should be (it clocks in at 138 minutes), “Joker: Folie a Deux” is toilet paper on the shoe of a film that had a unique rhythm and an original point of view."
    },
    {
      "text": "How dark and depressing is this movie? Let’s put it this way: If “Seven” had musical numbers, it might get to where “Joker: Folie à Deux” has set up shop."
    },
    {
      "text": "Joaquin Phoenix and Lady Gaga give incredible performances as the Joker and Lee, but the overall story feels more like an Epilogue and not a standalone film."
    },
    {
      "text": "It felt like it was trying to be too many things all at once and didn't accomplish them. Having said that, Phoenix is always good."
    },
    {
      "text": "I was often bored, occasionally disgusted and only mildly entertained."
    },
    {
      "text": "As well-made as the 2019 original but without any of its intelligence or mystery."
    },
    {
      "text": "Folie a Deux is a 138-minute journey with a miserably empty payoff. To sing its praises would be a delusion."
    },
    {
      "text": "The desire to break with the established order seems to me to be a bad joke made by awful people who hate the Joker. [Full review in Spanish]"
    },
    {
      "text": "Certain musical numbers are better than others, and the idea of why this is happening makes sense, but it begins to feel repetitive and unnecessary as we progress through this sequel that feels more like an extended epilogue."
    },
    {
      "text": "Fans wanted the film to be one thing, and director Todd Phillips gave them another. That’s his creative right, and for me it worked beautifully."
    },
    {
      "text": "Whatever specialness Joker can lay claim to—it doesn’t appeal to me, but I recognize it works for a lot of people—is gone in Folie à Deux. It feels like a money grab, like any number of superhero sequels cashing in on a hit."
    },
    {
      "text": "While attempting to juggle multiple genres—a courtroom drama, a depressive musical, a twisted love story, and a social satire—it ultimately collapses under the weight of its own ambitions."
    },
    {
      "text": "If you've been hanging out for the most depressing musical of all time, rejoice, that moment has arrived!"
    },
    {
      "text": "Joker: Folie a Deux has some visual flair, but that doesn’t make up for the plodding pacing over two hours and eighteen minutes, or its cursory examination of fame. It’s a folly that rings hollow."
    },
    {
      "text": "The joke is on me because I really enjoyed it."
    },
    {
      "text": "Joker Folie A Deux is more of an epilogue than a sequel.\n\nMuch of the film lives shadow of its predecessor, both in the subversive narrative and meta commentary.\n\nThe musicals, while fun, can shift tone abruptly. Just doesn't recapture the magic."
    },
    {
      "text": "Why anyone thought this would work as a musical is absolutely baffling, especially when your male lead actor can’t carry a tune."
    },
    {
      "text": "When everyone's a victim first, no one wins. When it's also the central premise of your movie, it tends to spiral into a self-pitying mess."
    },
    {
      "text": "Bold and daring, Joker: Folie a Deux is also deluded. It's a ridiculous misfire that takes an awful long time to get nowhere and struggles to say anything coherent along the way."
    },
    {
      "text": "A vague and incoherent bummer of a film that even the dedication and charisma of Lady Gaga and Joaquin Phoenix can't redeem."
    },
    {
      "text": "The addition of Joker: Folie à Deux being a jukebox musical is a nice idea... but as a thematic touchstone to Arthur’s possible mental illness it feels like a thin thread that never unspools into anything emotionally resonant."
    },
    {
      "text": "Set on tediously considering its predecessor, Joker: Folie à Deux offers nothing to the franchise."
    },
    {
      "text": "The filmmakers haven't learned anything from their previous efforts when it comes to respectful portrayals of physical and mental disability."
    },
    {
      "text": "I'm sensing that down the road, years after the outrage has died down, this imperfect, fascinating film will be rife for rediscovery. Now is not its time."
    },
    {
      "text": "\"A slog through two hours of vaguely comic-tented nihilism that manages to render both itself and its predecessor utterly pointless.\""
    },
    {
      "text": "A $200M anti-joke with one grand statement: some films shouldn't have sequels. Ironic? Sure. But what could be more Joker than taking a feature-length piss? The joke is on us."
    },
    {
      "text": "By swapping the Scorsese-inspired streets of ‘70s New York for a courtroom drama, Folie a Deux not only fails on its own terms, but manages to expose the hidden flaw at the center of Joker in the process: Arthur Fleck was never an interesting character."
    },
    {
      "text": "It is not good. But it is art. And for that, it should be celebrated. Even while being wholeheartedly not recommended."
    },
    {
      "text": "There must be a Venn diagram middle section of people who love both edgelord internet philosophy and visual nods to The Umbrellas of Cherbourg, but you need a microscope to find it."
    },
    {
      "text": "Like Arthur Fleck, I fantasize about a world where this movie was never made .. and I dance and sing a lot in that world."
    },
    {
      "text": "Without the fresh novelty of Phoenix’s portrayal of the Joker, spending time with his character becomes a tiresome, tedious experience."
    },
    {
      "text": "...a perpetually subdued endeavor that falls right in line with its equally low-key predecessor..."
    },
    {
      "text": "Todd Phillips would rather set fire to his own franchise than let the wrong people take inspiration from it."
    },
    {
      "text": "Phillips throws himself into the void with explicit but less substantial influences on the history of musical cinema."
    },
    {
      "text": "I walked out of the theatre with a big smile while humming show tunes. I enjoyed this musical multiverse monstrosity, and Lady Gaga is simply dazzling. However, the target audience is not anyone who enjoyed its predecessor."
    },
    {
      "text": "There is no doubt that Lady Gaga and Joaquin Phoenix put on a compelling dance, but the whole is not greater than the sum of the parts. You might love the acting, singing, and courtroom theatrics but all of that didn’t have me singing all the way home."
    },
    {
      "text": "Joker is a story of grinding miserabilism, livened by a few scenes of joyful violence."
    },
    {
      "text": "A colossal mess. It isn’t a “fascinating failure” but rather an infuriating one."
    },
    {
      "text": "Dramatically inert, devoting 138 very deliberate minutes to revealing what was undeniable from the first film."
    },
    {
      "text": "Muddled, messy, and unfocused, Folie à Deux could have been compelling and powerful...but that would have required a different director...and a lead with more interest this time around. Sidenote: Needed more Gaga."
    },
    {
      "text": "There are moments when it works... but the overall story, doesn't feel much of a story."
    },
    {
      "text": "“Joker: Folie à Deux” is bad but at least Phillips tried something new."
    },
    {
      "text": "It is a very strange film... and I mean that as a compliment."
    },
    {
      "text": "The film’s biggest hobbling is that its tonal and contextual (and textual) shifts don’t click."
    },
    {
      "text": "The falloff in quality from \"Joker,\" a genuinely searing innovation in comic-book movies, to this one is so steep that it’s comparable to the dropoff between “The Hangover” and “The Hangover Part II.”"
    },
    {
      "text": "It made me long for the Joker from my childhood. At least he was fun and had sneezing powder."
    },
    {
      "text": "Phillips has made a bold and innovative film for which he should be roundly congratulated. The film is more modern thematically than so much of what the motion picture studios toss onto theater screens these days. It dares to be different."
    },
    {
      "text": "Its approach wasn't a bad idea, the problem is that the musical numbers are poorly conceived and implemented as if they were making it up as they went along."
    },
    {
      "text": "The singing didn't bother me, and one or two narrative twists left me mildly shocked. But nothing in this film manages to top what was done in the first instalment, instead making the events of that film feel sadly irrelevant. Full review in Spanish."
    },
    {
      "text": "While I respect the movie's bold swings and found it to be visually mesmerizing, in the end it plays like an unsatisfying epilogue to the first film."
    },
    {
      "text": "“Joker: Folie à Deux” is a film that takes bold creative risks. While it may not hit every mark, the solid performances and daring direction make it a compelling watch."
    },
    {
      "text": "Joker: Folie à Deux promises to be a mad romp that celebrates one of DC Comics’ most notorious couples."
    },
    {
      "text": "It’s impossible to repeat the shocking transformation we saw in the first film. But in Joker: Folie à Deux Phillips and his stars create something just as dark and fascinating."
    },
    {
      "text": "Joker: Folie à Deux holds immense technical and artistic merit, but it fails to replicate the success and impact of the original."
    },
    {
      "text": "A good movie could have been made out of the elements in Joker: Folie à Deux, including the musical numbers. Unfortunately, Todd Phillips was never the guy to direct it."
    },
    {
      "text": "In the end works as a decent installment. [Full review in Spanish]"
    },
    {
      "text": "Phillips stays on the surface and lends them little physicality, little flair to match the songs..."
    },
    {
      "text": "Because both Fleck and his followers suffer from genuine social and economic injustices, the movie shows a willful determination from all parties (led by Gaga's firecracker Quinzel) to embrace Fleck's delusion a la folie à deux."
    },
    {
      "text": "Folie a Deux functions as an overlong, pretentious coda – a slog that barely advances the narrative while regurgitating elements from the first film"
    },
    {
      "text": "Overlong but more finely tuned than the 2019 genre-bending drama, this sequel inventively swirls around musical sequences that use timeless standards to dig into the mentally unhinged fantasy lives of two central characters."
    },
    {
      "text": "Where the original was a problematic but nonetheless well-made film, Joker: Folie à Deux could be a viable prescription for insomniacs."
    },
    {
      "text": "Not a bad movie per se but its accumulation of ideas that never fully flesh out works against itself from beginning to end, delivering a colorful mess that feels like such a big misfire."
    },
    {
      "text": "A frustratingly obtuse courtroom musical ... Yes, you read that right: courtroom musical. And it's insufferable."
    },
    {
      "text": "Todd Phillips’ sequel is an empty, overly ambitious and superficial film full of mundane musical numbers that won’t ever freaking end."
    },
    {
      "text": "While the intention is easy to admire, the execution remains disappointing. [Full review in Spanish]"
    },
    {
      "text": "FOLIE Á DEUX may mean this iteration of the Joker leaves cinemas with a whimper, but at least it finally had something to say with its dying breath."
    },
    {
      "text": "Todd Phillips the rip-off king is at it again."
    },
    {
      "text": "It’s a testament to Gaga’s weapons-grade charisma and star quality that despite all this, Lee’s scenes are electrifying and she lands every last line like a punch."
    },
    {
      "text": "I respect the visuals, I respect the performances but... nah."
    },
    {
      "text": "In many ways, Joker: Folie a Deux is a better film than its predecessor. It’s at least more willing to subvert expectations. Yet the weaknesses are unignorable and Phillips cannot help but shoot himself in the foot."
    },
    {
      "text": "At a runtime of nearly two and half hours, it's likely audiences will get anxious. \nVisually Phillips succeeds in bold, striking theatrics. But sadly, any good in this movie is going to be overshadowed by the bad."
    },
    {
      "text": "The mood, the look, and the stylings of this film mimic the first but feel at times like a pale imitation, continuing to tell a story that was potent and powerful enough without the need for further elaboration."
    },
    {
      "text": "There are pacing issues, not all the musical numbers work, the film drags on unnecessarily, but Phillips achieves his goal. [Full review in Spanish]"
    },
    {
      "text": "The forward motion of the story is so minimal, and so broken up by long stretches of musical stasis, that the result barely feels like a movie."
    },
    {
      "text": "This film explores the post-truth of its characters, offering a surreal and musical journey through the consciences of those who may be considered villains, but may also be deprived of familial, social, and institutional support. [Full review in Spanish]"
    },
    {
      "text": "Miserable it is..."
    },
    {
      "text": "A risk is that there are so many borrowings that Folie à Deux is more a collage than a film, but Phillips’ bizarre, admirable ambition scotches any chances of a Joker franchise by following through to a logical conclusion."
    },
    {
      "text": "I found the film to be just as gritty and as moving as its predecessor, with huge performances from its two stars."
    },
    {
      "text": "Joker: Folie á Deux is the rare movie that genuinely feels like it was made for nobody."
    },
    {
      "text": "Like a clown strumming a sad song, this \"Joker\" is a major bummer."
    },
    {
      "text": "An unnecessarily prolonged joke is worse than one told twice. Both things happen here. [Full review in Spanish]"
    },
    {
      "text": "There's a thin line between complex and confused and Joker: Folie à Deux never gets a handle on that line, leaving the impression of a film with something to say but is either not sure of what that something is or how, exactly, to say it."
    },
    {
      "text": "Phoenix is a mighty fine actor, but this Joker feels more like an ego project for him and Phillips, rather than a film for fans."
    },
    {
      "text": "... A daring leap into the abyss that disassociates itself from the first installment. [Full review in Spanish]"
    },
    {
      "text": "There isn’t an ounce of chemistry between our leads, and this shaky sequel spends most of its time dancing around in circles."
    },
    {
      "text": "Joker: Folie à Deux has nothing interesting or relevant to say, seems to resent its existence, and wastes its performers. Phoenix doesn’t even look like he wants to be there. And frankly, we have to agree."
    },
    {
      "text": "This is a remarkable film. Its originality and audacity, along with the extraordinary lead performance, are what, for this viewer, keeps movie-making alive."
    },
    {
      "text": "Phillips uses  the Joker as the Trojan Horse to hide his concept because otherwise no studio would back an art house film about some sad sack guy who finds love and acceptance by committing brutal murders but loses himself in all the ensuing hype"
    },
    {
      "text": "The best way to face Joker: Folie A Deux is to go into it expecting something very, very different. By all means be entertained, be impressed but also be prepared for a finale that may not leave you completely fulfilled."
    },
    {
      "text": "“Joker: Folie a Deux” is the most daring film to come out of a Hollywood studio this year."
    },
    {
      "text": "What a waste."
    },
    {
      "text": "My dour prediction wasn’t too far off the midway: Todd Phillips’ combined self-immolation and sustained “---- you” to audiences that plunked down their hard-earned is wholly in line with his lifetime of self-anointed punk attitude."
    },
    {
      "text": "With nothing left to pillage from Scorsese and all his best ideas behind him, Phillips and his film are adrift and directionless. Although the meet-cute between Fleck and Quinzel is well-staged, the film has nowhere to go afterwards."
    },
    {
      "text": "Great performance by Joaquin Phoenix, but the film is bogged down by unnecessary jarring musical numbers."
    },
    {
      "text": "If you thought the gags in Joker were bad, Folie a Deux chokes, sputters, and flat lines to no applause."
    },
    {
      "text": "Ultimately worth a look, but loaded with problems"
    },
    {
      "text": "Repetitive, shallow and clunky."
    },
    {
      "text": "The jokes may still fall flat, but that doesn’t mean the punchline does not land."
    },
    {
      "text": "This sequel reimagines the dynamic between Joker (Joaquin Phoenix) and Lady Gaga’s Harleen Quinzel, flipping the script on their relationship. Todd Phillips delivers another thought-provoking film, one that distances itself from traditional DC properties."
    },
    {
      "text": "To dismiss the film for not meeting expectations is to miss its point entirely. It’s precisely in subverting these expectations that Joker 2 achieves its most profound impact, asking us to examine not just what we want from our art, but why we want it."
    },
    {
      "text": "...registers most strongly as a tragic character study."
    },
    {
      "text": "Undoing much of the goodwill from its predecessor, the sequel convolutes what could have been a unique character study into a bloated encore that goes out with a whimper."
    },
    {
      "text": "Joker: Folie À Deux is a derivative, less sophisticated rehash of the previous film with unnecessary musicals and a dash of comic book spice that still leaves the film flavorless."
    },
    {
      "text": "The ending of Joker: Folie à Deux ... is a total condemnation of the allure the people have towards Joker the icon over the broken human underneath the makeup."
    },
    {
      "text": "Joker: Folie à Deux is a movie horrified by its predecessor, horrified by its success, its maddening cowardice to pick a lane, its public misinterpretation forged into perverse celebration of a lunatic with a bone to pick."
    },
    {
      "text": "This movie is a disjointed mess and a waste of time. It's just tired, not particularly interesting, but it does look good from a production design standpoint."
    },
    {
      "text": "Everything was teed up for \"Joker: Folie a Deux\" to be a massive success. It ends up being one of the most egregious misfires in recent movie memory."
    },
    {
      "text": "Gaga and Phoenix are great, but the audacious musical character study 'Joker: Folie à Deux' doesn’t really go anywhere."
    },
    {
      "text": "The best thing I can say about it is that it clearly does not take marketing, as it’s conventionally understood, into consideration."
    },
    {
      "text": "An amazing idea on paper, however Phillips can’t help but continually call back to the stylized imagery of the first film, which somewhat undermines his thesis and ultimately rings hollow."
    },
    {
      "text": "It's the Singin' in the Rain gag from Clockwork Orange stretched to two hours."
    },
    {
      "text": "The mere existence of Joker: Folie à Deux is a complete betrayal of what came before, by someone who outwardly acknowledges (albeit in a pretty nasty manner) that a sequel to a solid one-off like the one he made is not a good idea."
    },
    {
      "text": "There are parts where it seems like Joker: Folie à Deux is going to work. The musical numbers stop the movie in its tracks. There is not enough choreography or production to make them memorable."
    },
    {
      "text": "Through it all, Phoenix uses cigarette smoke like an Olympic gymnast’s ribbon, buoyed along by a tide of confusion and cheers."
    },
    {
      "text": "I’m taken by the audacity of it, that Todd Phillips is engaging with concerns from the first time out, and refusing to satisfy fan expectations. Too bad it's so dull."
    },
    {
      "text": "Joker: Folie à Deux plays out as an underwhelming, unwanted epilogue to a film that did not need one. The film represents the traps of franchises, sequels, and IP. Sometimes, there is value in leaving well enough alone and quitting while you’re ahead."
    },
    {
      "text": "By the end, it really feels like the joke is on the viewer, and as a viewer I didn’t appreciate that."
    },
    {
      "text": "This is at times a thunderously dull film, listlessly limping its way through a leaden script that never quite commits to a reason for its existence."
    },
    {
      "text": "It’s a bold and audacious concept for a sequel and your mileage may vary on how well it works, but I’ll take what is ultimately a slap in the face to reasonable expectations over yet another samey comic book adaptation."
    },
    {
      "text": "It doesn't matter if he's really Arthur or the Joker. It doesn't matter if he wins his trial, it doesn't matter if society is broken. It doesn't matter if he gets the girl. It doesn't matter if he dies. And it doesn't matter if you see this movie."
    },
    {
      "text": "There’s barely any plot progression until the cobbled-together third act, and none of the throwback tunes will have you singing along."
    },
    {
      "text": "The creative swings hit more than they miss, making this a sequel that manages to stand on its own as a solid experience."
    },
    {
      "text": "Our attention follows the protagonists, who are driven by the director with energy, verve, and emotional commitment, also through some splendid musical scenes. [Full review in Spanish]"
    },
    {
      "text": "Todd Phillips knows how to put the HA into being a hack."
    },
    {
      "text": "If anything, Phillips is found guilty of his own count of murder by slaughtering the quality of his work."
    },
    {
      "text": "A creative surprise with a lot of gumption, even if it doesn't achieve the excellence of its predecessor. [Full review in Spanish]"
    },
    {
      "text": "Lady Gaga shines and Joaquin Phoenix brings more of the same to Joker: Folie à Deux, a wholly unnecessary sequel with no new ideas and nothing to say. It doesn’t work as a movie or a musical. What a waste of $200 million."
    },
    {
      "text": "The outstanding performances in this musical/psychological thriller can’t save the film from itself. The movie is overly aimless, self-indulgent, and miserable in the hopes that the audience will forget that it doesn’t seem to have a plot."
    },
    {
      "text": "The musical performances are underpowered, lacking much movement, personality, or surprise. In fact, the film’s problems are so glaring that one can’t help but wonder about what happened behind the scenes."
    },
    {
      "text": "With shortcomings of a hap hazard plot line, and awkward pacing in this too long film, Phillips curiously uses brutal violence with songs. Despite Phoenix, once again, unleashing his dynamic Joker, there are no heroes or villains, so the joke’s on us."
    },
    {
      "text": "A self-indulgent, borderline pompous mess."
    },
    {
      "text": "All these efforts to be unconventional and further push the boundaries of comic book movies produce a haphazard and repetitive picture with too many musical interludes and the most unexciting approach to two of comic’s most fascinating personalities."
    },
    {
      "text": "Phoenix and Gaga give it their all, but whatever worked in the original simply doesn't here; this sequel is a long bummer of a songfest that makes us question why we're even watching this character."
    },
    {
      "text": "As follies go Folie à Deux is dull and underwhelming."
    },
    {
      "text": "The joke’s on us. Promising twice as much star power as the frantic 2020 Oscar competitor, Joker, the musical sequel Joker: Folie a Deux is half as entertaining and three times more irritating."
    },
    {
      "text": "This could have been so much better."
    },
    {
      "text": "There’s room for all these ideas in this expansive world, and this is a ride worth taking with Arthur Fleck and Lee Quinzel."
    },
    {
      "text": "Why so serious, Phillips seems to be saying, in this follow-up. Relax, it’s all entertainment. The challenge, however, is that Joker: Folie à Deux is more ponderous rather than acting as a riposte."
    },
    {
      "text": "This sequel is more than crazy this time around- it's absolutely bonkers!\nWhat isn't bonkers is Joaquin Phoenix and inhabiting this character"
    },
    {
      "text": "Joker and Lady Gaga fans will surely find moments to enjoy, but they're likely to leave the theater feeling pranked."
    },
    {
      "text": "As much as I hated the first one, this one works for me."
    },
    {
      "text": "There are far too many moments in Folie À Deux where it feels like the filmmaker isn’t even trying."
    },
    {
      "text": "Ultimately, it’s a wild experiment that mostly falls flat."
    },
    {
      "text": "It's about loneliness, victimization, the class system, and, most importantly, how psychosis has been turned into another form of celebrity in American culture from our obsession with film, TV, and comic antiheroes to true crime to tribalism in politics."
    },
    {
      "text": "Joker: Folie a Deux is a lifeless creative operation."
    },
    {
      "text": "Turgid with misery, it’s basically the jukebox musical from hell."
    },
    {
      "text": "Folie à Deux’s messaging doesn’t come off as artfully ambiguous, just so mixed that it could support any interpretation."
    },
    {
      "text": "Joker 2: Folie à Deux is not a straight-and-narrow musical. It is, for better than worse, twisted. [Full review in Spanish]"
    },
    {
      "text": "...best seen as the punchline to Joker’s set-up, presenting us with the full story of this particular take on the character’s downfall while accurately summing up everything that... sucks about comic book movies, film culture, and audience expectations."
    },
    {
      "text": "Fleck may not be able to live up to the expectation of others, but it's Phillips's Joker: Folie à Deux that sings the most disappointing tune."
    },
    {
      "text": "Phillips’ premise is a half-baked romance, a yawning courtroom drama and an imbalanced musical."
    },
    {
      "text": "“Folie à Deux”…. doesn’t play like a fully realized sequel. It’s more akin to an extended epilogue that follows the events from “Joker”. But the differences between the two films are significant and somewhat confounding."
    },
    {
      "text": "Torch Song Triviality. Some of the musical numbers are interesting, but the sequel lacks a narrative theme or sense of cohesion. If the first Joker movie was lightning in a bottle, this one's a short-circuit."
    },
    {
      "text": "But this is the overall issue with Folie a Deux. It takes good ideas and refuses to run with them, forever shying away from the big moment or the leap of faith."
    },
    {
      "text": "It's boring, it's bizarre and it doesn't have enough Lady Gaga. It's not for comic book lovers, it's not for Little Monsters and it's not for fans of Joker. Honestly, it's just plain weird."
    },
    {
      "text": "There are Todd Phillips movies where he proves himself a great filmmaker and others where he proves himself a great businessman. Joker was the first kind, Joker: Folie á Deux is the second kind."
    },
    {
      "text": "Phoenix and Gaga try to save the day with daring performances but instead, they - along with the rest of the film - land face first into a pool of disappointment."
    },
    {
      "text": "Joker: Folie à Deux can't escape the sense that it's just trying to get a rise out of its audience. Which is a shame, because it could have been a simple, sweet weirdo love story."
    },
    {
      "text": "Joker: Folie à Deux is a failed experiment that squanders its promising concept and stellar cast on a lackluster and overly dour vision. Musicals may not be everyone’s cup of tea, but Joker: Folie à Deux managed to make the genre mind-numbingly boring."
    },
    {
      "text": "Folie à Deux struggles desperately for energy and for emotion, but simply never finds it."
    },
    {
      "text": "Once we get past the provocation of a musical, Joker: Folie à Deux is timid to a fault, a film that hides its lack of conviction and ideas in a conceit it half-heartedly explores"
    },
    {
      "text": "Joker: Folie à Deux is a product of wild, aimless ambition, the sort of mad swing that would be laudable if it weren’t so absolutely awful. It falls flat as a musical, as a courtroom drama, as a romance and as a character piece."
    },
    {
      "text": "The decision to turn the sequel into a musical-slash-courtroom-drama is as perplexing as it sounds—and the results are so bad, they’re actually fascinating..."
    },
    {
      "text": "Rarely does a film plod along with such reckless abandon toward the idea that anyone is supposed to enjoy what they’re watching."
    },
    {
      "text": "Folie A Deux is a jukebox musical that fails to hit the high notes of the original."
    },
    {
      "text": "With Folie à Deux, Phillips gives fans a come-down that essentially punishes them for enjoying the volatile energy of the first film. It's more a corrective than a sequel, a Go Directly to Jail card in movie form."
    },
    {
      "text": "Joker: Folie à Deux is a rather dull let down after the brilliance of its predecessor."
    },
    {
      "text": "Folie à Deux is similarly far too involved in staging magnificent-looking sequences to chase its ambitions...the movie never gets there, leaving us with stunning visuals and an exploration of psychosis as limp as one of Arthur’s jokes."
    },
    {
      "text": "Those looking for familiar versions of Harley Quinn or Joker will remain disappointed as these are some low IQ stand-ins that, even in their musical fantasies, still seem pretty drab and dull."
    },
    {
      "text": "Phillips never pays off the promise of an extravagant song-and-dance spectacle, a full-blown Batman musical."
    },
    {
      "text": "The sequel to one of the most resounding successes of the last 20 years shatters its own pedestal with an exercise in neurotic unhealthy glee. [Full Review in Spanish]"
    },
    {
      "text": "As badly misconceived a movie as I can remember seeing."
    },
    {
      "text": "The blend of psychological drama with musical elements comes off as a failed experiment. It isn’t a terrible film, but it falls far short of the expectations set by its predecessor. Keeping expectations low for this unnecessary sequel might be wise."
    },
    {
      "text": "It’s all immaculately staged and performed, but a bit of a drag. After well over two hours of this, it’s hard to shake the feeling that the joke may be on us."
    },
    {
      "text": "The confusion is never dispelled. Portions of Joker: Folie a Deux are insanely incoherent. If that is meant to convey the convolutions inherent in the workings of two damaged minds, it does not quite work."
    },
    {
      "text": "If Joker was a dark comedy, then Folie à Deux is its dreary, tragic twin with a frown stuck on its face. It’s a sour note for this franchise to end on but a great reminder that, eventually, all comedians bomb."
    },
    {
      "text": "This edition of Joker may not entirely work, but it's daring, ambitious, and ungainly in crazy ways. Phillips' bold choices don't all pay off, but they beat the fan-serving rehash that might have been."
    },
    {
      "text": "It’s as if Phillips and Silver’s Joker: Folie à Deux fell victim to their own delusions of grandeur"
    },
    {
      "text": "'Joker 2' is in its own way a kind of commercial suicide, leaving the feeling that Todd Phillips and Phoenix wanted to turn the page and say goodbye forever to Arthur Fleck (Full Review in Spanish)"
    },
    {
      "text": "[Joker: Folie à Deux is] a correcting of the record that exists more for its creator than its audience, an unnecessary skin-tag hanging off the original. And, most importantly, it's boring"
    },
    {
      "text": "Here’s a sequel we didn't need, trapping Phoenix and the glorious Gaga in a joyless musical retread that sucks the life out of the party. Says she to Joker during a fantasy scene, \"Come on, baby, let's give the people what they want.\" I'm still waiting."
    },
    {
      "text": "It casts Lady Gaga—one of the world’s biggest pop stars—but fails to provide her with the runway or screen time necessary to showcase her talents; she doesn’t even have her own solo, show-stopping number."
    },
    {
      "text": "So, whether the movie is some middle finger by Phillips to the world or just a meaningless rambling, the joke really is on us."
    },
    {
      "text": "Phoenix and Phillips go for broke again with a sequel that is equally bold and daring — not least in the way that it doubles down on the first film's rejection of Hollywood's usual comic-book playbook."
    },
    {
      "text": "A boldly unconventional blockbuster that feels at once as disposable as any, yet has these tiny, almost irritating threads that when pulled upon reveal method to the madness. In this day and age, it seems, that’s entertainment."
    },
    {
      "text": "“Joker: Folie à Deux” soars when it goes full-on musical, and bores with its thin story when it doesn’t."
    },
    {
      "text": "Uncertainty is the best element of the film, which sees the performances kicking off at angles when you least expect them to."
    },
    {
      "text": "Joker: Folie à Deux wants to critique a system that rightfully deserves to be gutted and inspected for its obsession with sensationalism but instead becomes the very thing it wants to reject."
    },
    {
      "text": "Phoenix delivers another hauntingly powerful performance. His transformation from a helpless victim of circumstances to a confident individual representing himself in a murder trial is palpable, making his twisted journey even more compelling."
    },
    {
      "text": "If you're in the mood for a bold, subversive, fantastic musical, watch Emilia Pérez."
    },
    {
      "text": "Some viewers will want to clap along, and some will applaud because it's over."
    },
    {
      "text": "Joker: Folie à Deux is surprisingly worse than its predecessor; it has plenty of songs but is completely out of tune."
    },
    {
      "text": "For all of its attempts at bending genres and the out-of-the-box proposition, it nevertheless feels like an empty, lifeless and ultimately unnecessary follow-up to Joker."
    },
    {
      "text": "Grating musical numbers, lackluster performances, and an incoherent plot make this baffling and bizarre entry into the Batman cinematic canon a tedious outing unable to embrace the weirdness of its own premise."
    },
    {
      "text": "Another tour de force by Joaquin Phoenix who fixes us with his glittering eyes as the clown prince of Gotham alongside a somewhat muted Lady Gaga"
    },
    {
      "text": "If Folie à Deux were just a demented musical romance, it could’ve been something special in a small-scale, character-driven way. Alas, Phillips is somehow convinced that these Joker movies need to Say Something Important about the state of the world."
    },
    {
      "text": "Maintaining the dark and rank feeling of its predecessor, the overall tenor of JOKER: FOLIE à DEUX is a daunting state of depression."
    },
    {
      "text": "Gaga proves once again what an accomplished actor she truly is, although clearly Phoenix is the focal point of JOKER: FOLIE à DEUX. Still, with all its violent sequences, it’s difficult to heartily recommend this effort."
    },
    {
      "text": "From the Looney Tunes-inspired opening to each musical number to its French titling, almost every component of Philips’ sequel feels superfluous and tangential—all incongruous parts of a film that inherently struggles to justify its existence."
    },
    {
      "text": "This sequel is drafting off the first and comes up empty quickly. Despite all the flashy new additions (Lady Gaga, musical numbers, etc.), this is just one sad clown show."
    },
    {
      "text": "When a movie from a skilled filmmaker misses as this film does, I perk up & start trying to figure out why. The film doesn’t do what audiences want it to do. Yes. But it can’t be that simple. There has to be a reason Todd Phillips went to work every day."
    },
    {
      "text": "Folie à Deux achieves a feat that few sequels – even the worst ones – have accomplished: it makes the original film worse in retrospect. [Full review in Portuguese]"
    },
    {
      "text": "This sequel is neither a good musical nor a good legal procedural drama and Lady Gaga's talent as an actress and a singer are both wasted."
    },
    {
      "text": "What saves the film is the same stuff that worked for the original: Phoenix’s performance, cinematography, and soundtrack. Also, the psychological thriller elements in the movie were as compelling as it was in the first one."
    },
    {
      "text": "Praiseworthy performances and cinematography can’t salvage the poor punchline of an ending in this ultimately disappointing follow-up to the original."
    },
    {
      "text": "I was mostly puzzled by the whole experience."
    },
    {
      "text": "Even fans of \"Joker\" are unlikely to find much to redeem this chaotic, profoundly stupid mess."
    },
    {
      "text": "Joker Folie À Deux is beautiful to look at, even with the grime, but it never trusts its actors’ singing chops nor acting depth to truly make something great."
    },
    {
      "text": "That Joker: Folie à Deux should subvert expectations, though, is the only predictable thing about it..."
    },
    {
      "text": "The film is effortlessly claustrophobic, dreamily undramatic and all the better for it."
    },
    {
      "text": "\"Brilliant in some ways...\""
    },
    {
      "text": "Todd Phillips has never managed to write a plausible female character. Why start now?"
    },
    {
      "text": "Todd Phillips' sequel to the 2019 box office hit is not awful because it's a musical; it's awful because he does not understand musicals. This is the worst thing to happen to them since Pierce Brosnan's \"singing\" in Mamma Mia. [Full Review in Spanish]"
    },
    {
      "text": "Phoenix is mesmerizing in a role that is operatic and yet also achingly human."
    },
    {
      "text": "The big non-news about “Folie à Deux” is that it’s a half-baked, halfhearted musical complete with one star who can sing, Lady Gaga as Lee Quinzel a.k.a. Harley Quinn, and another (Phoenix) who can’t or won’t."
    },
    {
      "text": "Unfortunately, Joker: Folie à Deux bypasses the entertainment turnoff and heads straight for a bleak, bland, boring film with a telegraphed ending."
    },
    {
      "text": "It comes across as a less cohesive film than Joker and more like a splash of ideas and sequences forced together to make a story."
    },
    {
      "text": "Sadly doesn't justify existing as a sequel or a musical."
    },
    {
      "text": "A visually striking but emotionally diluted film that hums and haws and even dances between genres without fully committing to any of them. It’s a wild, chaotic ride, but it’s missing the haunting, bone-deep resonance of its predecessor."
    },
    {
      "text": "Actor Leigh Gill brings actual gravity to a scene as Arthur’s broken former pal. And the film is less dislikeable than its forebear."
    },
    {
      "text": "The film tries to be everything to everyone and ends up being for no one."
    },
    {
      "text": "Director Todd Phillips takes the billion-dollar formula from 2019’s Joker and sets it ablaze, delivering a slow-burn character study intent on subverting fans’ expectations."
    },
    {
      "text": "The Joker character has been approached in many different ways, but this is one of the oddest yet."
    },
    {
      "text": "There’s always a joker, there’s always a clown — but if he doesn’t morph into something bigger and bolder and more terrible, it starts to feel like we’ve seen this show before, only without the musical numbers."
    },
    {
      "text": "Writer-director Phillips and co-writer Scott Silver obviously had no idea what kind of movie they were trying to make. “Joker” had something to say to the world; “Folie à Deux” just seems to be muttering and warbling incoherently to itself."
    },
    {
      "text": "We’ve become very familiar with Marvel and DC’s habit of “re-imagining” the histories of their superheroes and super-villains... But this one is wildly misconceived -- a small story inflated by grandiose intentions."
    },
    {
      "text": "I dunno, I thought this was bold and audacious ... what is madness than breaking into song at a moment's notice? Credit to the creative team for doing something completely different, & again laying bare the deficiencies of America. Magnificent obsession."
    },
    {
      "text": "I can’t imagine fans enjoying what Phillips does with the Joker here, but then again, studios are counting on you to see these comic-book movies no matter how poorly they’re made. With rare exception, audiences flock to give DC and Marvel their money"
    },
    {
      "text": "Anyone familiar with Batman comic-book lore knows Joker and Harley have their extreme ups and downs, and it’s enjoyable here to watch Arthur and Lee’s bad romance come to fruition."
    },
    {
      "text": "Folie à Deux never digs deep enough into the moral questions presented to come up with anything substantial to say."
    },
    {
      "text": "A complete disappointment. A dull, wandering epilogue that has nothing new to say or add to the phenomenal 2019 film. An apology of sorts for what the first one did, and cinema trolling at its best. Phoenix is again great. [Full review in Spanish]"
    },
    {
      "text": "A movie that feels like one long mistake whose subtitle, indicating a madness shared by...two, might actually be a “folie” extended to all those who thought this was a good idea."
    },
    {
      "text": "When he's Arthur, he’s very boring. When he's Joker, he’s very annoying."
    },
    {
      "text": "“Joker: Folie à Deux” is a traumatizing cinematic experience, so insistent on being grim and static that one wonders if director Todd Phillips’ goal was to set fire to the whole idea of a comic book movie."
    },
    {
      "text": "The hollow feeling Joker: Folie à Deux gave me was coupled with dread over the future of cinema if this is what we’re investing money in."
    },
    {
      "text": "Phillips has followed his very anti-hero take on the Joker with an a very anti-sequel. It combines prison drama, courthouse thriller and musical, and yet turns out remarkably inert given how combustible the original was."
    },
    {
      "text": "Joker: Folie à Deux might be the most non-sequel sequel ever made. It’s act one of the next chapter stretched into a full movie, which is simultaneously unsatisfying and frustrating."
    },
    {
      "text": "So determined to avoid satisfying fans that it’s borderline antagonistic, as actively hostile to genre conventions as its protagonist is to the world at large."
    },
    {
      "text": "While the push-pull tension between the allure of complete social breakdown and the remorse over unleashing the collective id is what Folie à Deux really seems to want to dig into, the film never balances the two in a way that hits its targets."
    },
    {
      "text": "Who hurt these people?"
    },
    {
      "text": "It’s an epilogue that almost succeeds. Joaquin Phoenix embodies Arthur Fleck’s psychosis perfectly, but the musical numbers feel like romantic filler in a chaotic narrative that ultimately leaves you unfulfilled."
    },
    {
      "text": "Joker: Folie a Deux is an ugly look at fan service, obsession, and toxicity without any exploration of the “why” behind them all."
    },
    {
      "text": "The true Folie à Deux may well be the shared delusion between Todd Phillips and Warner Bros. that this concept could have ever worked."
    },
    {
      "text": "The most audacious big studio movie in years had me cheering its refusal to color between the lines. Until it didn’t."
    },
    {
      "text": "Folie à Deux is a strange punchline for a joke that was gaining momentum, but that falls flat by not clearly defining what reaction it wants to provoke in the audience. [Full review in Spanish]"
    },
    {
      "text": "A sequel that doesn't find its tone. [Full review in Spanish]"
    },
    {
      "text": "For now, however, the bitsy role of Lee is there only to provide musical respite from the misery dominating the rest of the picture."
    },
    {
      "text": "A listless, depressing \"musical\" that seems to hate its characters, and itself."
    },
    {
      "text": "It's a movie of ideas disguised as an exceedingly grim entertainment, and it's more interesting for those ideas, undeveloped though they are, than it is as entertainment."
    },
    {
      "text": "If you wept for him in the first film, Phillips uses the second to ask why – and the answer may be deeply awkward for some people."
    },
    {
      "text": "For nearly two and a half hours, director Todd Phillips’ pathologically unnecessary movie cycles through so many potential reasons to exist... it ultimately never finds a satisfying one."
    },
    {
      "text": "This is a cartoon madman in every sense, and even the strength of the actors around him, including Gaga – a real star – can’t save the film from floundering."
    },
    {
      "text": "The first Joker was a bad movie. Folie à deux is just as bad, but also a chore to sit through."
    },
    {
      "text": "Joker: Folie à Deux leaves a lasting impression, merging psychological intensity with musical spectacle. Though sure to be divisive, it is undeniably an unforgettable cinematic experience from an incredibly talented filmmaker."
    },
    {
      "text": "If any director should be making 2.5 hour apology sequels, it’d be Todd Philips for 'Joker;' but he's obnoxiously oblivious as to HOW his movie accumulated the toxic fandom he's now spent a whole sequel lecturing against."
    },
    {
      "text": "Folie à Deux is many things, a deranged romance that indulges itself as a movie musical, a court procedural, a violent prison drama, and a director realizing a vision. It is definitely not the origin story of a genius super-villain and his girlfriend."
    },
    {
      "text": "There's so much that it could've done... and if they didn't want to go through so much trouble, at least make it entertaining, not a boring, pretentious, incoherent mishmash of plot, meaningless songs, & repetitive sequences. [Full review in Spanish]"
    },
    {
      "text": "while [Phillips'] core idea of turning his anti-hero into a martyr for the masses is intriguing, turning it into a musical, presumably the better to utilize Lady Gaga, bogs everything down."
    },
    {
      "text": "The much anticipated star pairing of Joaquin Phoenix and Lady Gaga lacks the expected fireworks."
    },
    {
      "text": "An eclectic and original vision from Phillips, who again co-wrote the script with Scott Silver (based, of course, on DC Comics characters), the film both embraces and transcends its weirdness."
    },
    {
      "text": "A fascinating watch that amounts to nothing. \nStarts off intriguing as it slowly brings you back to Arthur Fleck’s reality… & with the introduction of Harley introduced intriguing elements But it all falls apart in the last 20 minutes almost completely.."
    },
    {
      "text": "Audiences may find the whole film to be a trial."
    },
    {
      "text": "[I]t is a jumble of conceits ... [and] gimmicks..."
    },
    {
      "text": "Folie à Deux carves it's own path away from still waters for a more rugged current reception wise, and it makes no apologies. I like the musical format and the more closed off Arkham/courtroom setting. Phoenix and Gaga are mesmerizing."
    },
    {
      "text": "For better and for worse, Joker: Folie à Deux mixes romance and show tunes with law and order in what may be the bleakest jukebox musical ever. It is ambitious and bold, like All That Jazz filtered through a funhouse mirror, but it’s also frustrating."
    },
    {
      "text": "At least Lady Gaga is innocent of all the crimes this movie commits against cinema. Big swings mean big misses, but I admire the attempt to shock."
    },
    {
      "text": "Joker: Folie à Deux, a tedious film that doesn’t need to exist and actively seems to resent that it does."
    },
    {
      "text": "Why hire Lady Gaga if you’re not going to let her belt the songs out? I guess for the same reason that they used IMAX cameras to shoot a movie that takes place in like three dingy rooms."
    },
    {
      "text": "Folie à Deux might avoid populist kicks, but it also reveals the limit to Phillips’s subversion of our expectations."
    },
    {
      "text": "…an extraordinary movie which triples down on a revamped notion of DC characters as real-world psychopaths hiding behind fictional masks; it’s an anti-super-hero, anti-comic-book movie, maybe not a fanboy pleaser, but something of a wow for the rest of us"
    },
    {
      "text": "The joke is on the audience with the absolutely awful sequel Joker: Folie à Deux."
    },
    {
      "text": "It may be ambitious, inexplicable, and one-of-a-kind, but that so rarely translates into something engaging – or even watchable."
    },
    {
      "text": "Loved a LOT of what the movie tries to do... But I feel the big swings aren't really suited and the musical numbers are rather lacklustre. I lean on the positive side, while fully acknowledging how much of a failed experiment this is."
    },
    {
      "text": "After a strong start, it turns into a ponderous film. The musical numbers don't go as big and outrageous as they should and the movie turns into a courtroom drama that is ultimately a slog."
    },
    {
      "text": "An anemic, shallow and clunky amalgam of musical, romance and crime thriller."
    },
    {
      "text": "Just when things begin to boil somebody starts singing…A seismic disappointment."
    },
    {
      "text": "It becomes apparent this isn't really going anywhere, because it can't."
    },
    {
      "text": "Rehashes a lot of the same themes (and events) of the first film, but this time set to music. Two incredible lead performances and some fun moments, but overall left me wanting more. A lot more."
    },
    {
      "text": "Joker: Folie à Deux is cheap. It cost a lot, but it’s cheap. Joker fans are given a movie decided upon by three obnoxious bankers salivating at projected earnings on the subway."
    },
    {
      "text": "Joker encourages Phillips to cosplay as renegade auteur. However, the metteur-en-scène ensures that Folie à Deux also lacks the depth or, frankly, interest to say anything meaningful despite its cavalcade of “We LivE in A sOciEtY” musings."
    },
    {
      "text": "Behind the veneer of batshit crazy spectacle lies a deceptively complex and deep thinking film, obsessed with its own outréness but also intellectually daring and unquestionably original."
    },
    {
      "text": "Joker: Folie à Deux is a stylish, uneven, and fairly provocative musical that takes bold risks that don't always work but the performances are top-notch. The movie is a dark fairy tale about obsession, celebrity fame, and criminal justice."
    },
    {
      "text": "One of the most egregious examples of a cynical cash-grab that only exists because the previous film over-performed. Some great cinematography and production design can't hide how empty and pointless this glorified epilogue is as a narrative."
    },
    {
      "text": "The madcap musical format (by Hildur Guðnadóttir) lends itself organically to the narrative of Joker 2 because music is the language of the crazy. Or as a character puts it in the movie, it's how one \"balances the fractures within.\""
    },
    {
      "text": "Director Todd Phillips has borrowed characters from the DC comics universe but turned them into something raw and human."
    },
    {
      "text": "Sequels should still stand on their own, but Joker: Folie a Deux really only acts as an Act 2 for the first film. The courtroom drama feels like a final act that’s stretched for over two hours without a strong arc for either of the two leads."
    },
    {
      "text": "Joker: Folie à Deux takes the biggest of swings, without question, and almost deserves respect for its blatant rebellion, but its indecisiveness in what it wants to do or say leaves us waiting on a punchline that limps rather than lands."
    },
    {
      "text": "In 'Joker: Folie à Deux,' director Todd Phillips's attempt to blend courtroom drama with musical elements results in a disjointed and sluggish narrative that fails to capitalize on its potential."
    },
    {
      "text": "Attempting to make bold swings for this resulted in failure! There’s half of a good movie here but unfortunately it spends too much time justifying and answering questions from the first film and the other half cuts itself short for a musical number."
    },
    {
      "text": "Folie à Deux’s attempt at showcasing cleverness, verve, or engagement is held cruelly underwater by staid direction, shoddy emotional plotting, a gleeful sense of cruelty, and a grave nihilism that makes Zack Snyder’s work seem like a season of Bluey."
    },
    {
      "text": "Lady Gaga can't save a lethargic slog of a self-loathing follow-up that defiantly withholds anything that might entertain comic book fans, Little Monsters or musical theater nerds."
    },
    {
      "text": "What are we doing here, exactly?"
    },
    {
      "text": "A mundane, low-stakes sequel that tries to blend musical romance and courtroom drama."
    },
    {
      "text": "Feels not only all over the place... I feel like they backtracked on Arthur Fleck."
    },
    {
      "text": "Despite its initially intriguing, offputting nature that has no interest in being what anyone would expect from a Joker sequel, it is crushingly boring and often feels like an aimless 2+ coda to that film"
    },
    {
      "text": "Folie a Deux is largely an exercise in tedium that is better than its shallow and frankly stupid exercise in corporate-approved nihilism that was the 2019 original but has nothing new to offer other than shallow provocations that are more boring than bold"
    },
    {
      "text": "It plays like an R-rated version of the “Seinfeld” series finale, and detours into the recesses of these bruised minds simply rehash psychological profiles from the first feature."
    },
    {
      "text": "A beautifully shot and riveting  sequel."
    },
    {
      "text": "I respect Phillips for throwing fan-service out the window and doubling down on his dark, and sometimes incomprehensible, vision."
    },
    {
      "text": "Staged with little inspiration or oomph, the musical numbers are largely crutches for limp character development & a thin narrative. Too much dancing around a smoky club and not enough around lit fuses in this journey through the Grate American Songbook."
    },
    {
      "text": "There are flashes of genius but the film just never gets going. Too much singing, and clearly Phillips isn't good with musicals or female characters. Lady Gaga is horribly underused but Phoenix is brilliant once again. And the film is visually striking."
    },
    {
      "text": "It is a somewhat disappointing film in because it does not repeat the previous structure (which in essence is a positive thing), but the new paths chosen do not lead to the same destination as the previous more provocative trip. [Full review in Spanish]"
    },
    {
      "text": "Fans will hopefully appreciate Phillips’ brave denouement and the points he makes about the absurdity of fighting in the realm of the symbolic, but it’s sadly unlikely the average viewer will leave the cinema thinking more than “that’s entertainment”."
    },
    {
      "text": "Gaga doesn’t have as much to work with, but her Grammy-winning vocals do help propel the biggest set pieces to explosive heights."
    },
    {
      "text": "Extending his critical gaze toward contemporary America, Phillips aims with precision and fury at various ills of the modern world... [Full review in Spanish]"
    },
    {
      "text": "Phoenix is masterful, and he and Gaga make an awesome screen team. She is sublime. Het role is smaller than expected, but she makes the most of it and delivers her best screen performance to date."
    },
    {
      "text": "Joker: Folie à Deux certainly sings a different tune than its predecessor, but it isn’t an encore worth sticking around for."
    },
    {
      "text": "Of all the things Phillips does better in “Joker: Folie à Deux” than he did in “Joker,” the best is by far his course correction in catering to radical misogynists."
    },
    {
      "text": "Joker: Folie à Deux is absolutely not what you expect it to be, but that’s not a bad thing. [...] the story of a man who refuses to be anything but himself right till the very end, and that’s what makes this Joker sequel so deliciously subversive."
    },
    {
      "text": "One thing that Joker: Folie à Deux really does get right is how this version of The Joker is not really a bad guy - he's a mirror for society."
    },
    {
      "text": "Folie à Deux achieves two remarkable things. It updates the movie musical, using the genre in an inspired way that shouldn’t frighten fans who don’t like them. It’s also that rare sequel that meets – if not surpasses – the quality of its predecessor."
    },
    {
      "text": "It seems like Todd Philips targeted Folie à Deux directly at the audience who got a little too into Joker – and made it to antagonize them."
    },
    {
      "text": "We're left with the tragedy of a broken man in a world only interested in sensationalism. It's a big swing for all involved, but all the better for it."
    },
    {
      "text": "It begs the question, why is Phillips so reluctant to embrace that the film is a musical? Why not add a little more colour, some flourish to the production design?"
    },
    {
      "text": "It is not that this version of the Joker is inherently wrong, but it is uninteresting. Please let us be done with this."
    },
    {
      "text": "It feels remarkably honest and true to itself, demonstrating again that taking such a popular character seriously is nothing to laugh at."
    },
    {
      "text": "Phoenix is seamless, picking up this maudlin character again as if it were only yesterday. It's a truly versatile, malleable performance."
    },
    {
      "text": "An overindulgent musical that lacks the punch of its predecessor."
    },
    {
      "text": "Where the original Joker remains a stunning exception — that rare blockbuster with emotional shading, grownup themes and a genuine sense of grandeur — this sequel fails to stay on the beat."
    },
    {
      "text": "Scott Silver’s iffy bits of dialogue aren’t able to be masked by the strength of the cast this time around, especially with a returning lead who, when he isn’t caterwauling through endless musical numbers, appears to have slipped into eternal somnolence."
    },
    {
      "text": "It’s not that the film is so crazy that you have to see it (in fact, what’s crazy about it is that it isn’t); rather that few have ever had a platform like Philips and Joaquin Phoenix to fool with expectations of the masses so blatantly."
    },
    {
      "text": "The film is audaciously different in style from the original, not quite as electrifying, but bold and brilliant all the same."
    },
    {
      "text": "Joker still has a trick up its sleeve — even a serious subtext. The best moment comes late on in an incendiary scene..."
    },
    {
      "text": "Folie à Deux can’t quite match its predecessor for dizzying impact. But it matches it for horrible tinderbox tension: it’s a film you feel might burst into flames at any given moment."
    },
    {
      "text": "This newfound stylistic vigor helps extend the shelf-life of Joaquin Phoenix’s Joker, but by the time the end comes, this incarnation feels exhausted."
    },
    {
      "text": "Phillips is just incapable of delivering the genre’s requisite razzle-dazzle that would surely complement Joker’s persona."
    },
    {
      "text": "It’s startlingly dull, a pointless procedural that seems to disdain its audience."
    },
    {
      "text": "Part courtroom movie, part behind-bars romance, Folie à Deux is an unconventional musical sequel that fails to hit the high notes."
    },
    {
      "text": "While Joker: Folie à Deux isn’t a flawless film, it retains much of what made the first film so compelling while introducing new elements that allow it to stand on its own."
    },
    {
      "text": "Folie à Deux simply tap dances in place for the majority of its listless runtime, stringing together a series of underwhelming musical numbers that are either too on the nose... or too vaguely related to its characters to express anything at all."
    },
    {
      "text": "Depending on how you look at it, this demythologising exercise is either daring or it's irritatingly smug, but it's definitely not much fun."
    },
    {
      "text": "As sweet and beguiling a musical romance as it’s possible to have between two murderous psychopaths. Its kooky approach won’t suit all stripes of comic-book fan, but it finds a strange, tragic hopefulness all of its own."
    },
    {
      "text": "Gaga is a compelling live-wire presence, splitting the difference between affinity and obsession, while endearingly giving Arthur a shot... Their musical numbers, both duets and solos, have a vitality that the more often dour film desperately needs."
    },
    {
      "text": "Joker: Folie à Deux defies all expectations. Dancing and music are pivotal in the first Joker film, and it’s blown up into a jukebox musical with raw and engaging performances from Lady Gaga and Joaquin Phoenix."
    },
    {
      "text": "Joker: Folie à Deux may be ambitious and superficially outrageous, but in a basic way it’s an overly cautious sequel."
    },
    {
      "text": "Longueurs abound. The denouement hits story beats that ought to wrap up act one. The film similarly flounders between genres. It’s a musical, a prison movie and, mostly, a plodding courtroom drama."
    },
    {
      "text": "Despite how controversial the musical elements could be and how less “thrilling” it is compared to 2019’s Joker, it’s better that the filmmakers chose to take a creative swing rather than be safe. Joker: Folie a Deux is an entirely unique anti-hero film."
    },
    {
      "text": "Despite its fascinating and complex main character, the film is ultimately dull and plodding, taking us nowhere, slowly."
    },
    {
      "text": "Phillips and co smashed back into the self-contained world, shook all the contents out on to the carpet and... had another go. The result? Messy, lifeless, derivative and exactly what you’d expect from a film that simply doesn’t want, or need, to exist."
    },
    {
      "text": "Gaga doesn’t quite reach the mania that Harley Quinn ought to have but still packs a wallop where it counts."
    },
    {
      "text": "... Though it ends up as strident, laborious and often flat-out tedious as the first film, there’s an improvement."
    },
    {
      "text": "Plot holes, minimal character development, and toxic masculinity aside, Joker: Folie à Deux is a complicated, intense, and entertaining film. It’s not as shocking as the first, but the Joker is still a terrifying character in this universe."
    },
    {
      "text": "Overall Folie à Deux is just as edgy and disturbing as its forerunner, replicating the idea of modern American cities as terrifying powder kegs perpetually on the cusp of explosion."
    },
    {
      "text": "It’s a sad, pensive, and impressively odd motion picture that uses the theatricality of movie musicals to undermine its hero’s ambitions instead of elevating them."
    },
    {
      "text": "Joker: Folie à Deux is Arthur’s movie, and Arthur just isn’t that interesting, despite how much effort Phoenix puts into rendering the character in exquisitely anguished mental and sunken-chested physical detail."
    },
    {
      "text": "Boosted by these two dynamic performances, remarkable cinematography and production design, not to mention Hildur Guðnadóttir's profound score, “Joker: Folie à Deux” will surprise many people for its ingenuity, even if it does become a bit overindulgent."
    },
    {
      "text": "While sequences provide a glimpse at the fantasies conjured in their intertwined minds, adding extensive and intricate scenes beyond the sphere of musical numbers would have only crafted a more compelling picture of these imaginative visions."
    },
    {
      "text": "With song, dance, comedy, darkness, animation, drama, violence and more, this is a musical, if it even is a musical, like no other."
    },
    {
      "text": "Gets bogged down by a lengthy courtroom saga, which not only keeps the dazzling Lady Gaga away from the spotlight, but centers the movie entirely around its own predecessor, without doing or saying anything new."
    },
    {
      "text": "Todd Phillips has delivered the last thing anyone expected: a socially responsible Joker movie that finds an intriguing way to explore the consequences (both on and offscreen) of the first film"
    },
    {
      "text": "Joker: Folie à Deux is a bold, daring, and mesmerizing masterpiece."
    }
  ],
  "release_year": 2024,
  "duration": 138,
  "genres": [
    "Musical",
    "Crime",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "\"Joker: Folie à Deux\" finds Arthur Fleck institutionalized at Arkham awaiting trial for his crimes as Joker. While struggling with his dual identity, Arthur not only stumbles upon true love, but also finds the music that's always been inside him.",
  "popularity": 3.1,
  "poster_url": "https://image.tmdb.org/t/p/original/udDclJoHjfjb8Ekgsd4FDteOkCU.jpg"
}