{
  "movie_name": "Jurassic Park",
  "movie_id": "jurassic_park",
  "total_reviews": 137,
  "reviews": [
    {
      "text": "An exceptional blockbuster, full of interesting ideas about the dangers of control and unbridled scientific progress, and packed with incredible action and suspense sequences. [Full review in Spanish]."
    },
    {
      "text": "Jurassic Park gives everything you could ask of a blockbuster adventure movie, and much of what you might ask of a horror movie. The thrills are executed sharply, and strike the perfect tone when juxtaposed against moments of wonder and true movie magic."
    },
    {
      "text": "Jurassic Park remains timeless because the issues it chose to explore are universal, while Alan, Ian, Ellie and the other heroes remain relatable, despite their extraordinary circumstances."
    },
    {
      "text": "An amazing ride."
    },
    {
      "text": "Even with sequels of debatable merit weighing it down, Spielberg's original 1993 movie can't be stopped."
    },
    {
      "text": "A magical marvel of blockbuster cinema."
    },
    {
      "text": "Watching the film in 2023 brings with it some unusual baggage. Questions about control, computer hacking, and what to do with the power you’ve discovered seem more relevant than ever."
    },
    {
      "text": "Groundbreaking FX, an all star cast, some of the most iconic action/horror sequences ever filmed, and just the right amount of critique of traditional gender roles & capitalism. Jurassic Park truly is a four quadrant blockbuster"
    },
    {
      "text": "Jurassic Park is a legendary film full of a number of scary set pieces, but its most frightening sequence is one without dinosaurs."
    },
    {
      "text": "It has a thrill or two, and a chill or three, but it has no poetry, little sense of wonder, no resonant subtext, no art."
    },
    {
      "text": "“Jurassic Park” turned out to be an incredible visual achievement and a groundbreaking step forward for movie technology."
    },
    {
      "text": "'Jurassic Park' has staying power because it is not afraid to be about something while also maintaining its sense of the spectacular, that is, the sensory aspects of drama and filmmaking."
    },
    {
      "text": "Steven Spielberg's Jurassic Park uses marvelous visuals to suspend its audience and characters in awe and revelation."
    },
    {
      "text": "The film set a strong tone for modern summer blockbuster films in 1993 and continues to be one of the most iconic movies ever to hit a silver screen in the summer months."
    },
    {
      "text": "This is a classic movie. The entire cast was great and Spielberg was in the zone on this one."
    },
    {
      "text": "This is a classic for good reason. It was a groundbreaking film that has magic that they haven't been able to recreate in this franchise."
    },
    {
      "text": "A great blend of CG and gargantuan animatronic puppets breathes life into some of the most mortifying and convincing dinosaurs in the history of cinema."
    },
    {
      "text": "Almost 30 years since it was released, Jurassic Park remains one of the quintessential blockbuster films of all time. One of Steven Spielberg's best movies, gives us the perfect mix of wonder and terror. [Full review in Spanish]"
    },
    {
      "text": "It perfectly translates the sense of wonder that derives from the presentation of the dinosaurs, exploding with full force after the \"Welcome to Jurassic Park\" spelled by Richard Attenborough. [Full Review in Spanish]"
    },
    {
      "text": "It's an interesting film to go back to, [as the film] is critical of capitalism, but that doesn't mean there isn't a very strong social conservative streak here in terms of how it structures the ideas about what capitalism shouldn't meddle with."
    },
    {
      "text": "Just as magical now as it was 20 years ago."
    },
    {
      "text": "It's not just about the dinosaurs the characters are so well developed"
    },
    {
      "text": "Two decades on, it continues to entrance and engage new audiences, typifying everything the cinematic experience can and should be."
    },
    {
      "text": "I did not feel that I wasted my two hours or my seven bucks (plus another two for the indigestible \"raptor bites\" candy tie-in), but I was deeply disappointed by much about the movie."
    },
    {
      "text": "What Spielberg and company did with Jurassic Park was deliver a true classic for the ages."
    },
    {
      "text": "Altogether, Jurassic Park is an excellent example of how special effects are best used to support a good story, not supplant it."
    },
    {
      "text": "An economic necessity of securing a PG certificate for what is essentially a horror film has been allowed to intervene in the story-telling, so that the tone is constantly disrupted by an incongruous reassurance."
    },
    {
      "text": "One of the great cinematic thrill rides, a masterful piece of genre-hopping pop spectacle."
    },
    {
      "text": "We ask for two things from big-budget thrillers like this: Make us believe and make us jump. Jurassic Park delivers on both counts."
    },
    {
      "text": "This Steven Spielberg thriller remains one of his best films and one of the best summer blockbusters of all time."
    },
    {
      "text": "As much as you can point to the T-rex attack as a master class in action filmmaking, this still leaves a mechanized aftertaste."
    },
    {
      "text": "The effects hold up 20-plus years later. So do the thrills. Yes, 'Jurassic World' has its work cut out for it."
    },
    {
      "text": "Spielberg was wise to not rely entirely on computer images, rather blending the new technology with old-fashioned practical designs and the result is a film that looks far better than any modern tentpole blockbuster."
    },
    {
      "text": "I loved every fascinating, suspenseful, frightening, skilfully calibrated minute of it."
    },
    {
      "text": "Jurassic Park is the most self-reflexive blockbuster ever made ..."
    },
    {
      "text": "A very welcome memo to Hollywood that blockbusters don't have to be stupid."
    },
    {
      "text": "A thrill ride worthy of a real-life amusement park."
    },
    {
      "text": "The effects have barely aged and the joy is timeless. Take a child who's never seen it and watch their imagination expand before your eyes."
    },
    {
      "text": "Despite the presence of all this acting talent, it is the film's special effects, especially the work of \"dinosaur supervisor\" Phil Tippett, that carry the day."
    },
    {
      "text": "Jurassic Park is an astonishing success in one sense and one sense only: It is the monster of all monster movies, guaranteed to challenge weak bladders, flutter heartbeats and win automatic Oscars for the [tech crew]."
    },
    {
      "text": "Spielberg is less assured in the department of character development and some of the actors give worse performances than the computer-generated creatures, but, with a landmark spectacle like this, who cares?"
    },
    {
      "text": "Jurassic Park is a masterpiece!"
    },
    {
      "text": "The 3D doesn't add a lot to the narrative, but it's still an exciting adventure into the mesmerizing world of dinosaurs and humanity's godlike addiction to reviving the past."
    },
    {
      "text": "Some things have dated - Sam Jackson wouldn't be allowed to smoke in the office; everyone would have mobiles; Google Earth would have kept the island from being kept a secret - but the power of the film's pioneering CGI remain strangely undiminished."
    },
    {
      "text": "Steven Spielberg's summer adventure is still one of the ultimate movie roller coaster rides."
    },
    {
      "text": "Jurassic Park is a how-to guide for structuring a multi-character disaster film."
    },
    {
      "text": "Still proves as thrilling as ever."
    },
    {
      "text": "A classic gets even better."
    },
    {
      "text": "The film is a classic and the chance to see it on the big screen again (or for the first time) should not be missed"
    },
    {
      "text": "Sentiment is explained by science as the family impulse that motivates so many Steven Spielberg stories is revealed to be an evolutionary imperative in this near-perfect action-adventure."
    },
    {
      "text": "[Looks] better not only than effects-driven movies of the same period, but better, frankly, than half of what gets released nowadays."
    },
    {
      "text": "Kids who love dinosaurs will love it. And who doesn't?"
    },
    {
      "text": "confirms both Spielberg's mastery of cinematic thrills and the comparatively empty bombast of today's summer tentpole movies, even the better ones."
    },
    {
      "text": "Jurassic Park shows us a director in transition, and the film captures his transformation in its own kind of cinematic amber."
    },
    {
      "text": "[The] 3D [conversion] provides the definitive version of this classic film. Jurassic Park has been transformed with with artistry, nuance and sophistication, and it's an absolute must-see during this brief run."
    },
    {
      "text": "The 3D effects had me nearly jumping out of my seat. Some say Hollywood is converting too many old films to 3D. But, \"Jurassic Park\" was the perfect choice. There's nothing more fun than sharing a seat with a snapping dinosaur."
    },
    {
      "text": "Spielberg treats us as he does his characters, leading us into a strange land and expecting us to make it out with all our faculties intact; it's a tall order, given the heart-stopping, bloodcurdling, limbs-numbing excitement packed into the second hour."
    },
    {
      "text": "It is as if time has passed the movie by. \"Jurassic Park\" remains solid entertainment, but the awe and wonder have faded."
    },
    {
      "text": "The thrill of seeing live dinosaurs on screen is not as acute today as it was 20 years ago admittedly, but there is still some 3D awe left in the creations that roared 65 billion years ago..."
    },
    {
      "text": "The 3D isn't pushed on the audience, but it does reveal the amount of depth that Spielberg actually put into the film 20 years ago."
    },
    {
      "text": "While it's not the most profound of Spielberg's works or the most entertaining from a popcorn perspective, it's one of the most technically flawless movies he's ever produced."
    },
    {
      "text": "If releasing the film in 3-D is the only way to get it back in theaters, then the gimmick is an acceptable addition. The 3-D is good. But when a movie is this near flawless, nothing is needed to make it better."
    },
    {
      "text": "The 3D conversion ruins everything, like the comet that killed the dinosaurs, making Jurassic Park the rare amusement I'd prefer to revisit at home."
    },
    {
      "text": "A beast of a movie is gifted a superfluous-but-superb rouging of the cheeks, offering fanatics something new to study while newcomers will be ruined for any future television airings."
    },
    {
      "text": "The enthralling man-vs.-nature parable based on the late Michael Crichton's best-selling novel hasn't aged one bit."
    },
    {
      "text": "The tasteful Jurassic Park 3D conversion injects new wonder and excitement into one of the most captivating adventure movies ever made."
    },
    {
      "text": "There is nothing like experiencing this fabulous, larger-than-life, groundbreaking movie where it was meant to be experienced. And in 3D!"
    },
    {
      "text": "This is an immensely entertaining film, as long as you can overlook the many minor flaws that permeate its structure. (Complete Content Details for Parents also available)"
    },
    {
      "text": "But really, what makes \"Jurassic Park\" great is that it is a Steven-Spielberg-master-class in constructing action set-pieces."
    },
    {
      "text": "The 3-D process adds not just dimension but depth - a technological extension of cinematographer Gregg Toland's deep-focus innovations in The Grapes of Wrath and Citizen Kane. The change in perspective creates greater intensity."
    },
    {
      "text": "Only time can tell which movies become classics. No matter how many Ds you see it in, it's safe to say that this one has earned the label."
    },
    {
      "text": "I'm a fan of this movie. It is thrilling, and the 3-D treatment is a nice enhancement."
    },
    {
      "text": "This movie doesn't just stand the test of time, it transcends it."
    },
    {
      "text": "\"Jurassic Park\" remains an absolute thrill from a Spielberg in top form: Funny, scary, fast-moving and full of just-right details."
    },
    {
      "text": "Jurassic Park in IMAX 3D may sound good on paper, but it is even better in actuality, a ridiculously fun re-release of one of American cinema's most wildly entertaining films."
    },
    {
      "text": "\"Jurassic Park\" is such an impressive technical achievement that it seems churlish to note that it accomplishes this at the expense of more substantive elements."
    },
    {
      "text": "\"Jurassic Park\" was impressive in 1993. Twenty years later, it's flawless."
    },
    {
      "text": "Have you always wanted to watch Jurassic Park through Ian Malcolm's sunglasses? Then boy, is Jurassic Park 3D for you."
    },
    {
      "text": "Spielberg has gone on to weightier and more prestigious projects, but this thrill ride is one of his best and a masterpiece of the genre."
    },
    {
      "text": "Just as extraordinary as always ... even diamonds get a periodic polish."
    },
    {
      "text": "A film that managed to terrify a generation of children one minute, leave them eager to hunt for fossils in their backyard the next."
    },
    {
      "text": "That T. rex is worth the wait, but the wait itself is even more memorable."
    },
    {
      "text": "Now a 20-year-old antique slapped with a superfluous 3D transfer, Jurassic Park still has the power to amaze."
    },
    {
      "text": "For all the ingenuity of the movie's engineering, Jurassic Park doesn't have the imagination -- or the courage -- to take us any place we haven't been a thousand times before. It's just a creature feature on amphetamines."
    },
    {
      "text": "As pure spectacle, Jurassic Park works as well as anything else Hollywood's high-tech wizards have given us lately"
    },
    {
      "text": "Do the dinosaurs work? Indeed they do. Does anything else? Not really."
    },
    {
      "text": "Jurassic Park, like the director's other work, is a technical marvel. The effects are great, and the movie's new digital sound system (choose your theater carefully) creates the sensation that giant reptiles are breathing in your ear."
    },
    {
      "text": "The earthshaking footfalls of these lizard-kings are palpable and terrifying. Spielberg's crew of dinosaur-effects artists has conjured up a Mesozoic menagerie whose realism outdoes anything in cinema history."
    },
    {
      "text": "A brilliant and dynamic piece of popular movie making, Jurassic Park has a lot more bite than bark."
    },
    {
      "text": "A cautionary tale about scientists and schemers messing with Mother Nature, the film makes its point. But it takes at least 30 minutes to get going."
    },
    {
      "text": "This is as close as any of us is likely to get to witnessing life in prehistoric times."
    },
    {
      "text": "The characters aren't much more well-defined than the anonymous victims of a teen horror movie... The dinosaur effects, however, are absolutely stunning, and sometimes so natural that one even forgets to be impressed."
    },
    {
      "text": "No matter how old or cynical I get, part of me will always be that same 12-year-old boy, sat in rapture, watching dinosaurs rule the world."
    },
    {
      "text": "Spielberg's sci-fic adventure, his most commercially successful film to date, is defined by never before seen special and visual effects."
    },
    {
      "text": "A strong candidate for Steven Spielberg's best film..."
    },
    {
      "text": "Jurassic Park remains an incredible experience - one that never ceases to be entertaining. It's not an entirely faithful adaptation of Michael Crichton's popular novel, but the creative liberties it takes prove enormously ingenious."
    },
    {
      "text": "It's not exactly brilliantly acted, except by the dinosaurs and raptors - there wasn't time for the usual number of takes."
    },
    {
      "text": "Steven Spielberg's dino-park thrill ride comes up eye-wateringly shiny in this rereleased version - even if its clunkier elements have become a bit more obvious with time."
    },
    {
      "text": "As one of Spielberg's purest suspense rides, it's gimmicky, giddy, and still great value."
    },
    {
      "text": "One of the big screen's very greatest thrill-rides."
    },
    {
      "text": "Performances are top notch, the score is brilliant, and the special effects still hold up in what is easily one of Steven Spielberg's supreme masterpieces..."
    },
    {
      "text": "Terrifyingly realistic dinos run amok in sci-fi landmark."
    },
    {
      "text": "As an action film, as an auteurist vision, as a blockbuster, as a humanist statement...it's a masterpiece."
    },
    {
      "text": "Steven Spielberg's Jurassic Park first introduced me to what movie magic can be."
    },
    {
      "text": "Spielberg's peerless twin gift has always been for making the fantastic seem real (Close Encounters, E.T., the Indiana Jones trilogy) and the real fantastic (Jaws)."
    },
    {
      "text": "This is the 2001: A Space Odyssey of dinosaur movies, one whose special effects render previous efforts obsolete."
    },
    {
      "text": "Jurassic Park doesn't have organic flow; it can't disguise its clunky, B-movie soul."
    },
    {
      "text": "Spectacle triumphs over sense, but with effects this effective resistance is futile."
    },
    {
      "text": "The well-selected cast is winningly sympathetic and entertainingly idiosyncratic."
    },
    {
      "text": "There's more soul to be found in any Kong close-up than in this film's overplayed reactions."
    },
    {
      "text": "Spielberg is still supreme as an action director, and when the T Rex makes beefburger of the jeep, or the vicious 'Raptors stalk their human prey, the film inspires wonder and awe."
    },
    {
      "text": "You won't believe your eyes."
    },
    {
      "text": "An innovative, ingenious and spectacular sci-fi adventure. The special effects are truly dazzling."
    },
    {
      "text": "The plot also conspires to harm the film's general credibility."
    },
    {
      "text": "Mr. Spielberg has great fun with every last growl and rumble signaling the approach of danger..."
    },
    {
      "text": "Great effects, a dime's worth of headache-inducing story."
    },
    {
      "text": "Set a standard for CG-beasties that remained unmatche for many years, and still stands as one of the best of its kind"
    },
    {
      "text": "The plot is equal parts Westworld and (believe it or not) Jaws 3-D."
    },
    {
      "text": "True, the dialogue and performances are feeble, but the thing is basically no more -- and no less -- than a nifty monster movie that delivers crackerjack thrills."
    },
    {
      "text": "May be one-dimensional and even clunky in story and characterization, but definitely delivers where it counts, in excitement, suspense and the stupendous realization of giant reptiles."
    },
    {
      "text": "Jurassic Park does for live-action critters what Who Framed Roger Rabbit did for toons. In that sense, it's a cinematic landmark, but in terms of plot and character, it's about as well developed as Godzilla."
    },
    {
      "text": "Despite the ridiculous premise, Jurassic Park does an incredible job of showing us what dinosaurs might have looked and acted like."
    },
    {
      "text": "...is the movie worth all the hype? Partially yes, but mostly because of the special effects."
    },
    {
      "text": "The excitement of Jurassic Park is in Spielberg's sense of timing, with the scene of the kids trapped in a jeep watching a cup of water tremble now a classic moment of cinema."
    },
    {
      "text": "Overall I give the movie a *** rating and wish the dinosaurs would have eaten all of the people except for say a narrator in the first 5 minutes of the show."
    },
    {
      "text": "Clich or no, there's no getting around it - quite simply one of the greatest blockbusters of all time."
    },
    {
      "text": "Steven Spielberg has tapped into the mother lode of human dreams and sense of wonder."
    },
    {
      "text": "Worthy, even though its a simplistic monster movie at heart."
    },
    {
      "text": "The biggest, grandest dinosaur movie ever."
    },
    {
      "text": "In the end, Jurassic Park succeeds because it's good entertainment."
    },
    {
      "text": "The definitive dinosaur movie."
    },
    {
      "text": "\"Jurassic Park\" earns its spot in fantasy-film history."
    },
    {
      "text": "The roller coaster movie ride of the summer!"
    },
    {
      "text": "You want great dinosaurs, you got great dinosaurs."
    },
    {
      "text": "This is Jaws with huge, scaly ridges. At times, it's more frightening."
    },
    {
      "text": "The problem with the film, plain and simple, is that it focuses all of its energies on the dinosaurs themselves."
    },
    {
      "text": "...short on logic and certainly short on plot, but long on thrills and amazement."
    }
  ],
  "release_year": 1993,
  "duration": 126,
  "genres": [
    "Adventure",
    "Action",
    "Sci-Fi",
    "Mystery & Thriller"
  ],
  "synopsis": "In Steven Spielberg's massive blockbuster, paleontologists Alan Grant (Sam Neill) and Ellie Sattler (Laura Dern) and mathematician Ian Malcolm (Jeff Goldblum) are among a select group chosen to tour an island theme park populated by dinosaurs created from prehistoric DNA. While the park's mastermind, billionaire John Hammond (Richard Attenborough), assures everyone that the facility is safe, they find out otherwise when various ferocious predators break free and go on the hunt.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/fjTU1Bgh3KJu4aatZil3sofR2zC.jpg"
}