{
  "movie_name": "Logan",
  "movie_id": "logan_lucky",
  "total_reviews": 285,
  "reviews": [
    {
      "text": "In many ways Soderbergh is spoofing his own “Ocean’s” trilogy and has a lot of fun doing it. You can’t help but notice similarities in the two story structures, but “Logan Lucky” adds its own unique twist and is by far the broader comedy."
    },
    {
      "text": "It's funny, it's fun, it's incredibly well acted and Soderbergh creates a really immaculate atmosphere around the characters. A really enjoyable movie. [Full review in Spanish]"
    },
    {
      "text": "Logan Lucky doesn’t crackle like some of Soderbergh’s previous heist films, ... but it does operate with the kind of low hum of an expertly crafted engine."
    },
    {
      "text": "Logan Lucky has been given Soderbergh's dependable, accessible, but also perceptive touch."
    },
    {
      "text": "Logan Lucky is both a portrait of working-class America and a clever bit of wish-fulfillment in which a fundamentally broken but self-perpetuating system is put in its place to the benefit of those in need."
    },
    {
      "text": "Thoroughly satisfying popcorn fodder."
    },
    {
      "text": "[Channing Tatum and Adam Driver] show impeccable comedy chops in this hilarious heist caper. But Daniel Craig is the MVP, with a performance that has to be seen to be believed."
    },
    {
      "text": "Soderbergh is perhaps the starkest example of the contemporary non-committal filmmaker, someone unable or unwilling to adopt an important stance toward political and historical questions."
    },
    {
      "text": "It would have been far more entertaining if the line \"Based on a true story\" had opened the picture."
    },
    {
      "text": "Logan Lucky represents a welcomed return for Steven Soderbergh."
    },
    {
      "text": "Soderbergh knows how to develop good characters and maximise the talent at his disposal. Logan Lucky is a brilliant example of just that. [Full review in Spanish]"
    },
    {
      "text": "Soderbergh's prowess has devised a heist film that is enjoyed until the credits end. [Full review in Spanish]"
    },
    {
      "text": "Easily one of the funniest things you'll see this year, but it moves so far beyond simply trying to make us laugh that you may have to watch it a few times to understand how beautifully subversive Soderbergh is in fleshing out his characters."
    },
    {
      "text": "Logan Lucky blends humor as well as excitement, sans the edginess you may expect in a Soderbergh picture."
    },
    {
      "text": "The story itself doesn't matter, and in fact, has never really mattered. It's all about how the story is told. Here, we have a cheerful and frequently funny caper that feels like a tall tale told among friends having a few drinks."
    },
    {
      "text": "It probably goes without saying that the photography and editing are beyond reproach, but I'm going to say it anyway. Logan Lucky is a ruthlessly designed and executed entertainment machine, but its obvious virtues may obscure its depth."
    },
    {
      "text": "podcast review"
    },
    {
      "text": "Along with the amusing characters and straightforward plot, Logan Lucky is pure entertainment."
    },
    {
      "text": "Don't examine the plot to terribly closely, just enjoy the hammy accents, the celebration of family, the clever plot twists, and the unexpected casting."
    },
    {
      "text": "Logan Lucky leaves you on the edge of your seat in anticipation, eager to discover what outcome or comedic antic is around the next left turn."
    },
    {
      "text": "Logan Lucky is chock full of some tasty smart crackers."
    },
    {
      "text": "Logan Lucky is pure redneck genius and Daniel Craig delivers an absurdly awesome performance that is one of the most memorably comical of his career."
    },
    {
      "text": "Lucky Logan comes with a twist, plenty of spirit and is gratifying in its own way."
    },
    {
      "text": "A bright and light robbery movie that shows it has a heart beating inside; made by the hand of a teacher who has nothing to prove. [Full Review in Spanish]"
    },
    {
      "text": "It is a good entertainment that uses the apparent idiocy to build a story much smarter than it seems at a first glance. [Full Review in Spanish]"
    },
    {
      "text": "Logan Lucky feels like a movie that [Steven] Soderbergh just couldn't decide what he wanted be. It has moments of more ridiculous humor that pokes fun at its subjects, then moments that tries to pay respect to them."
    },
    {
      "text": "The treatment of the southern characters ranges from insensitive to cartoonish."
    },
    {
      "text": "There are precious few characters who don't look and sound like they just got back from molesting Ned Beatty alongside the Georgia river. But the movie somewhat works thanks to a solid second half and some sharp performances."
    },
    {
      "text": "Writer Rebecca Blunt and director Steven Soderbergh dared to finally answer the long-pondered question: \"What if Ocean's 11 had 1000% more camouflage pants?\""
    },
    {
      "text": "Disarmingly tender in the home stretch, turning into a keen and well developed take on the human quest for respect and dignity."
    },
    {
      "text": "There are some great laughs, and it spends most of its run-time upending your expectations in a good way."
    },
    {
      "text": "Logan Lucky 's tires may wear thin from time to time, but its comedy, performances, and high-octane energy keep it in the race. There's simply too much fun to be had for the film to be lost in the late-summer shuffle."
    },
    {
      "text": "Despite the overall impressive filmmaking though, there are a few subplots that aren't handled quite as smoothly as the main arc."
    },
    {
      "text": "The actors all sell it and the script kept me laughing so it worked."
    },
    {
      "text": "The joy is in watching the pieces all fall into place, made all the sweeter thanks to a crackling screenplay by the possibly fictional Rebecca Blunt and a cast that's firing on all cylinders."
    },
    {
      "text": "Logan Lucky is not a film that keeps you on the edge of your seat. Rather, watch it reclined and relaxed, it's a heist film with a heart."
    },
    {
      "text": "Logan Lucky is a fantastic time at the movies, a fast-paced film that is an outstanding example of the sort of high-concept, high-quality popcorn cinema that Steven Soderbergh makes so very well."
    },
    {
      "text": "What made Soderbergh's previous heist films so enjoyable was the sense that they were meticulously constructed...Logan Lucky...feels like a cheap knockoff."
    },
    {
      "text": "A witty script and fantastic performances, particularly from a nearly-unrecognisable Daniel Craig, make this more than just another crime caper."
    },
    {
      "text": "Ocean's Eleven by way of Ricky Bobby."
    },
    {
      "text": "That these seemingly dim dudes with cartoonish Southern accents, a matter-of-fact grounding in the world of NASCAR, county fairs, John Denver and child beauty pageants are actually smarter than we assume isn't a \"gag\" but a key part of the story."
    },
    {
      "text": "Logan Lucky is triumphant return, a crowd-pleasing heist movie that is funny, thrilling, and just so damn cool."
    },
    {
      "text": "A sharp-looking vehicle, even if there's not much going on under the hood."
    },
    {
      "text": "The formula succeeds because the final product is an entertaining ride as similar to [the Ocean's trilogy's] concept as it is dissimilar in environment."
    },
    {
      "text": "It's a decent comeback for Soderbergh, though not one that fires on all cylinders."
    },
    {
      "text": "Funny, creative, and the refreshing heist movie of its genre since \"Ant-Man\", \"Logan Lucky\" is an entertaining romp from beginning to end."
    },
    {
      "text": "Yes haw! Steven Soderbergh is back with an end of summer hayride of a film that will have you howling."
    },
    {
      "text": "Logan Lucky doesn't try to be something it's not and with its somewhat charming nature, it's a heist film that knows how to keep it light without losing its edge."
    },
    {
      "text": "This is that rare breed of subtle comedy that engages your heart, mind and funny bone, all at the same time."
    },
    {
      "text": "It's a heist movie, so we are still cheering for criminal behavior, but it is positively old-fashioned in its warm-hearted generosity toward its characters and by extension its viewers."
    },
    {
      "text": "Content to unfold seamlessly, indulging in the pleasures of listening to people banter. It moves forward at a gleeful pace, creating a slap-happy momentum reminiscent of the careening madness found in the best 1940s-era screwball comedies."
    },
    {
      "text": "This is just not as great as it could have been and it is so deeply frustrating given what a trailblazer Steven Soderbergh has been over the past 20 years."
    },
    {
      "text": "It's a guilty pleasure, but it's definitely a pleasure."
    },
    {
      "text": "As we get to know the characters, it becomes clear that something deeper is going on."
    },
    {
      "text": "Perhaps the biggest surprise comes from the fact that Soderbergh and his cast make the brothers sympathetic, rather than merely treating them with condescension. Tatum and Driver portray Jimmy and Clyde with an underlying sense of dignity."
    },
    {
      "text": "Soderbergh has made an indie movie the way he wanted to, on his terms, and the result shows the success of this method."
    },
    {
      "text": "There is no doubting that Logan Lucky has a big heart and tries its hardest to be endearing, but it falls a couple of rednecks short of a Lynyrd Skynyrd concert."
    },
    {
      "text": "With a quartet of committed and super-fun performances from Channing Tatum, Adam Driver, Riley Keough, and Daniel Craig, it's tough not to be incredibly thankful to have Steven Soderbergh back doing his thing."
    },
    {
      "text": "Logan Lucky shows Soderbergh operating modestly with optimum skill."
    },
    {
      "text": "The film has a comfortable shaggy feel, even as it unspools a fairly tight heist."
    },
    {
      "text": "... the folksy, loping, rural Southern answer to the snappy, swinging, showbiz flair of Soderbergh's Ocean's 11 and sequels."
    },
    {
      "text": "Logan Lucky is a rarity on multiple levels, just as remarkable as what the film comes to call \"the Hillbilly Heist.\""
    },
    {
      "text": "The Logan family may have had a curse on them, but this winning outing from returning director Steven Soderbergh has lifted it; Logan Lucky is one madcap heist flick that ranks up there with the best of them."
    },
    {
      "text": "The auteur who was smart enough to rethink the classic heist movie has returned with a turbocharged gasser, Logan Lucky, that once again puts him in the pole position."
    },
    {
      "text": "The film is a breezy, undemanding romp, a nice respite from what's in theaters now."
    },
    {
      "text": "...a very funny heist caper."
    },
    {
      "text": "Only Craig's turn really leaves an impression, and you're left with the feeling that, for all its brio, Logan Lucky doesn't amount to a hill of beans, as they say in those parts."
    },
    {
      "text": "[Steven Soderbergh] is back in Hollywood with Logan Lucky, one of the best films of his career. [Full review in Spanish]"
    },
    {
      "text": "Like all his film's, this one has a homebrew flavour of Soderbergh's backyard of anti-studio film development. That makes it both fresh and fantastic."
    },
    {
      "text": "This is a fun film. These characters aren't the sharpest tools in the shed and they make a few mistakes along the way."
    },
    {
      "text": "Logan Lucky follows the classic structure of the Heist Movies. [Full review in Spanish]"
    },
    {
      "text": "Even if it doesn't raise the stakes of the genre, there's enough potential to turn this funny and smartly written caper into another entertaining Soderbergh franchise."
    },
    {
      "text": "You'll certainly find bracingly funny moments scattered throughout an amusing tale that benefits with the sprightly insouciance adopted by a filmmaker who has nothing to prove."
    },
    {
      "text": "Soderbergh has returned in top form to prescribe an entertaining and very enjoyable exhibition of himself. [Full review in Spanish]"
    },
    {
      "text": "Logan Lucky is a fun heist flick with a satisfyingly smart twist, too, full of great performances and deadpan humor and it will eventually find an audience, even if it's not a box office smash. Movies this fun and well-made always do."
    },
    {
      "text": "Welcome back, Steven."
    },
    {
      "text": "... the redneck answer to Ocean's Eleven (2001), as suggested one of the many winks of the film. [Full review in Spanish]"
    },
    {
      "text": "Lively, cunning and witty. [Full review in Spanish]"
    },
    {
      "text": "A hilarious and crazy parody that takes its raw material very seriously and moves between the ridiculously sublime to give the spectator memorable moments. [Full review in Spanish]"
    },
    {
      "text": "While Logan Lucky falls strictly into the category of popcorn entertainment, that doesn't make it any less worthy of praise."
    },
    {
      "text": "Not so much a slow burner as a damp squib."
    },
    {
      "text": "It is the cleanest heist film I have ever seen."
    },
    {
      "text": "... Logan Lucky is dazzlingly entertaining, while its surprising core ultimately gives way to an impact that is much more profound and poignant than you expect it to be."
    },
    {
      "text": "Logan Lucky is sensational, the fact it stole my heart away with seemingly so little effort whatsoever the greatest heist of them all."
    },
    {
      "text": "A clever, goofy and a thoroughly entertaining ride."
    },
    {
      "text": "Logan Lucky is delightful entertainment."
    },
    {
      "text": "Soderbergh raises clumsy and absurd moments to keep the mood, wrapped in country-style musical atmospheres like John Denver and Creedence Clearwater Revival. [Full review in Spanish]"
    },
    {
      "text": "A flighty shrimp and grits caper that willfully evokes the best - and a little of the worst - of [Soderbergh's] billion dollar-grossing [Ocean's] trilogy."
    },
    {
      "text": "Need escape? Logan Lucky is for you."
    },
    {
      "text": "Logan Lucky is intelligent comedy presented through absolute stupidity, and I feel lucky to have watched it."
    },
    {
      "text": "One of the most pure fun times I've had at the movies this year."
    },
    {
      "text": "Directed by Steven Soderberg, the film is intended as a backhander to the director's own Ocean's 11 trilogy, which were all glossy, hi-tech, largely unfunny and totally lacking in ideas. Logan Lucky certainly provides an entertaining counter punch."
    },
    {
      "text": "...  Logan Lucky  speeds and cruises like the freshest Ford Mustang. It shifts and drifts without any sign of choking."
    },
    {
      "text": "Logan Lucky is emblematic of the classic 1980s Hollywood blockbuster: it is great fun while it lasts, but you will forget it soon after."
    },
    {
      "text": "[Logan Lucky] is packed with deadpan humour, speedway action and a myriad twists."
    },
    {
      "text": "Stylish but shallow, this could be the director's next franchise, along with Eleven and Magic Mike."
    },
    {
      "text": "...the movie, despite its raft of appealing attributes, comes off as a forgettable caper that could (and should) have been so much better."
    },
    {
      "text": "If nothing else, see the film for Craig's portrayal of pure larcenous joy. It is a thing of beauty, as white hot as his livid blue eyes."
    },
    {
      "text": "Come for the zippy comedy about ordinary people mastering their own destinies. Stay for the entertaining filmmaking masterclass."
    },
    {
      "text": "A singular film-maker returns from a cinematic sabbatical in qualified triumph. We're lucky to have him."
    },
    {
      "text": "What could go wrong? Rather a lot and the most enjoyable parts of. Soderbergh's smartly written film involve the negotiations and shared worries of the amateurish but thoroughly lovable gang."
    },
    {
      "text": "He's made great movies in both categories, but with Logan Lucky, Soderbergh the studio-movie entertainer and Soderbergh the clinical, experimental stylist fully merge."
    },
    {
      "text": "Logan Lucky hums and purrs along like an Xfinity Ford Mustang, although, once the smoke clears, you may find yourself wondering if you've been watching a film about anything."
    },
    {
      "text": "Soderbergh films the movie with swing, relishing the overlapping and intertwining strands of the complex plot, the brightly lit personalities of the characters it involves, and the magnificently conceived, essential tiny details ..."
    },
    {
      "text": "Though the prison break and heist scenes are slickly and efficiently staged, the film's great strength is its good nature."
    },
    {
      "text": "Clever, wildly entertaining West Virginia-set heist comedy-a terrific entertainment described as an \"Ocean's 7-Eleven\" inside the movie itself...warmly empathetic embrace of its economically dismissed characters... wears its kindly politics on its sleeve"
    },
    {
      "text": "It would be a fabulously funny and endlessly entertaining summer treat no matter who was making it - though it's hard to imagine anyone making it as well as Soderbergh."
    },
    {
      "text": "Here is a likable, sometimes uproarious, movie in which every actor comes up with something funny. We've got a lot of Southern gothics, but very few southern Ealing comedies."
    },
    {
      "text": "While it's overlong and sometimes disjointed, this heist flick delivers genuinely likable characters, winning performances and solid laughs."
    },
    {
      "text": "The charm of this film is not the heist, which is ridiculously complicated and improbable, but in its combination of quirky, often very funny, characters and the entirely earnest way the actors play these characters."
    },
    {
      "text": "Steven Soderbergh returns to the big screen after a self-imposed \"retirement\" with a movie that's very much in the vein of his Ocean's trilogy but pulpier and quirkier -- and tons of fun."
    },
    {
      "text": "Fun enough and diverting enough while you're in the middle of it, but hints of something much richer and more satisfying dangle just out of its reach."
    },
    {
      "text": "Daniel Craig displays a gift for character comedy that suggests he'll have plenty of new and exciting avenues to explore in his post-Bond career."
    },
    {
      "text": "Wildly entertaining."
    },
    {
      "text": "Expertly made but strangely uninvolving."
    },
    {
      "text": "Steven Soderbergh returns from his self-imposed retirement with a hillbilly heist movie that has too many funny accents but not enough funny lines."
    },
    {
      "text": "Soderbergh directs with his trademark pace and panache, but to this he adds an obvious affection for his hapless hillbilly heroes."
    },
    {
      "text": "Steven Soderbergh ... is a steady hand when it comes to these convoluted crime capers and this pleasingly unspools to reveal a plot within a plot."
    },
    {
      "text": "Not the precision near-masterpiece that Out of Sight is, nor as tight or funny as the Ocean's films, but it's certainly got all the requisite qualities [of the genial heist movie] ... goes down smooth and easy ... the jokes raise a smile [not] a laugh."
    },
    {
      "text": "If this is the kind of eminently stylish and self-assured work that comes after taking a four-year hiatus from feature filmmaking, perhaps more directors should start looking into extended vacations as well."
    },
    {
      "text": "What a fun movie."
    },
    {
      "text": "Like in the Ocean films, Soderbergh's loaded A-list goes on and on."
    },
    {
      "text": "Logan's Lucky feels like a filmmaker re-indulging a passion. It's beautifully shot, as stylish as ever, impeccably acted and typically articulate."
    },
    {
      "text": "Logan Lucky feels like the work of a filmmaker with nothing to prove, neither sententious seriousness of purpose nor technical knowhow."
    },
    {
      "text": "A couple of clicks toward even more weirdness and Logan Lucky might have landed Soderbergh in Coen Brothers territory. Now that really would have been something to behold."
    },
    {
      "text": "All national and industry politics aside, Logan Lucky is a high-octane gas, a shaggy-dog story that's hard to outguess."
    },
    {
      "text": "It's USP is that it's \"a red-necked Oceans\" or \"a hillbilly Oceans\" so, in other words, it's a riff on Oceans. Soderbergh directed the Ocean's franchise, so it is hardly a stretch for him. Or us, for that matter."
    },
    {
      "text": "Soderbergh... remains a talented filmmaker with an instinctive gift for pacing and style. Cinephiles can rejoice that his self-imposed retirement seems to be over, even if he doesn't push himself too hard in this modest return."
    },
    {
      "text": "Filled with colourful characters, crazy situations, clever camera shots and choice soundtrack cuts, Logan Lucky's beautifully layered plot features more twists and turns than a Nascar race (which admittedly isn't hard)."
    },
    {
      "text": "Remember how panicked we all were when Soderbergh said he was retiring a few years back? Thank the film gods, there's always one last heist."
    },
    {
      "text": "With Logan Lucky, Soderbergh, one of our most inventive and unpredictable directors, just wants to have fun and bring the audience in on it. That's going to be all right with a lot of us."
    },
    {
      "text": "If the Ocean's Eleven movies left you with the urge to upgrade your wardrobe, Logan Lucky might inspire a day at the races."
    },
    {
      "text": "It's always supremely watchable, but rarely, if ever, commits itself to genuine jeopardy or suspense."
    },
    {
      "text": "We admire the cheek and chic of how it's done. We wonder quite why it was thought worth doing."
    },
    {
      "text": "The film's comedy is loose and generous, and its esprit de corps sneaks up on you with a soft tread."
    },
    {
      "text": "The ideal combination of grown-up concerns and childlike joy for big goofy movies."
    },
    {
      "text": "Logan Lucky builds to one of those impossibly complicated heists that only ever happen in movies and rather contradicts the notion that the Logans are stupid or cursed."
    },
    {
      "text": "Steven Soderbergh makes entertaining, well-crafted films. Logan Lucky is no different. If you're in the mood for a heist-comedy that looks fantastic, you're not going to go wrong."
    },
    {
      "text": "Daniel Craig steals the show."
    },
    {
      "text": "[Logan Lucky] is not going to win him any Oscars but Soderbergh certainly appears to have recovered his zest for filmmaking."
    },
    {
      "text": "Soderbergh, back from a self-inflicted hiatus, is the perfect man to bring this Rebecca Blunt screenplay to life, utilising his experience in this sub-genre to triumphant effect."
    },
    {
      "text": "A frolicsome rural crime thriller."
    },
    {
      "text": "The movie almost has enough assured touches and aromatic performances to make you overlook that the humour is generic at times and that the story suffers from not having a genuine antagonist to shake things up."
    },
    {
      "text": "Soderbergh's most entertaining film, since at all times on the screen you can tell that the cast is having a great time. This is contagious and compensates many times for the slow development of the plot. [Full review in Spanish]"
    },
    {
      "text": "Logan Lucky is like a cheerful sing-a-long of a movie, sweeping its audience along easily, even if some of the details quickly vanish from memory."
    },
    {
      "text": "Soderbergh knows precisely how the formula works: likable leads, eccentric supporting characters, a complicated plan, unexpected glitches..."
    },
    {
      "text": "An absurd -- and absurdly funny -- cinema experience, marking a welcome return to the form by Soderbergh."
    },
    {
      "text": "Lithe, lively and ludicrous, Logan Lucky is a joyful celebration of Southern culture with a generous helping of down-home whimsy."
    },
    {
      "text": "...suffers from more than one kind of Southern drawl."
    },
    {
      "text": "Logan Lucky is like those inline tube slides at a water park: you don't worry about where you're going, because getting there is so much darned fun."
    },
    {
      "text": "Soderbergh is back for real, with no signs of rust at all"
    },
    {
      "text": "Transposing the milieu from glitz to grits . . .it does more set an intricate heist flick in the back roads of Appalachia, it also makes a sly statement about class, culture, and our preconceived notions about those two things."
    },
    {
      "text": "The heist is fun, but the detailed inside look at the workings of a speedway really makes Logan Lucky special."
    },
    {
      "text": "Soderbergh again proves his mastery at this sort of comic crime thriller."
    },
    {
      "text": "We're talking at least 11, 12, 13, maybe 14 players involved in robbing the Charlotte Motor Speedway. (Not that the Rube Goldbergian plot -- with the accent on rube, of course -- bears any resemblance to any of Soderbergh's trio of \"Ocean's\" movies)."
    },
    {
      "text": "Such is the merriment of the new movie, and so spirited is its pace, that you barely notice the wavering of the tone."
    },
    {
      "text": "Steven Soderbergh's amusing, escapist, 'Oceans 7-Eleven' heist is a blast!"
    },
    {
      "text": "A very funny heist film."
    },
    {
      "text": "This picture suggests a great director easing back into the feature-film game."
    },
    {
      "text": "Just as impressive as Logan Lucky's technical proficiency is its winning embrace of fun."
    },
    {
      "text": "The podunk milieu in which Logan Lucky is set feels overstated, like a New Yorker taking a selfie in front of a Stuckey's."
    },
    {
      "text": "Like its characters, the film has no airs about it, and simply exists to entertain viewers and it does that with plenty of aplomb and ease. (Full Content Review for Parents - Violence, Profanity, etc. - also Available)"
    },
    {
      "text": "Logan Lucky is an entertaining romp powered by a smart script, strong performances across the board, and great direction."
    },
    {
      "text": "Logan Lucky is a fun and engaging caper movie directed by Steven Soderbergh."
    },
    {
      "text": "After four years away, it's far better to have too much of a Soderbergh movie than not enough."
    },
    {
      "text": "Craig manages to steal each scene he's in with his bleached hair, impeccable Southern accent and hair-trigger personality. An Oscar nomination for Best Supporting Actor is likely."
    },
    {
      "text": "Logan Lucky is as charming and welcome as toenail fungus."
    },
    {
      "text": "It's rare that you can enter a film with full confidence that everyone involved knows what they're doing, and they're going to be excellent doing it. And in that way, Logan Lucky is the ultimate caper."
    },
    {
      "text": "Ocean's 7-Eleven, indeed. Amiable heist flick."
    },
    {
      "text": "It's good to have Soderbergh back, even if he never was really away."
    },
    {
      "text": "Steven Soderbergh's \"Logan Lucky,\" written by Rebecca Blunt, is a down-home heist movie that comes across like a Southern-fried variation of one of his \"Ocean's\" films."
    },
    {
      "text": "LOGAN LUCKY is a delight, peppered throughout with clever set-ups and pay-offs beset only by an over-abundance of characters."
    },
    {
      "text": "With a charmingly relatable cast of quirky losers...and a plot that unfolds like a Rube Goldberg construction, \"Logan Lucky\" is ideal summer entertainment."
    },
    {
      "text": "Trotting out a cast of high-caliber actors, all playing against type, Soderbergh spins a wily, joyous slice of Southern-fried outlaw adventure."
    },
    {
      "text": "Director Steven Soderbergh is back and firing on all cylinders in Logan Lucky, a Southern-fried heist comedy that is, like its main characters, smarter than it lets on."
    },
    {
      "text": "This movie does not aspire to greatness or significance; being extremely clever and thoroughly competent is the goal here."
    },
    {
      "text": "The best heist film in years."
    },
    {
      "text": "The script, the direction and the performances work in concert like a souped-up muscle car."
    },
    {
      "text": "Soderbergh's ace-in-the-hole has to be the young Farrah Mackenzie. When she has her big scene, no parent could resist the tug at their heart-strings. More than a heist comedy, \"Logan Lucky\" is an endearing father-daughter love story."
    },
    {
      "text": "A star-studded heist flick that calls to mind some of the eclectic director's most popular work even if it falters a bit at the end."
    },
    {
      "text": "A slick, smarter-than-your-average-bear heist comedy that moves and grooves with all the hallmarks of a Soderbergh caper. He's back, baby."
    },
    {
      "text": "The story here is clean and the characters very charming, and it doesn't fall into the trap of being smugly pleased with itself by overcomplicating matters (ahem, Ocean's Twelve)."
    },
    {
      "text": "'Logan Lucky' succeeds because Soderbergh shows not only respect for his characters, but reveals their hearts and souls. He gently pushes you to embrace them."
    },
    {
      "text": "Keough is a standout and Craig is a complete hoot."
    },
    {
      "text": "Intelligent, fun and well executed, we could even say that the film works as a \"Ocean's Fourteen\". [Full review in Spanish]"
    },
    {
      "text": "When the plot stops cold for a beauty-pageant performance of exquisite purity, you'll feel like you're watching the most American film of the year."
    },
    {
      "text": "Didn't I read somewhere that Soderbergh had retired from filmmaking? This would be a perfect time for him to keep that promise."
    },
    {
      "text": "Logan Lucky is a crackerjack heist film that strongly echoes Soderbergh's other crackerjack heist franchise, but with a uniquely downmarket and genuinely affectionate charm all its own."
    },
    {
      "text": "Smart, clever and hilarious it is fun from start to finish line."
    },
    {
      "text": "It's a lark, if you can tolerate the hammy redneck accents, and confirms that Soderbergh is as agile as ever at knitting together all the moving parts of a complex heist."
    },
    {
      "text": "Steven Soderbergh, with his mysterious screenwriter Rebecca Blunt (reportedly the pseudonym of the director), and a great cast have fun in creating a twisty heist thriller with a sense of humor."
    },
    {
      "text": "Soderbergh is in the mood for some fun, and so is a star-filled cast led by Channing Tatum, Adam Driver and Daniel Craig."
    },
    {
      "text": "Amusing and big-hearted, Soderbergh delivers an entertaining tale of honour among thieves."
    },
    {
      "text": "[T]he film is tightly constructed in its plotting, while also being loose enough in its focus to appreciate what clever and relatable characters it possesses."
    },
    {
      "text": "[Soderbergh's] big-screen comeback, Logan Lucky, finds him taking the relatively easy option of the lighthearted heist movie, something he's always done well."
    },
    {
      "text": "The whole movie is a trick, reversing our expectations at nearly every turn and casting actors in roles that they were not exactly born to play, but do so with relish."
    },
    {
      "text": "Steven Soderbergh has returned from a four-year motion-picture retirement to once again show us that when it comes to crafting robberies of high stakes-even ones involving the lower classes-he remains the slickest of them all."
    },
    {
      "text": "After four years of \"retirement\", Soderbergh shows that he is still in perfect shape. [Full review in Spanish]"
    },
    {
      "text": "As sunny and implausible as an old-timer's anecdote, with a few hints at topicality that don't detract from its insouciance. It's fun for fun's sake."
    },
    {
      "text": "While Logan Lucky gives off the impression of a shaggy character-based comedy, such an assessment shortchanges how deliriously clever it is."
    },
    {
      "text": "Who among us predicted that Channing Tatum would become a major actor, equally adept at light-fingered comedy and low-key contemporary dramas?"
    },
    {
      "text": ". . .this Friday brings with it Logan Lucky, a southern-fried caper of virtuosic showmanship that, beneath its easygoing exterior, also succeeds at tapping into larger s...[ END HERE ]ocioeconomic concerns"
    },
    {
      "text": "Soderbergh's return to features is a redneck riff on his Ocean's 11, a cool breeze of summertime sweetness that restores the good name of movie escapism. Daniel Craig is off-the-chain hilarious."
    },
    {
      "text": "Like the best of his movies, this heist film retains its essential shagginess despite the A-list stars headlining it, and it reminds us what a nifty flair the director has for light entertainment."
    },
    {
      "text": "As a hotly anticipated comeback, it feels like a slightly dippy, ultimately disposable warm-up of a director whose brains, chops and judicious taste we need more than ever."
    },
    {
      "text": "\"Logan Lucky\" is his down-home version of the \"Ocean's\" franchise, with NASCAR instead of the Bellagio, but it's every bit as cheeky, fun and funny."
    },
    {
      "text": "Essentially a red-state Ocean's Eleven - a fizzy, twisty Southern-fried heist flick that's more enjoyable the less you try to dissect it."
    },
    {
      "text": "Soderbergh rolls the dice with 'Logan Lucky' and comes up with a winner."
    },
    {
      "text": "Steven Soderberg's funny, underdog heist movie is a heartfelt paean to the kinds of Southern working-class whites normally caricatured as Confederate-flag-waving racists."
    },
    {
      "text": "The movie is smart and funny, though ultimately it's less noteworthy as an entertainment than as a marketing concept."
    },
    {
      "text": "The result is a breezy, slight, Southern-flavored movie where the cast appears to be having enough fun to prove mildly infectious."
    },
    {
      "text": "The script's vibe recalls Soderbergh's arch, knowing \"Ocean's\" movies, but also evokes older pictures such as \"Bank Shot\" in the early '70s or \"Who's Minding the Mint?\" in the late '60s."
    },
    {
      "text": "But the best part of Logan Lucky is that from the get-go you know you're in confident hands, and whatever's about to happen, it's going to be great."
    },
    {
      "text": "A nice change of pace for Soderbergh, who, for the first time in a long time, seems genuinely interested in providing an entertaining ride."
    },
    {
      "text": "Perhaps \"Logan Lucky\" is best appreciated as a stealth commentary on tough times in America. It takes a director of Soderbergh's gifts to actually make that funny."
    },
    {
      "text": "If it verges on being a little too pleased with itself for its own good, that's an acceptable price to pay for something that makes you smile."
    },
    {
      "text": "In the very least, Hal Needham's Smokey and the Bandit films displayed a fair amount of affection amid the hamming for their shit-kicking rubes."
    },
    {
      "text": "Heartfelt felicitations to [Steven] Soderbergh on his rebirth of the cool."
    },
    {
      "text": "Jimmy's team is like a blue-collar mirror image of the Ocean's crew. But there's more going on here than a story about a bunch of amateurs attempting a complicated robbery."
    },
    {
      "text": "A precision-tooled entertainment made by experts, and sometimes more than that. Watching it is like finding money in the pocket of a coat that you haven't worn in years."
    },
    {
      "text": "The glitz and glamour of the Ocean's trilogy is in a completely different area code than Logan Lucky, but Soderbergh's latest has the same terrific camaraderie and joy as those movies."
    },
    {
      "text": "I liked the movie - it's certainly well made, and a lot of fun - but I mostly found myself laughing at it, not with it."
    },
    {
      "text": "Logan Lucky reminded me most of Howard Hawks' El Dorado. It has the tossed-off, casual sophistication of an old master's late work."
    },
    {
      "text": "Rating Soderbergh's back catalogue is like comparing apples and oranges and tractors, but this is in his top bracket. Welcome back, Mr Soderbergh."
    },
    {
      "text": "A high-spirited hillbilly-heist caper with a dynamite, all-star ensemble cast."
    },
    {
      "text": "It ... feels like the director is trying to reverse-engineer one of the Coen brothers' loopier excursions and not getting every one of the pieces in order. But he comes close."
    },
    {
      "text": "The actors mostly lean hard on comical redneck accents, and the slow-moving plot features way too many leaps of logic."
    },
    {
      "text": "Quite simply, one of the most sheerly enjoyable movies of the year....we're lucky to have [Soderbergh] back."
    },
    {
      "text": "So warmheartedly enthusiastic, it's hard not to get swept away with this group of not-so-average Joes."
    },
    {
      "text": "Logan Lucky may be more of the same. But more of the same, from Soderbergh, is what more summer movies should aspire to be."
    },
    {
      "text": "Soderbergh smoothly glides us through this NASCAR world, emanating an old-fashioned Hal Needham vibe, but with greater character depth and extra IQ points."
    },
    {
      "text": "Logan Lucky lands somewhere between Magic Mike and the Ocean's trilogy. Turns out, that's one hell of a sweet spot."
    },
    {
      "text": "I'm really glad Soderbergh's back doing what he does best. I didn't know how much I missed the guy."
    },
    {
      "text": "Logan Lucky is a hoot, a holler, a drag at times and doesn't know when to end but it's fun."
    },
    {
      "text": "This one offers pleasures you won't find anywhere else."
    },
    {
      "text": "So who really needs Logan Lucky? More to the point: Will they buy this in the South?"
    },
    {
      "text": "Soderbergh is perhaps Hollywood's finest technician, and it's a pleasure to watch him tour his Vegas act through Appalachia."
    },
    {
      "text": "There's no question that the film is full of gentle, good-natured mockery of the sort of knucklehead culture that we call \"redneck\" but it's all very sympathetic -- more so, even, than a Jeff Foxworthy You May Be a Redneck If (filll in the blank) routine."
    },
    {
      "text": "Some will write off Logan Lucky as one of Soderbergh's most frivolous efforts, but that would be a mistake."
    },
    {
      "text": "Logan Lucky is great fun and one of the most purely entertaining movies of the year."
    },
    {
      "text": "Mr. Soderbergh revels in squareness, and in a loose self-confidence that disguises its mastery. \"Logan Lucky\" is a terrific movie."
    },
    {
      "text": "I think that's a big part of what makes Logan Lucky a very fun movie: You're lost, you're lost, you're lost -- and then it all makes so much sense that you feel like you should have known what was happening all along."
    },
    {
      "text": "Independently financed and distributed by Soderbergh, Logan Lucky is a magnificent movie that comes disguised as a modest one. Or, as I like to call it, a Joe Bang."
    },
    {
      "text": "An eccentric combo of scrappy crime caper and angular redneck comedy, Logan Lucky shouldn't work anywhere near well as it does."
    },
    {
      "text": "Soderbergh keeps the action light and playful, and lets the cast members find their own silliness within it."
    },
    {
      "text": "Southern flavor, rampant goofiness and fun twangs go a long way in making director Steven Soderbergh's cinematic return such a sparkling hoot."
    },
    {
      "text": "For a fast and funny crime flick, Logan Lucky has plenty of grunt under the hood."
    },
    {
      "text": "A fun and unpretentious romp that benefits from smart pacing, likeable characters and a stick-it-to-the-man undercurrent that helps keep things moving along."
    },
    {
      "text": "It's a genuine effort by talented people that never quite comes off."
    },
    {
      "text": "The whole thing comes together to form the best Burt Reynolds movie he never made."
    },
    {
      "text": "The endearing charm of the characters - along with a plot that teases the audience with just enough information to keep them wondering what's next - makes Logan Lucky a winner."
    },
    {
      "text": "Sometimes, the only reason for doing anything is to have a little fun, and Soderbergh seems to be having a lot of it."
    },
    {
      "text": "Steven Soderburgh's return to the big screen may look like an Ocean's reboot a la NASCAR, but don't you go thinking this is some smart alecky snobby spin."
    },
    {
      "text": "Having successfully pulled off three Danny Ocean cons, director Steven Soderbergh is looking for a new bank vault to plunder. Logan Lucky turns out to be a playfully subversive variation on the theme."
    },
    {
      "text": "Soderbergh's here to have fun, and his mood is contagious."
    },
    {
      "text": "Flaws aside, it is a darn good heist, and sure to leave you with a smile on your face. We should be glad Soderbergh is back, hopefully this time for good."
    },
    {
      "text": "An updated, more sophisticated take on those old Burt Reynold's seventies good ol'boy flicks."
    },
    {
      "text": "Logan Lucky is both a Robin Hood fantasy and a uniquely Soderberghian lark, an ensemble comedy that's simultaneously effervescent and cerebral."
    },
    {
      "text": "If you'd like to see a blend of Ocean's 11 and Talladega Nights: The Ballad of Ricky Bobby, then Logan Lucky is for you."
    },
    {
      "text": "Logan Lucky has the briskness and sheen of a professional, a man who, after years of restlessness, has become comfortable enough to simply tell a story with confidence, clarity and gusto."
    },
    {
      "text": "The snappily-edited and uber-efficient working-class caper Logan Lucky is so ephemeral, its screenwriter may not even exist."
    },
    {
      "text": "Fun, snappy and classically Soderbergh-ian delight with impeccable, Ocean's-like rhythms, shrewdly set against the everyday struggles of small-town America."
    },
    {
      "text": "Four years after his self-imposed retirement, maverick director Steven Soderbergh takes the easy way out. Or, rather, back in."
    },
    {
      "text": "While even the film itself cites the heist as \"Ocean's 7-11\", it's got a flavor and energy all its own. It's a blast from start to finish."
    },
    {
      "text": "Logan Lucky is a hoot. It's the sort of movie that allows you to laugh, relax and let everything wash over you... Everything is laid back - from the characters to the humour - and the payoff is delicious."
    },
    {
      "text": "Logan Lucky is a hillbilly heist caper brimming with good natured humor."
    },
    {
      "text": "Soderbergh shows here that the melding of mainstream storytelling and artful execution is possible."
    },
    {
      "text": "Logan Lucky is easygoing entertainment that, on occasion, gently brushes up against its stiffer real-world framing. I'm not sure the film is as successful in doing that as Magic Mike is, but it still makes for an intriguingly toned film."
    },
    {
      "text": "With his latest directorial effort, Soderbergh has made a film that not only constantly pokes fun at its own characters and their lives, but finds a way to imbue each of them with a soul and heart along the way."
    },
    {
      "text": "Of course, there's a level of tactical sophistication to this kind of fantasy-crime scenario, but Blunt's screenplay scores many points by making the follow-through of the plan so damned pleasurable."
    },
    {
      "text": "Soderbergh executes his cine-comeback with lan, aided by winning A-team work from Tatum, Driver and Craig."
    },
    {
      "text": "The kind of small-scale, shaggy dog story Hollywood rarely makes these days."
    },
    {
      "text": "Logan Lucky is one country-fried hootenanny of a heist thriller that goes off with a (Joe) Bang."
    },
    {
      "text": "A purely auteur-driven lark slipped into an era when studios no longer want to work with directors with personality and pesky calls for final cut - a high entertainment with a handmade feel."
    },
    {
      "text": "Logan Lucky feels a lot like Oceans 14."
    },
    {
      "text": "This is a brilliantly constructed, whip-smart, and laugh-out-loud-funny romp from a filmmaker whose precision and craft is nearly unparalleled."
    },
    {
      "text": "Steven Soderbergh's Logan Lucky is a high-spirited, low-down blast."
    },
    {
      "text": "Channing Tatum, working with Soderbergh for the fourth time, is at his sympathetic and charismatic best in Logan Lucky."
    },
    {
      "text": "Even if it needed one last push to make it truly exceptional, there's a lot to enjoy here. And Soderbergh once again attracts a cast it's a pleasure to spend time with."
    },
    {
      "text": "This is a good-times film that doesn't put on airs, dress to impress or pretend to be something it isn't. It just aims to please and does a pretty good job of it."
    },
    {
      "text": "This blue-collar \"Ocean's Eleven\" is a smooth-running, pleasantly familiar crime caper. In a movie full of cons, the greatest may be how deceptively easy Steven Soderbergh makes the whole enterprise seem."
    },
    {
      "text": "As the film teeters the line between ridiculous and generic screwball, the all-star cast dazzles to hilarious effect."
    },
    {
      "text": "Logan Lucky embodies so much of what's made Steven Soderbergh that rare journeyman between arthouse and multiplex."
    },
    {
      "text": "A heist comedy that reaffirms why Soderbergh belongs behind the movie camera."
    },
    {
      "text": "Soderbergh returns from retirement with a silly heist movie that packs real soul."
    }
  ],
  "release_year": 2017,
  "duration": 119,
  "genres": [
    "Comedy",
    "Crime",
    "Drama"
  ],
  "synopsis": "West Virginia family man Jimmy Logan teams up with his one-armed brother Clyde and sister Mellie to steal money from the Charlotte Motor Speedway in North Carolina. Jimmy also recruits demolition expert Joe Bang to help them break into the track's underground system. Complications arise when a mix-up forces the crew to pull off the heist during a popular NASCAR race while also trying to dodge a relentless FBI agent.",
  "popularity": 7.6,
  "poster_url": "https://image.tmdb.org/t/p/original/fnbjcRDYn6YviCcePDnGdyAkYsB.jpg"
}