{
  "movie_name": "Marriage Story",
  "movie_id": "marriage_story_2019",
  "total_reviews": 408,
  "reviews": [
    {
      "text": "As a painfully honest portrait of a relationship on the rocks inches from reconciliation, Marriage Story is a revelation, but films including The Worst Person in the World have done it better."
    },
    {
      "text": "“Marriage Story” could’ve easily been called “Divorce Story”, but the contradicting title suggests that marriage is a failed institution."
    },
    {
      "text": "Here’s director Noah Baumbach at his usual best, lending a levelheaded perspective on a love on the rocks and the unnecessary vitriol born out of a couple’s disappointments and frustrations."
    },
    {
      "text": "If you want to know what emotional evisceration feels like, then look no further than Netflix’s upcoming movie Marriage Story, a rich and superbly made balancing act of joy and sorrow."
    },
    {
      "text": "Director Noah Baumbach captures a marriage life cycle in all its phases with such emotion and detail, almost as if he has a personal connection to the experience. Whatever the case, it has led to his best work to date."
    },
    {
      "text": "Adam Driver and Scarlett Johansson's performances and charm make this film intensely watchable."
    },
    {
      "text": "Scarlett Johansson and Adam Driver give the best performances of their lives. Despite its replay value being affected (a rewatch is very unlikely), it's a phenomenal lesson in storytelling that stays with us long after it's finished."
    },
    {
      "text": "Channeling this nostalgia, and building its conversations off the back of its neatly-drawn dualities, Marriage Story finds its meat in the magnification of minutiae..."
    },
    {
      "text": "Noah Baumbach’s astounding family drama..."
    },
    {
      "text": "Writer/director Noah Baumbach’s incisive and insightful examination of a dissolving marriage features searing performances by Adam Drive and Scarlet Johansson."
    },
    {
      "text": "[It] eventually got under my skin as about the sadness of winding down a long-term relationship that simply didn't work, when two partners who've thoroughly internalized each others' rhythms, and who may never fully unlearn that intimacy, have to split."
    },
    {
      "text": "There is an old adage. Write what you know. In doing so [Baumbach] has delivered his most emotional, heartfelt, accomplished and grown-up film to date."
    },
    {
      "text": "The enormous thing about Marriage Story is that presents life as it is, filled with gray areas and with disappointment amid happiness. Probably the best acting Adam Driver and Scarlett Johansson have ever given. [Full review in Spanish]"
    },
    {
      "text": "As we sit back and observe this cross-country separation, Baumbach gives us lots to consider: relationships are tough, splitting up is tougher, and for some lawyers divorce is a lucrative business."
    },
    {
      "text": "‘…Marriage Story is the most mature work from Baumbach so far, a complex view of good people who find that goodness isn’t enough to immunise them against the insidious viruses of past-vanity and domestic over-reach…'"
    },
    {
      "text": "Noah Baumbach’s narrative does a wonderful job of revealing the retrospective romance of companionship through the procedural pain of separation."
    },
    {
      "text": "Marriage Story has much more on its mind than other films about divorce, which elevates it beyond the limits of its well-treaded subject matter and into a realm of extraordinary filmmaking."
    },
    {
      "text": "Marriage Story is a weighty, dramatic look at a once happily married couple going through the many painful stages of separation followed by divorce. It's anchored by layered, exceptional performances by Adam Driver and Scarlett Johansson."
    },
    {
      "text": "Baumbach's heartwrenching follow up to The Meyerowitz Stories is equally loud and anguished as it is soft and sweet."
    },
    {
      "text": "A raw and real look at love and marriage."
    },
    {
      "text": "Marriage Story is most simply a beautiful film about love , full of humour and heartache, that simultaneously wounds and comforts."
    },
    {
      "text": "Heartbreaking as this story is, it has potential to help healing conversations take place."
    },
    {
      "text": "Both leads perfectly hit that elusive note of fragile human contradiction that could only come from an inner experience of real loss. And immense talent."
    },
    {
      "text": "Noah Baumbach brings clarity to chaos in one of the year's best films."
    },
    {
      "text": "Kudos for the funniest sequence of the year, at least in my book: the one where Charlie (Adam Driver) cuts himself while showing off a childish stunt."
    },
    {
      "text": "Noah Baumbach has finally made a movie that can be appreciated by most moviegoers without sacrificing quality or toning down his acerbic nature."
    },
    {
      "text": "It is difficult, in any event, to consider as substantial people for whom the only \"reality\" that means anything occurs within a theater or a television studio, or perhaps a bedroom, on one of the two \"Coasts.\""
    },
    {
      "text": "Comic moments are there, adding to the rich repertoire of notes that Driver and Johansson manage to hit in these two, yes, revelatory performances."
    },
    {
      "text": "A sensational blend of laughs, tears, love, and hope."
    },
    {
      "text": "Marriage Story works due to its incredible performances and generous pacing."
    },
    {
      "text": "Something of a first-world dilemma on paper, but wholly relatable in execution."
    },
    {
      "text": "These power-suited figures are hilarious. Yet Baumbach and his actors never resort to farce, and always find room for real pain and tenderness."
    },
    {
      "text": "The next morning I had a post-Marriage Story hangover and I hated myself for liking it."
    },
    {
      "text": "A film I loved, though I'm not sure it's a film I'll ever feel the need to revisit again."
    },
    {
      "text": "A moving, unflinching, uncompromising and devastating portrait on divorce."
    },
    {
      "text": "This is a low-key masterpiece from Baumbach, who has constructed one of the films of the year from the chaotic fragments of a broken marriage."
    },
    {
      "text": "Two towering performances breathe uncommon humanity into writer/director Noah Baumbach's study of a marriage on the rocks."
    },
    {
      "text": "If you want a very honest look at what it's like to go through a divorce, then Marriage Story is just that. This isn't the kind of film that sugarcoats anything and instead takes its audience on an emotional rollercoaster from start to finish."
    },
    {
      "text": "Marriage Story is a solid film with an unflinching look...a bit self-serving...but still a great movie."
    },
    {
      "text": "Baumbach's screenplay is as witty as it is melancholy. There's plenty of laughter to go with the sadness. Marriage Story doesn't wallow in misery."
    },
    {
      "text": "Writer/director Baumbach coaxes the very best out of his players. \"This is why I love Scarlett and Adam...\""
    },
    {
      "text": "Don't be fooled by the title. \"Marriage Story\" should be called \"Divorce Story.\" That would better prepare you for the highly realistic, yet emotionally draining experience of Noah Baumbach's latest film."
    },
    {
      "text": "It's not that Marriage Story is completely disinterested in the gender dynamics at play in heterosexual relationships, and the way they reverberate in society at large. But its brief moments of commentary don't translate..."
    },
    {
      "text": "A humane work with impressing acting and endearing script that reminds you the fragility of love and how painfulness divorce is. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is one of Baumbach's most mature works. Moving away from his eccentric characters (like Greenberg or Frances Ha), keeping his focus on interpersonal and family relationships [Full review in Spanish]"
    },
    {
      "text": "Full of life and humanity, and probably a lot funnier than you'd expect."
    },
    {
      "text": "The result seems superficial, predictable and not very emotional. I would have preferred the lawyers' version. [Full review in Spanish]"
    },
    {
      "text": "It's an arduous journey that's sometimes difficult to watch, but it provides genuine catharsis."
    },
    {
      "text": "Driver is compelling as a man who experiences the breakup as both an emotional and a physical gut-punch."
    },
    {
      "text": "Good script, good performances; the whole thing comes together really very well [and] the supporting performances really balance the tone effectively."
    },
    {
      "text": "Baumbach's film is sincere, even affectionate, as it follows this disintegrating family unit."
    },
    {
      "text": "Driver and Johansson truly make the most of their performances, creating real, flesh and blood characters that are as definitive to cinema as Meryl Streep and Dustin Hoffman in Kramer vs. Kramer."
    },
    {
      "text": "Here are two likable actors swimming upstream in a current that wants to drown them in detestable melodrama, and for nearly every scene they occupy shared space, we find ourselves praying for psychological intervention."
    },
    {
      "text": "One particularly symbolic scene involving Driver and a small key-chain blade says more about the nature of bad divorces than most films on the subject."
    },
    {
      "text": "This haunting portrait of a marriage falling apart has a realistic, yet pensive approach."
    },
    {
      "text": "Baumbach's approach to the challenge of representing marriage and divorce is to treat both as absurdities. His film, though heavy and at times heart-wrenching, leans heavily into comedy -- self-deprecating and humiliating at times, but no less funny."
    },
    {
      "text": "Baumbach approximates it well, but never quite achieves Bergman's mastery of interior drama."
    },
    {
      "text": "Unlike Kramer Vs. Kramer, which clearly favors Dustin Hoffman's predicament, there aren't any villains in Marriage Story (unless you count the lawyers). In Noah Baumbach's universe, both parties lose something precious."
    },
    {
      "text": "The film captures a palpable love gone awry with a young boy caught in the crossfire. It's a telling, emotionally devastating, yet somehow cathartic work."
    },
    {
      "text": "Baumbach is an expert farceur."
    },
    {
      "text": "\"Cries easily in movies...\" wholly and accurately describes my own experience watching this film."
    },
    {
      "text": "It's wise and emotionally battering, but it never forgets to be crazily funny and doesn't pander. Beautiful, heartbreaking stuff."
    },
    {
      "text": "Jennifer Jason Leigh will never watch this movie, and neither should she."
    },
    {
      "text": "MARRIAGE STORY breathes life into the hardships of having a parter in your life. It's a wonderful film that reveals intimate parts of our lives we may have trouble articulating. It may be a bit uncomfortable, but that's life."
    },
    {
      "text": "Marriage Story follows the confusion and mounting frustrations of Charlie, while Nicole's motivations feel largely opaque."
    },
    {
      "text": "Probably should have been called Divorce Story, but that wouldn't look as welcoming on the marquee!"
    },
    {
      "text": "What is so startling is Nicole and Charlie's lack of depth about their lives. Yes, they mourn the end of their marriage, but Baumbach's script offers no emotional or spiritual rationale for their sorrow."
    },
    {
      "text": "Adam Driver and Scarlett Johansson bring a complexity out of their characters that the screenplay itself sometimes lacks. [Full review in Portuguese]"
    },
    {
      "text": "It may be that the very good acting of Johansson and Driver offers the best answers to these questions, not because they are plausibly ordinary, but because they seem to know so well what it means to leave their fantasy roles behind, bereft of magic..."
    },
    {
      "text": "This movie pulls back the cover on divorce and lets you peek into the emotional and legal process of divorce in a very intimate way. At the same time, the movie also finds humor in the absurdity of the legal and emotional process."
    },
    {
      "text": "What separates Marriage Story from the rest of Baumbach's filmography is that it could have wallowed in pessimism, but there is love and tenderness coursing through its veins."
    },
    {
      "text": "It was great; it was interesting, funny and emotional, but it didn't demand to be seen."
    },
    {
      "text": "A remarkable film... with outstanding performances. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is about demolition and reconstruction. Baumbach has enough good judgement to steer the plot away from melodrama, but the sense of tragedy is there, coating the couple's every thought and action."
    },
    {
      "text": "Elegant, eloquent, deep and heartbreaking, it is a film that will stay with you long after you've seen it."
    },
    {
      "text": "The most entertaining characters are the two lawyers ... they're both just awful and they're in it for themselves ... I would happily watch an entire film or series just about [them] going at each other."
    },
    {
      "text": "While uncomfortable to watch at times, the acting and writing in \"Marriage Story\" make the narrative soar."
    },
    {
      "text": "It is good, just not a favorite or something I will ever watch again."
    },
    {
      "text": "Scarlett Johansson and Adam Driver deliver a real and unflinching look into the theatrics of a struggling marriage. A tragedy, a comedy, and well-written portal into two souls reality"
    },
    {
      "text": "Noah Baumbach's script, about the trials and tribulations of divorce and custody battles, is really nothing we haven't seen before, on big or small screens."
    },
    {
      "text": "In Margot at the Wedding and The Squid and the Whale, Baumbach explored issues of marriage and divorce. But, until now, he's never created anything this emotionally powerful, so overflowing with humanity."
    },
    {
      "text": "Baumbach allows us to get to know the couple better than they know themselves - that is, we get to know them through each other's eyes, as they expose those parts of themselves they haven't yet come to terms with."
    },
    {
      "text": "Marriage Story is a stunning, heart-wrenching window into modern divorce."
    },
    {
      "text": "(Adam) Driver and (Scarlett) Johansson are fantastic here, giving two of the finest performances of their careers."
    },
    {
      "text": "Marriage Story perfectly shows the true, messy side of divorce. The entire cast hits it out of the park with their performances -- and you will feel for both Charlie & Nicole."
    },
    {
      "text": "Traveling along the path forged by a film like Kramer vs. Kramer this is another chapter in the story of marriage."
    },
    {
      "text": "The film is stronger in its more sincere moments and weaker where Baumbach tries to push supposed truisms through gurning conceits."
    },
    {
      "text": "Marriage Story drops Baumbach's trademark comedic quirkiness and embraces a much more melancholic tone in this raw and intimate character study of two individuals."
    },
    {
      "text": "Startling, complex, funny, heartbreaking. The year's best movie."
    },
    {
      "text": "It just reflects life so well, and it's going to choke you up."
    },
    {
      "text": "Deeply thoughtful, emotional and yet surprisingly entertaining, \"Marriage Story\" is without question one of 2019's top five films and a must see."
    },
    {
      "text": "Heart-breaking and poignant."
    },
    {
      "text": "Sharp but humane, gorgeously acted, the new movie might inspire you to rewatch that other great divorce drama, Kramer vs. Kramer. That's not such a bad takeaway."
    },
    {
      "text": "Portrait of an unsatisfying marriage and a messy and sad divorce."
    },
    {
      "text": "Marriage Story, through its overwhelming specificity, feels profound and focused in a way that resists any external flattening of its value."
    },
    {
      "text": "A heartbreaking character study of a couple in total meltdown."
    },
    {
      "text": "A precise proposal that knows how to get the most out of a story with no much news in the plot, but painful and fascinating. [Full review in Spanish]"
    },
    {
      "text": "'Marriage Story' is a definite step up for this filmmaker."
    },
    {
      "text": "The lawyers topic closes with an incongruity: Nicole's gratitude betrays all previous representations of vileness and affirms the superficiality of the film. [Full Review in Spanish]"
    },
    {
      "text": "One of the virtues of the movie is the solid construction of the characters. [Full Review in Spanish]"
    },
    {
      "text": "\"Marriage Story\" lingers long and scratches synapses that nudge you back towards a rewatch, but I don't know if I'm ready."
    },
    {
      "text": "A gut punch of a movie...One of the best of the year."
    },
    {
      "text": "This a movie so horrendously detailed about a divorce that at first you are rooting for him, then her, then him, and on and on. The movie will haunt you forever and will get better and better in your memory."
    },
    {
      "text": "Adam Driver and Scarlett Johansson are both marvelous in the lead roles, while Laura Dern, Ray Liotta, Alan Alda and Julie Hagerty contribute strong support."
    },
    {
      "text": "Driver and Johansson give the film the force it needs to emotionally transcend. [Full Review in Spanish]"
    },
    {
      "text": "Marriage Story is so raw and emotionally burning that the experience is best savoured alone."
    },
    {
      "text": "Some of the scenes here are powerfully intense, but the much-discussed mighty blow-up between Johansson and Driver, which we know is coming, is one of the most shocking sequences you'll see in any movie from 2019..."
    },
    {
      "text": "Marriage Story is a tremendous achievement. It balances the requirements of a stirring relationship drama and its bold statements on the corrupting system that preys on the misfortunes of failed lovers. It is brave and poignant. It is undeniably precious."
    },
    {
      "text": "It's insupportable, false, pretentiously realistic, inhabited by heavy characters, dialogue and situations. [Full Review in Spanish]"
    },
    {
      "text": "Marriage Story is loaded with exceptional performances,... and significant dialogue loaded with enlightening sentences about human life, which makes it an exceptional film. [Full Review in Spanish]"
    },
    {
      "text": "Laura Dern's performance is fantastic. [Full review in Spanish]"
    },
    {
      "text": "The film is at its best when it is portraying conflicted emotions - as old love underlies fresh acrimony."
    },
    {
      "text": "The film fulfilled my expectations and the audiences certainly won't forget how heartbreaking a separation can be."
    },
    {
      "text": "A superb drama from Noah Baumbach, that's devastating and sad, yet funny and tender. Scarlett Johansson and Adam Driver give career-best performances. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is a magnificent movie, perhaps the best of its kind since Ingmar Bergman shot his Scenes from a Marriage back in 1974."
    },
    {
      "text": "[The] couple is, in fact, drifting apart. Why? It's probably best to write only that she's partly to blame and he's partly to blame. Marital bliss is a greeting card phrase. Moods change. Ideas change. Goals change."
    },
    {
      "text": "Marriage Story has earned its reputation as a complicated look at divorce. Johansson earns the standout status, and Driver should continue to build on his strong body of work"
    },
    {
      "text": "What should feel authentic can often feel hokey, sanitized and a fairy-tale of what a divorce could look like if people just got out of their own way."
    },
    {
      "text": "...Marriage Story is a heartbreakingly beautiful film with some of the best performances of the year because of the raw emotions our leads display..."
    },
    {
      "text": "Marriages can, do, and in certain cases ought to end, and bravo to [Noah] Baumbach for his candor in examining his own. But just as some matrimonial ties should be severed, so too should Marriage Story have pared down its fussy indulgences."
    },
    {
      "text": "@Marriage Story @netflix will break your heart leaving you hopeful at the same time with career shattering performances from Adam Driver and Scarlett Johansson"
    },
    {
      "text": "A compassionate, credible, emotive, and sometimes, hard look at a divorce that could have been amicable and brief. [Full review in Spanish]"
    },
    {
      "text": "Though it may sound dour (admittedly, it's not upbeat), Marriage Story glides by and watches terrifically well, despite its heavy topic."
    },
    {
      "text": "In this painfully funny and tragically sad story, Driver and Johansson deliver outstanding performances."
    },
    {
      "text": "What makes Marriage Story so remarkable isn't just how deeply Baumbach, Driver, and Johansson care about these characters, but how effectively the movie captures something that's impossible to put into words: The feeling of life as it changes."
    },
    {
      "text": "A whole lot of well-built scenes isn't quite the same as a single well-built movie."
    },
    {
      "text": "...its script could be taught in screenwriting workshops, its mise-en-scene in directing classes, and its philosophy towards forgiveness in the face of brokenness and woundedness in the pulpit."
    },
    {
      "text": "The little moments mean so much and Baumbach doesn't waste a single one."
    },
    {
      "text": "But most of the time you are simply in awe of the leads laying it all out there."
    },
    {
      "text": "Marriage Story is a promising film that has carved out powerful performances from the cast, but Baumbach's strategies in drawing out his character arcs are uneven, insufficient, and disappointing."
    },
    {
      "text": "Marriage Story is consolidated as a good piece of art capable of touching the heart of its audience. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is unrelenting and discomfiting - and one of the year's best films."
    },
    {
      "text": "Every marriage is a black box with its works mysterious even to those intimately involved.... When sharp tools are employed, there will be blood."
    },
    {
      "text": "Built around award-worthy performances from Adam Driver, Scarlett Johansson and a crackerjack supporting cast, it's among Baumbach's most enjoyable films to date."
    },
    {
      "text": "There are some legitimately funny moments in this, but because it's natural. I loved this movie...it's a big, emotional roller coaster, coupled with just how good the performances are..."
    },
    {
      "text": "There is a certain old movie charm to Baumbach's movies and Marriage Story is no exception..."
    },
    {
      "text": "With the sharp, heartfelt, realistic script, the stellar performances by Adam Driver and Scarlet Johannsson, and Laura Dern, all will no doubt be nominated for an Academy Award."
    },
    {
      "text": "...there's something more elusive here-the faint feeling of almost that lingers as the credits roll. It's a ... sweetness, not angry or vindictive."
    },
    {
      "text": "If Marriage Story succeeds in achieving a rare emotional transparency, it is in large part due to the breathlessly calibrated performances of its two leads."
    },
    {
      "text": "It may not always hit the mark, but Baumbach -- and the talented cast -- finds enough dramatic punch to leave an impact with a film that isn't always easy to watch but is certainly worth your time."
    },
    {
      "text": "The best thing about Marriage Story is the humanity that springs from its characters. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is not an easy watch; it is frequently squirm-inducing with Baumbach, for the most part, refusing to take sides... but that's what makes it one of the most satisfying dramas of the year."
    },
    {
      "text": "One of the most realistic and genuinely told love stories I have ever seen. Adam Driver, Scarlett Johansson & Laura Dern are perfect."
    },
    {
      "text": "Perhaps the only thing more difficult than watching films like Marriage Story is writing about them."
    },
    {
      "text": "With a persistent and frankly remarkable sense of compassion...[Baumbach elects] the more mature stance that there are simply no winners in divorce."
    },
    {
      "text": "Though it does get ugly, it's also paradoxically beautiful in its raw sincerity."
    },
    {
      "text": "While I remember more than a few laugh-out-loud scenes, I couldn't describe them as vividly as those ending in tears. Johansson and Driver have never been better."
    },
    {
      "text": "One of the best films of 2019; A dose of heavy, yet effective, melancholy reality that is all well-acted and directed/written beautifully by Noah Baumbach."
    },
    {
      "text": "Marriage Story is a poignant and heartbreaking portrait of love falling apart, fueled by powerhouse performances and a gripping screenplay."
    },
    {
      "text": "A remarkable feat of raw-nerve acting, intuitive writing, sharp direction, and a deeply empathetic sense of humanity."
    },
    {
      "text": "It isn't about the joys of nuptial bliss, but rather the throes of matrimonial disunion."
    },
    {
      "text": "Those of us old enough to remember certainly have seen much of this movie before, complete with a child whose real last name was Henry. It was in a 40-year-old little ditty called \"Kramer vs. Kramer,\" which went on to win a Best Picture Oscar."
    },
    {
      "text": "Marriage Story has its own sort of happy ending - or at least a more hopeful one than the others we've seen before."
    },
    {
      "text": "Noah Baumbach's latest film portrays both sides of a messy divorce, for once."
    },
    {
      "text": "Baumbach deserves kudos for highlighting the adversarial nature of divorce court...but his odd storytelling decisions too often undercut the human dynamics he's trying to explore."
    },
    {
      "text": "Despite the flashes of mordant humor, Marriage Story is essentially realistic. The performances, particularly by Driver and Johanssen, are not flashy or overtly comic..."
    },
    {
      "text": "...the film also benefits from two of the best performances this decade from its leads as well as a minimalist style that makes it seem as if the events were unfolding in real time. The result is timeless."
    },
    {
      "text": "Adam Driver and Scarlett Johansson are giving the best performances of their careers in the film."
    },
    {
      "text": "It's a wrenching two-plus hours, but it's also frequently funny. It's one of the great movies of 2019."
    },
    {
      "text": "It cannot be understated how good Driver and Johansson are as the Barbers."
    },
    {
      "text": "See it immediately."
    },
    {
      "text": "It won't leave audiences with warm, fuzzy feelings afterwards. In a larger sense it showcases a family's ability to overcome even the most challenging ordeal."
    },
    {
      "text": "Driver and Johansson have likely never been better and are sometimes electrifying."
    },
    {
      "text": "The script is very intelligent in terms of the presentation of its protagonists. [Full review in Spanish]"
    },
    {
      "text": "'Marriage Story' is a relatable series of heartbreaks and joys through the lens of marital disintegration. [Driver and Johansson] should have [their] shelves decorated in gold for their work here."
    },
    {
      "text": "At its best, this movie is searing. It pinpoints many of the little talked-about aspects of divorce that seem the least significant but hurt the most."
    },
    {
      "text": "The movie is 136 minutes, but the recovery period is, well, at least the rest of the night."
    },
    {
      "text": "Absolutely brilliant, absolutely devastating. A true update to Kramer vs Kramer, reflecting society today."
    },
    {
      "text": "Baumbach finds new depths in his performers, in the wounded, frightened side in Driver, and the macho side in Johansson; she's quite small, but formidable in a boy's haircut and trousers."
    },
    {
      "text": "Think Kramer vs. Kramer meets Husbands and Wives with smartphones."
    },
    {
      "text": "The film is stacked with award-worthy performances at every turn, but this is Adam Driver's pièce de résistance."
    },
    {
      "text": "Marriage Story is wonderfully complex."
    },
    {
      "text": "The strong cast overall delivers, with Driver and Johansson offering some fine performance. But with such a commonplace subject matter, and so many movies have already done it, what's amiss is the very quirkiness and eccentricity Baumbach leaves out."
    },
    {
      "text": "What surges out of [Noah Baumbach's] screenplay is a heart-wrenching story about what is essentially the slow and untimely death of a once-loving relationship."
    },
    {
      "text": "This is the first movie in years that made me bury my face in my hands; I was reeling with sorrow ... Yet I left the theater not only affirmed, but emboldened."
    },
    {
      "text": "The way this film, one of the year's best, explores its thematic goal is compelling, real, and worthy of future accolades."
    },
    {
      "text": "The entire cast is rock solid, with Johansson and Driver turning in two of the very best performances of their careers."
    },
    {
      "text": "The drama of the rupture is mixed with some scenes that will make the public have fun. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story is a powerful, heartbreaking character study."
    },
    {
      "text": "Where it feels a little egotistical at times, it's also extremely self-reflective, giving a compassionate look at the tangled intricacies that accrue over a marriage."
    },
    {
      "text": "\"Marriage Story\" is funny, sad, tragic, comic (if only there were a word to combine those emotions) and, ultimately, rather heartbreaking."
    },
    {
      "text": "Baumbach works hard to turn Marriage Story into an equal opportunity movie for each side."
    },
    {
      "text": "That this works so magnificently and gut-punchingly is down to Baumbach's slow-burning narrative (we're given time to really get to know these characters) and some truly fabulous performances."
    },
    {
      "text": "The impeccable performances of Johansson and Driver gives great dramatic intensity to the subject. [Full Review in Spanish]"
    },
    {
      "text": "Baumbach finds raucous humour and wry insight throughout. Happily for the two-and-a-quarter-hour running time, he keeps a sharp eye on entertainment value."
    },
    {
      "text": "From a character perspective this film is flawless."
    },
    {
      "text": "It's a triumph, a mix of pleasure and pain that cuts so deep it leaves a scar. It hurts, but it hurts so good."
    },
    {
      "text": "For all of its focus on the process of divorce, \"Marriage Story\" is really an expression of love."
    },
    {
      "text": "The mystery that simmers above the tribulations of Charlie and Nicole is why they would separate or strike a spike into whatever they have... one of the film's great strengths... they are fated, and yet: their skin itches at merest proximity."
    },
    {
      "text": "What [Baumbach] weaves-interlacing viewpoints through Charlies and Nichole's eyes-becomes more than a simply designed fabric; it morphs into an intricate pattern with each character providing an essential thread."
    },
    {
      "text": "...it's certainly not a stretch to label the picture a high-water-mark within Baumbach's erratic body of work."
    },
    {
      "text": "Few films go in between and beyond decision points to show the fractured orbits and restarts of continuing life with heart and honesty."
    },
    {
      "text": "'Marriage Story' pierces your heart and grabs your attention right from the start. Then burrows deep into your skin. This masterpiece awards should win."
    },
    {
      "text": "It's not a terrible movie, there are things to admire about it, but you leave the theatre underwhelmed and wondering what all the fuss was about."
    },
    {
      "text": "One of the year's funniest films."
    },
    {
      "text": "\"Marriage Story\" falls in line with a plethora of great films about the messiness of relationships, as sometimes love is ugly, brutal, and tumultuous. This is a near perfect film that features stunning performance from Adam Driver and Scarlett Johansson."
    },
    {
      "text": "At times harrowing but often blazingly funny."
    },
    {
      "text": "Adam Driver and Scarlett Johansson are truly phenomenal in the leading roles - this is one of Netflix's best"
    },
    {
      "text": "Baumbach examines with authenticity what a family looks like in the days and years that follow happily ever after."
    },
    {
      "text": "Perhaps there's a second, even more intriguing story, lurking like a palimpsest behind Marriage Story. Still, viewers should enjoy the phenomenally crafted tale."
    },
    {
      "text": "Featuring gutsy, no-holds-barred performances by Scarlett Johansson and Adam Driver, writer/director Noah Baumbach unloads his emotional baggage from his contentious divorce from Jennifer Jason Leigh."
    },
    {
      "text": "Devastating to watch as Scarlett Johansson and Adam Driver tear each other down as Baumbach revisits divorce a second time. Unforgettable performances."
    },
    {
      "text": "Baumbach is the anti-Ozu, and Marriage Story is something we can look at any time we feel too happy about ourselves. Enjoy."
    },
    {
      "text": "[T]he keen observations and sharp wit of Marriage Story are likely to wed the audience to the film until death do us part."
    },
    {
      "text": "Johansson and Driver are remarkably, heartbreakingly good in every scene; showing their characters' journeys to an unflinching camera, letting the gap between them get wider yet unable, for their son's sake, to completely walk away."
    },
    {
      "text": "[Baumbach's] most assured, emotionally mature and heartbreaking work to date, a tender yet lacerating drama of divorce and its aftermath."
    },
    {
      "text": "One of the most precise and painful works in modern cinema that capture something as difficult as love's fracture. [Full Review in Spanish]"
    },
    {
      "text": "Marriage Story isn't a fun sit. This is awards season faire, with all the heavy and human emotionality which comes with it. However, the Noah Baumbach direction combines with absolutely stunning performances by his cast to create a real must-see."
    },
    {
      "text": "Both stars are likely to land Oscar nominations, but keep an eye on the supporting category - and Dern. She packs up the movie in her expensive little Rodeo Drive purse and walks off with it. Effortlessly."
    },
    {
      "text": "A bracing. thoughtful examination of how a couple's intention to separate as amicably as possible for the sake of the son they both love gradually turns into legal and emotional warfare."
    },
    {
      "text": "Baumbach is speaking from experience, and it's that underlying truthiness that enables \"Marriage Story\" to pack a wallop. So, no pulling punches, no hiding insecurities -- or affairs. Baumbach, through Driver, puts himself out there, foibles and all."
    },
    {
      "text": "Like most Baumbach movies, this one's way overwritten and a touch too pleased with itself, but also contains some fine performances and bitter truths."
    },
    {
      "text": "Marriage Story aims to be a sucker-punch of emotions, but Noah Baumbach has negated that some of the audience has naivety in regards to divorce."
    },
    {
      "text": "By the end, you're rooting for both Charlie and Nicole, hoping they find their own happiness despite all the bad things and the pain they caused one another."
    },
    {
      "text": "...understands all of the emotional and procedural pitfalls and pain [of divorce] with complexity and clarity."
    },
    {
      "text": "Their privilege is rarely checked or acknowledged, while the plight of others is never really addressed even slightly. It all feels very worthy, hoping insight will outweigh specificity, but it's something we have, literally, seen before..."
    },
    {
      "text": "Superior, awards-worthy performances by Johansson and Driver."
    },
    {
      "text": "Noah Baumbach's film vows to leave a mark."
    },
    {
      "text": "Baumbach narrates the miseries and glories of a breakup with extreme sensitivity and epic breath. [Full Review in Spanish]"
    },
    {
      "text": "The hilarious, heartbreaking Marriage Story [is] a triumph in his filmmaking career."
    },
    {
      "text": "Possibly the best American film of the year."
    },
    {
      "text": "It's not quite as bleak as a Bergman film, although the late Swedish auteur is clearly an influence on Baumbach, as well as on Robbie Ryan's austere cinematography. But it leaves similar scorch marks upon the mind and heart."
    },
    {
      "text": "With its stellar performances, Marriage Story will simultaneously move you and devastate you. Keep an eye on Adam Driver and Scarlett Johansson come Oscar season."
    },
    {
      "text": "This is a powerful performance by Driver. And it's evident that Johansson has matured as an actor - thoughtful and willing to go deep. But, everywhere in this movie, there are actors doing award-worthy work."
    },
    {
      "text": "Noah Baumbach's masterpiece, a tragicomedy of human relationships that gets everything right ... every scene, and practically every moment, is simultaneously deeply sad and very funny. That's not just skilled filmmaking, it's a kind of alchemy."
    },
    {
      "text": "You may find yourself crying for them occasionally; I did."
    },
    {
      "text": "...has an ugly honesty you'll rarely find outside of the films of John Cassavetes."
    },
    {
      "text": "It builds to a sensational, illuminating scene between Johansson and Driver, then slips when Driver, who does have a strong singing voice, uses the film to audition for a Broadway musical."
    },
    {
      "text": "With a superb cast and zinger of a script, writer-director Noah Baumbach wrings real heartache and humour from his latest relationship movie."
    },
    {
      "text": "Exquisite, scorching and utterly humane."
    },
    {
      "text": "Driver and Johansson... are heartbreaking. [Full review in Spanish]"
    },
    {
      "text": "A film that's as equally honest and transparent, and as bitter and witty as the performances at its core."
    },
    {
      "text": "The film sucks you into the pain and misery of a separation protracted and complicated by the interference of lawyers, who are however not demonised and also fully formed characters."
    },
    {
      "text": "The title is correct: this is the story of a marriage. It is a love story, just one viewed upside down."
    },
    {
      "text": "It is funny, but goodness it feels over-long and presents a very American version of divorce that may not chime with audiences over here."
    },
    {
      "text": "The film falls into the trap of often mistaking arguments for drama... That said, here is a list of some of the film's many attributes. It's raw, honest, heartfelt, compassionate, sensitive, tender, touching, witty and charming."
    },
    {
      "text": "Marriage Story achieves that tricky feat of being both ultra-specific and universal in the feelings it explores."
    },
    {
      "text": "Ultimately, Baumbach doesn't fix the blame of the marriage failure here, but rather, he showcases the characters fixing their lives as they're forced to adapt to it."
    },
    {
      "text": "This terrific movie, so honest, open, smart and touching, is a little gem."
    },
    {
      "text": "I'm not buying every chapter of this Marriage Story, but there's enough material here to warrant a look."
    },
    {
      "text": "This broken family will break your heart."
    },
    {
      "text": "What a sledgehammer Baumbach has crafted."
    },
    {
      "text": "This is a moving and mesmerizing movie."
    },
    {
      "text": "In his choice to take us through the storm, Baumbach both acknowledges the mess of it all and reminds us that we're strong enough to survive it."
    },
    {
      "text": "The best thing of all is the generousity of its spirit."
    },
    {
      "text": "Parts of the film are sad, even heartbreaking, and yet Baumbach's commitment to his premise keeps it from being maudlin. It also happens to be quite funny."
    },
    {
      "text": "Easily the most amusing, touching and thoughtful narrative film that [Noah Baumbach] has done to date. Okay, it is the only one of his narrative features that I would describe in such a manner, but you have to start somewhere."
    },
    {
      "text": "Marriage Story falls short of its models because it doesn't reflect contemporary -- Millennial -- problems surrounding intimacy. Hence, Baumbach's reluctance to call the movie what it is."
    },
    {
      "text": "It's certainly not the most fun you'll ever have at the cinema - although it is witty and there are some brilliantly comic lines - but you will see something riveting, detailed, authentic and excellent."
    },
    {
      "text": "Marriage Story wants us to see these people as they are and this process for what it can do, and it hurts."
    },
    {
      "text": "Dryly funny Marriage Story offers exceptional performances from Scarlett Johansson and Adam Driver."
    },
    {
      "text": "sublime and gently devastating"
    },
    {
      "text": "Boosted by some of the year's best writing, the extraordinary Marriage Story will merrily break your heart, then solemnly repair it, over and over again."
    },
    {
      "text": "It is [Scarlett] Johansson and [Adam] Driver who give the picture its weight, clarifying movingly the couple's love for one another even as they're falling apart."
    },
    {
      "text": "Noah Baumbach is the writer-director, and to watch such an incisive, deep-feeling script be given life by actors... at the top of their game is to rediscover movies as a powerful medium of personal expression."
    },
    {
      "text": "In movies, divorces have rarely been as funny--and sad-- as this one."
    },
    {
      "text": "Noah Baumbach will break your heart and make you laugh with his new film about divorce."
    },
    {
      "text": "Marriage Story would never have made it as a must-see Noah Baumbach movie without Laura Dern, Ray Liotta and Alan Alda."
    },
    {
      "text": "Marriage Story is full of sound and fury, signifying nothing short of a reappraisal of marriage and divorce and the casualness with which both are entered into."
    },
    {
      "text": "It's a film of devastating cumulative power, even-handed and empathetic in its approach to two characters whose relationship has broken down, but who still want the best for their child and each other."
    },
    {
      "text": "Marriage Story finds humour in the worst scenarios and hope in the most uncivil dissolutions. It's a wonder. It is Baumbach's best film."
    },
    {
      "text": "\"Marriage Story\" provides a case study in what has and hasn't changed when it comes to the complications of marriage, separation and parenthood."
    },
    {
      "text": "Noah Baumbach's Marriage Story is every bit the equal to Kramer vs. Kramer, which is the highest compliment I can pay it."
    },
    {
      "text": "Maybe there's nothing terribly new in \"Marriage Story.\" But it manages to make you forget that very fact, in surprising, affecting, singular and revelatory ways."
    },
    {
      "text": "You can feel the actors' joy in playing these long, almost theatrical scenes -- and the director's joy in seeing them take the script to a new level."
    },
    {
      "text": "A true masterpiece and a masterclass in filmmaking from Baumbach and his peerless cast who deserve every award coming their way."
    },
    {
      "text": "An emotional, insightful and hilarious tragicomedy with great acting, script and direction. One of the best films of 2019. [Full review in Spanish]"
    },
    {
      "text": "Adam Driver and Scarlett Johansson's honest, intelligent performances inhabit the paradoxes of learning to let go."
    },
    {
      "text": "The performances at the heart and center of it, though, fill it up to the brim. The results are full and lived-in. Johansson and Driver knew what they had to do with this elemental material and its wild mood swings."
    },
    {
      "text": "Driver and Johansson give performances as precise and powerful as any two you'll see on screen this year."
    },
    {
      "text": "Marriage Story measures the mechanics of modern divorce in all its tragic, maddening, beleaguered dimensions. But Baumbach miraculously keeps his sympathies so balanced, which really makes the film soar."
    },
    {
      "text": "Essentially, this is about two people who deeply love each other but decide to hurt each other anyways. So it will also feel eerily familiar to most viewers."
    },
    {
      "text": "The divorce part fades in and out of focus while the marriage part unravels in flashbacks. Sometimes they drag on so long you can't tell the difference. Still, it's intelligent enough to like it a lot in retrospect."
    },
    {
      "text": "It's movies like Marriage Story that help us survive."
    },
    {
      "text": "Baumbach has been writing some of the year's best scripts for years and Marriage Story only further solidifies his voice as an essential American storyteller."
    },
    {
      "text": "[Baumbach's] latest, an at times joyous but more often frustrating and painful exploration about how the blind spots wired into our perception of the world have unintended consequences, is simply the best thing he has ever done."
    },
    {
      "text": "Baumbach's main characters are written and acted straight as befits their personal integrity, but the rest of Marriage Story is done in a satirist's broad strokes - a penetrating, often inspired satirist."
    },
    {
      "text": "An intimate tale of a relationship's collapse that also contains tear-jerking flashes of grandeur and sentimentality, Marriage Story runs the emotional gamut with ease and dramatic clarity."
    },
    {
      "text": "WatchingMarriage Storyis a transcendent experience. I don't know how someone puts such an intensely personal story on the screen, but Noah Baumbach has done it in a way that pierces your heart. This film is a must see."
    },
    {
      "text": "While admit that this a beautifully-written movie... I can't help but see this movie from this rarefied perch."
    },
    {
      "text": "What I keeping come back to when I think about [Marriage Story] is just how human it is. It feels really lived in. You feel like you know these characters."
    },
    {
      "text": "Noah Baumbach's excellent Marriage Story -- which is actually the story of a divorce -- revisits territory this filmmaker has explored before, notably in 2005's The Squid and the Whale."
    },
    {
      "text": "A masterpiece."
    },
    {
      "text": "\"Marriage Story\" is an emotionally lacerating experience, a nearly flawless elegy for a beautifully flawed couple, a broken-family classic to set beside \"Kramer vs. Kramer\" and \"Fanny and Alexander...\""
    },
    {
      "text": "Both halves of Marriage Story involve laughter and tears, but Baumbach concentrates on making each character feel distinct rather than syncing up their plot arcs."
    },
    {
      "text": "It might seem like an unpleasant sit, but Baumbach's sensitive and intricate touches make \"Marriage Story\" a leading contender for the best movie of the year."
    },
    {
      "text": "Noah Baumbach digs deep to explore the facets of modern uncoupling in MARRIAGE STORY."
    },
    {
      "text": "Adam Driver and Scarlett Johansson are superb in Noah Baumbach's funny/sad love story about a divorce."
    },
    {
      "text": "After seeing Marriage Story twice & pushing away some of its problems, I still feel like there is a giant hole in the middle of this work. Why is this couple getting divorced?"
    },
    {
      "text": "Noah Baumbach's funny and sad ode to the cycles of a marriage sends a laser beam to the heart. Proving the power of small moments, this remarkable piece takes us on a finely tuned and beautifully acted ride that is hard to shake."
    },
    {
      "text": "I'd say expect a lot from the movie and you won't be disappointed. It's a life-affirming, profoundly affecting classic."
    },
    {
      "text": "It should go without saying that Adam Driver and Scarlett Johansson are among the best actors of this current generation...Marriage Story, provides them with some of the deepest and strongest material of their careers."
    },
    {
      "text": "\"Marriage Story\" is such a perfect blend of writing, unflashy direction, spot on performances and score (by Randy Newman) that you hardly even notice all the individual ingredients making up the whole. Its triumph is that it just feels like life."
    },
    {
      "text": "All-too-real divorce drama isn't kid stuff; strong language."
    },
    {
      "text": "Marriage Story is all about its performances, and those performances are flawless in every sense of the term."
    },
    {
      "text": "For the performances alone, Marriage Story is a must-watch, because it demonstrates two actors almost fighting each other over who can have the best Oscar reel, and the results literally speak for themselves."
    },
    {
      "text": "It's hardly new territory, but Baumbach tackles the material with a mix of humor, anguish and absurdity that sustains interest, emphasizing how unpleasant and frustrating much of this can be."
    },
    {
      "text": "How does a small tale of a broken marriage emerge as a major triumph and one of the very best movies of the year? When it's the best film yet from Baumbach with career highs from Driver and Johansson. It'll take a piece out of you."
    },
    {
      "text": "Easily one of the best movies of the year."
    },
    {
      "text": "Don't let its sweet title fool you: Director Noah Baumbach's latest may just be the best war movie of the year."
    },
    {
      "text": "One of the morals of this story, chastening but also oddly encouraging, is that we don't ever really know one another, but we're nonetheless obligated to try."
    },
    {
      "text": "By the end, though we have been through the wringer, we are better for the catharsis. Such is the role of art in our lives, and great art like this offers true enlightenment."
    },
    {
      "text": "\"Marriage Story\" is devastating. Baumbach brilliantly and perceptively digs in to what brings a couple together, as well as what breaks them apart. Driver and Johansson stun."
    },
    {
      "text": "Like the \"Saving Private Ryan\" of divorce dramedies..."
    },
    {
      "text": "Divorce isn't a fun topic under any circumstances. But when it comes to it, Noah Baumbach knows of which he speaks, and he's made one of his best films. (Living Life Fearless)"
    },
    {
      "text": "I felt that I was watching \"acting\"- since his protagonists are show people, Baumbach has allowed them more theatricality, thus risking the naturalism he wanted to portray."
    },
    {
      "text": "[The] blend of tones, with near-farce and emotional brutality blitzed together, is pure Baumbach, and he dishes it up for two hours straight."
    },
    {
      "text": "Life's not clean on either side of the screen in \"Marriage Story.\" But even when it's messy, Baumbach's found a way to make all sad tears and funny tears equally welcome."
    },
    {
      "text": "Baumbach manages to bring the heartache and loneliness that comes with a divorce to life in a way that stays with you long after you've left the cinema."
    },
    {
      "text": "Baumbach's most mature and generous work to date."
    },
    {
      "text": "Baumbach's latest feature, Marriage Story is perhaps his best work. Once again, Baumbach draws on the personal to create a poignant story that gets into the heart of why lovers go their separate ways."
    },
    {
      "text": "Precise in moments, if softer as a whole, [Baumbach's] overarching attempt here still makes the film feel like a progression of sorts for the writer-director."
    },
    {
      "text": "There is simply too much to appreciate in Marriage Story to list. It's faultless, seemingly effortless storytelling and one of the year's finest films."
    },
    {
      "text": "Till death stops Noah Baumbach from crafting delicate works of art, both emotionally arresting and frolicsome. Marriage Story is his most accomplished work to date"
    },
    {
      "text": "\"Marriage Story\" is richly detailed, tastefully balanced with some needed comedy, and consistently attentive to the inner lives of the lead characters."
    },
    {
      "text": "While Baumbach's Marriage Story doesn't break any new ground on the subject, it follows the tried and true formula of portraying the worst of times with sincerity and humor, filtered through raw and compassionate performances from a talented cast."
    },
    {
      "text": "'Marriage Story' is a melancholy movie that details the trauma of divorce, but it also offers a ray of hope. Life goes on, Baumbach is saying, as festering wounds eventually heal and a new normalcy develops."
    },
    {
      "text": "The powerful performances create such intimate characters that the melancholy lasts long after the credits roll."
    },
    {
      "text": "Driver and Johansson offer career-best performances in Baumbach's intimate and touching divorce story. Prepare to have your heart shattered into million pieces. [Full Review in Spanish]"
    },
    {
      "text": "The perfect example of how misogyny manifests among the artistic classes."
    },
    {
      "text": "Marriage Story is an extraordinary tale of untethering, one that will be revisited and referenced for years to come as a near-faultless example of the craft of filmmaking."
    },
    {
      "text": "The film is very good at giving both Johansson and Driver equal space to show how easily something that once seemed so great can sour so completely."
    },
    {
      "text": "I watched Marriage Story while going through a breakup -a good and bad decision. It's a masterpiece."
    },
    {
      "text": "Adam Driver and Scarlett Johansson give their all to Marriage Story, a smart exploration of the emotional intricacies of divorce and how they can rip love to shreds."
    },
    {
      "text": "In building intimacy and rancor out of specific precise moments, Baumbach's writing is sublime, his camera is expansive in allowing the actors space to work and the audience room to take it in. More rigorous work was needed in balancing the perspectives."
    },
    {
      "text": "Baumbach plays the material with the same levity-in-a-tornado wit and wisdom that hallmarks the best works of James L. Brooks, and gets powerhouse performances out of Driver and Johansson."
    },
    {
      "text": "This is a love story, and it is absolutely extraordinary."
    },
    {
      "text": "There is something pefect about the metaphor of the husband as a director and the wife as the most prized member of his ensemble."
    },
    {
      "text": "Audiences have seen this divorce narrative - the happy moments barely feature - play out in endless variations across cinematic history."
    },
    {
      "text": "The actors tackle massive monologues, one truly volcanic row and the silent shorthand of a years-long bond with beautifully naturalistic performances."
    },
    {
      "text": "It's almost impossible for me to convey how much this film touched my heart, being a child of divorce, and secondly, as being a rabid Baumbach fan."
    },
    {
      "text": "Simply put, it's Baumbach at his Baumbest."
    },
    {
      "text": "Getting hit with such a snootful of mega-misery is not necessarily what I'm looking for in a relationship movie. I don't find catharsis here. All I see is a kind of cinematic therapy session."
    },
    {
      "text": "Marriage Story is a timeless look at relationships that will be talked about for years to come. Marriage Story is perfection."
    },
    {
      "text": "Scarlett Johansson and Adam Driver invest their emotional disintegration with raw authenticity, while Noah Baumbach combines Woody Allen-style irreverence with the no-holds-barred naturalism of John Cassavetes."
    },
    {
      "text": "The best film of Noah Baumbach's career, and very likely to be the last truly perfect film of this decade."
    },
    {
      "text": "[A]n exquisite heartbreaker..."
    },
    {
      "text": "Marriage Story is one of the year's best films and an unrelentingly honest, bittersweet piece of open-hearted cinema from director Noah Baumbach. Scarlett Johansson and Adam Driver have never been better."
    },
    {
      "text": "A moving, excruciatingly honest portrait of divorce with equal empathy afforded to both sides."
    },
    {
      "text": "Thanks to Driver and Johansson, this is a story that cannot be missed."
    },
    {
      "text": "Baumbach's devastating portrait of divorce features two of the year's finest performances courtesy of Adam Driver and Scarlett Johansson."
    },
    {
      "text": "Marriage Story is Noah Baumbach's masterful film that is ripe full of melancholy, beauty and contrasting nastiness. Adam Driver gives a career-best performance, commanding every emotion to the finest degree."
    },
    {
      "text": "The characters in the film are angry and bitter, but Marriage Story, is not bitter but confessional -- apologetic, even...What results is a grueling but ultimately optimistic film about the horrors of divorce and how hard it is to...move on."
    },
    {
      "text": "Baumbach completely trusts his main characters, and gives free rein to their respective talents. [Full review in Spanish]"
    },
    {
      "text": "It feels like Marriage Story could hold the key to the most intimate and complex humanity in the faintest of heartbeats."
    },
    {
      "text": "Offering a blisteringly honest portrayal of the stress and pain divorce causes, Baumbach masterfully forces us to wallow in the couple's uncomfortableness."
    },
    {
      "text": "Marriage Story is amongst Baumbach's finest works. Sympathetic, charming, and above-all relatable, it also contains some impressive, career-best acting by Driver and Johansson."
    },
    {
      "text": "Surprisingly funny, profoundly moving, and tragically heartbreaking."
    },
    {
      "text": "Baumbach uses his masterful command of cinematic language to create an emotionally devastating film that entertains you on every level."
    },
    {
      "text": "In 136 engaging minutes [Noah] Baumbach relives every tortured moment and slight in the couple's less than idyllic marriage."
    },
    {
      "text": "As close to perfection as any film can get."
    },
    {
      "text": "It's not always easy to watch, but Baumbach's refusal to make either wife or husband the villain or the hero is arguably the film's greatest asset."
    },
    {
      "text": "Throughout, the subtle glimpses of a couple's lingering affection for one another complicate the bitterness of their separation."
    },
    {
      "text": "Marriage Story culminates beautifully with an act so humble, gentle and loving that it disperses bitter memories and leaves us with the warmth that only the feeling of being alive can leave. [Full Review in Spanish]"
    },
    {
      "text": "The back-and-forth he-said/she-said is a fascinating aspect of this film and will no doubt lead to conversation about which side Baumbach is actually on."
    },
    {
      "text": "To get a story like this right requires a sense of the comical and the absurd along with the devastating -- and Marriage Story delivers."
    },
    {
      "text": "Especially painful is a reunion between the couple in which they express with venom all their reproaches, and this is where Johansson and Driver demonstrate a rarely explored histrionic potential. [Full Review in Spanish]"
    },
    {
      "text": "In case it's not apparent, \"Marriage Story\" is both funny and painful, often at the same time."
    },
    {
      "text": "To show a marriage going off the rails can be the most banal thing in the world, but the writing is sharp and smart, and in many places we see the little things that make a couple that special unit."
    },
    {
      "text": "Johansson and Driver deliver their most powerful performances yet."
    },
    {
      "text": "The movie's power rests in the hands of Johansson and Driver."
    },
    {
      "text": "It'll take a lot of tears, and a few laughs, to get there. But Baumbach and his cast make it well worth the journey."
    },
    {
      "text": "Take: Scarlet Johannson and Adam Driver are effortlessly brilliant in Noah Baumbach's Netflix divorce drama."
    },
    {
      "text": "Marriage Story can be as funny, in its sharp observations about behavior... But it's also a drama of startling insight and complexity, so confidently made (and so expertly shot on 35mm) that it evokes the art-house renaissance of the 1970s..."
    },
    {
      "text": "Noah Baumbach's devastating semi-autobiographical work is one of the best films of the year."
    },
    {
      "text": "It's unlikely we'll be able to honestly say that we've seen a better-acted movie this year by the time 2019 draws to a close."
    },
    {
      "text": "A nuanced, humane, frequently hilarious, but equally painful film."
    },
    {
      "text": "Charlie and Nicole are as fully realized as two people in a domestic drama have been in years."
    },
    {
      "text": "Noah Baumbach gives us his best work yet with Marriage Story."
    },
    {
      "text": "Adam Driver delivers a stirring performance with raw emotion that towers over everything else this season."
    },
    {
      "text": "This is hilarious, heartbreaking cinema - a work that will make you burst out laughing one moment, and leave you tearing your hair out the next."
    },
    {
      "text": "The fate of the film rests fully in Driver and Johansson's hands, and both actors are more than up for the challenge, turning in career-best work."
    },
    {
      "text": "Baumbach extracts the very best from his stellar ensemble, in particular, stars Adam Driver and Scarlett Johansson, as the two spars in a significant demonstration of acting and commitment, leaving both as winners."
    },
    {
      "text": "Noah Baumbach's incredibly personal movie is one of his best yet with astonishing performances from the whole cast."
    },
    {
      "text": "Noah Baumbach's Marriage Story, with Scarlett Johansson and Adam Driver, is another funny, beautifully-observed film about family relationships, focusing on a couple trying to get divorced."
    },
    {
      "text": "Marriage Story doesn't want you to take sides-if you do, it may be that you've chosen the performer, or their performance of their part."
    },
    {
      "text": "A bloody and painful separation, which nevertheless leaves room for humor and hope. [Full review in Spanish]"
    },
    {
      "text": "Marriage Story respects not only its cast enough to give them room to fully inhabit a person and that person's space, but also its audience enough to resist easy manipulations and the instinct to want to switch sides."
    },
    {
      "text": "Brutally honest, raw, and heartbreaking, Marriage Story is Noah Baumbach's crowning achievement as a filmmaker."
    },
    {
      "text": "It would be facile not to acknowledge Marriage Story's emotional impact -- only the eyes of the soulless won't water. But should a film so clearly manufactured to tear-jerk be celebrated for achieving the bare minimum? Probably not."
    },
    {
      "text": "Audiences might expect a mercilessly bleak view of married life, but Baumbach's go-to mode is never despair, even when Marriage Story is desperately sad."
    },
    {
      "text": "Baumbach employs a risky strategy and goes unscathed thanks to the coherence of its proposal and, above all, thanks to the interpretative deployment of the leading couple. [Full Review in Spanish]"
    },
    {
      "text": "Shoots for laughs despite its serious nature."
    },
    {
      "text": "Noah Baumbach has created something so genuinely human and emotionally raw, that it demands to be seen."
    },
    {
      "text": "The joys, grace notes and riches of Baumbach's latest are endless."
    },
    {
      "text": "A marriage can't be defined by a single emotion. It's an all-consuming force that can lead to euphoric rushes and eat away at your insides, sometimes within moments of each other. Marriage Story perfectly encapsulates these feelings."
    },
    {
      "text": "Adam Driver is captivating and Laura Dern is hysterical in Noah Baumbach's tragically true to life tale of the brutal consequences of the end of love in this must-see festival favorite"
    },
    {
      "text": "This is one of Noah Baumbach's most sophisticated and emotional dramas. [Full Review in Spanish]"
    },
    {
      "text": "I loved Marriage Story, Noah Baumbach's funny, painful analysis of divorce, American-style."
    },
    {
      "text": "Marriage Story shows Baumbach reaching an entirely new level in his most consummate film to date."
    },
    {
      "text": "Baumbach once again crafts a tender and ludicrously compelling film that insights an internal riot of mixed emotions."
    },
    {
      "text": "Baumbach's screenplay is a detail-oriented, procedurally accurate investigation of the divorce process. It could probably use some trimming, especially in the first act, but when he gets going, his words sure do serious damage."
    },
    {
      "text": "Marriage Story is a fearsome cautionary tale, long and painfully detailed, a divorce horror story to put alongside Kramer vs. Kramer."
    },
    {
      "text": "Baumbach never tries to reconcile the messy vicissitudes of human relations, and so he draws us in deeper. Nor is does he take shortcuts for emotional effect."
    },
    {
      "text": "Marriage Story is a mature and rich work, deeply empathetic, coolly intelligent and beautifully wrought -- in both senses of the word."
    },
    {
      "text": "I suspect almost anyone who has dissolved a seemingly perfect union can relate to at least some of Marriage Story, especially if there are children involved."
    },
    {
      "text": "The film never loses its sense of humour and absurdity. Somehow, in spite of the bleakness of the subject matter, it feels more redemptive than despairing."
    },
    {
      "text": "Marriage Story is enriching for all its weary insight, for the intricate ways it maps two personalities and locates them in the world."
    },
    {
      "text": "As he did with the underrated While We're Young, Baumbach is turning his signature comedies of urban dissatisfaction into something more universal. He has earned these scars."
    },
    {
      "text": "Marriage Story is very finely observed, very true to itself and its teeming cast of characters."
    },
    {
      "text": "A powerful reminder that every breakup story looks familiar until it happens to you, and then the truth hurts."
    },
    {
      "text": "\"Marriage Story\" is Noah Baumbach's opus, his best film to date, and a bracingly cathartic tribute to survival, going through utter hell, but still coming out the other side alive."
    },
    {
      "text": "The writing is suitably dense and literate, though Baumbach really cherishes the characters as individuals - it never feels as if Nicole and Charlie are avatars for his own poetic musings on the differences between love and fidelity."
    },
    {
      "text": "It has fine performances by Scarlett Johansson and Adam Driver, a family-pack of box-fresh dialogue and a keen sense of its own absurdity."
    },
    {
      "text": "Since 2005, Baumbach has had an extraordinary run of films with deeply flawed, often exasperating characters who are nonetheless always capable of growth and redemption."
    },
    {
      "text": "Marriage Story may often resemble a tug of war between its stars, but it's on both of their sides."
    },
    {
      "text": "Baumbach's best yet."
    },
    {
      "text": "It's the work of a major film artist, one who shows that he can capture life in all its emotional detail and complexity - and, in the process, make a piercing statement about how our society now works."
    }
  ],
  "release_year": 2019,
  "duration": 136,
  "genres": [
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "A stage director and his actor wife struggle through a grueling divorce that pushes them to their limits.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/2JRyCKaRKyJAVpsIHeLvPw5nHmw.jpg"
}