{
  "movie_name": "Moana",
  "movie_id": "moana_2",
  "total_reviews": 236,
  "reviews": [
    {
      "text": "I think younger audiences will enjoy..."
    },
    {
      "text": "Moana 2 is visually stunning, has a pace that never lets up, the songs come at the right time, and has tender moments...[Full review in Spanish]"
    },
    {
      "text": "It's difficult to discern any creative or story-driven purpose behind the sequel. Like a high-priced DTV release, Moana 2 is all tarted up for no good reason except Disney's bottom line, and has precious little to recommend for adult viewers."
    },
    {
      "text": "... \"Moana 2\" is fine. It’s neither great nor horrible, it just provides a comfortable adventure that follows the well-tread path created by the initial outing."
    },
    {
      "text": "The animation is lush and textured, and the characters overall are lively, but some characters and threads feel underdeveloped... youngsters will be satisfied with MOANA 2, but those young-at-heart might consider some parts more meh than Moana deserves."
    },
    {
      "text": "Moana 2 inspires passable acceptance tinged slightly with disappointment. I wouldn’t steer anyone away from the movie, but it’d be wise to keep expectations in check."
    },
    {
      "text": "Both the original and this movie end with the song \"We Know the Way.\" Do you though, Disney? Do you really?"
    },
    {
      "text": "The film picks up in the second half largely because Moana and Maui are reunited, which invigorates the narrative; separate, their stories are still relevant, but less entertaining."
    },
    {
      "text": "With a score of new songs, the voice cast, led beautifully by Cravalho, captures the doubt and determination Moana feels as she’s called to follow this epic quest."
    },
    {
      "text": "Moana 2 somehow feels like a three-hour film crammed into an hour and 40 minutes. The animation is disappointing, the story is stretched well beyond its means, and the music is pure trash."
    },
    {
      "text": "If children of a certain age like this kind of kinetic fare, they're going to like this movie. It never stops, not for one second."
    },
    {
      "text": "This is a movie that grabs you by the collar in the first frames and insists you are having a good time -- and never stops telling you that, whether you are or not."
    },
    {
      "text": "Moana 2 has plenty to keep the audience engaged from start to finish, even if the story has so many repeat moments from the original."
    },
    {
      "text": "The enjoyment [of the film]… is much more connected to the visual presentation than to a plot that is followed with much more indifference than attention. [Full review in Spanish]"
    },
    {
      "text": "A lot of the magic seems to have swept ashore, though, as while this sequel still wows at times, it left me feeling underwhelmed and a bit empty."
    },
    {
      "text": "You can’t help but notice myriad little shortcomings, which may be attributable to the shift from series to film."
    },
    {
      "text": "Originally developed as a limited series for Disney+, Moana 2 segued into a proper sequel well into production. Unfortunately, the frustratingly middling results show every indication of [a series] rejigged into a sub-two-hour running time."
    },
    {
      "text": "There is at no point any real reason to care about what's happening or what the stakes are."
    },
    {
      "text": "Moana 2 feels like a film designed to keep the little ones entertained, but for those seeking the magic of its predecessor, it’s more of a faint echo than a bold adventure."
    },
    {
      "text": "Good, not great. Where are the stand out songs?"
    },
    {
      "text": "The excuse that it is \"for children\" isn't good enough. Kids also have the right to decent entertainment... [Full review in Spanish]"
    },
    {
      "text": "I love when kids’ movies subtly address colonization and teach children that ancestors never leave us and want to help us. And the music slaps!"
    },
    {
      "text": "“Moana 2” has enough colorful characters, swirls of action and cute musical numbers to be entertaining but it can’t overcome the problem that tends to sink so many follow-up films in that they always come across as pale copies when compared."
    },
    {
      "text": "At last, GenZ can experience firsthand what their Millennial elders were talking about in the Old Legends of not-exactly-'bad' but also not-exactly-'good'-either Disney 'sequels' hastily assembled from unmade Disney TV shows"
    },
    {
      "text": "There’s a “rinse and repeat” quality to “Moana 2.”\n\nInstead of telling new stories, it rewashes the first film’s plot."
    },
    {
      "text": "I enjoyed the film, especially the music and cinematography, yet felt there could have been more additions to the story, I enjoyed the movie, especially the story art."
    },
    {
      "text": "[Moana 2] manages to be both massively overcomplicated and strangely insubstantial..."
    },
    {
      "text": "Moana 2 lacks the charm and originality of its predecessor. While animation and voice acting are strong, the songs are flat, and the narrative is episodic and formulaic.\n\nUltimately, the film will play more like a streaming or direct-to-video sequel."
    },
    {
      "text": "In every possible way, Moana 2 is an incredible step down from the original breakout feature."
    },
    {
      "text": "A return to the ocean that gets caught up in a few undercurrents and loses the wave, but, like most trips to the beach with kids, involves enough roughing around in the sand and the distraction of exotic sea creatures to keep young adventurers entertained"
    },
    {
      "text": "The animation is truly magnificent but the plot feels about as humdrum as any plot can in which villainy is represented by a giant evil clam."
    },
    {
      "text": "It charts well-trodden territory capably enough to rise above a tidal wave of shortcomings."
    },
    {
      "text": "It's great fun for girls and boys, and the animation is really sweeping."
    },
    {
      "text": "Disney ruled the 2010s because they made toons as good as Zootopia. They are now “ruling” the 2020s because… they once made toons as good as Zootopia."
    },
    {
      "text": "The lively characters pull the audience in, generating wit and energy even when the plot begins to feel simplistic and rather predictable."
    },
    {
      "text": "Much like the hermit crab who kicks things off by attempting to trade in his new shell for an ill-fitting larger one, there’s simply not enough to fill out Moana 2."
    },
    {
      "text": "It's a zesty mid-level Disney family film whose stunning visuals should appeal to the kiddies more than to their demanding parents, who may want a story that makes more sense."
    },
    {
      "text": "Moana 2 does enough to fit the bill of solid family entertainment. It accomplishes the most important thing for any sequel: reunite the original characters with each other and the audience."
    },
    {
      "text": "“Moana 2″ is a far cry from “Moana,”"
    },
    {
      "text": "This is a charming, entertaining musical designed for younger audiences, and they'll definitely enjoy the familiar, adventure-filled sequel."
    },
    {
      "text": "Onscreen, the details of this fabricated, composite mythology get a little murky. But squint your eyes against the specifics, and the odyssey tends to deliver a mood that fluctuates along a scale of benign to bright."
    },
    {
      "text": "Moana 2 might do enough to entertain small children throughout the film but it certainly won’t be embraced the same way the original film did. Trying to shove a whole TV series worth of plot lines into a feature film doesn’t work."
    },
    {
      "text": "... One of the most ill-conceived sequels in Disney history."
    },
    {
      "text": "Conflict in the story peters out rather than getting solved in a dynamic fashion."
    },
    {
      "text": "Given the nature of the heroine, seeing her on screen is always going to be enjoyable, but for the next film, her next adventure must be completely different. [Full review in Spanish]"
    },
    {
      "text": "Moana bravely fights a muddled screenplay with mediocre music. No melodies bore into your brain, but you might be bored and the new quirky sidekicks distract rather than increase the merriment."
    },
    {
      "text": "Visually grand but dramatically a grind, Moana 2 dazzles with animation but stumbles with a confusing plot and a lack of the musical magic that made the original soar"
    },
    {
      "text": "Moana 2 is a clear downgrade from the original, but it is still a decent follow-up on its own."
    },
    {
      "text": "This movie, unlike most superhero movies, has a lot of comedy in it. It is energized by some nice songs, interesting characters, and impressive animation artwork. I saw this movie in 3D, a more immersive experience, and it had impressive depth."
    },
    {
      "text": "Moana 2 is a brisk but not deeply memorable adventure film. The animation and visuals are the only reason to watch the movie on the big screen."
    },
    {
      "text": "It’ll hold the attention of kids and entire families, but it never comes close to the soaring adventure of the original. It’s a perfectly pleasant movie, but it could have been so much more."
    },
    {
      "text": "The Disney transformation is cartoonish in more than one way: We lose the photographic values of nature, now cheapened through super-colorful digital animation, especially in Moana 2’s high-rising ocean waves during some splashy sea exploits."
    },
    {
      "text": "We deserve art that makes us stop and be present in our appreciation of it. Moana understood this. Moana 2 is just here to fill time."
    },
    {
      "text": "“Moana 2” is a mid-level sequel that fails to live up to the brilliance of the original. But it’s an okay movie that kids will likely enjoy."
    },
    {
      "text": "It’s the kind of sequel that is probably the worst of them all – one that just feels like it is going through the motions with nothing much to offer."
    },
    {
      "text": "It's not epic like the first one, but it's see-worthy."
    },
    {
      "text": "An “okay” sequel to a terrific original still qualifies as a disappointment."
    },
    {
      "text": "'Moana 2' is more of the same. It's not quite as good as the first one, but your kids will most likely love it."
    },
    {
      "text": "Moana 2 marks Disney’s triumphant return to the enchanting waters of the Pacific, delivering a visually stunning and emotionally resonant sequel that reaffirms the enduring charm of its titular heroine."
    },
    {
      "text": "There's nothing particularly wrong, irritating, or grating about the experience of watching Moana 2 in a movie theater. The problem lies rather in its mediocrity, its limited capacity for audacity, surprise, and excitement. [Full review in Spanish]"
    },
    {
      "text": "Beyond its impeccable visual style, this sequel, more suitable for streaming platforms than the big screen, is a diluted reflection of the original. [Full review in Spanish]"
    },
    {
      "text": "Songs and charm sustain a conventional sequel. [Full review in Spanish]"
    },
    {
      "text": "Indulges in a display of fireworks as brilliant as they are perfectly inexplicable. [Full review in Spanish]"
    },
    {
      "text": "In the end, Moana 2 is still a fun, high-energy ride that younger audiences will likely enjoy."
    },
    {
      "text": "If Moana were to get a real sequel, one with a story developed for cinema from the ground up, things would feel different. As it is, what we have is so derivative and transparently corporate that it bums me out."
    },
    {
      "text": "As fun and ground-breaking as the original film was, this sequel feels rote by comparison."
    },
    {
      "text": "Despite Moana 2 being a middling animation extravaganza that kids might still enjoy watching, it feels nautical miles away from its predecessor’s strong story populated by stronger characters."
    },
    {
      "text": "The sequel features vibrant animation and suggests interesting themes, but is plagued by the vices of Disney's worsening \"sequel-itis.\" [Full review in Spanish]"
    },
    {
      "text": "The animation is impressive. This is an easy film to watch."
    },
    {
      "text": "Altogether, Moana 2 is an entertaining and gorgeously animated experience, but one that clearly needed greater development of supporting characters, stronger internal logic, and an inciting incident that feels more necessary and motivated."
    },
    {
      "text": "The makers have made Moana 2 a visual spectacle but failed to add depth to the emotions of the characters and are marred by the unidimensional and predictable storyline."
    },
    {
      "text": "Moana 2 emerges as an entertaining follow-up to the studio's 2016 hit musical about a young Polynesian adventurer who embarks on a quest to save her homeland."
    },
    {
      "text": "Despite all this Moana moaning, though, it's still a high-quality piece of work: a hurtling Disneyland rollercoaster ride that small children, especially, are bound to enjoy."
    },
    {
      "text": "Soulless. [Full review in Spanish]"
    },
    {
      "text": "Unfortunately falls into the category of run-of-the-mill animated Disney movies, so don’t expect the same experience as the first film... The film boasts impressive art and animation, so if you're looking for a family movie, Moana 2 might fit the bill."
    },
    {
      "text": "There’s plenty of jeopardy, but none of it is scary or has much consequence. And all of the storylines seem short on, well, an idea."
    },
    {
      "text": "Moana 2 has chosen not to take too many risks and offers everything that made the first film great. [Full review in Spanish]"
    },
    {
      "text": "\"Moana 2\" touts the power of human (and non-human) connection, and the film will certainly connect with its target audience. But it doesn't trust viewers enough to feel for themselves."
    },
    {
      "text": "Moana (Auli’i Cravalho), the Polynesian hero of our story, is a wonderful character who deserves another epic adventure. This isn’t it."
    },
    {
      "text": "Though it may not reach the emotional or musical peaks of its predecessor, this sequel delivers solid entertainment for all ages."
    },
    {
      "text": "Its stellar animation, paired with a heartfelt story that builds on the original in terms of both character and worldbuilding, shares a timely message that speaks to the power and importance of collaboration."
    },
    {
      "text": "This might be enough to keep the film’s target audience of kiddos entertained, but adults are more likely to find the blatant laziness of conceit dull and unimaginative to sit through."
    },
    {
      "text": "Despite stunning animation and a standout musical performance by Awhimai Fraser, 'Moana 2' drowns in exposition and shallow storytelling that sacrifices character development for franchise-building aspirations."
    },
    {
      "text": "While the lingering goodwill of the beloved 2016 original could be enough to make this worth the price of admission, even the most Disney-fied family members will have trouble remembering much about it by the time the credits are done rolling."
    },
    {
      "text": "This is a rare sequel that doesn’t feel like a retread, enriching the characters and offering them an exciting adventure filled with magic and monsters."
    },
    {
      "text": "The main selling point remains Moana herself: the sparkiest and most intrepid Disney heroine of them all."
    },
    {
      "text": "Moana 2, while not as egregiously bad as some other Disney follow-ups, does not offer nearly enough to be compared favorably to its Oscar-nominated predecessor."
    },
    {
      "text": "…an inessential but professional re-hash of the first film with a few extra bells and whistles…sometimes, we want safe, familiar and comforting, and Moana 2 delivers that…"
    },
    {
      "text": "The animation is still amazing, but this frenetically paced sequel is basically a rehash of the original with less catchy songs."
    },
    {
      "text": "A very \"by the book\" sequel, but I think it's goal is to look nice, sound nice, and have a story that's interesting enough for a pleasant adventure. On that level, it succeeds."
    },
    {
      "text": "a worthy sequel, with gorgeous animation, a thoughtful representation of Polynesian culture and another exciting adventure for our inspiring Moana. Does it go beyond the first film? No, but that would have been a tall order."
    },
    {
      "text": "The movie is far from terrible. It’s just uninspired and too eager to please everyone making it and viewing it."
    },
    {
      "text": "Moana 2 is hardly smooth sailing, but it does have its charms."
    },
    {
      "text": "this follow-up feels like the most perfunctory of Disney’s recent endeavours."
    },
    {
      "text": "Moana 2 is passable family entertainment, but in direct comparison with its much better predecessor, not to mention its inescapable televisual origins, it barely catches a wave."
    },
    {
      "text": "Original writer Jared Bush has teamed up well with co-director Dana Ledoux Miller to provide a story that brings back everything you want to see return, but without lazily relying on those tropes... Moana 2 is an absolutely stunning film, visually."
    },
    {
      "text": "Everything about this clammy continuation sings cynical cash-in."
    },
    {
      "text": "The story and music are pretty generic this time around, but the eye-popping visuals are striking enough to prevent “Moana 2” from going too far adrift."
    },
    {
      "text": "There’s a general flatness to Moana 2′s serialized adventures. ... It’s one obstacle after another, though none feel rooted in or consequential to any emotional beats."
    },
    {
      "text": "I’d be less aggravated if this film were more than mediocre. While the animation is often stunning, the overall result is a throwback to those inferior direct-to-video sequels Disney used to churn out for “The Lion King” and “Aladdin.”"
    },
    {
      "text": "It isn’t a tragic drop in quality from the first, but there is less magic, and this story isn’t remotely as impactful as the original."
    },
    {
      "text": "Unenthusiastic recommendation, mostly liked it because of its weird humor, intact from the first film. The spectacular animation at times made me feel like I was inside a pinball machine, and the songs missed the stylings of Lin-Manuel. Still, CHEEEE-HOO!"
    },
    {
      "text": "Moana 2 is a visually appealing, entertaining, adventure, yet never goes beyond"
    },
    {
      "text": "A sequel that seems to have been made in a hurry; that feels more like a transition between the first film and a potential third instalment, and that lacks any emotional element that could generate strong responses in the viewer. Full review in Spanish."
    },
    {
      "text": "While the Sequel Law of diminishing returns is in effect in Moana 2, it is still a beautifully animated, tuneful, exciting kid-friendly action movie with good messages of the importance of community and connection."
    },
    {
      "text": "A paint-by-numbers sequel that sorely lacks the magic, heart, and cherished original songs that made the original film so memorable."
    },
    {
      "text": "No one will ever list Moana 2 as one of those sequels that surpasses – or even equals – the original. But if you have a house full of young'uns who need entertaining – and they've seen Wicked already – then Moana 2 will be just fine."
    },
    {
      "text": "Khaleesi Lambert-Tsuda’s portrayal of Simea, Moana’s adorable younger sister, is undoubtedly the scene-stealer despite being the smallest addition to the cast."
    },
    {
      "text": "Moana 2 seems more like a consumer product, in some subtle but unmistakable way, than the first film did."
    },
    {
      "text": "Auli’i Cravalho’s title character remains a force to be reckoned with on the open seas, and though the sequel takes a little too long to reunite her with demigod pal Maui, the enjoyment factor rises noticeably once they have re-teamed."
    },
    {
      "text": "Moana 2 is the return to form for the style of animation Disney is known for, but its story and songs fail to venture beyond shallow waters."
    },
    {
      "text": "A beautiful continuation of her story and a reminder to believe in yourself. Oh and that Maui has really cool tattoos."
    },
    {
      "text": "The new Moana is so confusing it makes you seasick — or just sick of the characters."
    },
    {
      "text": "While successfully designed for a general audience, this film, like its predecessor, shaves off what might be considered the rough edges of the cultures they depict."
    },
    {
      "text": "Moana 2 successfuly took what worked and multiplied it... [Full review in Spanish]"
    },
    {
      "text": "Whatever Moana 2 is, it’s not passionless content – it’s just not as revelatory as it was the first time."
    },
    {
      "text": "It lives in the massive shadow cast by “Moana,” but in terms of animated sequels, “Moana 2″ meet expectations."
    },
    {
      "text": "“Moana 2” is more of an action movie with a few accidental musical numbers of varying quality."
    },
    {
      "text": "The songs aren’t the problem. Rather, it’s the muddled story, which takes way too long to give Moana her mission."
    },
    {
      "text": "'Moana 2' dazzles visually, with animation that surpasses not just its predecessor but many other films in the genre, in both scope and detail."
    },
    {
      "text": "“Moana” was artful, but this sequel isn’t."
    },
    {
      "text": "I think Moana 2 coming to theaters was a wise choice and a good elevation of the filmmakers’ hard work that I think most audiences will love and enjoy and rewatch for years to come."
    },
    {
      "text": "Moana returns to the sea but without the same enthusiasm and poignancy of the first installment. [Full Review in Spanish]"
    },
    {
      "text": "As in the first movie, there are respectful nods to Polynesian culture and mythology in a script that ripples with gentle humour."
    },
    {
      "text": "I have no doubt it will make a boatload of money, setting the stage for yet another wave of sequels. But don't mistake “Moana 2” for anything other than a temporary fill-in."
    },
    {
      "text": "The sequel recaptures much of the charm of the original but falters when it comes to its musical numbers. Without Lin-Manuel Miranda’s signature touch, the soundtrack lacks the memorable magic that made the first film’s songs so iconic."
    },
    {
      "text": "The animation is spectacular but the story and songs decidedly less so in this sequel to Disney’s blockbuster 2016 animated musical [which] suffers from the common affliction of sequelitis, falling short of its predecessor."
    },
    {
      "text": "Everything that worked in Moana returns in this sequel, but to a lesser extent; the main story feels less personal, though more ambitious. [Full review in Spanish]"
    },
    {
      "text": "\"Moana 2\" is fun. The story here is better than most sequels—it almost starts to rehash the plot of the first movie before finding new zigs to zag—and the overall structure of the journey feels more akin to mythology than rote adventure. Not"
    },
    {
      "text": "Visually, the film is a triumph, but despite the freedom to draw any number of paths, there’s a lack of heft to help the movie reach the emotional heights of the original."
    },
    {
      "text": "While it may have worked as a cable-TV spinoff, as it is, Moana 2 is at best sub-par escapism. At worst, it's an anger-inducing waste of time."
    },
    {
      "text": "The character of Moana is so inspirational for young kids. Auli’I Cravalho brings maturity and sense of duty to her. She’s fearless and gutsy and is the kind of selfless character family movies need."
    },
    {
      "text": "Very much in line with what today's Disney is all about, content-strategy-wise, these days: Namely, a need to stretch intellectual property well beyond its natural breaking point. The plot is nonsense, but at least it looks great."
    },
    {
      "text": "Moana 2 feels stuck in the pattern of the first movie and a holding pattern for whatever's to come in any proceeding movie—or movies."
    },
    {
      "text": "Had it been its intended TV show, with more time to experiment, this could have amounted to something decently entertaining. As a feature film however, Moana 2 isn’t so much an ocean of wonder as it is a shallow pool of bemusement."
    },
    {
      "text": "She is Moana! And, frankly, she deserves a little more respect than this."
    },
    {
      "text": "It has enough color, excitement and slapstick humor to amuse viewers too young for Wicked and not nearly cretinous enough to deserve the likes of Red One but anyone falling outside of those parameters are likely to find it to be fairly pointless"
    },
    {
      "text": "There’s enough here to entertain younger viewers, but Moana 2 feels adrift at sea, with only fleeting glimpses of the magic that made the first film so beloved."
    },
    {
      "text": "It's a mildly entertaining return to the world of the first movie, but it lacks the excitement and wonder that made the original Moana such a hit."
    },
    {
      "text": "Decades into the “throwaway sequel” game, Disney should at least be able to make a movie good enough for parents to suffer through the unbearable din of chattering children in packed movie theaters across the world."
    },
    {
      "text": "Disjointed, messy, low stakes story; underwhelming songs that unsuccessfully imitate the first's masterful tunes; forgettable new characters. Feels like a 2000s direct-to-video sequel... Gorgeous animation is the only saving grace."
    },
    {
      "text": "Continues the adventures of the feisty, sprightly Polynesian island girl with admirable aplomb, replete with the music, magic, myth-making and action that made Moana such an adored family fave...Does its duty very well and with great artistic industry."
    },
    {
      "text": "Harmless, mildly engaging and amusing."
    },
    {
      "text": "The modern equivalent to those middling Disney Straight-To-Home Video sequels of the 00s: a rehash of what came before with little to offer outside of diehard fans."
    },
    {
      "text": "Overall, while younger children may be frightened by some of the images, the older ones (my two grandchildren included) should have a fun time."
    },
    {
      "text": "A Greek Mythology approach to the storytelling, bringing in more Polynesian gods and making Moana more the hero of her own story - all while NOT diminishing Maui's role. An impressive feat. The songs are just okay but the rest of the film is very strong."
    },
    {
      "text": "The movie is at its strongest when Moana and Maui are onscreen together. The second act suffered from pacing issues but regains momentum in the third act for a strong finish."
    },
    {
      "text": "The storytelling stakes are higher, but it’s also much slicker, as if the edges have been rounded off."
    },
    {
      "text": "Except for a couple of catchy new songs, there is a disappointing, dispiriting narrative flatness to Moana 2, recycling the original’s story (but with more characters, wasting them all) with almost no creative passion"
    },
    {
      "text": "Opening only in theaters, a very special episode of Moana & Friends, featuring Special Guest Star Maui!  Now… whether you like this idea or hate this idea is really up to you and your tastes."
    },
    {
      "text": "A safe but somewhat satisfying sequel, 'Moana 2' doesn't quite capture the magic of its predecessor, but it tries earnestly to replicate it."
    },
    {
      "text": "The current it follows, however basic it may be, still results in an enjoyable effort that families will happily lap up across the upcoming festive season."
    },
    {
      "text": "Kids will surely be drawn to the film for its vibrant color palette, cute animal sidekicks, and bodily fluid humor, but it lacks the inspiration that came with the first film."
    },
    {
      "text": "The problem with this film is that it fails to live up to the original in every single category. You can safely save this one for the small screen."
    },
    {
      "text": "A fairly decent sequel that offers enough for the viewer to have a more or less entertaining time  (Full review in spanish)"
    },
    {
      "text": "Moana 2 is a convoluted mess when it tries to tell a new story and a bland forgettable retread when it leans on the original."
    },
    {
      "text": "Despite following a similar framework as Moana, Moana 2 justifies its existence. It's the clear next step in Moana's journey from aspiring sailor to confident wayfinder whose leadership skills are tested like never before."
    },
    {
      "text": "Moana 2 didn't learn the sequel lesson that more characters in a sequel don't automatically make a better movie. Fans of 2016's Moana should find enough to like in this sequel, which is adequately entertaining but inferior to the original Moana film."
    },
    {
      "text": "I kept wishing for a better balance between story and action. Also, it takes much too long to reunite Maui and Moana. So, this is not top-level Disney, but if Moana gets a bit lost in this chapter, we will wait for her to find her way."
    },
    {
      "text": "With enormous reserves of humor and good will, \"Moana 2\" is a wonderful antidote to that which ails us, and a great holiday flick."
    },
    {
      "text": "Feel free to go and watch Moana 2. A lot of the audience will undoubtedly enjoy it. At the same time one feels you could save some time by mailing Disney a twenty so they can hit their revenue quota, and then just stay at home."
    },
    {
      "text": "Considering the time crunch the creatives were given to transform the original story into a movie, it’s impressive that the new film is anywhere near as entertaining and visually appealing as it is."
    },
    {
      "text": "Moana 2 is a worthy enough follow-up to the 2016 hit. It could have used some more refined storytelling to feel less episodic. But several thrilling adventure sequences and an energetic, charismatic voice cast help the sequel find its way."
    },
    {
      "text": "Everything about Moana 2 feels lesser, and like it was hacked apart with a chainsaw and then stitched together."
    },
    {
      "text": "In the end, Moana 2 is a vehicle for one banger, a feel-good throwback, and a few songs we’ll never talk about again, which doesn’t feel like enough for a brand-new Moana."
    },
    {
      "text": "I was pleasantly diverted, if not entirely wowed."
    },
    {
      "text": "In a vibrant yet uneven sequel, this offers a charming adventure filled with delightful moments and colorful animation, but it ultimately misses the enchanting heights of its predecessor, leaving you to navigate the waves of nostalgia."
    },
    {
      "text": "Moana remains a great character, resourceful and self-reliant but still prone to trip, and her dynamic with Maui is again a joy, even if it’s softened from the snarky interplay of the first film."
    },
    {
      "text": "There are a lot of weaknesses in Moana 2 but enough positives to outweigh them. She may not always know the way, but a more mature Moana is always willing to find one."
    },
    {
      "text": "It’s one of those sequels that gets the band back together, takes them out to accomplish a new quest, and wraps things up in a tight, ninety-ish minutes package."
    },
    {
      "text": "If this is Disney’s idea of boldly rowing towards a brighter future, audiences should be paddling toward other shores."
    },
    {
      "text": "While not perfect, Moana 2 is one of the better recent Disney sequels and an exciting journey that’s perfect to share with the entire family."
    },
    {
      "text": "It’s not a towering sequel, or an outrageously inventive one, but it’s a worthy continuation."
    },
    {
      "text": "Whereas parents and kids alike will have been charmed by the first, Moana 2 will be overshadowed for anybody other than the youngest kids watching. It will likely make a billion dollars regardless."
    },
    {
      "text": "Looking even more gorgeous than its predecessor and boasting exciting adventures and laugh-out-loud comedy, Moana 2 is a fun follow-up to the original despite the story occasionally losing its way."
    },
    {
      "text": "... an undeniable drop in quality when it comes to the music."
    },
    {
      "text": "For a story that so prizes how far its heroine will go, Moana spends so much of this sequel stuck in a rut."
    },
    {
      "text": "This movie had its cute enough moments, exciting enough action sequences, even had a moment of heart by the end, but there's nothing threading these moments into a plot... forming an adventure worth going on or paying for."
    },
    {
      "text": "Moana 2 is more than what I expected a beautiful & triumphant sequel… that starts a bit slow but slowly grows into an epic adventure that truly won me over by the end. The third act I found quite amazing in terms of scale & emotion!"
    },
    {
      "text": "In a story that brings in a literal boatload of new characters, it’s hard to shake the feeling that “Moana 2” got caught in the crosswinds -- too blown between shifting studio imperatives to really find its own way."
    },
    {
      "text": "When the cast members gather to sing new the number “What Could Be Better Than This?” I couldn’t help but think, “A lot of things, especially the first ‘Moana.’” On the positive side, the new film looks great; it’s even more colourful than the original."
    },
    {
      "text": "Still, after a few missteps with films like Wish and Strange World, Moana 2 brings back the magic to Disney animation that has been missing for the past few years."
    },
    {
      "text": "Moana’s musical numbers were its greatest strength; Moana 2’s musical numbers are its biggest weakness."
    },
    {
      "text": "Moana 2 rides a tidal wave of snappy tunes, eye-popping animation, and a celebration of Polynesian culture in an action-packed sequel that's just as entertaining as the fantastic original."
    },
    {
      "text": "A delightful & worthy follow-up to the original 2016 film. The new crew is a lovable addition, while Auliʻi Cravalho's Moana is adorable as ever. But it's Dwayne Johnson's Maui that once again elevates the whole magical adventure. [Full review in Spanish]"
    },
    {
      "text": "Moana 2 is a worthy sequel that expands the world and mythology of the original while retaining its heart and sense of wonder. A visually dazzling adventure with compelling characters, epic stakes, and plenty of charm, leaving audiences eager for more."
    },
    {
      "text": "The TV roots are hard to ignore and you can just see the commercial breaks when they pop up. But it’s hard not to be swept away by the songs and beauty."
    },
    {
      "text": "Moana 2 is visually stunning but lacking on all other fronts, with poor character work, a thin story, and weaker songs than the original Disney film."
    },
    {
      "text": "The tunes don't pop quite as hard, but this energetic sequel carries the mythology of its world, and especially its strong female protagonist, significantly forward."
    },
    {
      "text": "While Moana 2 is lacking Lin-Manuel Miranda's musical talents, the film's story and resonate themes just might be enough."
    },
    {
      "text": "Moana 2 expands on the original’s lore with stunning animation and some fun moments, but it falls short on the overall music and character journey. While it’s a safe, family-friendly sequel, it lacks the magic that made the first film unforgettable."
    },
    {
      "text": "If it weren't for a few well-timed gags and the delightful leading performance of Auliʻi Cravalho, there would be little to recommend in Vaiana 2."
    },
    {
      "text": "Moana 2 felt like a way inferior Moana 1."
    },
    {
      "text": "The overall sentiment seems to be something like Sequel 101: You loved the first movie, so here’s a second movie that’s a lot like the first movie. This is the good news if that’s what you’re after. If not, well: It’s one hour and 40 minutes."
    },
    {
      "text": "As in the first film, Moana won’t use her might to vanquish a foe. Instead, she’ll use her wits to solve a problem."
    },
    {
      "text": "The film’s world-building is glorious, the ocean bathed in romantic pink light and its deep-sea creatures decorated in bioluminescent patterns."
    },
    {
      "text": "It struggles to capture the groundbreaking magic of the original. That being said, Moana 2 remains a visual feast."
    },
    {
      "text": "The animation is even more beautiful, allowing you to see every grain of sand and drop of ocean spray. With artistry this good, it begs the question for why a live-action remake is needed at all."
    },
    {
      "text": "If you accept it for what it is, rather than what it’s not, you’ll have a better time watching Moana and Maui team-up again."
    },
    {
      "text": "For all the ways Moana 2 fails to live up to the standards set by the Disney films of the 2010s, it has a buried heart that nearly redeems it. If you latch onto that core element, it makes all of the rest of the movie at least more tolerable."
    },
    {
      "text": "The narrative stumbles forward in episodic fits and starts through self-contained story bites that have little impact on the wider, regrettably flabby, arc."
    },
    {
      "text": "It’s not a dud, just a muted version of its forerunner, getting you where you want to go, just with less wind in its sails."
    },
    {
      "text": "With its beautiful, textured animation and its propulsive adventure to the far ends of the ocean, Moana 2 is another win for Disney animation."
    },
    {
      "text": "With a running time that brings us briskly ashore, the film is a grand voyage in miniature -- a taster epic."
    },
    {
      "text": "Fortunately, much like \"Frozen II,\" \"The Incredibles 2,\" and \"Toy Story 4,\" we may not have needed a sequel, but at least the one we got is enjoyable and manages to actually push the story forward."
    },
    {
      "text": "A real movie would give its protagonist something to continue to wrestle with as she learns and grows, but Moana 2 isn’t a real movie."
    },
    {
      "text": "There is still plenty of fun to be had for the whole family and hilarious bits that are sure to get the kids rolling, but that is where most of the joy ends."
    },
    {
      "text": "What once seemed so effortlessly charming about this young wayfinder forging her own path has, in Part Two, become more convoluted and stilted — it’s a journey that, frustratingly, leads nowhere."
    },
    {
      "text": "It is all inoffensive enough, but weirdly lacking in anything genuinely passionate or heartfelt, all managed with frictionless smoothness and algorithmic efficiency."
    },
    {
      "text": "Moana 2 is always a joy to look at, but this remains firmly the kind of sequel aimed solely at people who want to watch the same movie again, only with a number in the title."
    },
    {
      "text": "Moana 2 is a movie that fails to even compare to the original in nearly every way that matters. None of the emotional beats land, the story meanders around as the TV patchwork becomes very apparent, and none of the songs are memorable."
    },
    {
      "text": "Moana and Mau are back like they never left! While I could take or leave some of the new characters, they really up the stakes in this adventure. The animation is truly magical as it centers around a story of unifying people."
    },
    {
      "text": "It's simply humanity, and \"Moana 2\" has a lot of it."
    },
    {
      "text": "While Moana 2 may not reach the unreachable heights of its predecessor, this movie offers enough laughs and visual spectacle for the whole family. The animation is astounding, and everyone on this project brings passion and life to a long-overdue sequel."
    },
    {
      "text": "You’ve got a movie that really tries hard to not just be liked by the audience, but loved. Tries too hard, truth be told. The effort is evident."
    },
    {
      "text": "\"Moana 2\" is a by-the-numbers sequel that feels like someone trying to cram 10 hours into two. I had low expectations, and to be honest, I was still a little disappointed."
    },
    {
      "text": "The animation is still strong and the character beats are affecting, but the villain and his motivations stand in the film's way of true greatness."
    },
    {
      "text": "... Its sense of wonder for a beautifully rendered depiction of the ocean and its islands, as well as humor provided by Johnson and its supporting cast, make Moana's sequel just as worthy for families as the first film."
    },
    {
      "text": "Moana remains as compelling a protagonist as ever in her much-anticipated sequel, whilst her reunion with Maui showcases the wonderful voice talents of Auli’i Cravalho and Dwayne 'The Rock' Johnson."
    },
    {
      "text": "While some of the elements still manage to get a laugh here, the world we were introduced to eight years ago doesn’t feel richer or more exciting."
    },
    {
      "text": "The backstory is intriguing, and the scope of the adventure is worthy of our attention."
    },
    {
      "text": "“Moana 2” is a sparkling family adventure."
    },
    {
      "text": "A movie chock-full of great ideas, but hampered by its messy production, Moana 2 is among Disney's most thematically rich modern sequels, even if it doesn't quite stick the landing."
    },
    {
      "text": "Moana 2 plays it safe. It never embarrasses itself, but it also never does anything remarkable. How much you enjoy the film will be based on how much mileage you get out of simply going out sea with these characters again."
    },
    {
      "text": "“Moana 2” is an okay movie, an above-average kiddie roller-coaster, and a piece of pure product in a way that the first “Moana,” at its best, transcended."
    },
    {
      "text": "A thrilling, higher-stakes sequel with gorgeous animation, great music and colourful characters."
    },
    {
      "text": "Even if it’s not as mold-smashing, the sequel still makes good use of its best assets: The terrific Auli‘i Cravalho brings extra depth to lively wayfarer Moana while Johnson lends powerful sass to endlessly buff sidekick Maui."
    },
    {
      "text": "There’s no way around the fact that it feels awkward, forced and formulaic compared to the first movie."
    },
    {
      "text": "A ramshackle Franken-ship ... with more in common with straight-to-video sequels than the clever original."
    },
    {
      "text": "Where Moana focused on the relationship between the titular adventurer and her reluctant demigod companion, Moana 2 divides its attention among more characters. These personalities become window dressing in a movie short on time."
    },
    {
      "text": "There’s nothing particularly terrible about Moana 2, but the fact that it’s necessary to write 'there’s nothing particularly terrible about Moana 2’ means something still went wrong."
    },
    {
      "text": "It’s always a tough ask to improve upon an original, but “Moana 2” is a sprightly addition to this sea-faring legacy. It does something nearly impossible in our sequel-glutted world: made me want further adventures."
    },
    {
      "text": "While Moana 2 delivers enjoyable moments, it falls short as a sequel to one of 2016's top 5 highest-grossing animated films."
    },
    {
      "text": "It’s not as good as the first and the songs aren't as memorable yet it’s still an entertaining, fulfilling and crowd pleasing sequel. Moana herself remains a wonderful movie heroine."
    },
    {
      "text": "Co-directors David Derrick Jr., Jason Hand, and Dana Ledoux Miller keep everything light and bouncy so that it's a pleasant enough time, but it's hard to watch this sequel on the big screen and not feel like it doesn't quite belong there."
    },
    {
      "text": "Moana 2 never overcomes its unorthodox off-screen origins to deliver a compelling, singular story. Its uninspired plot floats adrift, rudderless, and without an anchor. Where’s a trusty ocean guide when you need one?"
    }
  ],
  "release_year": 2024,
  "duration": 100,
  "genres": [
    "Kids & Family",
    "Musical",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "synopsis": "Walt Disney Animation Studios' epic animated musical \"Moana 2\" takes audiences on an expansive new voyage with Moana, Maui and a brand-new crew of unlikely seafarers. After receiving an unexpected call from her wayfinding ancestors, Moana must journey to the far seas of Oceania and into dangerous, long-lost waters for an adventure unlike anything she's ever faced.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/aLVkiINlIeCkcZIzb7XHzPYgO6L.jpg"
}