{
  "movie_name": "Pitch Perfect",
  "movie_id": "pitch_perfect",
  "total_reviews": 154,
  "reviews": [
    {
      "text": "If it looks like the sort of film you’d like, you’ll probably love it. Even if it isn’t the sort of film you would normally watch, it’s good enough that you’ll likely still find much to enjoy."
    },
    {
      "text": "One of the best comedies ever made"
    },
    {
      "text": "It’s aimed at Glee fans and teenage girls, but the infectious energy will appeal to a wider audience."
    },
    {
      "text": "Pitch Perfect is still aca-exciting a decade after its release."
    },
    {
      "text": "The singing is great, the jokes are plentiful, and, well...Ben Platt! Need I say more?"
    },
    {
      "text": "Pitch Perfect combines the tuneful underdog triumphs of Glee with the sassiness of Bridesmaids to produce a sweet-sounding, wickedly funny movie."
    },
    {
      "text": "Anna Kendrick anchors a terrific cast of young women as they explore internal struggles and external threats in a cappella glory."
    },
    {
      "text": "Features a performance from Rebel Wilson that should turn the actress into a household name."
    },
    {
      "text": "Pitch Perfect isn't always on key, but it's more impressive than a good karaoke performance, enough so to provide plenty of laughs and entertainment."
    },
    {
      "text": "Silly, predictable but funny as hell with an infectiously catchy soundtrack, Pitch Perfect is a ray of cinematic sunshine."
    },
    {
      "text": "rattles through its routine sports underdog plot with witty banter, great singing and plenty of verve and energy"
    },
    {
      "text": "It's not unenjoyable, just unoriginal."
    },
    {
      "text": "At its best, Pitch Perfect is a movie about girl weirdos doing what they love. It might not seem like much, but there's something to be said for portraying young college-aged women who are real misfits."
    },
    {
      "text": "A conventional film built around an entertaining soundtrack."
    },
    {
      "text": "The movie almost makes me consider watching an episode of Glee-almost."
    },
    {
      "text": "Some of the jokes feel a little forced, and it takes a while to get your head around the casual racism-for-laughs and off-the-wall stereotypes."
    },
    {
      "text": "An a-cappella-singing-team movie, starring the exceptionally cute and very talented Anna Kendrick-an acting phenom. She was nominated for a Tony Award at the age of 12."
    },
    {
      "text": "The multitude of references to [\"The Breakfast Club\"] backfires in a major way, but it's a worthwhile lesson to burgeoning filmmakers - don't invoke John Hughes. Don't."
    },
    {
      "text": "Both acerbic and friendly in a way that gives it bite without giving it too much edge."
    },
    {
      "text": "Singing during the dialogue helps."
    },
    {
      "text": "A slovenly lark, but a spirited one."
    },
    {
      "text": "Luckily, Pitch Perfect has just enough flaws to (almost) keep us from making terrible puns around its title, but this fun comedy is good enough to leave an a cappella version of \"No Diggity\" stuck in your head. For a week."
    },
    {
      "text": "Very funny at times, usually when it embraces the campiness of the subject matter."
    },
    {
      "text": "On paper, this all looks oh-so High School Musical: The College Years, but the beauty of Pitch Perfect is they way it turns its formulaic moments into unexpected hilarity."
    },
    {
      "text": "Mostly works because the characters are engaging and the musical performances well-chosen and well-done"
    },
    {
      "text": "Is Pitch Perfect this year's Bridesmaids? If by that we mean a thoroughly likable and surprisingly funny comedy, then yes, I suppose it is."
    },
    {
      "text": "The sung numbers are pretty dreadful but you can't have everything."
    },
    {
      "text": "It's 80% affectionate parody of this sort of musical, but the numbers are taken seriously and are admirably choreographed, and the performances are sprightly."
    },
    {
      "text": "( ... ) after several years of Hollywood digging into ever deeper wells of gross-out smut, this is a real reversal of fortune."
    },
    {
      "text": "There are things to whinge about here. But Pitch Perfect proves impossible to resist."
    },
    {
      "text": "It's a lightweight confection, but Pitch Perfect is great fun while the fat lady (and the skinny one) sings."
    },
    {
      "text": "As far as the so-called humour goes, we're operating on a sliding scale from lazy to downright offensive."
    },
    {
      "text": "Even if Pitch Perfect doesn't stand up to much scrutiny, it's still an enjoyable romp on the surface."
    },
    {
      "text": "There are great moments and the songs are well put together and catchy."
    },
    {
      "text": "It's like a superior, wittier double-episode of Glee."
    },
    {
      "text": "The song's the same, but Pitch Perfect is a great cover version."
    },
    {
      "text": "Amusing though the movie can be, there's something missing in the warmth department. Like songs without accompaniment, its jokes lack any charm or liking for the characters."
    },
    {
      "text": "The plot won't surprise but it's fun and freaky in equal measure."
    },
    {
      "text": "The Spinal Tap of unaccompanied singing."
    },
    {
      "text": "Hugely enjoyable comedy that hits all the right notes, thanks to a razor-sharp script, impressively staged musical numbers and a pair of brilliant comic performances from Anna Kendrick and Rebel Wilson."
    },
    {
      "text": "Kendrick's alt-girl good-naturedly holds it all together, leaving room for Australian star Wilson to really shine with some inspired improv while comedy nuggets are strewn elsewhere ..."
    },
    {
      "text": "Oh, the gag-packed trailer spoiled the entire film."
    },
    {
      "text": "It is both refreshingly funny and teen-panderingly cheesy. Ladies and gentlemen ... it seems we have here what all the young kids these days refer to as a 'mash-up'."
    },
    {
      "text": "'30 Rock' and 'New Girl' writer Kay Cannon has created brilliant characters."
    },
    {
      "text": "IF three series of Glee haven't dented your enthusiasm for snarky comedy interspersed with glossy a cappella \"mash-ups\" this one could be for you."
    },
    {
      "text": "There's enough charming here to make me wish that the movie had trusted itself enough to know that it doesn't need to dispense grossout humiliation to the characters in order to make them appealing."
    },
    {
      "text": "The jokes are a little hit and miss, but when the film risks going off-beat it's quite appealing."
    },
    {
      "text": "It's the kind of silly you can only get away with when your writing is very smart. A little bit odd and very, very funny."
    },
    {
      "text": "Kendrick and Wilson have the right kind of sass to entertain; they may not be as glamorous as the kids in Glee, but in Pitch Perfect, they seem like the girls who are having all the fun."
    },
    {
      "text": "Kay Cannon, a writer on the 30 Rock television series, has come up with a screenplay that seems to give the right amount of time to each individual."
    },
    {
      "text": "There's girl-bonding aplenty in this upbeat comedy about a high-school a capella competition in which voice-only singing, envy and vomiting play key roles...it's Glee with extra sass."
    },
    {
      "text": "A spry B-film aimed at Generation Glee."
    },
    {
      "text": "It's formulaic, but it conjures up its own offbeat vibe and the musical numbers are gold."
    },
    {
      "text": "On purely escapist terms, however, the over-supply of so-so sounds is never enough to ruin anyone's enjoyment of a very likeable picture."
    },
    {
      "text": "But in a small-scale way, aided by a strong, wry central performance from Kendrick, Pitch Perfect has its charms."
    },
    {
      "text": "Great young actors ... are encouraged to seriously overplay their particular stereotype, which makes the film grating and repetitive ... Obviously green-lit in the wake of Glee, it makes a joke at that show's expense, setting a challenge it fails to win."
    },
    {
      "text": "In 2011, Bridesmaids launched a thousand annoying \"girls are funny too!\" articles. Hopefully, Pitch Perfect will be seen as a \"well, duh\" retort."
    },
    {
      "text": "Anna Kendrick's assured lead performance elevates this Glee-type musical affair from its modest confines."
    },
    {
      "text": "Everything about the film feels fresh..... For the target market, there are laughs galore, toe-tapping rhythms and a good up-tempo beat as Pitch Perfect hits its notes and delivers a romping fun time"
    },
    {
      "text": "A tuneful smoothie concocted with several well-known ingredients thrown into a blender, including 'Glee,' 'Bridesmaids,' even a dash of 'High School Musical.'"
    },
    {
      "text": "Gleeks and Glee-haters alike should rally around this raucous musical comedy."
    },
    {
      "text": "... parodies, by faithful imitation, the silly adolescent soap opera of Glee ..."
    },
    {
      "text": "Pitch Perfect isn't particularly bad. It isn't particularly anything. And that's what's most disappointing about it. That so many talented people could have worked so hard to produce something so... nothing."
    },
    {
      "text": "Saucy, snarky and spirited..."
    },
    {
      "text": "Rebel Wilson practically rescues the film (and some of the songs) on her own with her talent, panache and self-confidence. She reminds me of irrepressible Melissa McCarthy in 'Bridesmaids' or Nikki Blonsky in 'Hairspray.'"
    },
    {
      "text": "This take on an a-capella group competition is a mild satire that provides a few good laughs and terrific performances by Anna Kendrick and Rebel Wilson."
    },
    {
      "text": "A cross between \"Glee\" and \"Best of Show\" but not always at its best. Slow in parts but Rebel Wilson saves the day."
    },
    {
      "text": "The girls, for the most part, are genuinely funny, weird, real, and, most excitingly, confident."
    },
    {
      "text": "Warblers win the day in this sweet-natured film (based on a swell behind-the-scenes book by Mickey Rapkin) about the life and loves of collegians from competing a-cappella groups."
    },
    {
      "text": "Deliciously filled with wall-to-wall music that comes only from the mouth."
    },
    {
      "text": "More annoying than entertaining, the setup scenes and characters are equally ludicrous."
    },
    {
      "text": "We're in a world that revolves around a cappella singing. It may make no sense to you, but the idea that everyone is taking it so seriously is part of the joke."
    },
    {
      "text": "A very funny and at times joyous ode to college a cappella groups."
    },
    {
      "text": "As far as college comedies go, it ain't quite Animal House but I laughed more than I thought I would."
    },
    {
      "text": "It's hard to imagine anyone outside of dug-in curmudgeons not being swept up in the musical rush of this movie."
    },
    {
      "text": "There are so many reasons to hate Pitch Perfect, and yet it's impossibly tough to do so."
    },
    {
      "text": "Recycled as it is from the spare parts of fun fluff like \"Bring it On,\" Pitch Perfect understands its own fizzy pop irrelevance, and wisely puts the emphasis on getting laughs."
    },
    {
      "text": "An impossible-to-dislike burst of positive energy brimming with winsome performances."
    },
    {
      "text": "Rebel Wilson steals the show as Fat Amy, a big, bountiful Bella whose generous physical proportions are matched by her gift of knowing how, when and where to sprinkle on just the right amount of comedic side-dish seasoning."
    },
    {
      "text": "You can call this Glee meets Mean Girls if you want to, but this riotously intelligent comedy is much better than that"
    },
    {
      "text": "Cannon doesn't go in for rococo hipster badinage in the vein of Diablo Cody. She can pare down a joke to its essence ..."
    },
    {
      "text": "Edgy, teen-friendly musical comedy uplifts with song, heart."
    },
    {
      "text": "'Pitch Perfect' hits the right notes that will satisfy not just music fans of the songs, but anyone who wants to have an enjoyable evening of entertainment."
    },
    {
      "text": "The movie belongs to Rebel Wilson as Fat Amy. What's most refreshing about the character is that she's all about being confident and taking control -- a rare break from American movies that do nothing but marginalize, mock or pity their plus-sized women."
    },
    {
      "text": "The only time the movie connects is when Kendrick & Co. start singing, performing dynamic and energetically staged numbers."
    },
    {
      "text": "Built on a template that's familiar to anyone who's seen such movies as Bring It On, this comedy uses an engaging cast and a parade of popular songs (energetically recreated by several choral groups) to create a buoyant crowd-pleaser."
    },
    {
      "text": "Often it feels like a soundtrack in search of a movie."
    },
    {
      "text": "Some films make you weep; others make you squirm. Then there are those that simply make you smile. Pitch Perfect falls into the third category thanks to its strong script, charming cast and catchy soundtrack."
    },
    {
      "text": "Damned good genre entertainment. I laughed my pianissimo off."
    },
    {
      "text": "A light feminist streak runs through this comedy, which is well acted by Kendrick but is better written than directed."
    },
    {
      "text": "The quality of the material may not be the highest, but the energy and execution of it certainly is in this appealingly sprightly investigation of the world of a capella."
    },
    {
      "text": "A fun, young musical comedy boosted by Anna Kendrick's straight-woman chemistry and multiple amusing supporting characters."
    },
    {
      "text": "If there is an honest moment in this should-be TV sitcom, I missed it. A-ca-phony."
    },
    {
      "text": "It's done with freshness and style, a very funny script and a lot of energy, and turns out to be one of the nicest surprises so far this fall."
    },
    {
      "text": "And sure, while fresh-faced actors belting out reworked top-40 hits sounds tolerably safe and familiar, Pitch Perfect makes Glee look like Mad Men."
    },
    {
      "text": "Without precious vocal purity, all we're left with is a lame sense of humor, dark areolas, and a vomit slip 'n slide."
    },
    {
      "text": "'Pitch Perfect' strives to be edgy, yet it never quite lets go of wanting to be comfy at the same time."
    },
    {
      "text": "It's formulaic, it's predictable and it's hokey -- but it also is surprisingly fun, built around a solid cast, unexpected humor and a pop-infused acappella soundtrack."
    },
    {
      "text": "Luckily, the good outweighs the bad in this bright 'n' breezy comedy about competitive a cappella singing groups."
    },
    {
      "text": "If you're not grinning by the end of this light, funny crowd-pleaser, consider yourself tone deaf."
    },
    {
      "text": "This is another one of those movies that feels like it emerged from the Great Hollywood Blender of Movie Ideas."
    },
    {
      "text": "\"Pitch Perfect\" is major key all the way, a blast of tuneful sugary cheer kicked up with enough tart humor to offset the glucose."
    },
    {
      "text": "Belatedly riffing on the TV series \"Glee\" might have produced some sour notes, but \"Pitch Perfect\" finds just the right tone."
    },
    {
      "text": "The musical mixes are terrific and Kendrick proves she is a real movie star but the mash-up with low comedy keeps tripping up the movie's momentum."
    },
    {
      "text": "\"Pitch Perfect\" totally gets one critical fact: A cappella singing contests are both a little bit amazing and a little bit ridiculous. The tone that the film strikes is a perfect balance between the two extremes."
    },
    {
      "text": "A movie that's made to be obsessed over, seen 50 times, quoted as devoutly as such sacred texts as \"Heathers\" and \"Bring It On.\""
    },
    {
      "text": "\"Pitch Perfect\" doesn't take itself any more seriously than it has to, and has plenty of fun both sending up and celebrating its subject matter."
    },
    {
      "text": "Though likable and energetic, the movie is so eager to put a finger on every pulse that it loses the rhythm."
    },
    {
      "text": "A let's-put-on-a-show story so steeped in backlot Hollywood convention it almost embarrasses itself, with the difference being it really doesn't care."
    },
    {
      "text": "Pitch Perfect has enough pleasures to overcome its failings, even if the margin is fairly slim at times. It is worth watching, but prepare to be bothered by how much of its potential goes unrealized."
    },
    {
      "text": "An immensely charming comedy filled with great performances (both acting and musical) that's only slightly hindered by its conventional formula."
    },
    {
      "text": "'Pitch Perfect' seeks nothing more than to be entertaining, and it is.(Full Content Review for Parents also available)"
    },
    {
      "text": "Though it might sound like a hacky platitude, don't be surprised if \"Pitch Perfect\" leaves a fair share of its audiences outwardly cheering."
    },
    {
      "text": "There's plenty of reason to doubt it has enough self-awareness to realize how awkward its mesh of cynicism and sincerity is."
    },
    {
      "text": "The spirited a cappella singing in Pitch Perfect makes a predictable, feather-light coming-of-age film irresistibly fun."
    },
    {
      "text": "Only occasionally funny and not at all illuminating about the rich world of a cappella singing."
    },
    {
      "text": "Despite its ebullience, technical polish and desire to please, the picture comes across as overly derivative and hits a surprising number of sour notes."
    },
    {
      "text": "What helps offset the predictable in this very predictable movie is a series of show-stopping numbers, so props to the folks who oversaw music and choreography. But the true saving grace is a few of the central players."
    },
    {
      "text": "Not quite pitch perfect, but it's irresistible."
    },
    {
      "text": "The film's really all over the place and for every good bit, like a mid-movie Riff-off that's like an A Cappella poetry slam, there is underserved excess, like Beca's attempts to get the college radio station manager to play one of her mixes."
    },
    {
      "text": "I got a goofball kick out of Pitch Perfect. Anna Kendrick is terrific in this spoofy, sassy romp. And I have one word for Rebel Wilson - Wow!"
    },
    {
      "text": "The throwaway lines in Kay Cannon's script are so many and so expertly deployed that you basically spend the whole movie digging through the trash."
    },
    {
      "text": "It moves at a clip, a sprightly relay race between a dozen or so mellifluous performers."
    },
    {
      "text": "I smiled for the first half of the movie and started laughing hysterically when a supporting character hijacked it from its stars."
    },
    {
      "text": "This slight but sunny entertainment is something of an idiot-grin-maker."
    },
    {
      "text": "\"Pitch Perfect\" has some legitimately funny moments."
    },
    {
      "text": "[It] could have used a little more spontaneous spirit and a little less manufactured sass. What it has going for it, though, is an amiably enthusiastic cast."
    },
    {
      "text": "This unabashed dorky/cool embrace of the world of a cappella is a happy surprise at every turn."
    },
    {
      "text": "To paraphrase one of the characters in the movie, it's A-Ca-Awesome."
    },
    {
      "text": "The musical numbers, however, are quite good, if only because they're so disjointed from the narrative."
    },
    {
      "text": "Pitch Perfect looks, sounds, and feels like pretty much every other movie that features a singing or dancing competition."
    },
    {
      "text": "You leave it wanting to sing and dance."
    },
    {
      "text": "It's music, it's comedy, it's fun."
    },
    {
      "text": "As mean-spirited as failed 'American Idol' auditions."
    },
    {
      "text": "The movie is far too aware of its influences, especially when it imitates Bring It On's silly \"cheerocracy\"-style slang with its own overextended series of aca-neologisms."
    },
    {
      "text": "It's a twentysomething song-and-dance movie built around rival a cappella groups. That's more exciting than dueling string quartets, I suppose - but no, the quartets would be performing better material."
    },
    {
      "text": "A well-groomed, funny and altogether special musical comedy, Pitch Perfect hits an abundance of right notes, resulting in one of the most full-bodied mainstream comedies of the year."
    },
    {
      "text": "The combination of inventive musical numbers and winning characters makes Pitch Perfect a pleasant surprise."
    },
    {
      "text": "The very appealing cast (led by ingnue superstar Anna Kendrick) and an overall sense of buoyant silliness advances it to the top of the class."
    },
    {
      "text": "Delving into the peviously unexplored world of collegiate a cappella singing, there's a smarty-pants, tongue-in-cheek tone to 'Pitch Perfect.'"
    },
    {
      "text": "It's ridiculous and predictable but also just a ton of fun, so you may as well give up and give in to your inner musical theater geek."
    },
    {
      "text": "Without the music, the movie might have been painful, but the songs, Auto-Tuned and processed as they are, generate a hooky bliss. They're the chewy center of this ultra-synthetic hard candy."
    },
    {
      "text": "Far more often than not, Pitch Perfect lives up to its own title."
    },
    {
      "text": "...it never ends up being anything like a fully realized version of any of the movies it's lifting its jokes and/or tones from."
    },
    {
      "text": "It would I take a misanthrope of the highest order to dislike 'Pitch Perfect,' preposterous and predictable though it may be."
    },
    {
      "text": "Pitch Perfect takes what ought to be a story with limited appeal and makes it so hilarious you can't deny it."
    },
    {
      "text": "You've seen this story before and you'll see it again. There's no need to see it now."
    },
    {
      "text": "You don't have to be perfect to be a ton of fun."
    },
    {
      "text": "An enjoyably snarky campus romp that's both wildly nerdy and somewhat sexy."
    },
    {
      "text": "Pitch Perfect proves no one is too cool for the perfect pop song."
    },
    {
      "text": "This film could have done with a few more mouth beats and unlikely moments of extracurricular celebrity."
    },
    {
      "text": "As spirited and irresistible as the college a cappella craze it celebrates, Pitch Perfect is a cheeky delight."
    },
    {
      "text": "Jason Moore's film is more or less successful in inverse proportion to the degree that it plays its material by the book."
    },
    {
      "text": "[VIDEO ESSAY] Essentially a glorified episode of the television show \"Glee,\" \"Pitch Perfect\" is a spotty coming-of-age comedy that only marginally pays off on its promise of delivering harmonized vocal virtuosity."
    }
  ],
  "release_year": 2012,
  "duration": 112,
  "genres": [
    "Musical",
    "Comedy",
    "Romance"
  ],
  "age_rating": "PG-13",
  "synopsis": "College student Beca (Anna Kendrick) knows she does not want to be part of a clique, but that's exactly where she finds herself after arriving at her new school. Thrust in among mean gals, nice gals and just plain weird gals, Beca finds that the only thing they have in common is how well they sing together. She takes the women of the group out of their comfort zone of traditional arrangements and into a world of amazing harmonic combinations in a fight to the top of college music competitions.",
  "popularity": 8.3,
  "poster_url": "https://image.tmdb.org/t/p/original/cUjjK6tTrugybsBbIQlV6VTd0aK.jpg"
}