{
  "movie_name": "Prometheus",
  "movie_id": "prometheus_2012",
  "total_reviews": 309,
  "reviews": [
    {
      "text": "Prometheus may not be a satisfying prequel, but it more than makes up for it by being a fascinating sci fi film to unpack."
    },
    {
      "text": "[Ridley] showcases his directorial prowess of masterfully building up the tension before evolving into a full-blown terror, coupled with Marc Streitensfeld’s riveting score and Dariusz Wolski’s stunning cinematography."
    },
    {
      "text": "It's not without its narrative stumbles, yet it's still impressive to see how Scott can return to the franchise and show how he is happy to challenge himself by exploring new avenues as opposed to resting on his laurels."
    },
    {
      "text": "Prometheus asks a lot of questions that it refuses to answer, but if you're wiling to go along this philosophical ride there's plenty to enjoy."
    },
    {
      "text": "Ambitious to a fault, Scott's return to the beloved franchise is as philosophical as it is messy. Smart scientists make dumb decisions, yes, but the film is gorgeous, intriguing in its heady ideas, and features a solid Ripley combo in Vickers & Shaw"
    },
    {
      "text": "At its most ambitious, 'Prometheus' plants suggestions of the extraterrestrial origins of life on Earth, a Godlike race sowing genetic seeds across galaxy, and even an Old Testament-like sense of retribution..."
    },
    {
      "text": "The flaws in the screenplay undo even Ridley Scott’s profound level of visual brilliance, which is on considerable display here."
    },
    {
      "text": "It’s a visual delight with a story that delivers genuine intensity, some great characters, and an ending that had me howling for more."
    },
    {
      "text": "An Alien story without Xenomorphs allows Prometheus to explore the horrors beyond and within our galaxy."
    },
    {
      "text": "You can see the film that could have been made off somewhere in the distance, but you cannot reach it because somebody built this replacement in its way."
    },
    {
      "text": "The ideas are big, bold and brutal."
    },
    {
      "text": "Dazzles from start to finish."
    },
    {
      "text": "A mess of unresolved ideas and poorly defined beings."
    },
    {
      "text": "A beautiful film to behold."
    },
    {
      "text": "It is as if it were a science fiction theory that bets on an ingenious and interesting mythology, but at the same time, enigmatic. [Full review in Spanish]"
    },
    {
      "text": "The ultimate effectiveness of Prometheus for individual viewers will most likely come down to whether the film carries them away to new places, as it did for me..."
    },
    {
      "text": "Ridley Scott's return to the universe of ALIEN is slightly undone by blockbuster movie logic and a rather shonky, at times appalling, script."
    },
    {
      "text": "Overall, Prometheus is enjoyable as a summer blockbuster but it does not offer enough to compliment the Alien franchise."
    },
    {
      "text": "So is this the film of the year? My epiphany in the cinema? No, because \"Prometheus\" is not exactly flawless. There are some crazy stupid moments in the film."
    },
    {
      "text": "Between the trippy visuals and strong characters, Scott spins an engrossing yarn. But the story is as messy and convoluted as the serpentine creatures that inevitably uncoil from the alien crypt."
    },
    {
      "text": "A fascinating journey, to be sure, but its mix of big ideas with horror and suspense never quite meshes together."
    },
    {
      "text": "A magical bit of science fiction that Scott uses to start widening the world he began in 1979 with Alien."
    },
    {
      "text": "This is a well-crafted piece of work that astutely balances science fiction with some genuinely jump-out-of-your-seat moments. It's a throwback that should please fans of the sci-fi genre."
    },
    {
      "text": "Prometheus is a hard one to judge, despite what people had been telling me for years, it's actually not that bad... nor is it that great either. Average it is then!"
    },
    {
      "text": "Even when its reach doesn't quite meet its grasp, it still deserves to be seen."
    },
    {
      "text": "The plot has a lot of very intriguing concepts and the writers and Scott have come up with a myriad of ways to organically integrate much of the beloved Alien iconography while still forging glorious new images."
    },
    {
      "text": "Fans of Scott's previous sci-fi efforts will be desperately disappointed to discover a film which promises an innumerable degree of far more enticing themes and ideas than it can ultimately deliver."
    },
    {
      "text": "Played with an understated sense of humor by Fassbender, [David's] one of the most entrancing creations on the big screen this year."
    },
    {
      "text": "This movie is smart, suspenseful and at times, even funny-and the acting is impeccable."
    },
    {
      "text": "Prometheus is one of those big ruined films that are worth talking about in terms of how it got ruined, and how it might've been saved."
    },
    {
      "text": "The film is first and foremost a well-made, immersive piece of sci-fi/horror that serves as a perfect addition to Scott's other black space classic."
    },
    {
      "text": "Viewers with short attention spans probably won't enjoy the gradual build Scott does so well, but it's worth the wait."
    },
    {
      "text": "The passage of time brings [Ridley Scott] back to the genre with the questions of a man facing his mortality-and with the tricks of a showman who hasn't forgotten how to scare you."
    },
    {
      "text": "Despite its flaws, Prometheus is a visually stunning film (well worth the extra expense of 3-D) that leaves the viewer pondering its themes of creation's longing to know its creator long after the credits have rolled."
    },
    {
      "text": "What is absolutely guaranteed, however, is that Prometheus will entertain you. It's a damn good ride, and it will, occasionally, make you think."
    },
    {
      "text": "Director Ridley Scott is returning to his roots here, making the kind of atmospheric horror that builds up to its scare through judicious use of music, lighting and setting to set moods, and then punctuating scenes with explosive, frightening violence."
    },
    {
      "text": "Prometheus recaptures the essence of not only a beloved franchise, but also an admired yet complicated genre many filmmakers attempt but few successfully. In short, it shows the amateurs how it's really done."
    },
    {
      "text": "A movie like Prometheus-and that is the extraordinary power of its genre-serves as an outlet for irrational connections."
    },
    {
      "text": "It leads you expect much more than is actually delivered."
    },
    {
      "text": "Scott's long-awaited return to science fiction is equal parts wondrous, frustrating and flawed."
    },
    {
      "text": "Even if the movie's logic ultimately spirals down into a vortex of hysteria, horror and hokum, I enjoyed the bulldozer intensity of the climax, which barely keeps a lid on the crackpot cult movie that's wrestling for the soul of this... blockbuster."
    },
    {
      "text": "Prometheus is a mesmerising collision of theological angst, going further than Alien in beating on HP Lovecraft's tentacle doorknocker."
    },
    {
      "text": "Prometheus is so visually ravishing with stunning special effects... But the characterizations are thin and one-note, leaving most of its talented cast members without much interesting to say or do before they get [killed]."
    },
    {
      "text": "Prometheus is undeniably gorgeous. It's hard to imagine anything looking better, especially with its brilliant 3-D that's well worth the upsell."
    },
    {
      "text": "With poise and great artistry, Scott crafts a world that combines high-tech science, primal beginnings, human frailty and sheer horror."
    },
    {
      "text": "The story is a lurching carnival of budget blasts."
    },
    {
      "text": "Scott tries not to remake Alien and attempts instead a mini-Kubrick, a muddled Tarkovsky, perhaps an Asimov, or even the recently-departed Bradbury. But old habits, and slimy beings, die hard."
    },
    {
      "text": "The best-looking stupid movie I've seen all year. It's sumptuously photographed, and often inane."
    },
    {
      "text": "Many walked into this movie expecting a science fiction thriller in the vein of Ridley Scott's original Alien. This, I feel, was a colossal mistake."
    },
    {
      "text": "It is easily the most cerebral endeavor of its kind since \"Minority Report.\""
    },
    {
      "text": "Prometheus is scary only in the sum of instincts and talent for movie-making that have been lost."
    },
    {
      "text": "Any lack in originality is handsomely compensated by the plethora of 3D visual treats courtesy of a crackerjack technical crew that creates an eerie interplanetary moonscape that's as epic as it is requisitely foreboding."
    },
    {
      "text": "WPrometheus offers hypotheses about the origin of life on our planet that are so well constructed, they make real-life theories about extraterrestrials seem highly feasible."
    },
    {
      "text": "The mishmash of grotesque body-horror and chin-stroking existentialism does not always make for the most coherent movie, but it is at least an entertaining one and certainly no black mark on the franchise."
    },
    {
      "text": "Rather than trying to reinvent the franchise with new tricks, \"Prometheus\" wants to return us to that uncertain terror that loomed over the 1979 original."
    },
    {
      "text": "Prometheus, as both a response to Alien and its own attempts at philosophical and spiritual investigations, ended up filling in holes that simply were not mandatory to have filled."
    },
    {
      "text": "The movie wasn't giving my brain much of a workout, but my eyes got a nice buzz. \"Prometheus\" is straight-up gorgeous..."
    },
    {
      "text": "Insulting lip service to 2001 notwithstanding, Prometheus shocks and awes with more than sufficient technical bravura. If only it was as smart as it clearly thinks it is."
    },
    {
      "text": "Artfully designed with special effects that border on the elegant-there's no other way to put it-\"Prometheus\" is a visual delight."
    },
    {
      "text": "There's a lot of college dorm philosophical mumbo jumbo on top but it all really boils down to, \"Man seeks his creator/makes contact/discovers he is a total jerk.\""
    },
    {
      "text": "Prometheus is a welcome return to form for Ridley Scott -- delivering a fascinating sci-fi storyline, gorgeous 3D visuals, and competent filmmaking choices."
    },
    {
      "text": "Very few films can create a genuine sense of wonder and discovery, and Prometheus manages it for its entire 124 minute running time ... almost entirely a sensory experience."
    },
    {
      "text": "Never quite matching Alien or Aliens for emotional authenticity - but definitely holding you in tow until the final moments. Ridley Scott isn't much for illustrating humanity, but he sure as hell knows how to craft aliens."
    },
    {
      "text": "Prometheus might have given serous thought to this premise, but it opts instead for strenuous action. Still, the film has glimmerings of intelligence."
    },
    {
      "text": "It isn't perfect, but Prometheus is a thoroughly entertaining summer blockbuster that is a cut above the rest due to an amazing cast and Ridley Scott, who re-establishes himself as one of our greatest world building filmmakers."
    },
    {
      "text": "The film [has] a kind of \"been there, done that\" feeling."
    },
    {
      "text": "Returning to the genre that skyrocketed his career with \"Alien\" and \"Blade Runner,\" Scott has fashioned a fascinating new mystery within his original \"Alien\" universe."
    },
    {
      "text": "Scott has lensed a film that possesses the look of a video View-Master. It's jaw-droppingly striking."
    },
    {
      "text": "I won't say that I'm con-metheus, but I'm not entirely pro-metheus either."
    },
    {
      "text": "An excellent film, but not quite the genre-redefining, mind-blowing, life-changing experience much of the hype suggests."
    },
    {
      "text": "In space, everyone can hear you try too hard."
    },
    {
      "text": "Scott has indeed created another sci-fi classic -- brilliant mess that it is."
    },
    {
      "text": "\"Prometheus\" comes off as a really fun movie with knockout effects, a splendid visual design, tense scenes, a playful attitude but ... well, it's a wee bit familiar."
    },
    {
      "text": "Ridley Scott retells an old story"
    },
    {
      "text": "After a stunning opening, Scott fails to close the deal"
    },
    {
      "text": "Prometheus asks a big, loaded question, but teasingly leaves the answer for another mission...and another movie."
    },
    {
      "text": "For those who aren't opposed to a little 'Why?' in their sci-fi, Ridley offers a penetrating other-worldly adventure like few films in recent memory."
    },
    {
      "text": "Ridley Scott's long-awaited prequel-of-sorts to his game-changing 1979 classic sci-fi terror ride Alien is not only conceptually lame and badly made, it's actually worse than Alien Resurrection."
    },
    {
      "text": "Let's get this straight: 'Prometheus' is not a direct prequel to 'Alien,' 'Aliens' or 'Predator.' However, 'Prometheus' does exist in that particular universe."
    },
    {
      "text": "The movie may be a scare show that leaves many questions unanswered, but Scott's craft earns an exhausted kind of respect."
    },
    {
      "text": "The production design by Arthur Max and the art direction of the film are spectacular. It is an awesome feat of visual art."
    },
    {
      "text": "They would have been better off channeling their inner Ellen Ripley and pulling the release to the airlock before this voyage departed."
    },
    {
      "text": "While I was completely engrossed in 'Prometheus', I felt a tug-of-war going on between the cerebral and visceral elements, right up to the finale."
    },
    {
      "text": "With a few perfectly pitched sequences of sheer terror -- capped by an astonishing surgery scene featuring Rapace -- Scott coils the tension to unbearable tightness."
    },
    {
      "text": "Scott was so intent on returning his spawn to glory that he mistakenly shot for Alien by way of 2001: A Space Odyssey, making it all the more disappointing when he inevitably settled for Aliens by way of Lost in Space."
    },
    {
      "text": "The movie has good acting and a great look, but the plot is confusing and eventually not as interesting as it should be."
    },
    {
      "text": "'Prometheus' could be starting something great. While it looks amazing, the jury is out on whether it ends up reminding me of 'The Matrix Reloaded' more than anything else."
    },
    {
      "text": "a would-be summer blockbuster of intense ambition and visual grandeur, merging metaphysical speculation with healthy doses of gooey-horrific imagery and high-tension suspense"
    },
    {
      "text": "Starts out intriguingly as an exploration of faith and humankind's origins. To my disappointment, though, it largely abandons this once the familiar face-huggers and chest-bursters start to appear."
    },
    {
      "text": "It's a striking composition that's burdened by frustrating unanswered questions that distract from the greater themes of faith and religion in science."
    },
    {
      "text": "It's a gutsy effort but the screenplay from Jon Spaihts and Damon Lindelof isn't strong enough. I was struggling with the characters from the very beginning."
    },
    {
      "text": "It's not necessarily a bad movie, it's just half of a great one. And that's almost more disappointing."
    },
    {
      "text": "For all its grand designs and sweeping vistas, Prometheus could simply do with a bit more story."
    },
    {
      "text": "It's like going to the Dalai Lama with a question only for him to answer you with a question."
    },
    {
      "text": "If this film wasn't burdened with having to serve as a prequel to the 'Alien' series, it would be much stronger overall."
    },
    {
      "text": "The premise that creatures from outer space \"engineered\" human life on earth is loaded with cautionary baggage. For one thing, it screams FICTION and FANTASY in a context that strives for the appearance of realism."
    },
    {
      "text": "\"Alien\" had great characters, unrivaled shocks and a claustrophobic atmosphere. Prometheus ... looks great!"
    },
    {
      "text": "Often good and sometimes bad and occasionally horrendous as a narrative, but it is never, ever, less than a stone-cold masterpiece of design and world-building."
    },
    {
      "text": "...a smart, ambitious, and, admittedly, erratically-paced blockbuster that does seem as though it'd benefit from repeat viewings (as well as a more complete picture promised by inevitable followups)."
    },
    {
      "text": "\"Prometheus\" is a cinematic masterpiece with beautifully haunting visuals and an epic score. Instead of spoon-feeding the audience, Scott allows you to think for yourself!"
    },
    {
      "text": "A hot mess of a screenplay, but extraordinarily ambitious and boasts Ridley Scott's usual arresting visuals."
    },
    {
      "text": "Crushed under the weight of its own pretentious ideas."
    },
    {
      "text": "Beneath the overreaching ambition (pretension?) lies a solidly entertaining creature feature of superior style--maybe not exactly the deep existential examination Scott and Lindelof were striving for, but no small feat all the same."
    },
    {
      "text": "A thinly-veiled intro to the Alien franchise revising that classic's tagline to suggest: In space, no one can hear you scream, except perhaps God."
    },
    {
      "text": "Talvez Scott devesse ter se preocupado mais em resolver os problemas narrativos da produção do que em deixar pontas soltas que justificassem mais uma continuação."
    },
    {
      "text": "The tragedy of this Prometheus is that it begins to ask huge questions, and then saves the answers for a sequel."
    },
    {
      "text": "(The) parent/child and creator/creation themes (are) pretty deep for a film this pretty. What else did you expect from Ridley Scott?"
    },
    {
      "text": "Hobbled by a script that largely ignores its marginally implied protagonist, \"Prometheus\" is a cobbled-together sci-fi movie at odds with itself."
    },
    {
      "text": "If you like grandiose space opera, you'll love \"Prometheus,\" especially in earsplitting, visually overwhelming IMAX."
    },
    {
      "text": "It promises to give us at least science fictional explanations for some of the great questions of human existence, but it never has the courage to answer those questions."
    },
    {
      "text": "Its analytical story line is cold and never warms enough to make it less than inert."
    },
    {
      "text": "Gorgeous, somewhat baffling, and not altogether unpleasant."
    },
    {
      "text": "In a nutshell, the best thing about Prometheus can be summed up in two words: Michael Fassbender."
    },
    {
      "text": "offers the unalloyed pleasure of fierce, intelligent performances in a piece of commendable speculative fiction told on both an epic and an intimate scale."
    },
    {
      "text": "... a major disappointment. 'Alien' fans aren't looking for arty sci-fi or answers to 'the most meaningful questions asked by mankind'; they're looking for something primal, like a cattle prod to the back of the neck."
    },
    {
      "text": "A movie that forces you to be intellectually invested, but not to the point of exhaustion and, in turn, delivers a remarkably enthralling experience."
    },
    {
      "text": "Alienation for some, ecstasy for others. Certain to reign as the best disappointment of 2012, Ridley Scott's Prometheus is a work whose visual splendor can't be denied but whose narrative content will divide audiences."
    },
    {
      "text": "Tense and thrilling, it's an awesome 3-D spectacle."
    },
    {
      "text": "Very cold, analytical, and sort of pretentious. Its no Piranha 3D!"
    },
    {
      "text": "Rapace is a revelation as a tougher then she seems character who actually \"out-Ripleys\" Sigourney Weaver's character in \"Alien.\""
    },
    {
      "text": "It's difficult to discuss the true limitations of the film without exposing a wealth of spoilers, but it seems Ridley Scott has already spoiled enough by returning to the realm of his finest work without a clear exit strategy."
    },
    {
      "text": "Prometheus provides little new knowledge."
    },
    {
      "text": "\"Prometheus\" is visually impressive, so much so that it overshadows the shortcomings in the script by Damon Lindelof and Jon Spaihts."
    },
    {
      "text": "A spectacular and absorbing -- if not exactly unpredictable -- two hours at the movies."
    },
    {
      "text": "( ... ) cinema-goers looking for physical, stellar excitement might be left wishing for booster rockets."
    },
    {
      "text": "a grand space journey along the lines of 2001: A Space Odyssey with teeth and less psychedelic drugs. It is not quite what you'll expect, and it's a better film for it."
    },
    {
      "text": "Noomi Rapace will no longer be referred to as the original Girl with a Dragon Tattoo after her work here."
    },
    {
      "text": "A visually arresting but thematically drab sci-fi thriller."
    },
    {
      "text": "Maybe we came from someone else, maybe we are just living in a giant petri dish, who knows? I had a great time in the theater, I was in this world, and I find myself afterwards asking questions, what more do you want out of a movie than that?"
    },
    {
      "text": "You will believe you are on another planet, visually it is fantastic. I wanted to love this movie but I wound up just liking it. That being said, I can't wait for another one"
    },
    {
      "text": "An intense and thought-provoking piece of sci-fi, with enough moments of sheer horror to give audiences a jolt and enough intelligence to keep them thinking afterward."
    },
    {
      "text": "Regardless of its box office performance, Prometheus has a long life ahead of it."
    },
    {
      "text": "The setup is familiar-the mysterious planet, the slick tunnels, the shocking bodily violation, the broken quarantine, etc. So why is there a gaping hole where the dread should be?"
    },
    {
      "text": "Prometheus tells a much bigger story and does it well, but it's missing what matters most. It's inorganic."
    },
    {
      "text": "If only the screenwriters engaged our intellect like the filmmaker engages our fears, we would have had a new classic, rather than a beautiful, unfulfilled promise."
    },
    {
      "text": "There's definite mastery here, but it's hardly a masterpiece."
    },
    {
      "text": "Prometheus--like, in its telling, the human race itself--is a creation spliced from the DNA of superior forebears."
    },
    {
      "text": "Gorgeous and pretentious, ridiculous and awesome. 'Where do we come from? What is our purpose? What happens when we die?' -- in space, unfortunately, everyone can hear Guy Pearce channeling Sean Penn in 'The Tree of Life.'"
    },
    {
      "text": "Much like Rutger Hauer's turn as a replicant in Scott's Blade Runner, Fassbender's performance may launch Prometheus into the cult stratosphere."
    },
    {
      "text": "I'll say this much for it -- it's not boring."
    },
    {
      "text": "Ridley Scott succeeds in reluming this Promethean heat."
    },
    {
      "text": "If you name your movie after the titan in Greek mythology who stole fire from the Gods and shared it with mankind, you'd better cast a lot of light. Prometheus leaves us in the dark."
    },
    {
      "text": "Religious neurotics will find plenty of blasphemous ideas to complain about, and yet the question of spiritual belief - the elevation of faith beyond reason - finds substantial support in Prometheus too. Take your pick."
    },
    {
      "text": "The sheer ambition at work throughout Prometheus makes the occasional scripting hiccup a forgivable flaw."
    },
    {
      "text": "I was very disappointed. I think it even got to the point of being quite silly."
    },
    {
      "text": "Ridley Scott means to bring wonder and horror back to summertime spectacle, and Prometheus mostly succeeds in that regard. (Mostly.)"
    },
    {
      "text": "Prometheus, featuring sumptuous 3-D landscapes and a new Ripley-like protagonist embodied by Noomi Rapace, is an intelligent summer blockbuster."
    },
    {
      "text": "The suspense and tension keeps you on the edge of your seat. Everyone will come away with their own individualized impressions from experiencing this film. Some may be frustrated by the lack of profound definitive answers and the ambiguity that you're..."
    },
    {
      "text": "Where the goal of Alien was to scare the bejesus out of you; Prometheus boasts loftier, 2001-esq ambitions along with trying to creep you right out of your seat."
    },
    {
      "text": "I don't mind that Prometheus raises big questions without ultimately answering them...I do mind that [it] has virtually nothing interesting, insightful or thoughtful to say about them."
    },
    {
      "text": "There is no tension. Nothing to get you chewing your nails. You know going in very few characters are coming out. The only suspense is wondering if there will be a part two."
    },
    {
      "text": "The \"prequel/not prequel\" BS is just a way for Lindelof to disguise the fact he either has no idea what he's doing, or no intention of answering the questions he's posed."
    },
    {
      "text": "While the old Scott would have cooked up an ending worthy of his material, the new Scott at least has delivered three-fourths of a great movie."
    },
    {
      "text": "It's not a monster movie in the same sense as the original. As the title suggests, the story is more concerned about the right to play God, and the Frankenstein like result of doing same."
    },
    {
      "text": "The fact that Prometheus begins with such confidence and brio makes it all the more disappointing when it becomes clear that Lindelof and Scott haven't thought the movie through."
    },
    {
      "text": "Contains the most electrifying body-horror shock scene in recent memory. But the discursive narrative leeches energy from the film, and it only intermittently approaches this level of graphic power."
    },
    {
      "text": "Even though Scott visually dazzles us, the plot is a muddle. And light years away from the DNA of Scott's prior sci-fi films -- neither the thrill of Alien, nor the brilliance of Blade Runner."
    },
    {
      "text": "\"Prometheus\" has the integrity of a serious and sincere attempt, but ultimately it won't please anybody."
    },
    {
      "text": "\"Prometheus\" may go overboard on the existential inquiry, but it's still an epic ride."
    },
    {
      "text": "I appreciate a good scare and a good story. Unfortunately, not much of either is present in this script."
    },
    {
      "text": "One aspect of the film that can't be denied are its visual accomplishments."
    },
    {
      "text": "An infuriating example of a film that holds huge potential and borders on greatness, but in falling just short of that mark feels little more than mediocre."
    },
    {
      "text": "Recycled Ridley Scott is still better than most of the garbage coming out today."
    },
    {
      "text": "What we have here is less a bad film than a genuinely maddening one, which has sequences of tremendous skill and moments of keen promise. But it's such a mess."
    },
    {
      "text": "For all of the things that are familiar and give you an immediate understanding as to what story you're watching as it unfolds, there's plenty to drink in."
    },
    {
      "text": "You don't always get what you think you want, but what you wind up with is still immensely satisfying."
    },
    {
      "text": "Of all the revelations in Ridley Scott's Prometheus, perhaps the most astounding is that Scott doesn't understand his own work."
    },
    {
      "text": "The kind of movie that has you talking about it and dissecting it long after the credits roll."
    },
    {
      "text": "'Prometheus' is not so much a prequel to Ridley Scott's 'Alien' as it is a remake. Fortunately, Scott remembers what made his unsettling 1979 classic work."
    },
    {
      "text": "While Prometheus meets everything required of it to reap rich box office returns, I found it less complex and intellectually stimulating than the promotional clips and videos suggested."
    },
    {
      "text": "With its creepy caves and yawning space, \"Prometheus\" is on one level a somber dialogue between man the aspirant and man the mortal."
    },
    {
      "text": "\"Prometheus\" is genuinely epic."
    },
    {
      "text": "Visually impressive and featuring one or two breakout performances, this anticlimactic exercise too often plays as though it has been cobbled together from archetypes, imagery and tropes from countless other movies."
    },
    {
      "text": "For a movie about something as monumental and controversial as the origins of life, Prometheus intentionally is a muted, very unemotional movie."
    },
    {
      "text": "The movie works despite its collection of characters that you sort of want to die."
    },
    {
      "text": "It's a welcome return of a franchise that had been experiencing a steady decline in artistic and box office returns. Just don't go in expecting the quality or total experience of the first two films. (Full Content Review for Parents also available)"
    },
    {
      "text": "It's not Alien, but very, very few films are. It's exciting, extremely well made and mysterious. It's also, at times, very confusing, difficult to follow, and, bizarrely for a Scott film, has a couple of seriously clunky moments."
    },
    {
      "text": "The art direction updates the cold, sinister look of Alien  perfectly and the cinematography is beautiful, but actors sometimes have to deliver dialogue that's pretty clunky and obvious."
    },
    {
      "text": "This is not a gamechanger. It's a standard Sci-Fi thriller that's done well. I was entertained, but probably would have liked it even more if the hype wasn't so out of control."
    },
    {
      "text": "What would you ask your maker if you had the chance? Has humanity earned the right to live? Prometheus' first 40 minutes are a banquet of juicy themes, speculations and inquiries that are ultimately left to rot on the table."
    },
    {
      "text": "Scott never manages to reach that next gear to really make it special. It's competent, but you likely won't feel as if you've just witnessed a modern-day classic by the time the credits roll."
    },
    {
      "text": "While I wish I liked this movie a lot more, it simply has too many interesting assets to dismiss outright."
    },
    {
      "text": "Anybody trying to tell you this is a bad movie is out of their mind...I say this lovingly."
    },
    {
      "text": "A thigh-clenchingly frightening science-fiction epic as well as a ruminative, soul-baring existential study that's not afraid to ask the tough questions."
    },
    {
      "text": "Prometheus, as absolutely gorgeous as it is to look at, doesn't quite live up to the hype."
    },
    {
      "text": "Hopefully, if Scott's previous ventures into the future are any indication, Prometheus will get better with repeat viewings."
    },
    {
      "text": "Make no mistake, it takes a lot of money, energy, and anticipation to make a movie this bad."
    },
    {
      "text": "Prometheus is more interested in piling on big questions than in answering them. It's deep without being particularly smart, although the dazzling design and special effects keep you from noticing that basic flaw until at least an hour in."
    },
    {
      "text": "Striking CGI, inept narrative."
    },
    {
      "text": "When it comes to technical wizardry and sheer visual spectacle, Prometheus unequivocally delivers."
    },
    {
      "text": "If you have fond, 33-year-old memories of averting your young eyes from a propulsive parasite critter, Prometheus might just be your kind of return trip."
    },
    {
      "text": "Maybe Prometheus is deep, after all, with Weyland Corporation standing in for 20th Century Fox in an allegory for Scott's artistic aspirations: funding and undermining his ambitions at the same time."
    },
    {
      "text": "What resonates in Scott's graceful, grownup, pristine film is its majestic mind."
    },
    {
      "text": "This tale of an interstellar search asks cosmic questions about the meaning of life, but comes up with lame answers in a script that screams attention-deficit disorder."
    },
    {
      "text": "As a thriller, it's muddled, and as a Big Ideas movie, it seems to trip over its own double helix."
    },
    {
      "text": "\"Prometheus\" is breezy and comely and sufficiently clever to mitigate most qualms, and Fassbender, especially, is wonderful."
    },
    {
      "text": "The ending isn't squishy scary or deeply satisfying. Bummer. Otherwise, Prometheus kicks ass so hard and often that it's impossible not to be thrilled by it."
    },
    {
      "text": "Dazzling sort-of prequel to Ridley Scott's landmark 1979 sci-fi chiller Alien delivers both remarkable visuals and truly horrific set-pieces."
    },
    {
      "text": "If Scott could somehow have spliced the DNA of the first movie with that of the Kubrickian masterpiece that he just can't shake, then he'd have an Alien that was truly strange."
    },
    {
      "text": "One of these stories has been shoehorned into the other, and the result is an incongruous blend of thoughtful science fiction and a grotesque horror sideshow."
    },
    {
      "text": "Unlike any of the sequels between it and the original, Prometheus is a horror movie first and foremost, gnawing at subconscious terrors even as your conscious mind attempts to bat it away."
    },
    {
      "text": "Master director Ridley Scott creates a riveting ride while Michael Fassbender steals the show."
    },
    {
      "text": "Narratively, it's a mess. There's a through-line Darwinism vs. creationism thing going on that ping-pongs big religious and philosophical ideas, but whiffs the return."
    },
    {
      "text": "I saw Prometheus without my trusty guide-wife next to me to describe the creepy stuff yet watched every second of the movie. And not once did I jump out of my skin."
    },
    {
      "text": "Even though the cliches are overly abundant, it's gratifying to see Ridley Scott once more serving up aliens in style."
    },
    {
      "text": "If you keep your expectations reasonable, it's suspenseful and fun."
    },
    {
      "text": "A return to frozen fear of what may or may not around the corner, amid big-ish thoughts about where we came from."
    },
    {
      "text": "On balance, the experience of watching \"Prometheus\" makes up for the movie's flaws, but you'll still spend a lot of time being frustrated."
    },
    {
      "text": "Making up for the expected nature of some of the film's plot twists is Arthur Max's spooky, H.R. Giger-influenced production design, Dariusz Wolski's fluid cinematography, as well as Scott's moment-to-moment storytelling skill."
    },
    {
      "text": "A coolly elegant, tauntly intense contribution to the 'Alien' universe...beautifully crafted and visually striking."
    },
    {
      "text": "\"Epic\" comes in many forms. Prometheus sports all of them."
    },
    {
      "text": "With Prometheus, Ridley Scott follows too far behind on the path that he himself paved the way for all those years ago."
    },
    {
      "text": "A combo science-fiction horror film and quest drama exploring the origin of our species."
    },
    {
      "text": "Visually stunning, wildly ambitious, but ultimately as emotionally involving as the icy core of a dead star."
    },
    {
      "text": "The plot of this Alien prequel was a carefully guarded secret -- so carefully guarded, in fact, that not even the movie reveals it."
    },
    {
      "text": "The good news is that Prometheus is the third best Alien movie after Ridley Scott's original, and James Cameron's Aliens. The bad news is that when you're better than Alien 3 and Alien: Resurrection, that's not much of a compliment."
    },
    {
      "text": "God (or Alien) knows this movie is derivative. But as someone else once said, originality isn't everything."
    },
    {
      "text": "Prometheus is a prequel that works as a stand-alone but offers added benefits to those familiar with the Alien series."
    },
    {
      "text": "Stripped to its visceral essentials, the franchise is meant to frighten us and gross us out, and Prometheus rises to that modest challenge."
    },
    {
      "text": "Aping Stanley Kubrick's \"2001: A Space Odyssey,\" Scott and his screenwriters have designed this towering puzzle to provoke debate, with liberal allusions to gender, race and religion."
    },
    {
      "text": "Mr. Scott's sense of visual scale, which has often produced hectic, hectoring grandiosity (are you not entertained?), achieves, especially in the first hour, something like genuine grandeur."
    },
    {
      "text": "If you have a dozen engaged and insightful friends who are willing to share a beer after seeing 'Prometheus,' you can talk yourself into thinking it's a fabulous movie."
    },
    {
      "text": "In space, no one can hear you having a good time."
    },
    {
      "text": "Scott's reboot of the franchise is a technically glorious thing...and Noomi Rapace gives a thoroughly engaging performance as a character quite different from Ripley, but you'll probably enjoy the film a lot more if you've never seen \"Alien.\""
    },
    {
      "text": "This is the kind of bold filmmaking destined to stand the test of time when memories of most of its competitors have long faded away."
    },
    {
      "text": "Not only does the film do enough right to warrant a recommendation, even where it goes wrong is in ways that can stimulate thought and provoke interesting conversation."
    },
    {
      "text": "Fassbender's David is the film's centerpiece. Rapace plays the Hollywood girlfriend role instead of a steely protagonist on a messianic journey. Theron always commits fully to every character she plays."
    },
    {
      "text": "Our genre pictures are being burdened by a love of lore."
    },
    {
      "text": "So beautiful it belongs on the Maxim Hot 100."
    },
    {
      "text": "The not-a-prequel tactic is a failed smoke screen since its strength is the connection to the beginning of a universe. Eliminate it and you are left with just another muddled creature feature with ideas more grandiose than the writers exploring them."
    },
    {
      "text": "While its vast sets and production values are simply stunning, \"Prometheus\" ultimately disappoints."
    },
    {
      "text": "Though Prometheus follows Alien's story beats, it's a looser and less satisfying story, more intellectual than visceral, and not fully satisfying on either level. But in part, that's because it's trying to do so much more."
    },
    {
      "text": "Ridley Scott's \"Prometheus\" is a magnificent science-fiction film, all the more intriguing because it raises questions about the origin of human life and doesn't have the answers."
    },
    {
      "text": "Questions go unanswered, shocking occurences go unquestioned, and supposedly intelligent people do stupid things."
    },
    {
      "text": "It isn't a profound sci-fi treatise on humanity's place in the universe, but it is an exciting, visually stunning and often exquisitely suspenseful adventure story."
    },
    {
      "text": "Watching \"Prometheus\" is like opening a deluxe gift box from Tiffany's to find a mug from the dollar store."
    },
    {
      "text": "\"Prometheus\" damn near lives up to the unsustainable hype, at least at the level of cinematography, production design, special effects and pure wow factor."
    },
    {
      "text": "Has enough tension and jolts to the system to make it well worth seeing."
    },
    {
      "text": "The list of the film's bad choices is as long as it was short in the original."
    },
    {
      "text": "After an encouraging start the film too hastily descends into a contrived jumble of fiction, burdened by undertows of faith, mankind's origins and what it means to be human."
    },
    {
      "text": "It's an impressive accomplishment, but one that is destined to leave some with un-met expectations."
    },
    {
      "text": "Prometheus elicits Alien memories for viewers who have them, but works on its own, too, as a model of a contemporary (and, as is the contempo mode, long-winded) sci-fi horror pic."
    },
    {
      "text": "\"Prometheus\" repeats many past glories, and its plot is squishy nonsense. But its grand sets and intricate effects are dazzling, and in at least one scene, Scott almost manages to top himself."
    },
    {
      "text": "You're more likely to enjoy the film if you go in thinking less about \"Alien\" and more about Scott, with his emphasis on images, tone and atmosphere over -- sometimes at the expense of -- plot and story."
    },
    {
      "text": "Why are we here? What is our purpose? Is there a God? When does this movie get good?"
    },
    {
      "text": "A fantastic film that really should be accepted on its own merits as science fiction filmmaking at its finest."
    },
    {
      "text": "Scott briskly blends the high-minded stuff with impressive boo-and-goo sequences, ratcheting tension in tight spots and dark caverns. One set piece should become a new milestone in horror, as John Hurt's tummy trouble did in Alien."
    },
    {
      "text": "Like \"Alien,\" the new movie derives its appeal not only from stunning, otherworldly imagery but also from the central performances tasked with reacting to it."
    },
    {
      "text": "This is a remarkably scary and eye-popping headrush of a movie, an experience that offers a maximum adrenaline boost at the same time as it engages your intelligence. Don't miss it."
    },
    {
      "text": "Prometheus stirs the suspicion that the creators are no wiser than the audience about what all the scattergun clues and symbols actually add up to."
    },
    {
      "text": "The one thing that stands out for me in Prometheus is the suggestion that mankind's origins are not benign: we are made by violent, destructive forces ... in their own image"
    },
    {
      "text": "The astonishing creature designs of H.R. Giger are the stars of Ridley Scott's highly awaited sci-fi thriller that spews horror when you least expect it"
    },
    {
      "text": "The ideas it unlocks ultimately are more intriguing than the movie itself. In other words, it's a movie that's more fun to think about afterward than it is to sit through."
    },
    {
      "text": "There's nothing here to match the visceral shock in Alien of seeing John Hurt's chest explode but Scott does deliver a grisly standout scene that exploits the series' recurring themes of body horror and fear of birth"
    },
    {
      "text": "Prometheus seems to delusionally maintain that its modest thrills are being enlivened by deeper concerns."
    },
    {
      "text": "With this overreaching Prometheus, Scott seems a bit like David carefully arranging his hair in imitation of O'Toole's Lawrence. He can still mimic the appearance of an epic, noble, important movie -- but the appearance is all."
    },
    {
      "text": "Big and overcomplicated is so often mistaken for better, when really it's only...big and overcomplicated."
    },
    {
      "text": "There's no denying that Prometheus will make for a perfectly entertaining night at the movies -- but we were promised so much more."
    },
    {
      "text": "For all the noise and thunder early on, Prometheus just runs out of steam, but what a ride until it does."
    },
    {
      "text": "It's aiming to be both an epic space thriller and a spiritual treatise, and watching it almost accomplish both makes it all the more frustrating."
    },
    {
      "text": "...a science fiction film that will leave fans arguing, with some dismissing it out of hand and others declaring it a modern masterpiece."
    },
    {
      "text": "In space no one can hear PROMETHEUS disappoint you."
    },
    {
      "text": "I think the thing I like most about this film is that it will spark many, many interesting conversations. So many people will have so many takes on the film and I am really looking forward to joining the debates."
    },
    {
      "text": "[W]ant[s] to be... ambitious SF drama. [But] somewhere along the way, the provocative speculation and the seriocomic tragedy got lost. Oh, and the characters got forgotten, too. Plus there's precious little authentic drama."
    },
    {
      "text": "I wish more films had this level of ambition, along with the artistry to execute it."
    },
    {
      "text": "The paranoia becomes palpable, and a lot of its impact comes from how dramatic and dazzlingly seamless the special effects are."
    },
    {
      "text": "Alien DNA plays a big role in Prometheus, but it's the DNA of Alien that this new movie just can't quite live up to. The less you think of this new film as part of that legendary series, the more you'll enjoy it."
    },
    {
      "text": "The film is utterly gorgeous to look at. Every exterior and interior shot looks like a painting, rendered in thick, velvety strokes. The CGI is entirely seamless, and, indeed, minimal considering the subject matter."
    },
    {
      "text": "After delivering a brilliant first half, its ambition seems to exceed its execution, but despite becoming muddled, it remains a visually stunning and wild cinematic ride."
    },
    {
      "text": "A more elegant and thoughtful sci-fi film than we've gotten in many a year. The 3D is truly immersive, the scares well-earned, and the performances top-notch."
    },
    {
      "text": "If you were hoping for deep, dark visuals by Scott in 3D...or a goth take on 2001 and 2010 combined, this delivers. If you wanted a more James Cameron-style action movie, it doesn't."
    },
    {
      "text": "The film doesn't finish its meal before moving onto dessert; abandoning a satisfying conclusion in favour of starting work on the inevitable sequel. Naughty Hollywood! Eat your greens!"
    },
    {
      "text": "It's great to see Scott back in the realm of sci-fi but it's a superficial attempt to brand something new with the familiar elements of Alien"
    },
    {
      "text": "Prometheus is a strongly acted, superbly designed movie, an exciting and at times emetic experience. Some surprises might have been anticipated with a little thought, others not."
    },
    {
      "text": "Prometheus is a visual triumph and if nothing else it deserves credit for the moments when it does evoke the early scenes in Alien with the same degree of sinister wonder."
    },
    {
      "text": "Prometheus is atmospherically dazzling in a way that makes your eyeballs want to have a cigarette, zip up their pants and go out for breakfast afterwards."
    },
    {
      "text": "It's all a bit woolly-minded. Shock horror indeed."
    },
    {
      "text": "With a stuttering story, some elements of the narrative struggle to hit home but Prometheus is still generally a success."
    },
    {
      "text": "Prometheus is anticlimactic and terribly uneven: superbly staged scenes give way to cliches and seemingly reasonable characters end up doing things that defy any kind of believable motivation."
    },
    {
      "text": "Beneath the hype and promises, however, it's almost a letdown that the actual film is merely very good: a better-than-average 3D big-budget space tale."
    },
    {
      "text": "In space, no one can hear your disappointment."
    },
    {
      "text": "The fact that the movie was able to recycle the plot of Star Trek V will likely never get the level of praise it deserves."
    },
    {
      "text": "'Prometheus' is a visually striking sci-fi epic that delivers an incredible sense of awe mixed with breathtaking visual effects."
    },
    {
      "text": "The deep, dark shadows that played such a crucial role in the shot-on-film Alien and its sequels are gone in Prometheus."
    },
    {
      "text": "Prometheus is proto-product placement film - where the product is Alien. The philosophical sojourn, the stirring performances by Fassbender and Rapace, and the sublime aesthetic are severely inhibited by the nods to the Alien mythos."
    },
    {
      "text": "In the end, the Prometheus plot is slightly bonkers, but forgivably so, because the characters are so well drawn. And there are enough slime bursts to make Ghostbusters look timid."
    },
    {
      "text": "The well-paced and perfectly structured plot are matched by solid performances and powerfully arresting visuals."
    },
    {
      "text": "There are some intriguing ideas embedded within the script - Darwinism vs Creationism, the recklessness of scientific endeavour - but inevitably, Scott's film reduces to a big budget game of cat and mouse."
    },
    {
      "text": "Prometheus isn't a classic, unlike Alien and Blade Runner, but there are enough quality ingredients to make me hope Scott gets the money to make the sequel."
    },
    {
      "text": "Prometheus suffers from a near-terminal inability to decide what story it wants to tell."
    },
    {
      "text": "Ridley coaxes out some memorable performances from Rapace and Fassbender, and keeps a consistent sense of man's curiosity at the bigger evolution picture... The rest is open to interpretation."
    },
    {
      "text": "\"The keen fan,\" Scott has said, \"will recognise strands of Alien's DNA.\" The keen fan will be regularly concussed by these strands."
    },
    {
      "text": "The nonsense logic rather undermines the portentous tone of the whole thing but luckily, after a rather laboured first hour, the picture gets on with the business of scaring us."
    },
    {
      "text": "While it lacks Alien's ferocious simplicity and focus, Scott's determination to see his often loopy ideas through gives his film a single-minded vigour rarely found in pictures of this scale."
    },
    {
      "text": "An awe-inspiring, mind-gouging, eye-blazing spectacle of high-pitched disappointment."
    },
    {
      "text": "An enjoyable, if flawed sci-fi thriller that's worth seeing for Fassbot and Noomi Rapace."
    },
    {
      "text": "Even if the plot is full of holes, it's utterly mesmerising."
    },
    {
      "text": "Scott's Alien prequel falls short in philosophical ambitions and characterization, but in visual imagery and mood, it's a thrilling, haunting, awesome spectacle likley to become a cult phenom."
    },
    {
      "text": "Scott's most well-rounded and accomplished feature since his classic Blade Runner thirty years ago. Seek it out for yourself and again remember that imaginative, daring sci-fi is out there for the finding."
    },
    {
      "text": "[Fassbender's] performance elevates the film: a multi-faceted reboot of the requisite android."
    },
    {
      "text": "Not as frightening as Alien, not as thrilling as Aliens, but a 3D sci-fi blockbuster that's easily the saga's most spectacular entry."
    },
    {
      "text": "The best film of the summer so far."
    },
    {
      "text": "Prometheus is a great ride - best taken without too much foreknowledge, by the way."
    },
    {
      "text": "Not only does Prometheus herald the rebirth of Alien, it breaths life back into intelligent sci-fi."
    },
    {
      "text": "Remains earthbound in narrative terms, forever hinting at the existence of a higher intelligence without evincing much of its own."
    },
    {
      "text": "It's something to gorge on hungrily all the same: majestic to look at in every way, and wild enough that many of the opening-night crowd -- this viewer included -- will be right back for seconds."
    },
    {
      "text": "Ridley Scott has counter-evolved his 1979 classic Alien into something more grandiose, more elaborate - but less interesting."
    },
    {
      "text": "Should thrill, challenge and provoke audiences ready for [Scott's] signature brand of intelligent and visceral film-making."
    },
    {
      "text": "It does supply enough visual spectacle, tense action and sticky, slithery monster attacks to hit the spot with thrill-seeking audiences worldwide."
    }
  ],
  "release_year": 2012,
  "duration": 123,
  "genres": [
    "Sci-Fi",
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "The discovery of a clue to mankind's origins on Earth leads a team of explorers to the darkest parts of the universe. Two brilliant young scientists lead the expedition. Shaw (Noomi Rapace) hopes that they will meet a race of benevolent, godlike beings who will in some way verify her religious beliefs, while Holloway (Logan Marshall-Green) is out to debunk any spiritual notions. However, neither the scientists nor their shipmates are prepared for the unimaginable terrors that await them.",
  "popularity": 6.8,
  "poster_url": "https://image.tmdb.org/t/p/original/m7nZCtHJyDLncBUarfM5h5mrppx.jpg"
}