{
  "movie_name": "Psycho",
  "movie_id": "american_psycho",
  "total_reviews": 239,
  "reviews": [
    {
      "text": "The truly dangerous thing about the film of \"American Psycho\" isn't its weary moral, but that it insists on being a period piece, setting all of its horrid behavior and loathsome character so firmly, so safely, so arrogantly back in Ellis' own late '80s."
    },
    {
      "text": "A smug, monotonal, buttoned-down rendering of the one-gag novel by Bret Easton Ellis, it wastes the acting talent of Christian Bale and gives post-modern irony a bad name."
    },
    {
      "text": "Although the film looks sharp, the emotional comfort zone Harron allows the audience simply saps it of any bite or value."
    },
    {
      "text": "Bale so inhabits the character that we seem to be inside his increasingly deranged mind."
    },
    {
      "text": "Harron's methodical direction echoes Bateman's matter-of-fact take on murder."
    },
    {
      "text": "Bales gives a performance drained of personality and humanity, sometimes exhibiting a glint of affected charm, sometimes even saying the right thing."
    },
    {
      "text": "Perversely entertaining but not without glitches, \"American Psycho\" is crafted with lavish mathematical precision."
    },
    {
      "text": "By distilling the novel to its satirical essence, Harron turns it into a withering condemnation of a culture where greed is a virtue, a culture that you don't have to feel guilty for laughing at."
    },
    {
      "text": "It isn't as clever as Ellis' book but the movie is much funnier."
    },
    {
      "text": "America Psycho is slick and narcotic in a way that suits its time and mental placing."
    },
    {
      "text": "Bale's central performance as a Wall Street financier and mass murderer is impressive."
    },
    {
      "text": "Bale's performance is a tour de force."
    },
    {
      "text": "Only the ending breaks the mood of a poised and assured piece."
    },
    {
      "text": "Bale delivers an impossible attractive exterior surrounding an empty void, but gives us enough grimly amusing moments to keep us hanging around for the next murder."
    },
    {
      "text": "American Psycho contorts itself into a pretentious muddle."
    },
    {
      "text": "Ultimately, the film becomes what is mocks: an easier, more pleasurable experience. But not necessarily a meaningful one."
    },
    {
      "text": "Harron layers a stylized gloss on the proceedings that captures the culture of a stylized -- and superficial -- decade."
    },
    {
      "text": "The result is a film as cold and detached as its main character, and almost as empty as Ellis' novel."
    },
    {
      "text": "In satirizing a goofy, greedy era, director Mary Harron beats the controversial novel at its own game."
    },
    {
      "text": "Harron has boiled down the bloody, hard-to-finish gore-fest of a novel into an often unnervingly humorous story."
    },
    {
      "text": "Bale is perfect for the role."
    },
    {
      "text": "Bale does a decent job of creating a soulless cultural scavenger, but the performance is basically a one-note affair."
    },
    {
      "text": "Harron does many things right in this film... the movie she made is the definitive realization of Ellis' moral fable."
    },
    {
      "text": "The Bret Easton Ellis novel was widely despised, but director Mary Harron has culled the redundancies, spin-polished the metaphors and left us with one funny, provocative movie."
    },
    {
      "text": "American Psycho is a shallow movie, as two-dimensional as its hero."
    },
    {
      "text": "The movie's highlights are Bateman blabbing about his own shallowness... but the more Harron mocks him, the less formidable he becomes."
    },
    {
      "text": "Harron... has made an extremely glossy, shallow movie about an extremely glossy, shallow man."
    },
    {
      "text": "I hated \"American Psycho,\" even as I admired its acting and technical virtuosity."
    },
    {
      "text": "The movie is dotted with fascinating performances."
    },
    {
      "text": "Bret Ellis' book was merely a blueprint. Mary Harron's film is the full-blown monument."
    },
    {
      "text": "\"American Psycho\" is such a good-looking movie that it negates any sense the viewer should have about the inherent emptiness of judging people by their looks, or by what after shave they wear, or what car they drive."
    },
    {
      "text": "Intelligent and stimulating, Mary Harron's feature provokes countless questions."
    },
    {
      "text": "It's all clever stuff -- but in an over-familiar way."
    },
    {
      "text": "As a satire of the '80s... the film does the book justice."
    },
    {
      "text": "Bale is an actor without much personality in a role demanding even less."
    },
    {
      "text": "\"American Psycho\" emerges as a faintly funny echo of a nearly forgotten time."
    },
    {
      "text": "Christian Bale is flat-out terrific... it's a shame the movie's not up to his level."
    },
    {
      "text": "It's neither good social satire nor a decent horror story."
    },
    {
      "text": "Harron deftly manages to highlight much of the book's stinging social commentary and its savage political point of view."
    },
    {
      "text": "It's bold and often effective, but the humor only propels the movie so far."
    },
    {
      "text": "Harron's final problem is an ending that is beyond vague. If her sense of satire hasn't been sharp enough until then, it loses all focus here."
    },
    {
      "text": "Harron transforms a badly constructed misogynist fantasy into inspired satire."
    },
    {
      "text": "Christian Bale is pitch-perfect as the psychopathic Patrick Bateman."
    },
    {
      "text": "A very fine performance by Christian Bale distinguishes this vicious satire on Reagan-era greed and yuppiedom, in a visually rich film which is often surprisingly funny, in a Kafka-ish kind of way."
    },
    {
      "text": "Christian Bale plays Bateman excellently, pitching his performance at just the level of surreality that the character requires. For Harron, this film is a marked leap... it's really an excellent adaptation."
    },
    {
      "text": "There's only so much an actor can do to personify an elaborately arch and ugly notion of evil. The performance wears thin as the knives, nail gun and chain saw come out and the bodies and limbs pile up."
    },
    {
      "text": "This adaptation of Bret Easton Ellis’s novel about a serial-killing New York banker is almost 20 years old and has aged rather well."
    },
    {
      "text": "Boldly adapting the notoriously violent novel by Bret Easton Ellis by turning it into a savagely funny satire on corporate sexism and 1980s materialism, the writer-director Mary Harron delivers more black comedy and less graphic gore."
    },
    {
      "text": "American Psycho inevitably lacks some of the book’s savage brilliance, but Bateman’s numb dissertations on terrible Eighties pop music, Manhattan restaurant etiquette and male grooming products remain blisteringly funny."
    },
    {
      "text": "Bret Easton Ellis's novel is a manic blend of incisive satire and repellent violence. Harron and screenwriter Guinevere Turner reduce it to a standard-issue slasher movie."
    },
    {
      "text": "If you're tired of formula flicks and want to see something original, it's worth the bother."
    },
    {
      "text": "It's such a strong movie. Bale is impeccable as the lead, and while some of it may seem like over-the-top hamminess repeat viewings unveil more and more of what's going on."
    },
    {
      "text": "Bale is spot-on as the movie’s antihero, funny in his narcissism and terrifying in his psychopathic rages."
    },
    {
      "text": "While the frames are chilly and distilled, the content is not, and at moments the tone falters."
    },
    {
      "text": "Bale is sensational."
    },
    {
      "text": "American Psycho is effective as both a horror film and cultural satire."
    },
    {
      "text": "This is a clever, efficiently nasty film that hooks into the mind."
    },
    {
      "text": "Though many look at Bateman’s character as a caricature of the ‘90s stereotypical male, it’s not far off from how some men still act today... Mary Harron directed this film in a way that perfectly captures what many women encounter on a daily basis."
    },
    {
      "text": "Mary Harron’s screen adaptation of Bret Easton Ellis’ 1991 novel, American Psycho starts off well enough but it soon loses its lustre and becomes rather irksome."
    },
    {
      "text": "American Psycho is watchable and at times, admirable. Considering Hollywood's penchant for bad serial killer dramas, this effort is a numbing but welcome change of pace."
    },
    {
      "text": "As Bateman, Bale exudes just the right kind of anti-charisma."
    },
    {
      "text": "Mary Harron directs the piece with a sharp and very particular view to framing it all as quite ludicrous."
    },
    {
      "text": "Whilst it is a good movie, with some great black comedy splattered throughout, without a cohesive narrative and with its open ending, it feels incomplete somehow, as if Harron ran out of ideas from the novel."
    },
    {
      "text": "Director Mary Harron and co-writer Guinevere Turner... transformed the novel and, along the way, vastly improved it."
    },
    {
      "text": "Harron wields a cold camera through it all, an approach that perfectly matches the material and her recreation of uptown New York circa 1987. Everything about her blacker-than-black satire goes well at first, but then it keeps going and going."
    },
    {
      "text": "It is unlikely that this film will become any kind of cult item at all, given its lack of visual interest, and the violence is really only suggested in its bloody aftermath, rather than shown, thus frustrating the lowbrow gore geeks."
    },
    {
      "text": "Christian Bale’s central performance is outstanding."
    },
    {
      "text": "The final few scenes kind of \"go off the rails\" which, for me is what downgrades this movie from a solid A content-wise to a B instead."
    },
    {
      "text": "Using Bale’s charismatic and terrifying performance Harron crafts this Ellis adaptation into 102 minutes of pure madness."
    },
    {
      "text": "By wisely keeping almost all the gruesome acts off-screen or just out-of-sight, the horror works much better"
    },
    {
      "text": "Director Mary Harron impressively mines the dark social comedy from this scathing satire of the 1980s."
    },
    {
      "text": "Harron and Turner's screenplay adaptation is razor sharp."
    },
    {
      "text": "It’s engaging, very funny and the plot moves along at a pace."
    },
    {
      "text": "Christian Bale is brilliant as Patrick Bateman."
    },
    {
      "text": "Mary Harron's American Psycho is still a masterclass in suspense and faithful adaptation, though Christian Bale's performance is still the highlight."
    },
    {
      "text": "The film’s crisp and controlled style is immediately appealing, but things become repetitive in the film’s second act. Luckily the open-ended and frenetic conclusion makes for an even more compelling examination of the film’s themes."
    },
    {
      "text": "I will not give away the ending to American Psycho, but I will say this: The last three scenes are implausible and unnecessary (and totally unrelated to the book) and the ending includes the cheapest, most manipulative trick in filmmaking."
    },
    {
      "text": "A ferociously intelligent, horribly violent and darkly funny parable of greed and violence."
    },
    {
      "text": "Christian Bale is razor sharp... as blank corporate drone Patrick Bateman... a preening tiger in designer suits whose speaking voice is part salesman, part self-help guru, and completely artificial"
    },
    {
      "text": "I couldn't connect with this movie at all. In a way, the story kind of goes nowhere. But at the same time, Christian Bale goes for broke and you can't help but appreciate it."
    },
    {
      "text": "Despite an incredible performance by Christian Bale, this movie was a struggle to get through given that none of the characters had any redeeming qualities."
    },
    {
      "text": "Expertly made and does what it's trying to do very well, but I just can't fully connect with this one."
    },
    {
      "text": "American Psycho directly addresses the horror of capitalism, in which other people are just props for the fantasies of men who get wealthier by the second."
    },
    {
      "text": "The idea that this is all a fantasy inside Bateman's head is brilliantly realised in his growing realisation that he's been able to get away with all of this in plain sight."
    },
    {
      "text": "There are times where this film is satire at its best. It's also horrific, violent and stomach-turning. Christian Bale is incredible in this movie and he commits to making Bateman completely deplorable."
    },
    {
      "text": "Graced with a smart, pathos-laden meditation on male competition and the blood-drawing ferocity of a money-centered culture, along with screenwriter Guinevere Turner, Harron does a transformative voodoo on an often repugnant source."
    },
    {
      "text": "American Psycho is one of the greatest horror films of all time; with its disturbingly dark comedy, psychotic breakdowns of society and an unnerving look at the obsessive thoughts of a serial killer."
    },
    {
      "text": "\"American Psycho\" might seem grossly exaggerated (it is satire), but it has to be in order to prove its point."
    },
    {
      "text": "Like all great films, \"American Psycho\" is one you can discover something new in regardless of how many times you've seen it."
    },
    {
      "text": "A bloody, gruesome black comedy that's not for kids."
    },
    {
      "text": "Christian Bale is perfectly cast as Patrick Bateman."
    },
    {
      "text": "The slick satire cleverly equates materialism, narcissism, misogyny, and classism with homicide, but you may laugh so loud at the protagonist that you won't be able to hear yourself laughing with him."
    },
    {
      "text": "It's hard to summon up enthusiasm for a performance so rooted in bloody banality. I mean, as Patrick, Bale's most emotionally pressing dilemma is: Chainsaw or butcher knife?"
    },
    {
      "text": "American Psycho is nearly perfect for what it is, but before we go on, we should ask what that actually amounts to. Can something with so rigid a thesis be a real work of art?"
    },
    {
      "text": "It needs to be seen and appreciated, like a serpent in a glass cage."
    },
    {
      "text": "The film is well produced, but to what effect? This “American Psycho” is an exercise in vain filmmaking, and Harron and her writers fail to convince us of what motivated them to make the picture in the first place."
    },
    {
      "text": "It's often very funny."
    },
    {
      "text": "Mary Harron asks what's more unnerving - exaggerated, imagined violence or vacuous realities some wish to be real, psychosis as much in the construct as the character. Thus, \"Psycho's\" savagery goes beyond a simple screed against 1980s excess and greed."
    },
    {
      "text": "Christian Bale personifies the character perfectly, and is the strongest part of the film."
    },
    {
      "text": "As a black-comic portrait of a Reagan-era corporate bloodsucker... it hits the jugular."
    },
    {
      "text": "Unfortunately, as Bateman unravels, so does the film, dissolving in a puddle of loose ends; still, Harron’ s incisive eye and Bale’ s bravura performance carry the day."
    },
    {
      "text": "American Pyscho is one of those films that makes you laugh uncomfortably throughout and you just walk away feeling disgusted. The flick is definitely an underrated masterpiece."
    },
    {
      "text": "Harron's Psycho reps an impressive reclaiming of dubious material."
    },
    {
      "text": "Conceptually, this savage cartoon ends up as trapped in surfaces as its shallow antihero: it's all dressed up with nowhere to go."
    },
    {
      "text": "One can picture Kubrick handling this material with a similar elegant malevolence."
    },
    {
      "text": "Unfortunately, the film has the feeling of a joke that you're not in on and it makes you want to read the novel to see what everyone is laughing about."
    },
    {
      "text": "The film makes wonderfully unsettling entertainment; crucially -- and gloriously -- Bale nails Bateman with a sublimely dead-eyed and deadpan performance."
    },
    {
      "text": "Production designer Gideon Ponte gives a terrific look to the film, with a hard, ultramodern design that lends sterility to Patrick's personal killing field."
    },
    {
      "text": "Clearly, Harron is sold on the Bateman-as-metaphor bit, and, like Ellis, she overconceptualizes everything."
    },
    {
      "text": "Despite a game performance from Christian Bale, American Psycho never quite achieves lift-off."
    },
    {
      "text": "This whole movie is hard to watch - it's very graphic, very violent, and very disturbing."
    },
    {
      "text": "Like the characters portrayed in the movie, \"American Psycho\" is shallow and at times downright evil."
    },
    {
      "text": "Mary Harron's adaptation of the Brett Easton Ellis novel sets out to indict a culture of narcissism, but plays its few notes early and never gets beyond slight variations."
    },
    {
      "text": "American Psycho connects strongly in the moment, and has proven memorable over time, for the vivid impressions it makes in tone as well as look, its potent blends of sound and image, its unusual if erratic points of entry into potentially stock cha"
    },
    {
      "text": "It's smart, frightening and funny."
    },
    {
      "text": "The problem, again, is the book, an insurmountable obstacle. If Harron and Turner had set out to make a real movie on these themes, they would never have started from a script like this."
    },
    {
      "text": "Pared down and resurrected as a crisply stylized three-parter, American Psycho is at once a sharp satire and an earnest study in the deadly consequences of moral vacancy, an ambiguity that played its part in the movie’s rocky road to completion."
    },
    {
      "text": "This film isn't for everyone. But those who can stomach it will find it a chilling glimpse into a serious psychological disorder."
    },
    {
      "text": "In the end, for all its craftsmanship and for all of Mr. Bale's astonishing work, American Psycho comes across as cold to the core, as if untouched by human hands."
    },
    {
      "text": "The film is directed with a lot of wit and style, and it looks absolutely gorgeous, thanks to photography by Andrzej Sekula."
    },
    {
      "text": "Less a noble failure than a very minor miracle."
    },
    {
      "text": "The myth that slasher movies promote violence against women is headed off in this adaptation of by the choice of Mary Harron to direct and co-write (with actress Guinevere Turner) a very dark and often funny script."
    },
    {
      "text": "Although playing an unbalanced character, Bale has no problem balancing horror with dark humor in this remarkable performance."
    },
    {
      "text": "It's a bold conceit, partly successful, always disturbing."
    },
    {
      "text": "When not bludgeoning a business rival with an ax, well-heeled killer Patrick Bateman bludgeons the audience with the film's messages."
    },
    {
      "text": "Really brilliant in the way it takes the viewer inside Bateman's world."
    },
    {
      "text": "For the most part Harron translates to cinema Ellis's collage of anomie and atrocity, of interior derangement and surface sterility, with dazzling wit and economy."
    },
    {
      "text": "A well-crafted yet essentially innocuous period piece."
    },
    {
      "text": "Director Mary Harron takes a theatre of the absurd approach to the controversial best-seller."
    },
    {
      "text": "Decidedly out of date."
    },
    {
      "text": "It is entertaining and often very funny, even when you hope that director Harron will next find a subject that is truly worthy of her considerable talents."
    },
    {
      "text": "Brett Easton Ellis' controversial and violent novel American Psycho is about as black as comedy gets, and Harron captures the tone and themes perfectly here, highlighting the vacuousness of 80s consumerism without pulling any punches at all."
    },
    {
      "text": "Mary Harron knows what she's doing right from the opening credit sequence."
    },
    {
      "text": "If you are offended by purposeless terrible deeds and unrepentant evil, skip it. Otherwise, it's a great movie to chat about over a nice, fluffy dessert."
    },
    {
      "text": "Bale's voice, accent, gestures and precisely choreographed movements produce a powerful vision of an urban monster, inviting the audience to examine his motives."
    },
    {
      "text": "An uneven movie that nonetheless bristles with stinging wit and exerts a perverse fascination."
    },
    {
      "text": "If all of Ellis's characters more or less stay the same, Harron's film suggests that, like the '80s, Bateman to shall pass."
    },
    {
      "text": "The best monster movie in years."
    },
    {
      "text": "Harron, thankfully, chooses to leave most of the carnage to our imaginations, but without any psychological backing for Patrick's bloody acts, they ring pretty hollow."
    },
    {
      "text": "What could have been a run-of-the-mill serial killer pic is instead a mesmerizing account of the mystery behind a murderer."
    },
    {
      "text": "Director Mary Harron has created a visually chilly but often very funny satire of American greed and conspicuous consumption."
    },
    {
      "text": "Una de las más comentadas, ingeniosas e inteligentes películas del año"
    },
    {
      "text": "A potentially sensationalistic film that has become -- for lack of a better word -- boring."
    },
    {
      "text": "It's all wickedly, gleamingly stylish fun, a kind of post-modern Grand Guignol which is driven by an extraordinary performance by Bale."
    },
    {
      "text": "Christian Bale is great as Bateman."
    },
    {
      "text": "The film's details are spot-on, its tone ludicrously ironic."
    },
    {
      "text": "Well-filmed, well-acted and certainly riveting, American Psycho nonetheless is a movie without heart about a man without heart."
    },
    {
      "text": "The book seems a case of the prurient condemning the prurient. It's cynical junk masquerading as social comment. The film is, finally, only a slicker packaging of it."
    },
    {
      "text": "Bale's cool, clinically detached freak show is fun to watch, and disturbing too."
    },
    {
      "text": "If, in Harron and Turner's screenplay, there are dark patches of genuine humor and irony, there are also detours into B-movie horror terrain that are arguably less satisfying."
    },
    {
      "text": "Director Mary Harron's adaptation of Bret Easton Ellis' 1991 novel shapes and strengthens its humor."
    },
    {
      "text": "American Psycho has all the trappings of a thoughtful film except profundity -- it's a swimming pool without a deep end."
    },
    {
      "text": "In the manner of her meticulous title character, Harron should have whittled down this would-be masterpiece by severing a few bits and pieces.  Even so, she’s a talent to be watched."
    },
    {
      "text": "American Psycho is better than its source material, but that unfortunately isn't saying much."
    },
    {
      "text": "Despite American Psycho’s high-caliber cast, museum-quality art direction and slavish attention to debauched detail, the story and its creepy characters are so generally repulsive that it's barely worth the price of attention."
    },
    {
      "text": "Patrick Bateman... becomes more clearly a poisonous symbol of the late-'80s gold-plated, amoral, poodle-eat-poodle era and place — Manhattan and Wall Street. This isn't enough to make this film the dark classic it wants to be."
    },
    {
      "text": "American Psycho vibrates between being deliriously funny and just plain delirious."
    },
    {
      "text": "Harron achieves a remarkably razored intersection of three genres: the comedy of yupster ambition, the psycho horror thriller and the glib meditation on misogyny."
    },
    {
      "text": "The best imaginable film of very difficult material."
    },
    {
      "text": "Harron and Bale have found a mirror that forces us to look at ourselves and ask tough, disturbing questions -- which is ultimately what the best satire always does."
    },
    {
      "text": "There is little here to recommend, and quite a bit to despise."
    },
    {
      "text": "A brilliant performance by Christian Bale can't quite keep this soulless movie afloat."
    },
    {
      "text": "This picture is tough to enjoy because there really isn't anyone to root for."
    },
    {
      "text": "The heartless, soulless heart and soul of AMERICAN PSYCHO is Bale's brilliant performance as Bateman."
    },
    {
      "text": "Ultimately it all feels as hollow as its subject's ostentatiously avaricious lifestyle."
    },
    {
      "text": "American Psycho is basically a succession of escalating atrocities. There’s a feeble attempt at suspense."
    },
    {
      "text": "As Bateman loses his tenuous grip on sanity, the filmmakers can't disguise the strain in Ellis' effort to make him an '80s Everyman who encapsulates every vile aspect of his culture."
    },
    {
      "text": "It's quite possible that American Psycho is a brilliant movie."
    },
    {
      "text": "Those looking for an exploration of what makes an American Psycho tick are bound to be disappointed, as are those looking for a good scary film."
    },
    {
      "text": "A savagely funny feminist take on just how dangerous stupid men can be."
    },
    {
      "text": "Funny, pungent, and weirdly gripping, American Psycho is a satire that feels like a hallucination"
    },
    {
      "text": "Despite some strong performances and off-kilter, wince-worthy humor, the overbearing direction and an uncertain tone (if not a smug atmosphere that shrieks, \"Look, aren't we being funny?\") drag the whole thing down."
    },
    {
      "text": "Christian Bale plays his role cool, making seamless shifts from dapper to ripper."
    },
    {
      "text": "Christian Bale is heroic in the way he allows the character to leap joyfully into despicability; there is no instinct for self-preservation here, and that is one mark of a good actor."
    },
    {
      "text": "A highly stylized fable, a combination creep-show and pitch-black comedy that steadily builds to an almost hallucinatory climax."
    },
    {
      "text": "Wickedly funny when it bares its fangs."
    },
    {
      "text": "It's so unique in its style, delivery, and execution that it's undoubtedly the most fascinating film to come along so far this year."
    },
    {
      "text": "Christian Bale delivers a whale of a performance."
    },
    {
      "text": "What's best about the movie is the density of its satire. Its wry social commentary permeates every aspect of the filmmaking."
    },
    {
      "text": "American Psycho has a hallucinatory, often-mesmerizing quality, thanks in part to Bale's coldly magnetic portrayal."
    },
    {
      "text": "American Psycho is both painfully well-made and simply painful.  What's the point of all this art-house mayhem?"
    },
    {
      "text": "Bale is outstanding as Bateman."
    },
    {
      "text": "Patrick Bateman's morality tale may not be as strong as it was on paper, but for moviegoers, it will nevertheless prove a rollicking good time."
    },
    {
      "text": "\"Psycho\" remains a hollow portrait of a hollow man."
    },
    {
      "text": "A remarkable achievement on so many levels that it would be a shame if it were dismissed with the same kind of blind contempt as the novel (rather unjustly) was."
    },
    {
      "text": "The film is an incisive commentary."
    },
    {
      "text": "A very cool satire featuring one messed up dude portrayed splendidly by one awesome actor."
    },
    {
      "text": "American Psycho is not a picture you'd want to miss."
    },
    {
      "text": "As it nears a conclusion, the picture becomes almost as empty as the title character."
    },
    {
      "text": "Christian Bale is impressively impersonal."
    },
    {
      "text": "Just doesn't make the case that this book was worth filming."
    },
    {
      "text": "If \"American Psycho\" worked better as a thriller or a comedy or some combination of the two, its reason for existing would be much easier to explain."
    },
    {
      "text": "The movie has the feverish intensity of a bad dream, leavened with a subversive sense of humor that is both sophisticated and cracked."
    },
    {
      "text": "Stillborn, pointless piece of work."
    },
    {
      "text": "The movie is not comedy, but it is joyously mean and evil, somewhat in the tone of Blue Velvet."
    },
    {
      "text": "Bale, pumped to underwear-model perfection, is a truly terrifying spectacle of grinning, shifting masks, and Gideon Ponte's production design is perfect, right down to the last exquisite detail."
    },
    {
      "text": "By no means a crowd pleaser, but it uses intelligent satire to make a pungent statement about the shallowness of modern society."
    },
    {
      "text": "If you can get past the subject matter, you'll find yourself challenged and yes, even entertained."
    },
    {
      "text": "Although it suffers from the same lack of focus that plagued the book, the result is bloody hilarious and occasionally brilliant."
    },
    {
      "text": "Rarely has a film so funny, chilling and revealing as American Psycho graced the silver screen."
    },
    {
      "text": "Bale has never been better."
    },
    {
      "text": "Period piece or not, Psycho further extends the current screen cycle devoted to professional male malaise Office Space, Fight Club, American Beauty."
    },
    {
      "text": "Did Bret Easton Ellis' \"American Psycho\" have to be made into a movie in the first place? Probably not, but since someone chose to do it, we should be grateful that person was director-screenwriter Mary Harron."
    },
    {
      "text": "I think it was a mistake to have Christian Bale play Bateman quite as goofy as he does, but it's a terrific performance within its boundaries."
    },
    {
      "text": "Funny at times, scary at others, and thought provoking throughout."
    },
    {
      "text": "Much of American Psycho feels like déjà vu."
    },
    {
      "text": "The idea of cramming one's mind with these unavoidably ugly images is about as appealing as spending even one minute with the guys at Bateman's office."
    },
    {
      "text": "Bale is a treat to watch, droll and sleek and capable of bursts of energy both comic and diabolical."
    },
    {
      "text": "Although I've heard both the film and the book described as dark satire, not much here resembles wit."
    },
    {
      "text": "A misfiring black comedy."
    },
    {
      "text": "Are you, more or less, setting yourself up for disappointment if you go to see a film adaptation of one of the most powerfully written novels you can recall reading?"
    },
    {
      "text": "American Psycho is seamless in its inability to engage emotionally, message or no message."
    },
    {
      "text": "A dark satire, a black comedy, and a slick slasher rolled into one."
    },
    {
      "text": "Harrson has a true feeling for the era and an eye for the cold hollowness of the theme."
    },
    {
      "text": "It is a fable, albeit a dark and twisted one destined to be praised by some, abhorred by others and turned into a cult classic by even more."
    },
    {
      "text": "Bale's achievement is in suggesting far more dimensions than his character would ever admit to having."
    },
    {
      "text": "Writer/director Mary Harron and co-writer Guinevere Turner have fashioned a sanctimonious social satire on the greedy excesses of the '80s."
    },
    {
      "text": "\"Killer looks\" reads \"American Psycho\"'s tagline. Killer looks indeed. And one stone-cold killer performance from Christian Bale."
    },
    {
      "text": "\"American Psycho\" transcends its source material."
    },
    {
      "text": "American Psycho is a work of razor-sharp social commentary."
    },
    {
      "text": "I was pleasantly surprised, no, make that impressed, with Mary Harron's adaptation of Bret Easton Ellis' notorious novel."
    },
    {
      "text": "Harron can't find an angle, therefore a reason, to have made a film of this book -- beyond the simple fact that she could."
    },
    {
      "text": "American Psycho may be controversial (and some people will undoubtedly be shocked and repulsed by the violence), but it represents one of the most daring, inventive, and invigorating movies to reach the screen during the dreary first half of 2000."
    },
    {
      "text": "As Bateman, the Welsh-born actor, Christian Bale, delivers the best performance of his career so far."
    },
    {
      "text": "Harron's adaptation of Ellis's novel is brilliant, probably better than the book itself."
    },
    {
      "text": "A taut, grim and sometimes quite funny (in a sick way, of course) indictment of soul-killing consumer culture, presented here — quite convincingly — as the ongoing legacy of the 1980s."
    },
    {
      "text": "American Psycho offers a fierce -- yet satirical -- social commentary about the excesses that characterized the 1980s."
    },
    {
      "text": "Rounded out with crisp, antiseptic photography and a soundtrack mixing the brilliant and the deliberately banal, this is a powerhouse journey into the dark side."
    },
    {
      "text": "The film left me with an empty feeling."
    },
    {
      "text": "At the heart of the film is a star-making performance by the handsome Welsh actor Christian Bale."
    },
    {
      "text": "Unfortunately, director Mary Harron and screenwriter Guinevere Turner have also de-fanged the non-violent remainder of Ellis' free-floating narrative."
    },
    {
      "text": "The film's attempts at satire get played out quickly, and just like Bateman's victims, you can't escape the bludgeoning."
    },
    {
      "text": "As someone who generally resists such violent imagery, there was something about Harron's angles that not only impressed me on an artistic level, but on an emotional one as well."
    },
    {
      "text": "A wimpy horror movie that could have been so much better."
    },
    {
      "text": "The satire gradually becomes overdone and heavy-handed."
    },
    {
      "text": "American Psycho, the most misunderstood movie in years, turns out to be a savage satire that is so smart, so daring and so damned funny it will make your head spin."
    },
    {
      "text": "Visually stunning, clever, brilliantly acted and directed, and socially and politically charged, American Psycho is a ballsy piece of filmmaking that at every turn defies expectations."
    },
    {
      "text": "A clever adaptation."
    },
    {
      "text": "A masterful performance."
    }
  ],
  "release_year": 2000,
  "duration": 103,
  "genres": [
    "Comedy",
    "Mystery & Thriller",
    "Horror"
  ],
  "synopsis": "In New York City in 1987, a handsome, young urban professional, Patrick Bateman (Christian Bale), lives a second life as a gruesome serial killer by night. The cast is filled by the detective (Willem Dafoe), the fiance (Reese Witherspoon), the mistress (Samantha Mathis), the coworker (Jared Leto), and the secretary (Chloë Sevigny). This is a biting, wry comedy examining the elements that make a man a monster.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/9uGHEgsiUXjCNq8wdq4r49YL8A1.jpg"
}