{
  "movie_name": "Ready or Not",
  "movie_id": "ready_or_not_2019",
  "total_reviews": 120,
  "reviews": [
    {
      "text": "It's not perfect, and the mix of comedy and suspense probably won't be for everyone, but for Yours Truly, it ended up being a very fun experience that had me on the edge of my seat most of the time. [Full review in Spanish]."
    },
    {
      "text": "Darkly funny, delightfully absurd, and shockingly gory, Ready or Not takes viewers on a thoroughly entertaining ride while commenting on privilege, class, and marriage."
    },
    {
      "text": "…a super-smart B movie that offers a dark, splattery note on the margins of society’s growing divisions…."
    },
    {
      "text": "The set up of Ready Or Not sounds clunky, and it kind of is. The execution though, is peerless."
    },
    {
      "text": "As a kind of grown-up Clue in reverse, complete with the tribute appearance of a pepper-box revolver, Ready or Not also lays out a motley assortment of Colonel Mustard and Mrs. Peacock-worthy opponents hell-bent on dispatching Grace prior to sun-up."
    },
    {
      "text": "Ready or Not accomplishes exactly what it set out to do. It delivers a fun, entertaining 90-minute hide-and-seek game as we’ve never seen before."
    },
    {
      "text": "A beautiful and fun exercise of cat and mouse. [Full review in Spanish]"
    },
    {
      "text": "A vein of social commentary on class and marriage runs through the cat-and-mouse hunt before building to a cathartic ending."
    },
    {
      "text": "Ready or Not is another solid film for 2019. It’s secured a place in my top five of the year and probably will stay somewhere around there."
    },
    {
      "text": "While much horror of late is thin allegory for the political landscape or the class divide, the wealthy doofuses in this film don't represent anything or anyone more than the backdrop to an enjoyable and rewatchable fright-lite."
    },
    {
      "text": "Ready or Not brings a new twist to the familiar story of trying to impress your soon-to-be in-laws by combining horror, mystery, and a little bit classic screwball comedy"
    },
    {
      "text": "Ready Or Not blends horror and comedy effortlessly to give the audience a great viewing experience."
    },
    {
      "text": "It's the kind of low-budget, bound-for-cult-glory movie whose eccentricities will grow on you with repeated viewings."
    },
    {
      "text": "A darkly hilarious new entry in the ever-expanding cinema of discontent inspired by the one percenters and Donald Trump."
    },
    {
      "text": "The gorier, gushier, nastier cousin to Knives Out..."
    },
    {
      "text": "Episode 48: Ready or Not / It Chapter Two / Women on the Verge of a Nervous Breakdown"
    },
    {
      "text": "The intrigue propels you more than the execution of the concept... but I think if you go see this one a good time will be had by all."
    },
    {
      "text": "Witty, with enough twists and shocks to keep it interesting, Ready or Not has the same class warfare foundation that made Get Out and Parasite so oddly satisfying."
    },
    {
      "text": "Once the story finds its feet this is an entertaining back-and-forth blend of horror and comedy."
    },
    {
      "text": "It's not trying to reinvent the wheel or subvert any kind of genre expectations, but it's still a hell of a gory and entertaining ride."
    },
    {
      "text": "There are only so many clever gags the filmmakers can include before it becomes obvious they're trying to cover up holes of their own making."
    },
    {
      "text": "Ready or Not provides a new take on the slasher-in-a-mansion model; a little muddled at times, but thoroughly fun."
    },
    {
      "text": "A crowd-pleaser with some laughs and a giddily gory climax."
    },
    {
      "text": "Ready or Not's B-movie thrills and kills are sure to guarantee at least a passably good time."
    },
    {
      "text": "Devilish fun with a tour de force lead performance from breakout star Samara Weaving."
    },
    {
      "text": "A remarkably strong ending fixes many of the storyline and pacing issues."
    },
    {
      "text": "What elevates this above other genre entries is its biting social commentary as it mercilessly skewers the 1% and the lengths they go to attain and maintain their wealth."
    },
    {
      "text": "One of the biggest surprises of 2019, this was a horror film with some edgy humor inserted inside the usual \"one night to survive or die\" plot construction."
    },
    {
      "text": "This 2019 horror comedy is a completely unexpected gem that puts a real sinister twist on a childhood game. Full of witty humor and tense drama, thanks to its well-balanced script, Ready or Not is surely set for cult status."
    },
    {
      "text": "It's as horrifying as it is hilarious."
    },
    {
      "text": "Ready or Not may not play with convention as successfully as it clearly has a desire to, but for the most part it is a suitably gnarly and surprisingly funny ride that very much knows what tone it is wanting to strike."
    },
    {
      "text": "Shotgun wedding takes on a new meaning."
    },
    {
      "text": "It plays to the rafters with its punch-the-air gore and casts Weaving as one of the most rootable protagonists in the genre's recent past."
    },
    {
      "text": "Gore-filled mayhem ensues in this unexpectedly awesome Halloween treat. There's a hint of Uma Thurman's Kill Bill ass-kicking fury as a lace-dressed Grace fights back, and a whole stack of gross out special effects as things get ultra vicious"
    },
    {
      "text": "I'm not moved by the gore or the slapstick humor used by those characters who celebrate the ritual of brutality. The narrative lacks intensity. [Full review in Spanish]"
    },
    {
      "text": "Sometimes you watch a trailer so bonkers that you go into the movie expecting it to be awesomely bad. Then, as you sit and watch the movie itself, you realize that you actually underestimated the filmmakers."
    },
    {
      "text": "Nutty, nerve-shredding and fiendish fast-paced fun throughout."
    },
    {
      "text": "Co-Directors Matt Bettinelli-Olpin and Tyler Gillett cleverly infused both horror and comedy into this wickedly fun treat."
    },
    {
      "text": "The pitch-black humor cuts through like a knife, where mayhem and viciousness are both played for shock and laughs."
    },
    {
      "text": "It finds the appropriate balance where it's deadly serious while simultaneously having its tongue firmly planted in cheek, all while moving at a brisk pace."
    },
    {
      "text": "Simply one of the best times I had at a movie theater this year."
    },
    {
      "text": "It was a good theater-going experience."
    },
    {
      "text": "It was crazy... I enjoyed this."
    },
    {
      "text": "Shamelessly entertaining, but very stupid."
    },
    {
      "text": "A madcap cat-and-mouse game that's exhilaratingly fun...and offers a darkly funny and satirical take on just how ridiculous the rich really are."
    },
    {
      "text": "Weaving comes alive as a hilarious and deeply macabre play on the \"final girl\" archetype, and it's nothing short of cathartic to cheer her on and echo the rage that quickly consumes and empowers her."
    },
    {
      "text": "Not many movies can have you laughing at one minute & biting your nails at another Ready Or Not does. It is the perfect combination of horror & humor. A wild & fun ride!"
    },
    {
      "text": "Ready or Not is remarkably successful at hitting its own sweet spot for such a modest movie."
    },
    {
      "text": "Most impressively, the movie effortlessly balances its slasher suspense with an acid-tongued humor, keeping the film from feeling like a parody."
    },
    {
      "text": "Be prepared to have a new favourite to add to your midnight movie collection."
    },
    {
      "text": "Ready or Not is such a fun movie for the late summer. Perfectly balancing dark comedy and slasher horror in a new way."
    },
    {
      "text": "Another year, another handful of overhyped horror films that don't live up to their potential."
    },
    {
      "text": "It presents a fascinating setup with a childhood game that turns into a deadly hunt, giving you a few good thrills and darkly-humorous moments along the way, but unfortunately Busick and Murphy's screenplay doesn't do quite enough with the premise."
    },
    {
      "text": "Heir to De Palma's best horror. [Full review in Spanish]"
    },
    {
      "text": "Ready or Not combines humor and murder to create a deliciously wonderful film and brought a surprise hit with critical acclaim to movie theaters this summer."
    },
    {
      "text": "Prepare to laugh, suffer and not take your eyes off of it. [Full review in Spanish]"
    },
    {
      "text": "Part of the fun is understanding the family dynamic despite meeting them under heightened circumstances."
    },
    {
      "text": "Ready or Not builds upon a woman's fear of not being accepted by her in-laws and laughs about the situation through a black horror comedy, concocting a satisfying bloody feast. [Full review in Spanish]"
    },
    {
      "text": "It's wildly entertaining and at a tight 90 minutes, it crackles with energy, never letting your attention waver."
    },
    {
      "text": "As the bungling archetypes run riot within the mansion, it's clear that this is a horror that knows its strengths and undeniably operates best in its more playful moments. The result is loads of bloody fun."
    },
    {
      "text": "Ready or Not is a nasty little bit of exploitation satire in the tradition of Little Shop of Horrors, and I'm frankly surprised at how much I enjoyed it."
    },
    {
      "text": "Ready or Not does exactly what you want it to."
    },
    {
      "text": "It's never easy creating something fresh within the well-worn horror genre but Ready or Not deserves praise for its cool concept."
    },
    {
      "text": "The result is thrilling, playful, and always pleasant. [Full Review in Spanish]"
    },
    {
      "text": "Ready or Not heralds the arrival of a fantastic talent in Samara Weaving, as well as directors Matt Bettinelli-Olpin and Tyler Gillett."
    },
    {
      "text": "Ready or Not is a joyously fun time that ensures that Radio Silence are filmmakers to be reckoned with and cements Samara Weaving as a bona fide star. Recommended."
    },
    {
      "text": "Ready or Not is a stupendously chilling, riveting and crazy horror."
    },
    {
      "text": "A goof and a hoot, a retro, completely silly, quite violent but never nasty romp that doesn't tax the cerebral cortex but isn't without style ... Weaving is supremely watchable, a superb physical comedienne with a unique presence."
    },
    {
      "text": "[Samara Weaving] faces an uphill slog, hampered by a creaky plot, cookie-cutter supporting characters and plodding direction."
    },
    {
      "text": "A lively horror/thriller with a great grindhouse feel but it comes perilously close to forgetting to just have fun. Once it finally lets its hair down, it's a damn good time."
    },
    {
      "text": "It's neither witty enough to be truly, viciously funny, nor sufficiently scary to cultivate the atmosphere of evil that might make it genuinely unnerving."
    },
    {
      "text": "Even by its own humble standards the plot is poorly worked out (a few lame attempts at social commentary criticising the rich are feeble in the extreme) and the dialogue is wretched."
    },
    {
      "text": "There's no attempt to be seriously disturbing, or to offer us anything more than a macabre good time. Still, on that level the film delivers."
    },
    {
      "text": "Think of Meet the Parents as re-imagined by Stephen King and you'll get some idea of what to buckle yourself in for with the twisted, bizarre offerings in this knockout horror-comedy, skillfully directed with a terrific balance of laughs, scares and gore."
    },
    {
      "text": "A round of hide and seek with some blue bloods gets, well, bloody in the very funny horror-satire Ready or Not."
    },
    {
      "text": "Bloody, twisted, and hilarious, Ready or Not is an absolute treat as both a fresh offering for horror fans and cinema in general for 2019."
    },
    {
      "text": "Samara Weaving is a one-woman firestorm, blazing her way through a crumbling house of cards."
    },
    {
      "text": "With lashings of blood and plenty of giddy thrills, 'Ready or Not' is one game you'll want to play again and again."
    },
    {
      "text": "One of the most entertaining films of the year. [Full Review in Spanish]"
    },
    {
      "text": "It lacks cruelty to be truly dark when it is nothing more than light gray, but its last 20 minutes are truly stupendous. [Full Review in Spanish]"
    },
    {
      "text": "Thrilling, hilarious and fun for all the family (jk, don't bring kids to this, unless you want them to turn into freaky murderous children)."
    },
    {
      "text": "Highly entertaining and full of blood! [Full Review in Spanish]"
    },
    {
      "text": "A very enjoyable film, unable to bore. [Full review in Spanish]"
    },
    {
      "text": "It's silly subversive fun - it just could have sought out more smarts."
    },
    {
      "text": "Ready or Not puts the fun back into horror."
    },
    {
      "text": "Maybe the elements are not particularly new, but this festival of blood and gags is very well built and it's enjoyable from beginning to end. [Full Review in Spanish]"
    },
    {
      "text": "A blast of entertainment, fun and ingenuity. [Full review in Spanish]"
    },
    {
      "text": "A charming film that plays well with references to the genre. [Full Review in Spanish]"
    },
    {
      "text": "It wouldn't work as well as it does if not for Samara Weaving as Grace. She the kind of face you look for in a scream queen, but also that unkillable spirit, which is put to the test."
    },
    {
      "text": "Ready or Not is a vehicle to entertain, to mock the elite, instead of adding something new to the genre. [Full Review in Spanish]"
    },
    {
      "text": "All in all, Ready or Not is a diverting, fun romp through the worst wedding ever."
    },
    {
      "text": "Laugh-out-loud moments with slight revulsion...rather than running out of steam, it keeps picking up pace and cracking along."
    },
    {
      "text": "New Scream Queen on the chopping block Samara Weaving (niece of Hugo) holds the murderous aristocratic mayhem together, while Andie MacDowell and company prove good sports by entering into the filthy-rich and gory spirit of the rigorous gross-outs."
    },
    {
      "text": "Directed by Tyler Gillett and Matt Bettinelli-Olpin, the film does nothing fresh with its scenes of tension and violence, but they're pretty entertaining, and some of the added touches of black comedy are excellent."
    },
    {
      "text": "Weaving's spirited performance and a game cameo from Andie MacDowell help leaven the bloody, tongue-in-cheek carnage."
    },
    {
      "text": "So while this low-brow approach is entertaining, it's missing a trick to make things even more punchy by actually being scary while grappling with topics that are already sitting here unexplored."
    },
    {
      "text": "Ready or Not takes great pleasure in setting up and paying off obvious gags and gore, then switching things up with a sharp take that keeps things creepy and intelligent throughout."
    },
    {
      "text": "There is an elegance to the premise - an otherwise straightforward cat-and-mouse chase around a gothic mansion - and a satisfying clip to the rewardingly gory action."
    },
    {
      "text": "Fleet, funny, and gleefully bloodthirsty."
    },
    {
      "text": "[A] witty, endlessly suspenseful US slasher movie that critiques privilege and entitlement."
    },
    {
      "text": "Weaving is nothing short of a revelation - goofy, beautiful, ballsy and very funny - a cosplayer's dream character."
    },
    {
      "text": "[A] delicious romp with a game heroine that never takes itself too seriously, and has some pointed things to say about the class system."
    },
    {
      "text": "Think the Addams family, only less appealing."
    },
    {
      "text": "A completely funny satire about the upper class, the rules imposed by society and even marriage. So if you want to have a great time with blood and guaranteed laughter, run and watch Ready or Not. [Full Review in Spanish]"
    },
    {
      "text": "guarantees a gory good time"
    },
    {
      "text": "There's little nuance in Matt Bettinelli-Olpin and Tyler Gillett's horror-comedy take on class warfare, but it's Weaving's touch of pure anger that makes it feel like more than just your average shlocky gorefest."
    },
    {
      "text": "[Ready or Not] mixes its influences in a refreshingly intelligent and often times subversive way. [Full Review in Spanish]"
    },
    {
      "text": "Co-starring Adam Brody and Andie MacDowell, what follows is all kinds of grizzly fun, with the hilarious twist-ending the cherry on the top."
    },
    {
      "text": "Ready Or Not manages to successfully cram in incisive social commentary, deliciously gory thrills and terrific gags, and that is a triumph all on its own. More like this, please."
    },
    {
      "text": "It's not pretty, but it's bloody good fun."
    },
    {
      "text": "Ready or Not is fast-moving, ridiculous, scary and absurd all at once."
    },
    {
      "text": "Much blood is spilt and many quips are made as the absurdities pile up, although it never really adds up to all that much."
    },
    {
      "text": "[A] black comedy-thriller that blows up in your face, not once but regularly."
    },
    {
      "text": "Directors Matt Bettinelli-Olpin and Tyler Gillett have a lot of fun with the bloody set-pieces and moments of high tension and the cast is clearly having a brilliant time finding the humour and horror."
    },
    {
      "text": "Not subtle (and might put you off getting hitched), but hits its mark with baseball-bat force."
    },
    {
      "text": "Fun, funny, gory, and with enough twists and turns to keep us on our toes, this is the definition of a bloody blast."
    },
    {
      "text": "Ready or Not is your premiere summer slasher with plenty of substance to go around."
    },
    {
      "text": "No-fat fun and a great new scream queen in Samara Weaving."
    },
    {
      "text": "Ultraviolent satire is forgettable but fun for horror fans."
    },
    {
      "text": "It helps that Samara Weaving is fantastic in the lead, fully committed to the darker aspects and with impeccable comic timing."
    }
  ],
  "release_year": 2019,
  "duration": 95,
  "genres": [
    "Horror",
    "Mystery & Thriller",
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Grace couldn't be happier after she marries the man of her dreams at his family's luxurious estate. There's just one catch -- she must now hide from midnight until dawn while her new in-laws hunt her down with guns, crossbows and other weapons. As Grace desperately tries to survive the night, she soon finds a way to turn the tables on her not-so-lovable relatives.",
  "popularity": 7.8,
  "poster_url": "https://image.tmdb.org/t/p/original/oJD9KQFoObZmxAS1je56SIFVNJt.jpg"
}