{
  "movie_name": "Schindler's List",
  "movie_id": "schindlers_list",
  "total_reviews": 127,
  "reviews": [
    {
      "text": "The story of Oskar Schindler is as complicated as it is riveting and Steve Zaillian’s script tells us the story in a way World War II films never had."
    },
    {
      "text": "It brought the Holocaust to a mass non-Jewish audience at a time when survivors were dying of old age, and testimony was at risk of being lost."
    },
    {
      "text": "Spielberg employs all the emotive Hollywood tools at his disposal and the result is a remarkable film with wide appeal and real importance. Neeson is phenomenal, but matched by towering performances from Ben Kingsley and Ralph Fiennes."
    },
    {
      "text": "A great film, a powerful film, and even if it’s not the definitive American Holocaust film, it remains on the very short list of the most important ones. (30th anniversary)"
    },
    {
      "text": "This isn't your high-octane thriller; rather, acts of heroism unfold with a deliberate, strategic cadence."
    },
    {
      "text": "Spielberg’s most personal film is also his finest and most altruistic."
    },
    {
      "text": "It's the faces that make Schindler's List a magnificent, harrowing, stomach-wrenching, emotional piece of cinema."
    },
    {
      "text": "Schindler's List is not only a masterpiece but something of a miracle."
    },
    {
      "text": "A film of immense power and the deepest sincerity."
    },
    {
      "text": "Steven Spielberg's triumphant Schindler's List is a remarkable and moving memorial to an historical Holocaust. It is also a timely reminder of what genocide and \"ethnic cleansing\" really mean. But, above all, it is a cracking movie."
    },
    {
      "text": "Using every ounce of his awe some technical skill, the man who sent T. rex and Indiana Jones racing through our imagination brings us a story of human horror beyond imagination."
    },
    {
      "text": "Once in a very great while, a movie insinuates itself so deeply into your consciousness that it offers not vicarious experience but instead, direct experience. Steven Spielberg's heartfelt, monumental Schindler's List is such a movie."
    },
    {
      "text": "This is a movie that succeeds brilliantly not just in bringing a terrible chapter in history back to life, but in meticulously depicting the processes through which a self-obsessed and immature man becomes integrated and responsible."
    },
    {
      "text": "There are enough \"Spielbergian\" set pieces and incidental touches to keep Schindler accessible to those who believe that the best Spielberg is the perky Spielberg of the E.T. and Indiana Jones romps."
    },
    {
      "text": "How does one comprehend the magnitude of the Holocaust? Remarkably, Steven Spielberg's Schindler's List defines the horror of Hitler's \"final solution\" on vividly human terms without diminishing its scope or impact."
    },
    {
      "text": "Few films have ever dealt so chillingly with what philosopher Hannah Arendt called \"the banality of evil.\""
    },
    {
      "text": "Liam Neeson is a splendid Schindler, tall, handsome, devil-may-care and a poker-playing genius. Ben Kingsley, as Itzhak Stern, Schindler's accountant and chief aide, is as brilliant as ever, and Ralph Fiennes is evil and powerful as Amon Goeth."
    },
    {
      "text": "A towering cinematic accomplishment from director Steven Spielberg that left all other 1993 films in its wake."
    },
    {
      "text": "Spielberg's dazzlingly modulated epic Schindler's List is nothing less than astonishing."
    },
    {
      "text": "A near-documentary, brilliantly designed and choreographed, [and] a character study in which Ralph Fiennes, the winningly urbane Liam Neeson, and the magnificently impassive Ben Kingsley attain a memorable dramatic intensity."
    },
    {
      "text": "Its images of horror and its message of hope -- recounting the Talmudic verse \"whoever saves one life saves the world entire\" -- should not and will not be forgotten."
    },
    {
      "text": "Schindler's List is a great movie that serves a greater purpose. This epic story of one man's conscience reminds the world that an individual's rise to heroism in the face of mass insanity can make a difference."
    },
    {
      "text": "Liam Neeson gives a fine performance as Schindler, steering the character through his grand arc. Kingsley is predictably good, and Ralph Fiennes is chilling as Goeth the camp commandant... But the movie is Spielberg's triumph."
    },
    {
      "text": "Steven Zaillian's ingeniously structured script presents the unpalatable in a way it can be digested -- by hooking it into a powerful, almost mythical story about a man who becomes a hero almost in spite of himself."
    },
    {
      "text": "Neeson creates a mixture of saint and sinner, dandy and buccaneer, a thick-skinned rascal capable of great tenderness."
    },
    {
      "text": "A thoughtful, rigorous and thereby moving piece of work."
    },
    {
      "text": "With his brave new film, Steven Spielberg not only tackles a subject that's largely been ignored by mainstream Hollywood but manages to handle it in an accessible, pulpy way that doesn't detract from the gravity of the material."
    },
    {
      "text": "It's draining, emotionally and physically, but there's no other way that this story could have been told and have the effect that it should."
    },
    {
      "text": "It is a harrowing indictment of cruelty and a heartfelt testament to courage. It is a film of maturity and power, as Spielberg applies his considerable filmmaking skill to a most serious topic."
    },
    {
      "text": "Everyone in this movie has his or her humanity; no one is a symbol or a stereotype."
    },
    {
      "text": "Steven Spielberg's great achievement in his devastating new film Schindler's List is the ability to lift the Holocaust from the archives, documentaries, history books, photographs and memories of a generation, and make it real again."
    },
    {
      "text": "Spielberg's skill as narrator and visualizer lies in his ability not to dwell on the nightmare, and to blend despair with hope even as the tormentors expand their catalogue of cruelty."
    },
    {
      "text": "Spielberg deploys his formidable command of the medium and his immense narrative skill, and he has never before drawn out performances of such subtlety, especially those of Neeson, Fiennes and Ben Kingsley."
    },
    {
      "text": "Once the horrors begin, the play-off between equivocal hero and unequivocal history becomes hypnotic."
    },
    {
      "text": "\"Serious\" subject matter does not guarantee skillful filmmaking, and, ultimately, Spielberg just doesn't seem to have much to say."
    },
    {
      "text": "Schindler's List is an amazing film and a triumphant coming of age for the world's most popular filmmaker."
    },
    {
      "text": "Schindler's List should silence the naysayers once and for all. This sobering black-and-white pseudo-documentary breaks the Spielberg mold by putting substance ahead of style."
    },
    {
      "text": "In its themes of the making of good men and evil ones in times of storm and stress, and in its montage of images and sonorities, this will stand as Spielberg's masterwork."
    },
    {
      "text": "We need films like Schindler's List to remind us to never let something like that happen again, but also to remind us that when we see a difficult situation that we have to do our best to change it."
    },
    {
      "text": "Framing and imagery demonstrate artistry even while capturing subject matter of extreme obscenity."
    },
    {
      "text": "Spielberg's finest work."
    },
    {
      "text": "(Schindler's List) slowly surrounds you, like a gang of bullies moving in one by one, before holding you down and beating you into submission."
    },
    {
      "text": "By dramatizing the Holocaust with such vividness and scale, Spielberg has helped to pass its lessons on to future generations."
    },
    {
      "text": "The film's epic sweep and grasp of detail are exemplary, while some scenes could make even a lump of granite weep. This is Spielberg's most grown-up film."
    },
    {
      "text": "The story of a righteous rescue mission amid unimaginable horror...a sober, historical drama."
    },
    {
      "text": "With its black-and-white bleakness and its fiercely insistent realism, Schindler's List is a hallucinogenic experience. It is one of the most finely calibrated, most overtly mournful, most nakedly authentic films ever made."
    },
    {
      "text": "...Schindler's List is essential cinema..."
    },
    {
      "text": "Schindler's List is monumental because it demands that we imagine the abominable, but it's great because of its creator's conviction that to ignore injustice is to sanction it."
    },
    {
      "text": "The film is an outstanding achievement."
    },
    {
      "text": "It's a stunning achievement, a film that re-creates the Holocaust not as something abstract, but as felt knowledge."
    },
    {
      "text": "...a most credible and realistic film. [Full Review in Spnaish]"
    },
    {
      "text": "Enough to give you hope for the future of American movies."
    },
    {
      "text": "Schindler's List is bearable when the characters keep the tension, but the film lapses when its epic drama and sentimentality take over. [Full Review in Spanish]"
    },
    {
      "text": "Schindler's List, with its grave documentary thoroughness and moral complexity, rewrites film history. It is one of the cinema's finest achievements."
    },
    {
      "text": "It was (and remains) irreducibly [Spielberg's] masterpiece."
    },
    {
      "text": "Spielberg understands that that tension is a problem not just of filming the subject, but of the subject itself: that the tale of any one individual has to struggle to avoid being swamped by the sheer scale of horror."
    },
    {
      "text": "With seemingly effortless grace and skill, Schindler's List balances fear and exaltation, humor and horror, love and death. It evokes, superbly, a time of savagery and grief, and the inexplicable, stunning compassion that rises within and against it."
    },
    {
      "text": "It's an extraordinary work of vision and passion that raises even the gifted Spielberg to a new level of artistry. And like all great works, it elevates everyone who views it."
    },
    {
      "text": "Spielberg ultimately remains Spielberg, finding his enduring themes within Thomas Keneally's novel and giving them the full Spielberg treatment."
    },
    {
      "text": "For this film Spielberg has done the best directing of his career. Much of his previous work has been clever and some of it better than that, but Schindler's List is masterly."
    },
    {
      "text": "Despite admirable intentions and the undeniable splendor of his craft, ultimately what Spielberg has told is the story of the list; he has not told the story of Schindler."
    },
    {
      "text": "Spielberg uses stark, brutal realism to put over his powerful points about racism and ethnic cleansing, and the use of stunning black-and-white photography and gritty hand-held camera footage give the film a potent documentary style."
    },
    {
      "text": "Not so important socially as it thinks it is, perhaps, but even more important aesthetically and thematically."
    },
    {
      "text": "More than any previous non-documentary Holocaust movie, this one convinces through the accumulation of such detail."
    },
    {
      "text": "Schindler's List is filmed in black and white, but the triumph of Neeson's portrait and Steven Zaillian's screenplay is that Oskar Schindler remains gray and enigmatic."
    },
    {
      "text": "Spielberg never solves the Schindler riddle, which keeps this from being a truly great picture. He does bring to Schindler's List the technical skill and dazzling smoothness of a movie-making natural."
    },
    {
      "text": "The movie exudes an inescapable realism. Unlike a pastiche of newsreel footage, however, Spielberg craftily imbues Steven Zaillian's masterful screenplay with an emotionally charged examination of calculated brutality."
    },
    {
      "text": "What the visual immediacy of Schindler's List does is to prod each of us to fill in the gaps of emotion for ourselves. To put this another way, the more you are able to invest in this superb, demanding film, the more you are likely to get back."
    },
    {
      "text": "It looks, without ever averting its gaze, at the darkest of the dark."
    },
    {
      "text": "Schindler's List is one of Steven Spielberg's most powerful films, capturing the tragedy and horror while still finding room to inspire and move generations."
    },
    {
      "text": "The moving film may be arduous to watch, but brilliantly acting and painstaking accuracy make it a must-see."
    },
    {
      "text": "Authentic intensity, emotionalism and botch: the first two marry unexpectedly well, and the third element is by far the smallest, but it is there, and it means that the film is less than the touted breakthrough for the cinema."
    },
    {
      "text": "Profoundly moving, profoundly shocking, profoundly important."
    },
    {
      "text": "Few American movies since the silent era have had anything approaching this picture's narrative boldness, visual audacity, and emotional directness."
    },
    {
      "text": "Ultimately, the film is memorable as much for simple testimony as for the cinematic art it displays."
    },
    {
      "text": "Schindler's List serves up three full hours of brilliant storytelling that's as humane and compassionate as it is gripping and provocative."
    },
    {
      "text": "What Spielberg has done in this Holocaust story is simply and forcefully place us there."
    },
    {
      "text": "There are a few moments -- a handful, out of a three-hour film -- in which Spielberg does push the story into melodrama. As for the rest, though, Schindler's List has a real and unexpected integrity."
    },
    {
      "text": "Accurate, heartbreaking masterpiece about the Holocaust."
    },
    {
      "text": "Schindler's List, because it is so finely crafted and authentic, truly allows one to experience the devastating, calculated breakdown of a Polish Jew in 1939 through the end of the war."
    },
    {
      "text": "Schindler's List is a film whose meanings are to be found less in its uplifting outline than in its harrowing flow of images -- images of fear, hope, horror, compassion, degradation, chaos, and death."
    },
    {
      "text": "In a film that is mostly black and white, small touches of color -- a candle flame; a child's coat, bright red -- bring the enormity of the tragedy into excruciating focus."
    },
    {
      "text": "See website for more details."
    },
    {
      "text": "Accessible ... ."
    },
    {
      "text": "This is the film to win over Spielberg skeptics."
    },
    {
      "text": "This is a beautifully crafted, hopeful movie."
    },
    {
      "text": "A heart-rending and redemptive Holocaust story, this Oscar-grabbing epic added to Spielberg's directorial credibility, showing he could handle controversial, sophisticated stories with real sensitivity."
    },
    {
      "text": "Spielberg made the picture with sufficient professional gravitas to signal that he understood the line he was walking. But it is ultimately just a movie, and we all know that in a black-and-white film, chocolate syrup can be read as blood."
    },
    {
      "text": "Spielberg has painted his masterpiece with his own blood."
    },
    {
      "text": "Not only is the subject matter different for Spielberg, the way it is treated is a departure both for him and for the business as usual standards of major studio releases."
    },
    {
      "text": "The [film succeeds] at conveying some of the enormity of the Holocaust, as well as some of its banal details, in a fully accessible manner, at a time when much of our collective memory and understanding of it is rapidly slipping away."
    },
    {
      "text": "The movie is raw and unexpected and it vividly depicts the Holocaust in all its monstrousness."
    },
    {
      "text": "Spielberg's tribute to the Holocaust reps Hollywood cinema at its best. Looking at the phenom from Schindler's narrow POV, the film is sharply-written and anchored by three great actors, Liam Neeson, Ben Kingsley and Ralph Fiennes."
    },
    {
      "text": "It's a noble achievement, and essential viewing."
    },
    {
      "text": "Schindler's List s'inscrit parmis les meilleurs films de Steven Spielberg et se veut un portrait trs russi de l'holocauste et de l'horreur qui en dcoule."
    },
    {
      "text": "Dirigido com uma discrio pouco comum em Spielberg, o filme emociona por sua crueldade e conquista graas  complexidade do carter de Schindler."
    },
    {
      "text": "There's no trust here from the director that the audience might be able to fathom the horrors of the Holocaust if the lines between good and bad aren't distinctly drawn."
    },
    {
      "text": "The film is as historically important as it is dramatic, and every high school student should see it."
    },
    {
      "text": "Many of the images, like the invasion of the Krakow ghetto, unfold like a collective nightmare of unspeakable brutality and dread."
    },
    {
      "text": "Spielberg is enough of a master showman to break up the horror with small rewards."
    },
    {
      "text": "A film for the ages."
    },
    {
      "text": "Spielberg is such a filmmaking savant that it's hard to tell where the cinema ends and the protection of his sanity begins in Schindler's List"
    },
    {
      "text": "Many (including me) might argue that, for all its excellence, Schindler's List isn't Spielberg's best movie, but it's certain to retain its standing as his most important."
    },
    {
      "text": "A classic that stays with the audience long after the closing credits conclude."
    },
    {
      "text": "A theme park ride masquerading as master's thesis."
    },
    {
      "text": "Because Schindler's List is a movie of such power, scope and intelligence, it will eventually take its place alongside masterpieces like Battleship Potemkin, Grand Illusion and The Great Dictator."
    },
    {
      "text": "Rising brilliantly to the challenge of this material and displaying an electrifying creative intelligence, Mr. Spielberg has made sure that neither he nor the Holocaust will ever be thought of in the same way again."
    },
    {
      "text": "Solid holocaust drama that confuses the importance of the subject with the importance of itself."
    },
    {
      "text": "Explores the mystery of goodness in this astonishing drama of a scoundrel's amazing acts of bravery and selflessness."
    },
    {
      "text": "For a movie -- or more accurately, a Hollywood-approved art movie -- this often-stunning work puts the Holocaust into bracing perspective."
    },
    {
      "text": "Schindler's List, despite blatant compromises, is a rending historical document."
    },
    {
      "text": "The documentary style allows Spielberg to deliver his message without preaching. The clever use of light and shade also makes it visually stunning."
    },
    {
      "text": "one of the most devastatingly emotional films ever made"
    },
    {
      "text": "The acting is excellent. Liam Neeson is super, as is Ben Kingsley. I thought Ralph Fiennes was especially good; chilling!"
    },
    {
      "text": "Spielberg marshals all his formidable storytelling talents and puts them at the service of an epic human drama."
    },
    {
      "text": "[Schindler's List] is a very good piece of cinema and those who are ready to spend three hours in front of the screen would be rewarded with a powerful, thought-provoking piece of seventh art."
    },
    {
      "text": "Because this film touches us so deeply, the catharsis has a power that few -- if any -- other moments in film history can match."
    },
    {
      "text": "What is most amazing about this film is how completely Spielberg serves his story. The movie is brilliantly acted, written, directed and seen."
    },
    {
      "text": "Spielberg has crafted a nearly perfect film, a gripping and brilliantly acted epic ."
    },
    {
      "text": "This is a supremely powerful depiction of the banality of evil and -- for once on film -- the seductiveness of good."
    },
    {
      "text": "What is most memorable is not the tragedy of the lives lost or even the number of people Schindler saved, but how such an imperfect man could have done something so perfect"
    },
    {
      "text": "An intensely personal meditation on the nature of heroism and moral choice, rendered on the kind of rich, dreamlike cinematic canvas that only Hollywood can realize."
    },
    {
      "text": "The result is unquestionably his most important work, his most fully realized work, his most rewarding work."
    },
    {
      "text": "Schindler's List is a ruthlessly unsentimental portrait of a German war profiteer's epiphany that inspires neither sorrow nor pity, but a kind of emotional numbness."
    },
    {
      "text": "Schindler's List is a true dramatic classic, capable of making anyone cry."
    },
    {
      "text": "Schindler's List (1993) is Steven Spielberg's award-winning masterpiece - a profoundly shocking, unsparing, three-hour long epic of the Holocaust."
    },
    {
      "text": "The devastating cultural experience Spielberg's masterpiece presented to us 25 years ago felt then like a piece of history. Today, from the bowels of 2018, it feels like a warning, a premonition, a harbinger."
    }
  ],
  "release_year": 1993,
  "duration": 195,
  "genres": [
    "History",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "Businessman Oskar Schindler (Liam Neeson) arrives in Krakow in 1939, ready to make his fortune from World War II, which has just started. After joining the Nazi party primarily for political expediency, he staffs his factory with Jewish workers for similarly pragmatic reasons. When the SS begins exterminating Jews in the Krakow ghetto, Schindler arranges to have his workers protected to keep his factory in operation, but soon realizes that in so doing, he is also saving innocent lives.",
  "popularity": 9.7,
  "poster_url": "https://image.tmdb.org/t/p/original/sF1U4EUQS8YHUYjNl3pMGNIQyr0.jpg"
}