{
  "movie_name": "Shazam!",
  "movie_id": "shazam_fury_of_the_gods",
  "total_reviews": 263,
  "reviews": [
    {
      "text": "The sequel is messy, bland and unfocused. While it retains its goofy charm, it fails to ignite spark. There were a few funny moments but they were overshadowed by predictable and formulaic moments, loads of plot holes and there are no consequences."
    },
    {
      "text": "It flickers into life now and again but ultimately lacks the spark and energy of the best DC superhero pictures."
    },
    {
      "text": "Shazam! Fury of the Gods could be the end of the road for this incarnation of the character and while it may not be as good as the first film, it is a fine enough note to potentially leave on"
    },
    {
      "text": "While the film may not be anything hugely special overall, it is a fun romp with heart, humour and excitement to spare, and sometimes that’s all a movie needs to be."
    },
    {
      "text": "Shazam! is never more alive than it is when the talented cast gets to do their thing. In these scenes, it has the energy and freewheeling fun of any old Amblin film."
    },
    {
      "text": "Great villains and silly heroes make a move that ultimately falls flat."
    },
    {
      "text": "A boring, tiring, humorless sequel, which generally exhausts its magic box among the repetitive sequences that pile up clichés. [Full review in Spanish]"
    },
    {
      "text": "And although it is true that Shazam! The Fury of the Gods is not as well-rounded as its predecessor, it maintains the elements that made the first a good film. [Full review in Spanish]"
    },
    {
      "text": "You've got your poorly lit CGI climax, lines out of the \"Sir, this is a Wendy's\" playbook, enough product placement to qualify for a Super Bowl ad, and another appearance by \"Sabotage,\" which is evidently the only Beastie Boys song allowed in movies."
    },
    {
      "text": "Fury of The Gods leans into what worked for the first film and takes advantage of minimal exposition, though it suffers from rushed plot."
    },
    {
      "text": "Shazam! Fury of the Gods has its moments of amusement, but they are swallowed up by sequences that run too long and trying to shoehorn the natural wackiness of the first film into the second without allowing us to see any growth in Billy until the end."
    },
    {
      "text": "David F. Sandberg delivers a wholesome sequel that is harmless fun."
    },
    {
      "text": "There’s enough charm in Fury of the Gods that fans of the original should still appreciate, but it lacks the spark to keep this franchise going under the new DCU regime."
    },
    {
      "text": "What keeps the film from being a total failure are the valiant acting efforts by Mirren and Liu. This film will haunt them but they can never be accused of just picking up a paycheck."
    },
    {
      "text": "Shazam: Fury of the Gods is, very simply, a mess that should really have been better than it is, but that doesn't mean that it isn't still a lot of fun"
    },
    {
      "text": "While the performances were decent, Shazam! Fury of the Gods ultimately felt like a standard superhero package. It follows a predictable formula with a basic storyline, a few laughs, some good and bad CGI, and a decent background score."
    },
    {
      "text": "The movie falls into the trap of exaggerating what worked in the original, excessively tackling every narrative aspect, and losing authenticity along the way."
    },
    {
      "text": "Fury of the Gods tries to convince audiences that it’s a charming movie about chosen family, but it’s just a run-of-the-mill superhero flick."
    },
    {
      "text": "Zachary Levi & the whole crew gush with charm & I loved seeing that David Sandberg really brought in the mythical side of the DC UNIVERSE. I won’t go as far to say that this is perfect as it’s missing quite a few beats but I grinned ear to ear."
    },
    {
      "text": "Shazam! Fury of the Gods might be the most fun I’ve had with a superhero film for half the budget. It didn’t need $200 million dollars to feel competently made, it shines with its constraints and has a keen sense of practicality."
    },
    {
      "text": "Why do I call Shazam “down-market”? Well, in Justice League, the A-team superheroes are trying to stop the A-team super villains from destroying the world. In Fury of the Gods, Billy Batson (Asher Angel) is trying to save Philadelphia."
    },
    {
      "text": "The film is generally enjoyable, and certainly stands up better than other recent DC Comics adaptations, but there is an unavoidable sense of contractual obligation to it."
    },
    {
      "text": "This is nothing actively bad in this unmemorable sequel, but there’s nothing actively really good either."
    },
    {
      "text": "As someone who finds the first film to be the most enjoyable and balanced of the DC universe films, this film felt leaden and in search of purpose until finally finding its calling as a big-screen Skittles commercial."
    },
    {
      "text": "Overstuffed and overbearing."
    },
    {
      "text": "The truly frustrating thing about \"Fury of the Gods\" is all the potential it contains, not just its own standalone story, but how unhinged a third film could be now that so much of the setup and emotional baggage has been explored."
    },
    {
      "text": "It may boast a few impressive cast members, but with its toned-down levity & unengaging storyline, it becomes just another flat, forgettable entry that fits right in with the other bland DC films of the past decade."
    },
    {
      "text": "…Shazam 2 doesn’t aim to do much more than re-tread the ’kid that’s friends with superheroes’ theme of the original film, but the laws of diminishing returns applies…"
    },
    {
      "text": "“Shazam! Fury of the Gods” is serviceable superhero storytelling, but it’s missing the great spark of absurdity that made the first movie so engaging."
    },
    {
      "text": "Zachary Levi's Shazam is a really fun character, and it's a shame they can't find the right use for him."
    },
    {
      "text": "Shazam: Fury of the Gods is wholesome family fun but flat and very safe. Thematic arcs felt familiar, villains weren’t captivating & VFX was shoddy\n\nWith superhero films now, if you aren’t fresh, you’re forgettable."
    },
    {
      "text": "Where was I? Right: this movie is disposable junk."
    },
    {
      "text": "The low-key hang-out family movie vibe [of the first Shazam] has been ditched in favor of a bunch of loud  sound effects and glossy, lifeless CGI."
    },
    {
      "text": "Some baffling decisions made here but overall, Shazam 2 is a mostly fun time with a fair amount of heart."
    },
    {
      "text": "Shazam! Fury of the Gods is a disappointment that takes the wonderful work of the first film and has no idea what to do with it."
    },
    {
      "text": "An uneasy mixture of YA superhero flick, warmhearted family movie, and effects-laden action picture, it proves once again that more does not translate to better."
    },
    {
      "text": "Helen Mirren and Lucy Liu give it their all, but the childishness and lack of consequence renders even the coolest action sequences and effects meaningless"
    },
    {
      "text": "Where Shazam! Fury of the Gods suffers in comparison to the 2019 original is in its erratic, confused tone and swollen screenplay"
    },
    {
      "text": "...one of the worst comic-book adaptations to hit theaters in a good long while."
    },
    {
      "text": "The film has sequel-itis in the worst way. Everything has to be bigger, which totally negates the charm that the first film had."
    },
    {
      "text": "Like the first Shazam! movie, it has a warm heart and semi-believable family relationships. It certainly doesn’t take itself too seriously. It’s noisy and obnoxious, but also kind of fun."
    },
    {
      "text": "Shazam! Fury of the Gods is better than Black Adam...but I find myself forgetting it soon after it ends."
    },
    {
      "text": "The best way to sum up this review is “c’mon, guys, it’s not that bad.” I realize that isn’t exactly a ringing endorsement for a movie, but it’s good enough to provide a mildly amusing escape for a couple of hours."
    },
    {
      "text": "Unfortunately, it falls into the trap of exaggerating what worked in the original, going overboard in almost every aspect of the narrative and losing authenticity along the way. [Full review in Spanish]"
    },
    {
      "text": "What a fun hero movie, there's so much to love about this film, as the main character is heartwarming and endearing as he questions his every move."
    },
    {
      "text": "Shazam! Fury of the Gods doubles down on the same charm which made the original soar and the resulting film is a sequel that’s easily the equal of its enjoyable predecessor."
    },
    {
      "text": "While this movie is not as good as the original 2019 film, it is still entertaining in terms of action, humor and spectacle."
    },
    {
      "text": "DC has always struggled to make solid, coherent superhero movies. One of the few times they got it right was with the first \"Shazam\". Sadly, lightening fails to strike twice in \"Shazam! Fury of the Gods\"."
    },
    {
      "text": "Sandberg’s lack of interest in character development and reliance on style over substance calls back to the superhero movie era we all wish we could forget."
    },
    {
      "text": "A mistake of a movie crafted with good intentions, but completely loses the core of this family of characters with its poorly thought out antagonists and journey."
    },
    {
      "text": "Kids will like it and parents will be able to stand it, but most of the film is by the numbers, so don't expect too many surprises."
    },
    {
      "text": "Zachary Levi is annoying; Helen Mirren is wasted; nothing works as good this time out as it did before."
    },
    {
      "text": "The original film left nothing of substance for this superhero sequel."
    },
    {
      "text": "The whole concept of superhero universes, especially recently, is to create a feeling of importance, even when that really isn’t the case. So it’s weird and strangely refreshing to watch one of these where that’s 100 percent not the case."
    },
    {
      "text": "The disappointing sequel to Shazam! is the first of four leftover films that DC will release during an awkward year of transition..."
    },
    {
      "text": "There was nothing really exciting about it."
    },
    {
      "text": "The original was adorkable, and the follow-up is dismissible. Shazam! Fury of the Gods is a soul-crushing disappointment. Sandberg’s follow-up is the ultimate antonym to the original—a dull, dark, and unfunny follow-up with no magic left in the tank."
    },
    {
      "text": "Again, there’s not much new here, but the light-hearted approach – which puts Mirren’s serious turn in a  humorous light- makes all the difference."
    },
    {
      "text": "The story is uncomplicated and very straightforward, the focus on family that sits at the heart of the narrative is both engaging and impactful."
    },
    {
      "text": "The quirky humor, mostly from Jack Dylan Grazer, makes it more fun than not. Despite some baffling choices and an ending that pulled every punch, this is a sequel that offers plenty of entertainment - even if it isn't close to being spectacular."
    },
    {
      "text": "It lose some of the charm of the original by focusing on bigger set pieces, but it still delivers plenty of laughs, action, and emotion."
    },
    {
      "text": "Si estás buscando algo más allá de chistes que no siempre son cómicos, una trama sin propósito definido y personajes subdesarrollados, entonces no es la película para ti."
    },
    {
      "text": "Full of heart, warmth and charm, this is a slight, frothy follow-up that is only occasionally overly sentimental."
    },
    {
      "text": "The first Shazam! outing was a hoot. It successfully combined the endearing, goofball energy of Penny Marshall’s Big with the plucky sci-fi charm of Richard Donner’s Superman. In contrast, this bulky, effects-heavy follow-up is a joyless mess."
    },
    {
      "text": "Shazam! Fury of the Gods loses the thing that made it special."
    },
    {
      "text": "Zachary Levi is simply charmingly consistent tapping into his inner child for Billy a But, the real win for me, is the fact that there is a woman of every single age, ethnicity and skill within the young cast and the their more mature counterparts."
    },
    {
      "text": "If you're under 13 this could be fun, if you're 13-18 you're going to be like \"what is this?\" and if you're older than that, you're gonna check out."
    },
    {
      "text": "While the film almost, almost falls into the same trap the second Wonder Woman film fell in - relying too much in its final acts on dumb and confusing CGI carnage - it remains an enjoyable slice of silliness."
    },
    {
      "text": "Silly, sweet and packed with smiles, this sequel duplicates original's charm."
    },
    {
      "text": "Neither Mirren nor unicorns are enough to make this worth seeing."
    },
    {
      "text": "What are good movies like? Given the last couple of months, I'm sort of forgetting."
    },
    {
      "text": "There are few superhero movies that have lower human stakes."
    },
    {
      "text": "Fury of the Gods feels oddly empty for a film with far too many characters, coasting solely off any remaining goodwill earned by its predecessor. This narrative tries to pretend it has a heart to cover up the overabundant sense of nothing at its core."
    },
    {
      "text": "Even with its heart in the right place, the sequel feels hamstrung with studio interference... the climatic finale battle was planned early on — and for all intents and purposes works exactly as it should — but getting there is a chore."
    },
    {
      "text": "With any superhero franchise, sequels usually implore their stories to move to a bigger and grander scale. That can sometimes cause the main essence of what made the original so great to be lost in translation."
    },
    {
      "text": "The movie feels like it's unfinished, missing every trick that comes along. And although the plot has potential, it bogs down as over-complicated mythology makes it oddly uninvolving."
    },
    {
      "text": "Though narratively less focused than the first film, it delivers the trademark humor, action, and heart of the franchise, resulting in a largely fun family film."
    },
    {
      "text": "Everyone who got a kick out of the low stakes, self-contained storytelling and goofily juvenile antics on display in 2019’s Shazam! will likely be equally satisfied with its sequel, Shazam! Fury of the Gods."
    },
    {
      "text": "This sequel is not as satisfying a crowd-pleaser as the original but still delivers enough fun & laughs to make it worth seeing on the big screen."
    },
    {
      "text": "Fury of the Gods feels crammed, yet empty."
    },
    {
      "text": "It lacks the first film’s novelty value and throws away some of its innocence in a naff bit of product placement, but it retains the appeal of a comic-book tale that cares only about young viewers, not adult geeks."
    },
    {
      "text": "It's superficial and transparent, and the anecdote is clumsy and reiterative... but it's geared toward children and it may be a good time to watch with them. [Full review in Spanish]"
    },
    {
      "text": "It’s far from the worst superhero film we’ve seen in the past few years, and far from the best either. But it’s that relentless mediocrity that makes it frustrating."
    },
    {
      "text": "With one foot in comedy and the other in epic, [Shazam] doesn't know how to keep its balance.  [Full review in Spanish]"
    },
    {
      "text": "I thought the movie was delightful… it was really funny."
    },
    {
      "text": "Overall, what it makes for is a fun film."
    },
    {
      "text": "Billy’s inane babbling gets a little wearing, but the action sequences, featuring dragon-based mayhem, cyclopes and an army of formidable hell unicorns hopped up on candy, are pacy and fun."
    },
    {
      "text": "An undercooked casserole of cliched narrative elements, underdeveloped characters, juvenile humor, and a deus ex machina cameo."
    },
    {
      "text": "The heart and soul that made the first entry a success is missing this time around, in favor for a bigger, louder, and messier affair."
    },
    {
      "text": "Shazam Fury of the Gods offers absolutely nothing new or needed in the current oversaturated super-hero abyss we current reside. Jack Dylan Grazer is the only bit of merit here."
    },
    {
      "text": "Like stablemate Black Adam, Shazam: Fury of The Gods thrashes around for a reason to exist, but only finds action scenes and quips. The customary credits scenes hint at a sequel, but this might be one hero that should get lost in the reshuffle."
    },
    {
      "text": "Bombastic and cacophonous, a relentlessly overstimulating carnival that relies heavily on CGI and a crushing and clanging soundtrack to fake its ambitious scale."
    },
    {
      "text": "Despite lacking so much of what made Shazam! great, there’s fun to be had with Fury of the Gods, a movie that serves as a reminder the DCEU wasn’t all bad. It’s just a shame it never quite manages to electrify us in the same way as its predecessor."
    },
    {
      "text": "Shazam! Fury of the Gods benefits having the whole family be a big part of the film."
    },
    {
      "text": "Doesn't capture the magic of the first film, does a bad job of faking Philadelphia, and its ending is an insulting copout."
    },
    {
      "text": "Finishes VERY strong [with] payoffs to emotional beats from the original that are highly appreciated."
    },
    {
      "text": "Shazam! Fury of the Gods feels like a blatant attempt to recapture the financial success of the first Shazam film without any solid concept for a new storyline for the superheroes. It manages to lose what was great about the first one..."
    },
    {
      "text": "There is plenty to like about Fury of the Gods but not terribly much to love, and that is where this film lies: in the distinct category of enjoyable, but forgettable films."
    },
    {
      "text": "As someone who really enjoyed the first Shazam, this sequel didn’t do it for me."
    },
    {
      "text": "At least it gave us Mirren, Liu and Zegler, a trio that everyone should wish for, livening up a by-the-numbers affair."
    },
    {
      "text": "Shazam! Fury of the Gods is as close as DC will ever get to the MCU formula, which is a shame since DC seems to treat the property like a joke. This sequel tops the original in nearly every sense, from story, to pacing, to overall action"
    },
    {
      "text": "Lots of fun with bigger action sequences than the first but it had pacing issues in the 2nd act. Missed the magic of the emotional dynamic that was so present in the first film."
    },
    {
      "text": "No one wants to see the venerable Dame Helen Mirren get body slammed."
    },
    {
      "text": "The familial bond remains stronger than ever in a movie that’s not breaking the mold but follows the trajectory of its predecessor as a charming and delightful cinematic escape."
    },
    {
      "text": "A big and bubbly adventure overflowing with wisecracks, mythical creatures and, for the good people who have taken in so many foster children, an explanation for why their house keeps getting hit by lightning."
    },
    {
      "text": "Shazam 2: The Fury of Gods is more like a 90s family comedy than a superhero movie, and that's where it finds its charm. [Full review in Spanish]"
    },
    {
      "text": "Shazam returns with a generic, albeit harmless, sequel. It's fun entertainment that's only marginally less effective than its predecessor. Minimizing the \"kid as a superhero\" element for action scenes makes this indistinguishable from many other CB films."
    },
    {
      "text": "... In a drama this dumb and unaware, the buffed-up makeover seems like an insult to the same “inadequate” outsiders and weedy minorities the film pretends to champion."
    },
    {
      "text": "Unfortunately, the new sequel proves an adage: Lightning doesn’t strike twice."
    },
    {
      "text": "Too derivative from previous superhero films and too goofy to present believable characters, this movie is lost in the crack between DC slates."
    },
    {
      "text": "[Shazam! Fury of the Gods] strains too hard for laughs, which repeatedly tests the patience as gags fall flat with thunderbolt force."
    },
    {
      "text": "The charm of this movie relies heavily on Levi’s accidental superhero. He and his sidekicks bring an irreverent Gen-Z charm to the superhero template, and never take themselves or their apocalyptic predicament too seriously."
    },
    {
      "text": "The filmmakers have clearly asked themselves how to make the sequel bigger. Not better, mind you, just bigger. Well, it definitely is that. It's also fairly stale."
    },
    {
      "text": "The best thing about Shazam!  Fury of the Gods is that we get to know the other kids better, especially Jack Dylan Grazer, who plays Freddie Freeman"
    },
    {
      "text": "Shazam! The fury of the Gods invites all those DC characters, kind of the Justice League of losers, to play in a ball bit, before they're eviscerated by the new studio executives. [Full review in Spanish]"
    },
    {
      "text": "Fun, clever, smartly conceived entertainment that doesn’t take itself too seriously. What a concept."
    },
    {
      "text": "Fury of the Gods delivers a fast-paced, zesty four-colour concoction that, amongst the chaos and confusion, delivers some handy homilies on the importance of friendship, family and loyalty."
    },
    {
      "text": "Everything that worked in the original works less well in this so-so sequel, blunting even the star power emitted by its high-profile villains."
    },
    {
      "text": "Shazam 2 recaptures a simpler and classic feeling of innocence that's reminiscent of the old comics... [Full review in Spanish]"
    },
    {
      "text": "Shazam! Fury of the Gods starts strong and falls apart across its bloated running time"
    },
    {
      "text": "But Shazam! Fury of the Gods creates the perfect canvas for that flight of imagination by helping kids from many walks of life and underrepresented groups see themselves on screen."
    },
    {
      "text": "Shazam! Fury of the Gods isn’t likely to inspire such titular rage in viewers, but that’s mostly because it isn’t doing enough to warrant any kind strong response at all."
    },
    {
      "text": "It’s just a fun, action-packed, heartfelt, great time at the movies."
    },
    {
      "text": "Even if this is the last iteration for the current Shazam film franchise, the filmmakers did manage two solid entries of a classic comic book hero. Fury of the Gods is not a great sequel, but it's still a fairly enjoyable one."
    },
    {
      "text": "As with the brilliant first outing, Shazam: Fury of the Gods revels in it, even when it is affectionately making fun of itself."
    },
    {
      "text": "Action-packed but weightless, 'Shazam! Fury of the Gods' tries to charm its way through a simple-minded sequel adventure."
    },
    {
      "text": "A fun, free-wheeling and fast-paced adventure that understands what it is and executes it well."
    },
    {
      "text": "A bland, generic sequel, that’s missing the charm and sense of wonder of the original. Bigger & louder, yet messy & unmemorable. [Full review in Spanish]"
    },
    {
      "text": "Another “heroes saving people on a bridge” scene? More “superhero who doubts his worthiness” existentialism? Additional Zachary Levi? These are things that nearly no one has requested, demanded, or can enjoy."
    },
    {
      "text": "Shazam might be the hero that delivers a spark to the DCU in the future but this movie leaves you with only a flicker instead of a flame."
    },
    {
      "text": "It’s competent, uninspired swill, undone largely by the fact that it’s following up a superior first movie."
    },
    {
      "text": "Shazam! Fury of the Gods puts a talented cast out front. Levi is completely likable. Mirren brings gravitas and humor. Liu is surprisingly evil, and Zegler is amazingly magnetic."
    },
    {
      "text": "Even on its own singular terms with no promise of interconnected timelines, “Fury of the Gods” still doesn’t have the goods."
    },
    {
      "text": "It’s schtickier and less assured than the first “Shazam!” but these leftovers still reheat well enough."
    },
    {
      "text": "“Fury of the Gods” ups the action but ignores the pathos that made us care."
    },
    {
      "text": "Although the film deviates from the franchise's roots, it's still a fun ride aimed at a younger audience."
    },
    {
      "text": "Do we need to start a GoFundMe page for Helen Mirren?"
    },
    {
      "text": "It's apparent quite early that the narrative fuel mixture of Shazam: Fury of the Gods is off."
    },
    {
      "text": "'Shazam! Fury of the Gods' is a substantial step down from its predecessor, hardly ideal when the future of the entire franchise likely depends on it."
    },
    {
      "text": "Fury of the Gods is at its best when balancing its humor and drama, knowing when to throw a punch or a punchline."
    },
    {
      "text": "With the exception of a few underwritten characters, some occasional convolution, and a little late movie cringe, “Shazam! Fury of the Gods” was an unexpected treat and a surprising step up from the first film."
    },
    {
      "text": "It doesn’t skimp on action or spectacle, but it often seems to come at the cost of narrative and overall structure...The Shazamily deserves a better film to highlight their dynamic relationship than this. Just say the word, James Gunn."
    },
    {
      "text": "If you’re looking for some family friendly entertainment that still packs a punch, then this sequel has the perfect razzle dazzle to treat your senses"
    },
    {
      "text": "“Shazam! Fury of the Gods” is an epic, fun, heartfelt and engaging superhero movie that gives the genre a ray of hope."
    },
    {
      "text": "The unwieldy Shazam sequel looks terrible, lacks the original’s freshness, and struggles with its extended cast. Lightning doesn’t strike twice, it seems."
    },
    {
      "text": "The tossed-off charm of the original suffers from bloated sequelitis. It's mostly stupid kid stuff, but Zachary Levi’s comic-book invitation to shake your sillies out will be hard to resist for underserved family audiences."
    },
    {
      "text": "Laboured, unfocused and generally out of ideas. I was bored stiff."
    },
    {
      "text": "Hey, it’s better than “Black Adam.”"
    },
    {
      "text": "Shazam! Fury of the Gods is not a bad movie. Despite its flaws, it had enough humour and heart for me, and I enjoyed it. But keep in mind that it is a huge downgrade from the original. The effortless charm that was there is missing here."
    },
    {
      "text": "This manages - at least some of the time - to hang onto the charm of the first film, even if there's a little too much going on and not all the jokes land."
    },
    {
      "text": "SHAZAM! FURY of the GODS just isn’t the funny, highly entertaining moviegoing experience that it should be."
    },
    {
      "text": "The film opens with some jaw-dropping visual effects, however, films cannot sustain our interest via visual effects alone."
    },
    {
      "text": "At its core, the Shazam! movies have always been about a kid who was actually stoked about being a superhero; the other DC films could learn a little something from that very simple premise."
    },
    {
      "text": "Not as good as the first and the jokes sometimes fall flat, but there's still enough charm, heart, and electricity to make it worth a trip to the movies."
    },
    {
      "text": "They kept Shazam just weird and sincere enough, which might be enough, but there's little avoiding that Shazam! Fury of the Gods is a significant step down..."
    },
    {
      "text": "With a strong cast, thrilling action, and a riveting plot that mostly sticks the landing, this superhero film stands out as one of the best. Whether you watch it in theaters or at home, you’re almost certain to have an electrifying time."
    },
    {
      "text": "It is fun to watch but a lot of clutter and especially a lot of CGI overwhelms the plot and all-but obliterates the tenderness of the first story."
    },
    {
      "text": "So Shazam! Fury of the Gods must make time for a major DC superhero to arrive just in time and to tie back into HBO’s Peacemaker. Because, of course, studios can’t just create a movie that stands on its own."
    },
    {
      "text": "As charming and joyful as the original."
    },
    {
      "text": "... The sense of wonder has gone. Oh yeah, and the product placement is shameless."
    },
    {
      "text": "Shazam! Fury of the gods is nothing more than a fun filled wild silly goofy ride! It's a great time that the whole family will enjoy. Just know nothing is taken seriously."
    },
    {
      "text": "Batson’s alter ego muscles his way through loud, underwhelming action sequences."
    },
    {
      "text": "... The movie wants to be many things at once but doesn't delve into any of them. [Full review in Spanish]"
    },
    {
      "text": "Star super-villain casting can’t save this awkward sequel."
    },
    {
      "text": "Whereas the first Shazam! felt like a refreshing throwback to the kid adventures of the ‘80s and the superhero movies of the early 2000s, Shazam! Fury of the Gods feels like a creaky leftover of the mid-2010s."
    },
    {
      "text": "Prolific in terms of screenplay, direction, and special effects, Shazam resorts to easy jokes that feel forced... [Full review in Spainish]"
    },
    {
      "text": "All that really matters to the filmmakers is a make-it-up-as-they-go drive to lunge from one magical spectacle to another. Even compared to last year’s franchise spinoff Black Adam, the movie is insistently goofy"
    },
    {
      "text": "It goes for the same lighthearted tone and outsider approach to its hero and subject matter, but it runs low on whimsy and even lower on superhero magic."
    },
    {
      "text": "Despite it's flaws, it's hard not to recommend a movie where Zachary Levi body-slams Helen Mirren."
    },
    {
      "text": "Everyone looks like they’re having a blast in this goofy superhero franchise."
    },
    {
      "text": "As someone who loved the first Shazam! movie, I was really disappointed with this sequel. As a movie that deals largely with magic, it was surprisingly devoid of it."
    },
    {
      "text": "[Fury of the Gods] is a rushed, ugly and pointless film. Two hours after I saw it, I have forgotten almost everything about it, except for the things that irritated me. I certainly can't think of a single reason why anyone would want to sit through it."
    },
    {
      "text": "All up, the film does the job as an engaging send-up of superheros and their affectations."
    },
    {
      "text": "“Fury of the Gods” doesn’t improve on “Shazam!” or build up the DCEU in a dynamic way. Instead of excitement, the sequel feels generic and safe."
    },
    {
      "text": "Combining established characters with a very loose interpretation of Greek mythology results in a pastiche that seldom entertains. Most of the film is disconcerting and nonsensical. [Full review in Spanish]"
    },
    {
      "text": "The message of family's importance in going through life's struggles continues to be its greatest strength but this film falls short of developing the entire Shazamily to the godlike heights of Mount Olympus."
    },
    {
      "text": "An honest experience; frequently funny, and at times surprising, that ends up drowning in a sea of visual effects of uneven quality, and a couple of performances that, to my surprise, didn't quite convince. Full review in Spanish."
    },
    {
      "text": "...a frustrating case of sequel overreach after its more focused, emotionally satisfying, crowd-pleasing predecessor. It’s not outright terrible, but it’s hard to shake the feeling that we all could have had so much more fun."
    },
    {
      "text": "Lighting doesn’t strike twice for Shazam! Fury of the Gods, which is a bit of an Atlas Shrug."
    },
    {
      "text": "Zegler can do better. Levi can do better. Certainly, Mirren and Liu can do better..."
    },
    {
      "text": "The sequel, again directed by David F. Sandberg, feels less breezily funny, less fresh, less fleet of foot. In its favor, though, are some elements that lent the original its pleasures, especially Zachary Levi and his goofy efforts."
    },
    {
      "text": "If an AI ChatBot were to write and direct a superhero movie, I'd imagine it would turn out exactly like \"Shazam! Fury of the Gods.\" A movie so generic, that it was actually painful to watch."
    },
    {
      "text": "Surprisingly, bigger is indeed better in David F. Sandberg’s superhero sequel."
    },
    {
      "text": "Every franchise has its blips, but the magic has fizzled here. Lightning hasn’t struck twice, and it’s a real shame."
    },
    {
      "text": "It’s an ungainly mishmash of tones that comes together only in one bizarre, wonderful gag when a graying wizard barges into Billy’s erotic dream to deliver some very serious exposition with his head fused to Wonder Woman’s bronze-plated breasts."
    },
    {
      "text": "Fury of the Gods tries to recapture what made the first Shazam! a disarming breath of fresh air, but it just can’t quite do it."
    },
    {
      "text": "The superhero's internal dilemma in search of his identity when facing his destiny is a more interesting struggle than the last showdown in the dome. [Full review in Spanish]"
    },
    {
      "text": "Fury of the Gods pits a family of six young heroes against a mythic sisterhood of three villains—something was going to fall through the cracks. You just wish it wasn’t everything that made the first movie watchable."
    },
    {
      "text": "My eyes! My eyes!"
    },
    {
      "text": "Shazam! Fury of the Gods is one of those superhero movies that feels a little overly stuffed and overly complicated in an attempt to make it bigger and bolder than the first film."
    },
    {
      "text": "When it comes to the tone that DC films need, David F. Sandberg just might be the master...The bad news is the story gets away from him this time."
    },
    {
      "text": "In the end, whatever. Go see it if you want or don’t and leave me out of it."
    },
    {
      "text": "A mildly disappointing letdown from its noticeably more satisfying predecessor."
    },
    {
      "text": "A fun enough sequel that misses out on some of the magic of the first but still has plenty of powerful ideas up its sleeve."
    },
    {
      "text": "Not even the dynamic duo of Lucy Liu and Helen Mirren could make this bland and forgettable film even watchable."
    },
    {
      "text": "The experience of watching this new Shazam! is akin to watching an exceptionally wealthy but ultimately sweet and innocent child smash their toys together for 130 minutes."
    },
    {
      "text": "Levi retains the excellent balance of charisma, determination, and immaturity that made him such a perfect fit for the role in the first movie."
    },
    {
      "text": "Shazam! Fury of the Gods isn't quite as fun as its predecessor but the sequel is just entertaining enough to offer audiences a good time."
    },
    {
      "text": "Billy's coming of age story begins with imposter syndrome. Unfortunately, as his confidence grows, so does the movie’s tendency to clutter up the screen with busy CGI, heaping helpings of mythology and not-so-subtle product placement."
    },
    {
      "text": "It moves through its relatively hefty two-hours-plus with an admirable zip, which is doubly impressive given the fact it’s almost impossible to work out what’s going on half the time."
    },
    {
      "text": "While it’s fun to see Dame Helen Mirren play a literal god and Levi remains a highlight in the often too serious DCEU, Shazam! Fury of the Gods doesn’t retain the charm of its predecessor."
    },
    {
      "text": "Within Shazam! Fury of the Gods is an enjoyable, earnest buddy-comedy starring Jack Dylan Grazer and Djimon Hounsou. Unfortunately, you have to watch the rest of Shazam! Fury of the Gods to see it."
    },
    {
      "text": "The film reaches for the scale and sweep of a Gods and Monsters epic, but still roots it in the intimacy of a family drama."
    },
    {
      "text": "No, it's nowhere near the best of the genre, but by keeping its stakes firmly rooted within the hopes and fears of a nuclear family unit, it has a heart that many recent superhero blockbusters have been sorely lacking."
    },
    {
      "text": "So much pointless, monotonous, repetitive fantasy fighting occupies the runtime, contributing to one of the most uninteresting of all the DC entries."
    },
    {
      "text": "Shazam is the underdog that you’d like to see succeed, but sadly this outing is already out of breath before it has stepped out of the gate."
    },
    {
      "text": "Shazam! Fury of the Gods is a sequel that betters the already impressive origin tale. I am hopeful for a third."
    },
    {
      "text": "A muddled sequel that gets more tiresome by the minute despite some worthy additions to the cast."
    },
    {
      "text": "Lightning doesn't strike twice. Big plot holes, flawed villains, unrealistic continuity, disjointed action, and a detachment from the original, this film doesn't quite connect the dots for me. A watchable sequel, but Shazam lost his magic."
    },
    {
      "text": "Shazam! Fury of the Gods brings a much-needed levity, humor, and heart infusion to a comic book genre that's been dour and depressing.  The fun sequel improves on the original by taking the characters to the next logical phase of their development."
    },
    {
      "text": "An exhausting, dull and convoluted superhero comedy that's low on wit, laughs and palpable thrills."
    },
    {
      "text": "Infused with the childlike joy that made the first so enjoyable, \"Shazam: Fury of the Gods\" explores the complexities of what it means to be a hero and how everyone can be worthy if given the chance. It isn't a superpower that makes us powerful."
    },
    {
      "text": "A disappointing step down from the hilarious, moving, contained and refreshing first film. \n[Full Review in Spanish]"
    },
    {
      "text": "Disappointment awaits with Shazam 2 spilling forth as yet another tedious sample of same-same. It’s a severe case of sequelitis...Even the dragon that turns up half-way through looks like it’s on furlough from the Harry Potter franchise."
    },
    {
      "text": "Shazam! Fury of the Gods offers a substantive story, incredible performances, and three-dimensional villains that push the conflict forward in a way that makes sense."
    },
    {
      "text": "[I]t primarily functions on its own individual wave length and succeeds because of its light energy and terrific ensemble of wonderful characters."
    },
    {
      "text": "… doesn’t recapture the magic of the original, but it has enough tricks up its sleeve to justify its existence."
    },
    {
      "text": "The best parts of this new movie are drowned out by pointless CGI monsters and tedious action sequences."
    },
    {
      "text": "Fury of the Gods is overloaded, so while the film is never dull it’s also wildly incoherent."
    },
    {
      "text": "An overlong but reasonably fun and action-packed sequel."
    },
    {
      "text": "It’s a testament to returning director David F. Sandberg that he manages to present us with visual stimulants that still manage to surprise in a time when comic book proceedings feel entirely telegraphed."
    },
    {
      "text": "Shazam! Fury of the Gods loses much of the charm of 2019's Shazam!, by overloading on bad jokes, cluttered storylines, and formulaic action scenes. It's a failed attempt to be a wisecracking, high-quality superhero movie."
    },
    {
      "text": "Shazam! Fury of the Gods is a worthy follow-up that expands on DC mythology in exciting ways."
    },
    {
      "text": "Coasts on the residual good vibes and talented cast of its much-superior predecessor."
    },
    {
      "text": "May be a shoddily made Skittles ad masquerading as a superhero riff, but it’s Levi’s performance that sends it into the stratosphere of cringe. Here’s hoping this is not only Shazam’s last outing but the nail in the coffin of the smarmy superhero as well."
    },
    {
      "text": "It might just be DC's most endearing superhero film. It hearkens back to the days of reading a stack of comics on your bed for an afternoon that never seemed to end."
    },
    {
      "text": "Despite the humor, the story didn’t grab me the way the first film’s did. Still, Shazam! Fury of the Gods is still entertaining enough to make for a fun time at the movies."
    },
    {
      "text": "Shazam! Fury of the Gods never forgets to have fun, even if it ends up being a somewhat slight adventure."
    },
    {
      "text": "Messy and mirthless, it resounds as the death knell for this interconnected cinematic enterprise’s current iteration."
    },
    {
      "text": "A super solid, super fun and super smart blend of hilarity, heart and heroics, it’s a super-powered sequel that packs a punch."
    },
    {
      "text": "Shazam! Fury of the Gods feels like another safe step to develop the DCEU, so it fails to spark genuine excitement."
    },
    {
      "text": "Shazam! Fury of the Gods makes a good case for being true to the goofy spirit of the source material instead of trying to fit every comic book adaptation into the self-serious style demanded by adult fanboys on social media."
    },
    {
      "text": "Employing the same mix of humor and heart, but really amping up the super-heroics as it were, this second edition bodes well for its future in the uncertain DC Universe, at least in terms of delivering on what finicky fans expect."
    },
    {
      "text": "This is a fun, family-friendly superhero film -- still set firmly within the DCEU -- that has all the action and laughs you’d want, even if the emotion is slightly lacking this time around."
    },
    {
      "text": "Shazam! Fury of the Gods is a superhero romp that doesn't try to reinvent the wheel, and works as a goofy Ray Harryhausen-inspired adventure."
    },
    {
      "text": "Shazam! Fury of the Gods offers fans of the first film more of the same: a family-friendly action adventure with humor and heart. And that’s not a bad thing."
    },
    {
      "text": "Shazam! Fury of the Gods fairly panders to the under-13 set. But Levi still works his chatterbox charm, and the movie maintains an appealingly easy-breezy tone (aside from the occasional impaling)."
    },
    {
      "text": "Shazam! Fury of the Gods is a film with close-to-zero nutritional value."
    },
    {
      "text": "Fury of the Gods lands in the frustrating middle: a film that isn’t without promise, but feels far too messy and corporatised to have any real affection for."
    },
    {
      "text": "A breezy, frequently charming outing that delivers where it counts."
    },
    {
      "text": "In terms of representation, you couldn’t ask for more. And that’s just as well, because in terms of entertainment, you could barely get less."
    },
    {
      "text": "It has a lot of good ideas, but has difficulty weaving them into a coherent story."
    },
    {
      "text": "Between a sequence that feels like a direct Skittles commercial, and a pandering attempt to bring another hero into this film, Fury of the Gods will likely leave you rolling your eyes more than it’ll have you cheering or laughing."
    },
    {
      "text": "Fury of the Gods is fun, emotional, and exactly why we love Billy Batson and Shazam!"
    },
    {
      "text": "With its fun family dynamic, dangerous new villains, and heartwarming storyline, it’s another solid follow-up to the Shazam! series."
    },
    {
      "text": "You certainly won't leave the theater a changed DC fan, but you will leave with a smile on your face. If you can look past the uncertainty of the Shazamily's future, Shazam! Fury of the Gods is a delightful ride and a worthy follow-up to the first film."
    },
    {
      "text": "A fun, kid-friendly follow-up to director David F. Sandberg’s 2019 charmer..."
    },
    {
      "text": "There's a sense when you watch 'Shazam! Fury of the Gods' that even if you walk out of the cinema and half of the movie is gone from your mind by the time you get to your car, you'll have still enjoyed yourself."
    },
    {
      "text": "I have to say that we don’t entirely break free of the superhero-movie template, but Shazam two has a just-out-of-the-fridge orange juice taste that makes it likable."
    },
    {
      "text": "This follow-up lacks much of the appeal of its predecessor. While the film provides the elaborate action set pieces, colorful villains and save-the-world plot mechanics expected of the comic book movie genre, some of the magic is missing."
    },
    {
      "text": "While it has some moments to keep superhero fans midly entertained, Shazam! Fury of the Gods is a lacklustre finale of sorts to the ill-fated DCEU"
    },
    {
      "text": "Those willing to go along with Billy's patchy journey just might find themselves entertained by what this DC sequel has to offer."
    },
    {
      "text": "Shazam! Fury of the Gods may not pull the heartstrings like its predecessor, but there’s no shortage of the chaotic good humor and energetic performances that put Billy Batson and the Shazamily on the map."
    },
    {
      "text": "While “Shazam! Fury of the Gods” doesn’t entirely recapture the giddy fun of the first film, its humor, sweetness, and delightfully human heroes remaining bright spots in a genre too often obsessed with the dark and the gritty."
    },
    {
      "text": "The real story here is that a superhero saga that seemed to hold out possibilities of lifesize quirkiness and delight winds up getting squashed into the shape of any other superhero franchise."
    },
    {
      "text": "A highly enjoyable superhero adventure that hits the right emotional beats while providing a few belly-laughs in the process. It's not without its problems, but if you were a fan of the first one, you're guaranteed a good time at the movies this weekend."
    },
    {
      "text": "Bigger, weirder, and just about funnier than the first, the second Shazam! remains entertaining despite some tiresome plotting."
    },
    {
      "text": "Like 1st Shazam, excellent family movie!  The movie is very funny and action packed with great VFX. Kids will be delighted, kids at heart will also have a great time. Helen Mirren is the stand out, amazing since she said she didn't understand the script."
    },
    {
      "text": "Shazam! Fury of the Gods is a step down from its predecessor, but it means well."
    },
    {
      "text": "SHAZAM! FURY OF THE GODS can’t quite keep up with the emotionality, thematic density and simply the freshness and joy of the first part, but it’s still a pretty enjoyable and character-driven superhero film."
    },
    {
      "text": "At the risk of sounding corny, it's all about family, baby. It's not just Billy's family dynamic this time around, but that of the villains too. It made me cry, but it made me laugh harder. Takes what worked in the first movie and dials it up to 11!"
    },
    {
      "text": "Shazam! Fury of the Gods has good and bad points, but when you come right down to it, it is a decent film that includes a star-studded cast, a cool, evil dragon, and Zachary Levi!"
    },
    {
      "text": "... A sequel that solidifies and elevates everything that works in the first film to deliver an entertaining, memorable, and gratifying experience. [Full review in Spanish]"
    }
  ],
  "release_year": 2023,
  "duration": 130,
  "genres": [
    "Action",
    "Adventure",
    "Comedy",
    "Fantasy"
  ],
  "age_rating": "PG-13",
  "synopsis": "From New Line Cinema comes \"Shazam! Fury of the Gods,\" which continues the story of teenage Billy Batson who, upon reciting the magic word \"SHAZAM!,\" is transformed into his adult Super Hero alter ego, Shazam.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/A3ZbZsmsvNGdprRi2lKgGEeVLEH.jpg"
}