{
  "movie_name": "Silver Linings Playbook",
  "movie_id": "silver_linings_playbook",
  "total_reviews": 260,
  "reviews": [
    {
      "text": "Russell’s adaptation illustrates a heartwarming and hilariously realistic tale that has complications but creates such an overall admiration for the film and its characters."
    },
    {
      "text": "Russell has provided us with a smart, satisfying antidote to the anti-rom-com. I think it’s safe to say success suits him pretty well."
    },
    {
      "text": "Fueled by unexpected dramatic turns and a gamut of oddball hang-ups that set the comic tone, Silver Linings Playbook marks another decisive triumph for David O. Russell, who’s made both the funniest film and the most heartening romance in recent memory."
    },
    {
      "text": "It’s a sharp romantic comedy that avoids the usual pitfalls associated with the genre today – that is right up until the end."
    },
    {
      "text": "What really sells \"Silver Linings Playbook\" are Cooper and Lawrence's incredible performances and chemistry."
    },
    {
      "text": "A romantic salad with a dressing for the masses. [Full review in Spanish]"
    },
    {
      "text": "A terrific, if slightly less punchy, follow-up to writer-director David O. Russell's The Fighter."
    },
    {
      "text": "Takes the audience through the emotional wringer but sends them out of the theater on a high note."
    },
    {
      "text": "Frustrating as it can be to watch, nixing nuance for a heavy-handed storyline that convinces viewers of Pat and Tiffany's humanity is forgivable."
    },
    {
      "text": "It's Lawrence's turn as Tiffany that will likely get the most praise, once again revealing her versatility and range."
    },
    {
      "text": "Robert De Niro finally once again finds a film worthy of his talent."
    },
    {
      "text": "This is a truly delightful comedy drama. [Full review in Spanish]"
    },
    {
      "text": "David O. Russell's eccentric Philly-cheesesteak screwball comedy leaves me cold, but may prove to be his big crossover hit."
    },
    {
      "text": "You have crazy, raised by crazy, befriended by crazy, thinking crazy, advised by crazy, dreaming crazy, and in love with crazy all happening in a crazy city of of crazy sports fans."
    },
    {
      "text": "Russell has adapted the script to highlight the difficulties of the characters - whether it is mental illness, friendship problems or just plain closure - to a bittersweet effect."
    },
    {
      "text": "In Silver Linings Playbook, David O. Russell sets his dysfunctional love story against a working class neighborhood in Philadelphia and he totally nails it."
    },
    {
      "text": "This is a movie worth any movie lover's time and money."
    },
    {
      "text": "Although Silver Linings Playbook is high-concept fare, it doesn't feel formulaic. The story unfolds with such loopy, oddball energy that you almost forget it's a romantic comedy."
    },
    {
      "text": "Fans of Russell's earlier films might lament his new career path as him selling out, but doing so doesn't give him enough credit. His work is still subversive, but now it's getting him better results."
    },
    {
      "text": "A perfect storm of great writing and expert performances working in tandem, a rare romantic comedy with both a heart and a brain that rings painfully and beautifully true."
    },
    {
      "text": "It's charming and challenging, even as it starts to conform to the romantic comedy playbook."
    },
    {
      "text": "Despite its flaws, it's got romance AND sports AND funny family drama AND a really hilariously amazing can't stop laughing about it dance scene."
    },
    {
      "text": "Though Silver Linings deserves credit for its portrayal of the middle ground of mental illness, it's as much of a mess as its characters, veering between tone-deafness and deep sympathy, convincing portrayal and cheap cliché."
    },
    {
      "text": "Lawrence, so good in Winter's Bone, comes as a revelation."
    },
    {
      "text": "One of the most charming Hollywood screwball comedies of recent years."
    },
    {
      "text": "In any event, this is a refreshing and extremely well-acted film."
    },
    {
      "text": "The movie is a mess, but a glorious, big-hearted, beautifully acted one."
    },
    {
      "text": "Despite the film's flaws, Russell excels at creating a community of misfits around Pat and Tiffany."
    },
    {
      "text": "Silver Linings Playbook may well be my favourite movie of the year. Go see it. Like, right now."
    },
    {
      "text": "Cooper manages to show that he is still capable of doing more than his traditional throw-away, comedic roles."
    },
    {
      "text": "Although the story sometimes drags and the predictable rom-com ending feels too pat, \"Silver Linings Playbook\" scores some intriguing insights into what mental illnesses we consider socially acceptable."
    },
    {
      "text": "Thanks to some truly terrific acting and amusing subplots with Pat's parents, the story works."
    },
    {
      "text": "Playing outspoken, emotionally damaged young widow Tiffany, Lawrence is a firecracker, a powder keg, a force of nature."
    },
    {
      "text": "Silver Linings Playbook is difficult to like, and too long, with a climactic dance scene that is filmically botched, which is fine with the movie because according to the plot it did not have to be good to succeed."
    },
    {
      "text": "Russell's smart, snappy script is delivered by a top-notch cast, including two thoroughly likeable and well-matched leads."
    },
    {
      "text": "Once Silver Linings Playbook gets close to Lawrence, it doesn't have to crowd her again...She holds up her head, breathes hard and glows."
    },
    {
      "text": "Silver Linings Playbook gives us four performers to relish."
    },
    {
      "text": "It's a challenging picture, but it runs the gamut of emotions so well that it's nearly impossible to dislike."
    },
    {
      "text": "Wouldn't it be great if mental illness really was as adorable as it is in the movies?"
    },
    {
      "text": "\"Silver Linings Playbook\" makes comic hay from bipolar illness, early death, sexual adventurism, self-improvement binges, football fanaticism, degenerate gambling and father-son estrangement, as one would expect from latter-day Russell movies."
    },
    {
      "text": "But Silver Linings Playbook never induces a roll of the eyes, even if it never really surprises."
    },
    {
      "text": "In an age when the concept of comedies about possible kinships between characters is dominated by sugary devices and contrivance, here at last is a movie about real situations, real people and the natural experiences that evolve from them."
    },
    {
      "text": "A unique dramedy that stands heads and shoulders above most romantic films."
    },
    {
      "text": "A wild mess, but what a mess it is."
    },
    {
      "text": "It finds the gentle balance between traditional romantic comedy and artistic exploration of the laws of attraction."
    },
    {
      "text": "A romantic comedy for people who don't like what Hollywood has been calling 'romantic comedies' these days."
    },
    {
      "text": "One of the most pleasurably offbeat experiences since the Philadelphia Eagles last enjoyed a winning season."
    },
    {
      "text": "A deft treatment of its delicate subject material and some remarkable performances that give the film both touching, raw, authentic emotion and a certain kinetic humor."
    },
    {
      "text": "Jennifer Lawrence is the only aspect of the film that truly lives up to the trumped-up awards buzz and hype, but being a perfectly enjoyable light comedy with heaps of heart is no small feat in itself."
    },
    {
      "text": "I love the work that deNiro and Lawrence do here, but ultimately all they do is prove the old adage that you can cover up a lot of problems with the script by hiring good actors."
    },
    {
      "text": "\"Silver Linings Playbook\" could not be a more awkward love story. But I loved every second of it!"
    },
    {
      "text": "Silver Linings Playbook looks like your run-of-the-mill wacky family comedy, but it's an important film and a great one that deserves to sweep the awards it's nominated for."
    },
    {
      "text": "Silver Linings Playbook is defined by the positive decisions that are made in the face of imperfection, desperation, and the desolate wasteland of your world in pieces."
    },
    {
      "text": "Director David O. Russell forms a unique and incredible romance dramedy..."
    },
    {
      "text": "There is some charm to the story, but the final act is very neat, predictable, contrived, and not up to originality of the first two."
    },
    {
      "text": "Director David O. Russell is a little too chipper at times - breaking a restraining order is really no joke - but he brings a breeziness to this likeable tale of two misfits trying to make it work."
    },
    {
      "text": "It may be a Hollywood comedy, but it's one that feels beautifully alive."
    },
    {
      "text": "On the surface Silver Linings Playbook is a raucous romantic comedy, but its real interests are superstition and delusion."
    },
    {
      "text": "A volatile mix of familial drama and madcap comedy, infectious optimism and razor-wire wit, it's one of the most purely enjoyable films released in the past twelve months."
    },
    {
      "text": "Parece desistir de qualquer traço de originalidade em seu clímax, quando se entrega a todos os clichês do gênero: mal-entendidos, mocinhos obrigados a correr atrás da mocinha pela rua e, claro, o insuportável travelling circular do beijo romântico."
    },
    {
      "text": "I suppose the phrase 'serious romantic comedy' sounds like a paradox. But that's exactly what 'Silver Linings Playbook' is: an intelligent, edgy dark comedy with romance at its core."
    },
    {
      "text": "This is a rom-com dressed up as an Oscar-baiting \"dramedy\". It's a good rom-com thanks to it's edge... but occasionally has the bad traits of a bad rom-com."
    },
    {
      "text": "Silver Linings Playbook puts the \"fun\" in \"dysfunction.\" And sure, that sounds glib, but actually, it's a rather extraordinary achievement. Especially when you're skirting on the edges of sanity."
    },
    {
      "text": "A bittersweet pill that's a mixture of an endearing family drama and modern romance that's an absolute delight."
    },
    {
      "text": "tows the line of conventional, feel-good Hollywood rom-com, albeit dressed up in just enough art-house quirk to make it feel like something slightly radical"
    },
    {
      "text": "A reminder that 'sanity' doesn't make your flaws any more orderly."
    },
    {
      "text": "Silver Linings Playbook is a fine, funny film, and one that should charm viewers who haven't been tricked by all those Oscar nominations into anticipating it as some kind of world-changing work of art for the ages."
    },
    {
      "text": "David O. Russell's latest buzz film straddles a fine line between farce and kitchen-sink drama before settling into a groove that gets under one's skin."
    },
    {
      "text": "It starts to fray about halfway through as it shifts into a more conventional mode, taking on the usual trappings of the genre and making its way to a predictable resolution"
    },
    {
      "text": "Both charming and gritty... Cooper is edgy, while Lawrence is dynamite"
    },
    {
      "text": "If there's one reason why you should see this film, it's to admire the wonderful performances from Bradley Cooper and Jennifer Lawrence."
    },
    {
      "text": "Cooper and Lawrence Shine in Linings."
    },
    {
      "text": "Writer-director Russell is just the guy to bring out (and then calm) the manic dysfunction in these folks."
    },
    {
      "text": "Down-to-earth, funnier than you'd expect, and sympathetic toward its volatile, damaged characters."
    },
    {
      "text": "Just the sheer number of characters flitting around, each scrambling for plot space, gives an idea of just how frantic this movie can be. But Russell expertly uses all of it for maximum emotional -- and sometimes physical -- impact."
    },
    {
      "text": "Yes, the marketing presents it as a big broad comedy -- and it certainly is -- but it's also a unique and involving tale of two outsiders who together find a way to get on with life after it has dealt them some bad hands."
    },
    {
      "text": "The absence of bigger social and psychic realities in Silver Linings Playbook is a serious artistic failing."
    },
    {
      "text": "Cooper and Lawrence radiate off each other as they run both physically and mentally away from (and towards) each other."
    },
    {
      "text": "A cinematic high-wire act that audaciously blends edgy comedy together with genuinely touching drama into one of the most purely and surprisingly entertaining movies of the year."
    },
    {
      "text": "It's tough to go wrong when your movie features two of the hottest stars, but director David O. Russell doesn't stop there."
    },
    {
      "text": "When Lawrence and Cooper are together, their chemistry jumps and sparks and their rat-a-tat psycho-banter aims for Cary Grant and Rosalind Russell territory."
    },
    {
      "text": "Director David O. Russell, who adapted the novel, and his cast fill the story with engaging, believable characters."
    },
    {
      "text": "Fine mainstream sitcom material."
    },
    {
      "text": "Writer-director David O. Russell keeps the audience guessing. He takes unexpected twists and turns as if defying you to guess what will come next."
    },
    {
      "text": "Consistently engaging, funny, and touching. This is the kind of picture in which two hours of running time whiz by in a flash."
    },
    {
      "text": "Silver Linings Playbook is the best movie of 2012 and the acting is mind-boggling good. Give me the Oscar picks, and it wins in every nominated category."
    },
    {
      "text": "Succeeds less on the merits of aesthetics than its willingness to give in to crowd-pleasing effervescence."
    },
    {
      "text": "A quirky, dramatic and totally entertaining movie that features someof the best acting of the year."
    },
    {
      "text": "Having gone from unknown actress to Oscar nominee to \"The Hunger Games\" in what seemed like a blink of an eye, Lawrence shows herself a master of timing and plays off Cooper brilliantly."
    },
    {
      "text": "Silver Linings Playbook doesn't settle for the routine or the cliché. It's a funny drama about imperfect people looking for love. It also happens to be the best romantic comedy in years."
    },
    {
      "text": "It's a rom-com that succeeds in revitalizing that discredited genre where so many others have failed, injecting it with the grit and emotion of realist drama rather than with amped-up whimsy or social satire or montages of people walking on the beach."
    },
    {
      "text": "Unique, beguiling, and occasionally frustrating: These descriptions equally apply to Silver Linings Playbook and its two central characters."
    },
    {
      "text": "A crazy beaut of a comedy that brims with generosity and manages to circumvent predictability at every turn."
    },
    {
      "text": "Russell keeps the outcome interesting; he knows that every silver lining has a cloud."
    },
    {
      "text": "A feel-good film filled with laughs and memorable performances, David O. Russell's Silver Linings Playbook leaves you so ecstatically happy that it might just be the most recommendable movie of 2012."
    },
    {
      "text": "The plot is clever and a bit unconventional. Bradley Cooper, Jennifer Lawrence and Robert De Niro all turn in wonderful performances in this very funny, very warm comedy."
    },
    {
      "text": "During its rocky road to becoming a fractured love story, Silver Linings Playbook and its great ensemble cast run a funny, conflict-mined, even suspenseful path. It's a total winner."
    },
    {
      "text": "Unlike the usual run-of-the-mill rom-com, this film bristles with life from the central core of the love story, to the quirky band of supporting players who add to the fun."
    },
    {
      "text": "With \"The Silver Linings Playbook,\" Russell picks up the traditional quirky rom-com genre and shakes it around, just to see what happens. Where it's going is fairly predictable; how it gets there isn't."
    },
    {
      "text": "A tenderhearted tale about two terribly wounded souls who survive by grudgingly leaning on each other's shoulder."
    },
    {
      "text": "Your best bet for a movie that will entertain you, make you laugh and maybe even make you tear-up."
    },
    {
      "text": "Russell handles the shifts in tone extremely effectively, and has sacrificed little of his sardonic edge in crafting something this superficially accessible."
    },
    {
      "text": "Funny without being glib, serious without being pretentious or depressing, this is a mature movie with fully realized characters and fine performances."
    },
    {
      "text": "Cooper gives a fine performance in a difficult role, but the one who really shines is Lawrence. Beautiful and sexy, she should be up for awards for this one."
    },
    {
      "text": "The movie itself is bipolar, full of mounting tension and hilarity like a classic screwball comedy, but it's all just barely skimming above a deep layer of darkness."
    },
    {
      "text": "Pat's rhyming relationship with Pat Senior makes the son (played by Bradley Cooper) different from the many other movie manboys you've seen in the past couple of years."
    },
    {
      "text": "delivers the kind of sharply timed laughs that Sturges and Wilder would've appreciated"
    },
    {
      "text": "There's a lot to like here and with strong performances all-around, a fresh script with characters that sound and act real. Add this film to your essential Oscar viewing game plan."
    },
    {
      "text": "Loaded with pleasant surprises, this adaptation of Matthew Quick's novel combines romantic comedy, dysfunctional family woes and a sense of danger without ever losing its way."
    },
    {
      "text": "One hundred percent predictable, yet strangely kind of fun."
    },
    {
      "text": "It's honest you see; and honestly, as any fule no, is the bedrock of any successful relationship whether it be between two homo fictives or an audience and their movies."
    },
    {
      "text": "...recalls the screwball psychiatry of Russell's earlier efforts, only this time the farce has heart."
    },
    {
      "text": "'Screwball' is a slang term for 'crazy,' and perhaps this is what inspired writer-director David O. Russell to literalize as well as update the screwball comedy genre here..."
    },
    {
      "text": "Writer-director David O. Russell's out-of-control filmmaking style is perfectly suited to a romantic-comedy involving mental illness, and he infuses the film with a sparky unpredictability that's echoed in the perfectly graded performances of the cast."
    },
    {
      "text": "Smart, funny, great performances"
    },
    {
      "text": "Indeed the movie does make you feel quite good about humanity as the final credits roll."
    },
    {
      "text": "...ultimately unable to wholeheartedly become the feel-good romantic comedy that Russell has clearly intended..."
    },
    {
      "text": "Offers the satisfaction you'd expect from a romcom and feel-good sports movie, but Lawrence and Cooper's delicate treatment of their characters makes it far more than a fleeting source of entertainment."
    },
    {
      "text": "Cooper is terrific as a bipolar depressive ( ... ) and Jennifer Lawrence is quite fearsome as Tiffany. Unfortunately, there's also something off-balance about the whole enterprise which repeated American football references will not correct in the UK."
    },
    {
      "text": "Silver Linings Playbook remains a very classy, acceptably funny slice of comic drama. But that eventual cop-out feels deeply unsatisfactory."
    },
    {
      "text": "Easily overcomes its familiar beats, thanks to a real attention to character detail, a nonjudgmental approach to all the flaws plaguing the players, and a cast that works beautifully together."
    },
    {
      "text": "[H]alf thrilling, as it always is when a movie does well something The Movies don't typically try to do at all, and half uncomfortable, because it's not always easy to watch."
    },
    {
      "text": "Love is not perfect, but it beats the next best thing"
    },
    {
      "text": "This is a date movie that caters to the needs of both men and women: American football and comedy, ballroom dancing and romance. Silver Linings Playbook covers all those bases -- and rises above them too."
    },
    {
      "text": "Seeing it a second time has made me love it even more, not always the case."
    },
    {
      "text": "A charming, touching and funny film, which sits near the top end of the rom-com world."
    },
    {
      "text": "There are times when it does something new with the genre - and it does make you care about the protagonists."
    },
    {
      "text": "A feelgood film that doesn't avoid life's harsh realities, Silver Linings Playbook is heartwarming winter treat."
    },
    {
      "text": "A funny, believable film about the ability of even the damaged and imperfect to earn a little happiness."
    },
    {
      "text": "... a terrific ensemble comedy about mental illness that achieves just the right balance of humor and poignancy without trivializing or exploiting the affliction at its center."
    },
    {
      "text": "If The Fighter, was Russell's take on a sports movie, then Silver Linings Playbook is his version of a romantic comedy, and a delightfully twisted one at that."
    },
    {
      "text": "\"Silver Linings Playbook\" is a Hollywood romantic comedy made to mask the horrific downside of mental illness while still giving the audience a little sense of superiority as they walk out of the cinema."
    },
    {
      "text": "Silver Linings Playbook is all things to all moviegoers. Please join the queues circling the blocks."
    },
    {
      "text": "It should be unwatchable. But in the sure hands of America's most effervescent humanist director, David O. Russell, it's unmissable."
    },
    {
      "text": "A man's bi-polar disorder is supposed to give license to implausible and contrived histrionics."
    },
    {
      "text": "Silver Linings Playbook is always interesting and full of humanity in all its shades. It has plenty of black humour and it's superbly acted."
    },
    {
      "text": "Might at first look like proper cinema red in tooth and claw, but underneath it's a bundle of matted fleece and bleating."
    },
    {
      "text": "A hugely enjoyable, warm-hearted romantic comedy-drama with a refreshing honesty towards its subject matter and a pair of terrific performances from Bradley Cooper and Jennifer Lawrence."
    },
    {
      "text": "This is a date movie that doesn't offer the sophistication it thinks it does, but is as enjoyable and good-natured as the genre requires."
    },
    {
      "text": "Certain movies are sprinkled with pixie dust, an indescribable concoction that infuses scenes with irresistible magic; Silver Linings Playbook is practically hand-rolled and deep-fried in the stuff."
    },
    {
      "text": "Silver Linings Playbook paves a highly entertaining road to recovery for its characters - one you will be glad to have helped sponsor."
    },
    {
      "text": "With a truly awkward script and no chemistry between the leads this Thanksgiving arrival is a turkey."
    },
    {
      "text": "While one respects the film for trying to juggle disparate tones, it never manages to find the proper balance."
    },
    {
      "text": "Now, this isn't your typical rom-com. This doesn't have Sandra Bullock acting like an idiot for 90 minutes. This is a smart, edgy, brutally honest romance that will shake you up, but will have you hoping these characters will end up with each other."
    },
    {
      "text": "An interesting drama with a wonderful cast (especially Jennifer Lawrence), though it never quite reaches the depth and richness it strives for."
    },
    {
      "text": "Russell crafts a Baker Act romance playing loose and eccentric with the genre. The banter is spikier, wacky sidekicks have issues, too, and Pat and Tiffany's obstacles aren't fluff. The screws are tighter, and the movie is a ball."
    },
    {
      "text": "An edgy romantic dramedy that suits our anxious times."
    },
    {
      "text": "Lawrence's bold performance and her fearlessly sexual character are more than Russell knows how to harness."
    },
    {
      "text": "An intelligent and well-crafted film that seeks to inspire audiences by finding the humor amid the prevailing bittersweetness of life."
    },
    {
      "text": "Speaking of Oscars, the great DeNiro is great once again here."
    },
    {
      "text": "With leads as winning as Cooper and Lawrence, and Russell's signature mix of clever and sincere dialogue, the hook is set."
    },
    {
      "text": "This meaningful film keeps the laughs, giddy anxiousness and warm butterflies from the trailer and sustains it all through two full hours of a love story."
    },
    {
      "text": "Lawrence, in her most high-low, sad-comic turn yet, is remarkable."
    },
    {
      "text": "Until the characters can take their needs seriously and laugh at themselves, at least a little, they're not going to be healthy. Playbook traces all their journeys from stubborn self-assertion to a fragile connectedness that might lead to lasting bonds."
    },
    {
      "text": "With bold camera moves and jumps between scenes, there's an antic quality to \"Silver Linings Playbook\" that reaches all the way back to such 1930s screwball comedies as \"Bringing Up Baby.\""
    },
    {
      "text": "It shouldn't work - there's just too much going on. But it does. Spectacularly. Go see it."
    },
    {
      "text": "Just the sort of rom-com you'd expect from a director who once came to blows with George Clooney."
    },
    {
      "text": "This is a really funny film with some great performances, but sadly the second half shows that Russell lost track of what was important in the story. This still balances out to a good movie, [but] it could have been great had it stayed on course."
    },
    {
      "text": "The film is at once heartfelt and funny, farcical and sincere, and packed with performances that pull off that difficult balancing act. In short, it's a masterpiece."
    },
    {
      "text": "There's nothing wrong with the overrated Jennifer Lawrence that some serious acting lessons couldn't improve. The rest of the actors are pretty much on their own."
    },
    {
      "text": "For a movie that seems at times to have no idea what it's trying to do, \"Silver Linings Playbook\" is compulsively watchable."
    },
    {
      "text": "Unlike typical romantic genre fare, its jagged edges will make the characters and film a challenge for some viewers, which is the reason why others embrace it."
    },
    {
      "text": "Sharp of tongue, generous of spirit, Silver Linings Playbook is a jagged, loopy romantic comedy about \"crazy\" people that insists, deep down, we're all a little nuts."
    },
    {
      "text": "\"The Silver Linings Playbook\" defies categorization: it's both comedy and drama, without fitting neatly into either genre."
    },
    {
      "text": "The film is just as clumsy about psychological issues as Hollywood movies generally are, but Jennifer Lawrence's performance makes all that moot."
    },
    {
      "text": "David O. Russell's latest entertaining ode to lovable characters you should probably be afraid of."
    },
    {
      "text": "Going deep without resorting to trick plays, the sure-handed \"Silver Linings Playbook\" scores on every possession."
    },
    {
      "text": "Some movies are so likable, so naturally charming, that you'll forgive any dopey idea they throw at you."
    },
    {
      "text": "David O. Russell has pulled off a tricky feat here, finding just the right tone in crafting a romantic comedy whose sweethearts suffer from bipolar disorder and depression."
    },
    {
      "text": "Silver Linings Playbook isn't perfect - the ending is untidy - but it may just be the year's best comedy."
    },
    {
      "text": "Pretty much a miscalculation from beginning to end."
    },
    {
      "text": "Silver Linings Playbook is a rare thing indeed - a romantic comedy that completely delivers on both sides of the equation."
    },
    {
      "text": "A deliriously funny and disarmingly poignant love story that's sure to brighten the outlook of even the hardest cynic."
    },
    {
      "text": "A well-paced and whip-smart screenplay."
    },
    {
      "text": "Russell's deft writing, and the ensemble cast, keep it light and entertaining."
    },
    {
      "text": "The ending is a bust, but there's a wealth of good stuff here."
    },
    {
      "text": "Cooper and Lawrence have a nice, believable chemistry, and by the time they get to the dance competition it's surprising how tense it is and much you are rooting for them."
    },
    {
      "text": "Jennifer Lawrence is the standout in a tonally uneven, eccentric romantic dramedy that fuses The Fisher King with Romy And Michele's High School Reunion."
    },
    {
      "text": "Tinged with shadows and ignited by Lawrence and Cooper, Silver Linings Playbook raises the bar on romantic comedy. It's crazy good."
    },
    {
      "text": "It's lopsided and spotty, but it's alive in a way that suddenly makes you remember to what degree most Hollywood movies aren't."
    },
    {
      "text": "Unlikely and engaging, this quirky, off-beat romantic dramedy is a cheerfully enjoyable crowd-pleaser."
    },
    {
      "text": "Silver Linings Playbook is Cooper and Lawrence's show."
    },
    {
      "text": "With Silver Linings Playbook, David O. Russell has again recalibrated, and achieved the quirky yet poignant balance of his best early work."
    },
    {
      "text": "David O. Russell is screwing with us. He's seeing how many indie rom-com tropes he can juggle at the same time and still make it work, with one big twist: Brad Cooper is the Manic Pixie Dream Girl with a penis."
    },
    {
      "text": "It's smart, edgy, and filled with some of the best performances of the year"
    },
    {
      "text": "Offbeat dramedy mixes light and dark; some intense moments."
    },
    {
      "text": "What starts off as a serious examination of mental illness turns into an entirely different movie, one with nearly the exact same third act as \"High School Musical.\""
    },
    {
      "text": "Contrived, but beautifully cast and very entertaining."
    },
    {
      "text": "Pat and Tiffany's love story may only be possible in the movies, but damned if the actors don't make it seem real."
    },
    {
      "text": "The title is the only clunky thing in this smart, witty film. Cooper & Lawrence find the balance between being likable and making us queasy. De Niro & Weaver are miraculous."
    },
    {
      "text": "It's Lawrence who knocked me sideways. I loved her in Winter's Bone and The Hunger Games but she's very young - I didn't think she had this kind of deep-toned, layered weirdness in her."
    },
    {
      "text": "David O. Russell returns to his distinctive brand of neurotic screwball comedy, and like his early features Spanking the Monkey and Flirting With Disaster, this one somersaults giddily from sanity to insanity to sanity again."
    },
    {
      "text": "Consistently funny and, as it builds to its conclusion, also very sweet fun."
    },
    {
      "text": "\"Silver Linings\" feels different and fresh, also sincere."
    },
    {
      "text": "It's tiresome to hear reviewers hyping this or that funny movie as \"the year's best,\" so I won't. But you get the idea."
    },
    {
      "text": "'Silver Linings Playbook' is fun, sharp and sometimes moving, but it's not reinventing any kind of wheel."
    },
    {
      "text": "Like a production of When Harry Met Sally put on by the characters from One Flew Over the Cuckoo's Nest. Silver Linings uses cliches like a straight-jacket, containing an otherwise nutty film and making it safe for audiences to approach."
    },
    {
      "text": "It might be contrived that way, but we are willing to forgive and accept because the path to what we expect is rewarding."
    },
    {
      "text": "Because of Lawrence, I just can't write off this movie."
    },
    {
      "text": "Would that every feel-good movie came by its good feelings so honestly."
    },
    {
      "text": "Silver Linings Playbook is, like its protagonist, hopelessly optimistic ... and it's a sign of the film's potency that we buy into it with our own sense of hopefulness."
    },
    {
      "text": "Beyond delivering an Oscar-worthy screenplay featuring some terrifically penned dialogue, Russell gets a great deal of help from his terrific cast. (Full Content Review for Parents also available)"
    },
    {
      "text": "... this is a film with its own cadence, its own particular sense of music, and it is a tremendous success for writer/director David O. Russell."
    },
    {
      "text": "A bittersweet romantic comedy, plain and simple, and, by the time it has added in subplots involving dance competitions and football superstitions, also rather unwieldy."
    },
    {
      "text": "It's a strain to care about Pat, and it's impossible to believe in his world."
    },
    {
      "text": "To that lost and found actor list you can also add Good Script Choosing Robert De Niro, who had been kidnapped by aliens 20 years ago and swapped out for Awful Script Choosing Robert De Niro."
    },
    {
      "text": "An unfussy, rambling crowd-pleaser that recalls elements of the filmmaker's past work ..."
    },
    {
      "text": "Silver Linings is consistently entertaining, with its scrappy, well-drawn characters, offbeat humor and indefatigable positive outlook."
    },
    {
      "text": "A healing and hopeful dramady about friendship. love, family, and optimism that is one of the Best Films of 2012."
    },
    {
      "text": "The movie doesn't break any thematic ground, and in other hands this same material might have made for an insufferable Katherine Heigl vehicle. But Russell and his cast make it sing - and soar, too."
    },
    {
      "text": "Dramatic, emotional, even heartbreaking, as well as wickedly funny, it has the gift of going its own way, a complete success from a singular talent."
    },
    {
      "text": "...that rare thing, a top notch comedy orchestrated by a director with a talent for teasing out the unexpected."
    },
    {
      "text": "Cooper's performance meets Lawrence's, beautifully, halfway."
    },
    {
      "text": "Everything comes together brilliantly in \"Silver Linings Playbook\"-for the film's crazed but uncrazy lovers; for the filmmaker, David O. Russell, and best of all for lucky us."
    },
    {
      "text": "No matter how grim it's looking for certain kinds of laughter, as long as there's David O. Russell, things will be OK."
    },
    {
      "text": "\"Silver Linings Playbook,\" the exuberant new movie from David O. Russell, does almost everything right."
    },
    {
      "text": "Silver Linings Playbook is an infectiously rousing crowd-pleaser about psychological damage and emotional healing, which would seem oxymoronic if not for the authentic, insightful atmosphere and marvelous performances."
    },
    {
      "text": "Anyone seeking proof that a movie can transcend its subject should look to Silver Linings Playbook."
    },
    {
      "text": "It's clever and cute and never lets you forget it, winning in spite of how much it insists on it."
    },
    {
      "text": "Cooper's much better than usual, while the always-great Lawrence is particularly fantastic."
    },
    {
      "text": "I say good for Russell for risking a protagonist who requires some patience and forgiveness."
    },
    {
      "text": "It's the perfect material for Russell, who not only deals perceptively with the dizzying swings of manic depression, but makes it the fabric of a big, generous, happy-making ensemble comedy."
    },
    {
      "text": "\"Silver Linings Playbook\" is so good, it could almost be a terrific old classic."
    },
    {
      "text": "While the ultimate takeaway from Silver Linings Playbook is, as the title suggests, optimistic, it's not just because the film has two recognizable stars and a cutesy premise."
    },
    {
      "text": "A solid cast delivers in a movie that is thoroughly enjoyable if not consistently great."
    },
    {
      "text": "It's not often that a movie can affect you and make you laugh out loud all at once, but \"Silver Linings Playbook\" coordinates the task with ease."
    },
    {
      "text": "Most of the way, the film's deficiencies are survivable if only for Jennifer Lawrence and some fleeting moments of emotional clarity and bracing conflict."
    },
    {
      "text": "Russell pitches the action at a manic, screwball pace, and the cast is more than up to the task, with Cooper and Lawrence attracting and repelling each other with equal dynamism."
    },
    {
      "text": "\"Playbook\" walks a tightrope in how it portrays mental illness -- deriving humor out of its characters' actions while demonstrating just how deep-rooted their problems are."
    },
    {
      "text": "I'll admit it. I went \"yaaaay!\" too. But I felt dirty doing it."
    },
    {
      "text": "A razor sharp, unfiltered exploration of recovery and reconciliation."
    },
    {
      "text": "Manic as it might be stylistically, emotionally Silver Linings Playbook maintains too even of a keel."
    },
    {
      "text": "David O Russell's movie to love raises the bar on what has become the traditional rom-com."
    },
    {
      "text": "The acting is sparky and intelligent, with Cooper proving there's more to him than flashy good looks. As for Lawrence, she acts every role like there's a soulful storm raging inside of her."
    },
    {
      "text": "It's impossible to shake the sense that what felt thrillingly, cohesively alive in the director's earlier movies plays here with more laurel-resting creakiness than go-for-broke verve."
    },
    {
      "text": "It manages to positively bleed compassion while remaining light, sexy, dynamic and thought-provoking."
    },
    {
      "text": "Silver Linings Playbook is a quirky adult romantic comedy that goes beyond the standard rhythms of the genre."
    },
    {
      "text": "Silver Linings Playbook is a neurotic ode to family dysfunction and accepting the universal screwup in all of us, which is to say it's maybe the most heartwarming movie you'll ever see about bipolarity."
    },
    {
      "text": "Turning frantic relationship problems into breezy entertainment, Russell gives Silver Linings Playbook the air of a classic romcom, strengthening it with the type of sophisticated insight into human behavior that Preston Sturges might make today."
    },
    {
      "text": "A delightful romantic comedy with unusually dark underpinnings."
    },
    {
      "text": "Russell has a way of transforming what should be clichéd stories into something surprising and insightful..it earns its feel-good status, rather than manufactures it."
    },
    {
      "text": "A thoroughly annoying and staggeringly laughless quirkfest featuring the most alarmingly miscast role of 2012."
    },
    {
      "text": "Lawrence goes Nicolas Cage crazy in her key moments. However, she kind of shows the most when she goes dead eyed."
    },
    {
      "text": "When one stops to consider how irksomely on the nose so much of this is, the qualities which intend to most readily ingratiate the film with us begin to appear perceptibly disingenuous and false."
    },
    {
      "text": "Makes the life of a film critic that little bit easier by setting 90% of the drama, action and dialogue literally in the middle of the road."
    },
    {
      "text": "While the movie follows the rom-com template overall, the awards-worthy acting of the two principals and the hyper pace of the action make this a must-see."
    },
    {
      "text": "Silver Linings Playbook is the sort of feel-good claptrap that normally irritates me, but Russell plays it with the pitch and verve of a classic screwball comedy."
    },
    {
      "text": "A head-spinning wonder of a movie about love and pain, reclamation and the totemic power of a National Football League franchise."
    },
    {
      "text": "As its nutty lovebirds, Cooper and Lawrence save Playbook from the director's surprisingly mundane impulses."
    },
    {
      "text": "Only a man with a celebrated history of behind-the-scenes altercations with movie stars and a prominent YouTube video of his on-set ravings could possibly mastermind a marvelous feature like Silver Linings Playbook."
    },
    {
      "text": "David O. Russell delivers wonderfully left-of-center entertainment time and time again and this is no exception. But this is a film that ultimately belongs to Jennifer Lawrence, thus solidifying her as one of the best actresses of any age working today."
    },
    {
      "text": "Appealing and enjoyable, David O. Russell's serio comedy is extremely well acted, likely to be embraced by critics, viewers, and Oscar voters."
    },
    {
      "text": "Few films in recent memory have effectively pulled at the heartstrings like this."
    },
    {
      "text": "With great pacing, a great sense of the moment and some of the most entertaining one-liners you'll find this side of a Coen brothers' film, there's much to like about Silver Linings Playbook."
    },
    {
      "text": "A hilarious, romantic and heartfelt crowd pleaser with genuinely great performances makes for one of the first must-see films of the Fall."
    },
    {
      "text": "David O. Russell has turned Matthew Quick's novel into an easily accessible romantic comedy that pulls you in with its immediacy."
    },
    {
      "text": "It's a crowd-pleaser if I've ever seen one, and something that will have plenty of mileage come awards season. A best picture nomination seems a lock."
    },
    {
      "text": "The performances of these actors are reason enough to go."
    },
    {
      "text": "Bradley Cooper and Jennifer Lawrence expand their range in David O. Russell's winning comedy romance about two people struggling to rebuild their lives."
    },
    {
      "text": "In a script that never lapses into mundane or uninteresting language, the scenes between Pat and Tiffany are sculpted with an almost David Mamet-like sharpness."
    }
  ],
  "release_year": 2012,
  "duration": 122,
  "genres": [
    "Comedy",
    "Drama",
    "Romance"
  ],
  "synopsis": "After losing his job and wife, and spending time in a mental institution, Pat Solatano (Bradley Cooper) winds up living with his parents (Robert De Niro, Jacki Weaver). He wants to rebuild his life and reunite with his wife, but his parents would be happy if he just shared their obsession with the Philadelphia Eagles. Things get complicated when Pat meets Tiffany (Jennifer Lawrence), who offers to help him reconnect with his wife, if he will do something very important for her in exchange.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/y7iOVneBvITlBdhy6tVqXVOa1Js.jpg"
}