{
  "movie_name": "Singin' in the Rain",
  "movie_id": "singin_in_the_rain",
  "total_reviews": 72,
  "reviews": [
    {
      "text": "...might be the most magical of movies about movies precisely because it doesn’t insist on the magic of movies."
    },
    {
      "text": "It’s an extravaganza of color, joy and mockery of hokey romances, but perhaps above all, you couldn’t re-create the miracle of Gene Kelly’s footwork with a billion-dollar supercomputer and a contract with the devil."
    },
    {
      "text": "It's a unique work of art crafted for the screen by a studio (MGM) at its height."
    },
    {
      "text": "Singin' in the Rain is simply the pinnacle of golden Hollywood magic. The most playful and cheerful depiction of the big studios era as it was actually unfolding. Amazing dancing sequences, tong in cheek dialogues, sharp self-awareness. Truly Magical."
    },
    {
      "text": "You would never know that this wasn’t produced with the intention of creating a near-perfect masterpiece. The results of the difficult production are seamless."
    },
    {
      "text": "[It] has been hailed as the greatest American musical ever made. It’s certainly one of the most fun, a knockabout reimagining of the transition from silent to sound movies: lousy history but a blast of singing, dancing, romance, energy and color."
    },
    {
      "text": "This is a movie of a bygone era – an era when an audience could be impressed by the sheer happiness of a story and moved by the footwork of a master."
    },
    {
      "text": "To put it bluntly, this is one of the funniest films ever made."
    },
    {
      "text": "... it sweeps you off your feet, wrapping you in a warm blanket constructed of song and dance numbers that make you feel like you can run up a wall, jump, and land on your feet."
    },
    {
      "text": "That iconic imagery of Gene twirling, tapping, stomping, and splashing around lamp posts, puddles, and sidewalks while crooning is fixed in Hollywood legend, but \"Singin in the Rain\" has a lot more going on than just that one song-and-dance number."
    },
    {
      "text": "Warner Bros. gives its greatest musical yet another substantial home-video upgrade with a gorgeous 4K disc that maximizes the films visual and auditory ravishments."
    },
    {
      "text": "Singin in the Rain makes you feel transported to Hollywood of the 1920s through beautiful production design highlighting the beauty of an era of black and white film with vibrant colors that feel fitting of that period."
    },
    {
      "text": "Long before his arrival in Hollywood, Kelly aspired to blend dance with narrative and, with the technical assistance of Donen to realize his vision, he finally achieved his goal with Singin in the Rain."
    },
    {
      "text": "Bristling with the old Arthur Freed production touch, this MGM Technicolor movie is entertaining in all departments and proves to be a top vehicle for the talents of Gene Kelly and Donald O'Connor."
    },
    {
      "text": "Let's not overlook the Charleston numbers, Kelly's rain dance in the street, the fabulous Hollywood premiere, the innumerable ribs Hollywood gives itself... Director Stanley Donen (and Kelly) and Producer Arthur Freed, who has done it again."
    },
    {
      "text": "Sits high on a pedestal. The best movie musical of all time. [Full review in Spanish]"
    },
    {
      "text": "The story overall is simple but the film makes sure the stakes are high enough to justify the character reactions."
    },
    {
      "text": "There are those films in life that simply always put a smile on one's face. Singin' in the Rain is one of the best."
    },
    {
      "text": "Singin' in the Rain will go down in cinema history as the best movie musical of all-time."
    },
    {
      "text": "Simply without equal in the musical genre."
    },
    {
      "text": "I can guarantee this is the only review of Singin' In The Rain that references Natalie Imbruglia's Torn."
    },
    {
      "text": "As much a satire on the ever-changing format of filmmaking as it is a joyful, glorious ode to life itself."
    },
    {
      "text": "Singin' in the Rain [is] to me the Hollywood movie which has most nearly achieved perfection."
    },
    {
      "text": "An energetic and often quite diverting Technicolor musical which pokes fun at the state of turmoil in Hollywood when silent pictures suddenly became unsaleable."
    },
    {
      "text": "Is Singin' in the Rain the finest movie musical of them all? There are none better in my book."
    },
    {
      "text": "The unstoppable joy of the musical numbers, especially with O'Connor, is what never fails to seduce - perhaps especially in Moses Supposes."
    },
    {
      "text": "Effervescent, life-affirming cinema... an antidote to any ailment, illness, or woes about the state of Hollywood."
    },
    {
      "text": "A masterpiece will always be a masterpiece, and it is very difficult to imagine that it may be possible to improve it in some way. [Full Review in Spanish]"
    },
    {
      "text": "It certainly could be argues that it is one of the best musicals ever made."
    },
    {
      "text": "Tap-dancing has never looked so unstoppable, nor so liquid: most tappers clench up and hammer away like road-drills, but these two sway their hips and laugh off the effort."
    },
    {
      "text": "Singin' in the Rain is another mighty fine MGM Technicolor musical comedy produced by Arthur Freed whose An American in Paris copped seven Academy awards last week."
    },
    {
      "text": "Kelly's delight - not in his own movements, but in the sheer joy of being able to move - is contagious."
    },
    {
      "text": "[UPDATED 2024 4K + BLU-RAY REVIEW] It's tough to fight the longstanding consensus that this is the greatest movie musical of all time, but what's often lost in the praise is that this also qualifies as a great comedy."
    },
    {
      "text": "Often considered the finest musical of all time."
    },
    {
      "text": "For humour and sheer energy, no musical betters Singin' In The Rain."
    },
    {
      "text": "...this one's the Taj Mahal, Armstrong's footprint on the moon, the 2001 Arizona-New York World Series, the Clash's London Calling, and the perfect foamy head on an expertly poured Guinness."
    },
    {
      "text": "One of the shining glories of the American musical."
    },
    {
      "text": "A fancy package of musical entertainment with wide appeal and bright grossing prospects."
    },
    {
      "text": "At the time, this film was treated as just another MGM musical but over the years it has gained in stature and is now considered as one of the best American films ever made--Read why."
    },
    {
      "text": "If you've never seen it and don't, you're bonkers."
    },
    {
      "text": "Come rain or shine, the Hollywood musical never got any better than this rip-roaring Stanley Donen/Gene Kelly classic."
    },
    {
      "text": "Mandatory viewing for even the casual moviegoer."
    },
    {
      "text": "The greatest musical ever!! A movie everyone should see over and over again. If it doesn't touch you, check your pulse."
    },
    {
      "text": "A big beautiful film! You can watch it 1000 times and still giggle!"
    },
    {
      "text": "False picture of early talkie era is not nearly as good as its reputation."
    },
    {
      "text": "Hollywood's best musical"
    },
    {
      "text": "Compounded generously of music, dance, color, spectacle and a riotous abundance of Gene Kelly, Jean Hagen and Donald O'Connor on the screen, all elements in this rainbow program are carefuly contrived and guaranteed to...put you in a buttercup mood."
    },
    {
      "text": "Watching Singin' in the Rain is an exuberant, magical experience -- a journey deep into the heart of feel-good territory."
    },
    {
      "text": "A rare musical whose story -- scripted by Betty Comden and Adolph Green -- is just as good as the songs."
    },
    {
      "text": "It is an improbable masterpiece; a film where everything just has that indistinguishable quality of fitting together."
    },
    {
      "text": "Among the jewels that Arthur Freed's musicals unit turned out at MGM in the '40s and '50s, Singin' in the Rain is the Hope diamond."
    },
    {
      "text": "Sure, we respect An American in Paris. But we truly love Singin' in the Rain."
    },
    {
      "text": "The restored version of the 1952 classic musical will have you dancing in your seat, whistling along, and wishing for rain."
    },
    {
      "text": "Fifty years later, it's still a delight with everybody working at the top of his or her game."
    },
    {
      "text": "The ultimate nostalgic source text is itself a pomo homage to a lost moment."
    },
    {
      "text": "My all-time favorite film -- I never get tired of watching Gene, Debbie, and Donald perform those incredibly exuberant musical numbers! A true classic."
    },
    {
      "text": "The definitive musical is timeless, capturing a large portion of truth about the movie business..."
    },
    {
      "text": "Miss Reynolds, besides singing in her own pleasurable style and doing some clever dancing, handles her first romantic lead appealingly and capably. Kelly and O'Connor each can be covered with one word: Great!"
    },
    {
      "text": "The best example of Hollywood's golden age of musicals, it is being released on an eye-popping new DVD that literally explodes with color."
    },
    {
      "text": "..light, frothy, and charming, a complete delight from beginning to end."
    },
    {
      "text": "Alternately funny and hilarious"
    },
    {
      "text": "In every department it is virtually flawless."
    },
    {
      "text": "People who say they don’t like musicals should watch Singin’ in the Rain, and find out how sweet eating one’s words can be."
    },
    {
      "text": "It feels like it was made out of whole cloth rather than just being a showcase for its dancers."
    },
    {
      "text": "There is a wonderful cynicism throughout Singin' in the Rain, with everybody either kidding themselves or pretending to be something they are not."
    },
    {
      "text": "If I were only allowed to own one musical -- and I love Hollywood musicals -- this would be it."
    },
    {
      "text": "One of the highpoints of hoofin' history but, more importantly, an unadulterated joy."
    },
    {
      "text": "Arguably the greatest movie musical of all time."
    },
    {
      "text": "There is no movie musical more fun than Singin' in the Rain, and few that remain as fresh over the years."
    },
    {
      "text": "Singin' in the Rain (1952) is one of the most-loved and celebrated film musicals of all time from MGM, before a mass exodus to filmed adaptations of"
    },
    {
      "text": "A celebration of the grand tradition of filmmaking that was canny enough to know it was also the bell-ringer at the end of an era."
    },
    {
      "text": "Singin' in the Rain isn't just one of the classics of Old Hollywood. It is also one very fine example of a genre that is almost banished from the big studios of today -- musicals."
    }
  ],
  "release_year": 1952,
  "duration": 102,
  "genres": [
    "Musical",
    "Comedy"
  ],
  "age_rating": "G",
  "synopsis": "A spoof of the turmoil that afflicted the movie industry in the late 1920s when movies went from silent to sound. When two silent movie stars', Don Lockwood and Lina Lamont, latest movie is made into a musical a chorus girl is brought in to dub Lina's speaking and singing. Don is on top of the world until Lina finds out.",
  "popularity": 9.5,
  "poster_url": "https://image.tmdb.org/t/p/original/w03EiJVHP8Un77boQeE7hg9DVdU.jpg"
}