{
  "movie_name": "Suicide Squad",
  "movie_id": "the_suicide_squad",
  "total_reviews": 382,
  "reviews": [
    {
      "text": "The Suicide Squad feels like the twilight of the age of superhero movies, making way for a new form of megablockbuster to exchange places."
    },
    {
      "text": "Gunn’s script, while never as clever as it believes itself to be, is rarely dull. It might not linger in the mind the way it wants to, but there’s no denying that The Suicide Squad represents a step in a better direction."
    },
    {
      "text": "It is a deeply political and culturally critical movie about the state of the world without ruining the fun. The movie plays with the callousness and dispensability of life sacrificed for the US government’s policies, which are not idealized"
    },
    {
      "text": "Gunn kept audiences on their toes with action that could have been ripped from the comic books, humor that was sharp and landed hit after hit, and still a surprising amount of heart that made it easy to cheer on these mischievous characters."
    },
    {
      "text": "Gunn’s fans can dig into The Suicide Squad and its rejuvenation of the DC Universe — even if the movie, like its director, is more committed to a good time than a long time."
    },
    {
      "text": "... funny, gory, energetic, and marvelously absurdist. What else would you expect from 'Guardians of the Galaxy' director James Gunn?"
    },
    {
      "text": "Imagine Tarantino directed an R-rated version of the live-action Scooby-Doo film with a CGI shark and you get The Suicide Squad."
    },
    {
      "text": "EVERYTHING I WANTED & MORE! It’s hilarious, entertaining, surprisingly emotional but brutal/bloody at the same time! James Gunn not just crafted one of my favorite comic book movies once again, he created a flat out Creative WACKY EXPERIENCE"
    },
    {
      "text": "The phenomenal cast elevates the overall picture with fantastic performances all-around, though Daniela Melchior's breakthrough performance is an absolute standout. James Gunn just can't seem to miss."
    },
    {
      "text": "The material is bonkers enough to let Gunn play with stereotypes, employ fresh visuals, and use this versatile cast to deliver crazy sequences that go overboard on purpose."
    },
    {
      "text": "Cascading with carnage, The Suicide Squad is shamelessly silly and savage while tapping into gruesome imagination."
    },
    {
      "text": "The Suicide Squad isn’t a subtle film, in its violence, or its themes. There is a lot to unpack with this film regarding the American prison system, American Interventionalism, and what it means to keep the peace."
    },
    {
      "text": "If you are looking for a film that improves on every misstep that its predecessors made, The Suicide Squad is that film. You will laugh, you will wince, you will aww, you may even cry, as you are sucked into the magic of a rated-R James Gunn film."
    },
    {
      "text": "Everything I'd hoped it would be: it was funny, shocking, violent — it was everything you'd want in a movie about expendable supervillains, and so unlike anything else we've seen in the genre."
    },
    {
      "text": "It isn’t that you don’t believe the people in the film, but that the situations are so outlandish, they could have only originated on the comic page and that alone should be worth the price of admission."
    },
    {
      "text": "\"There is so little that is new or surprising in this genre, that it takes true innovation to get anywhere close to the inventiness that makes these films truly sing.\""
    },
    {
      "text": "Ferociously funny and devilishly cool."
    },
    {
      "text": "The Suicide Squad is the most fun you’ll have at the movies all summer, as James Gunn serves up a gloriously gory and gut-busting superhero spectacle."
    },
    {
      "text": "Even with its flaws, the film has this uniquely raucous and chaotic pulse and once you get in sync with it you can’t help but have a good time."
    },
    {
      "text": "A bad reheated dish simply prepared to consume before it expires... [Full review in Spanish]"
    },
    {
      "text": "\"I actually really enjoyed the film. I audibly laughed out loud a few times. John Cena is hilarious in this film as Peacemaker, he actually has some of the best one liners of the film.\""
    },
    {
      "text": "James Gunn not only provides a hilarious and unique superhero tale, but also brings a surprising understand and empathy to those who are often cast as villains in a world that never allows them to be seen as anything else."
    },
    {
      "text": "THE SUICIDE SQUAD sticks to its love for dark-humored, splatter b-movie schlock so much, that it almost becomes a detriment. But the whole thing is just too different and crazy to not somehow endear the film and its strange characters."
    },
    {
      "text": "Nothing would prepare me for the high-octane, love letter to the genre that would be James Gunns The Suicide Squad. A film that is more than a blockbuster, its cinema at its grandest and most pleasing."
    },
    {
      "text": "It's hard to see Gunn's first DC adventure as anything other than successful. A chaotic joy, The Suicide Squad doesn't have much of a point to make - most superhero films try to build a universe, this one blows it to smithereens."
    },
    {
      "text": "The Suicide Squad isn't a horrible movie. It's just not a terribly memorable one."
    },
    {
      "text": "With The Suicide Squad, James Gunn blends his earlier sensibilities into a pitch-perfect summation of his work to this point."
    },
    {
      "text": "Gunn's smart-aleck supervillain team adventure is a labor of twisted love bursting with genuinely funny sick jokes and sicker characters (Polka-Dot Man shoots out lethal polka dots)."
    },
    {
      "text": "The Suicide Squad feels like a rare treat, something to be treasured and something worthy of the big screen experience."
    },
    {
      "text": "The Suicide Squad gives James Gunn big-budget carte blanche to deliver his unhinged vision for the titular cabal of anti-heroes, and the result is one of the most thrillingly unrestrained comic book movies ever made."
    },
    {
      "text": "Funny when it needs to be, heartfelt when it wants to be, and just gloriously fit for purpose."
    },
    {
      "text": "James Gunn's The Suicide Squad represents a considerable improvement over David Ayer's disastrous 2016 film, infusing exciting action, great characters, and lots of humor into a highly entertaining flick."
    },
    {
      "text": "It feels like the cinematic equivalent of the modern Internet experience."
    },
    {
      "text": "Bizarre and more gore, but also much more badass and poetic. [Full Review in Spanish]"
    },
    {
      "text": "While this one looks like it could be a kids superhero movie to an extent, don't be fooled: it's rough. It's a niche superhero movie and one for those with adventurous and not so easily offended taste."
    },
    {
      "text": "Heads and shoulders above its predecessor, but - like Gunn's 'Guardians of the Galaxy' - its quirkiness and shock elements all feel safe and corporate-approved."
    },
    {
      "text": "The Suicide Squad is an uproarious extravaganza filled with grotesque nom-noms, full-on naked dick shots, and John Cena in tighty-whities and it's is the most fun you'll have with an R-rated comic book film in a theater since Deadpool."
    },
    {
      "text": "The merits of bonkers violence and James Gunn's style are easy to find."
    },
    {
      "text": "If there's only one true, declarative statement to be made about James Gunn's \"The Suicide Squad,\" it would be that the film is entirely and undoubtedly a product of trust."
    },
    {
      "text": "If you're wondering how all of them manage to have a meaningful part that adds substance to Suicide Squad, don't. But adding logic to Suicide Squad is pointless."
    },
    {
      "text": "You'll be lucky to have this much fun in a cinema again this year."
    },
    {
      "text": "It's a hyper-violent, horny, gore spurting, roller coaster ride built around a warmly beating, but battered heart."
    },
    {
      "text": "Gunn gets in the zone, but it ends up being too little, too late."
    },
    {
      "text": "The film refuses to take itself seriously at the same time it manages to avoid the dangerous sanitization of violence thats so common in the genre. [Full review in Portuguese]"
    },
    {
      "text": "A film can be funny and lively, use its main faces well, have a few nice moments with its supporting cast and improve on its predecessor, and yet still fall into a routine... keep rehashing the same things, and just be average."
    },
    {
      "text": "Even when it doesn't work, the fact that it exists is a triumph."
    },
    {
      "text": "As much a jeering middle finger to the wannabe ratf*ckers who got Gunn fired from Disney as it is a joyous rejection of the so-called SnyderVerse."
    },
    {
      "text": "Comparing 2016's Suicide Squad to 2021's series reboot is like comparing day-old gas station sushi to three-star Michelin sushi chef Jiro Ono's finest dish."
    },
    {
      "text": "Its dark wit and ultraviolence may not be for everyone, but those who dig this tone will have a lot of fun watching and rewatching this crazy, chaotic - and unexpectedly touching - flick."
    },
    {
      "text": "The film moves fast; it's forgettable and quite enjoyable."
    },
    {
      "text": "While the film depicts the murder of a main character as a tragedy, it plays a boomerang slicing an anonymous soldier's head in half as a joke, suggesting that Gunn thinks violence is funny as long as it happens to other people."
    },
    {
      "text": "Gunn is blissfully efficient in establishing the familiar rules to ensure it doesn't get bogged down in exposition, unlike the prior entry."
    },
    {
      "text": "This is a comic book movie, not an adaptation vaguely embarrassed to be rooted in such source material like Joker or some of DC's more po-faced efforts."
    },
    {
      "text": "Spectacle at its best, pathos at its most palpable. Maybe hyperbole, but I don't care. It's great!"
    },
    {
      "text": "If the film represents the DCEU finding its own unique voice, consider me impressed."
    },
    {
      "text": "Including so many characters and so much action and so much gore and so much swearing has only made it feel like a BIG yet somewhat empty film. [Full review in Spanish]"
    },
    {
      "text": "The outrageous avalanche of anarchy and energy is non-stop."
    },
    {
      "text": "Certainly an improvement over David Ayer's 2016 original, although that's a fairly low bar to clear."
    },
    {
      "text": "That's the biggest strength of The Suicide Squad -- embracing the capes-and-tights minutiae of an eight-decade-old medium to prove that the source material barely needs a punch-up to entertain the masses."
    },
    {
      "text": "This movie kept my attention more than any film I've watched over the past few months. It was fun and engaging to the point where I was entertained from start to finish."
    },
    {
      "text": "This was a genuine fun movie that had some sad and dark moments but they worked. It's hard to get all of those feels in one movie. Especially a comic book movie."
    },
    {
      "text": "The social commentary might be blatant, but the over the top action and CGI-candy still leaves a bigger impression as a superhero movie is expected to these days."
    },
    {
      "text": "DC may often play second fiddle to Marvel, but this movie is DCEU done right. It's bloody, funny, and has just enough heart to make the band of merry misfit anti-heroes endearing. Plus, it's just a really, really wicked awesome movie."
    },
    {
      "text": "An invigorating blast of bloody, disreputable comic-book cinema, \"The Suicide Squad\" turns its titular criminals into a collection of lovable anti-heroes set loose in a dazzling, surprisingly emotional adventure."
    },
    {
      "text": "Gunn's assembled a bundle of messages here through the songs and stories his handiwork contains. In doing so, he's painted an illuminating portrait of who its maker is - but he hasn't crafted the kind of picture he should want to."
    },
    {
      "text": "This is one sick, totally fun blast,"
    },
    {
      "text": "Stunning, bloody, strange and very entertaining despite all its hokum."
    },
    {
      "text": "The Suicide Squad is much better than its predecessor (it was not difficult to improve it). James Gunn's hand is very noticeable, offering us a fun movie with a fantastic soundtrack and blood, lots of blood. [Full review in Spanish]"
    },
    {
      "text": "The thing that makes The Suicide Squad so singularly distasteful is closely related to its factory-installed cynicism: the unconscionable glibness that grows out of it."
    },
    {
      "text": "The Suicide Squad is a magnificent blend of gore, heart, and humor that engages its audience instantly with strong characters, performances, and breathtaking visuals."
    },
    {
      "text": "I had a great time with this movie."
    },
    {
      "text": "It can't stop nudging the audience about how ridiculous all of this is; the opening reel is essentially a series of eye-rolls about the film's own preposterousness, with the audience flattered at being in on the joke."
    },
    {
      "text": "Definitely a movie worth watching and enjoying. In so many ways, The Suicide Squad' lives up to its name, but I am starting to see the formulaic nature of superhero movies, which is worrisome."
    },
    {
      "text": "Imagine if Guardians of the Galaxy and Deadpool had some horribly beautiful baby."
    },
    {
      "text": "I've never been so annoyed by a movie in my entire life... way to gimmicky for its own good."
    },
    {
      "text": "From the bonkers fight choreography to the macabre logic driving the madcap action, this stylized comic book world looked nothing like ours, and was all the more transporting and entertaining for it."
    },
    {
      "text": "...fares much, much better than David Ayer's misbegotten take on the DC Comics creation..."
    },
    {
      "text": "Here to have fun, and it succeeds without ever feeling weighed down by true nihilism or any agenda beyond entertaining the hell out of audiences."
    },
    {
      "text": "James Gunn directed this inventive but only partially successful sequel."
    },
    {
      "text": "Gunn understands that the Squad is a group of misfits and he uses their reduced status to make them effective underdogs. More importantly, his screenplay has a beating heart underneath the gore."
    },
    {
      "text": "It's arguably the strongest of all the recent DC films so far, and a hopeful sign that the studio has a brighter future ahead."
    },
    {
      "text": "The Suicide Squad explodes with loopy mix of horror and sick humor."
    },
    {
      "text": "Here, everyone just does what they want, and that's really good news for a DC Comics movie. [Full review in Spanish]"
    },
    {
      "text": "Where \"The Suicide Squad\" really succeeds, and separates itself from its predecessor (which was more about America relying on bad people to do our dirty business), is re-framing its characters as victims, not just villains."
    },
    {
      "text": "Love the cast dynamic, violent gory kills, humor, soundtrack, and even the heartfelt moments. Only Gunn can make me care about a rat who waves."
    },
    {
      "text": "The film's final nemesis is a hoot, but it's also genuinely creepy."
    },
    {
      "text": "With its insane action set-pieces, strong performances from its lead cast, and bucket loads of gore, The Suicide Squad could easily be one of the best superhero movies ever made."
    },
    {
      "text": "The movie's saving grace lies in its willingness to embrace the ridiculous and, in the process, poke fun at the kind of movie it easily could have been; i.e., one that took itself more more seriously..."
    },
    {
      "text": "If billionaires wanna set their money on fire by using computers to animate the 12th Doctor (Peter Capaldi) staring down a several-skyscraper-sized creature named Starro, that is almost certainly less evil than whatever else they were going to do with it."
    },
    {
      "text": "If you enjoy cartoonish excess even when it extends to violence then this hard R, DC Comics super anti-hero action film is exactly what you need."
    },
    {
      "text": "It's corporate irreverence, which means fundamentally and most urgently it's a safe space for viewers. It's also pretty funny at times."
    },
    {
      "text": "The Suicide Squad is fun and funny, though the over-the-top violence won't appeal to everyone."
    },
    {
      "text": "The Suicide Squad is brutal, funny and brutally funny, illustrative of the possibilities that develop when comic book cinema doesn't take itself quite so seriously. All in all, it's a hell of a good time."
    },
    {
      "text": "Its crazy visuals and violence is complemented by a crazier bunch of characters, a fun story, and more than its fair share of heartwarming moments."
    },
    {
      "text": "Better, more entertaining, and cohesive than its predecessor. And if you don't mind the decidedly R-rated material, you might just enjoy this wild and crazy ride."
    },
    {
      "text": "There's little question this entire escapade is so much better than the last one, hardly a high bar to hurdle, and I did have a pretty good time."
    },
    {
      "text": "Maybe it didn't need to be two hours 12 minutes long but for the most part, The Suicide Squad earns its length."
    },
    {
      "text": "It's a swell tribute to Gunn's origins as a genre filmmaker while demonstrating his essential skill as both a writer and director of populist blockbusters."
    },
    {
      "text": "Full of gleeful gore and carnage, infectiously silly jokes, and an overall vulgar, irreverent attitude, this wily, invigorating DCEU movie also offers surprisingly strong teamwork and lots of heart."
    },
    {
      "text": "'The Suicide Squad' represents the very best that DC films can be, taking the kind of risks that you wouldn't see in a Marvel property."
    },
    {
      "text": "Sidestepping the silliness of the plot, it's joyous fun throughout; the entire cast is a blast, not least Peter Capaldi's mad-scientist baddie, the Thinker."
    },
    {
      "text": "If there was even an iota of human emotion evident the movie would be unbearable as well as increasingly vile. But there isn't, so instead it's just kind of exhausting..."
    },
    {
      "text": "There's stuff in this movie that will make you cringe even as you're doubled over with laughter, to be sure, but what makes this the kind of film audiences will keep coming back to is the sense of emotional range woven through the whole thing."
    },
    {
      "text": "James Gunn's The Suicide Squad puts the DC Comics franchise back on track by playing to everyone's strengths."
    },
    {
      "text": "An entertaining comic film and a breath of fresh air in the midst of so much homogeneity in the genre. [Full review in Spanish]"
    },
    {
      "text": "Clears the subterranean bar set by Ayer's botched attempt while also making one yearn for the next Guardians of the Galaxy film."
    },
    {
      "text": "Ultimately, The Suicide Squad is a fun, if overlong, superhero blockbuster, but it's nothing special and it's certainly not anything new."
    },
    {
      "text": "A fun time with just enough of a nasty edge to feel like it has a personality."
    },
    {
      "text": "If the ham-fisted glut of multi-million dollar special effects don't dazzle you, then the calibre of The Suicide Squad's genuinely impressive ensemble cast by all rights should."
    },
    {
      "text": "It's just as dull as the predecessor. [Full review in Spanish]"
    },
    {
      "text": "I didn't think I'd have fun with a movie like this again - a huge - budget Mystery Men aiming for, and nailing, its hard-R. More, please."
    },
    {
      "text": "The pacing is a bit off and the story veers a bit too much when trying to layer in political drama where no one asked for it, but it's mostly a good way to watch fun characters doing silly and badass things."
    },
    {
      "text": "Writer-director John Gunn certainly leaves a giant thumbprint on this merry 2-hour and 4-minute meatgrinder."
    },
    {
      "text": "There's more pathos in King Shark sitting in the back of a van, silently watching the grit of an island's back alleys pass by, than your average bullet fest."
    },
    {
      "text": "A singularly different and infinitely better experience than David Ayer's grim predecessor."
    },
    {
      "text": "Has added a lot of things that the previous film lacked- excitement, joy, coherent action, and decent filmmaking."
    },
    {
      "text": "Of course, creating multifaceted, endearing villains beyond the stereotypical \"mustache-twirling\" isn't a novel concept. But in Gunn's hands, it soars to new heights."
    },
    {
      "text": "James Gunn's The Suicide Squad is just about as much fun as a person can have in a theatre without getting arrested"
    },
    {
      "text": "With little exposition and no character development, there's no emotional resonance, making it more of a grotesque, R-rated comic-book-turned-video game than a movie."
    },
    {
      "text": "So, yes, let's get this out of the way: The Suicide Squad is better than Suicide Squad. How could it not be?"
    },
    {
      "text": "The movie is too much, too long, but not lacking in its glories. To find them, follow Harley. She's leading the way."
    },
    {
      "text": "The most imaginative DC film so far, veering from laugh-out-loud hilarity to horror, shifting from pathos to extraordinary violence that would make Quentin Tarantino question its excesses."
    },
    {
      "text": "With The Suicide Squad, Gunn shows that there are ways to keep things edgy while at the same time offering enough humor and action to maintain the crowd-pleasing elements."
    },
    {
      "text": "[A] glorious gun-blazing tour de farce of impressively immense scope & unrestrained storytelling, from a brilliant filmmaker operating at the top of his game."
    },
    {
      "text": "James Gunn shoots his \"Dirty Dozen\"-like tale with comic-book images galore, hits on a heavy bundle of 'em, but barely misses overkill by the end. Crazy stuff!"
    },
    {
      "text": "A fun, gory and action-packed adventure that gives every one of its antiheroes a moment to shine. [Full Review in Spanish]"
    },
    {
      "text": "Yet another mindless, overproduced B-movie that's neither funny, exciting nor campy enough to be a guilty pleasure."
    },
    {
      "text": "Yes, this DCU movie is a bit more bearable than Marvel's most recent film, Black Widow, but saying that is not much different than saying that some stinky shit is better than other stinky shit. The truth is that the two movies are still shit."
    },
    {
      "text": "Mission accomplished."
    },
    {
      "text": "'The Suicide Squad' gets by on its performances, but it punches down far more than necessary and misses the emotional connections of Gunn's other contemporary work."
    },
    {
      "text": "Q: So who are the good guys? A: There are no good guys."
    },
    {
      "text": "The Suicide Squad prioritizes jokes to such an extent that the film starts to fall apart whenever it's required to function like a story, two hours of cinematic cotton candy."
    },
    {
      "text": "An exuberant, violent, and hilariously goofy superhero romp."
    },
    {
      "text": "Mayhem is the name of the game in this iteration, and boy, has pandemonium never felt so good."
    },
    {
      "text": "This tenth installment in the DCEU is a fast-paced, blood-soaked, wildly irreverent escapade that skillfully balances gore and goofiness, with equal amounts of irreverence and sincerity. Think The Boys pumped up on a steroids."
    },
    {
      "text": "The Suicide Squad serves as a boundary-pushing switch up from the superhero's conformed image."
    },
    {
      "text": "One crazy kaleidoscope of brassy bloodshed. Anything that features a giant, pastel colored starfish lumbering about wrecking havoc, must be seen."
    },
    {
      "text": "Gunn has finally made a Troma movie on a big Hollywood budget."
    },
    {
      "text": "aka 'Suicide Squad 2: Sorry About Suicide Squad 1'"
    },
    {
      "text": "The Suicide Squad is a strong, fresh, and ultra-violent sequel that is distinctly Gunn's vision through each step. A good example for WB of what happens when the studio trusts its director to deliver."
    },
    {
      "text": "It's colorful, yet somber; hilarious, yet profound; violent, yet tender. It's a whole host of discordant ideas which come together as only a James Gunn film can, bringing all the highs and lows one has come to expect from the just-off-center director."
    },
    {
      "text": "Through all the mayhem, \"The Suicide Squad\" feels like it's trying too hard to prove that it's better than the previous film, which grows tiresome after a while."
    },
    {
      "text": "Gunn's movie is wondrously wild, delightfully deranged and viscerally violent."
    },
    {
      "text": "Fast-paced, violent fun."
    },
    {
      "text": "The jocular élan with which the Squad dispatches victims is a trademark of the franchise. And they don't just slaughter bad guys:"
    },
    {
      "text": "This movie is a lot, and a lot of it rules."
    },
    {
      "text": "Despite the blood and gore, \"The Suicide Squad\" is comedic in tone, eschewing the oppressive seriousness of its DC cinematic colleagues."
    },
    {
      "text": "I think [Gunn] stretches himself too thin by the end's contractually obligated vomiting of computer-graphics, but the jokes and action prove more than enough to compensate."
    },
    {
      "text": "James Gunn has carved out his own niche and The Suicide Squad might enter him in with the greats (if he's not there already). Unlike the 2016 effort, this doesn't feel studio tainted in the slightest. It's 100% grade A choice Gunn. And bloody."
    },
    {
      "text": "We're not supposed to notice all this pilfering from movies of our childhood, but I noticed them. This movie is a mess."
    },
    {
      "text": "The Suicide Squad confirms more than ever that Warner Bros. is just completely astray with the DCEU films."
    },
    {
      "text": "The first half is everything you could want from a superhero movie and the second half is everything we've sadly come to expect from them."
    },
    {
      "text": "When it is violent and extreme, this is when it's fun... I had a blast watching this."
    },
    {
      "text": "Under Gunn's well-suited direction, The Suicide Squad becomes a grimy romp, full of self-aware humor, baked-in absurdity and just enough pathos to let you know he doesn't consider the whole thing a joke."
    },
    {
      "text": "The Suicide Squad will play well with comic book fans, but casual movie goers may be a harder sell with this material."
    },
    {
      "text": "While there's a reasonable amount of fun to be had from the mayhem, things never get quite as gonzo as the trailers promised. Overall, you get the sense that the once-canceled Gunn has become gun-shy."
    },
    {
      "text": "\"The Suicide Squad\" is the most subversive mainstream blockbuster since Ryan Reynolds, in character, was told by his blind roommate that a red suit was a good idea because, after all, it would hide the blood."
    },
    {
      "text": "James Gunn's film kills. Oh, and you thought a talking tree was weird..."
    },
    {
      "text": "It's fantastic a comic book movie with a Troma gloss..."
    },
    {
      "text": "There are just enough passages in it where it comes good in its remit -- even if that remit mightn't be your particular cup of shark soup."
    },
    {
      "text": "'The Suicide Squad' chokes a little on its own supply, but enough joy can be found to mark it a winner."
    },
    {
      "text": "As if a James Gunn Guardians of the Galaxy film had been cast with characters from Arkham Asylum."
    },
    {
      "text": "Here's a hot take for you: I had more fun in this movie than either of Gunn's Guardians of the Galaxy films."
    },
    {
      "text": "James Gunn takes what was a frantically paced mess and turns it into an off-the-wall good time that leans into hilariously brutal violence but with a surprisingly moving emotional center."
    },
    {
      "text": "[James Gunn] has created a superhero movie that equally celebrates and mocks its genre, all while taking the audience on one of the wildest rides imaginable."
    },
    {
      "text": "It's not often a potential franchise gets a do-over. Warner Bros. was lucky to get Gunn and even smarter to stay out of his way in The Suicide Squad."
    },
    {
      "text": "The energy in this picture is non-stop. A joke or a skillfully executed action scene is never far off."
    },
    {
      "text": "Despite the trappings of the modern Hollywood formula, The Suicide Squad breaks the mold as best it can with a multi-million dollar budget that spared no expense when it came to blood & guts"
    },
    {
      "text": "[It's] as if Gunn wanted to challenge himself to make such an underpowered crew perform at the highest levels, as a lark, just to see if he could pull it off. He mostly does, I guess?"
    },
    {
      "text": "A huge improvement on the original and, without question, a James Gunn film. The characters and action are great, but the film sacrifices all emotional impact and it may prove less memorable than some of Gunn's other outings."
    },
    {
      "text": "Fun and Bloody Adventure"
    },
    {
      "text": "The lack of narrative momentum or compelling character arcs starts to wear on you. The jokes get old, too."
    },
    {
      "text": "This is the best Marvel movie that DC has ever made"
    },
    {
      "text": "The film has its fun moments, and represents an improvement on the first Suicide Squad, which I know isn't saying much."
    },
    {
      "text": "Gunn is much better suited to the material, though while the end result is gorier, funnier and occasionally more heartfelt [than its predecessor], it doesn't quite coalesce into something totally fun, or totally meaningful."
    },
    {
      "text": "Storm Reid and Idris Elba have the best scene ever and the women of this franchise, Margot Robbie, Viola Davis and Daniela Melchior make the overly violent, comedically quirky franchise worth the watch for me"
    },
    {
      "text": "I'm in for tight storytelling, sidesplitting lines and impeccable timing. However... It's like there's a contest we don't know about to see who can be the sickest, grossest, most ridiculous snuff deviant in the cinematic universe. Unnecessary."
    },
    {
      "text": "Gunn finds ways to almost continually surprise and delight us."
    },
    {
      "text": "Yeah, yeah, you may want to say, life sucks, got it. Even so, there's a lot to like in the film."
    },
    {
      "text": "Much like Guardians of the Galaxy, The Suicide Squad is exceptionally good at taking mismatched characters and making them gel thanks to the strength of its script and well-calibrated performances."
    },
    {
      "text": "Writer-director James Gunn, a veteran of the Troma Z-movie factory, has imbued the picture with a proud neo-junkiness, and the good news is that it's intermittently entertaining."
    },
    {
      "text": "I don't hate The Suicide Squad ... but I do feel somewhat bludgeoned by it, as if I'm being a stick-in-the-mud for failing to fall in line and revel in the absurdity."
    },
    {
      "text": "Everything you like about James Gunn's wild, violent, irreverent style is on display, maybe to a fault."
    },
    {
      "text": "The Suicide Squad is fluid, the narrative structure is off-kilter and fractured just like its team, and it is often absolutely hilarious in-and-out of the insanity happening in front of us."
    },
    {
      "text": "Gunn has made this movie fun even if formulaic, and in doing so, he may have not only saved The Suicide Squad, but he's perhaps resuscitated the DCCU itself."
    },
    {
      "text": "Gunn's violent, chaotic, hilarious and sneakily heartfelt vision are all safely intact resulting in easily one of the best DC Extended Universe films."
    },
    {
      "text": "It's a combination that, by rights, should not come together. Yet it does."
    },
    {
      "text": "This is FUN. Yes, with all capital letters, because I really need to get that point across...it's the film the original Suicide Squad was trying to be. And I'm here for it."
    },
    {
      "text": "It has the good sense to celebrate bad taste, and it is all the better for it."
    },
    {
      "text": "A quasi-sequel, quasi-reboot that breathes new life into the franchise as James Gunn brings his Guardians of the Galaxy flare into the DC universe while at the same time delivering the most outrageous and gruesome bloodbath the superhero genre has seen."
    },
    {
      "text": "Gunn is now undisputed king of both sides of the comic book movie fence."
    },
    {
      "text": "The gloriously unhinged James Gunn keeps Margot Robbie, John Cena and a top cast of crazies firing on all cylinders and turns a botch job original that was the worst movie of 2016 into the down-and-dirty whirlwind it was always meant to be."
    },
    {
      "text": "This movie is more interested in how many ways a human body can be dismembered than it is in anything else with the possible exception of macho posturing."
    },
    {
      "text": "[James Gunn] gets to embrace his B-movie sensibility in all its R-rated glory. One that is gleefully violent, gory, and profane."
    },
    {
      "text": "This is what happens when you hire an excepcional creator, give him a juicy license, free him from any kind of ties and make things easier for him with a generous budget. Glorious."
    },
    {
      "text": "The Suicide Squad is the best DC movie in decades. A high watermark for comic book cinema and blockbusters in general. Hilarious, horrifying, and heartfelt in equal measure."
    },
    {
      "text": "The Suicide Squad is a self-contained exercise in maximalist storytelling, the likes of which we see only rarely. It might be the most deviant-minded mainstream superhero movie since Taika Waititi's Thor: Ragnarok."
    },
    {
      "text": "The Suicide Squad can't be accused for being standard or timid. It's easily one of the most outrageous movies of 2021, following its own path, and being led by the wild mind of James Gunn."
    },
    {
      "text": "[James] Gunn operating with his raw sensibilities and shredding what hasn't worked for him before. [...] Gunn has delivered a zany, gory, crazy adventure at his most unhinged - more than he's allowed to be at Marvel, or he's allowed himself to be."
    },
    {
      "text": "The constant assault of gags, combined with the routine plotting ... creates its own deflating sense of repetition."
    },
    {
      "text": "While not quite the breath of fresh air that, say, Birds of Prey was last year, this is still the all too rare superhero flick made with purpose outside of what's coming next."
    },
    {
      "text": "A careful corporate product that for all its naughty posturing is about as edgy and dangerous as a trip to the mall, with production design by Hot Topic and bad jokes from Spencer's Gifts."
    },
    {
      "text": "(Gunn) lays everything on way too thick in the third act and the romp becomes exhausting. The movie is far too long and too grotesque for its own good."
    },
    {
      "text": "Irreverent and funny in a midnight movie way, \"Suicide Squad\" is a shameless guilty pleasure."
    },
    {
      "text": "While The Suicide Squad isn't exactly the masterpiece fans may be hoping for, it's definitely an upgrade."
    },
    {
      "text": "James Gunn at his meanest, bloodiest, and funniest. This is what the first Suicide Squad should have been."
    },
    {
      "text": "James Gunn finally handles a multi-character DC film in a way that works. Blending The Belko Experiment with Tromeo & Juliet and playing with super-villains, we finally get the Suicide Squad we had hoped for."
    },
    {
      "text": "James Gunn, Troma alum, taps into his gruesome imagination in a way we haven't seen since the era of Slither and Super."
    },
    {
      "text": "It's still badly overcrowded, with an exhausting barrage of hyper-violent mayhem. But there's some charm in the characters, and the actors add plenty of sassy banter."
    },
    {
      "text": "Fans will be plenty sated."
    },
    {
      "text": "The amazing thing is just how much Gunn can make you care about these killers... You might even feel something for the starfish."
    },
    {
      "text": "The Suicide Squad is bloody fun ride with a lovable cast to match."
    },
    {
      "text": "Writer/Director James Gunn takes the original concept and turns it into ultra violent, profane bloody, funny Harley Quinn-tessential mayhem."
    },
    {
      "text": "Gunn was clearly the ideal skipper to navigate the Squad's subversive, irreverent hard-R-rated waters."
    },
    {
      "text": "What [James Gunn] can do is let his squad have fun, and fun they have, proving that modern non-Batman DC works best at its silliest."
    },
    {
      "text": "Like the film in which he appears, King Shark revels in the chaos and the carnage, having a really good time as the world burns. Odds are, you will too."
    },
    {
      "text": "The Suicide Squad is very funny, bleakly self-aware, and shockingly violent -- a refreshing mix of familiar conventions and gory satire. In a sea of sequels, reboots, crossovers, and origin stories, it stands out like few other recent adaptations have."
    },
    {
      "text": "To his credit, Gunn deftly juggles a dizzying assortment of elements, creating memorable moments for his principals (Robbie, for example, fares much better here than in Harley's dedicated showcase vehicle)."
    },
    {
      "text": "Each character has their moment of glory. [Full review in Spanish]"
    },
    {
      "text": "With a crazy number of death-as-punchline moments and more ridiculous heroes than you can shake a giant alien starfish at, this DC Comics adaptation is an absolute hoot."
    },
    {
      "text": "A fun exercise that's a marked improvement on WB's last attempt with this property, but it doesn't feel quite as emotionally resonant or uproariously funny as it seems to think it is."
    },
    {
      "text": "I don't know if I'll ever be a connoisseur of kill-shot comedy..."
    },
    {
      "text": "There were quite a few moments in this movie that I found hilarious, and they absolutely do outweigh the moments that were just kind of a miss for me."
    },
    {
      "text": "The movie's supposed to be Elba's, and while his Bloodsport's sword-waving with Peacemaker is puckishly good second-tier fun, the shine here is Quinn. No Quinn, no movie."
    },
    {
      "text": "Not every film can follow this blueprint, but if future DCEU movies can be even half as fun as The Suicide Squad, they'll be on the right path. It's over-the-top, ultra-violent, illogical, and it's a blast."
    },
    {
      "text": "Suicide Squad is by far the best DC movie made of late. [Full review in Spanish]"
    },
    {
      "text": "Proudly profane/violently R-rated, & also relying on excellent/weird characters, TSS satisfies from beginning to glorious end. And according to Polka-Dot Man, Oedipal Wrecks!"
    },
    {
      "text": "\"The Suicide Squad\" stands on its own in a way superhero movies often don't. I feel confident audiences will be satisfied about where it ends, even if it does leave us hoping to see more of this team."
    },
    {
      "text": "Yes, it's still entertaining and rattles along at a reasonable pace. But scratch below the wafer-thin bonkers plot and gleeful mugging and the film seems to be rather less than the sum of its parts."
    },
    {
      "text": "The violence is the most consistently inventive part of the whole package, though it grows tiresome in its thudding repetition."
    },
    {
      "text": "The Suicide Squad is a bloody and gory good time, which is to be expected, but thanks to some standout performances from the cast, it also has a lot of heart that makes you care about these people even while we hear about the terrible things they did."
    },
    {
      "text": "Flamboyantly nasty, garishly gory trash-but an efficiently manufactured example of such stuff, which succeeds on its own admittedly sophomoric terms."
    },
    {
      "text": "The result is a bit better, the film improving on its predecessor in some areas, treading water in others."
    },
    {
      "text": "The Suicide Squad is a raucous mixture of hilarity and unrestrained violence."
    },
    {
      "text": "There's a real sense of narrative momentum ... the story feels like it's purposefully snowballing until the eventual reveal of an unexpected, much weirder villain."
    },
    {
      "text": "Gunn masterfully mixes humor and bloodshed and manages to give a surprising number of characters room to develop their personas. And when it comes to staging set pieces, he's at his best."
    },
    {
      "text": "The Squad is dead! Long live The Squad!"
    },
    {
      "text": "Prepare to be splattered, but also satisfied in a summer blockbuster kind of way."
    },
    {
      "text": "The Suicide Squad misses the mark almost from the very beginning as it makes its descent into the bowels of film making."
    },
    {
      "text": "Gunn comes in locked and loaded, and he pushes the envelope with everything he couldn't do in Disney's Marvel universe."
    },
    {
      "text": "While The Suicide Squad is perhaps more aggressively violent than any recent entry in the action genre, it is definitely funnier than most films calling themselves comedies in recent times."
    },
    {
      "text": "\"The Suicide Squad,\" however pessimistic, scratches a thrilling midnight movie itch."
    },
    {
      "text": "A nihilistic orgy of brightly coloured gore and violence apparently envisioned while on mushrooms. If you're sitting near the front of an IMAX theatre, it plays like being in the \"splash-zone\" of a GWAR concert."
    },
    {
      "text": "Director James Gunn tempers the gross stuff with a certain kind of sweetness and some not-so-subtle social commentary."
    },
    {
      "text": "Embracing the weird is key to enjoying James Gunn's gory, expletive-filled, hilariously twisted take on DC Comics' fictional antihero team."
    },
    {
      "text": "There is not much that can be said about the plot without ruining its best parts, but it can be noted that this is very much writer-director James Gunn's movie."
    },
    {
      "text": "Elba gives Bloodsport an exhausted but appealing edge with surprising vulnerability. Dastmalchian and Stallone mine genuine humanity out of their goofy characters, and Malchior is the beating heart of The Suicide Squad."
    },
    {
      "text": "For the first hour of The Suicide Squad I found myself on the edge of my seat, truly feeling like I was watching something fresh."
    },
    {
      "text": "...a hyper-violent, noisy, brash, stylish and frequently hilarious shot in the arm for superhero movies..."
    },
    {
      "text": "James Gunn holds nothing back in this wickedly entertaining orgy of blood, guts and F-bombs. [Full Review in Spanish]"
    },
    {
      "text": "Essentially a sarcastic, post-ironic action painting of splurge thrown on the biggest screen possible...just, stuff on the screen, some of which is quite bonkers and funny, but it felt like a big inside joke, that was my problem..."
    },
    {
      "text": "Maybe it is its own triumph to have at least stretched a rigid medium into new shapes for a little while. The Suicide Squad can't hold the pose for long, but while it does, it's an enjoyable flex."
    },
    {
      "text": "Its foulmouthed energy gives new life to the superhero genre, which has threatened to become too stolid attempting to appeal to the kids."
    },
    {
      "text": "while Gunn maintains his usual baseline of irreverent humor and character work in The Suicide Squad, this is the first of his movies that suggests he could stand to learn some new tricks."
    },
    {
      "text": "A second crack at Suicide Squad' surpasses the original...Harley Quinn and Rick Flag are back in a delirious mashup full of humor and head-splitting."
    },
    {
      "text": "\"The Suicide Squad\" is juvenile fun of the highest measure with just the tiniest bit of heart to make you not feel like a complete degenerate for reveling in all the onscreen carnage."
    },
    {
      "text": "It's a thrill to look at Viola Davis unmoved face when her character realizes the poor job her staff has done while putting together a team of assassins. Plus, she looks great in a lilac pencil skirt power suit."
    },
    {
      "text": "It is a fast-paced thrill ride from start to finish, and Gunn's style is a perfect fit. All of this makes it one of the best movies of the year."
    },
    {
      "text": "Surprisingly conventional for a comic book movie that weaponizes polka dots."
    },
    {
      "text": "Tries to reset the brand name for future abuse, but with a weird blend of reverence and irreverence Gunn is better at communicating when denied permission to indulge his love of extremity."
    },
    {
      "text": "Gory, sentimental, brazenly adolescent, and never short on imagination, The Suicide Squad could be described as the essence of Gunn, if not exactly the film of a free man."
    },
    {
      "text": "Some movies leave you wanting more. \"The Suicide Squad\" is a blast, for a while, but it leaves you wanting less."
    },
    {
      "text": "Reader, I enjoyed it."
    },
    {
      "text": "In \"The Suicide Squad,\" writer-director James Gunn has done the seemingly impossible: He has found the fun in the Suicide Squad"
    },
    {
      "text": "This is so clearly the film that they should have made the first time around that even as you watch it unfold with various degrees of delight and disbelief, you may find yourself hating the earlier film all the more."
    },
    {
      "text": "Jettisoning most of the characters from the 2016 movie and leaning hard into absurd elements, writer-director James Gunn orchestrates a mostly funny mission-from-hell adventure that ranks right up there among the goriest comedies ever made."
    },
    {
      "text": "It's not often a comic book flick will have you critiquing Reagan-era politics while also enjoying the lizard-brain pleasures of a creature feature smash-em-up, but that's just the special sauce that James Gunn brings."
    },
    {
      "text": "James Gunn nails the antihero saga, brings Harley Quinn back from the woke ledge."
    },
    {
      "text": "It has so much of the glossy sheen of the pages of a graphic novel that you can practically smell the ink. A huge improvement on the first film."
    },
    {
      "text": "An enjoyably overstuffed summer blockbuster that easily could have been as calamitous as its predecessor."
    },
    {
      "text": "The Suicide Squad is the best film of the year so far and not just an instant genre classic, but a classic on the whole."
    },
    {
      "text": "Thanks to a much clearer vision, this remarkably strong comic book movie pulls no punches in its attempts at pitch-black comedy, gory violence, and a total sense of irreverence."
    },
    {
      "text": "The Suicide Squad is a devilishly funny hurricane of carnage. Writer/director James Gunn has a field day exploring the bizarre abilities of his freakshow team."
    },
    {
      "text": "The Suicide Squad is a masterclass in its own genre, coming from the creative, albeit dangerous mind of James Gunn. It entertains from start to finish, it isn't afraid to be ultraviolent while being superbly funny."
    },
    {
      "text": "The Suicide Squad shares more in common with a show like Amazon's The Boys than Wonder Woman or Justice League, and that's a unique space that plays well to James Gunn's strengths as a filmmaker."
    },
    {
      "text": "What's exciting about this second time at bat for the franchise is that it perfectly marries the two seemingly oppositional phases of Gunn's filmmaking career."
    },
    {
      "text": "It's endearingly sweet, even as it's spilling brain matter and gore by the bucket load."
    },
    {
      "text": "It's more fun than it should be, considering the violence tends to grow repetitive; visual grotesqueries lose their potency when so much of the picture is an orgy of death."
    },
    {
      "text": "This Year You Will Believe that The Suicide Squad Will Make You Cry"
    },
    {
      "text": "A director-driven deranged masterpiece of a live-action comic book movie, unlike anything I've seen before."
    },
    {
      "text": "One of the best comic book movies in years, and easily the best DC one since Christopher Nolan had his hands on some of these characters."
    },
    {
      "text": "Spanks the 2016 film and sends it off to the corner to think about what it did. This one is the definite article: Gory, grim, bleakly funny. Full of feverish, anarchic energy and exhausting cynicism."
    },
    {
      "text": "Throughout, James Gunn renders the half-grim, half-absurdist nature of the Suicide Squad with delightfully bloody abandon."
    },
    {
      "text": "James Gunn's gleefully irreverent second stab at the infamous DC comics property, \"The Suicide Squad\" feels like a refreshing dose of sarcasm in a genre that often takes itself too seriously."
    },
    {
      "text": "Violence and gore coat a creamy, heart-filled center."
    },
    {
      "text": "Lean, mean, and stuffed to the gills with charisma, James Gunn's The Suicide Squad just wants to save the world, one f**k-up at a time."
    },
    {
      "text": "The Suicide Squad is that rare sequel that far exceeds its predecessor."
    },
    {
      "text": "With a robustly anarchic air, The Suicide Squad is funnier, grittier, more sardonic and better cast than its predecessor - and, with its love for comedy infused ultra-violence, both more grown-up and a lot sillier."
    },
    {
      "text": "A giddily violent, gory, and outlandish romp that will leave you richly satisfied, 'The Suicide Squad' reaches a new pinnacle for the DCEU."
    },
    {
      "text": "I laughed and cried with \"The Suicide Squad,\" not be confused with 2016's \"Suicide Squad\" which lacked the article defining it as well as a sense of humor, rhythm, or focus."
    },
    {
      "text": "If you're an adult with a penchant for blood, gore and hilarity combined, don't miss Gunn's homage to these maniacal villains."
    },
    {
      "text": "THE SUICIDE SQUAD is as deserving of an R-rating as any movie, but it's all in the name of campy fun."
    },
    {
      "text": "James Gunn has spiced the broth but it's still thin and no substitute for a decent meal."
    },
    {
      "text": "the real heroes of \"The Suicide Squad\" are not the movie stars or the effects mavens. It is the huge list of stunt people involved in the making of the copious action."
    },
    {
      "text": "The Suicide Squad is James Gunn at his most unhinged, unrestrained and unleashed, but the result is one of the best DC movies in years."
    },
    {
      "text": "The key: a director with a taste for anarchy, who crawled out of the same toxic sewer sludge as most of the characters."
    },
    {
      "text": "James Gunn sets things right with the new Squad. It's DCEU's grittiest and most irreverent movie to date. Luckily the new character's charming qualities and the group's chemistry outweigh the weakest part of the movie - the human villains."
    },
    {
      "text": "The Suicide Squad is the superhero movie equivalent of someone who will kiss you and kick you at the same time. Within the first 15 minutes of the movie, there are surprises that most superhero movies would never dare to have."
    },
    {
      "text": "Though not to be confused with the 2016 action caper Suicide Squad, James Gunn's noisy sequel aims for a similar style and tone -- trashy and unpleasant. In this, and this alone, it succeeds."
    },
    {
      "text": "The Suicide Squad is an absolute blast..."
    },
    {
      "text": "This truly is a DC comic brought to life, smashing together bright colours and fantastical visuals with the most cartoonish violence this side of an Itchy & Scratchy episode."
    },
    {
      "text": "It is not for children. It's not really for adults either. But the eternal inner adolescent that lives within us all will almost certainly have a swell time."
    },
    {
      "text": "It's not a comic book movie classic but you'll have a bloody good time with The Suicide Squad, an action-packed, often hilarious, take on Task Force X that breathes new life into the DC Extended Universe even if occasionally strikes a bum note."
    },
    {
      "text": "Gunn's screenplay doesn't shy away from political commentary while he's generally having a blast righting the Squad ship left floundering in 2016. It is no surprise that this Suicide Squad has a very Guardians feel."
    },
    {
      "text": "This is just a joyful, heartfelt, and blood-drenched comic book spectacle that does the Squad the utmost justice."
    },
    {
      "text": "[John Cena's] laughing at himself all the time and it works really well. [Full review in Spanish]"
    },
    {
      "text": "Instead of dwelling on trying to make his bad guys good, Gunn leans into their psychotic tendencies and mixes them all together to create a cocktail of crazy that will shock and delight audiences."
    },
    {
      "text": "The Suicide Squad might be the kindest superhero film ever made. Sure, it's about criminals forced into life-threatening missions at the promise of freedom and the threat of death. But under all that ultra violence lies something far sweeter."
    },
    {
      "text": "Not a single gag lands and most of them offend. This might actually be worse than the first one."
    },
    {
      "text": "A feast of blood we didn't think possible in nowadays superhero cinema. (...) It's funny, naughty, filled with action that doesn't erase its heart. [Full review in Spanish]"
    },
    {
      "text": "Gunn's cinematic paradise has enough visual dazzle for three regular movies; the equivalent of the kitchen sink being tossed at the wall... twice for good measure."
    },
    {
      "text": "The Suicide Squad is a lot of movie that can't always pull off its biggest, boldest ideas, but it's not the rehash its title implies."
    },
    {
      "text": "Gunn honors and embraces the comic's silly essence and the social criticism. [Full review in Spanish]"
    },
    {
      "text": "Only the man who wrote Tromeo and Juliet could deliver something this gleefully grotesque, vicious, and unapologetic, and the DC Universe is all the better for it."
    },
    {
      "text": "[A] ferociously funny, foul-mouthed and ultra-violent film..."
    },
    {
      "text": "Gunn breathes new life into the hit-or-miss DC franchise."
    },
    {
      "text": "A gonzo mix of insouciant violence, demented comedy, expressionistic comic book flourishes and strangely beautiful cinematography..."
    },
    {
      "text": "In many ways, the gleefully profane, anything-goes mayhem of The Suicide Squad feels like a mega-budget version of the Troma Studios productions that gave Gunn his start. And thank goodness for that."
    },
    {
      "text": "An epic that's as adorable as it is violent."
    },
    {
      "text": "[James Gunn] gets that this Squad has to remain unprincipled and, most importantly, really, very incredibly fun."
    },
    {
      "text": "The Suicide Squad is probably the closest we'll get to a big-budget Troma film released by a major studio, and it's high time we treasured it, warts and all."
    },
    {
      "text": "I can't think of anyone better than James Gunn to have served up this hilarious mayhem without letting the whole thing slide into nihilism or lose touch with actual emotion amid the body count."
    },
    {
      "text": "It truly feels like Gunn's career has come full circle on this film, and I loved how wonderfully unhinged The Suicide Squad is at times, where Gunn's enthusiasm for crafting bizarre cinematic experiences is fully on display from start to finish."
    },
    {
      "text": "This is a movie where the US government hires a shark that talks like Sylvester Stallone to tear people in half, and it is sick. It is sick as hell."
    },
    {
      "text": "Fuses James Gunn's early career Troma sensibilities with the enormous misfit heart of Guardians of the Galaxy while giving Margot Robbie's Harley Quinn some of her best action and dialogue thus far"
    },
    {
      "text": "Gunn gels it together with a wicked sense of humour and an evident affection for his characters who, though not so endearing as his Guardians of the Galaxy, are a hoot to hang around with."
    },
    {
      "text": "It lets writer-director James Gunn indulge his wildest impulses in a way Marvel would simply never allow and still manages to be very funny and emotionally satisfying,"
    },
    {
      "text": "The Suicide Squad is a blast! Great action, lots of humor and fun twists with an awesome soundtrack. James Gunn does it again! [Full review in Spanish]"
    },
    {
      "text": "\"The Suicide Squad\" is relentlessly unapologetic, wacky and weird, violent and bloody, and darkly humorous. It also has so much heart that you may find yourself fighting back tears by its end."
    },
    {
      "text": "Gleefully wicked, fabulously demented, and gloriously gory--who knew villains could be this good."
    },
    {
      "text": "It is Mr. Gunn's voice here in every scene, in every blood-soaked encounter, every brilliantly placed song, and every moment of humor and heart it's because of James Gunn - as well as the incredible talent he brought with him."
    },
    {
      "text": "Goofiness mixed in with lingering shots of maimed lasagne-like innards feels just plain wrong."
    },
    {
      "text": "Though there appears to be a ceiling to Gunn's familiar template, this is still a very enjoyable entry that ranks amongst the better examples of the DC Universe and miles ahead of most of them."
    },
    {
      "text": "Faint praise may be all the praise one can muster for The Suicide Squad but knowing the Suicide Squad that may be more than enough."
    },
    {
      "text": "A film considerably more entertaining than its predecessor, retaining the cold draught of bleakness that blows through the best of the DC Universe but with the visual brightness and romantic yearning that makes Gunn's work pop."
    },
    {
      "text": "From the eclectic soundtrack to the over-the-top violence and jet-black humor this is a movie only Gunn could deliver and it's easily the best of the DCEU."
    },
    {
      "text": "This film is a wild ride full of intense action scenes, hilarious dialogue, and characters dripping in charisma. If chaotic good were a movie, it would be this one."
    },
    {
      "text": "Amazing!! Insanely violent, wide on it's level of scope, humor is at its Peak for DC, & it's so much fun! James has given us yet another one of the Best in Comicbook Films!"
    },
    {
      "text": "Even more than the Guardians of the Galaxy pictures, Gunn's Suicide Squad overflows with characters and personalities."
    },
    {
      "text": "[I]f you're an individual hooked into Gunn's wavelength, you're going to have a raucous good time."
    },
    {
      "text": "Gunn's relentlessly entertaining film just doesn't stop moving."
    },
    {
      "text": "The perfect length, the perfect cast, the perfect amount of action, comedy, and gore - and it all comes together to tell a heartwarming and emotional story. A masterpiece."
    },
    {
      "text": "Now that's how you do it."
    },
    {
      "text": "James Gunn is unleashed, unhinged, and unstoppable in the most absurd and gory DC film to date!"
    },
    {
      "text": "The Suicide Squad is the funniest DC film since Shazam."
    },
    {
      "text": "When Gunn took on Guardians Of The Galaxy, he turned nonsense into gold for Marvel. By giving The Suicide Squad the same sense of mischief and an equally surreal streak, he's done the same for DC."
    },
    {
      "text": "The Suicide Squad is a vast improvement. And in a world where a movie as bad as Suicide Squad (2016) exists? That's enough."
    },
    {
      "text": "It's dazzlingly colourful and riotously crass, but also emotionally alive."
    },
    {
      "text": "The whole of James Gunn's zany and violent 'The Suicide Squad' is less than the sum of its parts, but many of those parts are pretty damn great."
    },
    {
      "text": "Though deliciously violent, unapologetically haywire, and wildly uproarious, it's also brilliantly audacious, sharply intelligent and surprisingly heartfelt."
    },
    {
      "text": "Gunn's distinct and self-assured vision, which he's said was left untouched and unbothered by studio interference, puts The Suicide Squad alongside the very best of modern comic-book filmmaking."
    },
    {
      "text": "That Warner Bros. would surrender one of their biggest franchises to this kind of filmmaking voice is a minor miracle."
    },
    {
      "text": "The Suicide Squad not only raises the bar for just how much a superhero movie can accomplish in one sitting, but it proves that the weird and oft-forgotten comic characters are superstars deserving of your attention."
    },
    {
      "text": "Whichever way you slice it, this Squad (aka Task Force X) is fun to hang out with."
    },
    {
      "text": "A good half of the jokes don't land, but unlike his predecessor's joyless slog, Gunn's version at least celebrates the nonsense..."
    },
    {
      "text": "Sometimes, you just need to watch a humanoid shark tear a man in half."
    },
    {
      "text": "What emerges through the array of flying limbs is a surprisingly tender tribute to camaraderie, and an ode to all the despised and misunderstood creatures out there."
    },
    {
      "text": "Pitched somewhere between a reboot and a sequel, this is a violent, foul-mouthed and gleefully bonkers attempt to right the wrongs of David Ayer's Suicide Squad."
    },
    {
      "text": "Not everything works here, but the sheer crazy confidence-through-chaos of the Suicide Squad and their bizarrely dysfunctional MO makes for a mighty spectacle."
    },
    {
      "text": "Mines incredible fun from being brutally unkind to its \"heroes.\""
    },
    {
      "text": "Writer/director James Gunn achieves delirious multimedia fidelity with The Suicide Squad, his bombastic, silly and self-aware revisionist take on the super-group of screw-ups."
    },
    {
      "text": "Embraces a superhero vibe (even chock-full of morally questionable rogues hoping the government doesn't blow their heads off) and adds elements of workplace comedy, gritty war movie, dysfunctional family drama and kaiju disaster flick."
    },
    {
      "text": "'...a vast improvement on the famously soulless original...'"
    },
    {
      "text": "If the movies are killing themselves with superhero overload, at least \"The Suicide Squad\" suggests the medium will go down laughing."
    },
    {
      "text": "Within \"The Suicide Squad\" is not only a negotiation with American power, and its depiction in comic-book movies, but a heartfelt if extreme gallery of damaged souls. It's a kind of genuinely tender freak show."
    },
    {
      "text": "After 2016's ugly, bludgeoning \"Suicide Squad,\" I couldn't imagine liking - and could barely stomach the idea of seeing - another movie called \"Suicide Squad.\" I'm delighted to be proven wrong."
    },
    {
      "text": "A really entertaining hard-R-rated take on the property that has just as much in common with '60s-era movies like The Dirty Dozen and Kelly's Heroes as it does with most of the DC canon."
    },
    {
      "text": "It's exactly what we want from a blockbuster: a genuinely unique movie that's the product of a filmmaker, rather than a committee. And it also helps that The Suicide Squad is also just so entertaining as a result."
    },
    {
      "text": "James Gunn absolutely kills it with The Suicide Squad. The film is a bloody, chaotic ride from start to finish that finally does justice to Task Force X."
    },
    {
      "text": "Not only does it find the nastily enjoyable vibe that eluded its predecessor, but it also tells a story worth following..."
    },
    {
      "text": "Gunn has dialled the comic book movie up to 11 with The Suicide Squad, in one of the most unabashedly bonkers, action-packed & surprisingly emotional DC flicks"
    },
    {
      "text": "The Suicide Squad, from the mind of writer-director James Gunn, is both wickedly entertaining and shamelessly depraved fun set in the DC movie world."
    },
    {
      "text": "\"The Suicide Squad\" is cunningly scuzzy, disreputable fun."
    },
    {
      "text": "One of the franchise's biggest, bloodiest and most bizarre movies yet - and also one of its best."
    },
    {
      "text": "The unexpected heart at the center of the film, a sneaky anti-imperialist bent, and Gunn's wild visual leaps make The Suicide Squad a bloody, gory delight."
    },
    {
      "text": "Brilliant, bloody and brutal. James Gunn takes aim at the absurdities of the superhero genre and gives it both barrels."
    },
    {
      "text": "By no means perfect, but like the Deadpool movies, it's a showcase for what can happen when a superhero movie is allowed to be sprightly, self-aware, and sardonic while also indulging in hard-R violence, gore, and language."
    },
    {
      "text": "We finally get to see the R-rated DC Comics movie so many have been clamoring for."
    },
    {
      "text": "The cast feels secure in their roles. Margot Robbie's Harley Quinn is in full bloom, and you can see that she's not only got hold of the character, but that the script gives her room to breathe."
    },
    {
      "text": "The edgy adventure that the first Squad was supposed to be."
    },
    {
      "text": "Fantastic! A no holds barred, superhero/comics bonanza. Unpredictable in story, unique in style and full of risks. Violent and hilarious. [Full review in Spanish]"
    },
    {
      "text": "Both sides of James Gunn's personality are on display in \"The Suicide Squad,\" a gnarly, irreverent, bloody, R-Rated comic book movie with a big empathetic heart."
    }
  ],
  "release_year": 2021,
  "duration": 132,
  "genres": [
    "Action",
    "Adventure",
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Welcome to hell--a.k.a. Belle Reve, the prison with the highest mortality rate in the US of A. Where the worst Super-Villains are kept and where they will do anything to get out--even join the super-secret, super-shady Task Force X. Today's do-or-die assignment? Assemble a collection of cons, including Bloodsport, Peacemaker, Captain Boomerang, Ratcatcher 2, Savant, King Shark, Blackguard, Javelin and everyone's favorite psycho, Harley Quinn. Then arm them heavily and drop them (literally) on the remote, enemy-infused island of Corto Maltese. Trekking through a jungle teeming with militant adversaries and guerrilla forces at every turn, the Squad is on a search-and-destroy mission with only Colonel Rick Flag on the ground to make them behave...and Amanda Waller's government techies in their ears, tracking their every movement. And as always, one wrong move and they're dead (whether at the hands of their opponents, a teammate, or Waller herself). If anyone's laying down bets, the smart money is against them--all of them.",
  "popularity": 8.2,
  "poster_url": "https://image.tmdb.org/t/p/original/q61qEyssk2ku3okWICKArlAdhBn.jpg"
}