{
  "movie_name": "The Hangover",
  "movie_id": "10010667-hangover",
  "total_reviews": 229,
  "reviews": [
    {
      "text": "There is little surprise that ‘The Hangover 2’ is already in pre-production, this film is so good that it deserves to do well at the box office. ‘The Hangover’ is one of the funniest films of the year and is a must for those who love to laugh out loud."
    },
    {
      "text": "Temporary and fading, it limits itself with its reliance on gross-out humor; once you’ve seen the depravity onscreen, the shock no longer exists, making its rewatchability nil. You’ll laugh a lot the first time you see it but see it only once."
    },
    {
      "text": "Over at the Nevada Film Office, none of us staff members thought a little comedy with not-too- familiar stars would produce a Mike Tyson knock-out punch..."
    },
    {
      "text": "It may not be the most groundbreaking comedy, but following the drunken leads' exploits in reverse is a formula for a great time."
    },
    {
      "text": "What happens in Vegas is very funny, indeed."
    },
    {
      "text": "The filmmakers throw in so many forced elements of farce, that it dissipates the sense that maybe, just maybe, this kind of thing could happen to any of us."
    },
    {
      "text": "Here's a comedy that understands how to be raunchy and smart -- and isn't afraid to get a laugh at any expense."
    },
    {
      "text": "Galifianakis went from being an alt-comedy idol to a mainstream pop culture figure. The Hangover still feels like a breath of fresh air."
    },
    {
      "text": "Maybe, just maybe, the movie drags like a half-detached muffler and for some reason nobody wants to mention it."
    },
    {
      "text": "Though it looks like just another men-will-be-guys-will-be-boys-will-be-idiots affair, this well-scripted affair still stands up as a refreshingly unpredictable laugh machine."
    },
    {
      "text": "The movie, in the end, feels as as shabby as the unfulfilled lives that, we assume, these men will resume once the fun and games are over."
    },
    {
      "text": "In the case of The Hangover, Phillips made a decent diversion, but no classic; like its heroes you'll have a good time, then forget most of it when you wake up the following morning. It's a movie, not a film."
    },
    {
      "text": "... I went in to The Hangover with low expectations but ended up laughing more times than I thought I would."
    },
    {
      "text": "This is lazy, condescending half-assed filmmaking. When in doubt, simply slap a piece of rap music overtop of the action."
    },
    {
      "text": "The galaxy Galifianakis is beaming in from is infinitely more fascinating than the one this film occupies, but his visits from Beserko World are more than worth it."
    },
    {
      "text": "The kind of brilliant comedy that will have you gasping, laughing so hard you'll have tears in your eyes and rocking back in your chair from laughter."
    },
    {
      "text": "Just when you think things can't get any more farcical, they do: The Hangover is the Crank of comedy."
    },
    {
      "text": "If the movie's gleeful rush into areas of questionable comedic taste occasionally raises an eyebrow here and there, the end sequence will sear them right off."
    },
    {
      "text": "A younger generation is finding new stupid things to do underneath the desert sun."
    },
    {
      "text": "Starting on Monday, Coogan and Bryden share meals . . . and what passes for conversation. When they're not insufferable, they're boring"
    },
    {
      "text": "I highly recommend going into this film blind, just to keep some of the surprises from being ruined. Oh, and being a 21-year-old male will also really help you to enjoy this flick."
    },
    {
      "text": "The Hangover might not be top class indie pop art, but the film represents the best of what comedy can provide -- pure, unadulterated, slaphappy entertainment. And there's nothing wrong with that."
    },
    {
      "text": "I can definitely understand why it was a humongous hit, but when all is said and done, once was enough for this partier..."
    },
    {
      "text": "It's good for wasting time and pondering the absurdity of not-so-random events, but not for much else."
    },
    {
      "text": "The Hangover never pretends to be anything other than what it is, and, partially for that reason, it carries quite a kick."
    },
    {
      "text": "The Hangover doesn't contain the constant rip-roaring laughs the likes of Superbad or some of the Frat Pack's best."
    },
    {
      "text": "Bachelor Party meets Dude, Where's My Car (and about as entertaining as the two of them averaged together.)"
    },
    {
      "text": "The stupid fun of The Hangover is worth experiencing at least once. [Blu-ray]"
    },
    {
      "text": "Todd Philips, who wrote and directed Road Trip and Old Scool, wrote Borat, and even plays the coked out Israeli dude in the elevator in The Hangover, has had his finger on the pulse of modern comedy cinema for a decade."
    },
    {
      "text": "Quite entertaining as an entry in this tried-and-true genre of \"guys going on a inadvertent wacky adventure,\" and I like how this one is set up as a kind of mystery."
    },
    {
      "text": "The real underlying message of The Hangover, as in most of Phillips' films, is that women are shrews, whores and/or fools-though Galifinakis is the only one to deal with the homoerotic subtext within the male bonding."
    },
    {
      "text": "works not because it is a comedy, but because its unimpressive comedic content is framed by much more interesting detective story"
    },
    {
      "text": "...apparently, I have no sense of humor for finding so little joy in the runaway hit comedy 'The Hangover.'"
    },
    {
      "text": "Question: What do Mike Tyson's tiger, a chicken, a horrible effeminate Chinese man stereotype naked in a car trunk, a stolen police car, a baby, a missing tooth and Phil Collins' music all have in common? Answer: Nothing..."
    },
    {
      "text": "The Hangover's witless regression is unforgivable."
    },
    {
      "text": "The raucous, raunchy laughs are indeed plentiful and the gags often outrageous, but what really drives the film is the unpredictability of the script."
    },
    {
      "text": "Leave the kids at home, round up a group of guys and head out to the theater for a good time."
    },
    {
      "text": "Fear and loathing and douchebaggery in Las Vegas"
    },
    {
      "text": "O mais surpreendente é o cuidado com que o roteiro desenvolve seus três personagens principais."
    },
    {
      "text": "The Hangover isn't painful to watch. If friends drag you to this movie, you won't hate them afterwards. But maybe it'll seem a lot funnier if you are drinking."
    },
    {
      "text": "It is easily the most unlabored comedy of the recent past. But seriously, how many times has a story like this been told?"
    },
    {
      "text": "You'd have to be drunk..."
    },
    {
      "text": "A comedy binge-fest you won't regret in the morning."
    },
    {
      "text": "It is classless, it is tasteless, it is idiotic, it is juvenile and it is something your mother totally wouldn't approve of. But it also is flat-out hilarious."
    },
    {
      "text": "My only complaint about The Hangover is that so many excellent moments were ruined by the preview. The Hangover, particularly Ed Helms, is very funny. Don't bring a family member and don't try any of this at home."
    },
    {
      "text": "Easily, one of summer's more outrageous, funny comedies."
    },
    {
      "text": "Galifianakis is a revelation of wrong."
    },
    {
      "text": "The Hangover is funny but not deeply so. There's a difference between funny incidents piled up in a line and people who make us laugh because of who they are."
    },
    {
      "text": "Comedies have rarely been as lazy as this, nor have they been so adamantly stupid."
    },
    {
      "text": "You could say his new film The Hangover is the Reservoir Dogs of party movies. Reservoir Dogs was a heist film that never shows you the heist, and The Hangover is about a wild night in Vegas that only shows the aftermath."
    },
    {
      "text": "Rising-star Bradley Cooper and gang represent the dirtbag element that has become acceptable in contemporary comedy."
    },
    {
      "text": "Who knew that we needed a 'Dude, Where's My Car?' for grownups?"
    },
    {
      "text": "The director and his screenwriters have come up with the funniest film to appear in ages. It avoids the predictable crudity and silly laddishness (well, almost) you'd expect, and delights with zinging one-liners and charming performances."
    },
    {
      "text": "The director, harnessing the talents of a relatively unknown cast, creates a genuine minor classic of the genre."
    },
    {
      "text": "This is an above par effort, excellently played and just naughty enough to be thought daring as well as amusingly spiteful."
    },
    {
      "text": "If only real hangovers were this much fun."
    },
    {
      "text": "'The Hangover' is an outrageous, entertaining, laugh-out-loud classic from beginning to end."
    },
    {
      "text": "\"The Hangover\" will induce headaches - from laughter."
    },
    {
      "text": "It is sometimes coarse, and there are some scurrilous scenes. But this is an inventive, funny, entertaining movie."
    },
    {
      "text": "Now I'm not sure if urinating explicitly on screen is one giant step for mankind or not, but one should not be surprised that the comedy in which this has occurred has been directed by Todd Phillips."
    },
    {
      "text": "To call it 'atrocious' and 'loathsome' is to pussyfoot around the truth."
    },
    {
      "text": "Pushing the envelope unlike anything the industry has offered us this year; \"The Hangover\" provides the escape factor. Prepare for the wild ride!"
    },
    {
      "text": "The cast is personable, the photography is attractive, the script is cleverly constructed and mildly amusing but there is nothing here that screams comedy classic."
    },
    {
      "text": "It doesn't help that the central cast is almost entirely forgettable, from the smug lounge lizardry of Bradley Cooper to the boisterous Jack Black-lite of Zach Galifianakis."
    },
    {
      "text": "Consistently funny, The Hangover proves you don't need a big-name Hollywood cast to get big laughs. Destined to appeal to the lads everywhere, that the film doesn't only resort to gross-out gags means female audiences should give it a go."
    },
    {
      "text": "The lads duly lurch from one bewildering crisis to another."
    },
    {
      "text": "It turns out to be every bit as crass, offensive and incorrect as you'd expect, but it's also - gulp! - really very funny an awful lot of the time, as well as bizarrely gripping."
    },
    {
      "text": "Everything works here; the characters are funny, the set-ups are funny, the lines are funny."
    },
    {
      "text": "The Hangover amounts to a gut-bustingly funny boy's own comedy."
    },
    {
      "text": "Debauched, depraved and very, very funny."
    },
    {
      "text": "The cracking script - a veritable treasure trove of smart one-liners - and beautifully-worked setpieces make this one of the most enjoyable comedies of the year."
    },
    {
      "text": "Succeeding equally well as rowdy romp, what-happened mystery and man-crush comedy, /The Hangover/ is an unexpected winner."
    },
    {
      "text": "With a great soundtrack and script so sharp you might need to take plasters into the cinemas with you because you might come out with cuts... this is this summer's must see comedy."
    },
    {
      "text": "Rude, crude and defiantly male, it's the ultimate phallocentric antidote to Sex And The City, and easily the funniest American comedy of the year."
    },
    {
      "text": "Lewd, crude and exceptionally rude, the gags come thick and fast."
    },
    {
      "text": "A devilishly smart comedy gem that manages to blend the raunchy and the rowdy with some deliciously left-field humour."
    },
    {
      "text": "A furiously paced, inventive and flat-out hilarious take on a tried-and-tested formula. An exemplary bromantic comedy that doesn't sacrifice heart in pursuit of laughs, maintaining plenty of the former and a superabundance of the latter."
    },
    {
      "text": "The Hangover serves up a steady stream of big, dumb laughs, but you may feel a gnawing sense of guilt right afterwards."
    },
    {
      "text": "Laugh? Well, at least, on a tough Tuesday in Tube-meltdown London, one chuckled."
    },
    {
      "text": "Some very funny, very non-PC dialogue is thrown about like a game of catch. The actors, virtually unknown, are terrific."
    },
    {
      "text": "A wee-inducingly funny bromance."
    },
    {
      "text": "Hugely enjoyable and frequently hilarious, this is a sharply written comedy with strong comic performances from a terrific ensemble cast."
    },
    {
      "text": "It's not very sophisticated, but this raucous comedy keeps us laughing with its sheer absurdity. The characters are very well-played and their interaction is genuinely hilarious, even if most of the jokes are pretty cheap."
    },
    {
      "text": "This is top stuff. There's all the carnage, baps and humiliation you could want from a 15-rated comedy but it's pegged around a smart plot that actually holds up. Take out the laughs, and The Hangover would still work as a gripping, if barmy thriller."
    },
    {
      "text": "It kicks this sub-genre up a gear with an anarchic sense of fun and a consistently high gags-to-giggle ratio that knows when to push the envelop of taste and when to pull back a little."
    },
    {
      "text": "The revelations of the night before won't shock you (strippers, wedding chapel, drugs), but there's so much vomiting, car crashing and tasering of genitals that you don't have time to ponder how uninteresting the story really is."
    },
    {
      "text": "Hilarious from go-to-whoa and visually compelling in its rarely seen Vegas-by-day aesthetic, The Hangover is the very definition of raucous entertainment, and will undoubtedly rate as one of the comedies of the year."
    },
    {
      "text": "Hangover shows no mercy in its quest for laughs."
    },
    {
      "text": "The best bachelor party movie since, well, \"Bachelor Party\""
    },
    {
      "text": "You might be embarrassed by laughing at some of the silliness, but don't be: Everyone else will be cracking up, too."
    },
    {
      "text": "A fast-moving, constant joking, how funny is a guy pulling out his own tooth kind of movie."
    },
    {
      "text": "Stands up as a motion picture in addition to working as a delivery system for gags... as fine a mystery and character study as it is a comedy."
    },
    {
      "text": "If a bachelor party bender is your thing, you've got company. I didn't say taste."
    },
    {
      "text": "What makes any film work, and this is particularly true of comedy, is making it real, even though everything we're seeing is completely unbelievable. I laughed a lot with this one."
    },
    {
      "text": "The performances are solid, with a special nod to the droll buffoonery of Zach Gilifianakis, whose character is out of it even when he is sober and alert."
    },
    {
      "text": "Raunchy comedy about a bachelor party gone wrong."
    },
    {
      "text": "There are some funny moments in the movie but there are some unfunny ones as well. It's an okay movie but it doesn't live up to the hype."
    },
    {
      "text": "Great casting benefits the movie hugely, as does a premise centered around the mystery of what happened, but its choppy editing does it no favors."
    },
    {
      "text": "a cleverly vulgar comedy that manages to take a tired conceit and make it feel inventive and consistently funny"
    },
    {
      "text": "It gets the job done thanks in large part to the breakout performance given by Galifianakis."
    },
    {
      "text": "Vulgar, obscene and offensive, The Hangover is one of the funniest movies I've seen in a very long time and is surely destined to become a comedy classic."
    },
    {
      "text": "There is a lull toward the end, where you almost become as exhausted as the boys on the trip. But (and I rarely say this) thank goodness for those end credits."
    },
    {
      "text": "While its boisterous fun has strong libidinous overtones, it never takes the plunge into full, frothing raunch."
    },
    {
      "text": "There are people who will not find this film amusing. Amish elders. Infants. An Iowan farmer named Burl. And that should cover it. The rest of you: bring a change of underwear."
    },
    {
      "text": "If there's a problem with 'The Hangover' (and other films of its ilk), it's the at best ambivalent, at worst hostile relationship to women..."
    },
    {
      "text": "Just as a marriage is built on love and promises kept, so can a bromance. \"The Hangover\" honors and cherishes that idea in slickness and stealth, and will have audiences unsure of how to say Zach Galifianakis but certain he's a star."
    },
    {
      "text": "There's a better cast here than there deserves to be."
    },
    {
      "text": "Amusing but a bit overrated. Yes, it's a great comic premise but only partially fulfilled in a raucous summer comedy aimed squarely at the frat boy in all of us."
    },
    {
      "text": "A picture which periodically pushes the envelope further than the average moviegoer is probably capable of stomaching via ill-advised departures into such taboo subjects as child molestation, all in search of a cheap joke."
    },
    {
      "text": "The juxtaposition of the characters is ingenious. This is one of the funniest movies I've seen in a long time."
    },
    {
      "text": "Unlike last years rather uninspiring What Happens in Vegas, the hysterical The Hangover actually ends up doing Sin City proud."
    },
    {
      "text": "The jokes and sight gags are hit and miss, but the plot and characters are compelling and it has a lot of twists and turns that keep you guessing right up to the end."
    },
    {
      "text": "The plot climaxes in what could be the best credit roll outtakes in movie history. If not that, they certainly rank as one of the best-ever punch lines."
    },
    {
      "text": "\"The Hangover\" pretty much demands you leave your Political Correctness Cap at home and urges you to eschew your Thinking Cap as well."
    },
    {
      "text": "When the years have passed and the buzz has worn off, I honestly feel that people will look back at The Hangover and wonder what they laughed at in 2009. It's the Zima of movie comedies."
    },
    {
      "text": "...the movie suffers from a variety of problems that are ultimately exacerbated by Phillips' progressively desperate efforts at wringing laughs out of material that could hardly be more tedious."
    },
    {
      "text": "The Polaroids of the bachelor party shown during the end titles deliver the genuine laughs the movie has promised; they're better than the entire movie that preceded it."
    },
    {
      "text": "Unless you find the man-infant Galifianakis appealing, you%u2019ll surely spend The Hangover wistfully remembering the days when Will Ferrell made good movies and Luke Wilson was still relevant."
    },
    {
      "text": "The guilty pleasure comedy hit of the summer has arrived. This could be the breakout role for Galifianakis."
    },
    {
      "text": "This represents the worst sort of pandering slop, the type that appeases impressionable audiences who don't even realize they're being insulted."
    },
    {
      "text": "While I'm not ready to call the film a triumph, its approach to humor is smart enough to benefit greatly from low expectations. Which is to say, it's an enjoyable piece of trash."
    },
    {
      "text": "It's just funny - pretty much from start to finish, or at least whenever Zach Galifianakis' 'Fat Jesus' is on screen."
    },
    {
      "text": "The script is really a marvel of invention as it finds myriad ways to sink the characters deeper and deeper into the abyss, and this is where many of the film's biggest laughs come into play."
    },
    {
      "text": "Helms, Cooper and Galafianakis are a great comedy trio with each one bringing a different element to the movie."
    },
    {
      "text": "Who knew a Hangover could be so much fun?"
    },
    {
      "text": "The Hangover knows its place and plays right to it. If you see this movie, you'll probably be offended and definitely be disturbed, but you'll also laugh quite a bit."
    },
    {
      "text": "It's hard to think of any truly memorable moments from this creatively challenged outing."
    },
    {
      "text": "It's the funniest movie of the year."
    },
    {
      "text": "By the end of the film, these guys are our pals."
    },
    {
      "text": "The movie smells like a hit, but honestly: Helms excepted, did it need to be quite so blandly cast, or quite so lamely raunchy?"
    },
    {
      "text": "It's a dizzying array of bawdy set pieces buoyed by a eclectic cast."
    },
    {
      "text": "It's a non-stop laugh riot that's destined to become a comedy classic."
    },
    {
      "text": "There is a sort of perverse brilliance or brilliant perverseness to be found in this story of a bachelor party gone terribly wrong."
    },
    {
      "text": "The Hangover, like the condition for which it's named, has some spirited moments, but more often it stumbles and slurs, regurgitating earlier pleasures and praying for the fog to lift."
    },
    {
      "text": "Amusing as it is, it never feels real."
    },
    {
      "text": "Memento meets Old School? It's party time."
    },
    {
      "text": "If there is any justice in the universe, The Hangover will make Zach Galifianakis a household name."
    },
    {
      "text": "Much smarter than it needs to be and darker than you'd expect, The Hangover seems destined to be the big comedy of the summer."
    },
    {
      "text": "Surprisingly funny and smartly acted."
    },
    {
      "text": "You will not be ennobled. But you will be entertained."
    },
    {
      "text": "It distinguishes itself from other what-happens-in-Vegas comedies (practically a subgenre at this point) by setting an especially vivid scene and telling an actual story instead of pasting together random shenanigans the way many modern comedies do."
    },
    {
      "text": "Superbly cast, well-written and so silly it makes your teeth ache."
    },
    {
      "text": "The Hangover is a cut above the typical contemporary guy-friendship comedy."
    },
    {
      "text": "Early in this unraveling adventure, a Vegas tourist quips, \"Some guys just can't handle Vegas.\" Yeah, we know a couple: writers Jon Lucas and Scott Moore."
    },
    {
      "text": "You're likely to hear all about it as friends and co-workers endlessly quote lines or re-create scenes."
    },
    {
      "text": "Surrender your soul to its foul mesh of cheap cleverness and vulgarity. and you howl like a delighted demon. Resist, and you feel all sense and sensibility being crushed in its cogs."
    },
    {
      "text": "The funniest movie so far this year."
    },
    {
      "text": "Waking up with a hangover and no memory of what happened the night before is an experience most people can relate to, but it's also a surefire device for comedy."
    },
    {
      "text": "The Hangover should be a huge hit this summer for laugh-starved audiences; happily, it delivers."
    },
    {
      "text": "This kind of 'one crazy night' tale relies on drum-tight structure to work. Without it, The Hangover sputters to a sentimental halt."
    },
    {
      "text": "This is a bromance so primitive it's practically Bro-Magnon."
    },
    {
      "text": "Keep your expectations low, and you'll be amused."
    },
    {
      "text": "A strong cast, a quirky script with some unexpected twists and a steady hand from the director's chair make this a desert ride on the wild side a worthy road trip."
    },
    {
      "text": "Even though Apatow has no fingerprints over this movie, The Hangover follows in the same surprise-me tradition: It takes us to the dumb side but comes back with something unexpectedly affecting."
    },
    {
      "text": "It is a situation comedy dressed in narrative clothing, and the story it tells is less amusing than the high-concept premise."
    },
    {
      "text": "Parental Content Review"
    },
    {
      "text": "With The Hangover Todd Phillips has officially become the Uwe Boll of comedy."
    },
    {
      "text": "A glib, drab, fatally unfunny study in mean-spirited mediocrity. Goes down about as easily as Benadryl spiked with tequila."
    },
    {
      "text": "Raunchy and ruthlessly naughty, it's all buzz, no headache."
    },
    {
      "text": "If I had enough money, I would be willing to pay anyone back if they saw this movie and did not like it."
    },
    {
      "text": "Outrageousness proves hard to sustain, and after a stomach-lurchingly quick start, The Hangover slows down and, by the third act, fizzes out like Alka-Seltzer in a highball glass."
    },
    {
      "text": "The Hangover ain't art, but Phillips has shaped the hardcore hilarity into the summer party movie of all our twisted dreams."
    },
    {
      "text": "Would I have liked this film better if I went in cold, having never seen the trailer? Perhaps, but I'll never know."
    },
    {
      "text": "The Hangover is sure to make moviegoers laugh so hard that their heads will hurt (in a good way, of course)."
    },
    {
      "text": "Phillips, with a script credited to Jon Lucas and Scott Moore (and with loads of loose-limbed interpretations from the cast), captures the amity among a group of grown men set loose without spouses, girlfriends, or sobriety to hinder them. (Or help.)"
    },
    {
      "text": "What hangover? This movie is safe as milk."
    },
    {
      "text": "Comedies this good don't happen by accident, even if a little organization could have made The Hangover much better than what it is."
    },
    {
      "text": "A stripper, a stolen police car, a tazer gun demonstration, illegal drugs, a used condom, a naked Asian gambler, a bawling baby, a bemused chicken and a tiger are part of this outrageously rowdy and funny comedy that is anything but a headache"
    },
    {
      "text": "As gleefully dirty as Old School, and maybe funnier."
    },
    {
      "text": "Unlike most so-called \"comedies,\" this one can claim the virtue of being reasonably funny."
    },
    {
      "text": "The film also develops in a way that although over-the-top feels grounded in a recognisable reality."
    },
    {
      "text": "A great buddy flick that could be the surprise hit of the summer."
    },
    {
      "text": "It's a ridiculously funny movie, yes-- but it's also a skillful picture, blessed with an ingeniously constructed narrative that keeps the viewer involved while taking full advantage of its gifted cast and their specific comedic mojo."
    },
    {
      "text": "While I'm not saying you have to be hungover to appreciate The Hangover, having a wild night out before seeing this the next day might enhance this hilarious experience."
    },
    {
      "text": "An energetic jaunt through ribald territory, centered on the theory that some guys just can't handle Vegas."
    },
    {
      "text": "The Hangover's nutty, naughty fun that never takes itself the least bit seriously."
    },
    {
      "text": "A film so completely stupid and hateful that you get the sense that it was financed by the Atlantic City tourism board as a way of besmirching the good name of their chief competition."
    },
    {
      "text": "Who would have thought? The Hangover is a crude, crass comedy that manages to be smart at the same time - oh, and funny as hell."
    },
    {
      "text": "A cheerfully outrageous comedy, with much of the humor coming from discovering with them just how appallingly they have violated every standard of appropriate behavior."
    },
    {
      "text": "A geek bonding guy movie just as easily titled, I Love You, Men, this in-your-face grossout about grown males in pursuit of living out their wannabe vice junkie daydreams badly, detours into beyond crude humor more often sour than sweet."
    },
    {
      "text": "The Hangover remains unrepentantly irresponsible and hilarious throughout, culminating with what could be the funniest montage ever to grace a picture's end credits. The summer's first sleeper hit has arrived."
    },
    {
      "text": "It has a couple of stand-out characters in Ed Helms and Zach Galifianakis, and enough T-shirt-worthy catchphrases to keep the chuckles coming."
    },
    {
      "text": "As goofy and strange as the situations become, we wouldn't have any investment in this sometimes distasteful silliness if we didn't like these guys."
    },
    {
      "text": "The Hangover is a breathless stroke of comedic genius; one of those movies where, when it comes out on DVD and you have a bunch of friends over, you won't be able to watch just one scene."
    },
    {
      "text": "The latest in the wave of post-Judd Apatow Bad Lad comedies, The Hangover is rowdy, scurrilous, and, for about three-quarters of its running time, a lot more hilarious than it has any right to be."
    },
    {
      "text": "It's a film about forgetting that seems designed to be forgotten."
    },
    {
      "text": "easily one of the funniest films of the year."
    },
    {
      "text": "Big laughs, tigers, Heather Graham breast-feeding, naked Asian man beating the boys with a tire iron, Mike Tyson singing Phil Collins%u2026 I'm trying, but I'm not finding much to dislike here."
    },
    {
      "text": "Director Todd Phillips ups the ante on his \"Old School\" antics in \"The Hangover,\" a movie which solidifies the comic chops of Cooper and Helms and should make a star out of Galifianakis."
    },
    {
      "text": "A fantastic blend of raunch and more cerebral, off-the-wall humor, this isn't a case of reinventing the wheel but shaping it so that it rolls pure."
    },
    {
      "text": "Though the film falters toward the end, The Hangover is a side-splitting adventure you'll still be laughing about the morning after."
    },
    {
      "text": "Exactly the shot of drinking-age-and-up comedy the summer needs before the soda-pop PG-13 sticky-sweetness of summer blockbuster season hits."
    },
    {
      "text": "The payoff to the mysteries isn't nearly as interesting as the setup, and the ending of the movie is disappointingly squishy. But while it's riding a hot streak, The Hangover is a rush."
    },
    {
      "text": "If The Hangover sounds like a hybrid of Bachelor Party and Dude, Where's My Car, its kind of is. It has its share of both laugh-out-loud and WTF moments, but also contains scenes that deflate the comic momentum."
    },
    {
      "text": "I'm going to say, at the risk of doing time in the blurbitentiary, that The Hangover is the Citizen Kane of bachelor party movies."
    },
    {
      "text": "As if it wasn't bad enough to be stuck in Las Vegas with these middle-aged misanthropes, The Hangover does the inconceivable disservice of robbing the audience of that elusive sweet spot of GCA usefulness: the drunken escapade."
    },
    {
      "text": "The Hangover instantly has the feel of one for the ages."
    },
    {
      "text": "Now this is what I'm talkin' about. The Hangover is a funny movie, flat out, all the way through. Its setup is funny. Every situation is funny"
    },
    {
      "text": "Easily one of the funniest films so far this year."
    },
    {
      "text": "Restores faith in Phillips and the vulgar passions of the R-rated comedy, assembling a smutty epic of irresponsibility that handles with a certain amount of routine, but still delivers huge on laughs and knowing cringes."
    },
    {
      "text": "As forgettable as a night of hard drinking, this frat-level comedy is good for a few laughs but never quite gels."
    },
    {
      "text": "[T]hinks it's edgy and envelope-pushing, but there's nothing terribly risque or dangerous about it... [H]int[s] at possibilities far more dangerous than it ever dares go near..."
    },
    {
      "text": "The rush of craziness like stealing cop cars and marrying strippers comes from the actual act of doing it--uh, so I've heard--not just being told about it the next day."
    },
    {
      "text": "No deep thoughts here -- just the kind of raucously vulgar entertainment that every summer needs. Indulge yourself without guilt."
    },
    {
      "text": "Cooper, Helms and especially Galifianakis find the right tone to give Phillips' Vegas dream world a funny, slightly dangerous appeal."
    },
    {
      "text": "Ninety minutes of pure perverse laughter"
    },
    {
      "text": "Coarse but only intermittently amusing example of boys' night out...Among guy flicks this one comes in around the middle, neither unmentionably terrible nor particularly memorable."
    },
    {
      "text": "If you've seen the trailer for The Hangover, then you've pretty much seen all the funny parts. You've probably also unspooled a movie in your head that's way more fun than what's actually screening in theaters."
    },
    {
      "text": "... Just might be the funniest movie of the decade."
    },
    {
      "text": "You'll laugh three or four times and probably won't remember why."
    },
    {
      "text": "The Hangover has scattered laughs (many in the cathartically funny end-credit montage), but overall it's more amusing than hilarious."
    },
    {
      "text": "It's so funny it might convince you that sometimes the raunchy journey is worth the laugh-out-loud reward."
    },
    {
      "text": "An unusually palatable entry in a rancid genre."
    },
    {
      "text": "...I think I can safely predict that \"The Hangover\" will join March's \"I Love You Man\" as one of the funniest films of the year."
    },
    {
      "text": "Todd Phillips masterfully shows that the combination of unexpected ingredients can create a potent chemistry that elevates a simple premise."
    },
    {
      "text": "To its credit, \"The Hangover\" transfers to the audience the smelly, still inebriated state that the title promises."
    },
    {
      "text": "The Hangover, Todd Phillips' return to fratastic form after the disappointing School for Scoundrels, marks itself as an aesthetic step up for the Old School director right from the get go."
    },
    {
      "text": "This tried and true plot line not only works, but works hilariously."
    },
    {
      "text": "A comedy that stays weird and wild for the first two-thirds, only to disappoint in the final act."
    },
    {
      "text": "The male trio is so funny, the situations so wacky, the lingo so foul, and other characters and props so eccentric (absent groom, missing tooth, lost chickens, a tiger, Mike Tyson singing) that you gladly and joyously join the wild ride."
    },
    {
      "text": "This surefire summer hit might even get Vegas back on a winning streak."
    },
    {
      "text": "Very funny."
    },
    {
      "text": "I think this is going to be a big comedy hit this summer."
    },
    {
      "text": "Director Phillips wrings his scenario for consistent semi-dark humor, letting his odd-couple leads go for broke and wielding mystery as a comedic spur that keeps the proceedings from dragging."
    },
    {
      "text": "Miraculously, we still like Alan and Stu and Phil even as we crack up when they get tazed and beaten. Phillips has pulled off a feat of balance that rivals Cirque du Soleil down the Strip."
    },
    {
      "text": "Head-poundingly (in a good way), sidesplittingly funny."
    },
    {
      "text": "Proudly inappropriate and buoyed by both a clever script and some obvious chemistry between the film's male leads, director Todd Phillips' comedy will play like gangbusters with men and may even attract some women who know and love knuckleheads."
    },
    {
      "text": "The Hangover is surprisingly clever as well as R-rated rowdy."
    },
    {
      "text": "I loved Fat Jesus. A comedy that's funny and naughty. This is a franchise. Mike Tyson has a career in movies!"
    }
  ],
  "release_year": 2009,
  "duration": 99,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Two days before his wedding, Doug (Justin Bartha) and three friends (Bradley Cooper, Ed Helms, Zach Galifianakis) drive to Las Vegas for a wild and memorable stag party. In fact, when the three groomsmen wake up the next morning, they can't remember a thing; nor can they find Doug. With little time to spare, the three hazy pals try to re-trace their steps and find Doug so they can get him back to Los Angeles in time to walk down the aisle.",
  "popularity": 8.4,
  "poster_url": "https://image.tmdb.org/t/p/original/A0uS9rHR56FeBtpjVki16M5xxSW.jpg"
}