{
  "movie_name": "The Theory of Everything",
  "movie_id": "the_theory_of_everything_2014",
  "total_reviews": 268,
  "reviews": [
    {
      "text": "While very well-intentioned to focus on the man over the persona, it feels skewed and short on glitz representative of someone larger-than-life such as Stephen Hawking."
    },
    {
      "text": "There is still a good story to be found in “The Theory of Everything” despite its standard biopic flavor and rushed ending."
    },
    {
      "text": "Redmayne's physical performance astounds, and Jones makes a wonderfully empathetic female lead. If only their performances were part of a better treatment of this worthy subject."
    },
    {
      "text": "A standard biopic - there's loads of shots of Hawking furiously scribbling mathematical symbols on a chalkboard for instance - but Jones and Redmayne give this study of a scientific mind something special - heart."
    },
    {
      "text": "While The Theory of Everything doesn't fully demonstrate the importance of Hawking and his work, Redmayne and Jones' performances are a beautiful tribute to the couple."
    },
    {
      "text": "It is the performance of Felicity Jones that truly illuminates the screen."
    },
    {
      "text": "A by-the-numbers biopic fronted by two incredible performances."
    },
    {
      "text": "It seems that The Theory of Everything doesn't have to theorize as much to prove that Eddie Redmayne is staging, perhaps, one of the best performances of the year. [Full review in Spanish]"
    },
    {
      "text": "The Theory of Everything ultimately wants to live in the heart and not the mind, and in that, it succeeds admirably."
    },
    {
      "text": "The Theory of Everything side-steps the obvious aspects that shaped Hawking into the man he is today, but Redmayne and Jones deserve the praise in this somewhat biased biopic."
    },
    {
      "text": "Standardly told, yet executing the complicated parameters and perils of the biopic quite satisfactorily, it may not be as brilliant as its subject, but it's a moving piece of cinema nonetheless."
    },
    {
      "text": "The Theory of Everything is an interesting story about a genius, but it will be the performances by the Eddie Redmayne and Felicity Jones that will stay with you."
    },
    {
      "text": "The Theory of Everything is the Hawkings' universe in a nutshell."
    },
    {
      "text": "The kind of respectable, middle of the road biopic that always comes out around Oscar season hoping for awards."
    },
    {
      "text": "The Theory of Everything is still an emotionally affecting drama of human tragedy and survival."
    },
    {
      "text": "The Theory of Everything may not tell us the full story but the captivating narrative it presents makes it more than worthy of your attention."
    },
    {
      "text": "It's a perfectly standard adequate satisfying biopic about a very unique man."
    },
    {
      "text": "The Theory of Everything is a good, if very conventional, film, but the real story it's based on could have been made into a great one."
    },
    {
      "text": "Redmayne is brilliant as Stephen Hawking."
    },
    {
      "text": "Adheres to the standard biography blueprint. What helps \"The Theory of Everything\" rise above mediocrity is Redmayne and Jones."
    },
    {
      "text": "In many ways comparable to the Ron Howard-directed A Beautiful Mind, the introspective The Theory Of Everything is a marvelous calculation of time and space that even the real-life Stephen Hawking can embrace with conviction."
    },
    {
      "text": "The Theory of Everything has all of the right components to be acknowledged come this awards season."
    },
    {
      "text": "The film is worth seeing for the performance alone."
    },
    {
      "text": "While nothing revolutionary occurs in the film, the performances from Redmayne and Jones elevate this biography above your typical Oscar fare. [The Theory of Everything] is easily worth the time."
    },
    {
      "text": "Redmayne and Jones are fantastic, and it's wonderful to see a biopic that includes the woman next to the famous man, but there's no there to their relationship, or their family, which grows with seemingly no parenting effort whatsoever."
    },
    {
      "text": "There's very little that's extraordinary about the rest of The Theory of Everything. It's a soft movie, glossy, filled with stirring, soapy music, and hitting highlights but nothing in-between."
    },
    {
      "text": "Its tale is still unsurprisingly uplifting, mainly because Hawking's perseverance against his disability, even if left un-filmed, is something that can only be admired."
    },
    {
      "text": "...the best thing about the film are the performances (especially Redmayne's) and James Marsh's elegant directing... [Full review in Spanish]"
    },
    {
      "text": "The screenplay's shortcomings do not take away from Eddie Redmayne's finely-tuned characterization or Felicity Jones' epitomizing devotion."
    },
    {
      "text": "[Theory of Everything] turns him into the melodramatic hero of a limited drama - a work whose circumscribed nature clashes sharply with the cosmic reach of Hawking's work and  vision."
    },
    {
      "text": "Whether it is perfecting the delivery of a slurred and often unintelligible voice, or struggling to simply lift a spoonful of peas to his mouth, Eddie Redmayne is awe-inspiring, bringing forth one of the most surreal performances of the decade."
    },
    {
      "text": "By seeing all the dimensions of Hawking, good and bad, you get a figure that is more human and more relatable, almost because of the flaws."
    },
    {
      "text": "Too bad, then, about the film's utterly standard progression, its insistence on tracing Hawking's ascension to the height of pop science, as if becoming a windbag lecturer on Big Ideas is all a great mind-and his partner-could ask for in life."
    },
    {
      "text": "The music and cinematography, capturing Cambridge's lush prettiness, add glow, this portrait considerably brighter than a biopic like A Beautiful Mind, also exploring genius and agony."
    },
    {
      "text": "[It] seems more certain of what it does not want to do than what it does."
    },
    {
      "text": "The Theory of Everything is too busy playing it safe to generate any real excitement."
    },
    {
      "text": "Even in her own account, Jane Hawking is not a compelling woman. This does not make her unimportant - just not an ideal subject for a feature-length film."
    },
    {
      "text": "The Theory of Everything charts the universes inside of us: inscrutable, expanding, human."
    },
    {
      "text": "It's a gorgeous movie, with an excellent visual sense courtesy of director James Marsh. Redmayne's performance as Hawking is also extremely dedicated."
    },
    {
      "text": "The Theory of Everything is a visually interesting, well-directed and extraordinarily acted film. [Full review in Spanish]"
    },
    {
      "text": "The Theory of Everything is the type of inspirational story that is so often told in biopics. It is beautifully shot, emotionally driven, and a masterclass in acting."
    },
    {
      "text": "In an era seriously lacking in serious movie stars, it's great to see young actors like Jones and Redmayne get to go for broke in a movie that mostly deserves them."
    },
    {
      "text": "The 123-minute movie is a smooth, attractive, absorbing and often moving examination of conjugal matters, but it's also conventional and respectful and misses out on capturing the essence of what made Stephen and Jane endure their respective conditions."
    },
    {
      "text": "It's all slavishly conformed into a woefully predictable formula, as inflexible as the Meet Cute Rom-Com or the Superhero Epic, every scene less about capturing a moment from a life than about completing a checklist."
    },
    {
      "text": "A sensitive, middle-brow and conventional film, with key moments in Hawking's life structured neatly, and with every emotional button being pushed just at the right pressure."
    },
    {
      "text": "Attention has rightly focused on Redmayne's extraordinary work as the steadily shrivelling Hawking, and the sense of mischief that he conjures using only his eyes is something to behold. But Jones is terrific as Jane, whose story the film is, really."
    },
    {
      "text": "A small-minded portrait of subject who's anything but."
    },
    {
      "text": "For relying more on emotions than the fascinating knowledge contained in Hawking's mind, The Theory of Everything could've employed more complexity."
    },
    {
      "text": "Redmayne is phenomenal, helped by his uncanny resemblance to the young Hawking. He captures the great man's famous sense of humour, likeable eccentricity and resilience."
    },
    {
      "text": "The Theory of Everything may not tear a rip in the cinematic space-time continuum, but as an intimate drama about two people struggling with a life they never expected, it has real power."
    },
    {
      "text": "The acting lifts the highly fictionalized story out of the realm of banality and bromide."
    },
    {
      "text": "A glossy, manipulative but affecting portrait of a brilliant man struck, but not struck down, by a terrible malady."
    },
    {
      "text": "Redmayne's astonishing physical transformation is the film's showiest feature, but the subtler emotional transformations he and Jones display over the course of their characters' embattled marriage are just as impressive."
    },
    {
      "text": "Sometimes superficial examination of the life of a genius that never adequately explains how its title applies to its content."
    },
    {
      "text": "A very convincing and affecting portrayal of an important figure in modern science."
    },
    {
      "text": "The Theory Of Everything provides both insight and comfort. There are many ways to make a relationship work."
    },
    {
      "text": "'The Theory of Everything' paints a brilliant portrait."
    },
    {
      "text": "In a biopic-heavy Oscar season, Redmayne's crack performance pays homage to a man who has advanced the studies of quantum mechanics, general relativity and black hole radiation."
    },
    {
      "text": "The treatment of the subject matter goes over to what is essentially religious adoration."
    },
    {
      "text": "A well-written, well-directed movie an average person like myself can grasp. If I want a more complicated explanation of the universe, then I can refer to Hawking's book, \"A Brief History of Time.\""
    },
    {
      "text": "The Theory of Everything features incredible Oscar-nominated performances from Eddie Redmayne and Felicity Jones, but ultimately it's unable to strike a good balance between Stephen Hawking's personal and professional life."
    },
    {
      "text": "For those deadened by the Transformers saga comes The Theory of Everything, a Stephen Hawking biopic to remind us even prestige movies made with good intentions can be interminable too."
    },
    {
      "text": "More specificity and insight into treating the condition daily would have been impressionable instead of skimming through Hawking's life events."
    },
    {
      "text": "The most surprising thing about The Theory of Everything, which looks from the outside like a movie about Stephen Hawking, is that it's a movie about Jane, his first wife."
    },
    {
      "text": "The Theory Of Everything hits all the right beats, though never quite soars."
    },
    {
      "text": "The Theory of Everything serves as a fitting reminder that beyond the extraordinary maths lies a man: mortal, flawed and confounded by love."
    },
    {
      "text": "The film is at pains to show what a rebellious genius he was, but it also goes out of its way to show that Hawking was also something of a jerk. If the film is intended as a valentine to Hawking it's a very barbed one."
    },
    {
      "text": "Once The Theory Of Everything reaches this transitional period of Hawking's storied career, the film immediately rights itself from its wonky beginnings."
    },
    {
      "text": "Watching him [Eddie Redmayne] slumped in an electric wheelchair, simulating the effects of Hawking's motor neurone disease, it's easy to forget you're looking at an actor."
    },
    {
      "text": "Eddie Redmayne's performance - wrapped in his uncanny physical investment - is the absolutely vital key in this film and it's a scorcher, both sensitive and brave and effecting and devoid of sentimental mush, yet infinitely sad and moving"
    },
    {
      "text": "Defying every expectation both scientific and personal, this film depicting the extraordinary story of Stephen Hawking is unforgettable"
    },
    {
      "text": "Not an idealistic, all flowers and cuddles ordeal - it's a veritable depiction of true love, and companionship."
    },
    {
      "text": "Not an idealistic, all flowers and cuddles ordeal - it's a veritable depiction of true love, and companionship."
    },
    {
      "text": "Not flashy, but backed by two of the year's finest performances, this intimate drama is a revealing look at one of the more fascinating individuals of our generation."
    },
    {
      "text": "The Theory of Everything is deftly funny on occasion and lustrously made, key virtues for a film where the plot is largely summarized on Wikipedia already."
    },
    {
      "text": "The Theory Of Everything reveals the man behind the icon: courageous, mischievous, funny but also difficult and selfish."
    },
    {
      "text": "Pleasing to watch... but [leaves] little lasting impression."
    },
    {
      "text": "There's a mischievous quality to Redmayne that seems a good match with the wit Hawking has always managed to convey with a raised eyebrow and a mechanically-voiced quip."
    },
    {
      "text": "Redmayne does bravura work, but The Theory of Everything doesn't have the imagination or ambition to be anything more than his showpiece."
    },
    {
      "text": "Stephen Hawking is the best thing that's ever happened to Redmayne's career, and The Theory of Everything is a treat."
    },
    {
      "text": "The Theory of Everything offers interesting characters and standout acting. I wish it had delved deeper into its characters, but for what it is -- a romance involving one of the great minds of humanity -- it's engaging and moving."
    },
    {
      "text": "The film is focused on a marriage to the degree that this is a melodrama with too many paint-by-numbers cliches of the biography film formula."
    },
    {
      "text": "The story of Stephen Hawking and his wife Jane is the most unabashed kind of Oscar bait, but it's also quite moving."
    },
    {
      "text": "It's the sort of slightly dry, just-the-facts storytelling you might think a scientist would endorse."
    },
    {
      "text": "If the film unfolds like a fairytale, at least it's a fairytale that doesn't often get told."
    },
    {
      "text": "It looks and feels like utter cornball but the sheer commitment of the stars makes the whole thing deeply watchable."
    },
    {
      "text": "It's a suitably polished affair, and Eddie Redmayne and Felicity Jones deliver fantastic, award-ready performances. But somehow all that polish keeps those accomplished parts from connecting into an emotionally-engaging or unified whole."
    },
    {
      "text": "How Redmayne, not just able-bodied but downright pretty, twists himself into the famously blighted professor, and then projects the thought processes behind the disability, has to be seen to be believed."
    },
    {
      "text": "These days \"everything\" has also come to serve as a lazy synonym for \"no one thing in particular.\" And while that usage may not describe Steven Hawking's theory of everything, it certainly does fit the movie about his life."
    },
    {
      "text": "... a rather ordinary biography of an extraordinary life, less inquisitive and ready to test boundaries than the brilliant mind it portrays.... The strength is a graceful performance by Eddie Redmayne as Hawking, in the the mix through awards season."
    },
    {
      "text": "Prettily shot and glossily produced, this is a film that's easy to like but equally easy to forget, being almost entirely content free."
    },
    {
      "text": "Relative merits aside, The Theory of Everything is very good, its chief assets being the extraordinary story of Hawking himself, and of course the performance."
    },
    {
      "text": "There's little acrimony in The Theory of Everything, which may reflect Hawking's actual outlook or just the movie's puppyish desire to please."
    },
    {
      "text": "Director Marsh is a gifted documentarian, but at this point, his dramatic technique is too shallow to get inside his characters' heads."
    },
    {
      "text": "This is a handsomely produced, sensitively acted picture, one that's eager to have you wipe away a tear with one hand while handing over gold statues with the other."
    },
    {
      "text": "Eddie Redmayne is so convincing as famous physicist Stephen Hawking that you will likely be unable to separate the two men in your mind once this genuinely moving, if slightly maudlin, film flickers to a finish."
    },
    {
      "text": "The film both adheres to and gently upends the conventions of the Great Man genre."
    },
    {
      "text": "Although it's narrow gauge and barely touches on Hawking's breakthrough theories about time, space and matter, it's really well made and spectacularly well-acted."
    },
    {
      "text": "What shines through loud and clear, though, is the humanity in Hawking's incredible story."
    },
    {
      "text": "Despite its title, The Theory of Everything is less about astrophysics and more about the quantum mechanics of human relationships under pressure."
    },
    {
      "text": "How jarring to see a film so devoid of conflict, tension or struggle."
    },
    {
      "text": "Marsh has somehow made a tearjerker (albeit a highbrow one) about the life and times of a Cambridge physicist - and that itself is an achievement."
    },
    {
      "text": "James Marsh's film reorders events and soft-soaps the acrimony, yet boasts an appealingly unconventional coupling and eye-catching performances from its shooting star leads."
    },
    {
      "text": "Redmayne's quietly exuberant performance is admirable and engaging, never over-stressing its tour de force dimension. But the real colour is brought by Felicity Jones as Jane ..."
    },
    {
      "text": "It's almost impossible to overhype Redmayne's performance in this witty, touching and very classy British drama."
    },
    {
      "text": "This is not a brief history of time; it is a brief history of love. And it is as complex and deceptively deep as any of the physics."
    },
    {
      "text": "An unusual point of view prevents this from ever turning into the standard biopic, but it's Eddie Redmayne's staggeringly committed performance as Stephen Hawking that makes the film unmissable."
    },
    {
      "text": "Like this awards season's other scientific British biopic The Imitation Game, the film suffers from a squeamish reluctance to really engage with the harsh realities of its story."
    },
    {
      "text": "The problem is that it's a reprise of a relationship designed to meet the approval of the living-breathing counterparts."
    },
    {
      "text": "A compassionate and inspiring look at an extraordinary life, anchored by two of the best performances of the year."
    },
    {
      "text": "Redmayne and Jones prove that marriage is just as absorbing (and perplexing) as quantum physics."
    },
    {
      "text": "Dutiful, coy and by the numbers."
    },
    {
      "text": "This is a poignant, probing, often cheekily playful portrait of an ordinary marriage of opposites sustained over decades in extraordinary circumstances."
    },
    {
      "text": "Redmayne, Jones, Cox and Peake portray the principals and their emotional web with delicacy."
    },
    {
      "text": "Redmayne's committed performance captures his subject with thrilling conviction."
    },
    {
      "text": "It's a film about the expanding universe that seems to want to contract and contract and eventually shrink into itself and be gone."
    },
    {
      "text": "It might be a conventional biography, but the performances in the lead roles elevate it to an emotionally satisfying look at a marriage."
    },
    {
      "text": "No matter how much of this story is true, the movie is a pretty lie."
    },
    {
      "text": "There's no big bang to James Marsh's biopic of cosmologist Stephen Hawking, just a whimper from audiences as a well-acted but soapy drama shifts too smoothly through its storytelling gears."
    },
    {
      "text": "Redmayne handles all the stages of Hawking's terrible disease with great tact, always careful to portray the man and not the illness."
    },
    {
      "text": "There's no question Redmayne is the movie's main attraction. He captures the idealism of the young Hawking, an idealism that doesn't fade even later in life when he can use little more than his eyes to convey it."
    },
    {
      "text": "Must a film about an extraordinary man be so ordinary?"
    },
    {
      "text": "Marsh and cinematographer Benoît Delhomme's exquisite harnessing of light and the former's guiding of Jones and Redmayne to performances of surpassing delicacy elevate such passages to something beyond Douglas Sirk."
    },
    {
      "text": "Redmayne will get the lion's share of attention for his performance, but Jones's portrayal of Jane cannot be underestimated, as her ability to convey the conflict between her character's fortitude and her emotional exhaustion is the film's foundation"
    },
    {
      "text": "It may be nitpicking to ask a film to fill in more of the difficult details in light of the care and concern given to the source material."
    },
    {
      "text": "It has the slick sheen of prestige Oscar-bait, and its frustrating that it views this most unique relationship-one which surely has more contradictions and asterisks than 99 percent of marriages-through the same lens of every other rose-colored biopic."
    },
    {
      "text": "It's probably sweetened with too much sugar, but it's still a good movie with some very impressive acting work."
    },
    {
      "text": "A pair of splendid performances drive the movie, but like the cosmos that Professor Stephen Hawking studied in order to unravel the secrets of the universe, it is cold and distant."
    },
    {
      "text": "If you are interested, even slightly, in what distinguished Stephen Hawking, this is not the film for you. It has about as much to do with his theoretical breakthroughs as does a Judd Apatow movie."
    },
    {
      "text": "This is the adult, classy version of The Fault in Our Stars."
    },
    {
      "text": "The film oscillates between superficial treatments of science and corny moments of \"you can do it!\" kitten-hanging-from-a-branch bromides."
    },
    {
      "text": "...riveting subject matter that's employed to disappointingly tepid, run-of-the-mill effect..."
    },
    {
      "text": "Eddie Redmayne and Felicity Jones are perfect as Stephen and Jane, providing the humor, strength and emotion required in any marriage, whether it's a real one or a reel one."
    },
    {
      "text": "Everything is given a substantial boost by its stars, who deliver exceptionally nuanced performances."
    },
    {
      "text": "Depsite the by-the-numbers trajectory of its narrative, the film is renewed by Redmayne and Jones' impassioned turns."
    },
    {
      "text": "Jones plays her with quiet determination and suppressed strong feelings. Her fine performance never gets eclipsed by Redmayne's, though he's given the inevitably showier role."
    },
    {
      "text": "It still feels formulaic, but that's to be expected without being able to go very far beyond the range of the memoir it dutifully draws on."
    },
    {
      "text": "The Theory of Everything is everything you didn't know about Stephen Hawking."
    },
    {
      "text": "Well-acted and often moving, Theory of Everything is ultimately an insightful love story that just happens to be about Stephen Hawking."
    },
    {
      "text": "Solidly good Brit Oscar Bait."
    },
    {
      "text": "The film may have its Hallmark moments and gloss over an unflattering fact or two, but in the end it triumphs as a portrait of a brave, brilliant man and the equally courageous woman who gave him everything."
    },
    {
      "text": "It's a traditional, handsome, for-your-consideration biopic in many ways, but it's also deeper than that, and Marsh includes little grace notes that don't conform to the standard formula."
    },
    {
      "text": "Enhanced by a brilliantly transformative performance from Eddie Redmayne as Hawking, director James Marsh's film is professional in every respect. But it takes itself way too seriously."
    },
    {
      "text": "It's a captivating story about one of the most fascinating people on the planet, punctuated by Redmayne's special performance."
    },
    {
      "text": "Director James Marsh won an Oscar for his incredible art-crime documentary \"Man on Wire,\" and here he proves capable of walking a tightrope between science and sentiment."
    },
    {
      "text": "In The Theory of Everything, director James Marsh has crafted an emotional, affectionate tribute to Stephen Hawking, love, and life itself."
    },
    {
      "text": "Redmayne succeeds because his internal Hawking is as convincing and compelling as his external Hawking."
    },
    {
      "text": "Operates on the theory that audiences will find more value in Hawking's expressions of Oprah-level sentiment ('Where there is life, there is hope') than in his mind-blowing science."
    },
    {
      "text": "These are adult people dealing with substantial problems with intelligence, love, wit, charm and respect for each other. This should not be so rare to see in a movie, but it is, and it is wonderful to see."
    },
    {
      "text": "A smart genius biopic."
    },
    {
      "text": "When the full force of the disease hits, Hawking is reduced to a twist-tie of a human being, sentenced to a life of gigantic thoughts and pathetic movements. He's pretzelled."
    },
    {
      "text": "Highlighted by an extraordinary performance by Eddie Redmayne, The Theory of Everything offers an easy introduction to Stephen Hawking for people curious about the brilliant astrophysicist but intimidated by the whole \"astrophysicist\" thing."
    },
    {
      "text": "Directed by James Marsh, the biopic The Theory of Everything reminds us that Hawking was once a vibrant, able-bodied young man who careened around early '60s Cambridge on his bicycle."
    },
    {
      "text": "Redmayne's options for conveying this emotional core might seem limited, but like Hawking, he doesn't allow the laws of nature to constrain him. With a smile, a frown, or a tear, he says everything without uttering a word. It's a wondrous thing to behold."
    },
    {
      "text": "It's a creative innovation, I suppose: frictionless filmmaking for a movie about physics."
    },
    {
      "text": "In many ways, 'The Theory of Everything' is a celebration of life in all of its beauty and sadness."
    },
    {
      "text": "\"The Theory of Everything\" offers intimate scenes from a very specific and challenging marriage, warts, black holes and all."
    },
    {
      "text": "A well-done soulful, touching story of Stephen and Jane hawking's lives - sure to get some Oscar buzz"
    },
    {
      "text": "This is rich material for the film's lead actors, and both are superb."
    },
    {
      "text": "\"The Theory of Everything\" is a brainy bio that exerts a gravitational pull on the heartstrings."
    },
    {
      "text": "Redmayne makes you forget you're watching an actor put himself through punishing contortions. He keeps you focused on the soul of a man trapped inside a malfunctioning body."
    },
    {
      "text": "The film does communicate enough of Hawking's discoveries to let us know why he's an important thinker. But this movie about a great woman and a great man ends up merely good."
    },
    {
      "text": "Anyone who's seen Errol Morris' expressionistic documentary on Hawking knows a conventional approach isn't ideal for the ALS-afflicted genius-which isn't to say James Marsh's new film doesn't succeed on its own more modest terms."
    },
    {
      "text": "Entertaining enough bio-pic that, for the most part, avoids the over-treacly elements."
    },
    {
      "text": "Redmayne captures Stephen's innate charm and self-effacing humor, while Jones radiates a resolve and inner strength..."
    },
    {
      "text": "Depicting Stephen Hawking as this smiling, pathologically beatific quip machine where nothing changes but the wheelchair saves us the difficulty of imagining him as a real person."
    },
    {
      "text": "It also stands as a tear-courting visualization of Hawking's and our precious quandary: time."
    },
    {
      "text": "Redmayne makes you believe every minute he's onscreen that he IS Stephen Hawking, with all his genius, wit and determination intact even as his body withers around them."
    },
    {
      "text": "Though the marriage eventually crumbles, what a joy to see a relationship that's anything but formulaic."
    },
    {
      "text": "Redmayne and Jones are sublime."
    },
    {
      "text": "Redmayne and Jones are terrific in a mature look at the marriage of Stephen Hawking and Jane Wilde"
    },
    {
      "text": "A sweet fairy tale of the marriage between a living legend, anti-God \"saint\" and the wife who attended to his every need. A nice whitewash. It's not a warts-and-all film."
    },
    {
      "text": "Jane Hawking's inspirational love story of her life with Stephen is the stuff for which movies are made."
    },
    {
      "text": "Hawking's actual longevity may shock the medical world, even now, but his remarkable will to survive is no surprise at all."
    },
    {
      "text": "A strong and moving offering about facing long odds and nonetheless moving forward. (Full Content Review -- Sex, Profanity, etc. -- for Parents also available)"
    },
    {
      "text": "The Theory of Everything treats Stephen Hawking's intellectual accomplishments like rom-com filler."
    },
    {
      "text": "Redmayne should be getting a lot of notice for his performance; it's palpable, it's poignant. Jones, too, is terrific."
    },
    {
      "text": "\"The Theory of Everything\" is for everyone who finished Stephen Hawking's A Brief History of Time and felt they needed more detail about his marriage."
    },
    {
      "text": "Surely there's more to Hawking's life than this."
    },
    {
      "text": "Marsh's movie is inspiring enough, which is the unspoken point of the biopic ..."
    },
    {
      "text": "Redmayne and Jones are fantastic. It's just a shame about the rest of the movie."
    },
    {
      "text": "Eddie Redmayne twinkles and tickles the intellectual friskiness of Stephen Hawking in James Marsh's lively, bright The Theory Of Everything, a brisk telling of the early years of the scientist, best-selling author and survivor."
    },
    {
      "text": "Hawking himself has seen this film and pronounced it \"broadly true,\" and that diplomatic generalization touches on what's right about it and what's wrong."
    },
    {
      "text": "There are no significant revelations, but maybe that's the beauty of James Marsh's biopic about Stephen Hawking: The Theory of Everything isn't looking for answers to the universe."
    },
    {
      "text": "It nestles into your consciousness with soft lighting and inspiration."
    },
    {
      "text": "\"The Theory of Everything\" is mostly a conventional biopic about two very unconventional people, and it rests comfortably in the hands of the two actors playing Stephen and Jane."
    },
    {
      "text": "Anchored by a pair of mesmerizing performances from Eddie Redmayne and Felicity Jones, the film almost functions as a more thoughtful companion piece to the blockbuster Interstellar, which also concerns itself with matters of the heart amid the cosmos."
    },
    {
      "text": "It's an exceptional film, not because of its protagonists' impressive triumphs, but because it honors their struggle."
    },
    {
      "text": "As though it were the easiest thing in the world, \"The Theory of Everything\" juggles and elaborates on the three main areas of Hawking's life - his work, his illness and his marriage."
    },
    {
      "text": "Follow up by looking into the real story, but this is a moving film about what a complicated thing a marriage is."
    },
    {
      "text": "\"The Theory of Everything\" breaks down simply, perhaps too much so: a great performance in a good movie."
    },
    {
      "text": "For all the scientific rhetoric about the nature of time, what matters most here is how it forges, and then tests, the bond between two people."
    },
    {
      "text": "The picture milks adversity, quietly at first and then more loudly as the plot pleasantly idles forward. It's a strategy designed to wring maximum waterworks from an emotionally vulnerable audience, and kudos to Marsh, because it genuinely succeeds."
    },
    {
      "text": "Movies about handicapped heroes rise or fall on the quality of the leading performance, and Redmayne's soars on rocket boosters."
    },
    {
      "text": "Captures Hawking's intellectual vigor as well as his comical spirit"
    },
    {
      "text": "There can never be enough reminders that a person with a disease is a person, not the disease."
    },
    {
      "text": "It works best as a study of human vulnerability and love's way with us all, and as such, a handsomely mounted, slightly hollow picture by the end becomes a very affecting one."
    },
    {
      "text": "An unremarkable bio-pic about a remarkable man."
    },
    {
      "text": "\"The Theory of Everything\" is not afraid to reveal honest, intimate and emotionally painful moments in this couple's relationship. We witness two characters who are heroic but human as they struggle to get to heart in the center of their own universes."
    },
    {
      "text": "...the noble patient, served up with heavy doses of tea and sympathy."
    },
    {
      "text": "A portrait that mirrors the mysteries of the vast universe with those of life on this terrestrial plane."
    },
    {
      "text": "Mired in an unremarkable will-they-or-won't-they forbidden love that distracts from the more intriguing drama at hand."
    },
    {
      "text": "Any film made about two living people, with their cooperation, is necessarily going to be limited by considerations of tact and taste, and that goes double or triple in this case."
    },
    {
      "text": "The Theory of Everything is surely inspirational, but it glosses over some ugly chapters in Stephen and Jane's relationship."
    },
    {
      "text": "Brilliant mind comes to life in teen-friendly film."
    },
    {
      "text": "\"There should be no boundary to the human endeavor,\" we're told at some point in The Theory of Everything. But how would this movie know? There are enough boundaries in it to induce claustrophobia."
    },
    {
      "text": "As gentle, reliable, and pretty to look at as the falling of the leaves. It also has approximately the same level of dramatic tension."
    },
    {
      "text": "The triumph of Redmayne's performance is that Stephen, after he becomes incapacitated, is the same eccentric, quizzical quester that he was when he was sprinting across the Cambridge campus."
    },
    {
      "text": "Fine performances by Felicity Jones and Eddie Redmayne highlight this whitewashed account of Stephen Hawking's marriage to Jane Hawking, based on her second book. A film on her first book, which told the real story, would have been far more interesting."
    },
    {
      "text": "What Redmayne does is breathtaking-and it never feels like a performance. In a much less showy role, Jones does her own heartbreaking work as the woman who dedicated her life to loving and caring for Hawking."
    },
    {
      "text": "Well-crafted but formulaic, a glossier version of the kind of movie the Lifetime network shows every month."
    },
    {
      "text": "What is the idea of romantic companionate marriage, in all its crackpot \"till death us do part\" absolutism, if not a theory of everything?"
    },
    {
      "text": "The Theory of Everything is half love story, half biopic, and we never get enough of either."
    },
    {
      "text": "Time is at the heart of Hawking's work, and it animates The Theory of Everything, too."
    },
    {
      "text": "Eddie Redmayne's captivating performance will be compared to Daniel Day Lewis's in \"My Left Foot,\" but it is important to note how much life, joy and humor he brings to the role with little more than a cocked eyebrow, a few facial muscles and his eyes..."
    },
    {
      "text": "A strongly acted, handsomely crafted film that nonetheless feels bland and unsatisfying."
    },
    {
      "text": "Redmayne and Jones are beautifully compatible as Hawking and his then-wife Jane as they navigate the ebb and flow of 25 years of their relationship."
    },
    {
      "text": "This is sheer poppycock, of course, but it makes for fine drama, and that's all Cupid and Oscar care about."
    },
    {
      "text": "The Theory Of Everything surpasses the standard biopic to become an unexpected and moving love story between Stephen and Jane Hawking. The acting is superb in this winning film."
    },
    {
      "text": "On one side is Mr. Redmayne's remarkable presence. On the other is Ms. Jones, whose lovely freshness and calm intelligence complement everything her co-star does."
    },
    {
      "text": "Stephen Hawking, a genius challenged by a progressive neurological disease, is a role that demands miracles of an actor. And Eddie Redmayne, in a landmark performance, delivers them."
    },
    {
      "text": "The Theory Of Everything is a modest film, a simple film, but an honest and impressively-restrained one, and it should serve to launch Redmayne into rarefied air as an actor, deservedly so."
    },
    {
      "text": "Marsh takes a complicated persona and reveals a range of dimensions. The result is an engaging biopic that is often quite moving."
    },
    {
      "text": "It's disappointing to see Hawking's life slotted into the conventions of the biopic genre, from a meet-cute at a Cambridge party to a centerstage ovation for our genius hero."
    },
    {
      "text": "It even has Hawking fumbling with the title of his first book, suddenly realizing he should interject 'Brief' into what was once 'A History of Time.'"
    },
    {
      "text": "If nothing else, The Theory Of Everything is an encyclopedia of lame shortcuts, from its grainy faux home-movie wedding sequence to its tendency to fade out the dialogue in order to underline-and inadvertently undercut-a traumatic moment."
    },
    {
      "text": "Like so many cinematic lives of the famous, it loses track of the source of its subject's fame."
    },
    {
      "text": "As the mathematical wunderkind who advanced a scientific theory beyond anyone's imagination, the great young actor Eddie Redmayne (My Week With Marilyn, Les Miserables), gives the most electrifying performance of the year."
    },
    {
      "text": "The beautiful Jones seems limited in how deep she can burrow into Jane's frustration and sorrow. But then, anyone would be lost in Redmayne's wake."
    },
    {
      "text": "A tale of resilience, energized by superb acting across the board."
    },
    {
      "text": "That it works is a testament to its strong performances and a real sense of empathy toward both sides of the featured relationship."
    },
    {
      "text": "Theory is eye candy, filled with rich, luminous parties, luscious English countryside, and cold hospital halls. Its cinematic beauty aside, the film is not a sappy love-conquers-all tale."
    },
    {
      "text": "Redmayne uses his eyebrows, his mouth, a few facial muscles, and the fingers of one hand to suggest not only Hawking's intellect and his humor but also the calculating vanity of a great man entirely conscious of his effect on the world."
    },
    {
      "text": "Despite handsome production and two brilliant lead performances, The Theory Of Everything stumbles into virtually every pitfall that afflicts biopics about geniuses."
    },
    {
      "text": "The Theory of Everything is, in its nature, very emotionally powerful..."
    },
    {
      "text": "A brilliant and beautiful film that gives us a more personal and intimate look at this amazing genius of a man than we've ever seen before."
    },
    {
      "text": "An intelligent love story that touches the heart by exploring the sacrifices both parties made to cope with Stephen Hawking's debilitating disease."
    },
    {
      "text": "At its best (which is often), director James Marsh's affecting biopic of the cosmos-rattling astrophysicist Stephen Hawking plays deftly against schmaltz."
    },
    {
      "text": "Neatly constructed, heartfelt triumph-over-adversity pictures have their place. This one is particularly sly in the way it folds complex and sometimes painful ideas about love and commitment into a somewhat glossy package."
    },
    {
      "text": "It would be easy to fall into the trap of wishing this look at one of the greatest minds on the planet was something more, dare I say, intellectual. But this movie is a love story. And a fine love story it is."
    },
    {
      "text": "[VIDEO ESSAY] While possessing an outstanding performance by Eddie Redmayne in the role of the great theoretical physicist Stephen Hawking, \"The Theory of Everything\" is formulaic to a fault."
    },
    {
      "text": "Gorgeously produced account of the struggles of the young Stephen Hawking and his wife Jane features award-worthy performances by Eddie Redmayne and Felicity Jones."
    },
    {
      "text": "Extraordinary and inspirational, as Eddie Redmayne realizes a challenging physical, mental and emotional transformation, comparable to Daniel Day-Lewis' in 'My Left Foot.'"
    },
    {
      "text": "This is mostly a story of a relationship, and in that regard The Theory of Everything succeeds admirably."
    },
    {
      "text": "Many moviegoers may think they already know a good deal about Hawking's achievements, but they would do themselves a disservice to miss out on Redmayne's almost perfect performance."
    },
    {
      "text": "hat makes The Theory of Everything so deeply affecting is the two wonderful performances by its leads."
    },
    {
      "text": "Both Redmayne and Jones have been hovering on the cusp of breaking out in a big way, and The Theory of Everything is the ideal vehicle to capitalize on their talents and push them to the next level."
    },
    {
      "text": "Marsh's latest film walks a fine tightrope, providing an engaging, provocative and accessible look at these remarkable individuals."
    },
    {
      "text": "Touching story about a couple able to weather many challenges thanks to their partnership approach to marriage."
    },
    {
      "text": "Believe it or not, even world class scientists have private lives."
    },
    {
      "text": "For this film to work, the lovers had to work - thankfully, Redmayne and Jones have an easy, enchanting chemistry..."
    },
    {
      "text": "This is acting out of the My Left Foot handbook, except ... Redmayne rarely deviates from Hawking's whimsical quizzicality. It's a less wrenching, more user-friendly tour de force."
    },
    {
      "text": "Marsh's constant, reverent attention to the small things saves this film from its tendency toward convention and foreground its astonishing lead performance."
    },
    {
      "text": "A sweet film. Eddie Redmayne and Felicity Jones are remarkable."
    },
    {
      "text": "Meticulous in its adherence to conventional narrative inducement, this biopic only offers a sanded-down and embossed vision of Stephen Hawking and Jane Wilde's 30-year marriage."
    },
    {
      "text": "Bordering on the bland, stepping into Hallmark territory on a number of occasions, this love-filled biopic still managed to melt most of our reservations away."
    },
    {
      "text": "Hawking's innovations and refusal to subscribe to outdated modes of thinking merely underscore the utter conventionality of his film biography."
    },
    {
      "text": "Starring Eddie Redmayne as Stephen and Felicity Jones as Jane, the two develop a masterful and sonorous dynamic that behaves as a naturalistic relationship that inhabits qualities of both love and sadness."
    },
    {
      "text": "Eddie Redmayne knocks it straight out of the universe"
    },
    {
      "text": "In its potted appraisal of Hawking's cosmology, The Theory of Everything bends over backwards to speak to the layman, and relies on plenty of second-hand inspiration. But it borrows from the right sources, this Theory. And that's something."
    },
    {
      "text": "James Marsh's biopic salutes the famous physicist's commitment, but falls short of exploring his brilliant ideas."
    },
    {
      "text": "For a film about Stephen Hawking, the premiere voice on the physics of time, space -- and, gee, the universe -- it's only appropriate that the bio-pic formula is expanded. An extremely powerful film with great cinematography and fantastic performances."
    },
    {
      "text": "Redmayne towers: this is an astonishing, genuinely visceral performance which bears comparison with Daniel Day-Lewis in My Left Foot."
    },
    {
      "text": "A stirring and bittersweet love story, inflected with tasteful good humor ..."
    },
    {
      "text": "Absorbingly lovely and sad ..."
    },
    {
      "text": "A solid, duly moving account of their complicated relationship, spanning roughly 25 years, and made with impeccable professional polish."
    },
    {
      "text": "A pair of very strong performances can't keep The Theory of Everything from succumbing to the stultifying gravity of biopic conventions."
    },
    {
      "text": "Eddie Redmayne and Felicity Jones enliven a straightforward, BBC-grade drama with two mesmerizing performances, antithetical but equally assertive."
    }
  ],
  "release_year": 2014,
  "duration": 123,
  "genres": [
    "Biography",
    "Drama",
    "Romance"
  ],
  "age_rating": "PG-13",
  "synopsis": "In the 1960s, Cambridge University student and future physicist Stephen Hawking (Eddie Redmayne) falls in love with fellow collegian Jane Wilde (Felicity Jones). At 21, Hawking learns that he has motor neuron disease. Despite this -- and with Jane at his side -- he begins an ambitious study of time, of which he has very little left, according to his doctor. He and Jane defy terrible odds and break new ground in the fields of medicine and science, achieving more than either could hope to imagine.",
  "popularity": 8.4,
  "poster_url": "https://image.tmdb.org/t/p/original/kJuL37NTE51zVP3eG5aGMyKAIlh.jpg"
}