{
  "movie_name": "The Exorcist",
  "movie_id": "exorcist",
  "total_reviews": 167,
  "reviews": [
    {
      "text": "It remains genuinely unnerving to this day -- ridiculous in places, faintly despicable in others, but gorgeous to look at and possessed with a sense of absolute, ruthless gravity."
    },
    {
      "text": "The macabre, obscene demonstrations of manifest evil still retain their power to startle and nauseate, particularly Linda Blair's \"head-turning\" antics as the possessed child."
    },
    {
      "text": "The mindless and hysterical banality of the evil presented in The Exorcist is the most terrifying thing about the film. The Americans should cer­tainly know more about evil than that; if they pre­tend otherwise, they are lying."
    },
    {
      "text": "The Exorcist more conspicuously pushed into the mainstream a hitherto disreputable genre."
    },
    {
      "text": "Seminal and important for good reasons."
    },
    {
      "text": "Perhaps the most influential American horror movie ever made, The Exorcist was a Rorschach test when it came out. Fifty years later, it still sticks with us."
    },
    {
      "text": "The scariest movie ever made..."
    },
    {
      "text": "This film's ponderings about the nature of good and evil still merit consideration today. It also features some wonderful performances from Ellen Burstyn, Jason Miller, Max von Sydow and, especially, a then pre-adolescent Linda Blair."
    },
    {
      "text": "The movie moves at a pace that is unheard of today; a good hour and a quarter pass before the word \"exorcism\" is even mentioned. Yet it weaves a frightening spell right from the get-go."
    },
    {
      "text": "The Exorcist remains an exceptionally well-made, thoughtful film, enacted by a first-rate cast and displaying an almost masterful interplay between the humdrum and the horrific."
    },
    {
      "text": "Friedkin performed a similar alchemy to that of Francis Ford Coppola [with The Godfather]: He took a good, pulpy novel and turned it into a great, enduring movie."
    },
    {
      "text": "Some parts are bound to be greeted by unintentional laughter today, the result of countless parodies over the years. Still, The Exorcist has lost none of its ability to invade your nightmares."
    },
    {
      "text": "The Exorcist accomplishes what so few horrormeisters save Stephen King have managed: It sets sin and salvation not in the realm of graveyards and goblins, but in day-to-day life."
    },
    {
      "text": "By the end, after the priests had finished their battle for Regan MacNeil's body and soul, I expected to see my frigid breath hanging in the air."
    },
    {
      "text": "The Exorcist has dated little, and its essential premise makes it still one of the most modern of horror films. The monster isn't lurking out there. It resides in us, even in the most banal vessel imaginable, a sweet schoolgirl."
    },
    {
      "text": "The tension is created by brilliant direction, tight editing, hydraulics, Linda Blair's makeup and the voice of the Prince of Darkness that chills the spine and showers the body with goosebumps. The acting in this dark movie is flawless, too."
    },
    {
      "text": "It is carefully constructed, filled with nuance, designed to build fear one minute at a time. There can be no escape, no break, just the horror unfolding before your eyes."
    },
    {
      "text": "A horror film for grown-ups, paced out carefully, graced by much emotional subtlety and a spirit of intelligent questioning that never lets the viewer of any or no religious persuasion slip into complacency."
    },
    {
      "text": "Spewing from Blair's 12-year-old mouth via McCambridge's distressed larynx, the script's sexual obscenities are shocking enough to accomplish the virtually impossible and restore the potency of the four-letter word."
    },
    {
      "text": "The Exorcist is a masterful movie three decades later because it was made by filmmakers who had something to say and who knew when to use restraint and when to entertain and when to burrow under your skin."
    },
    {
      "text": "Where previously it was an appalling subversion of good taste, subtlety, exposure to Ouija boards and the Catholic stigma of divorce, it now seems clumsy and adolescent."
    },
    {
      "text": "It's still jolting. It's great shock theater."
    },
    {
      "text": "The dismissal of The Exorcist as sheer exploitation sells the themes of faith and family short. Besides, manipulative or not, it still stands as one of the most truly horrifying films ever made."
    },
    {
      "text": "What has given The Exorcist legs for all these years is its ability to earn its scares honestly, accruing tension over the course of two hours, releasing it in little spasms of relief and then cranking up the suspense until it is very nearly unbearable."
    },
    {
      "text": "It's still the same old schlock -- a deeply cynical, morally corrupted, often utterly senseless work that has somehow been raised to the status of greatness."
    },
    {
      "text": "What does impress is the film's early command of suspense. It seems slow to get going, but the malevolence simmering beneath the calm exterior is truly nasty."
    },
    {
      "text": "Friedkin's direction pays equal attention to artistry and the gross-out. His camera is never bored, be it an establishing shot or a montage of skull X-rays."
    },
    {
      "text": "Where the film heads south is the elimination of most of the compelling parts of the book... If a film ever needed to add another hour to its length, it's The Exorcist."
    },
    {
      "text": "Director William Friedkin builds up the overlapping stories so slowly and deliberately that one might mistake this for a dramatic character study rather than a goose-pimpled thriller. But the goose pimples form anyway."
    },
    {
      "text": "The result is a story of surprising intelligence and spiritual power, undiminished over 27 years."
    },
    {
      "text": "Director William Friedkin's crude technique, which is basically borrowed from carnival sideshows, looks cornier than ever."
    },
    {
      "text": "Watching The Exorcist 27 years after its release, it's easy to see how much the movie's story is a product of its times. But the movie worked then, and it still does."
    },
    {
      "text": "The film so steadily ratchets up the horror that seeing it on commercial television is just plain silly. This is a film that needs to be seen larger-than-life, in a darkened room, with a hundred or so of your most terrified friends."
    },
    {
      "text": "This is Hollywood having it both ways: the spiritual melded with smut."
    },
    {
      "text": "This extraordinarily moving and terrifying film has lost none of its power -- it makes the ersatz splatterfests that pass for horror movies these days look like ghoulish cartoons."
    },
    {
      "text": "William Friedkin's disturbing drama set the standard for Satanic themes in movies for years and some of the exorcism images quickly became pop-culture shorthand. See it, if you haven't, but don't eat pea soup beforehand."
    },
    {
      "text": "Although it's clear The Exorcist is no masterpiece, it still retains a powerful charge which most contemporary horror movies have lost in a flurry of post-modern irony and nudgewink jokiness."
    },
    {
      "text": "A 132-minute jump scare – with horribly malign slow sections – taking place in upper-middle class America rather than some exotic central European locale."
    },
    {
      "text": "It is a genuinely shocking movie, which in its ferocious strength and bloodcurdling events denies any possibility that what we are witnessing is anything but a titanic struggle between God and the Devil."
    },
    {
      "text": "The Exorcist is a stunning movie. It is not a pretty movie, and it will repel some, but it hits with explosive force, reveals Jason Miller to be as fine an actor as he is a writer, and is a moving, powerful drama."
    },
    {
      "text": "The Exorcist is far and away the best and most provocative of this season's new releases, tremendously affecting, as visceral as a nightmare. Its flaws are really only flaws of omission."
    },
    {
      "text": "Whatever you may think of the story, you should recognize Friedkin's masterful staging of it. The Exorcist is a spellbinder because Friedkin creates the experience of evil and sustains it for two hours. That's an incredible feat."
    },
    {
      "text": "Frankly, The Exorcist is nothing but a superior shocker. A very well-made horror movie, with pretensions to something better (or certainly deeper) that never does more than stick its nose out and then hastily withdraw."
    },
    {
      "text": "If The Exorcist isn't the thinking-man's horror movie we were expecting -- congratulate Friedkin for keeping us thinking when the chill is on."
    },
    {
      "text": "Somewhere underneath all this hype, sound and fury there is... An odd mixture of competence, craft and absolute shoddiness. It is far from greatest horror film or supernatural film but it may well be the most expensive and soullessly engineered."
    },
    {
      "text": "The movie is a startling mix of religion, ESP, frenzy, fervent hope, occultism and a heavy-handed dose of diabolism. But don't mistake it... The Exorcist is slam-bang sensationalism. It is an exhaustive, as well as an exhausting shocker."
    },
    {
      "text": "All things considered, The Exorcist, in terms of shocks per hour, qualifies, at least superficially, as an entertaining film although not a horror classic."
    },
    {
      "text": "The sign of the Devil is all over the film, which survived strange troubles in the two years of its making to emerge as a creation of infernal inspection -- cunning, shocking, obscene, outrageously bold and immorally spellbinding."
    },
    {
      "text": "It is absolutely, almost unspeakably shocking. But the question is, to what end?... Whatever deeper purpose the film may have had as a study of Christian commitment or moral strength is lost in the more sensationalized aspects."
    },
    {
      "text": "A great many people will feel both frightened and sick. My own reaction was one of first irritation and then anger that a filmmaker of Friedkin's resource should lend his talent, and that of a good cast, to something so essentially meretricious."
    },
    {
      "text": "Vomiting, urinating and a great flow of four-letter words are worked in to a picture that seems especially designed to support sensation -- and little else, for the narrative line is weak and the character drawing superficial."
    },
    {
      "text": "The Exorcist is a scary film, but no more so than The Haunting or any other well-done ghost story."
    },
    {
      "text": "The result is a remarkable tribute to the realistic potential of the film medium, yet it numbs the viewer's senses with unnecessary repulsion and noise."
    },
    {
      "text": "If The Exorcist doesn't knock you out of your seat, it's only because you'll be too stunned to move."
    },
    {
      "text": "The overreaction to The Exorcist is amazing when you consider the movie was designed and executed as shock entertainment; and since the shocks here are so witless and superficial, they should conceivably have no lasting effect."
    },
    {
      "text": "The real hero of this film is the man who pulled it all together: director William Friedkin, who has well-deserved billing under the title. Friedkin, who cut his film teeth in television, has crafted a masterpiece of narrative filmmaking."
    },
    {
      "text": "True, the special effects are often impressive and the acting is more than passable, but the whole affair struck me as about as morally edifying and aesthetically satisfying as watching the Gaderene swine plunge into the sea in slow motion."
    },
    {
      "text": "Take away the exorcism and I would have been considerably more impressed by The Exorcist."
    },
    {
      "text": "Whether you believe in the occult or not, The Exorcist is an extremely shocking and compelling movie -- and it also happens to be extremely well-made."
    },
    {
      "text": "Shorn of all the trappings and removed from all the frenzy, in fact, [The Exorcist] is a very well-made movie -- not entirely a satisfactory one, to be sure, but without question an impressive one. Most important of all, it's also a genuinely scary movie."
    },
    {
      "text": "Sensation-sated though we are these days, The Exorcist makes you realize the tremendous potential within the motion-picture medium, affording power to give images of a lurid novel even greater impact."
    },
    {
      "text": "Maybe the movie will bring in hordes of patrons. It is difficult to understand, however, why anyone of sound mind would pay good money to subject himself to so ghastly a movie-watching experience."
    },
    {
      "text": "I can't possibly believe that one is supposed to take The Exorcist seriously. It's a childish prank which pretentiously deals with the struggle over evil in narrow Gothic terms."
    },
    {
      "text": "If you have to see one film this year, it may as well be The Exorcist, William Peter Blatty's bizarre story about a demon who takes over a girl's soul. It's a gasp of a film."
    },
    {
      "text": "A grim, poorly paced effort that lacks the two ingredients necessary for total credibility in horror films: Genuine enthrallment and Hitchcockian-style black humor."
    },
    {
      "text": "William Peter Blatty's best-selling novel has been filmed by the talented William Friedkin with even more fidelity than many readers may care for. It is a riveting, stunning experience -- for those who can take it."
    },
    {
      "text": "It's not a picture I can honestly say I \"liked.\" I did find it an exhausting, stunning emotional traumatic film trip that left me drained for days. It's really \"something else\" as far as a film goes -- and this goes pretty far."
    },
    {
      "text": "The Exorcist succeeds on one level as an effectively excruciating entertainment, but on another, deeper level it is a thoroughly evil film."
    },
    {
      "text": "A finely crafted thriller that benefits immensely from William Friedkin’s controlled direction, William Peter Blatty’s thematically fruitful script, and Dick Smith’s startling makeup designs."
    },
    {
      "text": "What is objectionable is not the foulness that comes roaring and Beelze-bubbling out of the screen whenever the possessed girl is on it, but the whoppingly tendentious purpose she is there to serve."
    },
    {
      "text": "It is unfortunate that basically The Exorcist is a good film, for the shock tactics have been calculated in a most unconscionable way, and this should have been enough to damn it. However, the cast is superb."
    },
    {
      "text": "The trouble with the occult is that it spreads like a contagion, preying on the feeble-minded... And so with this film. It supports centuries' old notions of devils and possession without adding any new dimensions of understanding."
    },
    {
      "text": "It is not for the squeamish. Avoid seeing it after a heavy meal. It also happens to be a technically brilliant film, acted with such persuasive realism as to make the bizarre events totally credible and absorbing."
    },
    {
      "text": "The movie project that has managed to annihilate the media, literally \"out farthering\" The Godfather in both publicity-grabbing and being \"far out,\" is an exceptionally well-crafted motion picture product."
    },
    {
      "text": "The final result is a witches' brew with cauldrons bubbling with too much frantic mayhem and too many hysterical climaxes occurring before the final climax with its legitimate mayhem."
    },
    {
      "text": "If this cinema of revulsion-for-its-own-sake is what you wish from a medium of art and entertainment, the best of Transylvanian luck to you. Next time you can demand a look at medical films of operations."
    },
    {
      "text": "Although the film has every attention lavished on it, it is much less scarifying than something like Rosemary's Baby, where the grisly happenings did have a sickening plausibility. The Exorcist, however, is simply a superior spook-movie."
    },
    {
      "text": "As somebody who feels the ritual of horror should touch the nerve of something within us, I feel that The Exorcist cops out. It shows us everything and, thus, reveals nothing."
    },
    {
      "text": "The Exorcist has arrived in all its grim, gory and gruesome glory, and, like a dreaded trip to the dentist's office, isn't nearly as bad a trip as the wary were fearing. What it is, in fact, is a superb shocker."
    },
    {
      "text": "It's a cheap kind of horror because it is nothing more than repulsive spectacle, unattended by sympathy or even suspense."
    },
    {
      "text": "The Exorcist is a tough film, often ugly, but compelling and skillfully put together for maximum impact."
    },
    {
      "text": "It cannot be denied that The Exorcist proves the power of film to control your emotions. But it is not proof positive. I think it may well be an evil film, for The Exorcist is itself possessed by the resident house devil of Hollywood: rank commercialism."
    },
    {
      "text": "[A] terrifying journey into a miasma of religion and guilt and pain, complete with flashes of a demonic face that I still cannot handle seeing unprepared."
    },
    {
      "text": "The Exorcist isn’t just frightening at a visceral level, it’s bleak on an existential level."
    },
    {
      "text": "After 50 years, The Exorcist is still scaring us."
    },
    {
      "text": "What makes The Exorcist so fantastic, however, are the performances..."
    },
    {
      "text": "The restraint and intelligence of William Friedkin’s definitive Cathsploitation movie is at odds with the trend towards overt shocks and sadism in contemporary horror."
    },
    {
      "text": "It’s not only one of the best horror films ever made, it’s easily one of the silver screens finest features."
    },
    {
      "text": "As much as it has been parodied and referenced and imitated millions of times, it is still one of the best horror movies ever made. Full review in Spanish."
    },
    {
      "text": "The director's horrifyingly maintained assault of the viewer's senses and faith leaves the audience subject to devilish, claustrophobic torment that makes the resultant spiritual awakening all the more powerful."
    },
    {
      "text": "It's actually kind of astonishing to me that the film still retains the power to shock and frighten a first-time viewer."
    },
    {
      "text": "Scary then, scary still. Without a doubt one of the most frightening films ever made. [Full review in Spanish]"
    },
    {
      "text": "Remains one of the scariest movies to date given the shocking nature of its subject matter of a little girl possessed by devil, and it's really up to the audience to believe if that can happen or not."
    },
    {
      "text": "The makeup is still top-notch and spectacularly chilling, paired perfectly with puppetry and repulsive props for several of the most alarming cinematic shots."
    },
    {
      "text": "A product of its time, in the best ways."
    },
    {
      "text": "Such perfectionism at the service of trash takes on a lurid, almost indecent, character. Still, Friedkin has a crass expertise with which he can keep the average moviegoer from laughing at these absurd goings-on, and he certainly gets great performances."
    },
    {
      "text": "Simply the most terrifying movie ever made, even now."
    },
    {
      "text": "The film continually struggles to suggest through atmosphere what it promises but fails to provide in substance."
    },
    {
      "text": "The problem for me is that the movie has no sense of purpose, no convictions."
    },
    {
      "text": "One scary movie that still terrifies me to this day..."
    },
    {
      "text": "They went above and beyond...we have movies like The Exorcist to thank for so many other movies..."
    },
    {
      "text": "This is a powerful movie that continues to stand up today and for good reason too - it's a masterpiece."
    },
    {
      "text": "[The Exorcist] may not be a great film. It is, however, a brilliantly successful horror movie."
    },
    {
      "text": "Friedkin seems to have found his forte."
    },
    {
      "text": "Without a doubt, \"The Exorcist\" is a touchstone in horror, seemingly incapable of taking a wrong step. Watching with the lights off is strongly encouraged. Turning them back on immediately afterwards will be a necessity."
    },
    {
      "text": "The Exorcist runs out of steam long before reaching its decidedly low-key (and somewhat anticlimactic) finale..."
    },
    {
      "text": "A work of cinema in its own league."
    },
    {
      "text": "The film turns out to be a superior horror story, very ably directed by William Friedkin whose last film was The French Connection."
    },
    {
      "text": "The Exorcist, with its excellent cast, mounting intensity, and ingeniously constructed surprises, is still a commanding achievement."
    },
    {
      "text": "The movie that launched a new era in horror films, and which, for one generation, remains one of the scariest experiences of their lives."
    },
    {
      "text": "The Exorcist, like most memorable Hollywood movies, gains its power from the way it mixes opposites: new-style realism and sexual radicalism, old-style horror and religion."
    },
    {
      "text": "When I first saw The Exorcist, I saw only the literal side of the story. But as I watched it again, I began to view the movie as a dark fairy tale about a parent whose child is experiencing a painful trauma."
    },
    {
      "text": "[Friedkin] knew he wasn't making art; he was concocting gross-out pop -- a movie so \"scary\" it borders on being silly."
    },
    {
      "text": "Von Sydow, Blair and Mercedes McCambridge (the originally uncredited actress who dubbed Regan's gross mutterings) are flat-out terrific."
    },
    {
      "text": "Less a cleverly spun story than a disjointed collection of shockeroos, surrounding a few ghoulishly effective moments with overcooked plot twists and in-your-face vulgarity."
    },
    {
      "text": "William Friedkin's adaptation of William Peter Blatty's novel, with a screenplay by the author, is a dead-serious meditation on the struggle between good and evil."
    },
    {
      "text": "Aall The Exorcist does is take its audience for a ride, spewing it out the other end, shaken up but none the wiser."
    },
    {
      "text": "The gold standard of possession films, this works on multiple levels across generations."
    },
    {
      "text": "The Exorcist is what it purports to be, no less than one of the best horror films, one of the best films, of all time."
    },
    {
      "text": "Through technical virtuosity at every artistic level.. The Exorcist becomes more than a shocking movie: a film with a strong, positive force. I loved it."
    },
    {
      "text": "It's good stuff but, basically, The Exorcist is a museum piece, something to be enjoyed for its historical value, its datedness and its almost quaint shock value."
    },
    {
      "text": "Friedkin's Exorcist holds up remarkably well."
    },
    {
      "text": "This notorious battle between good and evil, nominated for eight Oscars when it was originally released in 1973, is both a hysteric scream and an intentional as well as unintentional hoot."
    },
    {
      "text": "Essential viewing for anyone who loves cinema. If you can endure it..."
    },
    {
      "text": "succeeds best in developing its characters"
    },
    {
      "text": "There’s no doubt that the film is an effective button-pusher, even genuinely frightening, but for all its delayed gratification, William Peter Blatty’s script offers precious little in the way of character-building."
    },
    {
      "text": "The Exorcist is a movie to make your hair stand on end. And turn your stomach. Unfortunately it may affect your stomach more than it does your hair. For many The Exorcist may well be the movie to be nauseous by."
    },
    {
      "text": "What The Exorcist really gave rise to was a demon of entertainment, an impulse of titillating blatancy that has bedeviled and outraged audiences ever since. That demon was kicky and gross and fun and purgative."
    },
    {
      "text": "There's something new to be discovered in every viewing of The Exorcist."
    },
    {
      "text": "Max von Sydow brings gravity and fragility to Father Merrin, the discoverer of Pazuzu who becomes the spectral figure in black beneath the street lamp in the celebrated poster."
    },
    {
      "text": "This is a movie that believes in evil, and sees no point in dancing around the inevitable acknowledgments."
    },
    {
      "text": "But, is it just me, or is Karras's the only story that's really compelling?"
    },
    {
      "text": "Taken as a whole, The Exorcist is not the icon of terror it once was, but it's still a solid film with a lot to recommend it, and a must for those with an interest in horror history."
    },
    {
      "text": "It just never gets un-scary. That's the best part."
    },
    {
      "text": "Trendsetting shocker about a possessed child."
    },
    {
      "text": "An unforgettable horror film that doesn't just get under my skin - it stays there."
    },
    {
      "text": "...the movie is right up there with the cinema's better chillers."
    },
    {
      "text": "If it failed on all other levels (which it doesn't), The Exorcist would nevertheless be an excellent family horror story."
    },
    {
      "text": "From the day of its first release in 1973, \"The Exorcist: was the greatest horror film ever made, and it remains so to this day."
    },
    {
      "text": "... a crude religious exploitation piece (although poor Linda Blair - required to urinate, swear and vomit on cue - is exploited more than anything else)."
    },
    {
      "text": "The overall film has a well-developed sense of atmosphere that most films of today are missing."
    },
    {
      "text": "Friedkin and Blatty seem to care nothing for their characters as people, only as victims-props to be abused, hurled about the room, beaten and, in one case, brutally murdered."
    },
    {
      "text": "The Exorcist is not an unintelligently put-together film, which makes one all the more impatient with it."
    },
    {
      "text": "If movies are, among other things, opportunities for escapism, then The Exorcist is one of the most powerful ever made."
    },
    {
      "text": "A story whose archetypal pull and sheer visceral power can't be negated by even the worst audience behaviour."
    },
    {
      "text": "There's something elemental about The Exorcist."
    },
    {
      "text": "There is nothing dated about The Exorcist, which remains an effective excursion into demonic possession more than a quarter of a century after it was first unveiled to the public."
    },
    {
      "text": "The film is an intense rollercoaster ride, a marvel of audience manipulation, with director William Friedkin pushing all the right buttons to make this a genre landmark."
    },
    {
      "text": "The Exorcist is an expert telling of a supernatural horror story. The well cast film makes credible in powerful laymen's terms the rare phenomenon of diabolic possession."
    },
    {
      "text": "It stimulates and rewards, time and time again."
    },
    {
      "text": "This is the dark frightening place where modern horror cinema began."
    },
    {
      "text": "This 1973 horror thriller is highly instructive as well as unnerving."
    },
    {
      "text": "Totally ludicrous."
    },
    {
      "text": "One of the few horror films that hold up well, The Exorcist is still scary due to the visual and sound effects, but it's also well-written by Blatty, well-directed by Friedkin, and well-acted by Ellen Burstyn as the mother and Linda Blair as her daughter"
    },
    {
      "text": "Arguably the most troubling factor is the lack of true redemption in the twist ending, which resolves the demon possession without allowing good to triumph over evil."
    },
    {
      "text": "As it gets into the minds of its characters, it finds powerful suspense and drama. And a startling examination of how we can never really understand the nature of mankind... or God."
    },
    {
      "text": "Barbarism and exploitation here parade as something deeper. Abominable."
    },
    {
      "text": "The scariest movie I have ever seen. So scary, I refuse to watch it again."
    },
    {
      "text": "If horror movies constitute a distillation of the basic struggle of good vs. evil, The Exorcist delivers it in the most profound way: inviting us to meditate on the universe around us while still scaring the pants off of us at every turn."
    },
    {
      "text": "A sour odor of spiritual guilt wafts through every fascinating minute of The Exorcist."
    },
    {
      "text": "Absolutely timeless horror in its purest form. Seeing this recently with a bunch of rambunctious college students, not even they were immune. Exorcism time came around--you could hear a pin drop in the cinema."
    },
    {
      "text": "I simply see no justification for such sacrilege. You know what scene I mean."
    },
    {
      "text": "It never was a great film, but it's still effective--the 2000 version is nearer greatness"
    },
    {
      "text": "A film of such horrifying power that audiences are apt to be visibly shaken."
    },
    {
      "text": "At once an honest, disturbing exploration of the darker aspects of religion and the spiritual world, it is also an unabashed horror movie"
    },
    {
      "text": "No matter how many times viewed, The Exorcist never fails to deliver the goods."
    },
    {
      "text": "The Exorcist (1973) is the sensational, shocking horror story about devil possession and the exorcism of the demonic spirits from a young, innocent girl"
    }
  ],
  "release_year": 1973,
  "duration": 122,
  "genres": [
    "Horror"
  ],
  "synopsis": "One of the most profitable horror movies ever made, this tale of an exorcism is based loosely on actual events. When young Regan (Linda Blair) starts acting odd -- levitating, speaking in tongues -- her worried mother (Ellen Burstyn) seeks medical help, only to hit a dead end. A local priest (Jason Miller), however, thinks the girl may be seized by the devil. The priest makes a request to perform an exorcism, and the church sends in an expert (Max von Sydow) to help with the difficult job.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/5x0CeVHJI8tcDx8tUUwYHQSNILq.jpg"
}