{
  "movie_name": "The Fault in Our Stars",
  "movie_id": "the_fault_in_our_stars",
  "total_reviews": 224,
  "reviews": [
    {
      "text": "The subject matter — a pair of teenage cancer sufferers meet and fall in love — could have been mawkish mush, but there’s a sharp, abrasive wit and anger that tempers the tear-jerking with humour."
    },
    {
      "text": "It actually presents us with situations and a relationship that feels genuine yet uncertain because of the dark cloud hanging over it."
    },
    {
      "text": "My biggest complaint about the whole experience was being splashed by the tears of my fellow moviegoers. Bring a towel."
    },
    {
      "text": "The reason that The Fault in Our Stars works so well is that its main draw (the teenage love story) is tied so expertly to its emotional core (Hazel's relationship with her parents)."
    },
    {
      "text": "The winning combo of the shamelessly melodramatic and the slyly mischievous that powers the movie owes much to yet another pitch-perfect lead performance from Woodley."
    },
    {
      "text": "Sadly, in Hollywood's hands all the things that made John Green's taut, touching and terrific 2012 novel transcend generation gaps have been jettisoned in favour of a hyperglycaemic tale of two star-crossed (cancer-riddled) teens."
    },
    {
      "text": "In other words, this is real. If anyone tells you differently, they haven't a clue."
    },
    {
      "text": "In a laudable attempt to seem heartfelt without blatant manipulation, the film generally succeeds, thanks especially to a winning performance from Shailene Woodley."
    },
    {
      "text": "It's charming, well-written, superbly acted."
    },
    {
      "text": "Heartfelt, sincere and altogether rather wonderful, The Fault in Our Stars will enchant audiences and leave behind very few dry eyes in its wake."
    },
    {
      "text": "It all felt kind of manipulative and corny."
    },
    {
      "text": "Woodley and Elgort are gifted in that they exude intelligence, thoughtfulness, and savvy, making smart dialogue sound smart, the corniest lines sound terribly romantic and natural."
    },
    {
      "text": "Under the assured direction of Josh Boone, the film earns its emotions without grand manipulative gestures, and finds its heart through the fantastic cast and an effortless and appealing intimacy between the characters."
    },
    {
      "text": "Dafoe is, as expected, solid in the role, but I felt the storyline on the whole could have been a little tighter. That's a minor fault however, in a script whose stars make it all worthwhile."
    },
    {
      "text": "The talented cast and crew enhance what is already some pretty good material, making \"Fault\" a teenage tearjerker that doesn't fall into a typical Hollywood weeper formula."
    },
    {
      "text": "It's sweet, cathartic and a bit beautiful. Just make sure you bring Kleenex."
    },
    {
      "text": "In the end, this adaptation may not be all that different than effective screen tearjerkers of the past, but in staying true to its source material, its infinity is bound to be a little bigger than most."
    },
    {
      "text": "It will certainly be a tearjerker for some, but the film's final triumphant message means that you shouldn't be too depressed when you leave the theatre."
    },
    {
      "text": "The two-hour and five-minute running time of continuous sadness and unending pearls of wisdom made this viewer disconnect from the characters."
    },
    {
      "text": "The problem may be that The Fault in Our Stars is based on a book by John Green; this certainly wouldn't be the first time a strong literary narrative had troubles translating to the screen."
    },
    {
      "text": "Earnest performances lend depth to the characters, making them come alive."
    },
    {
      "text": "Nothing beats the performances by Shailene Woodley and Laura Dern -- probably the two best reasons to see this film."
    },
    {
      "text": "The Fault in Our Stars begs us to cry, and that's where it loses its composure."
    },
    {
      "text": "I think you will taste the stars when you see The Fault in Our Stars. It is a love story for our time that encourages us to remember, Love is stronger than death."
    },
    {
      "text": "It's safe to declare the adaptation of the popular young adult novel a wild success."
    },
    {
      "text": "Woodley is one of our most interesting young actors-even though her post-Spectacular Now material has been subpar, this included-and they're great together. Even if you don't believe it for a second (nope), you're going to cry."
    },
    {
      "text": "Green took the familiar and maudlin and transformed them into something knowing, poignant and practically sensitive."
    },
    {
      "text": "\"The Fault In Our Stars\" is a top-tier tearjerker and a veritable shoo-in for all future \"movies that will make you bawl\" lists."
    },
    {
      "text": "Boone's appropriately light touch emphasises the underlying literary material, foregrounding the performances with occasional underplayed visual humour and reserving stylistic nuance."
    },
    {
      "text": "Although certain plot points skirt dangerously close to clichs that more cynical viewers will have been dreading, somehow they manage to resolve plausibly."
    },
    {
      "text": "The Fault in the Stars is what my late mother's generation used to call a three-handkerchief"
    },
    {
      "text": "It's an old-school weepie, all right, and the usual weepers will weep loudly."
    },
    {
      "text": "The Fault In Our Stars could indeed become this generation's Love Story -- mildly implausible, but genuinely moving."
    },
    {
      "text": "This movie can parade its \"truth\" as much as it likes, but I for one don't buy it."
    },
    {
      "text": "The Fault in Our Stars presents itself as a cooler, calmer, more considered kids-with-cancer film, but remains content with going through the melodramatic motions."
    },
    {
      "text": "Woodley's performance is unsurprisingly absorbing, but the real fun comes with Elgort's Augustus Waters."
    },
    {
      "text": "It handles life's big issues with honesty through its gritty lead character, Hazel. The other characters are brave and easy to empathize with."
    },
    {
      "text": "Funnily enough, the producers of the Twilight series are behind the latest teen adaptation, but The Fault in Our Stars is a more serious take."
    },
    {
      "text": "The transparent eagerness of this movie to break hearts, through means not entirely justifying that end, always pulled me back, as it did with Love Story 40 years ago. Not buying into a stacked emotional deck means never having to say you're sorry."
    },
    {
      "text": "Do the tears flow? It's hard to stop them but it's a reflex action, triggered by the tragic conjunction of cancer and the young, rather than any sense of kinship with the particular pair you've been watching on screen."
    },
    {
      "text": "It's a carpe diem love story that overcomes its own faults, and earns its tempered hopefulness, by maturely recognizing that love and pain are equal, and often intertwined, parts of life."
    },
    {
      "text": "Along with its credible stars, that's enough to predict that Fault is going to find its target audience, big time."
    },
    {
      "text": "It's essentially a two-character show: Elgort is handsome and appealing, while Woodley continues her steady progress to stardom."
    },
    {
      "text": "\"The Fault in Our Stars\" is unabashed in its efforts to make you well up, but the tears come from a real place."
    },
    {
      "text": "Ultimately, The Fault in Our Stars overcomes those faults because of Woodley, who uses her instincts and abundant talent to depict Hazel as a fully realized young woman who's more than just the sum of her symptoms."
    },
    {
      "text": "The Fault In Our Stars is unlikely to win over the cynics, but Woodley has a smile that lights up the screen, and you believe in her even when the film's plausibility is stretched."
    },
    {
      "text": "The film has enough charm and humor to keep it appealing to a wide audience, and dumbing things down doesn't feel particularly smart or canny, and proves to be a minor distraction to an otherwise majorly entertaining feature."
    },
    {
      "text": "The adaptation of John Green's best-selling young adult novel gets downright gloppy at times, even as Hazel and Augustus strive to remain brave and unsentimental. But it touched my heart and mind."
    },
    {
      "text": "Far from the shameless emotional pummeling it might have been, this adaptation of John Green's cherished YA cancer drama finds a conduit to earned, understated tears -- a tricky accomplishment given the material."
    },
    {
      "text": "The actors and the basic material ensure that The Fault in Our Stars remains, in its movie form, an affecting love story."
    },
    {
      "text": "I suspect most audiences will find themselves largely charmed by the young leads and the intelligent approach to a difficult subject."
    },
    {
      "text": "\"The Fault in Our Stars\" may not show the true messiness of cancer, but it does grapple with death and the ability to survive great loss. Maybe that's enough truth for one movie."
    },
    {
      "text": "Now we have a three-hankie melodrama for the Snapchat generation, with smart phone texts taking the place of messages in bottles, but with most of the genre's established tropes firmly in place."
    },
    {
      "text": "The weight of the film, however, rests squarely on Woodley's shoulders, and she does an excellent job as Hazel, balancing her sharp wit and sheer determination with the right amount of frailty and fear."
    },
    {
      "text": "\"The Fault in Our Stars\" beautifully captures the hesitancy, shyness masked by outward confidence, feelings of unworthiness and quiet intensity of teenagers in love."
    },
    {
      "text": "Led by the unforgettable work from a young actress who's among the best of her generation, \"The Fault in Our Stars\" is a lovely work."
    },
    {
      "text": "The film gets even more sentimental as it strains not to be so."
    },
    {
      "text": "Every generation loses their heart to one great big weepie. Was it Love Story for you? Out Of Africa maybe? The Fault In Our Stars could well be the weepie of choice for this generation."
    },
    {
      "text": "It's a familiar message, but it's one told well with wit and heart. And a whole truckload of metaphors."
    },
    {
      "text": "Thankfully The Fault in Our Stars presents a more nuanced and healthy manifestation of YOLO -- one that is less oriented toward reckless self-gratification and more concerned with loving others."
    },
    {
      "text": "The movie survives its own clich because Hazel articulates our skepticism and keeps it real."
    },
    {
      "text": "The Fault in Our Stars is a movie that will be quoted by teens for generations to come."
    },
    {
      "text": "This is a sweet, simple, dignified movie about young lovers whose every move is chaperoned by death.It seems safe to say that it will have millions of people verklempt between now and forever."
    },
    {
      "text": "Woodley, always gifted in performance, makes sure Hazel's change from numb to receptive feels natural, attuned to the logic of reality."
    },
    {
      "text": "A positive and inspirational experience, far removed from cloying sentimentality. Hollywood might have lost touch with several genres in recent years, but on this evidence the weepie is back."
    },
    {
      "text": "Devotees of the book may have some concerns, but for those willing to take this movie on its own terms, as what reviewers used to call a 'four-hanky weeper,' it's something of a wow."
    },
    {
      "text": "You should probably not see \"The Fault in Our Stars\" with anyone you're trying to impress. You'll either end up a puffy, sniffling mess of tears, or you'll finish the movie dry-eyed and convince that person you're a psychopath."
    },
    {
      "text": "Speaks truth to cancer, only to wade into the puddles of tears it jerks, then bathe there by hyper-eulogizing itself; it even reduces the Anne Frank house to a metaphor for Hazel's struggle and foreplay for the star-crossed lovers' loss of virginity. Ugh."
    },
    {
      "text": "The Fault in Our Stars is exceptionally high-quality mainstream entertainment, a genuine work of art that exists in the often maligned sub-genre of teen girl-centric melodrama."
    },
    {
      "text": "While it may not conform to one's real-life expectations it certainly hews tightly to teen-flick conventions."
    },
    {
      "text": "There are some cutesy tendencies that might pander to a certain demographic, but this sensitively rendered adaptation should expand the enthusiastic young fan base for both Green and his book."
    },
    {
      "text": "Though at times you feel like you're being told when to cry, that doesn't mean you won't start dutifully blubbing on cue."
    },
    {
      "text": "Moments of pain go unplumbed."
    },
    {
      "text": "Based on the beloved novel by John Green, this film is so squarely slanted toward teen girls that it is likely to annoy everyone else."
    },
    {
      "text": "Screenwriters Scott Neustadter and Michael H Weber are on hand to lend an alt-indie edge that cuts through the mawkish manipulation ..."
    },
    {
      "text": "The film slowly turns into the kind of manipulative, lachrymose melodrama that Hazel herself professes to detest."
    },
    {
      "text": "For every nauseating moment in this cancer-related weepie, there's a lovely, thought-provoking exchange of ideas."
    },
    {
      "text": "It paints itself into a contrived, clich-ridden corner and, to get out of that, paints itself into yet another contrived, clich-ridden corner, until it runs out of corners and becomes the formulaic, sentimental cancer movie you hoped it wouldn't."
    },
    {
      "text": "No matter how emotionally bracing the film gets, there's a sense that punches are being pulled visually."
    },
    {
      "text": "The movie will be the stuff of truth and tragedy for some; for others, crafted schmaltz with an eye on the money."
    },
    {
      "text": "One weepie that never resorts to cheap manipulation, thanks to a wry script (based on John Green's chart-topping novel) and central performances to match ..."
    },
    {
      "text": "You have to concede the laser-guided accuracy and psychotic vehemence with which it goes for the tear duct. It's like being mugged by a professional whose skills in mixed martial arts you can't help but notice and appreciate ..."
    },
    {
      "text": "Try as you might, there's not a single damn thing you can do about The Fault in Our Stars. It's here. It exists. Suck up the saccharine, let it into your heart, and deal with it."
    },
    {
      "text": "Yes, it's a teenaged girl's romantic fantasy. And some of it might be in a secret code for young women. Imagine that."
    },
    {
      "text": "You'll need plenty of tissues, or a bucket. Or possibly both."
    },
    {
      "text": "Woodley and Dern breathe a ghost into the machine. Willem Dafoe has fun, albeit not too much, in a brief, vital role as a creepy writer. Most crucially, the words that survived from Green's novel did so for a reason."
    },
    {
      "text": "In the end it can't help but be pulled under by its own undertow of mawkishness."
    },
    {
      "text": "Despite a few missteps this is a spirited, touching romance and Shailene Woodley's best performance yet. Divergent fans after a weepie need look no further."
    },
    {
      "text": "A faithful adap that walks the mawk line thanks to the Woodley's naturalistic charm consolidating her standing as a compelling actress who can lead a film."
    },
    {
      "text": "The film dodges most of the pitfalls of clichd cancer dramas with humor and natural warmth."
    },
    {
      "text": "The Fault In Out Stars is a poignant, thematic, and sometimes nostalgic meditation of young love, life, and loss."
    },
    {
      "text": "Heartfelt but never mawkish, The Fault in Our Stars is a sharp and emotionally-sophisticated weepie that imbues its teenage characters with rare intelligence, and tackles its bleak subject matter with acerbic wit and tenderness."
    },
    {
      "text": "As teen romances go, this is powerful stuff. For a cancer weepie, it's a very rare thing indeed - an honest film that earns every tear."
    },
    {
      "text": "An emotional climax arrives every 15 minutes or so, and every affecting moment is underscored with a soppy light-rock song."
    },
    {
      "text": "The results of this star-crossed matchup could have been unbearably treacly or twee, but Green prefers to have his characters confront their situations with brutal humor."
    },
    {
      "text": "Rarely have I ever had to fight so hard to hold back from sobbing uncontrollably in a theater as I did with The Fault in Our Stars."
    },
    {
      "text": "Dull Hollywood plot devices can't diminish the overall luminosity of The Fault in Our Stars."
    },
    {
      "text": "It's a weepie. It can't be something else... a genre more respected. But it does what it does quite perfectly."
    },
    {
      "text": "Phony, cloying, and pandering."
    },
    {
      "text": "Every moment is about what they desire, impulsively, fiercely, naively, not merely that they want to live, but they want to live fully in each moment. Here. I am alive. You are alive. This is our moment. I love you. Love me. What else is this life?"
    },
    {
      "text": "The film belongs almost exclusively to Woodley. In a delicately balanced performance, she's both low-key and passionate."
    },
    {
      "text": "It is an optimistic reminder that your whole life is ahead of you, even if you're dying. And aren't we all?"
    },
    {
      "text": "What in the name of God is wrong with me that I didn't cry once -- I, who just the day before wept through the entirety of my child's thoroughly upbeat school play."
    },
    {
      "text": "Pets and flatters its target audience's mopiest impulses. This is not necessarily a bad thing."
    },
    {
      "text": "Shailene Woodley holds this tearjerker together, despite its schmaltzy tendencies."
    },
    {
      "text": "It hooks us with its mix of strong dialogue, restrained direction and powerhouse performances."
    },
    {
      "text": "The adaptation has its problems, but it also retains refreshing dignity, never dipping into hysterics to extract feelings it hasn't earned."
    },
    {
      "text": "Heartbreaking and bittersweet, it's a genuine tearjerker."
    },
    {
      "text": "Turned out far better than do most such tearjerkers."
    },
    {
      "text": "It's not that The Fault in Our Stars does anything particularly grievous, it just does too much of what it has."
    },
    {
      "text": "...Boone doesn't quite have the cinematic sensibilities demanded by the material..."
    },
    {
      "text": "Shailene Woodley and Ansel Elgort are so captivating and genuine in their performances, they manage to make this intensely poignant film very moving, romantic and highly entertaining."
    },
    {
      "text": "This is a manipulatively fake studio movie all the way, anchored and saved by star Shailene Woodley's inability to be inauthentic."
    },
    {
      "text": "'The Fault in Our Stars' is today's younger generation's 'Love Story,' a famous romance from the 1970s."
    },
    {
      "text": "An iGen Love Story... warm, well-made, sincere and, most of all, effective. It's designed to get to you."
    },
    {
      "text": "See? You don't always need vampires and factions to show teens in all their angst-filled, acid-tongued and hopeful glory."
    },
    {
      "text": "It isn't just about letting you have a good cry; it's about inspiring you to appreciate the good in life while you do it."
    },
    {
      "text": "There is substance in how it conveys our relationship between life and death; while churning the cogs of the Tear-Bot-1000."
    },
    {
      "text": "Risks sentimentality but mostly avoids it due to the grounded performances by Woodley and Elgort."
    },
    {
      "text": "Painfully predictable with oodles of cringe-worthy dialogue and overly convenient symbolism. I found myself rolling my eyes far more than I did wiping them."
    },
    {
      "text": "... but the overall cinematic package is so well-constructed that it's possible to both like the film and be aware of it's manipulative effects. We are heading directly towards a big cry."
    },
    {
      "text": "The natural Shailene Woodley and a handful of solid supporting performances can't keep The Fault in Our Stars from succumbing to the toxic effects of sap."
    },
    {
      "text": "The film's manipulative illness-of-the-week scenario is entirely resistible, despite the best efforts of Woodley (who almost saves the day with a sensitive portrayal)."
    },
    {
      "text": "The Fault in Our Stars isn't really a movie about cancer or death. Rather, it's quite-excellent film about finding love in a hopeless place."
    },
    {
      "text": "The Fault in Our Stars is a heart-breaker for sure, but it's also a sweet, romantic film full of sudden warmth and humor. It gets everything right about being young and in love for the first time."
    },
    {
      "text": "...an old-fashioned Hollywood melodrama for the modern age."
    },
    {
      "text": "Luminous leads make this schmaltz palatable."
    },
    {
      "text": "There's a moment when the breeziness powering the story goes away and medical reality takes over, and Elgort's performance goes to a surprising new place."
    },
    {
      "text": "Big movies have their embedded lessons in heroism, but it's nice to have tales of human-scale fortitude."
    },
    {
      "text": "The film is highly manipulative, all right, but in ways that allow the audience a modicum of self-respect. The sniffling legions at the screening I attended needn't have felt like fools."
    },
    {
      "text": "A heartfelt drama, where a pair of teenage protagonists set the stage for an ageless (and uplifting) message about human life - highlighting both its frailty and beauty."
    },
    {
      "text": "A flawed but empathic, fairly honest movie about flawed but empathic, honest characters."
    },
    {
      "text": "A story about daring to love in the face of death, well, it's really all our stories if we are brave enough."
    },
    {
      "text": "John Green's bestselling teen love story has been adapted into affecting, beautifully staged film."
    },
    {
      "text": "The eagerly anticipated film adaptation of John Green's popular YA novel about two teenagers fighting cancer and falling in love is everything it should be and, most likely, everything they want it to be. And yes, bring the tissues."
    },
    {
      "text": "\"The Fault in Our Stars\" returns us to the rare, gender-crushing ingredients in \"The Notebook\". It figures out how to put a guy and a girl together and actually release in them natural chemistry instead of artificially forcing them to feel it."
    },
    {
      "text": "Facing its issues with such wit and attitude keeps the film from ever being lugubrious. That and Shailene Woodley."
    },
    {
      "text": "The movie doesn't reach for tears, but tears come."
    },
    {
      "text": "Smarter, sharper and deeper than most movies targeted at teens--and much more than just a story about kids with cancer."
    },
    {
      "text": "Josh Boone's adaptation steps in goo from time to time, but understands crucial aspects of Green's bestseller ..."
    },
    {
      "text": "Woodley and Elgort, who played sister and brother in \"Divergent,\" have the unforced chemistry that happens so often when opposites attract."
    },
    {
      "text": "Woodley and Elgort's performances are pitch perfect and the chemistry between them, warts and all, is spot on. (Full Content Review for Parents also Available)"
    },
    {
      "text": "For a movie involving cancer, youthful fatalities and other heartbreaking developments, The Fault in Our Stars is remarkably entertaining and achieves a balance most tightrope walkers would envy."
    },
    {
      "text": "It's fun to see engaging teens instead of brooding vampires."
    },
    {
      "text": "A smart and authentic adaptation that never loses focus of its characters in its depiction of a potent tragic love story."
    },
    {
      "text": "You will laugh. You will cry. You will be surprised that a movie this manipulative is the best teenage love story so far this year."
    },
    {
      "text": "Woodley ... balances grace with gravity, wit with heart."
    },
    {
      "text": "The honest, human performances from stars Ansel Elgort and especially Shailene Woodley keep it grounded, even when things start to wander or threaten to get too precious."
    },
    {
      "text": "\"The Fault in Our Stars\" is dignified and genuinely moving, a winsomely three-dimensional romance set against an unavoidably fatalistic backdrop."
    },
    {
      "text": "Everything that made John Green's book so great is here, so maybe just this once the world really is \"a wish-granting factory.\""
    },
    {
      "text": "This exquisite adaptation is that rare film based on a beloved novel that does full justice to the source material without being static or talky."
    },
    {
      "text": "Wears its cynicism the way many young people do: awkwardly and not very convincingly."
    },
    {
      "text": "It promises something that it doesn't deliver, and insincerity is the last thing you want in a film like this."
    },
    {
      "text": "The movie wants to acknowledge death but only to a certain point."
    },
    {
      "text": "It's a film with some very sad moments and will definitely ellicit more tears than probably any movie this summer, but it's also one of the best this season has to offer."
    },
    {
      "text": "Yes you might cry, but you'll also find a lot to be happy about and thankful for with \"The Fault in Our Stars\"."
    },
    {
      "text": "Director Josh Boone similarly lets the story play itself out before his camera; he shows without being showy."
    },
    {
      "text": "There are some very good moments, especially a powerful eulogy scene. But, fans of the book don't have any surprises that would help spark an emotional connection."
    },
    {
      "text": "What leavens the heaviness of the theme is the heroine's wry wit, which Ms. Woodley deploys just as naturally."
    },
    {
      "text": "Well, of course the book is better."
    },
    {
      "text": "What sustains the film through the rockier times are its challenging themes, offering real issues for the young protagonists to wrestle with, rather than whether anyone will be carded trying to buy beer."
    },
    {
      "text": "If Elgort's Gus is glibly charming and ultimately affecting, \"The Fault in Our Stars\" belongs to Woodley, a performer who always seems to be backing warily into her own movies."
    },
    {
      "text": "The kind of careful, listless adaptation that makes a critic want to rave at length about the wonderful novel on which it's based."
    },
    {
      "text": "In its totality, \"The Fault in Our Stars\" is as noxious as chemotherapy."
    },
    {
      "text": "Calling The Fault in Our Stars a \"teenage cancer romance\" might be understating the film's laudable qualities but it's also a reasonably accurate three-word summary of the plot."
    },
    {
      "text": "Has a melodrama's tendency toward manipulation underneath the gestures toward keeping it real."
    },
    {
      "text": "It's refreshing to see teenage relationships handled with grace and depth...Director Josh Boone stays out of the way stylistically and lets the considerable naturalistic chemistry between Elgort and Woodley be the draw."
    },
    {
      "text": "Shailene Woodley is reason enough to see 'The Fault in Our Stars.'"
    },
    {
      "text": "The film's far from perfect - director Josh Boone favors too many in your face closeups and the character of Augustus Waters is written a little too perfectly to seem like a real person - but on the whole, this teen romance is more thoughtful than most."
    },
    {
      "text": "Hugely warm and winning, thanks in large part to Boone's unfussy, wistful direction"
    },
    {
      "text": "It's a fresh, lively love story, brimming with humor and heartbreak, and lifted to the heights by Shailene Woodley, a sublime actress with a rsum that pretty much proves she's incapable of making a false move on camera."
    },
    {
      "text": "Amid everything that's forced or ersatz about the movie, Woodley and Elgort are the real thing."
    },
    {
      "text": "A poignant and heart-affecting love story about two teenagers squaring off against death."
    },
    {
      "text": "Hazel and Augustus will live in film lore because of the young actors who play them."
    },
    {
      "text": "Woodley is such a fresh, wonderful presence that you want to write sonnets to her talent."
    },
    {
      "text": "The Fault In Our Stars still works wonders, thanks in large part to the film's insistence of dialed-down sentimentality..."
    },
    {
      "text": "\"The Fault in Our Stars\" has to be considered some kind of good movie. And so I've given it some kind of good review. Still, I wonder - why do I feel as I've just been rolled?"
    },
    {
      "text": "The movie is witty and alive and only very occasionally maudlin."
    },
    {
      "text": "In a worst-case scenario, this could have been an after-school special, or egregiously manipulative. But it's not, mostly- It earns the tears."
    },
    {
      "text": "Green's book made a point of underscoring what a privilege it is to love someone -- notably, not to be loved, but to do the loving -- and the film adaptation movingly puts those words to picture."
    },
    {
      "text": "The date movie of the summer. Should do for a generation of kids what GHOST did for their parents."
    },
    {
      "text": "Yes, it's okay to cry. One hell of a love story. Very faithful to John Green's novel."
    },
    {
      "text": "\"The Fault in Our Stars\" achieves that rare feat of eliciting as many cheers as tears."
    },
    {
      "text": "I knew exactly what to expect but I still sobbed for about the last hour of it."
    },
    {
      "text": "About three-quarters of the way through, if not sooner, you'll start hearing sniffles, then sobs, all around you. And it's hard to imagine you too won't succumb, even a little."
    },
    {
      "text": "The Fault in Our Stars' biggest problem lies in its bland execution, but not its stars, who bring moving and often unflinching portrayals to this big-screen adaptation."
    },
    {
      "text": "An effective tearjerker that benefits from its strong script and the presence of Woodley, who really shines in a more dramatic role."
    },
    {
      "text": "Make no mistake: the film is crud, but the higher kind of crud that leaves you feeling OK with yourself in the morning."
    },
    {
      "text": "The film sets out to make you weep - not just sniffle or choke up a little, but sob until your nose runs and your face turns blotchy. It succeeds."
    },
    {
      "text": "Woodley has a face that can look plain in repose and startlingly beautiful in motion, when her delicate pink skin becomes near translucent."
    },
    {
      "text": "\"The Fault in Our Stars\" feels emotionally inert, despite its many moments that are meant to put a lump in our throats."
    },
    {
      "text": "Promises more than a few tear-soaked hankies...earns its tears with strong performances and a restraint that help you invest in characters whose departure you will feel."
    },
    {
      "text": "Unquestionably a sappy, manipulative movie, but on those admittedly low terms it succeeds....for most viewers Green's calculated assault on the tear ducts will work."
    },
    {
      "text": "Stays beautiful in movie form, though the filmmaking often fails to do it justice."
    },
    {
      "text": "\"The Fault in Our Stars\" pushes every button."
    },
    {
      "text": "The Fault In Our Stars is a snappy and resonant teenage weepie, blessed with sparks of wit and buoyed by the talents of a charismatic cast."
    },
    {
      "text": "Those looking for any fault in these stars - or the proud, full-of-life characters they portray - will have to look elsewhere."
    },
    {
      "text": "Fault is, in many ways, a typical romantic melodrama, but it's delivered with some uncommon thoughtfulness and respect."
    },
    {
      "text": "Hearbreaking love story is a must-see for fans of the book."
    },
    {
      "text": "Cynics will be disarmed."
    },
    {
      "text": "If you don't cry or snort or at least tear up a little at some point during Josh Boone's film version of the popular young-adult novel by John Green, you're a pretty cold fish."
    },
    {
      "text": "A fantastic film. Funny yet heartbreaking, and ultimately wondrous."
    },
    {
      "text": "Talking about performances or anything else traditionally associated with film is beside the point here, because the entire story is just a laundry list of scenes meant to make the audience bawl."
    },
    {
      "text": "Needless to say, Boone is softening us up for the final act, designed to tug at our heartstrings extensively, repetitively and without remorse. I felt my own heart hardening by the time of the third tear-jerking setpiece."
    },
    {
      "text": "Wise and sometimes funny, delicately reminding us to live and love honestly and fully, while we all still have that gift."
    },
    {
      "text": "Very much the visual version of the wildly popular YA novel, complete with voiceover for the choice bits of narration that its legions of fans presumably couldn't live without."
    },
    {
      "text": "There's a lot of religious inspiration in the film I could do without, but the characters seem as real as inhaling."
    },
    {
      "text": "[A] funny, sweet, three-hankie tearjerker ..."
    },
    {
      "text": "The movie is well-written, well-acted, acerbic, funny and wisely observed. Fans of the book will be glad to hear it is faithful to Green's tale."
    },
    {
      "text": "Despite some deeply affecting moments, the film is so relentless, leaving nothing to chance by throwing every trick at you, that it ends up being exhausting."
    },
    {
      "text": "In the second half, with the forced jauntiness largely foregone, the movie takes a deep breath and realizes it's nobler to be an effective formula drama than a wan comedy."
    },
    {
      "text": "It takes few chances, frequently using sass as a smokescreen, hiding what's unoriginal and cheaply sentimental about this story behind a veil of witticisms about oblivion and \"cancer perks.\""
    },
    {
      "text": "It's ultimately more afraid of death than it lets on, but it goes farther into the brink than most films like it."
    },
    {
      "text": "Look out for a mighty deluge of teen tears flooding multiplexes this weekend, which will be well-earned by this clever, attractive, sad little movie."
    },
    {
      "text": "One of the most valuable young adult films Hollywood has produced in the last decade."
    },
    {
      "text": "It walks a knife's edge between heart-on-sleeve sensitivity and crass exploitation for its entire running time, and the fact that it largely stays on the right side of that divide has to mark it as a success."
    },
    {
      "text": "Engagingly plotted and anchored by rich characterisations - a swollen tearjerker that confirms the star presence of Shailene Woodley."
    },
    {
      "text": "Turning the screenwriting over to adaptation experts Scott Neustadter and Michael H. Weber has preserved the distinctly literate tone of the book, even if they do occasionally deliver scenes that feel overwrought."
    },
    {
      "text": "Do you have to love John Green's best selling novel to love this movie? Maybe. For the rest of us, the no-fault stars carry us a long way."
    },
    {
      "text": "There needs to be a place for teen melodrama. The Fault in Our Stars at least tries to fill it."
    },
    {
      "text": "It's a story designed to play the heartstrings like a fiddle, extracting sighs and sobs from willing viewers with surgical precision."
    },
    {
      "text": "In the wake of Twilight's conservatism, it is a shame that this fascinating material has been given such a risk-averse treatment."
    },
    {
      "text": "The Fault in Our Stars undeniably sets us up to knock us down... [and] the reaction from the audience was close to primal scream therapy... That should speak significant volumes, just as their collective, seemingly-synchronised sighs did throughout."
    },
    {
      "text": "A myriad of colours and textures are examined through a multi-faceted kaleidoscope in this teenage love story in which truths about bottled up stars, puddles of tears and things that don't happen as they should, play out in a heart-wrenching journey."
    }
  ],
  "release_year": 2014,
  "duration": 126,
  "genres": [
    "Romance",
    "Drama"
  ],
  "synopsis": "Hazel Grace Lancaster (Shailene Woodley), a 16-year-old cancer patient, meets and falls in love with Gus Waters (Ansel Elgort), a similarly afflicted teen from her cancer support group. Hazel feels that Gus really understands her. They both share the same acerbic wit and a love of books, especially Grace's touchstone, \"An Imperial Affliction\" by Peter Van Houten. When Gus scores an invitation to meet the reclusive author, he and Hazel embark on the adventure of their brief lives.",
  "popularity": 8.5,
  "poster_url": "https://image.tmdb.org/t/p/original/ep7dF4QR4Mm39LI958V0XbwE0hK.jpg"
}