{
  "movie_name": "The Wizard of Oz",
  "movie_id": "the_wizard_of_oz_1939",
  "total_reviews": 163,
  "reviews": [
    {
      "text": "There’s a beautiful lack of fuss to the way The Wizard of Oz credibly maintains the possibility that Oz is a generative fabrication of Dorothy’s subconscious without losing any of the yellow brick road’s transportive gleam."
    },
    {
      "text": "Garland manifests this fracture in the way she embodies Dorothy’s innocence, her confusion, and her despair… You fully sense that it springs from deeper wounds."
    },
    {
      "text": "Arguably the greatest family film ever made, this Judy Garland classic is seemingly simple children’s entertainment."
    },
    {
      "text": "It is a film you should see as an example of the extraordinary mechanical possibilities of the motion picture. But the three ill-at-ease musical comedy men... will make you feel that the wrong cast had wandered onto the set."
    },
    {
      "text": "It’s one of the greatest films of all time for a reason, after all."
    },
    {
      "text": "…The Wizard of Oz can mean anything to anyone, and often does; if nothing else, it’s a accessible, malleable text that means just-about something to just-about everyone, so you might as well just kick back and enjoy…"
    },
    {
      "text": "The Wizard of Oz is an exquisite cinematographic symphony of delight and wonder for the spectator.  [Full review in Spanish]"
    },
    {
      "text": "[The Wizard of Oz] has been cleverly and sometimes brilliantly devised and amusingly acted, which is occasionally witty, frequently imaginative, and only for short periods dull."
    },
    {
      "text": "It would appear that the Metro people have managed the extraordinary and made persons very nearly as amusing as Disney drawings. The Wizard of Oz in a word is all it ought to be and sometimes a bit more."
    },
    {
      "text": "We could go on and on for days, and yet, somehow, The Wizard of Oz would make just about any hyperbole seem puny. This, dear reader, is a perfect movie."
    },
    {
      "text": "The Wizard of Oz is a great achievement, viewed either as an American Alice in Wonderland or something strikingly original in musical shows."
    },
    {
      "text": "The film is well worth a visit both for its disclosure of the secret and for its spectacular display."
    },
    {
      "text": "The Wizard of Oz has been filmed with imagination. It has warmth and understanding of child psychology; it has gentle humor and a sturdy philosophical undercurrent. [It is] a rare and distinguished film that should capture the hearts of all ages."
    },
    {
      "text": "All these adventures are interestingly and charmingly depicted and sometimes you wish you were in this dreamland yourself."
    },
    {
      "text": "Breathtakingly lovely sets, lighting, costumes, make-up and musical scores more than fulfill expectations, making the play an even note satisfactory adaptation of the book than was Goodbye Mr. Chips."
    },
    {
      "text": "Caught la the relentless clutch of a Kansas Cyclone, Dorothy's whirlwind excursion into a world peopled by witches, fairies, Winkles, Munchkins and other quaint folk provides swift and exhilarating adventure."
    },
    {
      "text": "If The Wizard of Oz, taken from the American fairy story by Frank Baum, carries to its adult audience the theme of conquest of fear, it could scarcely have been released to the world at a more propitious hour."
    },
    {
      "text": "One cannot say that this is a rival to Disney, but it is as near to fantasy as one can get with human actors... I am under the spell of Oz."
    },
    {
      "text": "Of gossamer weave and rainbow tints is this technicolor excursion into the never-never land that has come to the [screen] -- unreal, scarcely even to be imagined, yet persuading somehow that reality can be left behind without regret."
    },
    {
      "text": "Audiences will fall under the spell of The Wizard of Oz just as does Dorothy, the heroine of this story, when a Kansas tornado blows her into the wonderful land of Oz. Remarkable technical effects and beautiful photography create an air of sheer magic."
    },
    {
      "text": "The world of yesterday's, and perhaps tomorrow's, dreams created decades ago in the imagination of Frank L. Baum comes to the screen as a triumph of the movie camera in the realm of fantasy."
    },
    {
      "text": "Despite its shortcomings, The Wizard of Oz is a spectacle to be seen -- a fantastic romp that will be a treat for the youngsters and a welcome diversion for their oldsters."
    },
    {
      "text": "Judy Garland takes the farm-kid Dorothy as a natural, and adds three hit songs. Bert Lahr's Cowardly Lion has the gusty verve of a Bowery comedian. Dancer Ray Bolster invests the Scarecrow with a lunatic charm."
    },
    {
      "text": "Young 'and old will appreciate The Wizard of Oz. I think, however, they would enjoy it more if the action had been speeded up a trifle. Nevertheless, it will be one of the season's talked about offerings and you should see it."
    },
    {
      "text": "Judy Garland as Dorothy and Frank Morgan as the Wizard are the most favored players and do flawless work, but the delight of many persons will be Bert Lahr as the Cowardly Lion."
    },
    {
      "text": "The Wizard of Oz is an exciting tour de force that keeps the eye and ear constantly occupied, bothers the brain very little. It is hearty and unsubtle, generous and sometimes, in its high riot, intoxicating."
    },
    {
      "text": "The Wizard of Oz will, beyond question, be accorded recognition as a milestone in motion picture history."
    },
    {
      "text": "As a children's movie, this is the definitive classic and does possess a magic all its own."
    },
    {
      "text": "It is, of course, a \"must\" for the juveniles, and they will have a high old time. This is a real fairy tale, brought to the screen with all the trappings, colour, and wondrous charm of the printed word that has kept many a youngster late for dinner."
    },
    {
      "text": "Victor Fleming has made, with living people this time, the most delightful film of its kind since Disney's Snow White."
    },
    {
      "text": "The Wizard of Oz is an all-family picture, with all the charm of Baum's delightful book. But the story has an adult-appeal in plot, with cleverness in lines and situations, and lilting lyrics to delight all from 3 to 103."
    },
    {
      "text": "The greater scope of the screen has allowed vastly more latitude in the presentation than is possible on the stage, and with a cast of popular and capable players The Wizard of Oz is one of the season's finest attractions."
    },
    {
      "text": "The best moments are supplied by the music of Arlen and Harburg, especially Miss Garland's singing of \"Over the Rainbow.\""
    },
    {
      "text": "A colourful mixture of childish fantasy and adult satire and humour of a kind thatnever seems to grow old, The Wizard of Oz, looks like duplicating the success achieved by Walt Disney's Snow White and the Seven Dwarfs."
    },
    {
      "text": "It has a humour of its own, and, like a revue, it parodies everything that comes conveniently to hand. The idea of casting Billie Burke as the good fairy and Bert Lahr as the comic lion was masterly."
    },
    {
      "text": "The Wizard of Oz Is so gay, spectacular, clever, beautiful, and tuneful, that many who see it want to go again. Fairyland Is seen on the screen -- but do not think that fairyland Is Intended only for children. Almost everyone will like the Wizard."
    },
    {
      "text": "By its very theatricality, its dramatic punctuation, its irony (in the manner of Lewis Carroll, but with touches of sophistication) and its elaborate scenic scope, The Wizard of Oz makes amazing pantomime."
    },
    {
      "text": "The film is, no doubt, a triumph of technical dexterity and especially of skill in colour photography, but what is the use of making a hollyhock out of cellophane, painting it an ugly colour, and then photographing it with complete accuracy?"
    },
    {
      "text": "Amid the whimsical humour of the story, however, there is a motive that makes the production more than light entertainment, while the pleasant singing of Judy Garland, who has the main role, gives the film a fine musical background."
    },
    {
      "text": "The Oz picture Is something of an adventure in new forms of expression on the screen, and it is generally very successful."
    },
    {
      "text": "Hollywood could give us no Dorothy more lovely more charming than Judy Garland."
    },
    {
      "text": "Much of the credit for this foray into Wonderland goes to Producer Mervyn Leroy and Director Victor Fleming and their host of unnamed technicians. Thanks to them, The Wizard of Oz joins the small collection of screen classics."
    },
    {
      "text": "The Wizard of Oz is worthy of your best adjectives -- a super-colossal in ever sense of the phrase and one which can not be compared to anything else ever attempted on the screen."
    },
    {
      "text": "Whatever happens, The Wizard of Oz will remain one of the most outstanding photoplays brought to the public during the history of the films."
    },
    {
      "text": "It is gorgeous, fantastic, radiant with technicolor."
    },
    {
      "text": "There is so much to be said in commendation of The Wizard of Oz that your correspondent, who dates back to when the L. Frank Baum story was the eighth wonder of the stage, finds himself a bit bewildered in selecting a spot from which to take off."
    },
    {
      "text": "A \"must\" for both children and adults."
    },
    {
      "text": "The Wizard of Oz is of the essence of screen entertainment that lives for a long time. It probably will prove to be a popular revival at appropriate seasons."
    },
    {
      "text": "From a production standpoint, it is something to marvel at, for the settings are not only exceedingly lavish, but also unusually imaginative; and the technicolor photography adds to their beauty."
    },
    {
      "text": "Seldom if indeed ever has the screen been so successful in its approach to fantasy and extravaganza through the medium of flesh-and-blood."
    },
    {
      "text": "Judy Garland is herself, and her little dog Toto is grand, while Margaret Hamilton gets top witch honors as the bad one. The best musical bit is Over the Rainbow which is something you'll be humming for a long time to come."
    },
    {
      "text": "...an impressively iconic endeavor that does, for the most part, live up to its reputation as a bona fide classic."
    },
    {
      "text": "The perfect blend of magic, monsters, music, and technical marvel."
    },
    {
      "text": "Without a doubt, one of the most fun, magical and influential films of all time. [Full review in Spanish]"
    },
    {
      "text": "Entertaining, adventurous, unbelievably iconic, unexplainably influential, and perfect to sing along to."
    },
    {
      "text": "This benchmark of fantasy and adventure has reached a plateau very few films have - it has engrained itself in popular culture to the point of legend."
    },
    {
      "text": "The Wizard of Oz first enchanted audiences with its escapist fantasy, \"there's no place like home\" has become a multilayered statement for our current times."
    },
    {
      "text": "The words in both its melodies and dialogues have become a part of the vernacular, and their simply-put lessons (\"there's no place like home\") still ring true. [February 4, 2019]"
    },
    {
      "text": "The Wizard of Oz will have people enchanted with its spell for a very long time. [Full Review in Spanish]"
    },
    {
      "text": "The world's favorite movie. Exciting, touching and big-hearted,The Wizard of Ozis the movie we most look forward to sharing with future generations."
    },
    {
      "text": "The perennial enthusiasm of the public for one of the more creative musicals make it into a classic film, but it hasn't lost its primitive charm. [Full Review in Spanish]"
    },
    {
      "text": "Perhaps the most perfect piece of pure entertainment ever produced, with countless classic moments that have led to its cinematic immortality."
    },
    {
      "text": "I sat cringing before M-G-M's Technicolor production of The Wizard of Oz, which displays no trace of imagination, good taste, or ingenuity."
    },
    {
      "text": "More than a movie classic, it's an essential part of the popular culture, thanks to film revivals and the annual TV ritual that, sooner or later, captured every kid growing up in the sixties and seventies."
    },
    {
      "text": "[VIDEO ESSAY] As thick with allegory as any Shakespeare play, \"The Wizard of Oz\" is the greatest children's movie ever made, and that probably ever will be made."
    },
    {
      "text": "Judy Garland is perfectly cast as Dorothy. She is as clever a little actress as she is a singer and her special style of vocalizing is ideally adapted to the music of the picture."
    },
    {
      "text": "The music is good, and the public has not been given such a smooth running, well oiled, expert spectacle since the great days of the silent movies when Doug Fairbanks Sr. made the first Robin Hood and The Thief of Bagdad."
    },
    {
      "text": "Anyone who can refrain from weeping as Dorothy cries \"Aunty Em, I'm frightened!\" deserves to be locked in a tower for all eternity."
    },
    {
      "text": "Seventy-five years on, it hasn't dated in the slightest."
    },
    {
      "text": "The central themes of illusions, dreams and going on an extraordinary adventure all the better to come home and appreciate what you have there are enduring."
    },
    {
      "text": "One of Hollywood's quintessential productions, this musical adaptation of L Frank Baum's classic fable is probably the most beloved fantasy film of all time and the ultimate family picture."
    },
    {
      "text": "This family classic long ago left the realm of being mere entertainment to emerge as a cultural touchstone for generations of Americans."
    },
    {
      "text": "The classic MGM musical from 1939 has been lovingly restored and up-converted to 3D."
    },
    {
      "text": "The Wizard of Oz is the cinematic equivalent of high-end wine, in that it gets better with age. The difference is that while wine must remain unopened to increase in value, the film positively thrives on it being tasted and shared over and over and over."
    },
    {
      "text": "The old-fashioned, old-school wizardry of MGM still looks impressive to me today..."
    },
    {
      "text": "Seven decades on, it's still wholly transporting, even without the benefit of the bells and whistles that are part of the CGI age."
    },
    {
      "text": "In truth, any opportunity to see the film on the big screen is welcome."
    },
    {
      "text": "MGM's fantastic IMAX 3D conversion for the The Wizard of Oz's 75th anniversary underlines rather than obscures most of the film's visual pleasures, reminding us (if we'd managed to forget) just how glorious L. Frank Baum's strange world is."
    },
    {
      "text": "The greatest American movie fantasy."
    },
    {
      "text": "The blend of old-fashioned, classic storytelling with cutting-edge technology is undeniably enthralling."
    },
    {
      "text": "Hey, Dorothy actually has freckles in IMAX. Glinda's floating sphere is mesmerizing. The flying monkeys are creepier than ever. The Lollipop Guild even more disturbing - are these guys having a seizure?"
    },
    {
      "text": "The result is quite stunning and a lot less gimmicky than it could have been."
    },
    {
      "text": "A timeless family classic finds potent new life in IMAX 3D."
    },
    {
      "text": "The most magical movie ever is still magic in 3D IMAX."
    },
    {
      "text": "Knowing that it was made without a single computer, and entirely by human ingenuity, makes it all the more worthy of marveling at, 75 years and an added dimension later."
    },
    {
      "text": "It's a feature built for bigness, with its immersive qualities still potent after all these years. The IMAX 3D treatment is merely a fun exhibition detour."
    },
    {
      "text": "Any reason to show your children \"The Wizard of Oz\" on a big screen seems like a good one."
    },
    {
      "text": "Even swollen to IMAX size, the movie is sharper than you've ever seen it, and the vaudevillian brilliance of the choreography (and Ray Bolger's straw-boned tumbling) is entirely undiminished."
    },
    {
      "text": "\"The Wizard of Oz\" celebrates its 75th anniversary looking younger and more vital than ever, simultaneously advertising good old-fashioned storytelling and the most advanced technology available."
    },
    {
      "text": "It looks fantastic, sounds great, and the 3-D effects (reportedly labored over for 16 months by a thousand technicians) are both subtle and respectfully applied."
    },
    {
      "text": "Decades later and it's all still such a fresh and vibrant experience..."
    },
    {
      "text": "When he is exposed by the indefatigable Toto, the Wizard reveals that ultimate Hollywood secret, that the reality doesn't matter as much as the image, that illusion is as effective as truth if believed in, if only for 90 minutes of screen time."
    },
    {
      "text": "Somehow, for all the dollar-book Freud brought to bear on it, the picture comes up fresh, innocent and enchanting whenever you see it."
    },
    {
      "text": "This phantasmagorical fantasy really does represent old-school MGM filmmaking at its best."
    },
    {
      "text": "A work of almost staggering iconographic, mythological, creative and simple emotional meaning, at least for American audiences, this is one vintage film that fully lives up to its classic status."
    },
    {
      "text": "The story of course has some lovely and wild ideas, but the picture doesn't know what to do with them, except to be painfully literal and elaborate about everything."
    },
    {
      "text": "Here once again are glad tidings to be broadcast to filmgoers. There is something new in the land of cinema at long last which may well take them into a charmed domain of imagination."
    },
    {
      "text": "It is one of the greatest movies ever made, and even today it stands the test of time as a quality family flick."
    },
    {
      "text": "Nothing less than an life-affirming echo from the hall of mankind's eternal soul."
    },
    {
      "text": "Decades after it was made, this fable retains its emotional power and visual enchantment, an amazing achievement considering different directors worked on it."
    },
    {
      "text": "Even decades later, one of the best family films ever made."
    },
    {
      "text": "A head trip of a family film."
    },
    {
      "text": "The moment Judy Garland starts singing in that barnyard, we're all six years old again, with nothing left to do but join her."
    },
    {
      "text": "It's more than a movie; it's an American rite of passage. [Blu-ray]"
    },
    {
      "text": "The movie--well, you know the movie. You know how great Judy Garland is as Dorothy, how memorable the rest of the cast is, how terrific Victor Fleming's direction is, and that the film's themes of the importance of home have helped it to resonate througho"
    },
    {
      "text": "If through some incredible chance you haven't [seen it], all I can say is: do so immediately. Make this the very next movie you watch. Literally."
    },
    {
      "text": "One of only a handful of films that nearly everyone is familiar with."
    },
    {
      "text": "There's an audience for Oz wherever there's a projection machine and a screen."
    },
    {
      "text": "Lavish in sets, adult in humor, it is a Broadway spectacle translated into make-believe."
    },
    {
      "text": "The songs and magic are still fresh, even if it isn't quite knowing enough, perhaps, for today's young audiences."
    },
    {
      "text": "The greatest children's movie of all time. Probably."
    },
    {
      "text": "I don't find the film light or joyful in the least -- an air of primal menace hangs about it, which may be why I love it."
    },
    {
      "text": "This 3D remastering of the original, on a giant Imax screen to boot, brings a whole new sense of wonder to Dorothy's yellow-brick road movie."
    },
    {
      "text": "I'll see you on the dark side of the moon...and your little dog, too!"
    },
    {
      "text": "It's a movie that speaks of Hollywood's unacknowledged fascination with the exotic, the mad, the unreal."
    },
    {
      "text": "...a thoroughly American fairy tale that wholly endorses the ethic of consumerism."
    },
    {
      "text": "Oz simply lays bare primal emotions, exposes our childhood anxieties about abandonment and powerlessness and brings to light the tension between the repressive comforts of home and the liberating terrors of the unknown marking all our adult lives."
    },
    {
      "text": "One of the greatest films made ... in any genre."
    },
    {
      "text": "The key to The Wizard of Oz is its pure, simple theme: Dorothy's desire to get back home, to safety, to comfort, to family and to love."
    },
    {
      "text": "It's a movie almost everyone has seen multiple times, and every viewing is a visit home as well as a wild adventure toward territories unknown."
    },
    {
      "text": "...one of the most enduring musical fantasies of all time."
    },
    {
      "text": "A true amalgam of creative forces individually pooling their studio-contract talents like a hive of bees (in tribute to a trio of queens...a quartet if you count George Cukor)."
    },
    {
      "text": "Well named \"the wonderful Wizard of Oz\"!"
    },
    {
      "text": "The whole picture is incredibly lavish, and there's a lot of pleasure to be got these days from watching money spent on other things than war."
    },
    {
      "text": "The film is probably as entertaining now as it was in 1939."
    },
    {
      "text": "Deserves its gained reputation as an arty classic with a universal appeal."
    },
    {
      "text": "Still a treat for you -- and your little dog too..."
    },
    {
      "text": "A delightful fantasy for children and adults alike, one that cherishes childhood and its dreams."
    },
    {
      "text": "The greatest movie ever? It certainly comes close to claiming that title"
    },
    {
      "text": "Whether you see it as a timeless ode to the power of friendship and imagination or as a feature-length fever trip about a girl with a subconscious bloodlust for revenge, Victor Fleming's 1939 fantasy tale is nevertheless a certified classic."
    },
    {
      "text": "No need to say that this film is a classic."
    },
    {
      "text": "It never was a great film, but it's now a part of our culture."
    },
    {
      "text": "A delightful piece of wonder-working which had the youngsters' eyes shining and brought a quietly amused gleam to the wiser ones of the oldsters."
    },
    {
      "text": "Pink Floyd anyone?"
    },
    {
      "text": "I think everyone agrees it is a legendary film and everyone who hasn't seen it, should."
    },
    {
      "text": "An enduring masterpiece -- one of the best films ever made."
    },
    {
      "text": "This movie is an ideal family film, superb in every aspect, with outstanding art direction, music, and performances."
    },
    {
      "text": "Ranks among our earliest and most defining experiences of wonder and of fear, of fairy-tale joys and terrors, of the lure of the exotic and the comfort of home."
    },
    {
      "text": "Each time it is shown, this extraordinary film ... embraces a new generation of children who succumb to its magic."
    },
    {
      "text": "I wish they would start making musicals again. I'd love to see scenes like that on the big screen once more."
    },
    {
      "text": "Every bit THE classic."
    },
    {
      "text": "The Wizard of Oz has become a foundational part of young psyches over the generations since its 1939 release, but it is so much more than just a movie for kids."
    },
    {
      "text": "I can't imagine my childhood without this movie."
    },
    {
      "text": "the message comes across loud and clear that you don't have to have a boat, a car or a plane to make a journey of self-discovery and that courage, intelligence and compassion come from within, not through medals, diplomas or testimonials."
    },
    {
      "text": "Remarkable, colorful, heartwarming."
    },
    {
      "text": "The music is so infectiously happy that it is basically impossible to keep your toes from tapping, your head from bobbing, and an ear-to-ear grin from appearing on your face."
    },
    {
      "text": "Seeing The Wizard of Oz in a movie theater, the way God and Louis B. Mayer intended you to see it, is like being at Cape Canaveral for a space shuttle launch instead of watching it on television."
    },
    {
      "text": "It's not simply a magical, whirling experience, but a ground breaker for visual and technological creativity, combining Hollywood forces with Hollywood genius to spawn strands of unique and original elements never before attempted at the movies."
    },
    {
      "text": "The Wizard of Oz (1939) is everybody's cherished favorite, perennial fantasy film musical from MGM during its golden years. For many seasons, it was featured"
    },
    {
      "text": "I am 8 years old and I think I've seen The Wizard of Oz about 50 times."
    },
    {
      "text": "This wonderful romp of a movie looks magical on the big screen: colors are a picnic for the eyes, details loom so clearly you can practically touch them and there's a sense of the larger-than-life with a film that's already larger than life."
    },
    {
      "text": "It's been 25 years since the movie's last theatrical run, which means that just about eveyone is overdue for seeing this marvelous spectacle the way it was meant to be seen."
    },
    {
      "text": "The greatest flight of fancy ever filmed."
    },
    {
      "text": "A dazzling fantasy musical so beautifully directed and acted that it deserves its classic status."
    },
    {
      "text": "This is a completely charming and wholly delightful film in a direction rarely attempted by Hollywood."
    },
    {
      "text": "The Wizard of Oz remains the weirdest, scariest, kookiest, most haunting and indelible kid-flick-that's-really-for-adults ever made in Hollywood."
    },
    {
      "text": "an insightful philosophical commentary on the fears, questions, and desires with which all children grapple"
    },
    {
      "text": "It scared the hell out of me when I used to watch it between my fingers when I was a kid, and (though it might say too much about my own emotional development) I still get the heebie-jeebies from a lot of it."
    },
    {
      "text": "Victor Fleming's movie has never needed super-technique to be enchanting."
    },
    {
      "text": "Magnificent sets and costumes, vivid Technicolor, and every resource of trick photography -- including a realistically contrived cyclone -- bolster the competent cast that strikes a happy medium between humor and make-believe."
    },
    {
      "text": "Its underlying story penetrates straight to the deepest insecurities of childhood, stirs them and then reassures them."
    },
    {
      "text": "A movie like this is so exhilarating, because, if you look deeper into it and go beyond its status, you find that it's more than just a musical lark."
    },
    {
      "text": "Each scene in The Wizard of Oz is spectacular in its visual creativity. Each song is inspired."
    }
  ],
  "release_year": 1939,
  "duration": 101,
  "genres": [
    "Kids & Family",
    "Fantasy",
    "Musical"
  ],
  "synopsis": "When a tornado rips through Kansas, Dorothy (Judy Garland) and her dog, Toto, are whisked away in their house to the magical land of Oz. They follow the Yellow Brick Road toward the Emerald City to meet the Wizard, and en route they meet a Scarecrow (Ray Bolger) that needs a brain, a Tin Man (Jack Haley) missing a heart, and a Cowardly Lion (Bert Lahr) who wants courage. The wizard asks the group to bring him the broom of the Wicked Witch of the West (Margaret Hamilton) to earn his help.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/pfAZFD7I2hxW9HCChTuAzsdE6UX.jpg"
}