{
  "movie_name": "The Green Mile",
  "movie_id": "green_mile",
  "total_reviews": 128,
  "reviews": [
    {
      "text": "There are several scenes of tremendous power. But the same problems that plagued The Shawshank Redemption are in full force here."
    },
    {
      "text": "Now, for the first time, Darabonts The Green Mile is available on 4K UHD with high-dynamic range, rejuvenating the drama, imbuing it with the visual energy to accompany its bittersweet narrative."
    },
    {
      "text": "At times, you notice The Green Mile tugging your heartstrings. But aside from a moment or two over the course of three hours, the viewer gives in, entrenched in the proceedings and deeply affected by the spell of these characters."
    },
    {
      "text": "Make no mistake that The Green Mile is powerful and draws on our emotions but the film is also too long."
    },
    {
      "text": "The simple fable can't stand such scrutiny. More pivotally, the weight given to each moment lends The Green Mile a ponderousness that works against the emotions the story seems to want to plug into."
    },
    {
      "text": "Unfortunately the movie can never shake the uncomfortable and trope-filled premise."
    },
    {
      "text": "Much of the three-hour movie takes place in the prison, but the resonant characterization, expansive plotting, and judicious use of exterior locations and flashbacks turn the walls into windows."
    },
    {
      "text": "Thoughtful, intelligent movie for older teens."
    },
    {
      "text": "...despite the clichs and stereotypes, the film's cast manages to lift it from the depths of the commonplace and make watching it enjoyable."
    },
    {
      "text": "How many blockbusters deal with that kind of grief?"
    },
    {
      "text": "To more than a few viewers, this one will feel like a life sentence."
    },
    {
      "text": "Though the film drifts off down some long blind alleys, when Darabont exercises discipline the result is highly effective."
    },
    {
      "text": "Dotted with many fine moments, clotted with a few flabby ones."
    },
    {
      "text": "Overextending its welcome, Frank Darabont's film is the most commercially popular adaptation of a Stephen King novella, but it's also a slow, often dull prison drama."
    },
    {
      "text": "The supernatural elements carry an undeniable emotional charge, but the solution to the underlying murder mystery is disappointingly tidy and trite."
    },
    {
      "text": "Although The Green Mile is a satisfying and affecting movie, it's not The Shawshank Redemption -- not by a long shot."
    },
    {
      "text": "One of the best prison films ever made."
    },
    {
      "text": "This movie is being described as inspiring? To me it just seems morbid, melancholy, sad, and far too long."
    },
    {
      "text": "Of all the movies based on King novels, The Green Mile ranks near the top -- but below Darabont's first, The Shawshank Redemption."
    },
    {
      "text": "Three long hours of wind, an exercise in titanic self-importance intent on passing off klunky rhetoric as poignant drama."
    },
    {
      "text": "Hanks and the other guards' acting is impeccable as would be expected, but Duncan and his fellow prisoners are also disturbingly real."
    },
    {
      "text": "A deeply racist movie, though clearly none of the filmmakers thinks so... By the picture's end, we are asked to grasp electrocution as in some way an act of benevolence."
    },
    {
      "text": "Suffice it to say you must be willing to buy some pretty incredible stuff if you want to enjoy this experience."
    },
    {
      "text": "Its emotional rewards outshine its faults."
    },
    {
      "text": "Quando a histria chega ao fim e as luzes se acendem, voc sente que, de certa forma, o filme permanecer com voc por muito tempo."
    },
    {
      "text": "Those whose lives Coffey touches may find relief from physical ailments, but they seem no freer, more hopeful, or nobler for the experience."
    },
    {
      "text": "Overlong and potholed, The Green Mile is still worth the journey."
    },
    {
      "text": "Duncan's beautiful performance is worth at least three hours of anyone's life."
    },
    {
      "text": "What better place to witness healing than in a death-chamber where the malevolent an eye-for-an eye philosophy of justice reigns."
    },
    {
      "text": "For all its attention to John's victimization -- and exacting an emotional response from its audience -- the film takes a surprisingly schizophrenic view of capital punishment."
    },
    {
      "text": "There is no doubt that the director has mistaken size for quality with bum-numbing consequences."
    },
    {
      "text": "A near-masterpiece."
    },
    {
      "text": "Hanks is in fine form, as is Sam Rockwell, as 'Wild Bill' Wharton, a new inmate so repulsively evil he's almost a cartoon (not quite, though)."
    },
    {
      "text": "I'd be critical of the fact that Frank Darabont's entire directorial career has revolved around sweepingly sentimental movies based on Stephen King prison dramas -- if only he didn't do them so well."
    },
    {
      "text": "They don't get much better than this."
    },
    {
      "text": "A moving story, helped by some great performances, primarily by Michael Clarke Duncan as Coffey, Hanks, Hutchison as the guards, and Jeter and Rockwell as prisoners."
    },
    {
      "text": "The quickest 180 minutes you will ever spend in a movie theater."
    },
    {
      "text": "Unfolds slowly, but Darabont shows a deft sense of pacing."
    },
    {
      "text": "Giving much life to these fairly undimensional characters is a strong cast, with Hanks turning in another empathetic lead performance."
    },
    {
      "text": "A terrific, powerful movie!"
    },
    {
      "text": "The worst I can say about this thoroughly decent movie is that it botches some of the most important scenes."
    },
    {
      "text": "The three-hour-plus film permits the kind of detailing that not only brings the storytelling to life, but sometimes persuades us we're breathing to its rhythms."
    },
    {
      "text": "Certainly not a perfect film, and probably not the major Oscar contender the filmmakers intended it to be, but it is a well-acted, tautly-directed film with emotional weight."
    },
    {
      "text": "There's plenty here to make you laugh and cry."
    },
    {
      "text": "The Green Mile often grabs, and generally holds, one's attention through the long journey."
    },
    {
      "text": "If all this heartstring-tugging reeks of cheese, that's because it is - the finest gourmet cheese Hollywood's made in a long, long time."
    },
    {
      "text": "At the very least, The Green Mile is engaging and even moving."
    },
    {
      "text": "The Green Mile, while it does have a few noticeable faults, is ultimately an effective and extremely entertaining motion picture."
    },
    {
      "text": "An engrossing picture."
    },
    {
      "text": "Unassumingly strong, moving performances and Darabont's durable storytelling make it a trip worth taking."
    },
    {
      "text": "Beautifully crafted and emotionally satisfying."
    },
    {
      "text": "A thrilling voyage."
    },
    {
      "text": "One terrific flick!"
    },
    {
      "text": "Brilliant storytelling!"
    },
    {
      "text": "Hanks is a genuine pleasure to watch."
    },
    {
      "text": "Stephen King's serial novel has been superbly adapted."
    },
    {
      "text": "After reading a King novel, a reader might tend to want to take a shower; after seeing Darabont's The Green Mile, a moviegoer might want instead to go to church -- but only after taking a shower."
    },
    {
      "text": "Over the epic running time the film inches its way through a complex soap opera of events on the Row, punctuated by three pivotal and grisly executions via 'Old Sparky,' the electric chair."
    },
    {
      "text": "As a film, The Green Mile's simplicity is both its charm and its deception."
    },
    {
      "text": "The Green Mile is a well-crafted film."
    },
    {
      "text": "The Green Mile is just about one of the finest films I have seen since Life is Beautiful."
    },
    {
      "text": "Though watchable and occasionally moving... it strains credibility and patience"
    },
    {
      "text": "A textured, character-driven story."
    },
    {
      "text": "A wonderful, inspiring, touching, and often funny movie."
    },
    {
      "text": "The Green Mile resonates."
    },
    {
      "text": "The Green Mile is irritatingly repetitious."
    },
    {
      "text": "The Green Mile is simply a case of severe overreaching and the illusion that an overstuffed movie is an epic movie."
    },
    {
      "text": "Darabont has an artful ability to use production values to make a film appear as though it were actually transporting you somewhere. But when the credits roll, you realize you never left Kansas."
    },
    {
      "text": "Moves with the suffocating deliberateness of a river of molasses."
    },
    {
      "text": "E.T. on Death Row."
    },
    {
      "text": "Hanks adds another small masterpiece to his growing body of American portraits."
    },
    {
      "text": "Frank Darabont is such a committed filmmaker, and believes so earnestly and intensely in the stories he puts onscreen, that it seems unsporting to point out that hokum is his middle name."
    },
    {
      "text": "Duncan gives the novel's towering symbol of innocence a degree of dignity and humanity that sells the whole unlikely fable."
    },
    {
      "text": "An affecting motion picture."
    },
    {
      "text": "In its own old-fashioned way, Frank Darabont's style of picture making is well matched to King-size yarn spinning."
    },
    {
      "text": "Enthralling and literally miraculous, The Green Mile has become an instant favorite of mine, just as its source material did."
    },
    {
      "text": "Easily one of the better films -- if not the best -- of the year."
    },
    {
      "text": "The Green Mile is another of King's non-horror stories to be adapted to film, and it's good one."
    },
    {
      "text": "The Green Mile is more than an hour old before anything like a plot develops, and then it turns out to be such a sentimental-supernatural whopper that even Tom Hanks, usually the most casually credible of actors, is severely tested."
    },
    {
      "text": "The movie uses the emotional sentiments that death presents as a crutch of support for an otherwise weak and underdeveloped production."
    },
    {
      "text": "Its 188 minutes of viewing time seemed like a life sentence."
    },
    {
      "text": "A cracking good yarn that earns its laughter, its wonder and its tears."
    },
    {
      "text": "Stephen King may be a cheeseball, but he spins one hell of a yarn."
    },
    {
      "text": "Inspired filmmaking!"
    },
    {
      "text": "The cinematic equivalent of a good cop/bad cop work-over."
    },
    {
      "text": "The Green Mile is a solidly crafted film telling a complexly layered story that features a beautifully satisfying, if bittersweet, finale."
    },
    {
      "text": "Frank Darabont is the world's greatest director of movies taken from Stephen King prison books."
    },
    {
      "text": "The movie is worth walking, if not a mile, at least a couple of blocks to see."
    },
    {
      "text": "Clocking in at over three hours of length, The Green Mile certainly feels long. While the film captures an overwhelming majority of the plot details of the novel, a few should have been trimmed."
    },
    {
      "text": "The production design -- with much Southern period detail and '30s music -- helps brings The Green Mile to life."
    },
    {
      "text": "Although the current production runs three hours, I wasn't really bored at any point."
    },
    {
      "text": "Often funny."
    },
    {
      "text": "If only there was a death row for movies..."
    },
    {
      "text": "This film is slow, drawn-out, boring, uninteresting, unexciting, predictable and topped with a couple of one-dimensional 'evil' characters."
    },
    {
      "text": "Hanks is, again, the best of men in difficult circumstances."
    },
    {
      "text": "Superior craft is something we've come to expect from modern movies, but not soul. It's the soul of this movie that's so heartening."
    },
    {
      "text": "Moves pretty well and doesn't really drag, though superb performances from the leads help to keep it compelling."
    },
    {
      "text": "A manipulative but absorbing and deeply satisfying adaptation of Stephen King's prison novel."
    },
    {
      "text": "Tom Hanks is our movie Everyman, and his Paul is able to win our sympathy with his level eyes and calm, decent voice. We get a real sense of... the goodness of Coffey -- who is embodied by Duncan in a performance that is both acting and being."
    },
    {
      "text": "The cast's endearing success makes The Green Mile likable, lighthearted fare when it shouldn't be."
    },
    {
      "text": "an entertaining, extremely well-produced drama. It's also a film that's likely to be enormously overrated by the millions of members of the Cult of Tom..."
    },
    {
      "text": "A heartfelt fable that pushes all the right emotional buttons."
    },
    {
      "text": "One thing confirmed by The Green Mile is that if Tom Hanks' head gets any bigger, the rest of his movies are going to have to be filmed in IMAX."
    },
    {
      "text": "It's hard to be affected by The Green Mile, for it rarely offers much background on any of its characters beyond their Central Casting pigeonholes."
    },
    {
      "text": "A groaning ordeal."
    },
    {
      "text": "Falls under the weight of the more solid portrayals of evil, misfortune and injustice."
    },
    {
      "text": "Sure, there are plenty of good moments here to elicit active enjoyment."
    },
    {
      "text": "Darabont and King go to prison. Heck, it worked the first time!"
    },
    {
      "text": "A thoroughly absorbing supernatural fairytale about good and evil living under the same roof."
    },
    {
      "text": "Surpasses mere adequacy in so many ways just within the first hour that it will undoubtably be praised to the highest extent."
    },
    {
      "text": "A vivid, emotional story."
    },
    {
      "text": "Consistently captivating."
    },
    {
      "text": "A lumbering, self-important three-hour melodrama that defies credibility at every turn."
    },
    {
      "text": "This picture is, like the cigarette of the old-time commercials, worth walking a mile for."
    },
    {
      "text": "It's just too bad, then, that the finale could not have been stronger. It downgrades a potentially great film to being, at most, a very good one."
    },
    {
      "text": "Maravillosa historia acerca de los hombres y sus relaciones, sus miedos y sus sueos"
    },
    {
      "text": "But even when it falls back on the contrived, The Green Mile still holds on to the audience on a emotional level that continues to resonate long after the credits roll, which by itself is reason enough to recommend the movie."
    },
    {
      "text": "Darabont works big but thinks small, or at least without great complexity."
    },
    {
      "text": "The Green Mile effectively sideswipes the enduring hot political issues it raises to force viewers to a pro-Hanks position."
    },
    {
      "text": "There is a beautiful story here, but I just wish we didn't have to sit through the whole thing to see it."
    },
    {
      "text": "Add another title to the list of good King cinematic adaptations."
    },
    {
      "text": "The movie taps into a vein of Dickensian sentiment, nightmare and idealism, ribaldry and tragedy that give it that part-dark, part-shining fairytale quality that imbues most King tales and all three of Darabont's features."
    },
    {
      "text": "Laughter and tears are both subtly drawn out and jack-hammered home."
    },
    {
      "text": "Provides all the sturdy entertainment of any well-calculated crime drama."
    },
    {
      "text": "The acting is sturdy if infrequently exceptional."
    },
    {
      "text": "So well-crafted that it seems like a feast, even when your brain is telling you that this story could not possibly be stretched any thinner."
    },
    {
      "text": "The film is even more textured and less gratuitous than The Shawshank Redemption."
    },
    {
      "text": "A powerful Stephen King story, but one which is not compelling enough to justify the film's three-hour length."
    }
  ],
  "release_year": 1999,
  "duration": 189,
  "genres": [
    "Drama",
    "Fantasy"
  ],
  "age_rating": "R",
  "synopsis": "Paul Edgecomb (Tom Hanks) walked the mile with a variety of cons. He had never encountered someone like John Coffey (Michael Clarke Duncan), a massive black man convicted of brutally killing a pair of young sisters. Coffey had the size and strength to kill anyone, but not the demeanor. Beyond his simple, naive nature and a deathly fear of the dark, Coffey seemed to possess a prodigious, supernatural gift. Paul began to question whether Coffey was truly guilty of murdering the two girls.",
  "popularity": 9.4,
  "poster_url": "https://image.tmdb.org/t/p/original/8VG8fDNiy50H4FedGwdSVUPoaJe.jpg"
}