{
  "movie_name": "The Lego Movie",
  "movie_id": "the_lego_movie",
  "total_reviews": 258,
  "reviews": [
    {
      "text": "What really sells it is the film's surprising final act, one that pulls the rug from under our feets and becomes a beautiful tale of inspiration and creativity through the minds of innocence..."
    },
    {
      "text": "It’s to Lord and Miller’s credit that The Lego Movie rarely feels hemmed in by the limitations of its premise."
    },
    {
      "text": "The colorful adventure (and it is colorful, in all the bright, primary hues of the toy bricks) is a collision of order and anarchy as a superhero fable that spills over in to the real world in a marvelously clever and resonant turn."
    },
    {
      "text": "Phil Lord and Chris Miller’s masterwork features enough creativity to cover a year’s worth of movies and brings the Lego world to life in a way that makes a stunning jump from product placement to hard-won ingenuity."
    },
    {
      "text": "Great voice acting, sharp writing, and a wonderful story all the way down to its core."
    },
    {
      "text": "In the end, the costs (both monetary and social) of The LEGO Movie are less than desirable, but it works on multiple levels as the best animated films often do, and provides a number of distinctive visual touches to keep the viewer involved and laughing."
    },
    {
      "text": "It’s the best possible ad for Legos that the company could have ever hoped for, and it achieves that by embedding in its very concept the kind of play that has kept both kids and adults playing with Legos for years."
    },
    {
      "text": "The LEGO Movie is a beautifully animated film that remains one of the best films of 2014."
    },
    {
      "text": "A poignant children's film, which injected American animation with a surge of energy, style, and confidence, The LEGO Movie took the most surprising stances..."
    },
    {
      "text": "The weirdest, most psychedelic kid's entertainment since H.R. Pufnstuf."
    },
    {
      "text": "Surprisingly action-packed and high-octane."
    },
    {
      "text": "It is a film best experienced and best experienced as a beloved experience between adults and the children they love."
    },
    {
      "text": "As we dig deeper, we come to understand why all of this exists, and why there is such a battle between following the rules and using your own imagination."
    },
    {
      "text": "Five hours later and still singing EVERYTHING IS AWESOME!"
    },
    {
      "text": "The LEGO Movie is the first great comedy, the first great action film and the first great family film of the year."
    },
    {
      "text": "The Lego Movie is stupid fun to watch, hilarious in all the right ways and one of the most original animated blockbusters anyone has constructed in quite some time."
    },
    {
      "text": "This film is frequently hilarious, deeply subversive and multilayered, and it's an absolute delight from start to finish."
    },
    {
      "text": "Ticklish, touching and mostly terrific, The LEGO Movie is great fun for everyone."
    },
    {
      "text": "I was completely surprised by this movie."
    },
    {
      "text": "It's an animated treat that will please all... A movie that expands on the world of the popular toy, creating a universe full of imagination and surprise."
    },
    {
      "text": "By the end, directors/writers Phil Lord & Christopher Miller...have tried to have things so many different ways that The LEGO Movie philosophically breaks apart due to unbalanced construction."
    },
    {
      "text": "Basically, they got you to pay money to watch a one hundred minute commercial. They got you to do it, and like it."
    },
    {
      "text": "It is an instant animated classic, and in the years to come I'm sure it will be looked back on with fond memories and inspire others to follow in its path."
    },
    {
      "text": "Clearly having fun with the low expectations garnered by the idea of a full-length film devoted to schilling for a toy, the film's directors have nonetheless created a solidly enjoyable and often hilarious 100 minutes of entertainment."
    },
    {
      "text": "The Lego Movie is both a perfect satire of noisy toy-driven summer action movies, and also an absolutely perfect summer movie in its own right."
    },
    {
      "text": "They took a concept that I never thought would work on the big screen and it works so well."
    },
    {
      "text": "Is there a word beyond hysterical? This isn't just hysterical, it's life-shortening."
    },
    {
      "text": "The ultimate result may be kind of predictable, but it's still fun."
    },
    {
      "text": "There's much to enjoy in this film for all age groups - everything from the pop culture references, the multitudes of characters, light-hearted sarcasm and above all, the fantastic script."
    },
    {
      "text": "Colourful, inventive and action-packed."
    },
    {
      "text": "The LEGO Movie is, in fact, a highly entertaining, very fun and unexpectedly touching movie that kids and adults can enjoy equally."
    },
    {
      "text": "[The Lego Movie] embraces what parents and kids really love about Lego; creativity, imagination and individuality. Or, as my seven year-old simply said, \"awesomeness\"."
    },
    {
      "text": "It's equal parts clever, hilarious and full of heart."
    },
    {
      "text": "The LEGO Movie teaches our kids what it means to be unique, imaginative, and heroically important by paving their own paths."
    },
    {
      "text": "An especially clever ontological construct is having all the various LEGO game-sets represent various dimensions of the LEGO cosmos, sort of like unitary paradises."
    },
    {
      "text": "The idea that the deadliest weapon in this Lego galaxy is glue, which will make everything permanent and unmovable, shows that childish wit is probably the purest wit of all."
    },
    {
      "text": "It's hard to imagine a more inspired Lego film, or one less concerned with selling toys."
    },
    {
      "text": "At least, lighthearted silliness serves as a palliative for the reflexive cynicism that emerges in viewers confronted with such a blatant corporate agenda. But the filmmakers do not have the good sense to stop there."
    },
    {
      "text": "Hilarious and heartfelt in the right ways, The Lego Movie also successfully pokes fun at the genre cliches we're all so used to."
    },
    {
      "text": "It's one of the few movies based on a toy with no explicit story behind it. And it is, so far, the only one that's really good."
    },
    {
      "text": "The movie is a wonderful surprise, cleverly written and executed brick by brick with a visual panache."
    },
    {
      "text": "Gloriously wise, beautifully crafted, and unabashedly fun."
    },
    {
      "text": "Lord and Miller's sensibilities are continually clever, and The Lego Movie works hard to gradually deliver surprising payoffs to what seem to be throwaway bits."
    },
    {
      "text": "It's not that audiences (at least the older ones) don't realise they're watching a big and glossy advertisement. Because it's bright, fun and smart, they just don't care."
    },
    {
      "text": "From scene one, The Lego Movie is maniacal in its comic delivery."
    },
    {
      "text": "The Lego Movie has enough wit and wisdom to send a recession-age message to families on the importance of thinking through problems with creativity."
    },
    {
      "text": "In spite of itself, The Lego Movie is curiously self-correcting and still gets to be all things to almost all people. It's a crowded construction site of hilariously mixed-up everywhatever."
    },
    {
      "text": "Sweet, funny, preposterously complex and uniquely ridiculous, The Lego Movie feels like a quantum step up for both CG animation and movies based on marketing pitches."
    },
    {
      "text": "So much of The Lego Movie really is awesome."
    },
    {
      "text": "This is as wildly imaginative and fun as any film you're likely to see this year, even if it is based entirely on corporate synergy."
    },
    {
      "text": "The creators of The LEGO Movie know the building blocks of a great movie: charm, side-splitting jokes, lovable people (er, I mean LEGO figures) and an engaging storyline."
    },
    {
      "text": "The Lego Movie is an intricate piece that delights in both celebrating and mocking movie archetypes, the commercialisation of childhood experience, and the authoritarian hands of parents."
    },
    {
      "text": "Lord and Miller have achieved the seemingly impossible and assembled a genuinely funny, touching, inspirational and absolutely lunatic love letter to those tiny bricks, as well as to imagination and creativity in general."
    },
    {
      "text": "It is a canny piece of pop art, and The Lego Movie should end up delighting old and young viewers in equal measure."
    },
    {
      "text": "[The Lego Movie hits] the sweet spot between adults who grew up with Lego and children who love Lego, and carefully ignoring the irony of such an overtly branded indictment of corporate strangulation of creativity."
    },
    {
      "text": "For those of us who remember the limitlessness of our imaginations as we played with little plastic blocks, this is a joy to behold."
    },
    {
      "text": "The storyline is wonderfully subversive, and the jokes come so fast and furious that it's a challenge to keep up with the humor of The Lego Movie."
    },
    {
      "text": "It's oddly refreshing when a movie intended to sell toys winds up being thoroughly delightful on its own."
    },
    {
      "text": "You'll leave the theater smiling and singing \"Everything Is Awesome,\" because when it comes to The Lego Movie, everything is."
    },
    {
      "text": "Carries on in the grand Bob Clampett Warner Brothers \"Porky in Wackyland\" tradition. Surrealism for the six year old and the sixty year old."
    },
    {
      "text": "It's brilliantly animated and incredibly well shot - whether it's the dazzling 'Busytown' cityscapes that children's author-illustrator Richard Scarry might once have created or simply two characters defying the breathtakingly shallow depth of field."
    },
    {
      "text": "A 100-minute advertisement you've paid to watch--now that's ingenuity."
    },
    {
      "text": "The Lego Movie presents one of the brightest-colored dystopian nightmares ever marketed to children ... highly imaginative, wildly fun, and clever on multiple levels."
    },
    {
      "text": "By going off the proverbial reservation, making what amounts to a Lego movie for adults, even at the risk of displeasing those who wanted nothing more than a nostalgic wink fest, The Lego Movie merits praise as a true work of thematic richness."
    },
    {
      "text": "Everything is awesome! Well, not quite everything - but more than enough to make THE LEGO MOVIE the biggest and best surprise this year."
    },
    {
      "text": "[I]t's an exhilarating, absolute joy to watch it all come together."
    },
    {
      "text": "While \"The Lego Movie\" may have a pretty basic story, its beautifully animated world and talented vocal cast give it enough depth to provide lots of fun and excitement."
    },
    {
      "text": "...the movie's relentlessly frenetic vibe grows more and more exhausting as time progresses..."
    },
    {
      "text": "In what is sure to turn out to be this generation's Toy Story, this crazy-funny animated lark takes us into a hyper-happy world where everything is so awesome there's even a pop anthem called Everything is Awesome... fresh and fast and funny."
    },
    {
      "text": "... let's not pave all the roads with yellow bricks just yet."
    },
    {
      "text": "Delightful, inspired, affecting, utterly hilarious stuff, and certainly the first feature starring Batman to earn a couple of those compliments."
    },
    {
      "text": "Just as the conceptual agility of The LEGO Movie never ceases to astonish - it will take at least three viewings to fully take in every last detail applied here - the visuals both innovate and resonate to heights only previously scaled by Pixar."
    },
    {
      "text": "it's worth your time to discover instead of me preempting by synopsis and/or recitation. I hate it when an internet post ends this way, but it's all you're going to get from this review: \"Enjoy!\""
    },
    {
      "text": "A wry, playful and intelligent piece of filmmaking that, like Toy Story before it, rises far above its station."
    },
    {
      "text": "The Lego Movie is a brilliant technical achievement."
    },
    {
      "text": "It's fast, smart, really funny, full of great action and contains a song, 'Everything is Awesome', with the single catchiest hook in the history of songwriting. Seriously, in this movie at least, everything really is awesome."
    },
    {
      "text": "This is one of the most creative animated features in recent years. I never imagined that so much could be made from the concept."
    },
    {
      "text": "The giggle-inducing gags will infect humans of any age with their zany sense of humour."
    },
    {
      "text": "It's relieving to say that it brims with visual charm and creativity."
    },
    {
      "text": "State-of-the-art software has been used to make the characters look like actual plastic figurines brought to life through the magic of stop-motion animation. In other words, this is a digital movie with an analogue soul."
    },
    {
      "text": "With all this going for the film, you can understand why Lego should be so pleased with it and why it's already had such world box-office success. But its relentless action and pounding soundtrack sent me out feeling battered rather than uplifted."
    },
    {
      "text": "At its core, The Lego Movie is an ode to imagination, creativity and busting outside the status quo, so it's wholly fitting that the film itself - from its storytelling through to its superb animation - embodies these qualities beautifully."
    },
    {
      "text": "Teaming with life, the lifeless, virtually immovable figurines come alive and appear to move with all the dynamics of people, albeit smaller and cuter."
    },
    {
      "text": "A healthy dose of off-the-wall humour as the action speed-skates into overdrive, challenging and surprising us constantly as ideas veer left of centre"
    },
    {
      "text": "Moving at the speed of the imagination it's a hyperactive adventure that breathlessly moves from crazy to bonkers."
    },
    {
      "text": "The richness of animated detail is more compelling than any substantive narrative insight."
    },
    {
      "text": "You may not find yourself goofily grinning and laughing at any other film this year as you will during this and that's fitting because they just don't build too many movies like this anymore."
    },
    {
      "text": "While the Lego toys might be simple and plain, the film version is most definitely not."
    },
    {
      "text": "It is as original as cartoons come."
    },
    {
      "text": "A story about creativity, independence and cooperation running on a crazy rail of pop-cultural riffs and satirical references, understated comedic nuance and explosively absurd visual magic."
    },
    {
      "text": "As a rule, movies about toys need to be approached with extreme caution; some of them have been bad enough to count as health hazards. This one is the exception."
    },
    {
      "text": "A thrilling, consistently funny, all-ages extravaganza, The Lego Movie is virtually critic proof, in that we can't find a darned thing wrong with it."
    },
    {
      "text": "A spiritually literate animated film for people of all ages that affirms that everyone is special and everything is truly awesome."
    },
    {
      "text": "On the basis of their three feature films, directors Phil Lord and Christopher Miller are masters of transforming unlikely source material into something wonderful."
    },
    {
      "text": "This endlessly inventive toy-inspired comedy is brilliantly designed and animated, even if it goes on a little too long and gets a bit treacly toward the end."
    },
    {
      "text": "Pleasantly bonkers."
    },
    {
      "text": "Smart and hilarious, with writing as brilliant as the colors of Lego blocks, 'The Lego Movie' is wowing winter-worn audiences of all ages."
    },
    {
      "text": "a hectic bum-rush of clever pop-culture and corporate satire that works just well enough to help us forget that it is essentially a 100-minute commercial"
    },
    {
      "text": "One can imagine that this story is a reflection of the same kind of struggle that happened during the making of this movie between the corporate suits of Lego, who exercised some control over the film, and the creative people who made the movie."
    },
    {
      "text": "A tribute to Lego made by enthusiasts, not an ad for Lego made by hacks."
    },
    {
      "text": "Beguilingly bonkers... a comedy adventure that bowls along with the freewheeling inventiveness and surreal leaps of a child's imagination."
    },
    {
      "text": "I am afraid that for me this film was not quite awesome."
    },
    {
      "text": "A true masterpiece of a film from the animation to the storyline behind the Lego universe."
    },
    {
      "text": "Lord and Miller have found the mythological resonances that, along with handy licensing agreements, link those plastic bricks to the past three decades of pop culture."
    },
    {
      "text": "While younger viewers will delight at the whiz-bang animation action and hugely likable familiar figures, adults will laugh themselves silly at the smart consumer satire gags and goggle in wonder at the undulating Legoland vistas."
    },
    {
      "text": "With a 100-minute run time, The LEGO Movie often does feel like too much of a good thing; I was satiated more than once. But it would be curmudgeonly not to enjoy many of the gags that the film has to offer."
    },
    {
      "text": "The Lego Movie may not have the most inspired of titles but Phil Lord and Christopher Miller have taken what could have been a 100-minute advert and turned it into a dizzyingly fast, continually surprising, deftly satirical delight."
    },
    {
      "text": "It's about as magical and wondrous a movie as I've seen with more laughs per minute than any movie in recent memory. The LEGO Movie is an absolute delight."
    },
    {
      "text": "Adults who go to The Lego Movie out of a weary sense of parental duty are in for a very pleasant surprise."
    },
    {
      "text": "The Lego Movie's desire to inveigh against social conformity turns into a plea for collectivism. It's a message that will inevitably send the blood pressures of FOX News pundits through the roof."
    },
    {
      "text": "A film every bit as imaginative, colourful and cleverly constructed as their plastic inspiration."
    },
    {
      "text": "Though not everything about The Lego Movie is awesome, you'll leave the cinema wearing a real smile."
    },
    {
      "text": "Funny, inventive and bound to boost sales of the interlocking plastic bricklets even further."
    },
    {
      "text": "If it sounds like a glorified toy commercial, well, there's no denying it is. But it's an advert packed with invention, humour and charm - the kind you'd skip through TV programmes to watch."
    },
    {
      "text": "This film contains the best Batman theme song...ever."
    },
    {
      "text": "A work of unbridled imagination, apt to delight sociologists, stoners and six-year-olds alike."
    },
    {
      "text": "It's playtime on film, done with wit, warmth, and respect for the business of imagination."
    },
    {
      "text": "The film is never hampered by its chosen medium. It goes everywhere and does everything, from pitched aerial battles to cities at bay against inferno."
    },
    {
      "text": "Slapstick. Wit. Invention. Random laser battles. While it's easy to get carried away by the action - as the characters frequently do - it's the joyful irreverence that makes this such a terrific ride."
    },
    {
      "text": "Is this a glossy feature-length advert for toys? Nope, it's a whimsical and hilarious piece of animated nostalgia from Phil Lord and Chris Miller."
    },
    {
      "text": "It's endlessly inventive and a lovely third act twist brings the fun to a surprisingly touching conclusion."
    },
    {
      "text": "Inventive visuals and a seriously deranged script make this animated adventure far more enjoyable than we expect, especially as it brings out the childish creativity in everyone watching."
    },
    {
      "text": "Hilarious and poignant. The LEGO Movie isn't here to sell you plastic building blocks, it's here to make you remember why playing with them is an essential and magical part of life."
    },
    {
      "text": "You've seen this all before - it's Toy Story meets The Matrix - just not done in Legos."
    },
    {
      "text": "Deliriously inventive and frequently hilarious, this is a hugely entertaining family adventure with an inspired script, gleefully imaginative animation, superb 3D effects and a note-perfect voice cast."
    },
    {
      "text": "Fast and funny, sly and subversive, even as its plot promotes inventive deconstruction, The Lego Movie is built to last."
    },
    {
      "text": "The LEGO Movie is about creativity and how it resides inside each and every one of us."
    },
    {
      "text": "Surprisingly entertaining."
    },
    {
      "text": "Fast, funny and created with loving attention to detail, The Lego Movie will delight anyone who has ever played with those universally-recognised little yellow figures."
    },
    {
      "text": "A funny, quirky, weird adventure that has fun with the limitations of Legos while making clear that there's nothing you can't do or make with those interlocking blocks."
    },
    {
      "text": "It's novel, it's entertaining, it's funny, it's witty, and though it revolves around one brand of toy, it never actually feels like one giant commercial."
    },
    {
      "text": "The Lego Movie is exactly what its title promises, a kid-pleasing movie comprised of CGI renditions of the titular interlocking plastic bricks."
    },
    {
      "text": "The whole thing is a Danish interlocking brick system fever dream - and a kick in the pants, if not the groin, to filmmakers who dare follow it."
    },
    {
      "text": "Hilarious toy tale plugs product, but makes it nonstop fun."
    },
    {
      "text": "...in a world of cloud server-scheduled childhoods, proposing that kids should be left alone to play however they damn well feel seems at least mildly rebellious."
    },
    {
      "text": "Like watching a less soulful Toy Story movie on a sugar binge. I mean this as (mostly) a compliment."
    },
    {
      "text": "This is truly a movie that children and their parents can both enjoy for different reasons."
    },
    {
      "text": "An amazing film on so many levels, the creators of \"The Lego Movie\" have taken a simple plaything - seriously, it's a block of plastic - and turned it into a fun, action packed adventure for the whole family."
    },
    {
      "text": "A film whose inexplicable coolness flies right in the face of the fact that it's basically a 100-minute toy commercial."
    },
    {
      "text": "The Lego Movie: Merely a great film, or the greatest film ever in the history of cinema?"
    },
    {
      "text": "Witty, gorgeously animated and wildly imaginative, this is one of the most entertaining adverts you'll ever see."
    },
    {
      "text": "The LEGO Movie is amazing. It's a rollercoaster ride that's all dips and loop the loops."
    },
    {
      "text": "The greatest commercial ever made."
    },
    {
      "text": "Misleading trailer leads to one of the most disappointing films of 2014. Falls apart in a ruinous 3rd act and filled with mixed messaging. Not even kragle could hold this mess together."
    },
    {
      "text": "The audacious, awesome concept cleverly snaps together, proving ordinary can be extraordinary."
    },
    {
      "text": "A movie with more laughs-per-minute than any recent comedy I can remember ... and a thrilling summons to unleash our own creativity."
    },
    {
      "text": "An endlessly creative cinematic creation, this brilliant animated film exceeds all tired expectations and delivers the first fantastic movie of 2014."
    },
    {
      "text": "The LEGO Movie amounts to little more than an exercise in overstimulation that exists primarily so children will get their parents to buy them more of the titular toy."
    },
    {
      "text": "The visuals are spectacular, the 3D technology is artfully used and the story is jam-packed with so many funny lines, it's hard to catch all the jokes that are delivered in rapid-fire succession -- constantly tweaking many popular culture icons."
    },
    {
      "text": "A whip-smart, surprisingly emotional family film where the toy property is seen less as a concrete template than a tool for seemingly limitless potential."
    },
    {
      "text": "The brightly-imagined Lego Movie is a wickedly smart and funny free-for-all, and sassy enough to shoot well-aimed darts at corporate branding."
    },
    {
      "text": "The Lego Movie is the first really awesome film of 2014. If you're old enough to play with the toys, it's a must-see, and there's no age too old for the film."
    },
    {
      "text": "A total gas--even if its message is that we should do as Lego says, not as Lego does."
    },
    {
      "text": "The LEGO Movie is a fun adventure with heart and originality that everyone (regardless of age) should experience in full, big-screen 3D grandeur."
    },
    {
      "text": "A fast-paced, quick-witted adventure that's also so endearing it makes one's heart swell."
    },
    {
      "text": "Does everything you expect, but also does a great deal you don't expect, subverting clichés, taking roads less traveled and even tiptoeing into theological wonder."
    },
    {
      "text": "The film is made with intelligence and, more important, heart and needs to be remembered come year's end."
    },
    {
      "text": "A total hoot, with blockbuster levels of excitement and a handle on playfulness that makes most recent family entertainment offerings feel painfully inert and monotonous."
    },
    {
      "text": "Written and directed with confident, comedic fire by Phil Lord and Christopher Miller, The Lego Movie careens with a joyous wit and energy more family movies could use."
    },
    {
      "text": "In the guise of a rambunctious animated comedy, the duo have actually delivered a thoughtful and even moving treatise on the power of imagination and the magic of uninhibited creativity."
    },
    {
      "text": "The movie is built like a child's game (on a few levels), the sheer chaos of pieces spread out across the screen and assembled with a furious kind of fun."
    },
    {
      "text": "Let's go out on a critical limb, shall we? The Lego Movie is the best thing to come along since that other toy-centric movie revolutionized animated films about 20 years ago."
    },
    {
      "text": "Round the kids up (or don't), plop yourself down in a theater (no need to pay extra for 3D) and get ready to remember how great it was to open a box of random LEGO parts and find the world was just full of blocky possibilities of where to go next."
    },
    {
      "text": "I stopped laughing because after 20 minutes, I'd had enough. The conceit gets stale fast."
    },
    {
      "text": "Commercially speaking, it needed only to be fun, colorful and brisk. But in Lord and Miller's hands, it's affecting, empowering and transcendent, proving that you can work within the boundaries of the familiar to craft something truly exceptional."
    },
    {
      "text": "Clever in concept, if a bit manic in execution."
    },
    {
      "text": "\"The Lego Movie\" easily could have been a corporate commercial full of enticements for kids to buy toys, but it's not. Free-flowing and energetic, it's as fun as actual play."
    },
    {
      "text": "Much of the adult humor zips over the heads of children, who will dig the characters and the action, and everyone loves the legos."
    },
    {
      "text": "It works on all levels: as a fun, funny movie to enjoy with family, as a commentary on the conformity of society and its lack of creativity, as an ode to human connections, and even, if you squint just right, an exploration of the nature of God."
    },
    {
      "text": "The problem is that the plot is simplistic, the jokes aren't very funny, and if you're not a Lego aficionado you may be wondering what the fuss is all about."
    },
    {
      "text": "A manic and surprising comedy inspired by toys that has more imagination and creativity than all the Transformers pictures combined."
    },
    {
      "text": "... Just when it's being stretched thinnest, an unexpected twist turns it into something else, something deeper with real meaning, hammering home its theme of thinking outside the box."
    },
    {
      "text": "A glorified advertisement, also subversive, surreal and tremendous fun."
    },
    {
      "text": "The animated film lovingly and cleverly captures the appeal those little plastic bricks have on kids, whether you played with them yesterday or during the Carter Administration."
    },
    {
      "text": "This is a high-energy, smart, and surprisingly touching family film that truly delivers something for everyone - and maybe even more so for adults."
    },
    {
      "text": "It still might be a 100-minute commercial, but at least it's a highly entertaining and, most surprisingly, a thoughtful one with in-jokes that snap, crackle and zoom by at warp speed."
    },
    {
      "text": "An amazing, brilliant spirit that is silly and hilarious."
    },
    {
      "text": "A movie that's fast-paced and silly with enough throwaway clever in-jokes for their accompanying adults to justify a second viewing."
    },
    {
      "text": "This movie is itself the best possible antidote to the tendency to settle for lowest-common-denominator formula storytelling."
    },
    {
      "text": "Part product placement, part really insane produce placement, and part something else -- mayhem, mostly, with a side dish of running amok -- The Lego Movie is an unusual, sometimes brilliant film."
    },
    {
      "text": "What could easily have been test-marketed, corporate-processed crap ... instead becomes a surprisingly enjoyable and satisfyingly dense family entertainment that pays tribute to the spirit of free play and individuality."
    },
    {
      "text": "A clever, vividly imagined, consistently funny, eye-poppingly pretty and oddly profound movie ... about Legos."
    },
    {
      "text": "It's a LEGO movie for people who despise the very idea of a LEGO movie, which is pretty punk rock for a CGI movie made by one of the largest media conglomerates in the world."
    },
    {
      "text": "It's a film that believes everyone can be creative; that everyone is special; and that imagination is so powerful it can flourish even within a system bound by rules. Not bad for a film about a toy."
    },
    {
      "text": "Lord and Miller aren't looking to detonate tropes or re-wire cinema, but they make exposition beats fun, and action beats silly; they fill every frame with pertinent details and refuse to waste a moment on needless improvisation."
    },
    {
      "text": "This is a movie that would be just as entertaining with the sound off. Lord and Miller have so much going on that it's impossible to appreciate it all in one viewing."
    },
    {
      "text": "It's the smartest, funniest and most dazzlingly inventive children's movie to come along in years."
    },
    {
      "text": "A spirited romp through a world that looks distinctively familiar, and yet freshly inventive."
    },
    {
      "text": "Everything is awesome! Really."
    },
    {
      "text": "For the most part, it's a hoot. There's more ingenuity packed into one minute of this film than there is in the entire running time of most animated amusements."
    },
    {
      "text": "The Lego Movie maybe be one giant advertisement, but all the way to its plastic-mat foundation, it's an earnest piece of work - a cash grab with a heart. Made for, with and about Legos, the movie is also made for, with and about imagination ..."
    },
    {
      "text": "\"The Lego Movie\" is a fun, hilarious adventure into a world that we all played in once upon a time (ok, last week)."
    },
    {
      "text": "It's hard to believe that a Lego film hasn't happened until now, but maybe that was all part of the strategic design: now more than ever, after January 2014, \"The Lego Movie\" is just what audiences need."
    },
    {
      "text": "It's a brilliant piece of animated film-making, with a wicked sense of humor."
    },
    {
      "text": "Adults in their 40's today should find the film very satisfying. However, the jokes and sight gags arrive in such machine-gun fashion that young kids and many adults will be hard pressed to keep pace."
    },
    {
      "text": "Completely charming family fun."
    },
    {
      "text": "The best part is what the movie has to say about conformity -- following the instructions on the box -- versus creativity, i.e. life as a jumble, an inspired improvisation, a joyous hodgepodge."
    },
    {
      "text": "My fingers rebel, but type it I must: \"The LEGO Movie\" is the first great cinematic experience of 2014."
    },
    {
      "text": "Its millions of tiny pieces add up to big fun."
    },
    {
      "text": "\"The Lego Movie\" is a marvelous piece of work."
    },
    {
      "text": "I'm probably overselling it, but at one point during The LEGO Movie, I found myself thinking, \"This is it. This is the one. This is the film that our entire shared experience of pop culture has been building towards.\""
    },
    {
      "text": "While clearly filled with affection for - and marketing tie-ins to - the titular product that's front and center, it's also something of a sharp plastic brick flung in the eye of its corporate sponsor."
    },
    {
      "text": "Much of the time it makes other movies based on toys look like child's play."
    },
    {
      "text": "\"The Lego Movie\" is a massive collision of subversive humor, hyper-kinetic energy, mind-jangling design, spinning colors and about 15 million Legos, no exaggeration."
    },
    {
      "text": "Often clever and erudite...Unfortunately, that visual imagination is often negated by the filmmaker's failure to realize that every story has an appropriate length."
    },
    {
      "text": "The Lego Movie is the kind of fine-tuned family-friendly flick that serves two audiences simultaneously, with a non-stop firehose of eye candy for the kids and lots of sharp wit and subtle parody for the grownups."
    },
    {
      "text": "While it might not quite live up to the catchy song 'Everything Is Awesome' that plays early on, it's quite good and should easily entertain both kids and adults alike. (Full Content Review for Parents also available)"
    },
    {
      "text": "The LEGO Movie is a genuinely entertaining film from start to finish."
    },
    {
      "text": "Writer-directors Phil Lord and Christopher Miller, who displayed a knack for slapstick with 21 Jump Street, fill the script with delightfully absurd one-liners and sharp pop culture references."
    },
    {
      "text": "After the most uninspired year for American animated features in recent memory, 2014 starts off promisingly with writer/directors Phil Lord & Christopher Miller's stylish, inventive and funny ode to the world of Lego..."
    },
    {
      "text": "The Lego Movie entertains us with every blockbuster cliché known to humankind at the same time it ridicules every blockbuster cliché known to humankind."
    },
    {
      "text": "Even those who have never touched the little plastic blocks should find it unexpectedly enjoyable."
    },
    {
      "text": "For a film based on a product tie-in, the filmmakers admirably concoct a movie that never sells out."
    },
    {
      "text": "It's fresh, enjoyable, and seems to celebrate the joyous chaos of childhood play over the blind consumption of product."
    },
    {
      "text": "While small children might get a little antsy, everyone else should find \"The Lego Movie\" amusing and delightful. If one of its goals is to make people want to head straight from the theater to a Lego store, mission accomplished."
    },
    {
      "text": "Lord and Miller don't sink into cynicism. Their computer animation embraces the retro look and feel of the toys to both ingenious and adorable effect."
    },
    {
      "text": "Kids, this is what drugs are like."
    },
    {
      "text": "The Lego Movie doesn't simply put imagination into practice but celebrates it, makes it integral, in a late development so uncharacteristic for an animated film that it's a wonder unto itself."
    },
    {
      "text": "Take the kids to The LEGO Movie - the funniest, cleverest, most exhaustingly exhilarating animated feature in ages - then leave them to play with their toys and see it again for your own wicked amusement."
    },
    {
      "text": "The LEGO Movie taps into the childlike imagination and awe that LEGO was always meant to inspire."
    },
    {
      "text": "Pop-culture jokes ricochet off the heads of younger viewers to tickle the world-weary adults in the audience, with just enough sentimental goo applied at the end to unite the generations. Parents will dab their eyes while the kids roll theirs."
    },
    {
      "text": "A spot in my top 10 of 2014 has been locked down."
    },
    {
      "text": "Miller and Lord have gone far beyond the call of duty. Their Lego Movie is effervescent in style, conveying a substantive message without ever devolving into saccharine preachiness."
    },
    {
      "text": "The filmmakers could have easily made one long, monotonous ad for the beloved brand that's been around for more than 55 years. Instead they've created a delightful tale championing self-reliance and distinctiveness."
    },
    {
      "text": "Though it falls apart a bit near the end, \"The Lego Movie\" is easily the best movie ever made about plastic interlocking blocks, and good fun by any measure."
    },
    {
      "text": "\"This is so cool!\" a young child behind me at the screening couldn't help but exclaim late in the film. It is difficult to argue with this reaction."
    },
    {
      "text": "This is a movie for kids, for adults, and for those still deciding which one of those they are. And it has the best Star Wars joke you'll ever see."
    },
    {
      "text": "Far better than a film based on toy blocks has any right to be."
    },
    {
      "text": "A goofy cartoon that will sell enough tickets and toys to keep the bosses happy while facing head-on the fact that these bricks are kinda, well, fascist."
    },
    {
      "text": "As cute and energetic as it is, \"The Lego Movie\" is more exhausting than fun, too unsure of itself to stick with any story thread for too long."
    },
    {
      "text": "The set-up offers the nastiest parody of modern conformity since 'Idiocracy. But it doesn't follow through. It doesn't have the attention span."
    },
    {
      "text": "The slightly glitchy movement of the characters is funny, the animation is awesome, the deconstruction of superheroes is brilliant and the jokes are knowing and slightly edgy."
    },
    {
      "text": "It's fast and original, it's conceptually audacious, it's visually astonishing, and it's 10 times more clever and smart and funny than it needed to be. Here, at last, is an animated comedy that never stops surprising you."
    },
    {
      "text": "A film that's insane, witty, uneven and almost certain to delight anyone who's ever laid hands on Lego."
    },
    {
      "text": "Skeptics, leave your grumblings at home. The LEGO Movie is a blast, a plaything for any age, an exquisite assembly that's literally more than the sum of its parts. For as per the song that runs throughout: 'Everything is awesome, everything is cool.'"
    },
    {
      "text": "This isn't just the funniest PG-rated animation in too long; it's the funniest film, period, in months ..."
    },
    {
      "text": "Zany episodes...provide a clothesline on which to hang social satire and an overriding message that an individual's imagination can trump social and cultural oppression. Throw out the instructions, and make what you want of the world. Plus butt jokes."
    },
    {
      "text": "Subversive and thrilling, winking occasionally from a clear-eyed intelligent point-of-view, The Lego Movie turns what could have been an effort in bland branding into a film as classic and complex as the enduring, simple plastic blocks that inspired it."
    },
    {
      "text": "The funniest, most fun movie in (insert considerable amount of time), and I can't wait to see it again."
    },
    {
      "text": "The script is witty, the satire surprisingly pointed, and the animation tactile and imaginative."
    },
    {
      "text": "Delightfully witty and energetic, this engaging flick manages to create a sense of wonder for everybody."
    },
    {
      "text": "Appreciation of the film lies, perhaps aptly, in the pieces built on a pillaged foundation."
    },
    {
      "text": "Will not only amuse kids and parents alike, but will let the adults keep laughing during the repeated viewings that inevitably will result when it reaches home video."
    },
    {
      "text": "Ridiculously funny and meticulously detailed, The LEGO Movie is far better than a toy tie-in movie has any right to be. Despite a couple of dips, you'll be grinning throughout."
    },
    {
      "text": "[VIDEO ESSAY] There's a strong subtext of socio-political resistance at play in \"The Lego Movie.\" It may be the first mainstream animated resistance film ever made by a Hollywood studio."
    },
    {
      "text": "Hysterical, inventive, emotional, imaginative and eye-poppingly busy ... an absolute home run."
    },
    {
      "text": "This is a toy story worthy to stand alongside Toy Story, and a guaranteed future classic."
    },
    {
      "text": "A full-throttle, giddily inventive, all-ages joyride that buoyantly boosts the bar for 3D computer-animated movies."
    },
    {
      "text": "Bright, colorful, fast and noisy, The Lego Movie will doubtless tickle young fans of the toys. It's just too bad that a movie that encourages you to think for yourself doesn't follow its own advice."
    },
    {
      "text": "The results are thoroughly entertaining and anyone who has ever played with the blocks or the recent video games will find something to enjoy."
    },
    {
      "text": "The Cloudy With a Chance of Meatballs auteurs create another witty, emotionally real animated adventure"
    },
    {
      "text": "A wildly inventive rollercoaster ride you won't forget in a hurry. Awesome indeed."
    },
    {
      "text": "Though it takes a short while to get used to the unique (and extremely colourful) visual aesthetic, it works a treat."
    },
    {
      "text": "A smoothly blended concoction of spry sensory pleasures and considerable heart ... a terrific family-friendly adventure with sincere verve and pop."
    },
    {
      "text": "Never before have I felt less like a film was selling me a product, and then left the cinema more desperate to fill my house with the product it wasn't selling."
    },
    {
      "text": "From its opening frame to its surprisingly heartfelt conclusion, 'The LEGO Movie' has a bright and brash, candy-colored go go go dynamism that crackles with a glorious alacrity set to the tempo of the classroom's biggest and most disruptive spaz."
    },
    {
      "text": "Get ready to laugh your blocks off, because this is one fantastic Lego adventure not even your wildest playtime fantasies could have imagined - bringing a smile to the wide-eyed child in all of us."
    },
    {
      "text": "Phil Lord and Christopher Miller irreverently deconstruct the state of the modern blockbuster and deliver a smarter, more satisfying experience in its place, emerging with a fresh franchise for others to build upon."
    }
  ],
  "release_year": 2014,
  "duration": 95,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "synopsis": "Emmet (Chris Pratt), an ordinary LEGO figurine who always follows the rules, is mistakenly identified as the Special -- an extraordinary being and the key to saving the world. He finds himself drafted into a fellowship of strangers who are on a mission to stop an evil tyrant's (Will Ferrell) plans to conquer the world. Unfortunately for Emmet, he is hopelessly -- and hilariously -- unprepared for such a task, but he'll give it his all nonetheless.",
  "popularity": 8.7,
  "poster_url": "https://image.tmdb.org/t/p/original/lbctonEnewCYZ4FYoTZhs8cidAl.jpg"
}