{
  "movie_name": "The Conjuring",
  "movie_id": "the_conjuring",
  "total_reviews": 225,
  "reviews": [
    {
      "text": "The makeup effects are believable, the film does not overuse cartoonish digital effects, and Wan's direction manages to develop a thick, dense atmosphere that compensates for some of the script's flaws. Full review in Spanish."
    },
    {
      "text": "After years of lackluster releases from major studios, The Conjuring goes back to basics and manages to make something much more effective out of its formulaic story. It doesn't reinvent the wheel in any major way, but still largely thrilling."
    },
    {
      "text": "If we're really going to depart from the known horror of the first decade of the century... instead of conditioning emotions so crudely, we have to give the public a real point of view. So far Wan doesn't have it. [Full review in Spanish]"
    },
    {
      "text": "Ten years later, The Conjuring is still one of the best horror films."
    },
    {
      "text": "Perhaps Wan's biggest achievement is that when the traditional sequel setup is revealed, the overall feeling is one of anticipation, rather than the sadly familiar dread."
    },
    {
      "text": "What’s special about The Conjuring is how well director James Wan controls this environment. He uses the setting like a filmic funhouse ride spring-loaded with precisely timed jolts and screams."
    },
    {
      "text": "As someone a little tired of the bland, run-of-the-mill “horror” we get today, I was a bit skeptical. But I love being surprised and this film did that for me."
    },
    {
      "text": "The scares are built up more through quiet tension that is commendably shot and executed and a nice atmosphere is created that helps to present a very unnerving tone."
    },
    {
      "text": "Remarkably retro yet effective in its chills and thrills."
    },
    {
      "text": "If you're looking for some really good scares, The Conjuring is what you want."
    },
    {
      "text": "\"The Conjuring,\" takes pages from two of our favorite subgenres-the haunted house and the exorcism-and combines them to great effect to tell a purportedly true tale of real life terror."
    },
    {
      "text": "Horror junkies will find 'life after death' when watching 'The Conjuring', a dark, overwhelming and chilling film that constantly shoots fear to entertain. [Full review in Spanish]"
    },
    {
      "text": "Fans of James Wan's previous output, or fans of haunted tales of abject terror, will find a lot to love in The Conjuring, even if it ultimately falls short of \"all time great\" status in a busy and convoluted climax."
    },
    {
      "text": "This decade's definitive horror classic."
    },
    {
      "text": "You won't see a better crafted creepathon come out of the studios anytime soon."
    },
    {
      "text": "Perhaps what gives The Conjuring its pulse is the decision to tell the story from the point of view of the investigators -- giving the film a much-needed human layer."
    },
    {
      "text": "seems like James Wan has found his official ghost movie shooting style, because ... I feel like this film is almost indistinguishable from Insidious."
    },
    {
      "text": "The back half of the movie is also more formulaic and less interesting in every other way. The characters no longer offer surprises, and the scares are more predictable."
    },
    {
      "text": "On balance, though, The Conjuring is an effective horror tale, with a couple of gut-punch moments, and that's more than can be said of many other genre offerings."
    },
    {
      "text": "This film surpasses the best of the movie franchise in its ability to unnerve audiences in a uniquely skillful and spine-chilling approach to the haunted house narrative."
    },
    {
      "text": "There's nothing terribly new about Australian director James Wan's sixth film-it's just a testament to good scares."
    },
    {
      "text": "The Conjuring lives up to the marketing and hype, it is easily one of the best horror films so far this year."
    },
    {
      "text": "One of the first films in years where I was legit scared."
    },
    {
      "text": "Traditional tropes are as fresh as ever in what is an unnerving, albeit kitsch horror of remarkable finesse."
    },
    {
      "text": "Wonderful dark elements and a pretty tight script, it's definitely worth the watch, horror fan or not."
    },
    {
      "text": "A great antidote to your standard dehumanizing horror movie."
    },
    {
      "text": "The film is blood-chilling and easily as terrifying, if not more so, than classic '70s horrors like The Exorcist."
    },
    {
      "text": "Whilst all films of this nature have some element of predictability, The Conjuring manages to keep things fresh and the viewer on the edge of their seat."
    },
    {
      "text": "The Conjuring is an especially well-crafted horror movie made almost entirely from practical effects, which is increasingly refreshing to see."
    },
    {
      "text": "The Conjuring is a throwback to classic 1970s horror, the heyday of possession, if you will."
    },
    {
      "text": "The Conjuring is a memorably spooky event; a campfire tale told with a breathless adamancy that stirs the hackles and attacks the imagination."
    },
    {
      "text": "This is no classic, but director James Wan is a deft conductor who orchestrates the scariest ride of the season from threads of familiarly black melodies."
    },
    {
      "text": "At best, \"The Conjuring\" is a drop or two of rain in the middle of a decades-long horror drought. It won't tide anyone over for more than a couple hours."
    },
    {
      "text": "A movie that exemplifies the golden standards of the haunted house formula and escalates them to something rather rousing."
    },
    {
      "text": "By all means, feel free to initially underrate this finely crafted and genuinely scary production. Making such a mistake will only serve to leave you more impressed (and slightly rattled) than you might have been."
    },
    {
      "text": "An old-fashioned haunted house horror story made by people who love them. Classy, creepy, fun."
    },
    {
      "text": "The sound design of the movie is oppressive beyond belief -- this damn thing is louder than \"Pacific Rim.\""
    },
    {
      "text": "The Conjuring's use of tension, atmosphere, and suggestion prove that the scariest thing to an audience has nothing to do with what you see, but what you don't."
    },
    {
      "text": "Wan uses every horror cliche with blithe confidence. He knows no one is immune if the effects are sturdily built, and not too literal."
    },
    {
      "text": "Sometimes it all comes down to craftsmanship. There's probably nothing you haven't seen before in director James Wan's The Conjuring, but rarely have you seen it done so well."
    },
    {
      "text": "The Conjuring simply takes a standard story comprised of the usual components, and with warmth and commitment makes them not just palatable, but successful."
    },
    {
      "text": "It's solidly effective at bringing the scares, which is all it really sets out to do, right?"
    },
    {
      "text": "The viewer is completely absorbed in a story peppered with genuine, unexpected, bump in the night scares that will keep you on the edge of your seat."
    },
    {
      "text": "The trailer for The Conjuring is scarier than most horror features of recent vintage, and the feature makes good on the promise."
    },
    {
      "text": "Fans of old-school scary movies and J-horror, rejoice. James Wan's The Conjuring is going to scare the bejeezus out of you."
    },
    {
      "text": "Mainly, the movie wants to scare us, and it succeeds."
    },
    {
      "text": "Wan is basically just remaking his own Insidious with a few modest tweaks and a polyester wardrobe, and, just like that movie, The Conjuring gets progressively less scary as it goes along."
    },
    {
      "text": "This one never really takes hold and goes horribly wrong about 20 minutes before the end."
    },
    {
      "text": "An Overlook Hotel-sized creepshow that is genuinely frightening."
    },
    {
      "text": "Leaving slashers behind for the murky uncertainties of the supernatural, James Wan has found a way to expand his talents while driving yet another modern genre shift."
    },
    {
      "text": "Every hand that reaches into a wardrobe, every nervous trip into that basement just gets on your nerves. Satan needs to get over himself."
    },
    {
      "text": "Director James Wan delivers effective scares, showing more interest in sinewy camera moves and building a slow creep than in mindless gore, but the performances are a mixed bag, and the script repeatedly seeks refuge in the familiar."
    },
    {
      "text": "Advance word that this would be the scariest horror since Amityville proves well wide of the mark."
    },
    {
      "text": "Despite having a fairly standard haunted house horror plot, James Wan has created a fun, scary and beautiful looking movie."
    },
    {
      "text": "It is scary, and it conveys something even rarer in horror films -- the ring of truth."
    },
    {
      "text": "A strong cast and an atmosphere of real dread mean that despite a catalogue of immediately recognisable ghost devices, The Conjuring amounts to more than the sum of its scary parts."
    },
    {
      "text": "There's nothing new or original about it, but it's entertaining enough, and one can't help but respect the craft that went into making something catchy out of component parts stolen from others."
    },
    {
      "text": "[Wan] combines the ambiance of horror's leisure-suit heyday with the more recent brand of well-timed what's-that-in-the-mirror scares."
    },
    {
      "text": "It's atmospheric, terrifying, and brilliant in its intricately placed bouts of horror and suspense."
    },
    {
      "text": "Director James Wan, best known for creating the Saw franchise, delivers his finest work to date. Instead of relying on the graphic, slasher-style techniques that made Saw a hit, Wan turns to old-fashioned suspense, and the payoff is big."
    },
    {
      "text": "Better-than-average demon movie goes bump in the night"
    },
    {
      "text": "In The Conjuring, the scary casts out the spirit of the silly, permanently, and with a vengeance."
    },
    {
      "text": "The Conjuring is a well-crafted throwback to old school horror films, and the scares are unrelenting, but fans of the genre may find themselves guessing what is coming next."
    },
    {
      "text": "Easily one of the best horror films I've seen in years."
    },
    {
      "text": "Even in the dark, it's clear where this is going -- but Wan does know his way around a haunted house."
    },
    {
      "text": "With any luck, The Conjuring will lead potential future horror filmmakers raised on a diet of torture porn and slasher films to rethink their approach. One can hope, at least."
    },
    {
      "text": "The Conjuring uses every stock scare in the horror movie playbook for a dumb, yet charmingly traditional haunted house picture that manages to feel more retro than rehashed."
    },
    {
      "text": "Wan takes some unpromising ingredients and cooks it with style, tension and heart-stopping surprise moments."
    },
    {
      "text": "A carefully, masterfully crafted and ever-so-crescendoing exercise in atmospheric dread."
    },
    {
      "text": "These things run on faith, not reason, like the silly amateur exorcism that will have to be intoned when a priest is too far away and the silly scientific paraphernalia carted around."
    },
    {
      "text": "The Conjuring is the Ultimate Fighting Champion of haunting movies. It is all of the movies. Every single one."
    },
    {
      "text": "A very effectively mounted frightfest, played extremely straight, with very good performances."
    },
    {
      "text": "A pastiche of every horror movie you've ever seen but one that is enlivened by the screenplay written by the twin brothers who wrote the superlative 2006 remake of \"House of Wax\"."
    },
    {
      "text": "None of it is particularly bloody or violent, but young Wan and twin screenwriters Chad and Carey Hayes, up to now mostly unheralded in the horror genre, fashion a harrowing montage of thrills from beginning to end."
    },
    {
      "text": "America's stealth auteur, James Wan, directs unpretentious, inexpensive, stylistically consistent horror movies that spook audiences and scare up enormous profits; he embraces the genre's tropes and demonstrates why they continue to unnerve."
    },
    {
      "text": "As a solid spook show, The Conjuring works, though the ending doesn't strike me as big enough for the story leading up to it."
    },
    {
      "text": "The Conjuring suffers from a lack of momentum that proves impossible to overlook..."
    },
    {
      "text": "I was not expecting to be scared out of my wits by this creepily crafted and sublimely superior supernatural horror, but I was. Before the end, my cinema seat had worked itself through the three demonic stages of infestation, oppression and possession."
    },
    {
      "text": "It's scare-to-medium stuff with the usual ghoulies, ghosties, long-leggedy beasties and things that go bump in the night."
    },
    {
      "text": "The polish belies the fact that The Conjuring's a sausage made from the ground-up leftovers of other movies. Said offcuts are fact based of course."
    },
    {
      "text": "The sound effects are the aural equivalent of a 21st century form of digital diarrhoea, guaranteed to leave the hairs on the back of your neck suffering from erectile dysfunction."
    },
    {
      "text": "Wan is super-talented at delivering frissons and jumps, he just needs to take himself a bit more seriously."
    },
    {
      "text": "Smart, stylish horror flick, though a standout more for its elegant performances than any original scares."
    },
    {
      "text": "A meticulously and ingeniously crafted scare machine."
    },
    {
      "text": "The film may flaunt its true-story credentials for the sake of lurid immediacy but, like the best of its variety, it has a healthy understanding of its own silliness."
    },
    {
      "text": "Wan's shocks are predictable but - yikes! - are they scary."
    },
    {
      "text": "Here is a humdrum hunk of am-dram Gothic, lent prestige by a few specious avowals of its basis in a true exorcism case."
    },
    {
      "text": "Conjures up expertly timed scares and very little else."
    },
    {
      "text": "It stretches the truth far beyond the breaking point, but it is also creepy, scary and well-constructed."
    },
    {
      "text": "Wan's film is a sturdily built supernatural chiller, with next-to-no digital effects or gore, and it delivers its scares with a breezy lack of urgency."
    },
    {
      "text": "Stirs up some seriously scary, supremely creep-ifying mojo. There's something about this movie that you'll swear is following you home."
    },
    {
      "text": "There are some top-notch creepy moments and the picture is crafted with real care but the denouement is underwhelming and my palms never really sweated."
    },
    {
      "text": "Hugely enjoyable, genuinely scary horror flick that provides a welcome throwback to classic 1970s chillers ..."
    },
    {
      "text": "A tense and exciting haunted house movie, The Conjuring relies on atmosphere rather than gore to serve up an entertaining slice of ghostie shenanigans with the simple ambition of scaring the bejesus out of viewers."
    },
    {
      "text": "Slick, scary and with a sequel already on the way, The Conjuring doesn't reinvent the horror wheel but is still a frightener that's worth your time."
    },
    {
      "text": "Wan builds mounting dread with silence and suspense, lingering the camera unsettlingly long here, creaking a door there."
    },
    {
      "text": "...2013's horror film to beat. (Video review)"
    },
    {
      "text": "Terrific and scary-as-hell horror movie more in the spirit of psychological classics like The Innocents or the original 1963 The Haunting."
    },
    {
      "text": "It's not just the furniture that creaks, but there are still some effective jolts."
    },
    {
      "text": "Wan ... builds the many bumps in the night into a small Hitchcockian symphony of terror by way of long, eerie tracking shots, dramatic silences, and sudden scares that are frighteningly immersive."
    },
    {
      "text": "Despite having a story lacking in depth, The Conjuring almost feels like a master class in conventional horror movie making, as though this is the archetype of the genre."
    },
    {
      "text": "Though it frequently lapses into cliché, the real-life roots make it extra spine-tingling."
    },
    {
      "text": "Full of atmosphere and ghostly goodness, the only thing that doesn't seem to make any sense is the title."
    },
    {
      "text": "There's very little in The Conjuring that couldn't have been achieved on film 40 years ago, which lends it a very authentic feel."
    },
    {
      "text": "It's really not much more frightening than, say, The Flintstones Meet Rockula and Frankenstone or Scooby-Doo on Zombie Island, but it's modestly elevated by James Wan's relatively restrained direction."
    },
    {
      "text": "What director James Wan does in \"The Conjuring\" is employ old-fashioned shocks - things that bump in the night, insinuations of nefarious spirits, even a furniture-banging exorcism - in creative and ultimately terrifying ways."
    },
    {
      "text": "...there were moments where it seemed the entire theater was holding its breath. We were united in one feeling: terror."
    },
    {
      "text": "The Conjuring is like the horror equivalent of a 'Long Island iced tea'; mixing stiff belts of haunted house, poltergeist and exorcism into a near perfect and potent cocktail."
    },
    {
      "text": "Wan, a director with an extensive resume in cinematic scare tactics, operates in his element here, opting not to push the horror envelope, but merely to refine it."
    },
    {
      "text": "The Conjuring will have you shuddering with every creepy moment."
    },
    {
      "text": "I'm uh-scared, I'm uh-scared!"
    },
    {
      "text": "Old-style filmmaking makes this movie scarier than other recent horror films, simply because director Wan (Saw/Insidious) takes the time to actually develop suspense. By not using cheap trickery, he continually sends chills up our spine."
    },
    {
      "text": "A better than average horror movie sparked by excellent performances by the four leads."
    },
    {
      "text": "Sometimes a good horror film makes you chuckle."
    },
    {
      "text": "James Wan's 2004 breakthrough, Saw, was the definition of torture porn. His latest, on the other hand, is simply torture."
    },
    {
      "text": "I would happily watch it again, which is something I rarely say about horror films."
    },
    {
      "text": "The drip-feed of old tricks and a slow-drifting camera combine to stoke our expectation."
    },
    {
      "text": "A skillful, well-crafted movie that nicely melds the horror material with strong characterization and a deeper-than-expected story. The Conjuring represents the horror genre at its best and most substantive."
    },
    {
      "text": "What more you could expect or want from a ghost story: it creeps, it crawls, it sneaks up on you and goes 'boo!', all without missing a beat or running out of steam."
    },
    {
      "text": "The film doesn't require belief in demonic possession or the supernatural to be effective. It reveals secrets only as needed, and gets under the collective skin of moviegoers by cleverly exploiting old-fashioned fear of the unknown."
    },
    {
      "text": "This is a successful film thanks to Wan's unique vision and characters you can care about. Easily one of the best horror films I've seen in quite a while."
    },
    {
      "text": "The horror movie is artfully crafted from the first scares to the closing credits, with a bold retro vibe."
    },
    {
      "text": "It's glorious and a reminder that the scares of a haunted house are visceral and, like Chucky, live on the cusp of childhood, frivolous and frightening."
    },
    {
      "text": "Wan's latest exercise in jump-scare theatre... better to call it \"The Startling\"."
    },
    {
      "text": "... An old-school spookfest, a surprisingly restrained, moody picture ..."
    },
    {
      "text": "Its climax reminds one of The Exorcist."
    },
    {
      "text": "The cast puts their all into the film, turning what could have been a cliché'd filled blood-fest into a modern horror gem."
    },
    {
      "text": "A character declares, 'God brought us together for a reason!' Too bad it was for this movie, another over-hyped horror flick rehashing a four-decade old storyline."
    },
    {
      "text": "As resistant as I am to spooky movies of all kinds, I do admire Wan's direction .... He realises all the potential in the drama, in the images and in the editing, managing to give us frequent chills"
    },
    {
      "text": "Dress warmly and take a friend - The Conjuring is a chilly and unnerving experience. Based on a true story, Saw director James Wan's slick horror film has all the elements to make your skin crawl"
    },
    {
      "text": "The list of imagery \"borrowed\" from other films is lengthy. Director James Wan specializes in this sort of fare and his talented cast elevates the material above the dregs of the genre, which is an admittedly big and crowded basement."
    },
    {
      "text": "It's not rated 'R' because of gore, sex or foul language - the usual suspects. No, 'The Conjuring' is rated 'R' because its paranormal-based violence is so ... creepy."
    },
    {
      "text": "It will scare your underpants off."
    },
    {
      "text": "Rather than gore, Wan goes for a more old-fashioned, character-based movie here, and, as a result, a treasure trove of typical haunting tricks seems fresh and terrifying once again."
    },
    {
      "text": "How about that? Someone conjured up a good ghost story!"
    },
    {
      "text": "A solid, dependably scary ghost tale."
    },
    {
      "text": "This is a horror film where a pair of suddenly clapping hands gives you the heebie-jeebies, and Wan doesn't cheat with his jump scares."
    },
    {
      "text": "This isn't an instant classic, but it definitely reaffirms that Wan can do some interesting things within the horror genre."
    },
    {
      "text": "Simply put: With simple, creative and very effective scare sequences, The Conjuring is the scariest movie of 2013 (so far)."
    },
    {
      "text": "An uncommonly intense and frightening experience."
    },
    {
      "text": "Wan -- who made his reputation with the first Saw movie -- has a real understanding of the genre, and much of The Conjuring is well done."
    },
    {
      "text": "James Wan conjures up a truly paralyzing tale of supernatural terror with his retelling of Ed and Lorraine Warren's most disturbing case, creating scares through detailed and properly crafted horror storytelling - not a body count."
    },
    {
      "text": "In a summer of convoluted action films, the simplicity of a haunted house movie is actually kind of refreshing. Sometimes you want processed cheese, and this cheese is nicely processed."
    },
    {
      "text": "... it surpasses the hallmarks of its genre with an actually dramatic storyline and all-around solid acting. Just don't think you can go see it alone."
    },
    {
      "text": "It scared the living crap out of me. Only at the movies is that a compliment. So kudos to The Conjuring for putting fresh fire into the overworked haunted-house genre."
    },
    {
      "text": "Watching \"The Conjuring\" is like getting a tour of a haunted house attraction from someone that pushes, and pulls you through every room."
    },
    {
      "text": "An extremely well-crafted piece of mainstream horror that offers a number of genuine scares."
    },
    {
      "text": "Thank God I live in newish construction."
    },
    {
      "text": "Director James Wan does it again. First, it was the unexpected hit horror movie, \"Insidious.\" Now, \"The Conjuring\" delivers the same scary bump-in-the-night thrills."
    },
    {
      "text": "Director Wan takes a new pass at the creaky genre and comes up with exactly what you'd expect."
    },
    {
      "text": "While nothing new and playing up and off the various tricks previous horror films have used over the years, 'The Conjuring' still delivers enough effective scares and spooky material. (Full Parental Review also available)"
    },
    {
      "text": "With a sure-footed elegiac pace and a keen understanding that anticipation and what we don't see is sometimes more affecting than the payoff, \"The Conjuring\" plays like a loving throwback to cinema of the '70s."
    },
    {
      "text": "As \"The Conjuring\" progresses, the scares don't register beyond standard issue horror gotchas. They're as telegraphed as the musical cues alerting you something spooky is about to happen."
    },
    {
      "text": "The impact is in the suggested and the unseen, rather than the gory and grotesque - just as it is like the best classic horror films."
    },
    {
      "text": "It isn't particularly deep, but it's a grab-your-seatmate good time at the haunted house."
    },
    {
      "text": "\"The Conjuring'' depends more on its excellent cast and atmospheric direction than cheap gimmicks to raise hairs on the back of your neck. Which it does, quite frequently."
    },
    {
      "text": "[Wan] cuts The Conjuring into two halves -- an exhilarating haunted-house thriller and a grueling post-Exorcist horror film -- but they don't come back together in a living, breathing whole."
    },
    {
      "text": "The Conjuring doesn't have the big special effects of its summer competition, but it is an old-fashioned scary movie that uses every dark corner as a source of scream-inducing frights. Don't see this movie by yourself."
    },
    {
      "text": "Unexpectedly fresh, alive, and vibrant - and wonderfully traumatizing."
    },
    {
      "text": "This is an extremely effective, consistently creepy, and occasionally unnerving experience."
    },
    {
      "text": "One of the scarier haunted house/demon possession movies in recent years, it brings to mind '70s supernatural horror films such as The Exorcist with its stillness, steady build of suspense and handsome cinematography."
    },
    {
      "text": "The dread gathers and surges while the blood scarcely trickles in \"The Conjuring,\" a fantastically effective haunted-house movie."
    },
    {
      "text": "This is a director inspired by grand, gothic horror, more interested in long silences and swooping camera movements than torture porn or gruesome decapitations. The guy wants to wring you out."
    },
    {
      "text": "This saga of demonic possession deploys the full audio firepower of modern multiplexes, and does so with brain-battering frequency, like a ghostbusting version of a Japanese Taiko drum ensemble."
    },
    {
      "text": "The Conjuring feels like someone chucked Poltergeist, Paranormal Activity, The Orphanage, Insidious and especially The Amityville Horror into a blender, then added a bit with a doll."
    },
    {
      "text": "Wan builds suspense until it's almost unbearable, then adds a little more, just to make sure the audience is as terrified as the characters."
    },
    {
      "text": "What saves the movie is a surprisingly fine cast and deft direction from James Wan, the horror veteran who gave us \"Saw.\""
    },
    {
      "text": "The leads all perform with perfectly straight faces no matter how often the talk turns to witches and \"inhuman spirits,\" which helps sell The Conjuring's fundamentally silly story. But Wan's direction seals the deal."
    },
    {
      "text": "Mainstream horror at its best, James Wan continues to impress"
    },
    {
      "text": "Again favoring tension over bedlam, Wan issues a similar but successful follow-up to Insidious, finding proper beats of fright and family to play in this throwback endeavor."
    },
    {
      "text": "The Conjuring finds director James Wan improving on his previous haunted-house yarn Insidious in just about every way possible."
    },
    {
      "text": "It never met a haunted house cliche it didn't like, but Wan mercilessly piles on the uncanny events, gradually escalating the pitch from creepy to freaky to utterly bananas."
    },
    {
      "text": "It's a terrific throwback to more psychologically based horror."
    },
    {
      "text": "With its forked tongue planted loosely in cheek, this haunted-house flick is enjoyably retro in both style and substance."
    },
    {
      "text": "Solid horror film that pays hommage to the great character-driven horror classics of the sixties and seventies."
    },
    {
      "text": "Wan has gotten very good at crafting those creepy moments; now he just needs to apply them to a more interesting story."
    },
    {
      "text": "It's generic and lazy as storytelling, but this time there's almost enough playful camerawork to distract from the feeble conception."
    },
    {
      "text": "The seen-it-all-before elements of this supernatural thriller directed by the filmmaker who gave us Saw, however, are more hoary than horrific. It might as well be retitled The Amityville Exorcist."
    },
    {
      "text": "The damned thing works you so well that you may even consider leaving halfway through, for fear you'll have a heart attack."
    },
    {
      "text": "a well made horror film that can't be taken seriously. Oddly, while it's a much better effort than the director's last, \"Insidious\" was more genuinely eerie."
    },
    {
      "text": "A trim, effective haunted-house spook show, \"The Conjuring\" is both a throwback to early-'70s real estate shriekers like \"The Amityville Horror\" and a big-studio response to the \"Paranormal Activity\" found-footage genre."
    },
    {
      "text": "Creepily effective...the cinematic equivalent of a well-constructed spooky carnival attraction."
    },
    {
      "text": "Horror buffs will find [it] a highly satisfying, well-crafted film in a classical mode, with plenty of scares and very little gore."
    },
    {
      "text": "The poster for The Conjuring boasts \"from the director of Saw and Insidious\", which was a much wiser choice than \"from the writers of The Reaping\"."
    },
    {
      "text": "Like a game of spot the cliche."
    },
    {
      "text": "James Wan's haunted-house saga is well-crafted, convincingly acted, surprisingly restrained and scary as hell."
    },
    {
      "text": "...a truly creepy exercise. You may not believe in haunted houses, but you will while watching the movie."
    },
    {
      "text": "As an exercise in classical scare tactics, delivered through an escalating series of primo setpieces, The Conjuring is often supremely effective."
    },
    {
      "text": "If I was to use a single word to describe The Conjuring, it would be \"intense.\""
    },
    {
      "text": "Wan masterfully tightens the vise on the audience's nerves, using mood and sound effects for shocks that never feel cheap (the harmless kids' game of hide-and-clap has never been so bloodcurdling)."
    },
    {
      "text": "The Conjuring gets under your skin, where the goosebumps are."
    },
    {
      "text": "\"The Conjuring\" wants Dan and Lorraine to seem like Indiana Jones-style hunters of the supernatural, but in this basic jolt-provider, they're as fascinating as the Jersey Devil."
    },
    {
      "text": "Delivers a steady stream of fist-clenching suspense and well-choreographed surprises."
    },
    {
      "text": "Could it be director James Wan was just a little too reverential? Because just when we couldn't need a chill down the spine more, this carefully made horror story delivers way too late in the game."
    },
    {
      "text": "James Wan proves himself to be moving quickly up the ranks of terror auteurs. The timing, pacing and character movement are outstanding. And it's scary as hell."
    },
    {
      "text": "The Conjuring is an unusually sturdy piece of haunted-house genre filmmaking."
    },
    {
      "text": "Any hints of a smarter agenda serve to cloud the main one: \"The Conjuring\" has been engineered to freak you out."
    },
    {
      "text": "A horror thriller that's silly yet scary enough to give you second thoughts if anyone suggests playing Hide 'n' Clap."
    },
    {
      "text": "It calls to mind films that understood that the less you saw, the spooker it got..It's as scary a film as I've seen in a long time."
    },
    {
      "text": "Working with cinematographer John R. Leonetti and editor Kirk Morri, Wan carefully crafts each setpiece so that each visual punch has maximum impact to a nerve-shredding musical soundtrack from composer Joseph Bihara."
    },
    {
      "text": "It's not one of these one-note horror flicks hoping to make you jump; this KNOWS how scary it is and will get you by the end."
    },
    {
      "text": "An \"Amityville Horror\" for a new century (and a far better movie than that 1979 hit), yet firmly rooted, without being slavish or self-conscious, in the visual language of 1970s filmmaking."
    },
    {
      "text": "I'm not the horror lover in Schmoes Know, but \"The Conjuring\" isn't just a great horror film, it's a great time at the movies."
    },
    {
      "text": "It takes a retro-fashioned winner like The Conjuring to remind us that if the creaky, old house ain't broke, don't fix it."
    },
    {
      "text": "So it could be a better horror movie. Big deal. Scary movies don't get much better than this."
    },
    {
      "text": "Haunted-house tales don't come more imitative than The Conjuring, which doesn't emulate demonic-infestation and possession tales like The Amityville Horror and The Exorcist so much as operate as a veritable compendium of their myriad tropes."
    },
    {
      "text": "Boasting a stellar cast, a robust story and consistently energetic direction, The Conjuring is a true old fashioned ghost story, and a damn fine one at that."
    },
    {
      "text": "Damned if director James Wan, the auteur of Saw's rusted-edge cruelty, isn't an ace with enjoyable spookhouse trap-springing."
    },
    {
      "text": "\"The Conjuring\" backs up its creaking floor and slamming door tropes with episodes of all-out terror to send its audience to bed with a worrisome feeling in the pit of their stomachs."
    },
    {
      "text": "The most spine-tingling exorcist flick since, well, since The Exorcist!"
    },
    {
      "text": "Loaded with nightmarish scenarios and an exceptional amount of character development. It's more than just a good scare; it's a truly thoughtful and all-consuming experience."
    },
    {
      "text": "Though The Conjuring claims to be based on a true story, in truth it's based on every horror film that's come before it."
    },
    {
      "text": "Australian-trained director James Wan...continues to exhibit growth as a filmmaker with a keen eye for genre scares; if he can hone his ear to weeding out tinny dialogue, he will likely make a great film one day."
    },
    {
      "text": "All the contorting girls and pea-soup vomit in the world can hardly compete with a blood-stained sheet and a well-placed doll."
    },
    {
      "text": "Thoughtful where its competition is glib, featuring substantive and relatable characters, and steadily-paced where most feel lackadaisical, Wan has made a truly great movie. And I'm only talking about the parts that I saw from between my fingers."
    },
    {
      "text": "You've seen it before, you'll see it again."
    },
    {
      "text": "Taut and effective edge-of-the-seat horror, delivered with style and an especially haunting performance by Vera Farmiga."
    },
    {
      "text": "While The Conjuring is incredibly well made there's little we haven't seen before."
    },
    {
      "text": "Just a good old-fashioned scare, if you get scared by that sort of thing."
    },
    {
      "text": "A sensationally entertaining old-school freakout and one of the smartest, most viscerally effective thrillers in recent memory."
    },
    {
      "text": "The Conjuring is a masterclass in absolute terror that's destined to become a classic within the genre."
    },
    {
      "text": "The Conjuring doesn't try to reinvent the tropes of horror movies, whether it's ghosts or demons or exorcisms, but Fred Astaire didn't invent tap-dancing, either."
    },
    {
      "text": "[The Conjuring] will have the hair on your arms standing straight up, and your brain screaming in excitement!"
    },
    {
      "text": "Rattling the nerves while drawing out its palpable sense of dread, \"The Conjuring\" is a proudly old-fashioned horror movie that tells its story with sophistication and care."
    },
    {
      "text": "... it is confident, it is beautifully acted, and when it gets serious about being scary, it is remarkably tense and terrifying."
    }
  ],
  "release_year": 2013,
  "duration": 111,
  "genres": [
    "Horror",
    "Mystery & Thriller"
  ],
  "age_rating": "R",
  "synopsis": "In 1970, paranormal investigators and demonologists Lorraine (Vera Farmiga) and Ed (Patrick Wilson) Warren are summoned to the home of Carolyn (Lili Taylor) and Roger (Ron Livingston) Perron. The Perrons and their five daughters have recently moved into a secluded farmhouse, where a supernatural presence has made itself known. Though the manifestations are relatively benign at first, events soon escalate in horrifying fashion, especially after the Warrens discover the house's macabre history.",
  "popularity": 8.3,
  "poster_url": "https://image.tmdb.org/t/p/original/wVYREutTvI2tmxr6ujrHT704wGF.jpg"
}