{
  "movie_name": "The Princess Bride",
  "movie_id": "princess_bride",
  "total_reviews": 72,
  "reviews": [
    {
      "text": "What’s unacceptable about this threadbare fantasy is its contemporary irrelevance. Reiner and Goldman betray the instructional tradition that fables and legends pass on."
    },
    {
      "text": "a charming and utterly disarming swashbuckling fairy tale that is also a smart, funny satire of swashbuckling fairy tales"
    },
    {
      "text": "... there is no bad version of \"The Princess Bride.\" There is only what you take away from it."
    },
    {
      "text": "The Princess Bride weaves several genres together and remains a classic film to this day."
    },
    {
      "text": "Few films have ever walked the thin line between earnestness and irony so flawlessly."
    },
    {
      "text": "The film was always wonderful, featuring clever conceits plus perfect looking cast members and locations."
    },
    {
      "text": "As the picture practically spoofs the endeavors of Douglas Fairbanks and Errol Flynn, it's also competent enough to craft its own identity as a swashbuckling thriller."
    },
    {
      "text": "Its well-developed characters and situations take us back to the literary myths of the genre as well as the language of classic cinema. [Full Review in Spanish]"
    },
    {
      "text": "It is, in short, CINEMA that makes CINEMA great. [Full Review in Spanish]"
    },
    {
      "text": "Princess Bride is very much a parody of the very nostalgic culture it was replicating and celebrating"
    },
    {
      "text": "The cult of The Princess Bride is still strong 32 years after its release."
    },
    {
      "text": "Everything about The Princess Bride is ... charming. By far, the film's dialogue is its most enduring legacy."
    },
    {
      "text": "...a lavish studio spectacle..."
    },
    {
      "text": "One of the all-time great fantasy movies, channelling both a rollicking spirit of adventure and genuinely uplifting humour all ages can appreciate."
    },
    {
      "text": "A film that's for just about everyone and anyone that can appreciate good storytelling, a classic romance, riveting action, and genuinely funny comedy."
    },
    {
      "text": "Mandy Patinkin, an actor not known for humor, is particularly wonderful as Inigo, a Spaniard out to avenge the death of his father at the hands..."
    },
    {
      "text": "It manages to be both tongue-in-cheek and achingly sincere."
    },
    {
      "text": "The Princess Bride is a worthy descendant to the Fractured Fairytales of yore. The characters -- both real and imaginary -- give every frame of The Princess Bride its own magic mirth."
    },
    {
      "text": "It's an adventure which reaches back to golden-age Hollywood and the devil-may-care world of Douglas Fairbanks or Tyrone Power playing Zorro, or Errol Flynn playing Robin Hood."
    },
    {
      "text": "The Princess Bride easily transcends expectations, as a fantasy that has a few pertinent things to say about the genre, including the odd fact that the heroes of such things are often prettier than the heroines."
    },
    {
      "text": "A unqualified success that blends New York wit with timeless storytelling; a risky piece of filmaking that never feels so."
    },
    {
      "text": "...it's ultimately not difficult to see why The Princess Bride has become something of a classic in the years since its 1987 release."
    },
    {
      "text": "...somehow spoofs the conventions of fantasy romance without teetering into irony."
    },
    {
      "text": "As you watch this enchanting fantasy, feel free to be thrilled or to giggle, as you wish."
    },
    {
      "text": "In spirit The Princess Bride recalls The Neverending Story, which also was about a contemporary boy`s fantastic adventure. Reiner's film is likely to please adults more than kids and to last in memory more than most films this fall."
    },
    {
      "text": "Patinkin, the most dazzling movie swordsman since Errol Flynn, steals the movie with his athletic grace and delivery of lines like: \"My name is Inigo Montoya! Prepare to die!\""
    },
    {
      "text": "Mandy Patinkin, as Inigo Montoya, deserves special mention. Inigo is the one character in the film who contains real emotional depth, and Patinkin plumbs it."
    },
    {
      "text": "Patinkin's performance is especially touching. He can say, \"My name is Inigo Montoya. You killed my father. Prepare to die\" -- and make you laugh, cry and cheer at the same time. The movie, two hours of pure enchantment, has the same effect."
    },
    {
      "text": "For parents who have felt as if they were approaching the Cliffs of Insanity while enduring the inanities of standard kiddie pictures, The Princess Bride may be a godsend."
    },
    {
      "text": "It's as good as you remember."
    },
    {
      "text": "Heroic fantasies, we often feel, should be lighter than air, hot as dragon fire, fast as a sword in sunlight. And that's mostly what we get from the delightful The Princess Bride -- along with some bracing humor and foolery."
    },
    {
      "text": "Action and laughs blend deliciously in this fairy-tale spoof about true lovers who must defeat all sorts of villains to reach true happiness."
    },
    {
      "text": "The film works well enough, providing its fair share of laughs and thrills, and in technical terms it is by far Reiner`s most professional job of direction."
    },
    {
      "text": "An unexpected delight for all the family."
    },
    {
      "text": "Shall we re-wind and give it another spin? As you wish..."
    },
    {
      "text": "A witty, even clever-clever, exercise in deconstructing fairytales that became something of a cult with fans of its ironic/comic charms."
    },
    {
      "text": "Witty, winsome fairy tale for the whole family."
    },
    {
      "text": "An inordinately smart and sly motion picture, one that has enough simple pleasures to succeed as one of the better popcorn movies of its decade."
    },
    {
      "text": "There is so much to latch onto in this movie, so much for each member of a family that watches it together to love."
    },
    {
      "text": "A film of remarkable forwardness, honesty, and humor, built, like all fairy tales, around one message, summed up late in the script: \"True love is the greatest thing in the world.\""
    },
    {
      "text": "One of Reiner's most entertaining films, effective as a swashbuckling epic, romantic fable, and satire of these genres."
    },
    {
      "text": "One of the hottest cult videos of the 1980s, and a family classic besides, enjoyed by new generations of youngsters as well as their parents."
    },
    {
      "text": "Based on William Goldman's novel, this is a post-modern fairy tale that challenges and affirms the conventions of a genre that may not be flexible enough to support such horseplay."
    },
    {
      "text": "Rob Reiner's friendly 1987 fairy-tale adventure delicately mines the irony inherent in its make-believe without ever undermining the effectiveness of the fantasy."
    },
    {
      "text": "The Princess Bride defies categorization; it's a unique, magical movie that deservedly became a cult favorite and instant classic."
    },
    {
      "text": "The leads are vacuous; the absurdities sometimes forced and obvious."
    },
    {
      "text": "One of the Top films of the 1980s - if not, of all time. A treasure of a film that you'll want to watch again and again"
    },
    {
      "text": "An effective comedy, an interesting bedtime tale, and one of the greatest date rentals of all time."
    },
    {
      "text": "One of those rare satiric gems, like The Court Jester and Galaxy Quest, that doesn't just send up a genre, but honors it at the same time."
    },
    {
      "text": "A seminal cult classic the exact appeal of which has always eluded me, though most of the world seems to adore it."
    },
    {
      "text": "The lesson it most effectively demonstrates is that cinema has the power to turn you into a kid again. As we wish."
    },
    {
      "text": "Cute at the time, better as soundbites now."
    },
    {
      "text": "Superb comedy/fantasy/adventure"
    },
    {
      "text": "One of the best movies ever. Beautiful fantasy full of adventure and romance."
    },
    {
      "text": "Rob Reiner brings new life to the fairy tale as rousing entertainment for young and old alike."
    },
    {
      "text": "Since its release more than 15 years ago, The Princess Bride has often been copied, but never equaled."
    },
    {
      "text": "This material might easily have lent itself to broad parody or become too cute for its own good. But Mr. Reiner presents it as a bedtime story, pure and simple."
    },
    {
      "text": "[A] whimsical, comedic fairy tale."
    },
    {
      "text": "'As you wish' may be gaining on 'we'll always have Paris' as the single most romantic line ever."
    },
    {
      "text": "This witty modern fairy tale by William Goldman is resoundingly satisfying."
    },
    {
      "text": "Films truly made for the entire family don't get any better than this."
    },
    {
      "text": "Storybook perfection."
    },
    {
      "text": "Go watch the film again, right now, ten times, as penace."
    },
    {
      "text": "Children can see it as a bright, frothy adventure while adults will appreciate the subtlety and the sheer wit."
    },
    {
      "text": "Occasionally a bit too clever for its own good, but it's all so cheerful and has so many ingenious set-pieces that you can forgive it any excess."
    },
    {
      "text": "It takes talent to appeal to both young and old. The Princess Bride does just that."
    },
    {
      "text": "It's a lively, fun-loving, but nevertheless epic look at the nature of true love."
    },
    {
      "text": "Bride achieves much more than most film comedies."
    },
    {
      "text": "All I can say is this is the most fun you will have in a film for quite a while."
    },
    {
      "text": "It is filled with good-hearted fun."
    },
    {
      "text": "Any movie that can convince you that Andre the Giant should have been an actor instead of a wrestler is an \"A\" in my book."
    },
    {
      "text": "Post-modernist fairy tale. There is no other way to describe this genuinely funny (and fun) comedy."
    }
  ],
  "release_year": 1987,
  "duration": 98,
  "genres": [
    "Kids & Family",
    "Adventure",
    "Comedy"
  ],
  "synopsis": "A fairy tale adventure about a beautiful young woman and her one true love. He must find her after a long separation and save her. They must battle the evils of the mythical kingdom of Florin to be reunited with each other. Based on the William Goldman novel \"The Princess Bride\" which earned its own loyal audience.",
  "popularity": 9.4,
  "poster_url": "https://image.tmdb.org/t/p/original/kTXxdNv44najTayFcrT487xWuDv.jpg"
}