{
  "movie_name": "The Big Lebowski",
  "movie_id": "the_big_lebowski",
  "total_reviews": 190,
  "reviews": [
    {
      "text": "It’s just one of the most original films ever made, perhaps the best world the Coens imagined and the one filled with its best characters."
    },
    {
      "text": "The Big Lebowski is at once utterly inconsequential and a blow for a cinematic slacker aesthetic."
    },
    {
      "text": "Bridge's thespian mastery, via the slacker zeitgeist of our time, converts The Dude's funniest lines into a readily-understood language of everyday desperation. This ultimately begat the religion of Dudeism. Which makes 'Lebowski' an important movie."
    },
    {
      "text": "25 years later, the movie where every detail matters and doesn’t matter at all, is as hilarious as ever – and more poignant, man."
    },
    {
      "text": "The Coen Brothers introduced the world to The Dude, Jesus, Walter, Maude, and a fantasia of burnt-out ex-hippie in a Raymond Chandler plot. (25th anniversary)"
    },
    {
      "text": "The Dude becomes an aspirational figure, chill in the face of increasing absurdity, and ever able to express himself in perfectly quotable ways."
    },
    {
      "text": "With their inspired, absurdist taste for weird, peculiar Americana, the Coens have defined and mastered their own bizarre subgenre. No one does it like them and, it almost goes without saying, no one does it better."
    },
    {
      "text": "Leave it to Joel and Ethan Coen to wake up a drowsy movie genre with a bucket of ice water, a giant alarm clock and a fistful of No-Doz. The Big Lebowski... injects a mammoth syringe of adrenaline lunacy directly into the overdosed heart of film noir."
    },
    {
      "text": "In American movies, the Coens are the reigning eccentric poets of the loser class. Who else could get away with quoting Theodore Herzl in a bowling alley?"
    },
    {
      "text": "A hilarious pop-culture hash. The Big Lebowski is the best movie ever set mostly in a bowling alley."
    },
    {
      "text": "A likably off-balance, screwball comedy mystery that cruises along so smoothly, and so quickly, you've got to pay attention. That's because Bridges' towering performance may divert your eye from the keen details."
    },
    {
      "text": "The Big Lebowski doesn't have [Fargo's] wholeness, but it does have absolutely perfect moments -- quirky details, darkly funny dialogue, indelible small parts."
    },
    {
      "text": "If The Big Lebowski’s L.A. lights seem a little dim in the long shadow of Fargo, the movie invites you just to step out of the darkness and laugh."
    },
    {
      "text": "The Stranger sums it up best in the self-serving epilogue: \"It was a purty good story, dontcha think? Made me laugh to beat the band... Parts, anyway.\""
    },
    {
      "text": "Even when they don't achieve the glorious farce of a Fargo, there is always something fascinating about following the Coens' rapt gaze as they peer into the American nut bowl."
    },
    {
      "text": "The Big Lebowski is probably the worst movie the Coen brothers have ever made. Which, given their track record and the other movies out there, doesn't necessarily mean it's all that bad. Still, \"Lebowski\" is something of a letdown."
    },
    {
      "text": "Make no mistake: If Fargo came this close to machining out your weird-o-meter, The Big Lebowski will probably nudge you over the edge, then stand back and laugh as you splatter on the rocks below."
    },
    {
      "text": "The most original and blithely astonishing comedy to blaze across the screen since Raising Arizona."
    },
    {
      "text": "The burden of being Hollywood's hippest filmmakers looks to be weighing heavily on the Coen brothers. After Fargo, \"Lebowski\" is a return to the overly manner film-nerd humor of The Hudsucker Proxy."
    },
    {
      "text": "It is a funny picture, in both the ha-ha and peculiar senses. And if it is not as fully fledged as Raising Arizona and Fargo, this is because the Coen Brothers set such high standards for their edgy comedies."
    },
    {
      "text": "It seems designed to push a lot of the people who went for Fargo back out of the theater, while assuring those who remain that they're part of an elite if strange movie cult."
    },
    {
      "text": "At the center of all this is Bridges, an absolute standout if the term didn't seem a little inappropriate to this slouching performance."
    },
    {
      "text": "For a film supposedly celebrating the pleasures of passivity, The Big Lebowski is a remarkably energetic affair, consistently funny and served up in incandescent images by Roger Deakins."
    },
    {
      "text": "The Big Lebowski is shallow and empty and horrendously profane -- and about as much fun as you can have legally."
    },
    {
      "text": "With The Big Lebowski, the Coens return to their Hudsucker Proxy ways, and despite Jeff Bridges' ability to humanize the cast, this anxiously awaited Fargo follow-up falls victim to the dreaded style-over-substance virus."
    },
    {
      "text": "If its scattershot nature precludes the resonances of the Coens' big three films, it nevertheless is loaded with evanescent fun and a few consistently amusing characters."
    },
    {
      "text": "The redoubtable Jeff Bridges is admirably deadpan as the amiable Dude, and John Goodman rarely has been so effectively employed on screen."
    },
    {
      "text": "The Coens ladle on their usual attention to detail, off-kilter characters, dazzling visuals and hip dialogue, while underlaying a subtle theme about friendship and being a man. Their best since Barton Fink."
    },
    {
      "text": "This is the coolest, funniest, most out-of-control movie of the year, a great big Lebowski of a thing that stops making a lot of sense halfway in, but never, ever stops being entertaining and outrageous."
    },
    {
      "text": "\"Lebowski\" is, as it turns out, a comedy, yet Joel and Ethan Coen, so adept at sneering at the shortcomings of others, have failed to put anything funny in the movie."
    },
    {
      "text": "The Big Lebowski is an outrageously funny film. Nothing is sacred, and the Coens hold nothing back."
    },
    {
      "text": "Bridges completely gets the Coens and what they are going for, or in this case, what they are avoiding. They may be the only filmmakers in the world who would consider hearing The Big Lebowski described as a waste of time as a compliment."
    },
    {
      "text": "Move over, Hudsucker Proxy, here comes The Big Lebowski."
    },
    {
      "text": "It's a tired idea, and it produces an episodic, unstrung film."
    },
    {
      "text": "All of this is more or less entertaining if only because of the slack-jawed performance of Jeff Bridges as the Dude. His portrayal of a man who is content with his total lack of ambition is really quite good."
    },
    {
      "text": "The Big Lebowski is, simply put, the sort of stylized lark that would land most other filmmakers in the gutter (or the asylum) for good. But on the Coen brothers, it looks good."
    },
    {
      "text": "Fans (myself included) may cackle at absurd situations and in-jokes. But director Joel and producer Ethan, who write together, have never made so much clamorous ado about nothing."
    },
    {
      "text": "It's a fun film but, like the White Russians Bridges downs, it provides a buzz without offering any nutrition."
    },
    {
      "text": "Jeff Bridges has so much dedication as an actor that he sacrifices himself to the Coen brothers’ self-defeating conception. Even Bridges can’t open up a character who remains unconscious."
    },
    {
      "text": "The Big Lebowski is worth seeing for Jeff Bridges’ towering performance alone."
    },
    {
      "text": "Bridges, Goodman and Buscemi are so good together as the bowling zeroes that they paper over the film's many cracks."
    },
    {
      "text": "The film's cheerful good nature scores palpable hits along the way, finely acted by a cast including some of the Coens' regulars. John Goodman is bulldozingly good as The Dude's sidekick."
    },
    {
      "text": "The Big Lebowski may be the most original comedy to come down the pike in many a year, or the Coen brothers may be playing an Emperor's-New-Clothes type of game to see how long they can snooker the audience."
    },
    {
      "text": "This is the first time that the Coen Brothers have tied one of their films to a specific year, and it's heartening to see them engaging with the real world without relinquishing their grasp on fantasy."
    },
    {
      "text": "Just sit back and enjoy it, dude -- maybe life isn't supposed to make sense."
    },
    {
      "text": "It takes a largely undocumented chunk of reality and twists it into a surreal comic film noir wonderland, full of delightfully bent characters and darkly hilarious set-pieces, gasser performances, great lines and right-on portraiture."
    },
    {
      "text": "Presumably the brothers just wanted to have a little fun after the grandeur and gravitas of Fargo... But The Big Lebowski winds up crushing the audience under the constant pressure of its own vapidity, invective and volume level."
    },
    {
      "text": "The Big Lebowski's story pales in comparison to its characters. Rather than watching the film in anticipation of its next entertaining setup, we look to the characters for some relief from the story's gutter balls."
    },
    {
      "text": "Unfortunately, though, Bridges does not do much for The Dude, unlike William Hurt as a somewhat similar type in The Big Chill. He is all hair and very little else as he pilots his rust mobile about L.A."
    },
    {
      "text": "The Coens have always mixed a mean verbal-visual cocktail, and \"Lebowski\" reminds us that choice moments need not make perfect sense."
    },
    {
      "text": "Where Fargo was cool and wryly detached, the zany new film is aggressively antic -- more like parts of their Barton Fink or The Hudsucker Proxy. On occasion, in fact, the Coens' anything-goes approach can begin to get on your nerves."
    },
    {
      "text": "It would be hard to think of another leading man (Nick Nolte comes to mind) who would be so willing to dumb down, so good at it and yet so capable of making his character someone whom we might actually care about."
    },
    {
      "text": "It's nearly impossible to convey the unadulterated fun to be had watching this movie. Its pleasures may be evanescent, but sometimes those are the best kind."
    },
    {
      "text": "There are those who will find this no more than the Coens playing clever with an odd assortment of characters and Hollywood homage spoofs. Yet what they are actually playing with is cinema itself."
    },
    {
      "text": "There are hilarious bits strewn throughout, and a deft set of performances... But there also are more comic misfires, more uninspired gags and meaningless camera tricks than the Coens have accounted for in all their previous films combined."
    },
    {
      "text": "After the sharpness and coherence of Fargo, this film seems less a focused narrative than a freewheeling goof on movie conventions. However, even when they're not fully on their game, the Coens seem incapable of being boring."
    },
    {
      "text": "Do these enormously talented filmmakers show a moral failing?... I think they do. Their sin is pride. The Coens have reached a stage where they no longer question their ideas or flesh them out."
    },
    {
      "text": "The Coens have created a character study masquerading as a mystery. But the whodunit proves as substantial as a case of the munchies."
    },
    {
      "text": "It's as if the Coens have finally given up trying to prove that they're smarter than the movies -- or at least smarter than everyone else making movies. As a consequence, \"Lebowski\" is... The closest they've ventured toward likability."
    },
    {
      "text": "Yes, it's different. Yes, it's odd. Yes, it's got some laughs. For all those \"yeses,\" though, it eventually adds up to an overly busy \"no.\""
    },
    {
      "text": "Sometimes the archness of the performances kills the jokes. Sometimes the joke itself falls flat. But there is something endearing about a film so cavalier about making sense and so fearless about treading on feelings."
    },
    {
      "text": "The latest, gruesome effort from Joel and Ethan Coen is surely one of the least bearable films of 1998. Suddenly, the dubious facets that were kept under control in their previous films march to the foreground and obliterate all else."
    },
    {
      "text": "Sadly, I suspect this patchwork of outrageous comedy, sex, violence, and bad language will restore the Brothers to minority interest."
    },
    {
      "text": "In the wake of the wonderful Fargo, Joel and Ethan Coen have made a delightfully quirky comedy comparable to their second feature, Raising Arizona."
    },
    {
      "text": "Bridges gives the Dude a textured fuzziness that wins the film its biggest laughs and imparts a second-to-second emotional authenticity to its jumbled, showoffy action. He's precisely what those aesthetic wiseacres the Coen brothers need."
    },
    {
      "text": "I think that Joel and Ethan Coen have the sharpest ears in the business. This time, though, they have let their fondness for pastiche run off with them to the extent that they’re pastiching themselves."
    },
    {
      "text": "A letdown, another comedy that's strange for the sake of being strange. This one's a riff on detective movies. It has nothing to say but does take a long time to say it."
    },
    {
      "text": "The Big Lebowski is everything you might expect from the highly original Coen brothers. The talented cast look as though they’ve had the time of their lives as they go with the flow in a movie that bops along with one of the soundtracks of the year."
    },
    {
      "text": "It's a bunch of ideas shoveled into a bag and allowed to spill out at random. The film is infuriating, and will win no prizes. But it does have some terrific jokes."
    },
    {
      "text": "The very pointlessness of the story will annoy some viewers -- this is a revolving door of amusing characters, but the lack of crisp narrative drive makes it fun in a vacuum. Still, the characters are worth the price of a ticket alone."
    },
    {
      "text": "Every Coen Brothers movie has its share of goofball touches, but The Big Lebowski is all touches and no coherence. It may roll a few strikes, but the story is a big gutter ball."
    },
    {
      "text": "You're into this not so much for the plot but for the kicks and L.A. ambiance."
    },
    {
      "text": "The Coens' characteristic quirkiness, kept in check when they're at their masterful best (as in Fargo and Miller's Crossing), here goes way out of control."
    },
    {
      "text": "The mix of dated attitudes, weird locations and dopey humor is elevated by the usual Coen brothers inventiveness. Still, not up to Fargo standards."
    },
    {
      "text": "What makes The Big Lebowski great is the sheer insanity of its drive. The disconnected parts come together as a hilarious whole, cemented by Bridges' loopy, stuck-in-the-'70s performance."
    },
    {
      "text": "Credit the Coens and Bridges, one of our best actors, that all obvious Cheech-and-Chongness is blithely skirted and a certain daffy grace achieved. Even if \"Lebowski\" is finally a minor movie, Bridges is, without question, a major Dude."
    },
    {
      "text": "The movie itself seems stoned... The Coens have always had a weakness for making us laugh at everything in the name of nothing. When you try to pin down what The Big Lebowski is actually saying, you're told that you're actually missing the point."
    },
    {
      "text": "The entire cast jumps headfirst into this strained frivolity, acting as willing accomplices to this intermittently amusing, but ultimately pointless, diversion. The problem is with the Coens' jointly written script, which gets lost in its own tangents."
    },
    {
      "text": "One big, goofy, self-indulgent joke. The Coens' sense of humor has always contained a healthy streak of disdain, and this time that disdain is aimed squarely at the audience. They're not out to entertain the viewer; they're out to entertain themselves."
    },
    {
      "text": "Raymond Chandler meets Cheech and Chong in the Coen brothers' The Big Lebowski, the funniest spin on the detective film in years."
    },
    {
      "text": "Forget Fargo, the Coen Bros. previous and much more linear work, and don't even bother trying to follow the money in this tumbleweed of a film noir crime caper."
    },
    {
      "text": "The colder you go into this joyously unpredictable film, the better. This is the sight and sound of the Coens letting their hair down, and you really shouldn't miss the party."
    },
    {
      "text": "A major disappointment from Fargo writer-directors Joel and Ethan Coen... The film is being billed as comedy with bowling scenes, but it doesn't hold a candle to 1996's bowling comedy, Kingpin."
    },
    {
      "text": "You can't not enjoy watching Jeff Bridges drawl and ramble around..."
    },
    {
      "text": "...at once the most fun and the least fun of the Coen brothers' films."
    },
    {
      "text": "I do like the clever story telling. It keeps you guessing throughout. The script is tightly structured and there are some very memorable lines."
    },
    {
      "text": "What a great, silly movie."
    },
    {
      "text": "The dude abides. Jeff Bridges and John Goodman standout in the stoner comedy film to rule them all. [Full review in Spanish]"
    },
    {
      "text": "The dialogue is riddled with moody, witty cursing and unequalled wordplay - and all sorts of sarcastic nonsense."
    },
    {
      "text": "A frantic mish-mash of comedy, mystery, and cinematic trickery that, while it can be overwhelming at first glance, is one of the most unique and entertaining films in a generation."
    },
    {
      "text": "I could tell you how much I love this movie but that's just, like, my opinion, man."
    },
    {
      "text": "If The Dude is the representative figure of early 1990s America - a lazy white guy constantly breaking the law with impunity - it's no wonder his story remains relevant even now that the film is old enough to order its own White Russian."
    },
    {
      "text": "The comedy largely centers itself on Bridges, whose blissfully nonplussed reaction shots always provide a grounding effect for the rest of the movie."
    },
    {
      "text": "For those of you who forgot how good Bridges was in The Fisher King, here is a reminder. As the gung-ho Nam veteran, Goodman's tenacious, tightly coiled demeanor is smartly explosive and very funny."
    },
    {
      "text": "What made Fargo work, aside from the regional kitsch, was a solid story and believable characters worth caring about. The Big Lebowski has neither."
    },
    {
      "text": "The Big Lebowski is a dark, idiosyncratic and quirky comedy/crime caper-thriller involving an intriguing complex case of mistaken identity, deception, double-crosses, and a mysterious kidnapping. It came from the inventive, cultish..."
    },
    {
      "text": "\"The Big Lebowski\" is easy to love and rewarding to obsess over, but for me, it's more than just a fun movie to quote; it's a comforting memory generator, and when I watch it, if I squint, I can kind of see my dad again."
    },
    {
      "text": "Already a pessimistic take on the American Dream and the ideal of the self-made man, the model of the film-noir detective is ridiculed in The Big Lebowski."
    },
    {
      "text": "Lebowski's virtuosity serves a sense of modesty."
    },
    {
      "text": "One of a kind."
    },
    {
      "text": "If one were to examine the entire cinematic resume of the Coen Brothers, The Big Lebowskiwould assuredly rest within the top five spots."
    },
    {
      "text": "I'll just say this: The Big Lebowksi is an excellent movie - and damn funny."
    },
    {
      "text": "A return to form... where large men scream very loudly and jokes are pounded into the ground with vigor and brio. Goodman's Walter is a bullet-headed, barely contained titan of rage, running on the fumes of cracked beliefs and fierce garble-gabble."
    },
    {
      "text": "The Big Lebowski is a noir send-up, so call it L.A. Inconsequential."
    },
    {
      "text": "Hilarious, well-written, and well-performed by both Bridges and Goodman, The Big Lebowski blows other more recent slacker comedies out the water and proves that Bridges can do any role."
    },
    {
      "text": "It's like, you know, pretty groovy, man."
    },
    {
      "text": "[The Coens] rummaged through political and personal history for the underpinnings of this Los Angeles caper, from 1998, sending up, with rueful astonishment, the American way of war."
    },
    {
      "text": "On one hand, it has many layers, but on the other hand, it's just about a dude who wants his rug back."
    },
    {
      "text": "A very funny and twisted comedy..."
    },
    {
      "text": "Enormously entertaining!"
    },
    {
      "text": "...yet another in a long line of promising yet disappointing comedies from Joel and Ethan Coen..."
    },
    {
      "text": "One of the funniest, coolest, most absurd cult films ever made, and one of the best from the dynamic duo - Joel and Ethan Coen."
    },
    {
      "text": "It's essential."
    },
    {
      "text": "It's the whole proud, embarrassing sociopolitical, cultural heap of American history-and the American Century in particular-in two fleet, funny hours. [Blu-ray]"
    },
    {
      "text": "You'd never guess that the movie is loosely based on Raymond Chandler's detective novel \"The Big Sleep.\""
    },
    {
      "text": "I'm not a fan of the Coen Brothers, but this is an entertaining enough diversion."
    },
    {
      "text": "Strictly speaking, Joel and Ethan Coen's The Big Lebowski is an absurdist neo-noir film about mistaken identity. But there's no reason to be strict about this big sweet teddy bear of a comedy."
    },
    {
      "text": "A wild ride for adults only."
    },
    {
      "text": "To what do we owe the pleasure of the Coen Brothers' new joie de vivre and love for their fellow man?"
    },
    {
      "text": "Stylish and wickedly funny black comedy illuminated by a great performance from Jeff Bridges, and loaded with all the Coen brothers' trademark wit and flair."
    },
    {
      "text": "As with Raising Arizona, The Big Lebowski gives us a protagonist whose dopey innocence seems to be his only protection from the real world."
    },
    {
      "text": "If it's all supposed to be in fun, why does it feel so much like an insult?"
    },
    {
      "text": "Adds up to considerably less than the sum of its often scintillating parts."
    },
    {
      "text": "Bridges does more with his deflated body language than many comedians can manage by chewing the furniture."
    },
    {
      "text": "If nothing else, the Dude speaks for me when appraises the music of the Eagles."
    },
    {
      "text": "The result is a lot of laughs and a feeling of awe toward the craftsmanship involved. I doubt that there'll be anything else like it the rest of this year."
    },
    {
      "text": "Far from being shallow pastiche, it's actually about something: what it means to be a man, to be a friend, and to be a 'hero' for a particular time and place."
    },
    {
      "text": "This deliberately messay comedy stars Jeff Bridges as a slack-brained pothead, but the funniest turn is given by John Turturro."
    },
    {
      "text": "It's pretty much impossible not to love The Dude."
    },
    {
      "text": "It's the actors that make this film: without the perfect casting ... and without their perfect comic timing, it wouldn't work. But it does work, every minute."
    },
    {
      "text": "Joel and Ethan Cohen are in the midst of just such a golden streak right now."
    },
    {
      "text": "After seeing and enjoying Lebowksi at least four times over the years, I can plainly see why the movie freaks have embraced this off-kilter comedy so enthusiastically."
    },
    {
      "text": "In many ways, The Big Lebowski has surpassed Fargo as the Coens' high-water mark."
    },
    {
      "text": "The Big Lebowski may have a reputation for being the late night movie of choice for some burnouts, but it's much more than your average stoner film."
    },
    {
      "text": "Jeff Bridges as The Dude is stroke of casting genius."
    },
    {
      "text": "No, it's no Fargo. It's the most flamboyant, erratic, spontaneous movie the Coens have ever made."
    },
    {
      "text": "... a loving study of Los Angeles loserdom."
    },
    {
      "text": "Like meeting the Three Stooges after they've blasted their brains with mind-altering drugs, time-traveled into the 1990s and landed in a vintage bowling alley."
    },
    {
      "text": "The Big Lebowski has the desired effect: believing in the character, even without necessarily believing in the story. [Full Review in Spanish]"
    },
    {
      "text": "An indulgent spoof, Big Lebowski isn't a straight gutter ball, but it's no strike, either."
    },
    {
      "text": "This is a terrific movie."
    },
    {
      "text": "The Coen Brothers try really hard to be outrageously funny, and they succeed more often than they fail."
    },
    {
      "text": "Much of 'Lebowski' is amusing, some of it is downright hilarious and all of it is stylish, with plenty of the Coens' usual inventive shot composition and tricky camerawork."
    },
    {
      "text": "The Coen Brothers throw this film into the gutter, never developing what could have been a Strictly Ballroom-like spoof of the bowling world."
    },
    {
      "text": "A typical Coen brothers film is like no film you've ever seen."
    },
    {
      "text": "When you're having a down day, pop in THE BIG LEBOWSKI for a little pick-me-up, and always remember: The Dude Abides."
    },
    {
      "text": "This broad farce about mistaken identities would have worked much better if the filmmakers hadn't mistaken their own."
    },
    {
      "text": "Nimble, crackerjack entertainment with the crazed, anything-goes humor and the visual splendor we have come to expect in the best of the Coen Brothers' offerings."
    },
    {
      "text": "Loopy, unfathomable, profane and very funny."
    },
    {
      "text": "The 'Dude' is an absolutely fascinating character. [Full review in Portuguese]"
    },
    {
      "text": "One of the best comedies of the nineties, and the best film thus far from the Coen Brothers."
    },
    {
      "text": "By taking it easy, the Dude abides and becomes a spiritual teacher of crazy wisdom."
    },
    {
      "text": "I'd probably hate all of this stuff if I didn't think the movie was so damn hilarious."
    },
    {
      "text": "It's the wealth of great characters and their insane dialogue that make this a memorable film."
    },
    {
      "text": "Like a good Caucasian, Joel and Ethan Coen's L.A.-based crime-caper-comedy is an acquired taste, but potentially addictive once you take to its perfectly offbeat blend of seemingly disparate elements."
    },
    {
      "text": "As tempting as it is to completely dismiss The Big Lebowski, it's hard to do because the Coens are able to create wickedly funny eccentrics and possess the ability to energize certain actors to inhabit them completely."
    },
    {
      "text": "There is no satisfactory beginning, middle or end to it, but it does have its moments."
    },
    {
      "text": "This plot need not be taken too seriously. Watching it amble along is enough of a treat, since the Coens populate this story with oddballs and bowling balls of such comic variety."
    },
    {
      "text": "To be sure, The Big Lebowski is packed with show-offy filmmaking and as a result is pretty entertaining. But insofar as it represents a moral position, it’s an elitist one."
    },
    {
      "text": "This is a film that has great visuals and has genuine laugh-out- loud humor."
    },
    {
      "text": "Bad news for those in search of accessible comedy; good news, as always, for those who work at finding oddball flourishes and well-disguised social commentary."
    },
    {
      "text": "Outrageously fun."
    },
    {
      "text": "The movie is more fascinating than funny, one you're more likely to discuss afterwards that laugh at while it is playing."
    },
    {
      "text": "I wish the Coens the best, but they're going to have to do better than this. I know they can."
    },
    {
      "text": "It's best just to accept The Big Lebowski on its own anything-goes terms."
    },
    {
      "text": "Viewers with a taste for bizarre, even surreal, humor will have a ball."
    },
    {
      "text": "Although there are plenty of laughs to be had, what ultimately makes this film feel like a minor effort is the lack of the tightly coiled (albeit noticeably bent) internal logic that governed the duo's previous efforts."
    },
    {
      "text": "Inside the minds of Joel and Ethan Coen is a wonderfully weird place."
    },
    {
      "text": "The Big Lebowski is a mess. But what a glorious, wonderfully-entertaining mess it is."
    },
    {
      "text": "It sounds like another precious Coen brothers gimmick, but in Bridges' hands it becomes a hysterical running joke."
    },
    {
      "text": "This time, they have all the parts together, but someone forgot the glue."
    },
    {
      "text": "This movie seems to me almost a mishmash of the worst bits that were left out of previous Coen Brothers outings."
    },
    {
      "text": "There are bits of brilliance here as in all Coen Brothers movies. Just not enough of them."
    },
    {
      "text": "It may not be Fargo, but you'll be swept away by the sheer nonsensical, farcical wonder of it all."
    },
    {
      "text": "Since The Big Lebowski doesn't have an idea in its head, it has to fill the empty space with 'witty' conceits."
    },
    {
      "text": "This uneven screwball comedy -- a disjointed and half-hearted attempt by the Coen brothers to return to the Raising Arizona style -- is bound to underwhelm even their most fervent admirers."
    },
    {
      "text": "There are more ideas here, more wacko side characters and plot curlicues than the film can support, and inevitably it deflates from having to shoulder so much."
    },
    {
      "text": "Leave it to the Coen brothers to use a man urinating on a rug as the catalyst for an entire film's events."
    },
    {
      "text": "It never really bored me at any point, but at the same time, it never really excited me either."
    },
    {
      "text": "A film that may be instantly forgettable but should keep you grinning for a couple of hours."
    },
    {
      "text": "It's weirdly engaging, like its hero."
    },
    {
      "text": "In a perfect world all movies would be made by the Coen brothers."
    },
    {
      "text": "Not that The Big Lebowski is without its charms, but, like its central character, it is occasionally aimless and incoherent."
    },
    {
      "text": "Some viewers have criticized the movie for being too much of a shaggy dog story, lacking a cohesive point or purpose. Yet to look for the point is to miss it entirely. Coen-heads hop aboard for the ride."
    },
    {
      "text": "The comedy here is sometimes so sharp that you could roll in the aisle with laughter and not seem any odder than the characters you see onscreen."
    },
    {
      "text": "A genial spoof about life on the unhinged margins of L.A. that's a lot more carefully constructed than it pretends to be."
    },
    {
      "text": "The Big Lebowski doesn't always bowl strikes. But in this wacky comedy, even the gutter balls are funny."
    },
    {
      "text": "The Big Lebowski is not what it seems but rather a clever allegory about how two singular filmmakers have kept at bay the Hollywoodization of their talents. They've stuck with their quirky, derelict-trailer-park sensibility instead of moving up to Malibu."
    },
    {
      "text": "Outstanding acting, writing, direction and photography all combine to make this a great comic success."
    },
    {
      "text": "Nearly everything in The Big Lebowski is a put-on, and all that leaves you with is the Coens' bizarrely over-deliberate, almost Teutonic form of rib nudging."
    }
  ],
  "release_year": 1998,
  "duration": 117,
  "genres": [
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "Jeff Bridges plays Jeff Lebowski who insists on being called \"the Dude,\" a laid-back, easygoing burnout who happens to have the same name as a millionaire whose wife owes a lot of dangerous people a whole bunch of money -- resulting in the Dude having his rug soiled, sending him spiraling into the Los Angeles underworld.",
  "popularity": 9.3,
  "poster_url": "https://image.tmdb.org/t/p/original/9mprbw31MGdd66LR0AQKoDMoFRv.jpg"
}