{
  "movie_name": "The Godfather",
  "movie_id": "the_godfather",
  "total_reviews": 144,
  "reviews": [
    {
      "text": "Coppola was able to take a trashy pulp novel and turn it into something close to Shakespeare; a sweeping, epic tale of family, crime, corruption and the Immigrant experience in America."
    },
    {
      "text": "This is not only grand entertainment, but an emotional and intellectual experience to rival any in cinema."
    },
    {
      "text": "The Godfather remains a powerful film that explores intricate themes that appear to contradict, but Coppola's storytelling ties it together."
    },
    {
      "text": "This magnificent multigenerational mafia drama represents a benchmark not just in crime movies but in American cinema as a whole."
    },
    {
      "text": "The Godfather works like a masterfully conducted orchestra, whose immaculate symphony is a meticulously crafted and extraordinarily integral thread in the fabric of cinema history."
    },
    {
      "text": "... Villains and criminals that fulfill the American dream with complete disregard for the American way. A contradiction that engenders gods. [Full review in Spanish]"
    },
    {
      "text": "Now half a century old, Francis Ford Coppola's revered New Hollywood masterpiece has one of the best-known final shots in film history - but it almost had a much more Catholic ending."
    },
    {
      "text": "A cultural milestone."
    },
    {
      "text": "The Godfather is as much about America, and the American experience, as any other great movie is (50th anniversary)"
    },
    {
      "text": "Skepticism of American exceptionalism is far more commonplace now than it was when The Godfather was first released. But the fragility of the American Dream was revealing itself as the illusion it had always truly been."
    },
    {
      "text": "The Godfather films have set home-video standards for decades, and that trend continues with Paramounts astonishing 4K restorations."
    },
    {
      "text": "50 years after its release on March 24, 1972, The Godfather is now and forever, one of the greats."
    },
    {
      "text": "An engrossing metaphor for American capitalism, watching the film on the big screen emphasises the majesty of Coppolas work."
    },
    {
      "text": "It is a gangster film without any of the pity and hatred we might feel towards such aliens in our midst, because it recognises that in all of us there is the ignition towards power and criminality."
    },
    {
      "text": "The Godfather justifies every minute of its extravagant running time."
    },
    {
      "text": "For all its graphic violence, the movie was—unlike the novel it was based on—no mere exercise in popcorn sensationalism; it was emotionally complex, tragic, melancholy, definitely for grownups."
    },
    {
      "text": "As the doomy burnish of Gordon Willis’s photography captures the darkened souls of the Corleones, the effect is flat-out mesmeric."
    },
    {
      "text": "The Godfather is the most memorable, most influential, most quoted, most beloved, most discussed, most imitated, most revered and most entertaining American movie ever made."
    },
    {
      "text": "Five decades later, The Godfather still resonates with the paradigm shifts from one generation to the next, still influences one filmmaker after another, and continues to be the foundation of a lasting mythology."
    },
    {
      "text": "The Godfather is a rarity in film as every element off and on screen work here."
    },
    {
      "text": "There is simply not a character introduced or exchange of words or looks that doesn't inform or add."
    },
    {
      "text": "The Godfather redefined concepts of Mob movies by standing out artistically, and that comes partly from its distinct look, as deep browns and blacks contrast with light and golden tints reminiscent of Caravaggio...violence and beauty indelibly combine."
    },
    {
      "text": "The Godfather shows that there is still life in the massive production engineering which made Hollywood studios the wonder of the entertainment world in their great days."
    },
    {
      "text": "The intimate camerawork, highlighted by closeups and staging actors as if in a void, creates a sinister edge to every scene."
    },
    {
      "text": "The supporting cast is a marvel, including Diane Keaton as Pacino's bewildered fiancee, Robert Duvall as Brando's second-in-command, James Caan as Pacino's headstrong brother, [and] Al Martino in a role patterned after Frank Sinatra."
    },
    {
      "text": "Despite Brando's limited screen time, his presence overpowers the film. Yet it's Pacino's performance, as the idealistic war hero turned ruthless crime lord that takes on new meaning the second time around."
    },
    {
      "text": "Maybe the secret of Brando's power is that he, like maybe a handful of others, understands fully what stillness and repose and tentativeness mean in terms of impact on film."
    },
    {
      "text": "A three-hour film that thunders by like it was only 90 minutes. Truly, a milestone film."
    },
    {
      "text": "The Godfather becomes an instant classic among the superflicks."
    },
    {
      "text": "The effective mingling of innocence and corruption here raises this moving, adult film above the level of the ordinary gangland thriller. Its three hours of well-acted, well-written and fascinating drama constitute an original and intriguing film."
    },
    {
      "text": "It's an exceptionally good comeback for Brando, who's never really been that far away, in a movie that is now tender, now shockingly violent and often pleasing to the eye."
    },
    {
      "text": "The Godfather is one of those very few pictures that we'd like to see go on and on and on -- like the line at the boxoffice."
    },
    {
      "text": "It is quite amazing how faithful the film really is. Almost all of the characters and situations looked on film just like I'd imagined they would when I read the novel. That's something I've never experienced before."
    },
    {
      "text": "Coppola has also been highly successful in re-creating the period of his film. The clothes, the cars, the billboards, the thousand little items which contribute to an overall visual impact are without detectable flaw."
    },
    {
      "text": "Practically everything has been done right in this version of Mario Puzo's best-selling novel about the Mafia. The picture hews to a strong narrative line that keeps an audience looking forward eagerly to what will happen next."
    },
    {
      "text": "In the large and near-perfect cast, Robert Duvall stands out for his fine portrayal of the Corleones' attorney."
    },
    {
      "text": "One of the beauties of the film is the balanced characterizations. Supercool Al Pacino is likewise chillingly believable, and so are several other gangsters, most of them actors whose names are unfamiliar."
    },
    {
      "text": "This is an exciting movie, brilliantly well made. It tells its story mainly through action, but it never makes you feel too much is happening too fast."
    },
    {
      "text": "The Godfather runs a full-bodied 175 minutes, but fear not, you'll be mesmerized for every one of those minutes."
    },
    {
      "text": "The Godfather is an absorbing, intriguing film for anybody who can stomach the violence that churns through nearly all of its three hours on the screen."
    },
    {
      "text": "Even though in point of footage it is not the major role, Brando dominates the film and the shadow of his inflexible power pervades those many sections of the film when other characters are examined."
    },
    {
      "text": "Al Pacino does an excellent job as Michael, making the transition from a man unsophisticated in the ways of gangland violence to one capable of ordering his brother-in-law's death without batting an eye. He chills the blood."
    },
    {
      "text": "The Godfather is an epic gangster movie adapted from the raw materials of Mario Puzo's best-seller about the Mafia and probably the best of its kind ever made."
    },
    {
      "text": "In sum, The Godfather is blessed with top production values, is certain to be a powerhouse boxoffice draw, spotlights a terrific performance by Pacino... and brings Brando back to his plateau of excellence."
    },
    {
      "text": "The Godfather, directed by Francis Ford Coppola, is one of the best films in recent years. It ranks with Patton, for which Coppola wrote the screen play. Each is on the top shelf as a work of art and as a masterpiece of entertainment."
    },
    {
      "text": "It's a bloody good story, or a good bloody story and you can't take that away from it. Puzo's book hasn't half its artifice and style."
    },
    {
      "text": "[Coppola] has fashioned a fine, glossily packaged piece of computerised entertainment, never less than smooth and occasionally (the sequence with the Godfather menaced in an uncannily deserted hospital) almost brilliant."
    },
    {
      "text": "An overblown, pretentious, slow, and ultimately tedious three-hour quasi-epic."
    },
    {
      "text": "It is a film everyone will want to see, and few find disappointing. But try to forget all the ballyhoo before you see it, just in case."
    },
    {
      "text": "What is nicest of all is that an entertainment film like The Godfather should turn out as interesting and as funny and as moving and even as violent -- and as entertaining -- as it did."
    },
    {
      "text": "Brando's total authority and the skill with which he masters every nuance of the aging process, linger in the mind long after the savagery is forgotten."
    },
    {
      "text": "Francis Ford Coppola's three-hour film is undoubtedly effective in its genre, a superior gangland epic. But that is all."
    },
    {
      "text": "The Godfather is one of those rare films which works on just about every level. It it is entertainment: it is art. Superficially exciting with a strong narrative sense and rapid-fire yet consistent action, it is also provocative and deeply disturbing."
    },
    {
      "text": "The performances in the film are very strong but I was particularly impressed by a young Al Pacino as Michael Corleone."
    },
    {
      "text": "The film version of Mario Puzo's The Godfather, is a sickening masterpiece. It's the gangster movie come of age. It's a magnificently constructed chronicle of the Mafia and its families."
    },
    {
      "text": "A searing, beautifully shot deconstruction of the American Dream in all its ugliness and corruption, directed with a vision, class and grace few have equalled before or since."
    },
    {
      "text": "Francis Ford Coppola's Oscar-winning film, The Godfather, remains an epic masterpiece and one of the greatest cinematic achievements."
    },
    {
      "text": "A solid piece of enduring entertainment that deserves every bit of its extensive, celebrated reputation."
    },
    {
      "text": "An exemplar of every aspect of the filmmaker's craft."
    },
    {
      "text": "One of the greatest movies of all time. Period."
    },
    {
      "text": "Without a doubt, one of the best films of all time. As far as crime drama/mobster genre goes, it starts and ends with this masterpiece. Period. [Full review in Spanish]"
    },
    {
      "text": "Leaves you confused and dirty, yet fulfilled and satisfied, kind of like having great sex with someone you definitely shouldn't sleep with."
    },
    {
      "text": "For those who have already witnessed the rise and fall of the Corleone family, which mirrors the trajectory of the American dream, now is as good a time as ever to revisit. For those who haven't seen Coppola's mafia movies: brace yourselves."
    },
    {
      "text": "The Godfather is the most substantial and satisfying of all the mass entertainment films to come out of Hollywood in recent years."
    },
    {
      "text": "A consistent work that sporadically makes palpable the talent of Francis Ford Coppola. [Full Review in Spanish]"
    },
    {
      "text": "If ever there was a great example of how the best popular movies come out of a merger of commerce and art, \"The Godfather\" is it."
    },
    {
      "text": "Casting in these roles has been exceptional, particularly with Ai Pacino, a relative new comer as Michael. James Caan, too, deserves special mention, tor his role as Sonny... But the prime extra ingredient of the film is Brando."
    },
    {
      "text": "The movie is preposterously entertaining, telling Puzo's compendium of old-time Mafia anecdotes with all the gravity of Old Testament epic."
    },
    {
      "text": "Francis Ford Coppola's adaptation of Mario Puzo's bestseller remains the great American epic of the immigrant dream turned family business."
    },
    {
      "text": "I found that flogging about for three hours in that quagmire was spiritually debilitating and a crazy waste of time."
    },
    {
      "text": "This is a curious film. One comes to understand, even to condone, the activities of the Godfather and his clan."
    },
    {
      "text": "It is a long (three hours), often exciting and always well-directed film about the struggle for survival of one of the five Mafia 'families,' the Corleones, in late 1940s New York."
    },
    {
      "text": "Brando is the strong magnet that will draw fans to The Godfather. But behind-the-scenes creativity is of equal value to this film of towering proportions."
    },
    {
      "text": "I don't see how any gifted actor could have done less than Brando does here. His resident power, his sheer innate force, has rarely seemed weaker."
    },
    {
      "text": "... its amber antique look, its misty-eyed, soft-hearted vision of honorable men battling for their shot at the American main chance as much a part of our collective iconography as ... Citizen Kane or ... The Great Gatsby."
    },
    {
      "text": "The Godfather is overflowing with life, rich with all the grand emotions and vital juices of existence, up to and including blood."
    },
    {
      "text": "This elegiac organised-crime saga from the young Francis Ford Coppola is one of the all-time high watermarks of American cinema, rich with subtle acting and blessed with stunning cinematography from Gordon Willis."
    },
    {
      "text": "That lasting popularity isn't a fluke; the \"Godfather\" films stand the test of time because these aren't just movies, they're cultural touchstones."
    },
    {
      "text": "To permit us a glimpse at The Mob, with all of its ethnic insularity, is like giving a chronic gambler a chance to wander above the false mirrors that overlook every casino."
    },
    {
      "text": "An intellectual's daydream about revenge without remorse and power without accountability."
    },
    {
      "text": "It's hard to find a moment in the film that isn't great. The Godfather lives up to the term masterpiece."
    },
    {
      "text": "This compeling movie of mafia and family life is superb in every department, writing, acting, directing, a highlight of Coppola's career as well as of New American Cinema."
    },
    {
      "text": "Traces the arc of this doomed idealism with a beauty that is still fresh."
    },
    {
      "text": "Terrific performances and the perfect brooding atmosphere make it a truly outstanding work."
    },
    {
      "text": "Brando made Don Vito something we rarely see in movies: a tragicomic villain-hero, a vulnerable hood."
    },
    {
      "text": "In its blending of new depth with an old genre, it becomes that rarity, a mass entertainment that is also great movie art."
    },
    {
      "text": "The Godfather films remain so powerful, so ubiquitous, because in the Corleones we see the American Dream -- and in turn, ourselves."
    },
    {
      "text": "The classic tale of a Mafia family. Not for kids."
    },
    {
      "text": "With all due respect to this 1972 classic, Vizzini was right: Never go in against a Sicilian when death is on the line."
    },
    {
      "text": "As filmmaking and storytelling, 'The Godfather' remains a bravura piece of work, its set pieces, dialogue and performances entrenched cinematic icons."
    },
    {
      "text": "A measured, deathly serious epic."
    },
    {
      "text": "The greatest gangster film ever made."
    },
    {
      "text": "Don't miss an opportunity to see a classic such as this on the big screen."
    },
    {
      "text": "Like a favored method of Mafia influence, \"The Godfather\" is an offer no audience can refuse."
    },
    {
      "text": "With the themes of family and loyalty, this film is a must see for any movie fan."
    },
    {
      "text": "Coppola offers a rich and layered look at family and does so with an incredible cast and a meticulous amount of detail."
    },
    {
      "text": "Francis Ford Coppola's 1972 classic, The Godfather, is to gangster films what Cecil B. DeMille's The Ten Commandments was to super spectaculars."
    },
    {
      "text": "...it's the stellar cast's career-best work that ultimately assures the viewer's interest even through the film's less-than-enthralling stretches."
    },
    {
      "text": "...a metaphor for creating and protecting your own business in this country - only with the added glamour of guns."
    },
    {
      "text": "A multi-generational epic that never leaves the audience less than enthralled, this is the godfather of all gangster films."
    },
    {
      "text": "There are volumes that could be written -- and have been -- about the movie's uniformly powerful performances; its precedent-setting editing by William Reynolds and Peter Zinner; Nino Rota's haunting score; and Dean Tavoularis's evocative set design."
    },
    {
      "text": "The biggest achievement here is the establishment of mood and time."
    },
    {
      "text": "The ultimate family film."
    },
    {
      "text": "Not only one of the greatest mob films of all time, The Godfather is also one of the greatest overall pictures ever."
    },
    {
      "text": "Like Citizen Kane, The Godfather doesn't age."
    },
    {
      "text": "O primeiro ato da obra máxima do Cinema."
    },
    {
      "text": "An everyday story of Mafia folk, incorporating a severed horse's head in the bed and a number of heartwarming family occasions, as well as pointers on how not to behave in your local trattoria."
    },
    {
      "text": "How do you write a review about the greatest movie ever made?"
    },
    {
      "text": "Story-wise, there is so much going on that it would have been easy for a director to lose control, but Coppola (helped by a screenplay co-written by Puzo) keeps it all together beautifully."
    },
    {
      "text": "Not only the best of crime film, but all that is possible with cinematic achievement."
    },
    {
      "text": "It could be argued that Francis Ford Coppola's film of Mario Puzo's bestseller, at once an art movie and a commercial blockbuster, marked the dawn of the age of the mega-movie."
    },
    {
      "text": "One of those sublimely rare movies in which every element-casting, acting, directing, script, cinematography, score-comes together."
    },
    {
      "text": "The epic gangster film."
    },
    {
      "text": "Simply great, if not the greatest!"
    },
    {
      "text": "Is it really possible that this bears repeating? The Godfather is extraordinary."
    },
    {
      "text": "The Godfather is a landmark film in a number of ways."
    },
    {
      "text": "Francis Ford Coppola has made one of the most brutal and moving chronicles of American life ever designed within the limits of popular entertainment."
    },
    {
      "text": "The original is back on the big screen and it looks great."
    },
    {
      "text": "If you care for film at all, do yourself the great favor of getting out to that theater and immersing yourself in a genuine American classic."
    },
    {
      "text": "What more needs to be said? It's a grade-A, bona-fide Classic with a capital C."
    },
    {
      "text": "Aquel que no ha visto El Padrino no puede decir que ama al cine"
    },
    {
      "text": "Not to be missed."
    },
    {
      "text": "It engulfs us in the lives of a lot of despicable people, but it fails to repulse us."
    },
    {
      "text": "Heartbreakingly paradoxical: exquisite filmmaking, tragic self-annhiliation."
    },
    {
      "text": "The performances Coppola got out of these young actors are extraordinary. We understand their every glance, their every thought..."
    },
    {
      "text": "Coppola's masterpiece reveals something new every time you watch it."
    },
    {
      "text": "still a riveting piece of work, a true masterpiece of the American cinema"
    },
    {
      "text": "A classic in its own very right, Director Francis Ford Coppola brings us, the ultimate mob movie."
    },
    {
      "text": "All of the filmic arts - design, cinematography, editing, music - come together to forge what is, by any measure, one of the great movies of all time."
    },
    {
      "text": "Examining the meaning of family, violence, love, betrayal, and loyalty just to name a few, its quality set a standard that few films have matched."
    },
    {
      "text": "As scary as it is intelligent, as funny as it is touching, The Godfather is a prime example of the way cinema should be: excellent telling of complete stories."
    },
    {
      "text": "Over The Godfather's three-hour running time, the story of Michael's transformation from a 'civilian' in a mob family into its hard-nosed general never flags."
    },
    {
      "text": "The three-part gangster saga from Italian-American director Francis Ford Coppola is a superb trilogy of films"
    },
    {
      "text": "The story by Mario Puzo and Francis Ford Coppola is a brilliant conjuring act, inviting us to consider the Mafia entirely on its own terms."
    },
    {
      "text": "So many great roles and characters in this movie and then there's that eternally haunting Nino Rota score."
    },
    {
      "text": "In scene after scene ... Coppola crafted an enduring, undisputed masterpiece."
    },
    {
      "text": "The years have been kind to this timeless Mafia epic, which seems particularly rich now that studio blockbusters no longer demonstrate this kind of care with character, atmosphere and storytelling."
    },
    {
      "text": "While there have been changes from the novel, the film is both compelling and powerful."
    },
    {
      "text": "Unlike many of its imitators made during the 25 years since its release, The Godfather is a handbook on cinematic lucidity."
    },
    {
      "text": "We come to The Godfather like Kay Adams -- outsiders uncertain in our expectations - but it doesn't take long for us to be captivated by this intricate, violent world."
    },
    {
      "text": "One of the central American movies of the last 25 years,"
    },
    {
      "text": "Corleone, the soft-spoken crimelord, is masterfully played by Brando in one of the most imitated performances of all time."
    },
    {
      "text": "Coppola was signed to direct what was thought would be a pulp gangster film, but created one of the greatest epics ever."
    },
    {
      "text": "The story of this movie could have taken place everywhere in the world, and that explains why the people will associate with its characters for many decades to come."
    }
  ],
  "release_year": 1972,
  "duration": 177,
  "genres": [
    "Crime",
    "Drama"
  ],
  "synopsis": "Widely regarded as one of the greatest films of all time, this mob drama, based on Mario Puzo's novel of the same name, focuses on the powerful Italian-American crime family of Don Vito Corleone (Marlon Brando). When the don's youngest son, Michael (Al Pacino), reluctantly joins the Mafia, he becomes involved in the inevitable cycle of violence and betrayal. Although Michael tries to maintain a normal relationship with his wife, Kay (Diane Keaton), he is drawn deeper into the family business.",
  "popularity": 9.8,
  "poster_url": "https://image.tmdb.org/t/p/original/3bhkrj58Vtu7enYsRolD1fZdja1.jpg"
}