{
  "movie_name": "The Irishman",
  "movie_id": "the_irishman",
  "total_reviews": 466,
  "reviews": [
    {
      "text": "Martin Scorsese's new film, starring De Niro, Pacino and Pesci, is as much about friendship and the passing of time as it is a thriller."
    },
    {
      "text": "At its core, The Irishman is a tale on betrayal, violence, and the sacrificing of moral principles, with slithers of regret traced into it all."
    },
    {
      "text": "It’s hard to believe a film about mob mentality and scandal can be a strong candidate for themes of doubt and remorse, but Martin Scorsese has done it with grace and perfection."
    },
    {
      "text": "This is not a blatant retread of films like Taxi Driver and The Gangs of New York. The film has shots or sequences that mirror those films, but it brings something new to the table from a thematic or technical standpoint."
    },
    {
      "text": "The Irishman has the same Scorsese beats we have come to love but moves to a noticeably staggered rhythm in it's device of storytelling, laboured performances and reluctance to commit to the brutal energy of Goodfellas."
    },
    {
      "text": "The Irishman tests patience with its runtime and less effective storytelling on a second watch. CGI de-aging distracts, yet Scorsese's touch shines in cinematography."
    },
    {
      "text": "One of the most important characteristics of the gangster genre is that we access the story through the point of view of the protagonist, in this case Frank Sheeran, who, is an immigrant. Through the narrative resource of the first person..."
    },
    {
      "text": "Loyalty can’t exist without betrayal, and Scorsese explores that dichotomy with surprising empathy. When Hoffa refuses to accommodate the will of the mafia, he triggers a Steinbeckian tragedy on par with Of Mice and Men."
    },
    {
      "text": "It is a personal view for an aging man who feels guilty for his betrayal and pays a hefty price..."
    },
    {
      "text": "Even though [The Irishman is] extremely long, the way in which it depicts the themes of brotherhood and loyalty is superb."
    },
    {
      "text": "A genuine testament of art of making cinema as art. [Full review in Spanish]"
    },
    {
      "text": "We’re watching characters decay over five decades (though many don’t live long enough to have that option) in just under three and a half hours, and I don’t know who wouldn’t be moved by that."
    },
    {
      "text": "In a lot of ways, this film is the antithesis to “Goodfellas”, a eulogy to the gangster genre the same way “Unforgiven” was a eulogy to the western genre."
    },
    {
      "text": "An All American epic that gains its import from its accumulation of seconds and minutes and years -- those tracking shots turned to myth, and we, a country of endless highways stretched end to end, always ending somewhere, on some face"
    },
    {
      "text": "My obsession with Scorsese and this genre might not be healthy anymore. To the point where I found every minute of this movie interesting. The mob epic this director wanted to give us, throwing homages to the cinema that made him. [Full review in Spanish]"
    },
    {
      "text": "Scorsese’s maturity and range as a storyteller is sure handed throughout. There isn’t a single misplaced camera angle, or, despite the film’s long length, a throwaway take."
    },
    {
      "text": "The Irishman is Scorsese’s Gangster Epic: A big, grand, ambitious rags to riches mob tale that blurs the lines between loyalty, friendship, and business. It might be the quickest 209-minutes in the history of cinema. Joe Pesci, welcome back."
    },
    {
      "text": "You could say “The Irishman” is above all things a tragedy. Underneath its veneer of wise guy tradition and violence lies the story of a man facing the music for his embrace of mob life and neglect of his family."
    },
    {
      "text": "The best comparison one could make to The Irishman is David Lean's similarly epic-sized Lawrence of Arabia (1962), a biography that examines its subject for four hours before conceding to its unknowability."
    },
    {
      "text": "The Irishman gives its audience so many emotions and is poignant, funny, violent, and beautiful. It is a modern-day mobster masterpiece from a master of his craft."
    },
    {
      "text": "A towering achievement in storytelling not just cinema."
    },
    {
      "text": "Irishman represents, with its somber and mournful mood, what may be Scorsese's farewell to the sort of gangster tales that largely made his reputation."
    },
    {
      "text": "A wonderful three and a half hours... a very human story."
    },
    {
      "text": "The Irishman is grand and ambitious, asking unanswerable questions about legacy, sorrow, and death."
    },
    {
      "text": "A magnificently made film about the boredom of thug life."
    },
    {
      "text": "The director's 26th feature film is a meditative and classy offering. Hollywood's old cronies are still the real deal - magnetic, riveting and unique. Let's hope we see them again soon."
    },
    {
      "text": "While cinema is not to be restrained by reality, it is the double standard with which this film is judged that kept it at number 2 for me. Also, Joe Pesci makes it clear he is a national treasure."
    },
    {
      "text": "The Irishman is a rare gem - it's everything you hoped it would be in a world where hype often manages to dampen even excellent films."
    },
    {
      "text": "The Irishman is not only one of Martin Scorsese's best films (which is saying a lot), but also a tribute to all the crime movies in which its director has specialized (contributing masterpieces to this genre). [Full review in Spanish]"
    },
    {
      "text": "While perhaps a step below Scorsese's other classic films, mostly because of its length, The Irishman shows that the master filmmaker still knows how to deliver a crackerjack story."
    },
    {
      "text": "Scorsese has never been drawn to presenting actual history. ... The director has done little to add to the public's knowledge about Jimmy Hoffa or the degeneration of the American labor movement."
    },
    {
      "text": "The holy trinity, De Niro, Pesci and Pacino, hand in late career work that feels like the culmination of a lifetime of character studies."
    },
    {
      "text": "The Irishman looks inwards and acts as a sorrowful dismantling of one's own myth-making."
    },
    {
      "text": "Here is the most unpopular opinion of the year: The Irishman is too long, too contrived and, generally, too much Martin Scorsese trying to outdo himself."
    },
    {
      "text": "In a very real sense, Martin Scorsese is fighting against his own mythic legacy. In another way, of course, his return to the form in which he made some of the more compelling American cinema of the last five decades is a perfectly fitting closing coda."
    },
    {
      "text": "Scorsese makes movies that Scorsese likes, damned be anyone who doesn't care much for them. All of his stylistic touches are here, but there's a certain hollowness to the whole affair that's admirable even if not likeable."
    },
    {
      "text": "Little more than an excuse to get the band back together."
    },
    {
      "text": "Well, objectively, the film is kind of boring."
    },
    {
      "text": "I saw The Irishman in a huge theater on a giant screen, and I did not want to get up, didn't want it to end, and could have watched another hour of it if there was one."
    },
    {
      "text": "A film that seems like typical Scorsese until it doesn't seem like typical Scorsese anymore."
    },
    {
      "text": "Reiterating my love of Scorsese, it's his ability to experiment that makes him a compelling director. Every film he directs is worth the time, and The Irishman lives up to that billing."
    },
    {
      "text": "The Irishman is Scorsese working with what he knows best to express a new level of maturity, ruminating on the significance of legacy and what it means to live with the decisions that you have made along the way."
    },
    {
      "text": "A titanic, towering crime drama with a tangled narrative web to fit its epic runtime. It's pure cinema as only a maestro like Scorsese can deliver."
    },
    {
      "text": "It's an amazing film that caps off a stunning career in film that spans over 50 years."
    },
    {
      "text": "The great performances and incredible filmmaking make this fictionalized tale of Frank Sheeran a story to end the decade, one that has seen many changes within the film industry - and hopefully introducing a new era of Martin Scorsese."
    },
    {
      "text": "Zaillian follows Scorsese; Scorsese follows himself; they both follow Brandt, whose end goal is nothing if not ephemeral. The disconnect shouldn't work, but here it's the crux."
    },
    {
      "text": "A 3 1/2 hour epic that is in many ways the antithesis of \"Goodfellas,\" featuring many of Scorsese's auteur signatures but presented in a quiet, mournful tone asking if the gangster life was really worth it."
    },
    {
      "text": "A paradoxical, melancholic but thoughtful and engaging film, well directed by Scorsese."
    },
    {
      "text": "Scorsese rewards patience with a third act you won't forget. [Full review in Spanish]"
    },
    {
      "text": "The Irishman is not just a mob movie. It's an examination of aging, regret, and holding value in the things that really matter."
    },
    {
      "text": "I'm trying to hide the impact it has caused me. It's a monumental work on the decline of the American gangster. [Full review in Spanish]"
    },
    {
      "text": "Despite mediocre visual de-aging effects, and unnecessarily long run time, The Irishman is an impeccable tale of life, regrets, betrayal and friendship. I'd hardly call this a masterpiece for Scorsese but this felt like a film he could do in his sleep."
    },
    {
      "text": "The very definition of a late-period masterwork, this reckoning with a quarter-century of American corruption and damnation touches upon historical and fanciful milestones as if they were the stations of an inverted cross."
    },
    {
      "text": "Extraordinarily ambitious, dealing with the biggest questions: death, and the attempt to work it out. To watch this figuring-out is a devastating privilege and the film a monumental artistic achievement."
    },
    {
      "text": "Surely only a filmmaker with plenty of life behind him - and plenty of such stories - could make a film so entertaining and yet so solemn and sad."
    },
    {
      "text": "Melancholy and poetic. Think of it as Scorsese's monumental gangster epic equivalent of the late Sergio Leone's nearly four-hour masterpiece of \"Once Upon a Time in America\" (1984)."
    },
    {
      "text": "Though it was somewhat overrated as a masterpiece of mobster cinema, Martin Scorsese's epic, occasionally funny, word-driven drama about the fate of union master Jimmy Hoffa is still a venerable, highly entertaining work"
    },
    {
      "text": "While it meanders at times, like the stories of many absentminded old men, it's rarely boring. Scorsese's longtime editor Thelma Schoonmaker -- a huge influence on the rhythms of his films -- remains a titan."
    },
    {
      "text": "One of Scorsese's masterworks."
    },
    {
      "text": "This is a magnificently wise, majestic, top-shelf work about the relentless passage of time and the fate awaiting us all, connected or not."
    },
    {
      "text": "\"The Irishman\" is to Martin Scorsese what \"Sandinista\" was to The Clash, a generous gift of art meant to entertain, inspire, and inform."
    },
    {
      "text": "Zaillian (and most likely Scorsese, in concert with his abiding editor Thelma Schoonmaker) structures The Irishman along three tracks of time that wind in and out of each other."
    },
    {
      "text": "Stephen Zaillian's script tells a mob story we've seen many times before."
    },
    {
      "text": "It didn't take a genius to see that television was finally poised to win the war against movies. I just didn't expect my teacher to be leading the charge against theatrical exhibition."
    },
    {
      "text": "Maybe somewhere along the way, over the course of careers as long as Frank Sheeran's and longer than I've been alive, these guys have earned their self-indulgence"
    },
    {
      "text": "Every act of violence in The Irishman is mournful, loaded with pathos."
    },
    {
      "text": "...This is a gargantuan piece of cinema that would be a fitting conclusion to the master filmmaker's career if he was ready to stop here."
    },
    {
      "text": "This movie gave me my most enjoyable three and a half hours by far."
    },
    {
      "text": "This is a well-made movie by a truly great director and the acting is fine, but the story seems kind of pointless. There is a lot of killing, a lot of suffering, and for what? On the other hand, maybe that is the point of it after all."
    },
    {
      "text": "Joe Pesci, Robert de Niro and Al Pacino... manage to create well-differentiated, memorable characterizations. [Full review in Spanish]"
    },
    {
      "text": "At its heart, it's a unique account of friendship, trust and betrayal between three men. But Scorsese, chasing his mob mania, can't resist involving more characters and vignettes than he can handle."
    },
    {
      "text": "Everyone involved in is working at the top of their craft."
    },
    {
      "text": "Features several stretches of brilliance but rarely focuses on the storylines and plot points I found the most interesting. I'm all for a slow burn and a long runtime but The Irishman puts that to the test in its final act."
    },
    {
      "text": "A very well done film. A film which allows you to witness Al Pacino, Robert De Niro and Joe Pesci chew up scenery together."
    },
    {
      "text": "With a script that is nothing short of a master work, coupled with an intricate sense of production design and cinematography style, there is a filmmaking language here that is unmistakably deliberate."
    },
    {
      "text": "One can't help luxuriate in the sordid Scorsesean splendour of it all. He's a masterful filmmaker, the poet laureate of the devil's bargain."
    },
    {
      "text": "transcends mob movie clichés and stereotypes by digging into the humanity of those who often do everything in their power to be inhumane"
    },
    {
      "text": "There's no question that Martin Scorsese's epic drama drags in places, but what is good in it is so good that it far outweighs the bad."
    },
    {
      "text": "All's well in The Irishman."
    },
    {
      "text": "The movie definitely makes an impact with its affecting tale, acclaimed cast, and ambitious scope."
    },
    {
      "text": "The Irishman is a much more deliberate and weighty gangster film - by comparison, Goodfellas is a riot. But it's a vibe that works in its gravitas."
    },
    {
      "text": "Nothing [Scorcese's] done in a long time has been as good as The Irishman."
    },
    {
      "text": "A film as much about aging and end-of-life regret as it is the mob."
    },
    {
      "text": "'The Irishman' is another reaffirmation that Scorsese is not replaceable. [Full review in Spanish]"
    },
    {
      "text": "It is definitely a Scorsese type A, but the lowest film in that category. [Full review in Spanish]"
    },
    {
      "text": "The director creates a fascinating and frightening world with its own heroes and villains and the rules that govern them both - rules that are exceedingly complex, unlike the fictional black-and-white and occasionally grey domain of superheroes."
    },
    {
      "text": "Does it give us a clearer insight into Scorsese's view of these films and the individuals in them? Most definitely, and for that if nothing else, it's worth its weight in gold."
    },
    {
      "text": "I feel like Scorsese's saying, \"I am never going back.\" There's one appropriate response, a devastating, absolute, \"yeah\"."
    },
    {
      "text": "Methodical, lyrical, and powerful, it earns every minute of its three-and-a-half hour running time."
    },
    {
      "text": "The Irishman is a violent yet poignant film about a man caught up in the only world he has ever known and the friendships and betrayals that went along with it."
    },
    {
      "text": "A three-and-a-half hour movie would usually drag, but I never felt that with this when you have a director and actors making every moment count."
    },
    {
      "text": "Instead of the flash-bang Casino clone that many people expected, Scorsese gave us a bleak, somber story about the inexorable rot created by corruption and violence."
    },
    {
      "text": "...still a treat for us to see these giants of cinema coming together to do their thing but the wear is beginning to show, even if the will is strong and the mind is still sharp. Adjust your expectations accordingly."
    },
    {
      "text": "Three hours of \"Godfather\" wannabe. Acting good as is scenery but the story is DOA."
    },
    {
      "text": "You got Al Pacino, Robert De Niro, and Joe Pesci in one movie... It's good to see them back again."
    },
    {
      "text": "Their dialogue is so authentic, so real, and the way that they just bounce off of each other in this hypnotizing but also unsynchronized sort of way, it's just fascinating."
    },
    {
      "text": "Scorsese and this mind-blowing cast are all about perfection."
    },
    {
      "text": "When the story sprawls, it's always in the direction of character development. De Niro is absolutely masterful."
    },
    {
      "text": "Martin Scorsese's \"The Irishman\" is a rich meditation on the legendary director's longtime obsessions: gangsters, violence, Catholicism, moral conflict and male friendship."
    },
    {
      "text": "But it's De Niro who lands the knockout punches here... De Niro's Sheeran is a shell of a man, whose empty gaze and remorseless duty-killings untether him from his very soul. It's a pitch perfect performance."
    },
    {
      "text": "The pièce de résistance is the remarkably mournful final act: an apt end point for Scorsese's career long interest in tales that detail the price that comes from a life of sin"
    },
    {
      "text": "The Irishman is larger in scale than anything [Martin Scorsese] ever done before, and it's stunning just how utterly captivating it is at every moment."
    },
    {
      "text": "It...forces us to reconsider a body of work that is far more expansive than it is often given credit for by changing the template of his previous mob films and foregrounding questions of aging both in its text and its production."
    },
    {
      "text": "The affecting, ruminative finale and the melancholic last scene leaves a metaphorical door ajar in our hearts, a deep hollow that's hard to fill..."
    },
    {
      "text": "I found the time length of the film adequate to convey the story line and time passes quickly when you become absorbed in the school of acting displayed before you."
    },
    {
      "text": "Despite its length, The Irishman is riveting. It confirms Scorsese as one of the great American filmmakers."
    },
    {
      "text": "It's as if the director was out to prove, once and for all, that he's the last member of the movie-brat generation who's still got it. And got it, he does."
    },
    {
      "text": "Frank Sheeran's empty, brutal life isn't the worst part of The Irishman; rather it's the adherence to a rotten system of power and complicity, all predicated on men dutifully obeying other men."
    },
    {
      "text": "Winding and anecdotal as The Irishman sometimes is, that last hour is up there with the best work Scorsese has done."
    },
    {
      "text": "All of these performances are amazing, but I would single out Pesci for special mention."
    },
    {
      "text": "A layered exploration of the passage of time and the roles small men play in the big moments of history. But the digital de-aging thing ... I dunno guys."
    },
    {
      "text": "The old masters at work here, including Scorsese and his longtime editor Thelma Schoonmaker, seem to disregard anything noisy or inessential and get to the point without fuss. \"The Irishman\" is reserved, though not repressed."
    },
    {
      "text": "It's about the lies we tell ourselves, our equivocations and delusions. So maybe Frank is making all this up too..."
    },
    {
      "text": "The Irishman is carried by numerous career-defining performances and Scorsese is incredibly still at the top of his game, with perhaps his most delicately crafted film yet."
    },
    {
      "text": "I admire the filmmaking here, and with three-and-a-half hours there's a lot of greatness in it."
    },
    {
      "text": "Producer/director Martin Scorsese's latest is an almost overwhelmingly epic drama that forms a pseudo-trilogy with his Good Fellas and Casino but is even bigger than those films, and so damn sour."
    },
    {
      "text": "A drama with three great performances which almost rise above the retread of a screenplay."
    },
    {
      "text": "This is a new and perhaps final journey for Scorsese, about not just mortality but the enormity of regret."
    },
    {
      "text": "Amid furious online debate over his comments about superhero movies, legendary director Martin Scorsese releases a movie so effortless in its genius that it should grant him carte blanche to say anything he wants about cinema."
    },
    {
      "text": "If The Irishman isn't quite the magnum opus one would expect or desire, it's still a solid motion picture."
    },
    {
      "text": "... like Scorsese trying to out-runtime Quentin Tarantino... the retreaded framework of 1995's Casino... plus two hours of indulgent padding."
    },
    {
      "text": "The film's overarching emotional aesthetic is its own awareness of the emptiness that feels inherent in its protagonist - we are moved by the profundity of absence and the unrewarding emptiness of his silence."
    },
    {
      "text": "Primarily, the film is an actor's showcase, with meaty arcs for De Niro, Pesci, Pacino, and others, with reigned-in direction that results in some surprisingly restrained performances. Pesci, in particular, is a revelation."
    },
    {
      "text": "Yes, the technology makes his face look less lined, a sophisticated computer version of what Hollywood used to do for aging actresses playing younger than their true age. But a 76-year-old with an unlined face still cannot pass for a 26-year-old."
    },
    {
      "text": "For all its tragedy, the story of The Irishman is told with love - a grudging but expansive love, one that neither condemns nor praises but rather looks deep inside each character to find a strangled humanity."
    },
    {
      "text": "This movie is a monument. A beautiful essay on old age, filmmaking and fiction by a grand american master. Mesmerizing and deeply moving. [Full review in Spanish]"
    },
    {
      "text": "Buried within the excess, it's a fantastic film. Is The Irishman really an hour better than Goodfellas?"
    },
    {
      "text": "A cinematic memento mori, \"The Irishman\" (aka \"I Heard You Paint Houses\") is one of Martin Scorsese's all-time greatest films."
    },
    {
      "text": "In a film packed with star turns, Joe Pesci absolutely runs away with the entire movie."
    },
    {
      "text": "This is not the best film of the year. It's not even the best Scorsese film of the 2010's (that would be The Wolf of Wall Street). That said, it's still a very good film."
    },
    {
      "text": "Scorsese doesn't disappoint, and neither do his three principals, each delivering some of the finest work of their respective careers."
    },
    {
      "text": "It is the banality of violence, the sense that Frank, and others like him, are just working men doing a job, that makes The Irishman so haunting, and that plays out the character's ultimate lack of emotional or spiritual redemption."
    },
    {
      "text": "You will need the breaks to keep up with this beautifully told story, performed with great delicacy, especially by De Niro."
    },
    {
      "text": "The Irishman sees everyone bringing their A game. The way the cast interacts is like music. Each seasoned player riffing off the other but never grandstanding. It is an acting masterclass."
    },
    {
      "text": "There are decisions made here that show Scorsese at his finest, most methodical, and I love it. It takes its time, such as the slow ticking of life, without avoiding the immeasurable weight of this story."
    },
    {
      "text": "The Irishman is one of the best films of the year...a meditation on morality and mortality, a look at what it means to live a good life and what it means to feel that life slipping away."
    },
    {
      "text": "It was engaging, thought-provoking, insightful, everyone in the movie did a great job."
    },
    {
      "text": "In The Irishman, Scorsese delivers a lucid and mature work that is as moving as it is spectacular. [Full Review in Spanish]"
    },
    {
      "text": "In Scorsese's masterful hands it becomes an American tragedy writ-large, a sweeping portrait of great potential cut down by greed and corruption, and a road to hell paved by the best of intentions."
    },
    {
      "text": "The characters are loyal to each other, and they love each other, as the men who interpret them. [Full review in Spanish]"
    },
    {
      "text": "The Irishman not only reveals what Scorsese was aching to convey all along, but also provides a new perception, a fresh meaning, to his previous work."
    },
    {
      "text": "It's incredible when something can live up to and surpass the hype-The Irishman is already a classic, instantly time-honored, and will pass through that slightly open door into the annals of great American cinema."
    },
    {
      "text": "The Irishman is a gangster film, true, but it's a gangster film in the sense that it's about gangsters, and a film about life's regrets by dint of being about [Frank] Sheeran, fated to die alone with no loved ones by his side."
    },
    {
      "text": "In assembling The Irishman's all-star cast to tell this epic gangster saga, [Martin] Scorsese crafts the most consistently enthralling and contemplative crime movie since Sergio Leone's Once Upon a Time in America."
    },
    {
      "text": "The beginning of the end and the beginning of his life in the mafia are united with a very elegant but tragic thread. Eisenstein at his finest, the Scorsese's expression. [Full Review in Spanish]"
    },
    {
      "text": "As a work of entertainment, it has enough drama and humor to keep viewers invested."
    },
    {
      "text": "In The Irishman, the master director has made his definitive, perhaps even final statement on the consequences of a life lived in violence."
    },
    {
      "text": "Only Martin Scorsese can make a 3.5-hour long mob film gripping, memorable, intense and features one of the best Robert De Niro performances ever."
    },
    {
      "text": "The runtime is irrelevant as The Irishman is that good - Scorsese has delivered a real marvel of a movie."
    },
    {
      "text": "Rest assured, you will want to set aside a whole evening for this - and then want to watch it again straight away."
    },
    {
      "text": "Coldly credible and captivating, showing cinematic masters at the top of their game"
    },
    {
      "text": "You might watch The Irishman on your TV, iPad, or smartphone. That viewing experience might not be what was originally intended. Look closer and regardless of the screen size and shape, you'll see a rarity in cinema-a masterpiece."
    },
    {
      "text": "In the final half hour the movie transmutes from a crime story to a requiem of sorts. This is a man of violence, looking back at the wreckage, looking ahead into the abyss and attempting some kind of reckoning."
    },
    {
      "text": "The Irishman is a true cinematic masterpiece. De Niro, Pacino, and Pesci bring out their best performances in years under the masterful directing eye of Martin Scorsese."
    },
    {
      "text": "Scorsese's complex portrait of Sheeran and organized crime make The Irishman one of the best films of 2019, and one of the best of his career."
    },
    {
      "text": "There are a lot of reasons to recommend this film, but the main ones can be summarised in surnames - Scorsese. De Niro. Pacino. Pesci."
    },
    {
      "text": "As monumental, and monumentally skilled, cinema, it's breath-taking ... {but} the biggest surprise was the amount of times the film made me laugh out loud. Once Jimmy Hoffa (Al Pacino) enters the story ... the Irishman is not afraid to boldly make a joke."
    },
    {
      "text": "Scorsese at his peak blending his controlled, moving camera seamlessly with subtle, nuanced character moments reminiscent of his earlier films. Everyone deserves an Oscar -- except those responsible for the distracting, failed de-aging technology."
    },
    {
      "text": "Scorsese called this film \"death-haunted\". It is also haunted by the myth of making America great again."
    },
    {
      "text": "A definitive statement by an artist of Scorsese's prominence is worth taking seriously even if it kind of feels exactly like the definitive statement that you'd predict."
    },
    {
      "text": "Pop open a non-alcoholic beverage, slice up some watermelons, and scoop out your favourite ice cream. Purchase a large television, invest in Netflix stock, and never, ever, lose your faith in Martin Scorsese."
    },
    {
      "text": "A human life in deep focus."
    },
    {
      "text": "De Niro is great as the blue-eyed Irishman Frank Sheeran, Al Pacino, in his over the top obnoxiousness, wasn't annoying as Jimmy Hoffa and all said, Joe Pesci steals the show as mob boss Russell Bufalino."
    },
    {
      "text": "It connects on a cellular level and a cinematic one, with Scorsese channeling the spirit of Clint Eastwood's \"Unforgiven,\" concluding an iconic portion of his career with a darkly introspective offering."
    },
    {
      "text": "...a cool, elegiac, and somewhat detached epic whose three and a half hours float by with a disconcerting calmness."
    },
    {
      "text": "A magnetic mob epic."
    },
    {
      "text": "When a great filmmaker is in charge, a character study can also become a social treatise; a comedy can discuss celebrity worship and a gangster movie can be a reflection on the sunset of life. [Full review in Portuguese]"
    },
    {
      "text": "The Irishman is a visual delight that makes it clear that good actors, those of high caliber, continue to reinvent themselves. [Full Review in Spanish]"
    },
    {
      "text": "The director makes an outstanding reconstruction of the facts in flashbacks. [Full review in Spanish]"
    },
    {
      "text": "At the zenith of his duties as a mafia killer, De Niro is brilliantly restrained. [Full review in Spanish]"
    },
    {
      "text": "The movie breathes like mobsters breathe in order to be a sort of lyrical poem about decay. [Full Review in Spanish]"
    },
    {
      "text": "Veracity aside, The Irishman is Scorsese at the peak of his powers. It's not a minute too long at three hours and 20 minutes..."
    },
    {
      "text": "With exceptional performances, deft direction, and exquisite writing, this is a film that will find its place in its own history. It's a masterpiece of filmmaking made possible only by the actors who have the experience and wisdom to do so."
    },
    {
      "text": "Aided by cinematographer Rodrigo Prieto's indelible, unfussy compositions and editor Thelma Schoonmaker's knack for juggling myriad aesthetic and narrative elements, Scorsese has crafted a fine, fine film..."
    },
    {
      "text": "The Irishman is another outstanding cinematic accomplishment from Scorsese, featuring a talented cast and crew firing on all cylinders."
    },
    {
      "text": "If De Niro, delivering his best performance in more than a decade, is the heart and soul of The Irishman, then Pacino is the undoubted scene-stealer."
    },
    {
      "text": "The Irishman will no doubt be revered as one of the greatest films ever produced about organized crime, and might very well be the definitive statement on the genre, because it's difficult to imagine anyone eclipsing what Scorsese has done here."
    },
    {
      "text": "There is much to talk about the superb performances of The Irishman. [Full Review in Spanish]"
    },
    {
      "text": "Scorsese's beautiful, sprawling, attempt to reckon with his own legacy, and a requiem for the power of American labor unions."
    },
    {
      "text": "Still, the film is beautifully edited, moving from a violent portrait of tough men into a character study of loneliness and old age - but never quite remorse."
    },
    {
      "text": "There's a strain of knowing wistfulness threaded throughout Martin Scorsese's The Irishman, a 210-minute crime colossus that, for all intents and purposes, accomplishes the cumulative emotional high of a swan song."
    },
    {
      "text": "Scorsese's grandiose epic reflects on the ephemeral nature of fame, money, power and life. DeNiro, Pacino and Pesci are at the top of their game. [Full Review in Spanish]"
    },
    {
      "text": "Scorsese's best effort in years, and the perfect epilogue for his previous films about the mafia. [Full review in Spanish]"
    },
    {
      "text": "In the end, the pacing is too ponderous and self-indulgent, the characters are too stagnant, and the story lacks an emotional punch"
    },
    {
      "text": "Here's a new Martin Scorsese masterpiece-another riveting gangster epic. [Full review in French]"
    },
    {
      "text": "It it will become the perfect smash fit to stream with snacks and bathroom breaks from the comfort of a living room, even if it deserves to be seen on a big screen."
    },
    {
      "text": "Thus the unassuming, obedient, conciliatory manner of DeNiro's performance plays beautifully against Pacino's knock-out turn as Hoffa."
    },
    {
      "text": "The Irishman stuns with its attention to detail - except for that one thing: the basic truth."
    },
    {
      "text": "The performances, as you might expect, are magnificent."
    },
    {
      "text": "Although it might feel familiar, The Irishman is unlike any of [Martin] Scorsese's other high-profile mobster pictures. It benefits from a deliberate pacing and less-violent approach in comparison to films like Goodfellas and Casino."
    },
    {
      "text": "A reflexive epilogue with which the filmmaker closes his cycle of movies that deal with organized crime in the US. [Full Review in Spanish]"
    },
    {
      "text": "The performances are excellent, and aside from an early exception, the aging transformations used for the film's principal characters - especially [Robert] De Niro - are fantastic."
    },
    {
      "text": "\"The Irishman\" is an exceptional film and the final 20-minute coda elevates the movie beyond a historical blow-by-blow of the life and times of Jimmy Hoffa to a meditation on the implications of a lifetime of violence."
    },
    {
      "text": "Scorsese here shows us in vivid detail the lasting fallout of destruction and violence, and he does so using a murderers' row of world-class performers."
    },
    {
      "text": "The last half hour is exceptional. [Full review in Spanish]"
    },
    {
      "text": "Handled cautiously and confidently by a pioneering troupe of filmmakers whose legacies were all bred from such mafiusu affairs, The Irishman greets the screen like an old, longed-for friend."
    },
    {
      "text": "It's fascinating to see how Scorsese revisits flourishes from his past films but with this sense of an old man's weariness. But it reflects the weariness and age of the character not of Scorsese as a filmmaker -- he is as vigorous as ever."
    },
    {
      "text": "Both fresh and reflective. It's an epic gangster film with a surprisingly poignant final kick."
    },
    {
      "text": "Now 77, a grandfather, married five times, Scorsese sees the struggle not as that of a man against himself, but as a man fighting against time."
    },
    {
      "text": "Scorsese's genius is to see the humanity we share with these fatally flawed people. Make no mistake, this is a brilliantly executed but profoundly sad movie."
    },
    {
      "text": "\"The Irishman\" is a thrilling theatrical experience with wonderful touches showcasing how masterful Scorsese is. Every aspect of the movie is crafted with precision."
    },
    {
      "text": "The result is a late-period masterpiece for Scorsese. A sterling cast, fascinating story and the use of de-aging CGI effects make the film a genuine, modern cinematic event."
    },
    {
      "text": "There are 209 minutes in \"The Irishman\" and not one of them is wasted."
    },
    {
      "text": "The movie's relationship with reality has little importance considering its stateliness and the incredible performances from De Niro, Pacino, and Pesci. [Full Review in Spanish]"
    },
    {
      "text": "Scorsese's longest, most expensive and most ambitious film ... stands as part of the mob pantheon simply by virtue of its existence."
    },
    {
      "text": "A powerful, mature and intelligent film that only Marty could ever make. [Full Review in Spanish]"
    },
    {
      "text": "[The Irishman] is perhaps the least flashy and most self-reflective crime flick in the filmmaker's oeuvre."
    },
    {
      "text": "Scorsese's latest Mafia piece is perfect. It encapsulates everything that made his previous work so crowd pleasing. Pacino, Pesci and De Niro are as good as ever."
    },
    {
      "text": "Martin Scorsese's much-anticipated The Irishman is a good movie. Not a great one."
    },
    {
      "text": "Scorsese manages to fashion a moving work that's empathetic and also boldly critical."
    },
    {
      "text": "This movie about the ashes of crime is Scorsese at his sharpest and most feeling."
    },
    {
      "text": "Scorsese uses references to integrate with his protagonist and offer us an expressive image of himself in old age. [Full Review in Spanish]"
    },
    {
      "text": "Even if \"The Irishman\" doesn't go by as quickly as you'd hope, it's still essential and necessary viewing, and not only complements the themes of the film, but Martin Scorsese's career as a whole."
    },
    {
      "text": "\"The Irishman,\" which I'd hoped would be his piece de resistance, his final say on what he had to say about the gangster genre that, with few exceptions, he pretty much owns, didn't do it for me."
    },
    {
      "text": "'The Irishman' is like a veteran rock 'n' roll band on a farewell tour performing its golden oldies. De Niro, Pacino and Pesci infuse the movie with a lifetime of experience in front and behind the camera."
    },
    {
      "text": "Sort of like the Forrest Gump of gangster movies. It tells a specific man's story but against the backdrop of a half-century of American history."
    },
    {
      "text": "A 3 1/2-hour travelogue of Scorsese's gangster filmography. There isn't really anything new, just riding over familiar themes he's tread on in other movies, over and over again. You appreciate the nostalgia tour, but in the end that's all it is."
    },
    {
      "text": "When a filmmaker at the height of his powers is given free rein to pursue his passions, the result can scarcely help but be a treat."
    },
    {
      "text": "3.5 hours of your life you will never get back."
    },
    {
      "text": "The Irishman accomplishes something that is rather difficult in contemporary cinema: to be epic and intimate, subtle and piercing showing the cost of hyper-violence in life. [Full Review in Spanish]"
    },
    {
      "text": "Part of Frank's inhumanity can be laid at the feet of the hugely distracting digital de-aging effect that was used to wind the clock back on Robert DeNiro's weathered visage."
    },
    {
      "text": "\"The Irishman\" will likely be the greatest American movie of 2019, once the dust settles - and, because of the Netflix connection and how Scorsese anticipates that, the most ground-breaking movie of the year."
    },
    {
      "text": "The Irishman shows us once again the enormous talent and sensibility that Martin Scorsese possesses, which he has been perfecting throughout the years to the point of creating such a complex and gratifying movie. [Full Review in Spanish]"
    },
    {
      "text": "...an ambitious and mostly successful triumph that more than makes up for Scorsese's last few misfires."
    },
    {
      "text": "Whether Sheeran was as prolific a triggerman as he admitted doesn't factor into [the film's] success because the honesty of his loneliness and regrets outshine the details."
    },
    {
      "text": "Ultimately, if The Irishman can be described in one way, it is Martin Scorsese overload. This movie is unabashed Scorsese and everything that implies. The legendary director is doing exactly what he wants, no ifs ands or buts about it."
    },
    {
      "text": "Whether seen on the big screen or a small one, The Irishman is among 2019's best motion pictures and should receive its share of Oscar attention in 2020."
    },
    {
      "text": "The end result is still stunning: A saga that's horrifying and funny and melancholy, sometimes in different scenes, sometimes all at once."
    },
    {
      "text": "This is a gritty, pitiless exposé that offers no absolution for its foot soldiers. Scorsese alerts you in the film's opening scene that things are going to be different this time around."
    },
    {
      "text": "\"The Irishman\" moves slowly and pensively, invests in the natural rhythm of conversations and stops to smell the roses."
    },
    {
      "text": "The way the plots are spun, taking into account the bulky footage, is very admirable [in the hands of Thelma Schoonmaker]. [Full review in Spanish]"
    },
    {
      "text": "We expect greatness, [and] greatness we've received. [Full review in Spanish]"
    },
    {
      "text": "In the way Scorsese handles Sheeran's story, he would likely be satisfied with this fate. It seems the same applies to the director. He's living by his own filmmaking code with honor and devotion to his craft."
    },
    {
      "text": "A long but richly textured, melancholy elegy about a way of life ostensibly based on comradeship but really founded on selfishness and violence."
    },
    {
      "text": "A sweeping crime-land epic from the noted director, it stands among his best work in years."
    },
    {
      "text": "Brief as a photograph: indelible as a memory. And indicative of the brutal suddenness of the hits to come: a friend walks up to you, a friend walks away from you, in the middle, that friend has put two bullets in the back of you."
    },
    {
      "text": "Yes, it's huge, sprawling and sometimes sloppy, but \"The Irishman\" is a treasure to be cherished."
    },
    {
      "text": "It may not be 'cinema,' depending where you see the Netflix original, but the auteur's latest is mostly worth the hype."
    },
    {
      "text": "'The Irishman' is a marvel to behold."
    },
    {
      "text": "Scorsese's opus glides effortlessly through recent history, contextualizing an era in which criminal and political enterprise were woven together by selfish men for whom violence was a practical means to an end, and consequences were an afterthought."
    },
    {
      "text": "The Irishman comes off as this longwinded geriatric fart with a smell that lingers in a room with no windows that you're trapped in for three and a half hours. All the mob hits in the world aren't going to get that smell out."
    },
    {
      "text": "Everything Scorcese has done with his The Irishman makes the film a true masterpiece. Believe the hype, buy into the buildup. It is that good."
    },
    {
      "text": "The most fiercely Catholic of movie auteurs twists the narrative knife by seducing us with sympathy for a monstrous mobster, then forcing us to later ask ourselves, what have we done?"
    },
    {
      "text": "A crowning achievement. The year's best film."
    },
    {
      "text": "A career capstone for its creators, summing up 40-odd years of movies about masculinity in crisis and the wages of sin."
    },
    {
      "text": "Not only do we get career-best performances from De Niro, Pesci, and Pacino, but we're also served a grim reminder of our own mortality, regardless of the life we've led."
    },
    {
      "text": "A masterful exercise in film about the passing of time, which is so difficult to capture. [Full Review in Spanish]"
    },
    {
      "text": "Everything from the color of the drapes to the way people eat cereal has been shaped; you can feel Scorsese's care."
    },
    {
      "text": "If this is the last film of Scorsese's career - though those odds are unlikely - The Irishman is a fitting culmination of a master's work."
    },
    {
      "text": "An instant classic. Only through a daughter's eyes can we see a father as the monster that he is. It's terrifying."
    },
    {
      "text": "A film about the XX mid-century story of the U.S.A. An artwork itself. A must. [Full Review in Spanish]"
    },
    {
      "text": "It's a long movie, but it's very much worth it."
    },
    {
      "text": "When it's at its best, the film is electric and totally consuming."
    },
    {
      "text": "Scorsese creates a memorable, gangster epic that will enthrall."
    },
    {
      "text": "Works on every possible level. And it's unbelievably moving."
    },
    {
      "text": "The director (Scorsese) adjusts with an already unusual precision what could be called his most calculated, geometric and even perfect masterpiece. [Full review in Spanish]"
    },
    {
      "text": "The new Scorsese's work squeezes each frame of its almost three and a half hours to put the viewer to do something to which contemporary Hollywood cinema increasingly refuses: to reflect. [Full review in Spanish]"
    },
    {
      "text": "...make sure you see this movie when and wherever you can...the size of the screen cannot possibly restrain the massive contribution to cinema that The Irishman makes."
    },
    {
      "text": "The whole saga - an American history lesson told wittily through the eyes of an amiable hitman strolling in the shadows of icons - grips and holds with fervor and sustained passion."
    },
    {
      "text": "It's the ultimate fusing of Scorsese's two sides... And even though it takes a while to get there, the movie is a masterpiece, one made by a man counting down his own years as if they were rosary beads."
    },
    {
      "text": "I loved that sense of fading time about The Irishman, which also has plenty of the expected ingredients: violence, bloodshed, and the gangster grit that Scorsese's moving cameras have been spreading across screens for years."
    },
    {
      "text": "It has the wisdom that can only come with advanced age, and that wisdom coexists with heartache."
    },
    {
      "text": "Epic in its timeline and intellectual scope, Scorsese has made something funereal and absurdly funny, one that appears in surprising dialogue with his career and place in the modern cinematic landscape."
    },
    {
      "text": "Scorsese, De Niro, Pacino and Pesci, all deliver big-time in this powerful and epic reunion of cinema legends. [Full review in Spanish]"
    },
    {
      "text": "With a script with a high level and an impeccable casting, we are facing an indispensable film. [Full review in Spanish]"
    },
    {
      "text": "\"The Irishman\" is long, to be sure, but it's never less than compelling - Scorsese, De Niro, Pacino and Pesci, all in their mid-to-late-70s, are each carrying a lifetime of work, with practiced ease."
    },
    {
      "text": "The Irishman has plenty of assassinations, long tracking shots, and pop music cues one would normally associate with vintage Scorsese, but its most wrenching moments are the ones of silence."
    },
    {
      "text": "\"The Irishman\" is cinema, of the highest order."
    },
    {
      "text": "As the credits scrolled across the screen, I couldn't help but think that The Irishman is it. The crew is old in the tooth. The world is a different place. And you might as well end it with The Irishman -- a triumph filled will splendor and sorrow."
    },
    {
      "text": "Relying on the elegant camera moves of Mexico's Rodrigo Prieto, the lovingly crafted film allows De Niro to run a greatest-hits reel of his mob characters, with hints of Raging Bull, minus the pathology."
    },
    {
      "text": "Scorsese knows how to wield humor, humanizing details, and digressions to keep the film lively....Of course, it helps to have three of the greatest actors of our time anchoring the proceedings."
    },
    {
      "text": "It's not going to blast you through the back of the theater... Instead, it's going to engender feelings of sadness and regret amid a renewed appreciation for the director's filmmaking and storytelling prowess."
    },
    {
      "text": "Scorcese has made a film brimming with quiet power and subtle tension."
    },
    {
      "text": "A curious self-homage. [Full review in Spanish]"
    },
    {
      "text": "The ol' goodfellas have still got it."
    },
    {
      "text": "Scorsese's film takes Sheeran's account at face value and uses it to create a telling critique of America's slow but ineluctable moral decline."
    },
    {
      "text": "Vitally, it feels like more than just the sum of its excellent parts."
    },
    {
      "text": "If Mean Streets was a firecracker tossed into the audience's lap and Goodfellas was a meteor burning up in its own heat, then The Irishman is a reminder that nothing is as dangerous as a fire you think has gone out."
    },
    {
      "text": "Since Coppola's \"The Godfather,\" these are the men who have shown us the underbelly of American organized crime. It's good this Hollywood royalty of pretend mobsters exposed it. But this will not happen again. A Hollywood, tour de force, mob swan song."
    },
    {
      "text": "For all its flash-back/flash-forward tricksiness, The Irishman rarely seems disjointed or thematically fractured."
    },
    {
      "text": "In two distinctly different ways, The Irishman is the culmination of careers defined by crime, and it makes for one of the finest films of the decade."
    },
    {
      "text": "The meandering pace of what all transpires reverberates with a slender essence no better than a hospice bedtime story."
    },
    {
      "text": "Though this is a lucidly told and often engrossing labyrinth of a tale, it's also a bit hollow at its center."
    },
    {
      "text": "The Irishman is at heart quite a sombre story. Scorsese doesn't dwell on the violence, and seems more interested in the possibility of redemption."
    },
    {
      "text": "A late-career masterwork."
    },
    {
      "text": "Whatever the truth of that, The Irishman is a compelling picture, but not a perfect one. Even at such prodigious length, Scorsese cuts corners."
    },
    {
      "text": "A brand new classic."
    },
    {
      "text": "f there is still any doubt as to Scorsese's artistry, The Irishman will put skeptics to bed. Or six feet under."
    },
    {
      "text": "With this masterpiece, Scorsese shows he's not ready to go gentle into that good night. He proves that this old bull can still rage."
    },
    {
      "text": "Goodfellas by way of Wild Strawberries..."
    },
    {
      "text": "It's a treat and a challenge. On the other hand, it turns murdering, cheating, organised criminals into glamorous, commanding figures. Scorsese's masterpiece is the work of an artist at the peak of his power and a glorification of pure evil."
    },
    {
      "text": "Sometimes all the brooding over actors and motifs from past films makes you feel as if Scorsese is engaged in a conscience-stricken meditation on his career. At other times, you wonder what happened to his famed momentum."
    },
    {
      "text": "It's an affecting meditation on old age and regret, a film with more melancholy than Scorsese's usual dark wit."
    },
    {
      "text": "Funded by Netflix, The Irishman's intimidating three-and-a-half-hour running time allows for similarly rich, nuanced character development spanning a 60-year time frame."
    },
    {
      "text": "\"The Irishman\" isn't a soaring achievement: It's a deliberate, thoughtful and somewhat muted one. No matter where that traveling camera goes, it subverts our expectations at every turn. Which can sometimes feel like a drag, but also exactly right."
    },
    {
      "text": "The fact that that so many Oldfellas can still muster the energy for an epic crime saga is, in itself, rather special."
    },
    {
      "text": "This opera seria about decay is handled with utmost brio, vivified by the signature élan of one of American cinema's most enduring big-canvas filmmakers."
    },
    {
      "text": "The busy wipes, lively zooms and fast cuts that characterised the earlier gangster flicks are not on display. This is as much the Scorsese of Silence as of Wolf of Wall Street."
    },
    {
      "text": "This isn't, as far as we can tell, Scorsese's swansong, but he definitely and definitively seems to be closing the book on his gangster films."
    },
    {
      "text": "The entirety of The Irishman is brilliantly acted and executed"
    },
    {
      "text": "Like the digitally de-aged visages of Robert De Niro and Al Pacino that occupy so much of the screen time in Martin Scorsese's The Irishman, the movie itself is one in which surface vitality is bolstered by the lifetime of experience informing it."
    },
    {
      "text": "This is the best movie of the year so far and one of the best films of the decade."
    },
    {
      "text": "The gangsters in The Irishman live the same life for too long, but Scorsese and his troupe avoid the same end. They are still kicking down doors, looking backward while moving forward..."
    },
    {
      "text": "If you're as strong as the sum of your parts, The Irishman is a diamond-clad instant classic."
    },
    {
      "text": "I wasn't bored for a single minute which, given there are 210 of them, has to be a triumph, surely."
    },
    {
      "text": "The contrast in the acting styles of Pacino, De Niro and Pesci are predictable, yet gripping in this mob drama. Director Martin Scorsese is in his element directing this finely tuned 3 and a half hour lavish production."
    },
    {
      "text": "The reunion of the De Niro, Pesci and Scorsese triumvirate has been justly feted, with The Irishman being the director's best work since Goodfellas -- and so much more."
    },
    {
      "text": "Stand by for the very final, utterly unforgettable shot of The Irishman for lasting proof of an established cinematic master still looking to prove something more."
    },
    {
      "text": "This is peak [Martin] Scorsese -- all manner of terrible things made wonderful to look at."
    },
    {
      "text": "Denying Scorsese's raw talent and experience as a filmmaker would be insanity. But that the only major film made in America this year about unions dredges up [Jimmy] Hoffa again seems tone deaf and self-indulgent."
    },
    {
      "text": "The picture's virtues, and its affectingly plangent mood, outweigh any not-so-special effects."
    },
    {
      "text": "The final hour, in which Sheeran is forced to decide the fate of his best friend, raises this genre picture to the level of great tragedy"
    },
    {
      "text": "This is some of De Niro's most moving work in years. His performance, full of anxious misfit energy, grimaces and haunted gaze feel entirely correct. He's a character who recognizes the depths of his sin but is unable to see redemption."
    },
    {
      "text": "It's a cinematic tour de force in form and substance, representing late-career high points for director Scorsese and his lead actors Robert De Niro, Al Pacino and Joe Pesci."
    },
    {
      "text": "The Irishman is Scorsese's elegy to the gangster picture. Every inch of the way, he demystifies the glamour of the mafia; stripping away layers of the façade, until there is nothing but an ominous void."
    },
    {
      "text": "In concert with the nostalgia evoked by its three stars, the film's rear-view mirror finds no exhilaration whatsoever in its mayhem, only a gray, aching disappointment."
    },
    {
      "text": "Martin Scorsese has created an epic tome that covers modern history and theorizes on the life and times of Frank Sheeran."
    },
    {
      "text": "The Irishman is pure cinema, all three and a half hours of it - and one of Scorsese's jazziest, most difficult films, borrowing from many sources while riffing freely though often mournfully on the themes and techniques of his previous crime epics."
    },
    {
      "text": "[Al Pacino's] on Godfather-worthy form here as loose cannon union boss Jimmy Hoffa, in what, amazingly, is his [Martin] Scorsese debut."
    },
    {
      "text": "Many characters enter the movie just as onscreen text briefs us on how they die. People's deaths are introduced before they are, ensuring that every encounter carries the weight of an obituary."
    },
    {
      "text": "In their ninth feature together, Scorsese and De Niro's collaborative gears synch as smoothly as ever."
    },
    {
      "text": "...a wake for a genre-Scorsese's personal type of guilt-soaked, blood-spattered, Catholic gangster films in particular."
    },
    {
      "text": "A cinematic behemoth that dives deep into \"the Scorsese-verse.\" All actors kill it, but Joe Pesci steals it. [Full review in Spanish]"
    },
    {
      "text": "\"The Irishman\" is a quiet epic that revisits a milieu Martin Scorsese has famously explored before--but never feels redundant or overly familiar. I couldn't take my eyes off the screen."
    },
    {
      "text": "Scorsese's signature camerawork goes down like a glass of fine whisky, as smooth and as elegant as you'd expect."
    },
    {
      "text": "The fixings of a great cinematic meal are all here, but the recipe is off and the oven time too extended."
    },
    {
      "text": "On a first viewing, I was surprised by how cold I felt towards it, as it never manages to find equal balance between familiar Scorsese crime riffs and something far weightier."
    },
    {
      "text": "If The Irishman is destined to be [Martin] Scorsese's \"last film\" it's certainly a good one, a harrowing plea for forgiveness and compassion in the face of loneliness and the void that awaits us all at the end. But a great one? Perhaps not."
    },
    {
      "text": "Yes, this is a movie about a very violent segment of US society that is fully ingrained, despite official denials. It's also massively entertaining: funny, emotional, shocking, intense and unnervingly true."
    },
    {
      "text": "...both classic Scorsese and a departure, a mob film featuring music evocative of the time yet no Rolling Stones...youthful ambition now aged remorse, De Niro his lead for the ninth time while Pacino is cast for the first...a triumph"
    },
    {
      "text": "It is to gangster movies what John Ford's \"The Man Who Shot Liberty Valance\" was to westerns. Without a doubt, it's a masterpiece."
    },
    {
      "text": "It is surprisingly funny, and the three leading men give the performances of their careers."
    },
    {
      "text": "At three and a half hours, 'Irishman' fills out its epic proportions with epic performances and some of Scorsese's best, most profound filmmaking."
    },
    {
      "text": "Blending together dark humor, brutal violence, documentary-like realism, a dazzling formal approach and a keen ear for the music of both the dialogue and the soundtrack put together by Robbie Robertson, this is Scorsese firing on all cylinders."
    },
    {
      "text": "The results are masterful, a testament to the abilities of a filmmaker who hasn't slowed down, doing all that's needed to not only stay relevant but make other filmmakers try harder."
    },
    {
      "text": "There is plenty to enjoy within The Irishman, unsurprising considering the movie clocks in at a prodigious 3 hours and 30 minutes. The problem is how spaced out the enjoyable moments are."
    },
    {
      "text": "Few films can justify a length longer than 90 minutes, but even at three-and-a-half hours, Martin Scorsese's melancholy mob movie The Irishman still feels lean, and very mean."
    },
    {
      "text": "Al Pacino, Joe Pesci and Robert DeNiro are giving career best nuanced performances with stellar direction from Martin Scorsese. The 209 minutes goes by like a breeze and the CGI distraction quickly dissipates with the brilliance of the material"
    },
    {
      "text": "A new American classic."
    },
    {
      "text": "While \"The Irishman\" is like many mob movies about violence and betrayal, it's a work of a filmmaker who has earned the right to sum up this genre."
    },
    {
      "text": "A brilliant director and three stellar actors can undoubtedly be 'oh so proud' of their remarkable accomplishment in working together to create a masterpiece."
    },
    {
      "text": "Pretty much delivers the last word on the gangster film as a genre, and ranks as one of the handful of truly great films to come out over the last few years."
    },
    {
      "text": "Hey Scorsese, I heard you like Oscars"
    },
    {
      "text": "THE IRISHMAN is a compelling, fascinating expose of the viciousness of a world most people cannot fathom."
    },
    {
      "text": "Throughout THE IRISHMAN's lengthy running time lies a constant thread of suspicion, dread and true suspense set within a base of greed and power among killers without conscience. It's one helluva story."
    },
    {
      "text": "Scorsese's expert direction allows the three and a half hour runtime to fly by. In fact, as soon as it's over you'll want to experience this achievement all over again."
    },
    {
      "text": "While Pacino fulminates and Pesci seethes, De Niro presents us with a character who all his life has lived in a kind of limbo."
    },
    {
      "text": "If you want the best movie made in a long, long time, see The Irishman."
    },
    {
      "text": "[Scorcese] He knows how to plumb the depths of human experience because he keeps mining in different places. And in doing so, he gets closer to the truth within us all."
    },
    {
      "text": "[Scorsese] does play with our expectations both stylistically and thematically... And I've got to give props to Scorsese for embracing new technology relatively late into his career."
    },
    {
      "text": "It is epic in scope, it is breathtakingly beautiful, and it is actors doing what they do best with a director who is working absolutely in his wheelhouse."
    },
    {
      "text": "The Irishman offers another vivid, indelible portrait of humanity...while forging ahead with a style and creativity that feels invigorating, vital and timeless."
    },
    {
      "text": "The Irishman is an act of rejuvenation for Scorsese too-it's his most thoroughly alive film in years."
    },
    {
      "text": "Scorsese's latest film is a potent reflection on life and legacy, but also on the cost of cheap loyalty."
    },
    {
      "text": "Martin Scorsese is the go-to guy for Mafia movies, but even he has never made anything like the immense, career-capstone epic The Irishman."
    },
    {
      "text": "The overwrought Irishman resembles an American kabuki play about sin that also relishes sin. It epitomizes the degradation of \"where we are today.\""
    },
    {
      "text": "The Irishman is a work of real retrospection. It's a stunning achievement, worthy of a great director's twilight years."
    },
    {
      "text": "Technically impressive, well-told, and superbly acted, The Irishman ultimately wastes a golden opportunity to further enhance its story with a deeper exploration of its female characters."
    },
    {
      "text": "It used to be that the scariest things in Martin Scorsese's gangland dystopias were the bullet storms and the barroom stompings. Now there's a more formidable menace: time."
    },
    {
      "text": "If this is to be Scorsese's final chapter on crime in America, it's by far his most introspective. It may not be what you'd expect from all of the pieces involved, but it is a fascinating and entertaining experience."
    },
    {
      "text": "Its characters are larger than life but actually lived, real drama is found in its themes of crime and power, and a master director and a legendary cast deliver at the top of their abilities."
    },
    {
      "text": "In its devotion to drudgery both in subject and in method, it's a lot like Sheeran himself, persevering through principles it doesn't have to understand to follow."
    },
    {
      "text": "Feels genuinely new and deeply satisfying -- for its subtlety, wit and resonance; for its serenely confident technique, meaning no truck with fancy tricks; for the sumptuous quality of the production; and for the epic scope of the story."
    },
    {
      "text": "No, the movie didn't need to be this long... If the portions are too big, though, at least it's a gourmet meal."
    },
    {
      "text": "If this all seems rather somber, it's because of the stunning last hour, which will stick with you long after the film is over. But before then, \"The Irishman\" is actually quite droll, with some of the best characters and dialogue you'll see in a film."
    },
    {
      "text": "I do like it more than anything he's directed in a long time... But here's an aspect of the movie, common to all of Scorsese's organized crime films, that I find troubling. To wit: Just how sentimental should we be about coldblooded killers?"
    },
    {
      "text": "The Irishman utilizes current de-aging technology but the film is another epic masterpiece in filmmaking from Oscar-winning filmmaker Martin Scorsese."
    },
    {
      "text": "This may end up being the quintessential film of late-era Martin Scorsese...One of the best movies of the year."
    },
    {
      "text": "Two good performances and some technical wizardry doesn't warrant the films excessive running time and crippled pacing. The Irishman gives the audience very little to take with them or apply to their own lives."
    },
    {
      "text": "The movie is nothing short of an experience."
    },
    {
      "text": "Prepare for fireworks. With this unmissable crime epic, you'll be watching Scorsese at the peak of his powers directing acting giants De Niro, Pacino and Pesci and creating the movie event of the year."
    },
    {
      "text": "What sets \"The Irishman\" apart is the ruminative mood that seeps into Scorsese's usual point-blank violence."
    },
    {
      "text": "\"The Irishman\" is a masterpiece and one of Martin Scorsese's most ambitious works to date. It's also one of his very best. Believe the hype."
    },
    {
      "text": "...phenomenal..."
    },
    {
      "text": "Martin Scorsese has made a three-and-a-half-hour late film comparable to those Ford, Hawks, and Lewis made in their golden years..."
    },
    {
      "text": "Since 1973's \"Mean Streets,\" Scorsese has proven over and over to be a master of the gangster film, and \"The Irishman\" has everything a crime lover would want, from violence and tension to an intriguing mundaneness."
    },
    {
      "text": "In his best film since 'Goodfellas,' Scorsese serves up a sprawling epic that just gets more enthralling as it winds through its extensive but necessary running time."
    },
    {
      "text": "As clear as any Scorsese crime film to date in arguing that organized crime is a dead-end life that will almost certainly lead to either a violent early death or a lonely late one."
    },
    {
      "text": "Scorsese's 'Unforgiven,' a slow-burn, relaxing historical drama that plays like a culmination of both his mob movies and his Catholic guilt passion plays."
    },
    {
      "text": "The Ben-Hur of gangster movies. Of course, Marty had to do it to 'em. He just had to do it to 'em."
    },
    {
      "text": "Patient, composed and cool..."
    },
    {
      "text": "Scorsese doesn't usually make outright bad movies. Even his disappointments have something interesting or ambitious about them. The Irishman is actually a bad movie."
    },
    {
      "text": "This is a very big Mob epic with a disturbing vision of the criminal underworld that is somewhat reminiscent of his previous films, but here [Scorsese] goes to new and disturbing places."
    },
    {
      "text": "It moves forward and backward and sideways, getting more unpredictable and compelling as it goes."
    },
    {
      "text": "The Irishman feels like Martin Scorsese's Citizen Kane. I don't mean it in the sense it's his greatest film or the greatest film of all time. Rather, in a thematic sense, they are kindred."
    },
    {
      "text": "The Irishman represents a profound success for all involved and engages with deep and spiritual ideas, while also being vividly entertaining."
    },
    {
      "text": "That Scorsese is spinning a reflective, soulful gangster narrative is a sign of the director's continued growth, even at this latter stage of his career."
    },
    {
      "text": "If this is something of a tall story, though, it's an irresistible one, with Pesci and Harvey Keitel (in a small role) especially sharp."
    },
    {
      "text": "Though this three-and-a-half hour film is among Scorsese's slowest, complete with silent, ruminative pauses, it feels steadily sure-footed, never flagging."
    },
    {
      "text": "soars with artistic brilliance on every level"
    },
    {
      "text": "An absolute must-see at the cinema, that The Irishman, with all its expense and soulful ambition, exists at all is a gift from the movie gods. And don't worry, you get used to the de-aging almost immediately."
    },
    {
      "text": "The film is ultimately about what an indistinct mulch life can be - how little you can believe in if those closest to you are the ones you betrayed."
    },
    {
      "text": "The Irishman is cinema at its purest and most real form. To quote the master himself, go see it on the biggest screen you can lay your hands on."
    },
    {
      "text": "Some will herald this as a fitting crown for the end of a master director's career. But, smart cinephiles will recognize that this gifted and highly skilled auteur has only climbed to another summit, and there will be more."
    },
    {
      "text": "A flabbergastingly ambitious, haunting deconstruction of Scorsese's own prior mob movies, with De Niro, Pacino and Pesci turning in their strongest work in years."
    },
    {
      "text": "The Irishman is vivid and immense, as if no movie had actually been so completely accomplished until now."
    },
    {
      "text": "Well, what did you expect? It was hardly going to be a disaster."
    },
    {
      "text": "This is Scorsese's summation, his twilight masterpiece, his Once Upon A Time In America."
    },
    {
      "text": "Of course, Scorsese delivers a stunning, gangster flick but The Irishman is so much more, a melancholy eulogy for growing old and losing your humanity. Savour every one of its 209 minutes, you won't regret it."
    },
    {
      "text": "It would be unchivalrous to put a date on when De Niro was last this good. But he's sensational - giving a grippingly subtle, internalised performance that melts through the de-ageing process as if it were no more than make-up."
    },
    {
      "text": "It distils the crucial elements of the book and interrogates the gangster flick with a wistful eye."
    },
    {
      "text": "After Goodfellas and Casino we thought we had had it all, for voluptuous crime-athons involving De Niro, Pesci and Scorsese. Now here's another tree with golden rotten apples, sumptuously shaken."
    },
    {
      "text": "It is another massive achievement for Scorsese."
    },
    {
      "text": "Quite simply put, The Irishman is cinema at its finest."
    },
    {
      "text": "With three consistent lead performances and an unmistakable triumph for Scorsese, [The Irishman] is one of the finest crime films in recent years."
    },
    {
      "text": "A stunning achievement of Homeric proportion and one we're likely to champion for decades to come."
    },
    {
      "text": "Martin Scorsese gets the old gang back together in a mob movie that serves as a beautiful coda for a cinematic life of crime."
    },
    {
      "text": "At once fresh and pleasantly familiar, innovative and nostalgic, watching The Irishman feels like meeting an old friend for the first time - the sort of delightful impossibility that can only be crafted by a true magician."
    },
    {
      "text": "Pacino's performance is the showiest, but The Irishman wouldn't work without a quiet performance from Pesci or the heart and heartbreak that De Niro brings to it."
    },
    {
      "text": "Quietly striking scenes like an oversized meteor, that rips into the earth like a nuclear bomb, the might of Joe Pesci is grand."
    },
    {
      "text": "The master filmmaker has made an introspective, thoughtful, even somber film that manages to be just as entertaining as his classics, even while diving deep into the darkest souls and finding some semblance of a heart."
    },
    {
      "text": "Fully engrossing for all of its 209 minutes... The Irishman is also -- true to form for Scorsese's best mob sagas -- remarkably funny with nearly everyone landing punchlines through the poetry of tough-guy language."
    },
    {
      "text": "[The Irishman] is lively and wry and very funny, but at times it also feels like a confession, a plea for grace, not just from its protagonist but from the filmmaker himself."
    },
    {
      "text": "The Irishman is every bit as clever, startling, violent, and obsessively purposeful as the colorful metaphor that serves as its alternate title."
    },
    {
      "text": "\"The Irishman\" isn't the last word on gangsters, but this long, involving, and extremely well-made epic seems to be an appropriate capstone for Scorsese - as well as De Niro, Pesci, and Pacino - at this late stage in their careers."
    },
    {
      "text": "A work of art made by one of film's ultimate master-craftsmen."
    },
    {
      "text": "Scorsese opus No. 25, The Irishman, features a lot of the strengths of those earlier films, but while it's a good film, it isn't a great one... Scorsese doesn't bring to it anything like the ironic voltage that courses through Goodfellas."
    },
    {
      "text": "I'd be hard-pressed to say that the three-plus hours of The Irishman fly by, but it's also tough to think of a single individual scene I'd want to lose."
    },
    {
      "text": "Scorcese has without a doubt created another classic. [Full review in Spanish]"
    },
    {
      "text": "An emotionally brutal piece from one of our finest filmmakers, as he captures the corrosion of the human soul."
    },
    {
      "text": "It runs a minute shy of three and a half hours, and I wouldn't wish it any shorter."
    },
    {
      "text": "An epic both soaring and intimate, Martin Scorsese's The Irishman is a majestic elegy on mortality, where the truth-seeking wisdom of Silence catches up with the director's aging wise guys."
    },
    {
      "text": "As with many of his earlier works, it's a film fascinated by the mechanics of organized crime. But there's a pervading sense that, with this picture, Scorsese wants nothing less than to put the gangster movie into its grave - quite literally."
    },
    {
      "text": "Scorsese and his lifelong collaborators deliver a clever & interesting return to the mob genre that looks back at American history, reflects on old age, and feels like a tender swan song. Three riveting performances"
    },
    {
      "text": "Scorsese's mob epic demands and commands. Confident enough to play with traditional storytelling as well as cutting edge technology, this is thrilling work from artists at their prime."
    },
    {
      "text": "Classic Scorsese, with obviously fantastic performances from De Niro, Pacino & especially Pesci. But ironically, this Netflix \"movie\" is really a 4 episode streaming series."
    },
    {
      "text": "Instead of flash and brash, Martin Scorsese delivers an effectively moving portrait that focuses on the emotional toll of being atop the mob underworld."
    },
    {
      "text": "I found myself reluctantly taken by the movie, and the way Scorsese uses it to maybe, just a little bit, atone for some of his own past blitheness about violence."
    },
    {
      "text": "With \"The Irishman,\" Scorsese proves he's more alive than ever."
    },
    {
      "text": "I heard all sorts of huzzahs about Pacino - and he is wonderful - but it's Pesci who thrilled me to the core."
    },
    {
      "text": "There's an enormity to almost everything about The Irishman: the casting, the killing, the Iditarod run time."
    },
    {
      "text": "It's a return to this familiar milieu that is nonetheless powerfully different, with the energy of youth replaced by the melancholic wisdom of the decades that have passed."
    },
    {
      "text": "The Irishman is both a funny, fast-paced gangster film and a slow-moving reflection on aging, mortality, and the passage of time."
    },
    {
      "text": "There's a real enervating anxiety of being completely forgotten that retroactively colors the rest of the film in stark, unsparing terms."
    },
    {
      "text": "Martin Scorsese's \"The Irishman\" is a monumental mobster masterpiece."
    },
    {
      "text": "The Irishman is a movie that knows we've seen the best of these men for decades... and Scorsese uses that familiarity, that memory, to mine deeper levels of pathos than he has in quite some time."
    },
    {
      "text": "Scorsese's return to the gangster milieu is anything but a greatest-hits compilation from a filmmaker in his autumn years; as a storyteller and a crafter of images, he remains as bold and as provocative as ever."
    },
    {
      "text": "The Irishman feels like an epilogue to Scorsese's storied career - but it also makes clear that Marty is far from being obsolete."
    },
    {
      "text": "The Irishman confirms [Scorsese] as one of the greatest living, though still largely unsung, comedy directors, and De Niro as one of the great scene-stealing straight men in movies."
    },
    {
      "text": "It's pretty nimble for such a behemoth and can be extremely funny; Pacino is just a scenery-chewing riot as Hoffa."
    },
    {
      "text": "Martin Scorsese's eulogy to gangster cinema"
    },
    {
      "text": "The Irishman is so layered with detail, and shifts so gracefully through so many eras, that it's hard to tease out a clearly defined plot. Even so, the movie is beautifully constructed-you willingly follow wherever it goes."
    },
    {
      "text": "Well, chug a 5-hour Energy, because the terrific \"Irishman\" deserves your full, un-fatigued attention."
    },
    {
      "text": "There's no conclusion to his filmography's cycle of transgression and penance, because none of us can know the higher truth for which his films grasp. He leaves just enough doubt to require the next movie."
    },
    {
      "text": "Scorsese knows his audience and reputation so well that the film constantly plays with, and defies, expectations."
    },
    {
      "text": "The Irishman feels more like being caught in a dream or reminiscence, with all the tenderness we're willing to afford in those in-between hours."
    },
    {
      "text": "There's an almost meta-maturity, as if Scorsese is also looking back on his own career, the film leaving us with a haunting reminder not to glamorise violent men and the wreckage they leave behind."
    },
    {
      "text": "The retro clunkiness of these characters, well past their physical primes, is key to what makes The Irishman often surprisingly hilarious."
    },
    {
      "text": "Martin Scorsese's \"The Irishman\" is a coldly enthralling, long-form knockout - a majestic Mob epic with ice in its veins."
    },
    {
      "text": "A monument is a complicated thing. This one is big and solid - and also surprisingly, surpassingly delicate."
    },
    {
      "text": "This is the Scorsese of Silence, patient and methodical, and it brings out a subtle agony from De Niro one might have assumed the actor could no longer summon."
    },
    {
      "text": "At first, it feels as if [Scorsese] looked back to some of his greatest films and stole bits from each. In the third act, The Irishman then grows beyond anything he's made before and becomes something funnier, more emotional and reflective."
    },
    {
      "text": "A highly ambitious crime epic from a dream team delivering standout work all around. De Niro, Pacino & Pesci are phenomenal as is the work of editor Thelma Schoonmaker who makes a story that spans decades and clocks in at a whopping 209 minutes seamless."
    },
    {
      "text": "If you find it indulgent though, then please let us indulge the filmmakers who have much to share about the wasted lives Frank Sheeran left in his wake, and what an epic tragedy it is to watch the waste of his own in this profound elegy."
    },
    {
      "text": "[The Irishman is] maybe the most heartfelt [film] of Scorsese's career."
    },
    {
      "text": "This is not Goodfellas. This is not Casino. This is Scorsese at his most reflective, crafting a masterwork that finds the filmmaker reflecting on everything he's done, and what it's all amounted to. The results are breathtaking."
    },
    {
      "text": "The gang's all back for Martin Scorsese's The Irishman and it's phenomenal"
    },
    {
      "text": "Scorsese's most ambitious attempt to map the machinations of organized crime onto postwar American history."
    },
    {
      "text": "Martin Scorsese, reunites with his most totemic screen actor to tell a sprawling gangland saga that's by turns flinty, amusing and richly nostalgic."
    },
    {
      "text": "The Irishman is a remarkable achievement that proves the best may yet to come from one of the most essential American filmmakers to ever live."
    },
    {
      "text": "It's hard to imagine not wanting see the movie a second or third time to marvel at the craft on display by Scorsese, his cast and crew."
    },
    {
      "text": "This massive 209-minute film feels like a career summation for Martin Scorsese and Robert De Niro."
    },
    {
      "text": "The Irishman is a major success for Scorsese, incorporating the best aspects of his past crime dramas and their thrilling energy while adding context to those films and wrestles with their legacy resonantly."
    },
    {
      "text": "The film feels composed of burnished, often blackly funny, fragments of erratic memory."
    },
    {
      "text": "The dream scenario where a legendary director and his retinue of iconic performers manage to keep their flames of talent alive and make something that's both steeped in the past but, in its own way, also brilliantly, bravely new."
    },
    {
      "text": "After a while, you adjust, or rather, you get tired of probing the slightly-off evidence of your eyes and the headache it produces. There's a lot of fun to distract you."
    }
  ],
  "release_year": 2019,
  "duration": 209,
  "genres": [
    "Crime",
    "Drama"
  ],
  "age_rating": "R",
  "synopsis": "In the 1950s, truck driver Frank Sheeran gets involved with Russell Bufalino and his Pennsylvania crime family. As Sheeran climbs the ranks to become a top hit man, he also goes to work for Jimmy Hoffa -- a powerful Teamster tied to organized crime.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/mbm8k3GFhXS0ROd9AD1gqYbIFbM.jpg"
}