{
  "movie_name": "The Adam Project",
  "movie_id": "the_adam_project",
  "total_reviews": 215,
  "reviews": [
    {
      "text": "Shawn Levy’s straight-to-Netflix sci-fi feature is a heartfelt journey for the whole family."
    },
    {
      "text": "“The Adam Project” latches onto viewers and takes them on an exhilarating joyride."
    },
    {
      "text": "The Adam Project is not a perfect film, but it’s exactly the kind of film we need right now: a highly enjoyable adventure with the right dose of nostalgia and plenty of heart."
    },
    {
      "text": "What an INCREDIBLE, thrilling Adventure that took me back to early 80’s Sci-fi features that contains a charm that is irresistible. + The heart of it all will leave you an emotional wreck."
    },
    {
      "text": "The Adam Project will undoubtedly be a big hit for Shawn Levy, Ryan Reynolds, and Netflix. The film goes beyond its sci-fi time travel tropes and delivers some wonderful character-rich performances."
    },
    {
      "text": "The Adam Project was very entertaining ride for the whole family. Has great character roles from Ryan Reynolds, Mark Ruffulo and new comer Walker Scobell they all have great chemistry that even in times of this being very silly it never goes off the rails"
    },
    {
      "text": "Free Guy director Shawn Levy reteams with star Ryan Reynolds for a half-hearted  attempt to recapture the heyday of Amblin Entertainment, which results in one of the laziest sci-fi blockbusters in quite some time."
    },
    {
      "text": "That’s probably all the audience should expect from a picture like this, one released direct-to-streaming for delivery of perfunctory content meant to bring eyes to the service, but not providing the level of quality one can often find at the cineplex."
    },
    {
      "text": "A glossy amalgamation of much better action-adventure fare."
    },
    {
      "text": "Above all else, it may be the only time you'll get to see a bullet wound be the means by which to make a fart joke in a movie...so at least it's got that going for it?"
    },
    {
      "text": "Never have I heard such hyperactive dialogue so painfully lacking in wit that I often struggled to even follow the basic plot."
    },
    {
      "text": "It's pleasures are frontloaded so by the time it reaches its generically explosive plot hole riddled conclusion, interest has long since waned."
    },
    {
      "text": "A science fiction adventure with lots of humor.\n[Full review in Spanish]"
    },
    {
      "text": "Well put together and functional, it feels as though we are in unexplored territory. \n[Full review in Spanish]"
    },
    {
      "text": "The goal here is to make you feel good about the magic that movies can grab a hold of, even if only temporarily--and how simple father-son pathos can cue the waterworks when performed well."
    },
    {
      "text": "At most, the screen equivalent of a really good Big Mac, and as much as you might like McDonalds, theres a reason those restaurants dont get Michelin stars."
    },
    {
      "text": "When Levy tries to get serious and introspective, as little Adam forces Big Adam to confront the psychological pain of losing his father, the movie discovers a new kind of cinematic time travel  by making the film slow to a crawl."
    },
    {
      "text": "I really enjoyed it."
    },
    {
      "text": "Whats really disappointing is that there was obviously a better movie somewhere in there, but dumb action sequences outmuscle the more successful parts of the story."
    },
    {
      "text": "Project isn’t brimming with originality, but it knows how to fit familiar parts together in an entertaining way."
    },
    {
      "text": "The delightful scenes between both older and younger Adam are the films crux, providing a pleasant viewing experience for families--Reynolds is a natural when comedy is involved, and viewing him yet again in a sci-fi role is a treat."
    },
    {
      "text": "There's fun to be had with \"The Adam Project\" and its spectacle is entertaining (minus some terribly distracting de-aging technology), but the story trips over itself in the final act to a distracting degree."
    },
    {
      "text": "It has action, pathos, and wonderful visual effects. Ryan Reynolds is terrific."
    },
    {
      "text": "There's nothing as good as Back to the Future, but I think Levy finds the heart to this picture. It really works."
    },
    {
      "text": "It's all too rushed for the emotional beats to work. The new Netflix movie slows down long enough only once, and that's probably the best scene. But otherwise, The Adam Project has no chill."
    },
    {
      "text": "Netflix's latest attempts at conjuring big-budget thrills on the small screen never escape its factory-assembled construction."
    },
    {
      "text": "This is one of Levy's best, a solidly satisfying entertainment all the way through."
    },
    {
      "text": "'The Adam Project' occasionally falls into formula, but Netflix's time travel movie is significantly elevated by strong performances and a surprisingly emotional core."
    },
    {
      "text": "The first half is pure 80s-era Amblin-inspired set-up and adventure, and its the best part of the film. The second half gets clunkier, a bit too special effects-y and loses touch with its characters in favour of some heavy-handed plot resolution."
    },
    {
      "text": "In spite of all the been-there, done-that tropes working against it, the movie is surprising light and watchable, notably due to the warm and squishy Scobell-vs-Reynolds banter, sanitized actions scenes be damned."
    },
    {
      "text": "The Adam Project doesn’t let its mediocrity keep it from being fairly entertaining."
    },
    {
      "text": "I was really pleasantly surprised!"
    },
    {
      "text": "Better than I expected it to be...popcorn entertainment anchored by a delightful central pairing...a tweaked coming-of-age tale that incorporates sci-fi elements in an interesting way, reminiscent of family-oriented genre offerings of the past."
    },
    {
      "text": "Watch Walker Scobell for only a minute or so in The Adam Project and youll be convinced he spent hours studying Ryan Reynolds in preparation for the movie."
    },
    {
      "text": "The films visual look is drab and boring to the point of anonymity, sporting none of the inventiveness we saw in Free Guy, which actually looked cool."
    },
    {
      "text": "There are far worse ways to spend 106 minutes of your life, but The Adam Project seems likely to fade from the memories of Netflix viewers relatively quickly -- meaning it's pretty in line with most of the Netflix original films that have come before it."
    },
    {
      "text": "Reynolds and Scobell work well together, with Ruffalo and Jennifer Garner also strong in supporting roles. They all bring the human element that makes this work -- and makes it really easy to forgive the film’s shortcomings."
    },
    {
      "text": "The Adam Project isn’t the kind of film that exists to win awards. It’s here solely to entertain. And by and large, it does just that."
    },
    {
      "text": "I stuck with it, largely due to the indisputably charming Reynolds, who seems to find himself increasingly stuck within his own gibing time warp."
    },
    {
      "text": "The Adam Project is really several films slapped together, all adding up to none"
    },
    {
      "text": "There is a lot of plot going on here – perhaps too much for family-friendly fare such as this – and the pacing can go flat at the worst possible times. However, the effects-driven scenes are strong, and the final-act resolution unexpectedly moving."
    },
    {
      "text": "Recently, and over the next few months, youre going to hear people say Have you seen The Adam Project? Its pretty good. And then youll never hear about it again. Itll go into the cultural void that swallowed Innerspace. Which is fine."
    },
    {
      "text": "In director Shawn Levy’s ambitious sci-fi, however, crazy things happen to ordinary people, and nobody bats an eye."
    },
    {
      "text": "Time-travel may be the driver of this somewhat predictable sci-fi-infused action-comedy, but its star power that turns it into immensely enjoyable entertainment."
    },
    {
      "text": "The Adam Project is a collection of well-crafted movie beats, and while the emotional barbs sting and the action scenes pop, the story is a little too overcrowded to allow space for an anchoring through-line to tie it all together."
    },
    {
      "text": "As with most time-traveling blockbusters, Adam is pure, quantum-leaping nonsense. But Reynolds and company really want this to be quantum-leaping nonsense that tugs at the heartstrings."
    },
    {
      "text": "Its a greatest-hits set of microwaved renditions of memorable sequences from better films."
    },
    {
      "text": "The Adam Project is Looper for families, or rather it’s wholesome in a Ryan Reynolds kind of way."
    },
    {
      "text": "If you can’t get on board with The Adam Project there is something missing in your soul. Perhaps time travel could help?"
    },
    {
      "text": "Time travel movies can bring up lots of mind-bending ideas, which is often half the fun of those stories. The Adam Project only hints at that kind of thinking, and consequently it never rises to the level of other, better movies with similar stories."
    },
    {
      "text": "Less a shot of pure energy directly to the brain and more a film that aims for the heart."
    },
    {
      "text": "Possibilities for The Adam Project loomed far larger than what’s on screen. And what’s on screen is never a credit to the sci-fi genre."
    },
    {
      "text": "It’s this aspect of The Adam Project that works quite well, all things considered, as Levy’s appeals to pathos often hit home."
    },
    {
      "text": "The smaller character-based moments of The Adam Project make the film stand out and elevate the otherwise fine but disposable sci-fi/action film."
    },
    {
      "text": "The film is a surprisingly fun time, despite its obvious flaws."
    },
    {
      "text": "The plot is basically a rehash of a bunch of sci-fi movies you've seen before. Shawn Levy might have been the right director for the job, its just the script is stale and staunchly unoriginal despite having no less than four writers credited."
    },
    {
      "text": "A movie aimed at the dead center of mainstream geek culture, designed to be described as having so much heart -- even though it’s as smooth and featureless as a Funko Pop."
    },
    {
      "text": "As a celebration of the complicated bonds between parents and children, THE ADAM PROJECT works well, with lots of nostalgic echoes of previous blockbusters like BACK TO THE FUTURE, and even E.T...."
    },
    {
      "text": "While the sci-fi, time-travel elements arent particularly new or interesting, The Adam Project keeps the audience invested with the fact that it is peppered with whip-smart one-liners and funny moments that will have you chuckling out loud."
    },
    {
      "text": "The film ignores time travel’s narrative potential and becomes a generic high-tech action movie."
    },
    {
      "text": "Even the limited charms of Ryan Reynolds (sarcasm and muscles, like a buff Matthew Perry) are no match for the ineptitude of this derivative sci-fi dud."
    },
    {
      "text": "In The Adam Project, you will see action galore, but its quite repetitive and a bit fuzzy."
    },
    {
      "text": "It is positively average."
    },
    {
      "text": "It's a movie for youth that doesn't treat kids like they're stupid."
    },
    {
      "text": "Flyweight time-travel action comedy...a maniacally frenetic and robotically schmaltzy farrago of snarky farce, mediocre CGI and flat family sitcom."
    },
    {
      "text": "The sci-fi stuff can teeter between overwrought and plain junk, and its heartwarming emotions are hit-and-miss. And yet The Adam Project has enough emotional momentum that it can make time fly."
    },
    {
      "text": "Reynolds' singular style, however, taps into a plausible, palpable sadness that The Adam Project capitalizes upon tremendously."
    },
    {
      "text": "With a cast this lovable, the boring or confusing parts aren’t as bothersome. It’s ridiculous and predictable and unoriginal, but it’s a good time."
    },
    {
      "text": "...watchable yet predominantly underwhelming..."
    },
    {
      "text": "The films real power comes in scratching beneath its glossy surface, with its amiable, family-friendly romp giving way to conceptually and emotionally complex matters and conditions."
    },
    {
      "text": "The Adam Project boasts stellar performances from its cast, but drowns in its influences, ultimately feeling like a very safe, derivative, and paint-by-the-numbers film."
    },
    {
      "text": "The production does take care to have some emotional connections and sardonic humor among the shooting wars, but there is a moral question  why do the bad guys always have goons who cant shoot straight? But a decent enough piece of science fantasy."
    },
    {
      "text": "If you're not tired of Ryan Reynolds' snarky shtick (I'm definitely getting there), this time-travelling family adventure works as an entertaining throwback."
    },
    {
      "text": "\"Sweetly nostalgic sci-fi\""
    },
    {
      "text": "I enjoyed The Adam Project, its past, present, and future permutations an exciting joyride fit for the whole family."
    },
    {
      "text": "The Adam Project is yet another example of how the Netflix algorithm just isnt to be trusted."
    },
    {
      "text": "The high-concept plot is held together more by force of will (and some decent special effects) than by logic, but the core of this engaging, kid-friendly Netflix production is a big-hearted tale of broken families made good."
    },
    {
      "text": "The solid cast invests the story with emotion and some humor, Reynolds occasional snarkiness provides a nice counterpoint to Scobells mix of tween angst and excitement about the future."
    },
    {
      "text": "The situations are predictable but thanks to the wise-cracking Reynolds and his likable young costar Walker Scobell, the nostalgic sci-fi adventure is entertaining, funny, and perfect for family movie night."
    },
    {
      "text": "Its a movie built from other, better movies."
    },
    {
      "text": "Reynolds gave it conviction (trouble is I don't care for him)."
    },
    {
      "text": "The story has all the time-hopping action you'd expect, but it's grounded in genuine emotion. I did not expect to get choked up twice during the movie."
    },
    {
      "text": "The Adam Project is another Ryan Reynolds vehicle thats sure to momentarily enchant family audiences."
    },
    {
      "text": "What does work, though, is Reynolds' ability to put a movie on his shoulders and find the emotional core beyond the jokes, and that makes this Netflix blockbuster a film that works in spite of certain all-too-familiar elements."
    },
    {
      "text": "Speaking of creative ways to show off anger management, the kid in a sci-fi adventure now playing on Netflix risks life and limb tooling around with his older self."
    },
    {
      "text": "Hes a charming devil, that Ryan Reynolds. And even if he is a bit like a subway sandwich  every roll (role) tastes the same  when its a flavor that you like, it doesnt matter."
    },
    {
      "text": "Reynolds may be very funny, yet it’s easy to sense his capacity to express genuine depth. Scobell matches him perfectly and together they elevate this time travel yarn to a better place it couldn’t reach without them."
    },
    {
      "text": "The Adam Project has a real fun throwback vibe like an 80s film that would be on constant rotation on my VCR."
    },
    {
      "text": "I sincerely believe The Adam Project to be Shawn Levy's best film yet. It is such a well-made science fiction-action-comedy that it might have you wondering what exactly you might say to your younger self, given the chance."
    },
    {
      "text": "The Adam Project brought me back in time to family movie nights where sci-fi narratives found me in wonder but also joy because I was watching it as a family. An entertaining film that delivers profound messages to adults and children alike."
    },
    {
      "text": "An oversaturated film whose action scenes and committed performances by the cast rescue a rushed script... Full Review in Spanish"
    },
    {
      "text": "Junk comprised of the spare parts of beloved genre forefathers..."
    },
    {
      "text": "Sometimes you just want something simple you can watch with the family."
    },
    {
      "text": "No point, delving into plot mechanics. Know, though, that some of the interchanges between the two Adams are amusing and the movie establishes itself as amiably familiar, which -- I guess -- is better than stunningly awful."
    },
    {
      "text": "This personality-driven science-fiction drama is a combo plate of movie themes set in a sci-fi time-travel world. The action is more video game than epic but has a sincere emotional center, working in a grieving familys healing."
    },
    {
      "text": "It’s an assemblage of ideas from other popular films that just hangs there with little cohesion. It’s like watching a movie that hasn’t been made yet."
    },
    {
      "text": "Levy & Reynolds trade the often tiresome TikTok-ishness of \"Free Guy\" for a simpler, sweeter story about family and time travel. The film effectively keys into the genre's emphasis on absences we hope to absolve and the yearning vacancies we hope to fill."
    },
    {
      "text": "It sits on the Fence o’ Ambivalence, but given its status as a modest, not-particularly-ambitious Netflix movie, it meets expectations."
    },
    {
      "text": "The Adam Project is boring fodder for the content mill."
    },
    {
      "text": "Every character is flawed but is also trying to do bette with their lives and for each other, and it is what makes the film so fascinating to watch."
    },
    {
      "text": "This is the kind of post-Goonies family-oriented schmaltz that plays very well on Netflix (see all of Stranger Things, a show sometimes directed by Levy) and not so well in cinemas."
    },
    {
      "text": "It’s a fairly entertaining flick for the whole family thanks largely to Reynolds’ performance and his chemistry with Scobell."
    },
    {
      "text": "It’s a featherweight fantasy with logic problems, but it’s good, dumb fun."
    },
    {
      "text": "The Adam Project might lean a little too heavy on the zany charisma of its lead actor, and it gets a little lazy going for cheap laughs. But there's a fun story at the core of it all, and I challenge you not to be moved by where the story goes."
    },
    {
      "text": "Sure, it unfolds in a predictable and conventional manner. But it’s still satisfying and, most importantly considering the current state of world, a worthwhile diversion."
    },
    {
      "text": "From the second you press play on Netflix, the film grabs you and doesnt let go."
    },
    {
      "text": "An energetic if uneven mashup of science fiction adventure and family drama. Aims for all the feels and only gets a few."
    },
    {
      "text": "Ryan Reynolds and Shawn Levy (\"Free Guy\") make another movie together. When this time travel entry isn't being creepy about mothers and sons, it has its adult and pre-adolescent heroes, who are the same person, analyze one another's feelings."
    },
    {
      "text": "A laboured, derivative and fairly witless family fantasy filled with lazy sci-fi action sequences and disastrously lacking in charm."
    },
    {
      "text": "Shawn Levy could be a great pop tentpole director if he could just stop trying to cram ten Star Wars references into all his movies."
    },
    {
      "text": "A movie with so many octopus ambitions is unlikely to pull off any of them, and that’s the bind The Adam Project finds itself in."
    },
    {
      "text": "Levy's love of '80s sci-fi is apparent. With this latest, he's on track to create a nostalgic sub-genre that will inform its own generation of film nerds — as long as we don't invent time travel."
    },
    {
      "text": "While juggling sardonic one-liners with sci-fi mayhem, the film doesnt yield the intended emotional resonance. Its ambitious premise eventually becomes lost in space."
    },
    {
      "text": "The Adam Project on Netflix is an absolutely kid-friendly movie thats a load of fun. It might turn out to be an early spring-time blockbuster for the streamer."
    },
    {
      "text": "The Adam Project manages to showcase some great performances from all involved, even if in the end they are let down by a decidedly unimaginative premise and some rather lacklustre action set pieces."
    },
    {
      "text": "The Adam Project evokes a sense of nostalgia with its callbacks to classics of the 1980s... Nostalgia sells these days, and I thought it was a slick trick to make me feel nostalgic while watching a movie set in 2022."
    },
    {
      "text": "There's plenty to enjoy."
    },
    {
      "text": "Convoluted, messy and fails to get across what it's aiming for. A Back to the Future worthy adventure was lost somewhere along the way."
    },
    {
      "text": "An interesting twist on how the future might look and transform us. But of course, it’s mostly about our need to love and be loved without qualification."
    },
    {
      "text": "With an overworked script that checks boxes rather than delivers compelling characters, this effort lands as perfectly bland."
    },
    {
      "text": "Ryan Reynolds leads an A-list cast in this Back to the Future nostalgia trip that  coasts down well-worn roads instead of paving new ones with fresh imagination. But there is still fun to be this cynicism-free throwback to 80s family entertainment."
    },
    {
      "text": "The film's fine — pretty good, actually."
    },
    {
      "text": "I had a great time with The Adam Project and despite some flaws, its a fun summer blockbuster that would have been great to watch on the big screen."
    },
    {
      "text": "The premise is intriguing and the cast is top-notch but, taken as a whole, The Adam Project comes up short."
    },
    {
      "text": "It will most certainly delight the majority of 12-year-old boys --- and others who enjoy a little light amusement."
    },
    {
      "text": "The premise of a 40-year-old man who travels back in time and meets his younger 12-year-old self  is not a theme I found compelling."
    },
    {
      "text": "The kind of movie they hardly make anymore, leaving that sense of wonder...with adventure, fantasy, science fiction, and a decent balance of action, humor, and emotion, likeable characters in a simple but impactful plot, and a dose of tenderness."
    },
    {
      "text": "The Adam Project is an absolute delight. Levy brings us a film that captures the essence of what a SciFi movie for families should feel like. Reynolds and Scobell have excellent chemistry."
    },
    {
      "text": "The unexpected emotional core at the heart of The Adam Project ... stands out and elevates the material."
    },
    {
      "text": "As great as the initial creative leap may have been, what follows is an unfortunate failure of imagination."
    },
    {
      "text": "The Adam Project is a skillfully produced and zippy time travel action fantasy thats worth your time and travel."
    },
    {
      "text": "Reynolds plays a snarky shade of his oft seen onscreen persona but muzzled with PG-13 constraints. It can feel too old for young kids, and not quite \"cool\" enough for older audiences. Moments of earnestness and the cast's commitment make it an okay watch."
    },
    {
      "text": "'The Adam Project' keeps the human element front and center as a father and his son  no matter his age  learn to love and appreciate it other, as well as to remember that love never dies nor is it dimmed by time."
    },
    {
      "text": "You dont have to look hard to see all the pieces of a great film in The Adam Project, but the more you step back and examine the big picture, the less impressive it looks."
    },
    {
      "text": "A funny, heartfelt, family movie. The originality comes not from what the story's rooted in but from what it does with its characters."
    },
    {
      "text": "Despite its flaws, The Adam Project is truly a fun movie that has enough depth to not feel like complete fluff."
    },
    {
      "text": "It's not as delightful or as original as \"Free Guy.\" However, it's still an entertaining, family-friendly watch and better than many of the Netflix original projects of its kind."
    },
    {
      "text": "While not an instant classic by any means, certainly a fun watch on Netflix. Reynolds and newcomer Scobell make this work through pure personality. Clearly this should've been a series rather than a movie, as its story seems to be on fast forward."
    },
    {
      "text": "Funny, fast-paced and surprisingly tender."
    },
    {
      "text": "The Adam Project has fun performances with a fun story. If you can see it in the theater, do so, and youll thank me."
    },
    {
      "text": "What worked for Free Guy doesn’t sustain itself here, largely because you can’t really have two Deadpools in a scene without giving yourself a headache."
    },
    {
      "text": "It's a bit messy, and the heart it yearns for at its center has mostly empty beats."
    },
    {
      "text": "Ryan Reynolds is a natural, but not since Anna Faris has he found such a worthy adversary in verbal sparring."
    },
    {
      "text": "You’ll see it, possibly enjoy it, and then require your own future self to travel back, many years (or possibly even hours) from the future, and remind you that you’ve already watched it."
    },
    {
      "text": "The Adam Project has the generic feel of a project created by committee, combining action, humor and smart-alecky one-liners in a way that's at best aggressively okay."
    },
    {
      "text": "It’s pretty satisfying popcorn fare with some genuinely affecting beats. All that’s missing is some Harry Chapin."
    },
    {
      "text": "Finding a kid who can mimic and make Reynoldss smart-aleck act endearing is a downright acting coup."
    },
    {
      "text": "\"A film that feels like it's been pieced together from bits of other, better films.\""
    },
    {
      "text": "Ryan Reynolds stars as a wisecracking time-flyer in Netflix's breezy but heartfelt version of ET, Back to the Future and Flight of the Navigator for the Marvel generation."
    },
    {
      "text": "Promises too much and delivers too little to the point where it feels like an undercooked mush of all its inspirations"
    },
    {
      "text": "it's the rare script in  that it is razor-sharp on the dialogue-level, but the more macro it gets, the duller it becomes."
    },
    {
      "text": "The Adam Project is a passable science fiction adventure with good cast chemistry. Ryan Reynolds sarcastic delivery gets a worthy accomplice with young Walker Scobell. Their sharp back and forth makes up for a disjointed script."
    },
    {
      "text": "Who this movie is for, I couldn’t tell ya."
    },
    {
      "text": "Ryan Reynolds finds himself stuck in another choppy and convoluted sci-fi adventure."
    },
    {
      "text": "Its the cinematic equivalent of a mid-week national holiday you appreciate it in that moment for bringing some respite to your hectic life, but there's more where that came from."
    },
    {
      "text": "The real surprise in this fun, layered, time-traveling action mystery is the tenderness with which family relationships and sentiments are handled."
    },
    {
      "text": "It's an easily watchable piece of sci-fi family entertainment not too far removed from the old Amblin formula."
    },
    {
      "text": "Shawn Levy follows up the success of Free Guy with a movie that fuses Reynolds brand of comedy into a time travel story, only its not funny enough, nor is it entertaining enough to spark our interests."
    },
    {
      "text": "Shawn Levy and Ryan Reynolds have established a proven forte at producing shining and human sources of wonder next to the dashing delights."
    },
    {
      "text": "“The Adam Project” isn’t especially smart, but it does leave you with a warm, fuzzy feeling. Its science grade is only passing, but its emotional IQ is above average."
    },
    {
      "text": "The Adam Project is what happens when you wish on a cursed monkeys paw that Hollywood would make more original movies."
    },
    {
      "text": "With Reynolds's big mouth, kick-ass action sequences, some great laughs, and even greater character drama, The Adam Project is a monumental success that you should recommend to anyone who wants a good movie to kick back, relax, and enjoy."
    },
    {
      "text": "A popcorn pleasure."
    },
    {
      "text": "The Adam Project is a charming and fun sci-fi throwback, fueled by a strong script and one of Reynolds' best performances."
    },
    {
      "text": "Where some might single out the trashy heist caper Red Notice as the premium example this year of a star-powered, overpriced Netflix nothing, I’m looking straight down the barrel at The Adam Project."
    },
    {
      "text": "Theres authenticity and sincerity that truly works in The Adam Project, but its unfortunately hidden under layers of boring sci-fi nonsense and failed attempts at dull humor."
    },
    {
      "text": "Nostalgia for the pre-digital 1980s hangs heavy, worked into a slick paste of industrial wholesomeness."
    },
    {
      "text": "Glossy entertainment aiming to be heartening while juggling big visual displays of action, which isn't entirely thrilling, but fits into Levy and Reynolds's mission to provide easily digestible escapism during troubling times."
    },
    {
      "text": "When, exactly, did I invite this much Ryan Reynolds into my life?"
    },
    {
      "text": "An entertaining and emotional film, combining exciting action sequences with characters that are easy to empathise with. Full review of Spanish."
    },
    {
      "text": "The special effects and action set pieces are impressive and the story is simply sweet, swift and sincere."
    },
    {
      "text": "On the surface, The Adam Project is simply a sci-fi thriller with a strong cast, but underneath the top layer, there are other messages about grief, deception, and bullying."
    },
    {
      "text": "Close enough to being a good movie that its actually more frustrating than an outright disaster."
    },
    {
      "text": "The Adam Project threatens to allow the special effect fireworks to overshadow its story, but contains just enough heartwarming material to earn comparisons to the 1980s Amblin movies that were clearly an inspiration."
    },
    {
      "text": "Ripples in time create holes in the plot, but Reynolds and his younger self patch over the missing piece with incredibly watchable charisma."
    },
    {
      "text": "Mileage for the actor’s wise guy persona will vary — I’ve personally had my fill for several lifetimes, with or without time travel — and it’s hard here to separate the movie from the leading man."
    },
    {
      "text": "A high-concept but thin homage to light-hearted sci-fi romps of the past."
    },
    {
      "text": "This sci-fi adventure hits the right Amblin notes."
    },
    {
      "text": "Before you go and think this will just be another film that overly relies on a nostalgia trip, that is just the icing on the cake. The heart of this film belongs to the father/son story that is fleshed out in the second half."
    },
    {
      "text": "If I were to sum-up \"The Adam Project,\" its a wibbly wobbly action adventure that dabbles in nostalgia while making something entirely of its own."
    },
    {
      "text": "This has the feel of the big, family sci-fi action adventures from the 80s... So, if you're into those stories because of the nostalgia or you have parents who loved those movies and taught you to too, you're going to enjoy this."
    },
    {
      "text": "This time travel journey has its enjoyable moments but as well as being overly derivative it lacks a soul of its own."
    },
    {
      "text": "The movie has a good shot at a huge streaming audience. But does it have the creative instincts of a good movie? An OK one, yes. It’s too bad “The Adam Project” is only that, since the cast isn’t dogging the assignment for a second."
    },
    {
      "text": "Scobell and Reynolds click, as do Mark Ruffalo and Reynolds."
    },
    {
      "text": "Though a forgettable villain and some uninspiring set-pieces sometimes hinder The Adam Project, Reynolds and Scobell’s cracking performances and the film’s surprising emotional depth make it worth a look."
    },
    {
      "text": "The Adam Project is a wonderfully slick futuristic family film that captures the feel-good fun and epic adventure of ‘80s sci-fi."
    },
    {
      "text": "Theres something eerie about how devoid of personality and distinctive qualities this film is."
    },
    {
      "text": "Netflix’s new film has a cool premise, vintage Ryan Reynolds, some excellent CGI action, winning comedy and, best of all — heart."
    },
    {
      "text": "Adam barrels along on movie stars and charm, from futures past and back again."
    },
    {
      "text": "Depressingly familiar and faux-engaging."
    },
    {
      "text": "It’s the sort of thing you might have gathered on the sofa to watch on VHS on a Friday night in the ‘80s, which is as much of a recommendation for the film as some may need."
    },
    {
      "text": "The result is neither funny nor thrilling, just exhausting."
    },
    {
      "text": "“The Adam Project” slips into a numbing cycle of pseudoscience and pointed one-liners because it fails to accrue any emotional weight."
    },
    {
      "text": "As Adam says in the film, the most valuable resource on earth is time, and \"The Adam Project\" is worth all 106 minutes."
    },
    {
      "text": "With echoes of “Back to the Future,” “The Terminator” and even a little of “Heaven Can Wait,” this is a consistently entertaining comedy-actioner with a lot of heart — and the perfect ending."
    },
    {
      "text": "The movie is a total trifle, but it’s often a diverting one — a wide-eyed sci-fi adventure with a screwball buoyancy."
    },
    {
      "text": "Reynolds is not doing himself a favor by acting the same way all the time, especially in weak movies like “The Adam Project.”"
    },
    {
      "text": "The Adam Project is a pleasant experience that is catered to the whole family. It is an inoffensive, amiable, good time with a noteworthy, breakout performance."
    },
    {
      "text": "Part drama, part comedy, part sci-fi, and all fun - The Adam Project is the MUST SEE movie of the year."
    },
    {
      "text": "What could have been something cerebral and stimulating ends up feeling like more disposable cinema."
    },
    {
      "text": "All of the elements might not fit together perfectly, but when The Adam Project aims for the heart, it doesn't miss."
    },
    {
      "text": "A lovely, fun movie, that also packs an emotional punch. Ryan Reynolds is again great in this Spielberg-ish homage to the 80s Sci-Fi flicks that I grew up on. Full review in Spanish"
    },
    {
      "text": "Its not quite as moving as it thinks it is, but The Adam Project is still a warm hug of a movie  and a valiant stab at the paradoxical pleasures of time travel."
    },
    {
      "text": "Starring Ryan Reynolds as a fighter-pilot from the future and Walker Scobell as his younger self, the science fiction film pulls from all genres to deliver action-packed heroics, plenty of laughs, and some surprisingly touching heartfelt moments."
    },
    {
      "text": "Ultimately, the film tries so hard to do so much that it doesnt end up doing any of it particularly well."
    },
    {
      "text": "Perhaps a jump to the future was needed to recognize and iron out the flaws"
    },
    {
      "text": "Maybe it's because of the film's Amblin nostalgic factor but The Adam Project is one of the best pictures of the year"
    },
    {
      "text": "Although it doesnt always hit its intended marks, when it does, it genuinely works. It admirably wears its heart on its sleeve."
    },
    {
      "text": "Has the drawback of feeling blandly put together and hoping the rapid editing will make up for the way these characters constantly explain the story as it goes. Still, as an Amblin-style film pumped up on steroids, The Adam Project doesnt crash and burn."
    },
    {
      "text": "Through Ryan Reynolds and Walker Scobells performances, The Adam Project delves into the idea of how much their 12-year-old version would annoy the hell out of anyone  and probably not bring them the best of memories."
    },
    {
      "text": "'The Adam Project' is the latest original film from Netflix, and it tells a heartwarming, fun, high-energy, sci-fi story that plays with the imagination and allows us to have a good time."
    },
    {
      "text": "Director Shawn Levy doesn't reinvent the been-there, done-that time-travel formula but at least, he does it with enough heart and decent entertainment values."
    },
    {
      "text": "It presents a number of themes and ideas that deserve deeper exploration, but The Adam Project is still a hugely charming sci-fi adventure with loads of spirit and heart."
    },
    {
      "text": "The Adam Project emotionally resonates on a level that major studio feature films have been trying to return to for years."
    },
    {
      "text": "The Adam Project is the kind of film that would make Steven Spielberg proud, so deep in its veins is the essence of vintage Amblin Entertainment."
    }
  ],
  "duration": 106,
  "genres": [
    "Sci-Fi",
    "Adventure",
    "Action",
    "Comedy"
  ],
  "age_rating": "PG-13",
  "synopsis": "A time-traveling pilot teams up with his younger self and his late father to come to terms with his past while saving the future.",
  "popularity": 7.3
}