{
  "movie_name": "The Greatest Showman",
  "movie_id": "the_greatest_showman_2017",
  "total_reviews": 263,
  "reviews": [
    {
      "text": "Give in. Roll up. Sing along."
    },
    {
      "text": "The vivid cinematography by Seamus McGarvey and the exquisite costumes by Ellen Mirojnick capture the magic of Barnum’s circus and give the picture an attractive period feel."
    },
    {
      "text": "Quite incongruously, The Greatest Showman suggests that Barnum is a heroic figure, a woke entertainer and family man, who also capitalized on animal suffering and the veritable prostitution of human oddity."
    },
    {
      "text": "The movie is a big, loud explosion of color and excitement  but one the party's over, somebody's got to clean it all up."
    },
    {
      "text": "So nice, so cheerful, its characters so indefatigable that it's impossible to hate."
    },
    {
      "text": "It's a rollercoaster of story and music that occasionally moves too fast but delivers enough thrills along the way to be worth the price of admission."
    },
    {
      "text": "A serious look at P.T. Barnum's life requires acknowledgment of the ways in which his success manifested. The Greatest Showman is therefore just as much of a fraud as he was."
    },
    {
      "text": "While one can fault this sugar-coated take on the Barnum character, it's hard to find fault with Jackman's portrayal of him."
    },
    {
      "text": "Hugh Jackman dazzles as circus tycoon P.T. Barnum in this criminally underrated biopic featuring a timeless Pasek & Paul songbook of \"A Million Dreams\" and \"Never Enough.\""
    },
    {
      "text": "It won't be classified as the best movie in the world (or musical for that matter) but it is easy to see why the appeal for the film has been infectious and unanimous."
    },
    {
      "text": "A festive musical treat with an enchanting performance from Jackman and a feel-good soundtrack you'll be hunting down as soon as you leave the cinema."
    },
    {
      "text": "What is said to be a 'celebration of humanity' lacks just that, using flair and manipulation instead."
    },
    {
      "text": "The Greatest Showman is a spectacular modern musical extravaganza in the classic Hollywood style."
    },
    {
      "text": "Thinking back on this film is giving me a headache. It is a frustrating mess, with much to mock. However, I do admit to being swept along with some of the musical numbers and circus scenes. Ultimately I have to accept that a large part of me enjoyed it."
    },
    {
      "text": "This movie does a solid job of presenting its story and providing a fantastic place for these new songs."
    },
    {
      "text": "This movie does still suffer from a lot of the same problems, musically, that La La Land did, where I can't understand a word that the chorus is saying."
    },
    {
      "text": "It had that magic of a musical... I don't know if I'd recommend it. It felt like it was peacocking me the whole time."
    },
    {
      "text": "This isn't a subtle, finely tuned piece of art, this is cheery lunacy that revels in its attempt to call back on the positive musicals of the past."
    },
    {
      "text": "My question is, why not focus on the real facts by digging deeper? What a shame, not only to Barnum's character but also to Lind's."
    },
    {
      "text": "The Greatest Showman is so much fun. You got Hugh Jackman's contagious charisma, Zac Efron holding his own and Zendaya flying through the air with ease."
    },
    {
      "text": "This film may not be the greatest show, but in this film, [Hugh] Jackman is the greatest showman."
    },
    {
      "text": "It is true that the entire technical department is essential for 'The Great Showman' to become what it is, but everything would have been in vain without Jackman's fundamental presence. [Full Review in Spanish]"
    },
    {
      "text": "From the cast to the costumes to the music, The Greatest Showman has so much to offer and with a PG rating, it's the perfect movie to take the whole family to this holiday season"
    },
    {
      "text": "Hugh Jackman is asked to merely coast in a splashy but shallow picture that might as well have been called American Idle."
    },
    {
      "text": "In the end, just like Barnum himself, it's all a fraud."
    },
    {
      "text": "What annoys me The Greatest Showman is that it is very much the idea of musicals that persons who don't watch musicals have. It is light and bubbly, inoffensive, and without much depth."
    },
    {
      "text": "An uplifting story with catchy music that could have developed more characters outside of its lead."
    },
    {
      "text": "The movie did not work for me, almost at all."
    },
    {
      "text": "If we, the audience, recognize that The Greatest Showman's filmmakers want to entertain not explain, then they've succeeded."
    },
    {
      "text": "Has several elements that suggest the final piece will be stellar. However, it ultimately ends up failing to turn its promising individual components into an impressive whole."
    },
    {
      "text": "Dazzling musical set-pieces and irresistible songs allow Jackman to deliver the showstopping performance he's been dying to for years. Enjoy the pure escapist fantasy - just don't think too hard about the man behind the humbug."
    },
    {
      "text": "One cannot deny The Greatest Showman its merits, proving to be a perfect show for the season... a three-star film with a five-star performance from its ringmaster."
    },
    {
      "text": "The Greatest Showman has some brightly-colored production numbers, some catchy-as-heck songs and a strong lead performance from [Hugh] Jackman. But while those pros are significant, they simply don't outweigh the many cons."
    },
    {
      "text": "For all the musical fanboys and girls out there, start your New Year's out right."
    },
    {
      "text": "A touching, inspiring and joyful razzle-dazzle entertainment for the entire family, just in time for the holidays."
    },
    {
      "text": "The Greatest Showman is a triumph."
    },
    {
      "text": "The film is flashy in all the right ways, its dreamy and dazzling costumes punctuated with spirited and elaborate staging and set pieces."
    },
    {
      "text": "Like Barnum himself, it's an elegant fraud, nice enough to look at as long as you don't look too close."
    },
    {
      "text": "Very little here works. The movie is safe and bland, with atrocious direction and horrible choreography."
    },
    {
      "text": "Almost everyone involved here was working in the full scope of their abilities. Perhaps one day they can even collaborate on something with more than just a shoestring screenplay."
    },
    {
      "text": "I might have enjoyed a different version of The Greatest Showman. One where the filmmaking was more adept, the songs more substantial, and the characters given the complexity they deserve. This? This is pap."
    },
    {
      "text": "Color, pizazz and a whole lot of movement obscure a film where performers don't have to try really hard to convey character."
    },
    {
      "text": "I'm not sure how you read the room badly enough to think \"Woke P.T. Barnum\" is a great idea for your big holiday musical - it's like doing a version where chickens keep singing about how awesome Colonel Sanders is."
    },
    {
      "text": "The music never really plants itself in viewers' minds as each piece feels overdone and jarringly anachronistic."
    },
    {
      "text": "A film that's as big and extravagant as musicals get. Run away to the circus and let it win you over."
    },
    {
      "text": "At times infectious and fun, at other times middling and tedious, The Greatest Showman is a mixed bag that will thrill some and estrange others."
    },
    {
      "text": "The Greatest Showman overcomes a predictable story with a rousing and entertaining production, led by a captivating performance from Hugh Jackman."
    },
    {
      "text": "This movie is an absolute joy. Fans of ... Jackman should definitely check (this) out, showcasing the talented actor in an exciting return to his musical roots."
    },
    {
      "text": "There's more than enough flash and bang [in The Greatest Showman] to spare, but not nearly enough of a concentrated effort to fully develop one single angle, from plot to participants."
    },
    {
      "text": "Turn off your brain and enjoy the show."
    },
    {
      "text": "The Greatest Showman aims to be a old-school musical in every best sense of the word. Hugh Jackman shines and catchy lyrics make for a great extragavaganza"
    },
    {
      "text": "It's a cheesy, spineless film that celebrates the shameless exploitation that Barnum built an empire on, containing none of the same thrills or shocks that he was known for."
    },
    {
      "text": "While maybe not the greatest show, it is one of the best musicals of the last decade."
    },
    {
      "text": "It's almost tempting to describe The Greatest Showman as a masterpiece of surrealism, in it's off-base aesthetics and absurdist drama. Unfortunately, it is more likely just bad."
    },
    {
      "text": "The irony is that while LA LA LAND probably enabled THE GREATEST SHOWMAN to be made, THE GREATEST SHOWMAN is by far the better musical."
    },
    {
      "text": "The hard times of a successful white male with a midlife crisis."
    },
    {
      "text": "Everything about this film clicks from start to finish. The music, the choreography, the costumes and the performances are top-notch."
    },
    {
      "text": "I will personally be watching Zac Efron and Zendaya doing aerial acrobatics on \"Rewrite the Stars\" quite a few more times between now and whenever either the rental period runs out or The Greatest Showman is sent to jail for crimes against chill-ness."
    },
    {
      "text": "Everything is geared towards packaging Barnum as a sort of cuddly pioneer of inclusivity, rather than the hard-nosed businessman of his times that he was."
    },
    {
      "text": "If only for its unmitigated use of smoke and mirrors to carve inspiration out of a man whose historical reputation is quite dubious, The Greatest Showman, while not exactly the greatest show as the opening number advertises, is a good one."
    },
    {
      "text": "Each and every one of the The Greatest Showman's songs is a delight. [Full review in Spanish]"
    },
    {
      "text": "...it's a good show to enjoy a carefree moment. [Full Review in Spanish]"
    },
    {
      "text": "A showy, confused, big hunk of nothing."
    },
    {
      "text": "The musical numbers alone make 'The Greatest Showman' worth seeing."
    },
    {
      "text": "I love beautiful, well-crafted, profound musicals with cleverly rhymed lyrics. Fortunately, I also enjoy shallow throwaway puff pieces with catchy tunes, lyrics that are purely functional, and dead-end subplots."
    },
    {
      "text": "An old-fashioned show. [Full Review in Spanish]"
    },
    {
      "text": "The nervous energy musical works too hard to sustain a magic it never achieves onscreen."
    },
    {
      "text": "[With] a handful of dynamic original songs written by Academy Award-winning lyricists Benj Pasek and Justin Paul (La La Land)...[the film] delivers on its promise of spectacular showmanship."
    },
    {
      "text": "Anachronistic as all get-out, though often in the overt cause of racial justice and equality, the movie strains narrative credulity at every turn"
    },
    {
      "text": "...lacks a sense of humor. [Full Review in Spanish]"
    },
    {
      "text": "Screenwriter Bill Condon. . .turns the showman's innovations in advertising and public manipulation into models of humanitarianism. This is showbiz demagoguery."
    },
    {
      "text": "I may have gotten tired of just listening to the songs, but I could watch the cast dance to them over and over, simply because they make it look so effortless and fun."
    },
    {
      "text": "That's why, despite it's empowering theme song, diverse cast, and strong vocal lead in Hugh Jackman, it's impossible to separate The Greatest Showman from what we know of P.T. Barnum the man."
    },
    {
      "text": "Do not expect deep insight into (Barnum)... he surely deserves the statues built in his honor, and, even more surely, a better movie someday."
    },
    {
      "text": "It alters history too much to make it a valuable portrait of P.T. Barnum. The music is not good enough to make it a good musical, either, despite good staging, some effective dance numbers and some good performances by a talented cast."
    },
    {
      "text": "[This] kind of insanity is really fun to watch. The Greatest Showman is a lot of things, but it's not boring."
    },
    {
      "text": "I believe Jackman has a great musical in him, but it's not here right in front of us now."
    },
    {
      "text": "Sometimes, you just have to give it up for really talented hucksters doing their all to impress you."
    },
    {
      "text": "The true moral victors wind up being the cast around [P.T. Barnum]. [Full Review in Spanish]"
    },
    {
      "text": "In finding the perfect lead in Jackman as Barnum, providing moving and invigorating musical numbers executed by a stellar secondary cast, impressive visuals, and covering timely topics, The Greatest Showman overcomes its narrative shortcomings."
    },
    {
      "text": "There is fun to be had here. As long as you do your best not to think about it too hard."
    },
    {
      "text": "It may provide just enough spectacle to prove a pleasant distraction during the holiday period, but a warning in advance - leave the brain behind for this one."
    },
    {
      "text": "This crude revision of Barnum as a white able-bodied savior-a kind of Oskar Schindler of the sideshow-is particularly in bad taste considering the far more unsavory historical realities."
    },
    {
      "text": "It's all very bogus."
    },
    {
      "text": "A miscast and unappealing Rebecca Ferguson as soprano Jenny Lind sinks the movie even further."
    },
    {
      "text": "So Good You May Want To See It Again"
    },
    {
      "text": "An impressively engrossing contemporary musical..."
    },
    {
      "text": "An empty film. [Full Review in Spanish]"
    },
    {
      "text": "This may be nonsense but it's well-meaning and, most importantly, entertaining nonsense."
    },
    {
      "text": "...forces conventionality on a sordid and surreal chapter of American history."
    },
    {
      "text": "The film would have been lacklustre if not for Hugh Jackman, who has given his heart and soul to the project."
    },
    {
      "text": "For a biopic that purports to celebrate humanity in all its diversity, The Greatest Showman is surprisingly flat."
    },
    {
      "text": "The Greatest Showman is a feel-good movie that stands out visually and musically... [Full review in Spanish]"
    },
    {
      "text": "The movie is held together by a superb central performance by Jackson, who embodies Barnum's can-do spirit and seething social aspirations, and the music by John Debney and John Trapnese."
    },
    {
      "text": "Dreaming, Barnum knew, costs nothing; realizing the dreams, a little more. [Full review in Spanish]"
    },
    {
      "text": "Exactly the biopic Barnum would've made about himself - forget the art, don't let the truth get in the way of a good story, but leave 'em smiling in the aisles."
    },
    {
      "text": "A sizzling explosion of colour, music and joie de vivre...(But) there is little substance beneath the gloss; the film is constrained by its sleek studio shackles."
    },
    {
      "text": "Today's Moulin Rouge. [Full review in Spanish]"
    },
    {
      "text": "As I've noted, a lot of capital-N names helped make this film. But the director, the bloke who wore a beanie to the red carpet premiere in Sydney, deserves our admiration. He is the showman who, like Barnum, has his name above the door."
    },
    {
      "text": "If a singing, dancing Hugh Jackman in a Mean Girls remake (while ignoring the reality) is what you are in the mood for, The Greatest Showman might just be the right way to say goodbye to 2017."
    },
    {
      "text": "Hugh Jackman was born to play two roles: Wolverine and P.T. Barnum. The music, performances and the whole production, are fantastic. Thankfully, they make up for a rather thin, superficial storyline. [Full review in Spanish]"
    },
    {
      "text": "The Greatest Showman is an entertaining trifle."
    },
    {
      "text": "A doublethink cash grab, painting perpetrator as saviour and exploited victims on the fringes of society as empowering role models - figures of inspiration to make mainstream, uncritical audiences feel better about themselves."
    },
    {
      "text": "... [Hugh Jackman's] feel-good new film, The Greatest Showman, is where he truly gets to unleash his inner trouper, and he barely stops singing, dancing and flicking around a top hat from beginning to end."
    },
    {
      "text": "The Greatest Showman is a disjointed, glossy, sugar-coated mess that just skates by on Jackman's natural charm and charisma."
    },
    {
      "text": "Stare all you want at this motley crew of misfits because they give us sentiment and entertainment in return."
    },
    {
      "text": "What stands the film apart is its relevance to today's times. It touches upon social issues like class discrimination or aversion towards human abnormalities that continue to plague our society even today."
    },
    {
      "text": "The film balances many issues of the period, including classism and interracial relationships. While there are moments of un-evenness, overall the production is uplifting; it's a feel-good movie at its core."
    },
    {
      "text": "First-time director Michael Gracey achieves a miracle in pulling this all off in the most stylish musical since Moulin Rouge! 17 years ago."
    },
    {
      "text": "The film's insistence that Barnum's freakshow is born from warm, fuzzy humanity and very contemporary notions of inclusivity is not just historically inaccurate, it's at odds with The Greatest Showman's extremely pretty idea of freakery. Pink hair?"
    },
    {
      "text": "For Americans, [P.T. Barnum is] the father of spectacle. His movie is no different. [Full Review in Spanish]"
    },
    {
      "text": "Despite the fleeting moments of joy granted us by the 11 wonderful music videos found in this film, The Greatest Showman remains a mess."
    },
    {
      "text": "... barely a film at all."
    },
    {
      "text": "Go. Enjoy. Smile."
    },
    {
      "text": "The songs are solid and This Is Me, like all great Top 40 summer tunes, has an anthemic chorus that embeds itself in one's head for days."
    },
    {
      "text": "Starry-eyed and showy, it's splashy and synthetic"
    },
    {
      "text": "A satisfying musical movie celebrating the spiritual practice of inclusiveness."
    },
    {
      "text": "The Greatest Showman may not delve very deep or motivate deep and meaningful conversation, but it's a show well done - one that boasts a wonderful cast, memorable songs and rousing set pieces."
    },
    {
      "text": "For 105 minutes I'm a sucker for his movie, that may not be the greatest show on Earth but close enough."
    },
    {
      "text": "It is a joyful exploration of family, friendship, love and acceptance complete with song, dance, colourful aesthetics, characters you can root for and some aerial acrobatics. What's not to love?"
    },
    {
      "text": "Does so many things right, but one big thing wrong: It depicts Barnum as way too much of a conventional hero"
    },
    {
      "text": "Hugh Jackman IS The Greatest Showman. [Full review in Spanish]"
    },
    {
      "text": "As a musical The Greatest Showman works. It's not quite up to Baz Luhrmann level but is definitely of that ilk, it looks good, the costumes and sets are colourful and dreamy and the performers give it socks... However, as a biopic it works less well."
    },
    {
      "text": "The Greatest Showman's floorboard-shaking, Broadway-belting song and dance routines can't cover for its flat-footed screenplay. Behind the smoke and mirrors lies an empty-hearted whitewash of history."
    },
    {
      "text": "If you're looking for something undemanding and sort of family-friendly, and you like musicals, this will definitely fill a couple of hours between Christmas and New Year."
    },
    {
      "text": "The film does have one thing to give it pizzazz, and that's visual zest."
    },
    {
      "text": "The director, Michael Gracey, delivers quick doses of excitement in splashy scenes but has little feel for the choreographic action, offers scant historical substance, and displays slender dramatic insight."
    },
    {
      "text": "Imagine Tod Browning's 1932 pre-Code horror film Freaks asset-stripped by a third-rate Baz Luhrmann wannabe, the chilling refrain \"one of us\" sanitised into something closer to a soft-drink commercial tagline than a menace."
    },
    {
      "text": "The Greatest Showman could have been a rousing and poignant work important to disrespected abnormal citizens, but instead, it's just rousing with a lot of hollow razzle-dazzle."
    },
    {
      "text": "Those hungry for a big, old-school musical spectacle with a thin story and plenty of numbers will get more than their fill with the flash-and-dazzle of The Greatest Showman. Hugh Jackman pulls out all the stops for his lead performance."
    },
    {
      "text": "...viewers may find themselves dreading the next musical number, with an array of undistinguished songs that Jackman and company try to sell to no avail."
    },
    {
      "text": "I'm pretty sure there's an audience for this film. But I'm even surer that I'm not part of that audience, given how much of the running time I spent groaning with my face buried in my hands."
    },
    {
      "text": "This isn't the story of Barnum's life, but a formulaic rags-to-riches story grafted onto the broad outlines of Barnum's career as a circus entrepreneur."
    },
    {
      "text": "Hugh Jackman fronts a lively family musical as PT Barnum, a role he was born to play. Terrific Pasek and Paul songs light up the screen with a holiday treat."
    },
    {
      "text": "Great acting, great music, good plot. Unlike \"La La Land\" this movie hits all the right notes."
    },
    {
      "text": "...wonderful music and good dancing; and I came out of it feeling good, even though it's Hollywood Hokum and I had learned very little about the real P. T. Barnum. But shame on them for libeling Jenny Lind, a virtuous woman who can't defend herself."
    },
    {
      "text": "In addition to sanitizing the less-appetizing aspects of Barnum's legacy, The Greatest Showman relies too heavily on razzle dazzle to mask its narrative shortcomings."
    },
    {
      "text": "Historians now agree that Barnum wasn't the one who said \"There's a sucker born every minute,\" but it's hard to escape the feeling that you're being sold a poptimist bill of goods here."
    },
    {
      "text": "The Greatest Showman is better off when it's bombastically belting out memorable tunes and begging the audience to bop along in their seats. And that happens often."
    },
    {
      "text": "A law needs to be passed that Hugh Jackman has to make at least one musical movie every year just to make the world a little bit more joyful."
    },
    {
      "text": "Jackman has the charisma, charm and cheek that Barnum must have possessed in some measure. He has a twinkle that keeps you sympathising with him even when he's being a deeply flawed, social climbing, straying hero."
    },
    {
      "text": "I'll admit I wasn't expecting much from this film, but I was blown away from beginning to end. (Full Content Review for Parents - Violence, etc. - also Available)"
    },
    {
      "text": "The team behind 'La La Land' has done it began. Benj Pasek and Justin Paul might just bring back the movie musical all on their own."
    },
    {
      "text": "For all its cheeriness, brio and strong cast, this is a phoney baloney film with heartstring-tweaking, soul-stirring ambitions it is, by a laughable margin, too transparently manipulative to realise."
    },
    {
      "text": "I sat down to The Greatest Showman with high hopes and left disappointed."
    },
    {
      "text": "It is a little clunky and cheesy but when it works, it really does bring a song to your heart and a tear to your eye."
    },
    {
      "text": "The closest it gets to a hummable toe-tapper is Come Alive, which, at the risk of damning with faint praise, sounds like a Miami Sound Machine D-side."
    },
    {
      "text": "Prefers easy sentiment over anything more than the most obvious of themes and the simplest, flimsiest of narratives."
    },
    {
      "text": "It's gaudy, overproduced and, for the most part, more committed to spectacle and shine than anything of lasting worth."
    },
    {
      "text": "The sweetness that makes so much of this better than it probably had a right to be also makes it far from disastrous that it's so much less than it could have been."
    },
    {
      "text": "Thus, we're left with a film that claims greatness, but has nothing great to show for itself. And yet, mathematics be damned, I'm hesitant to submit to the fact that The Greatest Showman isn't, in fact, great."
    },
    {
      "text": "Just as we imagine that visitors to Barnum's circus 150-odd years ago knew exactly what they were getting, this is a film with few surprises but a whole lot of spectacle."
    },
    {
      "text": "The Greatest Showman is a perfunctory effort in story, music, dance, and direction that proffers empty messages about uniqueness, reaching not for the stars but for bland homogeneity."
    },
    {
      "text": "It really is a joy to watch."
    },
    {
      "text": "An old-fashioned musical with a none-more-zeitgeisty songsheet, it may not be a flawless piece of storytelling, but it's a pretty decent show."
    },
    {
      "text": "A joyously uplifting potpourii of visual resplendence, stylish choreography and solid gold magic, one engineered to approximate the lavish spectacle the movie musical once offered ..."
    },
    {
      "text": "To make room for all the boring songs, historic facts are all but eliminated, leaving only the bare bones of Barnum's life."
    },
    {
      "text": "It may not be quite the greatest show on Earth, but Gracey, Jackman and the entire cast are deeply committed to entertaining and leave you feeling an old-school musical thrill."
    },
    {
      "text": "On its own terms, it's an achievement. If I was 13, this might please my eyes and ears."
    },
    {
      "text": "[The] many musical interludes all felt far too modern, more akin to American Idol than to the Greatest Show on Earth"
    },
    {
      "text": "Hugh Jackman's passion project embodies the infamous master of hype and the man who put the show in show business."
    },
    {
      "text": "Screenwriters Jenny Bicks and Bill Condon whitewash history at every turn, making Barnum a warm, paternal figure beloved by his sideshow performers, wife, and children."
    },
    {
      "text": "This isn't a movie musical. It's a Las Vegas revue featuring songs aiming for high rotation on a Top 40 radio station, one that will doubtlessly enthrall those moviegoers who mistake spectacle for quality."
    },
    {
      "text": "Michael Gracy's direction of Jenny Bicks' and Bill Condon's script is spectacular, warm, and grand. \"The Greatest Showman\" proves that Gracy understands both film and musical as genres of show business."
    },
    {
      "text": "The Greatest Showman is not the greatest show; my sweat was not soaking through the floor. Unfortunately, The Greatest Showman is probably not even the third-best show."
    },
    {
      "text": "Jackman takes the title \"The Greatest Showman\" to heart, and it's his drive that turns this romanticized biography into a great show."
    },
    {
      "text": "The Greatest Showman is a weapons-grade musical of the old school, loaded to its high-spirited hilt with forced smiles and willful warbling."
    },
    {
      "text": "The film is still entertaining. Its best sections are the music sequences, contemporary pop anthems with great hooks that are choreographed to communicate much better than the clunky script."
    },
    {
      "text": "Moviegoers won't learn much about Barnum here - and that's not really the point. The Greatest Showman is the type of spectacle he was known for delivering."
    },
    {
      "text": "It's a family film whose infectious, crowd-pleasing song-and-dance numbers justify a 105-minute running length when the pedestrian story can't."
    },
    {
      "text": "Jackman and Zendaya entertain in musical Barnum biopic."
    },
    {
      "text": "ll along you wonder how a story with so much potential could become a movie with so much wall-to-wall nothing."
    },
    {
      "text": "The Greatest Showman whitewashes P.T. Barnum's story, which is not in the least bit unexpected. What is unexpected is how flat the film is, despite the efforts of its talented cast."
    },
    {
      "text": "Michael Gracey taps into his visual effects background to create a feast of style, spectacle, song and sexiness, the latter brought to us by a pair of dashing leading men in Hugh Jackman and Zac Efron."
    },
    {
      "text": "Amazingly, a virtuoso Hugh Jackman as P.T. Barnum, spare-no-expense production values and a score by Oscar (La La Land) and Tony (Dear Evan Hansen) winners Ben Pasek and Justin Paul add up to a shrill blast of nothing"
    },
    {
      "text": "The film never totally gets a grip on the story it's telling, only the story it wants to tell, and as such becomes a tedious exercise in shallow extravagance and wasted talent."
    },
    {
      "text": "The music is appealing and blessedly energetic, the storytelling presented is frustratingly fractured."
    },
    {
      "text": "As with La La Land, the songwriting duo of Benji Pasek and Justin Paul have produced a catchy soundtrack that will get more plays than the actual film. [Full Review in Spanish]"
    },
    {
      "text": "For sheer, go-for-broke nuttiness, The Greatest Showman stands alone in the landscape of this holiday season's crop of movies, and I urge you to give it a chance."
    },
    {
      "text": "Ridiculously rapturous, idealistic and romantic. A film to be enjoyed and listened to ad nauseam."
    },
    {
      "text": "The broad performances, simplistic emotions and slick songs might eventually win audiences over, but only because they're too worn out to resist."
    },
    {
      "text": "It is a brisk finger-snap of a film that glitters momentarily, then is gone."
    },
    {
      "text": "[Hugh Jackman's] a consummate professional, and that job often includes grinning through material that's beneath him and a little bit embarrassing. Director Michael Gracey's biopic of circus impresario P.T. Barnum is both of those things."
    },
    {
      "text": "It's almost irrelevant that The Greatest Showman is not a very good movie because it's such an atrocious idea in the first place."
    },
    {
      "text": "The Greatest Showman is wildly entertaining even when it's spectacularly false, which is a lot of the time. But everyone is enjoying themselves on-screen, so you might as well enjoy yourself too."
    },
    {
      "text": "...so determined to make us smile it's just about enough to make you not notice the shaky foundations..."
    },
    {
      "text": "... still provides more than enough moments of pomp, joy, and poignancy..."
    },
    {
      "text": "The Greatest Showman is absolutely full of it, but it will allow your head to cool off for an hour and forty-five minutes, which, this Christmas perhaps more than any other, might be exactly what you and your family need."
    },
    {
      "text": "The songs and music numbers are what make this \"Showman\" soar."
    },
    {
      "text": "Barnum says that he's looking for something real and sometimes, in the pizzazz of the music, you forget that there's not much more to The Greatest Showman than seduction. But there's a crowd-pleasing charm to its simplicity."
    },
    {
      "text": "The Greatest Showman will work best with musical purists, those who aren't turned off by spontaneous bursts of song and an overly sentimentalized view of history."
    },
    {
      "text": "But as pure entertainment, Gracey's energetic effort succeeds in a way that goes well beyond anything I anticipated before entering the theatre."
    },
    {
      "text": "It has plenty of enjoyable musical numbers and absolutely nothing else."
    },
    {
      "text": "It often feels like a collection of slickly produced music videos, loosely tied together with a plot we're not supposed to care too much about."
    },
    {
      "text": "The Greatest Showman is a con artist's bauble, which is to say: it'll swindle you and it'll lie to you, but it's not without its charms."
    },
    {
      "text": "The music is grabby, but the story itself has problems."
    },
    {
      "text": "There's already a musical about PT Barnum, so why didn't they just make a movie of the musical Barnum?"
    },
    {
      "text": "The film doesn't skimp on the spectacle either and offers an intriguing account of the early days of the American travelling circus. This, though, is a patchy affair."
    },
    {
      "text": "... a complete dud."
    },
    {
      "text": "Played with frantic energy and dentifrice-exhibiting bonhomie by Hugh Jackman, this Barnum is a feel-good character who exists in only two dimensions."
    },
    {
      "text": "Do yourselves a favor: buy the soundtrack and make up your own plot to connect the dots in between the songs. What's there now is utterly tone-deaf."
    },
    {
      "text": "This tuneful, joyful and emotional spectacle is filled with razzle-dazzle and wonder."
    },
    {
      "text": "The songs specialise in up-tempo Glee Clubbiness. The one-pitch brio is too much of a good thing - or what may have been a good thing if it had happened on a Broadway stage."
    },
    {
      "text": "Hugh Jackman's big top musical isn't the disaster you've heard it is...but it also isn't good."
    },
    {
      "text": "The uneven script and stilted dialogue is in such contrast to the stampede of rousing musical numbers that we wonder if the project would have fared better on the stage, where a weak book linking together standout music is arguably more forgivable."
    },
    {
      "text": "Wolverine is as great a showman here as he was as MC of the 2009 Oscar ceremony."
    },
    {
      "text": "A rushed plot and underdeveloped characters help prove you can't sing your way through stories about discrimination."
    },
    {
      "text": "The joy the performers exhibit is practically contagious, and helps carry the movie over its drier patches."
    },
    {
      "text": "It's good enough to make for an entertaining musical, and it's trying very hard to sell a powerful message, but for all its merits, \"The Greatest Showman's\" different pieces don't fit together quite so well."
    },
    {
      "text": "An unabashed piece of pure entertainment, punctuated by 11 memorable songs."
    },
    {
      "text": "The film is driven to please audiences. It's like a child in a roomful of adults who tries various disruptive behaviors to gain attention."
    },
    {
      "text": "Not sure if first-time director Michael Gracey will get that much fame out of The Greatest Showman, but this cheeky monkey makes for some fun, light entertainment."
    },
    {
      "text": "Frankly, there's no reason to feel bad should you end up under The Greatest Showman's spell-that's what it's designed to do-but hang onto your sense of perspective. The whole damn movie is a passionate lie."
    },
    {
      "text": "By the end, I found myself exhausted by the idea of wonder, not to mention the film's notion that critics - those evil, fun-hating critics - are immune to it."
    },
    {
      "text": "Like a Pyongyang history book, \"Showman\" director Michael Gracey has polished away real events, ignoring Barnum's dark past and the seediness of his 19th-century New York."
    },
    {
      "text": "The film is best appreciated as a showcase for Jackman, who makes a dazzling Barnum and holds on to our sympathies even as the character proves to be something of a heel."
    },
    {
      "text": "It's got a great beat and you can dance to it (or Jackman, Efron and the rest can, anyway). And Barnum would have loved it."
    },
    {
      "text": "[Hugh] Jackman has the singing-dancing-acting chops to warrant the title. His Barnum is a heightened choice, one perhaps more suited to the stage than screen, but what a relief to sit down to a musical with a Broadway-ready cast."
    },
    {
      "text": "The expectation is that you'll go along, entranced by the \"greatest show.\" And honestly, it's really hard not to be taken away on this magical ride"
    },
    {
      "text": "The Greatest Showman's performances are of the blustery jazz hands variety. Not the musical type? Out of luck. The narrative is peanuts."
    },
    {
      "text": "The Greatest Showman is earnest, joyful, not bad enough to be bad, but not good enough to be the next Rent."
    },
    {
      "text": "The direction and the performances manage to uplift the mediocre story and songs through sheer force of will."
    },
    {
      "text": "There's nostalgic value to this three-ringed origin story. Yet the overall impact is more cloying than charming."
    },
    {
      "text": "Hugh Jackman has proven himself as one of Hollywood's - and Broadway's - greatest showmen."
    },
    {
      "text": "With nearly every number designed to evoke the faux-empowerment of a Katy Perry anthem like \"Firework\" or \"Roar,\" it becomes just as insipid as those squad goals."
    },
    {
      "text": "...stretches the truth and condenses time, Gracey's overly modern interpretation wearing its message of diversity and acceptance on its sleeve."
    },
    {
      "text": "If you treat The Greatest Showman entirely as fiction, it's an earnest, enjoyable musical, but removing it from problematic source material is a challenge."
    },
    {
      "text": "There's nothing subtle about The Greatest Showman, but its high style and relentless energy may very well seduce willing audience members."
    },
    {
      "text": "Opulent but flat-footed, and loaded down with a series of top-forty style songs that sound like rejects from 'Frozen,' the movie insistently exhorts us to celebrate diversity while itself remaining obstinately commonplace."
    },
    {
      "text": "Don't get me wrong, the Hugh Jackman-led P.T. Barnum circus musical is a bad movie, but one that's just enjoyably bad enough to keep you entertained."
    },
    {
      "text": "It's a modern musical clinging to antique musical fundamentals. As for the story, I would quote the immortal words of Jumbo the Elephant's stable boy: \"What a load.\""
    },
    {
      "text": "It's the stirring anthems and the pageantry that this movie is about, not the melodrama of its thin storyline."
    },
    {
      "text": "Even when its frayed edges are showing, the film exhibits a sheer joie de vivre so encompassing it's impossible to resist."
    },
    {
      "text": "The Greatest Showman's spectacle is overshadowed by its archaic and misguided notions of American exceptionalism."
    },
    {
      "text": "The Greatest Showman may have some awesome music and set pieces, but when it gets down to the thick of it, P.T. Barnum's personal history is largely ignored."
    },
    {
      "text": "Strikes every false note possible along its meandering path."
    },
    {
      "text": "Send in the clowns."
    },
    {
      "text": "All my general affection for a musical trying to make it in the world can't quite cover up the stink of what I think is lying at the heart of this film."
    },
    {
      "text": "Right now there's something especially uncomfortable about watching a character based on the father of entertainment spectaculars praising exaggeration, falsehood, and ignorance for its pure pleasure value, reality be damned."
    },
    {
      "text": "It's never more than adequate, and while P.T. Barnum will go down as one of the most interesting men in history, this film won't pull off the same feat."
    },
    {
      "text": "With all that corn and cheese and old-timey sentiment, \"The Greatest Showman\" ends up scoring some very timely social arguments. P.T. Barnum himself would have approved the dramatic sleight of hand."
    },
    {
      "text": "The Greatest Showman, despite its flaws, is a winning piece of work."
    },
    {
      "text": "The main problem with this idea - apart from it being completely and utterly bibbly bibbly quack-quack insane - is that once you airbrush exploitation out of the PT Barnum story, there's not much story left."
    },
    {
      "text": "Jackman is a perfect fit to play the man who invented our notion of spectacle, but this is one unspectacular musical."
    },
    {
      "text": "\"The Greatest Showman\" is all about the dizzy pleasure of letting yourself be hoodwinked, and it's a testament to the movie's idiosyncratic appeal that it never loses its power to lower your defenses and take your breath away."
    },
    {
      "text": "The story is interesting and the beats are well-acted, but it's the musical numbers that make The Greatest Showman."
    },
    {
      "text": "You'll have to completely set aside any unsavory stories you may have heard about the real-life Barnum, because this one is played by the ever-charming Hugh Jackman. Resistance is futile."
    },
    {
      "text": "Jackman is so good at selling this material that he ends up making its weakness stand out in sharper relief. In that way, he almost makes it worse by fully realizing it."
    },
    {
      "text": "Overproduced, possibly auto-tuned, hitting a carotid-popping emotional climax in the first 10 seconds and staying there, the tunes ... are sub-Andrew Lloyd Webber schlock made bearable only by the conviction of the cast."
    },
    {
      "text": "In a broader sense, the mishmash does recall the real Barnum, who once sewed half a fish to half an ape and called it a mermaid."
    },
    {
      "text": "Movie musicals walk a tricky tightrope - all that singing can be magical, or it can just be silly - and \"The Greatest Showman\" teeters, all too often."
    },
    {
      "text": "The sawdust and sequins are laid on thick, the period flashbulbs pop and the champagne flows in The Greatest Showman, yet this ersatz portrait of American big-top tent impresario P.T. Barnum is all smoke and mirrors, no substance."
    },
    {
      "text": "\"The Greatest Showman,\" for all its celebratory razzle-dazzle, in the end feels curiously lacking in conviction."
    },
    {
      "text": "An amusement park version of P.T. Barnum is fine, as far as that goes, but if you are going to aim for family-friendly fun, you need to get the fun part right."
    },
    {
      "text": "It's not a film to break moulds or test boundaries. Yet Jackman's real charm will carry you along."
    },
    {
      "text": "A lavish candybox musical bursting with broad strokes, bright colors, and bearded ladies."
    },
    {
      "text": "\"The Greatest Showman\" wants to give you a splashy good time, and does, and it's got something that takes you by surprise: a genuine romantic spirit."
    },
    {
      "text": "Glorious cinematic spectacle done exactly right. Again and again, \"The Greatest Showman\" lives up to its title."
    },
    {
      "text": "Hugh Jackman proves he is worthy of the title The Greatest Showman, there are some missteps but it's a dazzling display well worth your time."
    },
    {
      "text": "A remarkable celebration of music, creativity, and imagination. It is 2017 's La La Land and a cinematic love letter to dreamers everywhere."
    },
    {
      "text": "a profoundly confused and muddled film, with a story that's at once too thin and too busy, with everything pasted into place using a mixture of frantic pop music and Hugh Jackman's flop sweat."
    },
    {
      "text": "Part of me wants to applaud the movie for its go-for-broke styling. The rest of me is thinking that it could have calmed down just a bit."
    },
    {
      "text": "It's a broken record of ersatz positivity and empowerment, practically shout-singing at you to be all you can be while it mostly just is what it is, plastic flash without any enduring oomph."
    }
  ],
  "release_year": 2017,
  "duration": 105,
  "genres": [
    "Musical",
    "Biography",
    "History",
    "Drama"
  ],
  "age_rating": "PG",
  "synopsis": "Growing up in the early 1800s, P.T. Barnum displays a natural talent for publicity and promotion, selling lottery tickets by age 12. After trying his hands at various jobs, P.T. turns to show business to indulge his limitless imagination, rising from nothing to create the Barnum & Bailey circus. Featuring catchy musical numbers, exotic performers and daring acrobatic feats, Barnum's mesmerizing spectacle soon takes the world by storm to become the greatest show on Earth.",
  "popularity": 8.6,
  "poster_url": "https://image.tmdb.org/t/p/original/b9CeobiihCx1uG1tpw8hXmpi7nm.jpg"
}