{
  "movie_name": "The Emoji Movie",
  "movie_id": "the_emoji_movie",
  "total_reviews": 132,
  "reviews": [
    {
      "text": "It's hard to decide what is most annoying about this cinematic botch: the ugly animation, the contrived story or the blatant product placement, or the fact that the filmmakers spoil almost every gag by underlining it twice."
    },
    {
      "text": "It's a horrifying scene set atop a pile of trash, but the pure absurdity of its existence is enough to make one laugh in shock and disbelief."
    },
    {
      "text": "No one beyond the smallest of children should be entertained by this shameless money grab that fails in virtually every way."
    },
    {
      "text": "This wasn't a movie. This doesn't count."
    },
    {
      "text": "Really awful."
    },
    {
      "text": "The Emoji Movie is not suitable for kids, misrepresents the way teenagers communicate , and insults adults by trying to slip by advertisements, leaving the movie with no real audience to please."
    },
    {
      "text": "It's not good, not even acceptable, but it's neither that terrible as I was expecting. [Full Review in Spanish]"
    },
    {
      "text": "It is a bad movie and will turn your children's brains into Patrick Stewart's character."
    },
    {
      "text": "Almost shamelessly a second-rate version of Wreck-It Ralph."
    },
    {
      "text": "It's difficult to compete with the similar - and superior - concepts explored in Inside Out and Wreck-It Ralph, and the oft-travelled \"be true to yourself\" moral of the story is, well, meh."
    },
    {
      "text": "The story is downright nonsensical."
    },
    {
      "text": "You know you are in the middle of something cynical when the most interesting character in a cartoon is a walking digital hand whining about no longer being popular."
    },
    {
      "text": "Despite a talented voice cast, the film can't escape its baseline mediocrity. It's little more than an 86-minute branding exercise."
    },
    {
      "text": "In the end, there is no reason to give your money to The Emoji Movie."
    },
    {
      "text": "This movie is, like the 'meh' emoji, kinda boring, sorta funny, and totally pointless."
    },
    {
      "text": "\"I've seen worse...but I've seen a LOT better.\" I'll stand by that ... (It has) decent animation and other things, but the film left me meh."
    },
    {
      "text": "Dissing cheery children's films can feel a bit like kicking a kitten and we all know how that would go down on social media, even in animated form. But sadly this, while not as irredeemably, horribly awful as I was expecting, is still pretty rubbish."
    },
    {
      "text": "This is more than a flop - it is an unmitigated cinematic disaster that deserves to be mercilessly beaten in a brutal, bloody fashion."
    },
    {
      "text": "The Emoji Movie is cynical, dull, exhausting, soulless, joyless, pointless, and never, ever funny. But on the other hand, I enjoy the faces of disappointed children, so for me the whole experience was really kind of a wash."
    },
    {
      "text": "This is a movie that should not have been made."
    },
    {
      "text": "In an alternative universe, we could've been watching Tartakovsky's Popeye movie that was supposed to come out, but God has forsaken us and left us with \"Emoji Movie\" instead."
    },
    {
      "text": "One wishes that this movie could be erased from existence - but for now, let's hope that the burning wreckage acts as a warning to never, ever do this again."
    },
    {
      "text": "After 86 minutes of this soulless caper what can one say but ... Meh."
    },
    {
      "text": "As I exited my screening, one young lady excitedly shouted, 'It was even better than Inside Out!'."
    },
    {
      "text": "They got so wrapped up in being able to use these actual terms, songs and programs, that they didn't actually use them to do something fun."
    },
    {
      "text": "The Emoji Movie was boring, horribly paced, horribly edited, and the jokes didn't land."
    },
    {
      "text": "Almost every set or action or line of dialogue feels like the substandard equivalent of something you've seen or heard being done better elsewhere."
    },
    {
      "text": "... a weak script, with poor, ugly animations... [Full review in Spanish]"
    },
    {
      "text": "Young kids and their adult parents are the only people who'll be able to find some value to The Emoji Movie. Anyone else will probably just smash their smartphone in a bout of raging frustration."
    },
    {
      "text": "Also last but not least, our sympathies for Patrick Stewart, who lends his voice to the poop emoji. Yes, you heard that right."
    },
    {
      "text": "The script is thin and derivative, and much of the humour falls flat."
    },
    {
      "text": "Although this is clearly attempting to emulate The Lego Movie with its knowing tone, it's remains a nakedly hollow exercise all throughout. Less fun than a break-up text."
    },
    {
      "text": "80-plus minutes of excruciating mental torture."
    },
    {
      "text": "The Emoji Movie certainly ain't getting a positive review from me. But it never made me actually angry..."
    },
    {
      "text": "The design is bright and there are in-jokes for the emoji users among parents, but even with his history of great voice work (see Big Hero 6) Miller sounds like he's throwing his lines into a void."
    },
    {
      "text": "Sad to look at and joyless to watch, there's nothing on offer here for anyone but the least-demanding child."
    },
    {
      "text": "What a fine, funny, family-friendly film The Emoji Movie is."
    },
    {
      "text": "Come back, The Angry Birds Movie, you 2016 cartoon calamity! Not only is all forgiven. You are a paragon of taste, restraint and higher learning when compared to this year's app-trocity leaping from phone screen to big screen."
    },
    {
      "text": "If I'm not dreaming, I've just seen one of the boldest mainstream American movies in ages."
    },
    {
      "text": "There is nothing new under the sun in The Emoji Movie; unoriginal characters and a plot that only makes use of this new communication form to make something banal and superfluous. [Full Review in Spanish]"
    },
    {
      "text": "Plotless, joyless and cash-grabbing, The Emoji Movie deserves the brunt of our wrath because it showcases everything wrong with Hollywood."
    },
    {
      "text": "This film is almost like spending the day in the phone looking at social networks: a waste of time. [Full review in Spanish]"
    },
    {
      "text": "A catalog of situations that don't conform a unified corpus and that only tries, perhaps like the ephemeral of the messages that contain emojis, its fast forgetfulness. [Full review in Spanish]"
    },
    {
      "text": "To put it in the film's own terms, The Emoji Movie is one big pile of Patrick Stewart."
    },
    {
      "text": "A comedy that tries to tune with these times, but that will not remain precisely in the history of the genre. [Full review in Spanish]"
    },
    {
      "text": "This is ... a horrible intention hidden (badly) behind a piece of entertainment, a corporate meeting translated into a film, only it isn't a film, it's an advert, a gathering of flies feasting on the wounded corpse of art and culture."
    },
    {
      "text": "With its relatively brief running time of 85 minutes, The Emoji Movie provides passable entertainment for the children."
    },
    {
      "text": "From its cringey premise, there was little hope that The Emoji Movie would be anything but awful. The premonition is correct."
    },
    {
      "text": "One of the worst films of the year. It's the poop emoji personified."
    },
    {
      "text": "In its tv animation of the 80s and its incongruities of style, perhaps reflects the strange present that we are living better than Pixar and its first level competitors. [Full review in Spanish]"
    },
    {
      "text": "On the whole, there are worse ways to waste 86 minutes-but waste them you will."
    },
    {
      "text": "Not just bad, but it's offensively boring, and tedious."
    },
    {
      "text": "The audience is paying to be subjected to all this free advertising. Shouldn't that be the other way round?"
    },
    {
      "text": "An embarrassing exercise in advertising. Insert poop emoji here. [Full review in Spanish]"
    },
    {
      "text": "Let's hope this isn't the future of animated features."
    },
    {
      "text": "Mind-numbing cinematic malware - a total time-waster!"
    },
    {
      "text": "An one-hour and twenty-minute blatant spot on \"the secret life of your smartphone\". [Full review in Spanish]"
    },
    {
      "text": "A cinema release perhaps without equal this year in terms of how shockingly dreadful it is."
    },
    {
      "text": "Yes, I'm aware I may be thinking a little too pedantically about a trivial children's cartoon. This is how your mind wanders, though, when you're a sentient adult stuck in front of a film as vapid as this one."
    },
    {
      "text": "Occasionally it's as if The Lego Movie is reaching out a long, friendly arm to Inside Out and falling into the chasm between. But the film is inventive too."
    },
    {
      "text": "The worst thing in this consistently dire effort to pick the pockets of young, vulnerable cretins is its determination to exploit the unworkable premise to death and beyond."
    },
    {
      "text": "A strident palette of candy-coloured empty calories and poop jokes and a cynical message about accepting yourself had me searching for an emoji showing a dispirited film critic hanging from a noose fashioned from a phone-charger cable."
    },
    {
      "text": "This is a charmless and ham-fisted production whose cynical attempt to connect with the young is surely destined to fail."
    },
    {
      "text": "This new animated film only seeks to exalt an indifferent, impersonal and cynical world in which we are led to believe that the best way to communicate is by sending and receiving clumsy little faces. [Full review in Spanish]"
    },
    {
      "text": "The Emoji Movie is not just a critical flop, but also a metaphor for a Hollywood that is struggling to find the line between branding that audiences love and branding that audiences resent."
    },
    {
      "text": "There's no reason why this animated comedy adventure needed to be this pointless."
    },
    {
      "text": "No matter how bad you expected The Emoji Movie to be, believe me when I tell you, from the bottom of my heart, that it is so much worse."
    },
    {
      "text": "The Emoji Movie is so painfully lame and an 86-minute reminder that Hollywood could do better because your children deserve better."
    },
    {
      "text": "The main problem with \"The Emoji Movie\" is how confused it is about what audience to appeal to. (Full Content Review for Parents - Violence, Crude Humor, etc. - also Available)"
    },
    {
      "text": "The Emoji Movie's derivative nature, weak humor and questionable messaging should direct the family budget elsewhere."
    },
    {
      "text": "This is just a boilerplate animation, zestless, pointless."
    },
    {
      "text": "Far be it from me to insist that a sincere Emoji Movie couldn't work, but just as inconsistent as the sci-fi is the emotionality."
    },
    {
      "text": "Sir Patrick Stewart, stalwart thespian and former captain of the Starship Enterprise, voices a poop emoji. Which sort of says it all, really."
    },
    {
      "text": "Sad faces all around."
    },
    {
      "text": "Not only does this film hate its very subject matter, it's also the most hideous example of product placement in cinematic history."
    },
    {
      "text": "If The Emoji Movie were trying to be funny and missing, or even striving for so-bad-it's-entertaining territory, it wouldn't be as tediously awful as the wishy-washy product that it is."
    },
    {
      "text": "It fails to deliver any emotion."
    },
    {
      "text": "Grim and grubby business from start to finish, this ninety-minute product-placement nightmare is like a version of Pixar's ​Inside Out made by a sinister cabal of dead-inside marketing execs."
    },
    {
      "text": "As animated children's films go, this one's pretty okay."
    },
    {
      "text": "An animated movie with few decent elements and an idea that other films have executed infinitely better. [Full review in Spanish]"
    },
    {
      "text": "It's gaudy and goofy enough to convince you, at a glance, that it's harmless... Well, let me tell you: The Emoji Movie exists, and it's a big, dumb, dishonestly corporate pox on all strains of culture, whether popular or technological."
    },
    {
      "text": "Around nine tenths product placement, at least 15 tenths abysmal, and pulsates with molten cynicism on every imaginable level."
    },
    {
      "text": "Is \"meh\" the sound the world will make when it finally sputters out? It doesn't matter because we are clearly #sooverit."
    },
    {
      "text": "The Emoji Movie is based on an idea which must have seemed very clever in theory but turns out to be cumbersome in practice."
    },
    {
      "text": "Certainly the idea of an Emoji Movie is worse than what is actually onscreen. And I was actually a little amused when the \"smiley\" or other \"meh\" emoji struggled to express themselves."
    },
    {
      "text": "A disastrous, shameless attempt to cash in on the ubiquity of the icons that populate our text messages."
    },
    {
      "text": "It's actually quite ironic that a film about characters that represent emotions should be so devoid of any heart or warmth."
    },
    {
      "text": "You sum up 'The Emoji Movie' with one symbol."
    },
    {
      "text": "It would be hard to forgive The Emoji Movie its \"meh\" plotline and the fact that it is literally one giant ad for apps, but its most unforgivable sin is that it perpetuates the notion that emojis are childish."
    },
    {
      "text": "Abandon all hope, ye who enter here."
    },
    {
      "text": "Please, never again."
    },
    {
      "text": "Unfunny and unengaging, The Emoji Movie combines product placement, ingratiating voice-work and barrel-scraping studio desperation, all while having the gall to peddle a 'be yourself' message."
    },
    {
      "text": "Fie on this movie. Fie on those who bankrolled it, fie on those who wrote and directed it, fie on anyone who participated in it."
    },
    {
      "text": "The Emoji Movie is the worst of cinema made for children and families-a lazy, barely developed story that relies on audience recognition of phone apps. Not funny or fun."
    },
    {
      "text": "The Emoji Movie should not be supported because it celebrates lazy filmmaking, bad storytelling, and materialism."
    },
    {
      "text": "If you're looking for a substitute viewing experience chock full of bright colors and erratic animation, you're better off staring at a smartphone for an hour and a half."
    },
    {
      "text": "I had no intention of seeing \"The Emoji Movie\" --- we all have our limits --- but David insisted we attend the screening."
    },
    {
      "text": "At its best, this seems like a second-rate version of Pixar's Inside Out. At its worst, it's a cash-grab based on a cynical high-level concept."
    },
    {
      "text": "\"The Emoji Movie\" won't win any prizes for animation, but at least it's an adventurous idea that will appeal to a variety of people."
    },
    {
      "text": "The small-scale achievements in this film are a model worthy of admiration; In terms of the balance that can be achieved between creativity and commercialization in a production that seeks to generate family entertainment. [Full review in Spanish]"
    },
    {
      "text": "The film is boldly bad, yes, but also boldly boring."
    },
    {
      "text": "I don't think I can say anything funny about this, because it makes me want to die."
    },
    {
      "text": "There's a justifiable self-loathing running through The Emoji Movie, a fragile attempt to (sigh) deconstruct the meaning of Emojis while also (sigh) demonstrating the profound possibility that Emojis are the language of the future."
    },
    {
      "text": "Hating The Emoji Movie is easy, not to mention fun, necessary, and appropriate."
    },
    {
      "text": "Disregard that PG rating and keep your children far away from director Tony Leondis' vile animated faux-comedy. Beneath its trippy surface lurks an insidious philosophy hazardous to impressionable minds."
    },
    {
      "text": "Positive messages, but colorful adventure is mostly \"meh.\""
    },
    {
      "text": "The Emoji Movie squanders the talents of its capable voice cast on an animated film that is as cynical in its outlook as it was in its conception."
    },
    {
      "text": "A demonstration of artistic abdication at its most venal, but will the kids like it?"
    },
    {
      "text": "A soulless endeavor and a painful viewing experience. Your kids deserve better."
    },
    {
      "text": "A viewer leaves The Emoji Movie a colder person, not only angry at the film for being unconscionably bad, but resentful of it for making them feel angry."
    },
    {
      "text": "It's a movie that's too bland for adults, too cutesy and juvenile for teens and pre-teens, and too confusing for kids. In other words, it's a movie for no one..."
    },
    {
      "text": "While The Emoji Movie manages to find some ingenious ways of explaining the \"daily life of an Emoji,\" its inability to deliver emotionally or thematically keeps it from ever feeling like a worthwhile experience."
    },
    {
      "text": "It may pass the time amiably enough for the little ones. But parents may find themselves surreptiously reaching for their phones to find something more interesting to look at."
    },
    {
      "text": "Excuse me while I scan my phone for the vomit emoji."
    },
    {
      "text": "Hear that? It's the end of the world."
    },
    {
      "text": "There were ways that The Emoji Movie could have been [...] smart and satisfying, but the filmmakers just didn't find them. Maybe they weren't even looking."
    },
    {
      "text": "There could be far worse ways to spend 86 minutes. But maybe, just maybe, it'd be the better choice to spend those 86 minutes outside, or reading a book, or talking face-to-face with another human being. Because The Emoji Movie could not be more meh."
    },
    {
      "text": "Do yourself a favor, and swipe left on this one."
    },
    {
      "text": "This movie's \"believe in yourself\" message is borne out, in a perverse way, by the very fact that it even exists. And yet the whole thing remains nakedly idiotic."
    },
    {
      "text": "The good news is The Emoji Movie, co-written and directed by Tony Leondis, is not evil. The bad news is it's just mediocre, or in emoji parlance, simply \"meh.\""
    },
    {
      "text": "The Emoji Movie shows how low Hollywood will sink for easy 💰."
    },
    {
      "text": "Looking back, it seems so obvious. We should have seen The Emoji Movie's utter awfulness coming. But as with so many other things in 2017, hindsight is not so much 20/20 as a giant regret generator."
    },
    {
      "text": "As far as expanding on smartphone-related IP, this is an even weaker starting point than Sony Animation's recent The Angry Birds Movie."
    },
    {
      "text": "If only this smartphone-centric dud, so happy to hawk real-world apps to its audience, could have done the same in its release strategy - coming out via Snapchat, where it would vanish shortly after arrival. But even that wouldn't be fast enough."
    },
    {
      "text": "There have been worse ideas, but in this case the execution isn't good enough to bring the notion of an emoji movie to funky, surprising life."
    },
    {
      "text": "It is one of the darkest, most dismaying films I have ever seen, much less one ostensibly made for children."
    },
    {
      "text": "A film as mindless and disposable as most smartphone apps (and nowhere near as addictive), \"The Emoji Movie\" is a calamity that inadvertently shows how difficult it is to pull off the witty, imaginative world-building that Pixar makes seem so breezy."
    },
    {
      "text": "The Emoji Movie is almost as bad and brutally depressing as everything else in 2017."
    },
    {
      "text": "Lacks humor, wit, ideas, visual style, compelling performances, a point of view or any other distinguishing characteristic that would make it anything but a complete waste of your time."
    },
    {
      "text": "It's not the worst thing ever made, but it is seemingly afraid to commit to being a coming-out parable."
    },
    {
      "text": "Crappy. (If you prefer the poop emoji, that works too.)"
    },
    {
      "text": "The Poochie of movies."
    }
  ],
  "release_year": 2017,
  "duration": 86,
  "genres": [
    "Kids & Family",
    "Comedy",
    "Adventure",
    "Animation"
  ],
  "age_rating": "PG",
  "synopsis": "Hidden inside a smartphone, the bustling city of Textopolis is home to all emojis. Each emoji has only one facial expression, except for Gene, an exuberant emoji with multiple expressions. Determined to become \"normal\" like the other emojis, Gene enlists the help of his best friend Hi-5 and a notorious code breaker called Jailbreak. During their travels through the other apps, the three emojis discover a great danger that could threaten their phone's very existence.",
  "popularity": 3.6,
  "poster_url": "https://image.tmdb.org/t/p/original/60bTx5z9zL1AqCjZ0gmWoRMJ6Bb.jpg"
}