{
  "movie_name": "The Imitation Game",
  "movie_id": "the_imitation_game",
  "total_reviews": 285,
  "reviews": [
    {
      "text": "The Imitation Game takes too many dramatic liberties in adapting for the screen but at the end of the day, the film does help right a wrong in recognizing the code-breakers--including Alan Turing--for their work during World War II."
    },
    {
      "text": "The movie goes beyond requiem thanks to Cumberbatch's performance, the supporting actors and the surprising intensity of a spy thriller set mainly in two rooms and a garage. [Full review in Spanish]"
    },
    {
      "text": "Call out the \"Oscar bait\" planning and intentional polish all you want, but you won't be seeing a bad film whatsoever.  You will be seeing a calculated crowd pleaser with perfect delivery, through and through."
    },
    {
      "text": "The aftertaste is somewhat schizophrenic: the founder of one of the pillars of our time was both a hero and martyr. It's a riddle the film doesn't try to solve. [Full review in Spanish]"
    },
    {
      "text": "The Imitation Game does a fine job of making Turing's life story accessible for mass consumption—arguably to a fault."
    },
    {
      "text": "With its focus on the internal struggle as significant as the code-breaking itself, it sets it apart from its Bletchley Park predecessor, the decidedly wet Enigma."
    },
    {
      "text": "The film deserves credit for pointing viewers in the direction of such a compelling individual and historical drama."
    },
    {
      "text": "Supporting cast and period production values are top notch, but it's Cumberbatch who excels, peeling back the layers of Turing's enigmatic life."
    },
    {
      "text": "Unfortunately, the film suffers from a weak script that fails to properly educate the audience about Turing...and it also downplays Turing's homosexuality."
    },
    {
      "text": "Manages a surmounting level of intrigue from both its deft performances and its shuffling narrative of past, present, and post-war events."
    },
    {
      "text": "The accolades bestowed on this otherwise well mounted but incredibly milquetoast production is the political statement that the film simply does not have the courage to muster on its own."
    },
    {
      "text": "It's right that the film is recognised for its dramatic performances, in particular Benedict Cumberbatch who shines in the role as Alan Turing. But ultimately once it ends you may feel you've seen better movies."
    },
    {
      "text": "The curious thing about The Imitation Game, without falling into bombast, is that it breaks codes with the wonderful performance of Benedict Cumberbatch. [Full review in Spanish]"
    },
    {
      "text": "One of the film's achievements comes from hinting at the enormous power possessed by an unseen monarch..."
    },
    {
      "text": "Benedict Cumberbatch...Mark Strong and Matthew Goode... each delivers enigmatic performances that challenge the audience to think and look below the surface for the truth of each real life character portrayed."
    },
    {
      "text": "Though hindsight is always 20/20, The Imitation Game gives us a fair and balanced glance at the tragedies that prejudice and inequality can cause. Turing achieved more in one war-torn decade than Bill Gates or Steve Jobs."
    },
    {
      "text": "It is watchable and entertaining but more importantly it's a movie that reveals to the world a man who's achievements many more should celebrate."
    },
    {
      "text": "Cumberbatch conveys tortured humanity behind the analytical façade, even if we also understand and even chuckle at how frustrating Turing could be to those working with him."
    },
    {
      "text": "Restrained and tasteful in a very British sort of way, but it almost seems afraid to tackle its subject head on."
    },
    {
      "text": "Gorgeously realised, engagingly witty and with great performances all around, The Imitation Game is engrossing and accomplished."
    },
    {
      "text": "Keira Knightley is cut-glass and surprisingly convincing as Joan Clark."
    },
    {
      "text": "Cumberbatch is great as Turing."
    },
    {
      "text": "The only reason I can surmise for the positive reviews The Imitation Game is that it confirms all the \"normal\" audience's worst suspicions about \"genius\" and queer life, without offering any meaningful insight into either."
    },
    {
      "text": "To be honest, I'm a bit surprised that there hasn't been more pushback against The Imitation Game by intelligence professionals, historians, and survivors of Turing's circle."
    },
    {
      "text": "The Imitation Game is a film that will in all likelihood earn Benedict Cumberbatch his first Oscar nomination, for he absolutely shines as Alan Turing in this top-notch biopic."
    },
    {
      "text": "The Imitation Game purposefully hits the mark in shining the light on one the most heroic figures of the 20th century."
    },
    {
      "text": "Graham Moore's screenplay has the right mix of political tension with some surprising humor sprinkled in."
    },
    {
      "text": "The Imitation Game makes all of this quite engrossing, with very smart dialogue, a sense of urgency and a persuasive arc."
    },
    {
      "text": "This film is spectacular in its simplicity. The quiet story is filled with intelligence, wit, anger, sadness, triumph and tragedy."
    },
    {
      "text": "This isn't a movie with any ideas about that. It just wants to portray the Turing that beat Enigma, and in that it does a perfectly reasonable job."
    },
    {
      "text": "[Cumberbatch's] Turing is full of ticks and tweaks that feel like an Asperger's poster boy but he's still able to craft a strong portrait of a troubled virtuoso."
    },
    {
      "text": "It's this career-best turn from Cumberbatch which helps to raise the game of this highly entertaining but technically functional British biopic."
    },
    {
      "text": "The entire cast seems to have found the roles for which they were best suited. Together they give a passionate, energetic and emotional performance worthy of an Oscar win on every level."
    },
    {
      "text": "As wonderful as Cumberbatch's performance is in many ways, we can't help thinking Turing deserved a better, more well-rounded exploration of his life than this film allowed for."
    },
    {
      "text": "It's very satisfying when a movie manages to generate some discussion, and makes one want to know more about its source of inspiration. [Full review in Spanish]"
    },
    {
      "text": "Norwegian director Morten Tyldum occasionally settles on conventional biopic devices, but doesn't allow the narrative to lose any momentum."
    },
    {
      "text": "With apologies to all the historians out there, I have to say that given how much I enjoyed The Imitation Game, I don't really care how factually accurate it is."
    },
    {
      "text": "Why has it taken so long for Hollywood to tell this fascinating and deeply tragic story"
    },
    {
      "text": "An affecting tale of an extraordinary human being."
    },
    {
      "text": "The Imitation Game is a hugely flawed film, but one I can't help liking anyway."
    },
    {
      "text": "The Imitation Game retakes the myth, interprets it again and in this is lost something of the innocence of a story turned into legend. [Full review in Spanish]"
    },
    {
      "text": "A conventional but first-rate spy thriller."
    },
    {
      "text": "The Imitation Game is a wonderful adaptation of his story, full of brilliant performances, an engaging directing style, and an exuberant soundtrack."
    },
    {
      "text": "A strong supporting cast, including Matthew Goode as crypto-analyst Hugh Alexander, Mark Strong as spymaster Stewart Menzies and Charles Dance as head of the codebreaking unit Alastair Denniston, are given tragically little screen time."
    },
    {
      "text": "The Imitation Game is a classic 'race against time' tale with the added intrigue of how the authorities would deign to use the information they had once Enigma had been cracked."
    },
    {
      "text": "The Imitation Game is a polished and efficient drama, and looks great on a comparatively modest budget of 15 million, especially the loving reconstruction of Alan's beautiful machine."
    },
    {
      "text": "The Imitation Game is a gripping and satisfying film which occupies dual genres, featuring a stunning performance from Cumberbatch. Another one to watch on Oscar night, for sure."
    },
    {
      "text": "For all its broad strokes, it is a historical drama whose high stakes and underdog hero makes it the kind of commercial fare Hollywood has always done best."
    },
    {
      "text": "It's an exciting, fast-paced, beautifully photographed and often enthralling race against time, as well as a riveting social commentary on sexism and sexuality."
    },
    {
      "text": "Weapons-grade Oscar-bait designed to earn months of plaudits before being promptly forgotten."
    },
    {
      "text": "The Imitation Game somehow makes manually breaking code thrilling."
    },
    {
      "text": "The narrative flows smoothly despite tackling three time periods (Turing's present, his Bletchley Park days, and his school years), the casting and performances work, and Cumberbatch, in his first lead role, is an energetic and compelling presence."
    },
    {
      "text": "Cumberbatch helps elevate what could've been a rote boilerplate biopic into a film with the spark of a live wire."
    },
    {
      "text": "Turing (Benedict Cumberbatch) is front and centre in the new film and he's characteristically brilliant, though anyone hoping for a nuanced portrayal of one of the 20th century's most brilliant minds needs to look elsewhere."
    },
    {
      "text": "Does The Imitation Game fudge the edges of its hero's biography? Guilty. But there's artistic truth to the maxim uttered at the end of John Ford's The Man Who Shot Liberty Valance: \"When the legend becomes fact, print the legend.\""
    },
    {
      "text": "It glosses over what exactly made Alan Turing so brilliant, resulting in a monochromatic picture that could have been - should have been - told in bright, striking color."
    },
    {
      "text": "Dialogue is witty and performances are first-rate. While it's Cumberbatch's show, Knightley is very good as a woman thrilled at being able to put her intelligence to use."
    },
    {
      "text": "[Turing is] a puzzle, yes, but to its credit, The Imitation Game doesn't pretend to solve him."
    },
    {
      "text": "First-rate performances and an irresistibly exciting and moving story help this drama rise above the traditional biopic."
    },
    {
      "text": "Altogether, The Imitation Game is a film that will give you plenty to think about."
    },
    {
      "text": "A formulaic but engaging biopic, The Imitation Game is a perfectly good film, just not nearly the film it could have been."
    },
    {
      "text": "A genuinely good film about a fascinating true story."
    },
    {
      "text": "Dazzlingly performed with great creativity. [full review in Spanish]"
    },
    {
      "text": "A flawed biopic anchored by solid performances and fascinating drama even if it poorly handles its gay subject matter."
    },
    {
      "text": "A very thoughtful and bewildering drama about a man who was meant to do great things in a world that was not ready to accept his eccentricities."
    },
    {
      "text": "An enthralling spy thriller-turned-prestige bio pic that features a world-class performance by Benedict Cumberbatch."
    },
    {
      "text": "The intriguing subject matter is, to an increasingly dismaying degree, rendered moot by filmmaker Morten Tyldum's run-of-the-mill sensibilities..."
    },
    {
      "text": "As much as I wanted to suspend my disbelief and take pleasure in the actors' brilliance, The Imitation Game lacks credibility on every level. Still, Cumberbatch, Keira Knightley... [and] Mark Strong are terrific."
    },
    {
      "text": "Solid historical drama about someone who changed the world but is unknown today."
    },
    {
      "text": "A highly entertaining, immaculately produced drama about a genius-hero whose stiff-upper-lip resolve can't block a kick in the teeth when, years after the war, he is prosecuted for the 'crime' of homosexuality."
    },
    {
      "text": "The story, though considerably altered to make it more dramatic, is an interesting one, and Turing and Clarke's relationship is compelling in the film. Cumberbatch and Keira Knightley both give great performances in this film."
    },
    {
      "text": "A well-crafted character study which just might land the talented Benedict Cumberbatch a coveted Academy Award."
    },
    {
      "text": "A moving tribute to an extraordinary man."
    },
    {
      "text": "Cumberbatch gives a performance that is, by turns, awkward, triumphant, and heartbreaking."
    },
    {
      "text": "Deftly directed by Morten Tyldum (Headhunters), the film does a great job building tension as these eggheads bond in a common cause against the Nazis. Yet as a cinematic celebration of the work Turing and his team did, the film is heavily qualified."
    },
    {
      "text": "The Imitation Game both brings to life and pays tribute to Turing's history-altering and pioneering work that paved the way for modern computing."
    },
    {
      "text": "Nearly every moment is infused with Importance."
    },
    {
      "text": "If you don't know who mathematician Alan Turing (Benedict Cumberbatch) was, then 'The Imitation Game' is a solid introduction to this complex individual whose discoveries were the foundation of the modern computer."
    },
    {
      "text": "What's with the fascination in 2014 about World War II? This is the best of three very good films and looks at the invention of the computer by an unusual cast of characters."
    },
    {
      "text": "The Imitation Game walks a fine line in making the familiar effective, also reflecting A Beautiful Mind at points."
    },
    {
      "text": "Benedict Cumberbatch gives a superbly nuanced performance, imbuing Turing with just the right amount of strangeness to make him endearing but not treacly"
    },
    {
      "text": "The Imitation Game is impressive, particularly due to Cumberbatch and Knightley and the highs and lows of Turing's truly remarkable life."
    },
    {
      "text": "Cumberbatch brings his immense talent and intelligence -- and not too much glamour -- to the socially awkward, notoriously disheveled protagonist."
    },
    {
      "text": "A rich performance with the pathos and drama of a new age of technology set within the hardships of war."
    },
    {
      "text": "...a fine, old-fashioned Hollywood biopic of the man, filled with quality actors, an entertaining script, and the inevitable degree of minor fact-fudging to make things move along a little quicker."
    },
    {
      "text": "It's hard to make the workings of the scientific mind dramatic, but unfortunately The Imitation Game doesn't even try."
    },
    {
      "text": "Enthralling history unveiled in this well-acted film"
    },
    {
      "text": "Is The Imitation Game middlebrow stuff as some have claimed? In a sense, yes, it probably is, but that doesn't prevent it being compelling entertainment."
    },
    {
      "text": "What could have been a very dry and earnest film emerges, under the intelligent direction of Norwegian Morten Tyldum working from a screenplay by Graham Moore, as a gripping and still rather extraordinary story."
    },
    {
      "text": "The \"action\" here is Turing tinkering with his machine. Or simply thinking -- which, as Cumberbatch portrays it, is adventure of the highest order."
    },
    {
      "text": "Benedict Cumberbatch's sensitive, moving performance is the film's beating heart, and the best reason to see it."
    },
    {
      "text": "The Imitation Game has finally given Turing's remarkable legacy the broad cinematic respect it merits by showcasing it proudly in one of the five best films of the year."
    },
    {
      "text": "Cumberbatch's performance is riveting, but Knightley deserves credit for doing it backwards and in heels, so to speak. In fact, Clarke probably deserves her own biopic as one of the few female practitioners of the code-breaking art."
    },
    {
      "text": "The Imitation Game is an astounding story, both for its marvel and its misery."
    },
    {
      "text": "It has flashes of brilliance, but can't sustain that greatness through its air of self-importance. It seems so bent on being a great movie that it falls short of being a good one."
    },
    {
      "text": "Knightley here gives a mature performance that matches Cumberbatch's in commitment."
    },
    {
      "text": "Cumberbatch's masterful performance dominates the movie, inevitably evoking his updated version of [Sherlock] Holmes... But where his Sherlock is smooth and lofty, his Turing is lofty with rough, jagged edges that keep rubbing people the wrong way."
    },
    {
      "text": "We go into a movie knowing that the subject was as genius or a hero, a martyr or titan. We should leave with a more nuanced understanding of who he was, his complexities and flaws."
    },
    {
      "text": "This suspenseful drama reveals pieces of its puzzle steadily and slowly, until the final heartrending picture can be seen at last."
    },
    {
      "text": "From sets and costumes to Alexandre Desplat's musical score, The Imitation Game is everything classy that Hollywood wishes it could be."
    },
    {
      "text": "For the filmmakers, there are simplifications that must have been inevitable, for dramatic and narrative purposes, when it comes to depicting the years of wartime work. But what of the other choices that have been made?"
    },
    {
      "text": "No stiff upper-lipped acting stone is left unturned in Morten Tyldum's earnest, honest account of the life of Alan Turing."
    },
    {
      "text": "A compelling true story of perseverance and persecution, The Imitation Game has a lot of information it must convey to its audience. Time is of the essence. And time was always running out for Alan Turing."
    },
    {
      "text": "With a lesser actor, The Imitation Game would have collapsed on its good intentions. Cumberbatch brings such a raw personal passion to his work, he elevates the better parts to a superb level and keeps the miscues to a minimum."
    },
    {
      "text": "The Imitation Game is a great story that's well-told, about a man who was different from many of us -- which is to say that he was exceptional at a time when the world needed such a man most."
    },
    {
      "text": "This beautifully designed and photographed period drama, adapted from Andrew Hodges' book The Enigma by debut screenwriter Graham Moore, centres on three important points of Turing's life."
    },
    {
      "text": "Cumberbatch is terrific. His Turing is an intense, intellectual force and stirring mix of remote, vulnerable and present."
    },
    {
      "text": "[Benedict Cumberbatch] has had a meteoric rise, and for good reason -- he's really good at what he does. Here, he does a lot with a little."
    },
    {
      "text": "In a year of terrific performances by leading men, Cumberbatch gets my vote for top honors."
    },
    {
      "text": "Even though its construction feels (*cough*) formulaic and (*ahem*) by-the-numbers, it's all in service of making Alan Turing's legend known -- as well as the tragically unjust actions taken upon him years afterwards."
    },
    {
      "text": "Cumberbatch is the main event here, making something almost impossible (capturing such a man as Turing in a tidy two-hour package) look easy, important, and appropriately imperfect."
    },
    {
      "text": "It's mostly to Cumberbatch's credit that The Imitation Game plays like a solid, engaging historical drama, interesting enough to suit audiences that aren't interested in either World War II history or technology."
    },
    {
      "text": "Morten Tyldum's masterful drama neither shies away from Turing's homosexuality nor lingers on it, framing nail-biting events at Bletchley Park with the mathematician's 1951 arrest in Manchester."
    },
    {
      "text": "It's a well told but somewhat unexciting and placid little movie that, despite the star wattage, you'd expect to catch on a Sunday afternoon on BBC2."
    },
    {
      "text": "This film about one of the past century's smartest humans at times treats its own audience like a classroom of remedial learners."
    },
    {
      "text": "It's a film about drive, about imagination, and how brilliance thrives outside the mainstream. These are common enough themes given uncommon purchase in a film about a man who likely saved millions of lives by never fitting in."
    },
    {
      "text": "[Cumberbatch's] whose portrayal of the British mathematician and WWII code-smasher is a feat of nuanced intelligence, a portrait of anguish with hints of arid humor. And, yes, arrogance."
    },
    {
      "text": "Cumberbatch does what he can to fill in the blanks and he is the real thing here -- all shyness, rudeness, acid comments, pathos, dazzling intellect and aching melancholy, while suppressing his velvety star charisma."
    },
    {
      "text": "This is a human drama that invites you to think, not just about the technicalities and the philosophies behind code-breaking, but also the social and psychological themes."
    },
    {
      "text": "Not the year's boldest, but has perhaps one of the year's best performances"
    },
    {
      "text": "It's easy to see why The Imitation Game has been so well received. The story of Alan Turing is both fascinating and disturbing."
    },
    {
      "text": "The film is meant to pay tribute to Turing but also isn't afraid to expose his struggles and flaws, and manages to enlighten whether or not you're already familiar with his name and accomplishments."
    },
    {
      "text": "An engaging story about a remarkable person."
    },
    {
      "text": "a thriller that really does thrill and at the same time draws viewers into a mathematical problem."
    },
    {
      "text": "Benedict Cumberbatch gives a performance sure to be remembered come Oscar nomination time"
    },
    {
      "text": "Benedict Cumberbatch gives an empathy-stirring performance in the year's best biopic."
    },
    {
      "text": "Turing's optimism in the face of the seemingly impossible wins our affection and sympathy, making his ultimate fate all the more heartbreaking."
    },
    {
      "text": "Cumberbatch is not that good-looking, folks. And, his farts do NOT smell like roses. But, with that rant out of my system now, I must say he impresses as Turing. The role seems custom-made."
    },
    {
      "text": "A vibrant work that refuses to be relegated to the status of just another Brit biopic appearing in the thick of awards season."
    },
    {
      "text": "Produced with a Masterpiece Theater eye for period detail, but also with a missionary's zeal to honor a wrongly dishonored man."
    },
    {
      "text": "Performances are fiery and committed, successfully communicating the brain-bending decoding mission and its many areas of paranoia, deception, and dark confession."
    },
    {
      "text": "Cumberbatch is moviedom's man of the moment, and with this painfully human performance, the actor who has specialized in difficult geniuses finally cracks the code of compassion."
    },
    {
      "text": "This film's overall success hangs on Cumberbatch and what is, to date, his finest performance on the big screen."
    },
    {
      "text": "He's an underappreciated hero brought to life through Cumberbatch's brilliant performance. It may not be Turing-level brilliant, but it's not far off."
    },
    {
      "text": "A rousing, only slightly qualified success."
    },
    {
      "text": "The film plays out in a satisfying manner, but with subtlety having served its purpose, it becomes increasingly bombastic about its intent."
    },
    {
      "text": "Despite the instances when it strays from, or grossly simplifies, the record...succeeds in presenting an affecting portrait of Alan Turing."
    },
    {
      "text": "It would be hard to foul up the story of Alan Turing, and thankfully The Imitation Game doesn't."
    },
    {
      "text": "Cumberbatch moves effortlessly from master thinker to vulnerable lost soul to socially awkward twit to cagey pragmatist."
    },
    {
      "text": "Despite its title, Tyldum's film isn't some imitator or wannabe. Rather, The Imitation Game, highlighted by a layered turn from Benedict Cumberbatch, is the real deal."
    },
    {
      "text": "Turing may finally be getting what he deserves as the straightforward and well-acted The Imitation Game, featuring a strong performance from Benedict Cumberbatch as Turing."
    },
    {
      "text": "Cumberbatch refines his Sherlock Holmes routine and carries a rousing movie about how English cryptographers cracked Germany's military code and shortened World War II."
    },
    {
      "text": "No movie with as many excellent actors as \"The Imitation Game\" can fail to be interesting."
    },
    {
      "text": "\"The Imitation Game\" is both an education and a pleasure - and another chance to revel in what Cumberbatch can convey in eloquent silence."
    },
    {
      "text": "Unlike The King's Speech, which won a clutch of Oscars for its dull propriety and Masterpiece Theater vibe, The Imitation Game is vibrant and lively, engaging you on several levels."
    },
    {
      "text": "Cumberbatch's finely calibrated performance helps bring to life one of history's lesser-known stories and most shameful injustices."
    },
    {
      "text": "Consider the code cracked, translated, and laid out for all to see: different is special is good, and ordinary morality is a sham, anyway."
    },
    {
      "text": "It's an exceptional piece of work, while serving as a commentary of how the fight for human rights is still very much in its infancy, and how far we still have to go."
    },
    {
      "text": "Cumberbatch Heartbreaking, Brilliant in \"Game.\""
    },
    {
      "text": "Succeeds at rendering an irascible man sympathetic."
    },
    {
      "text": "The film is rarely anything but entertaining and humorous but its approaches are visibly commercial."
    },
    {
      "text": "The Imitation Game is a story that needed to be told; the highest compliment I can give Mr. Tyldum, Mr. Cumberbatch, Mr. Moore and their collaborators is that they've honoured Alan Turing."
    },
    {
      "text": "An agonisingly shallow, de-historical depiction of Turing as psychological agent."
    },
    {
      "text": "It's easy to see The Imitation Game as a triumph - after all, Turing accomplished what all the experts claimed was impossible - but it's equally apparent that underlying the triumph is a tragedy."
    },
    {
      "text": "Serviceably dramatizes an important historical story while giving rising star Cumberbatch suitably juicy material."
    },
    {
      "text": "I am reasonably familiar with the subject matter, yet the film still manages to knock my socks off"
    },
    {
      "text": "A riveting biopic, in which Benedict Cumberbatch portrays the eccentric mathematician who breaks the unbreakable WWII German code with unerring virtuosity. The completeness of Cumberbatch's performance makes it one of the year's best"
    },
    {
      "text": "It's a lovely year end present. Near perfect, and damn entertaining with moments of thrills, triumph, and sadness..."
    },
    {
      "text": "Cumberbatch's Aspergian odd man out is this film's greatest asset. Knightley is delightful."
    },
    {
      "text": "Many actors are too cowardly, or too egotistical, to play an unsympathetic character. So Cumberbatch's performance deserves more consideration than many of his peers'."
    },
    {
      "text": "As uncomplicatedly likeable and effortlessly rootable as its main character and star, The Imitation Game ultimately wins at any easy game, when it could have risked - and revealed - so much more."
    },
    {
      "text": "With the book by Hodges and now this film by Tyldum, hopefully Alan Turing will receive the recognition he was so wrongly denied."
    },
    {
      "text": "You wouldn't think a movie about an English mathematical genius could be so absolutely riveting, but that is the subject matter of \"The Imitation Game\", a sure bet for a Best Picture nomination."
    },
    {
      "text": "When I first saw the film several months ago, I proclaimed it to be the best picture of 2014. Having just re-watched it after seeing the rest of the contenders, I stand by my assessment. (Full Content Review - Sex, Profanity, etc. - also available)"
    },
    {
      "text": "n the end, The Imitation Game ably details a little-known corner of the WWII story, one that has incredible relevance today."
    },
    {
      "text": "The Imitation Game is simple, but it is also cogent in making the case for its subject's place in history..."
    },
    {
      "text": "You can't help but walk out feeling as though you've just seen one of the more important stories about one of the more important people - gay or straight - of our time."
    },
    {
      "text": "There's a film to be made about how government secrecy came spiraling out from Bletchley to conquer the future in which we now live, but \"The Imitation Game\" would rather give you a very good night at the movies."
    },
    {
      "text": "A handsome and stirring film of Second World War ingenuity that also succeeds as cracking good entertainment."
    },
    {
      "text": "Imitation Game is partly a tragedy, partly a history lesson, but largely a dramatic plea not just to embrace those who think differently, but actually appreciate them."
    },
    {
      "text": "There is nothing unique about the film itself - except for the mesmerizing performance by Benedict Cumberbatch in the lead role."
    },
    {
      "text": "This watchable biopic focuses on the Enigma project, mining drama from the gravity of the Nazi threat and laughs from the egghead hero's arch egotism and social ineptitude."
    },
    {
      "text": "\"The Imitation Game\" leaves Turing's essential mysteries intact, but they will nonetheless find even the most public contours his story ripe with drama, excitement and deeply affecting resonance."
    },
    {
      "text": "The actors save the day."
    },
    {
      "text": "\"The Imitation Game\" translates Turing and his team's achievement for a lay audience, while dramatizing the personal, scientific and bureaucratic obstacles they faced."
    },
    {
      "text": "Cumberbatch nails it. If only the film did, too."
    },
    {
      "text": "The Imitation Game is occasionally too conventional a film for its thoroughly unconventional hero, but the novelty of the untold story and its brilliant lead performance are a winning equation."
    },
    {
      "text": "Like the recent The Theory of Everything, The Imitation Game does a better job with the historical bullet points than with the interior lives of its characters."
    },
    {
      "text": "A well-written historical drama that also feels fiercely contemporary."
    },
    {
      "text": "The Imitation Game is a great biopic. The trouble is, biopics just ain't that great."
    },
    {
      "text": "Graced by an alternately unflappable and perturbed performance by Benedict Cumberbatch. The script sparks and flares with passages of clever British speech of lovely theatrical obviousness."
    },
    {
      "text": "A lively, exciting beat-the-clock thriller. Frequently sharp and witty."
    },
    {
      "text": "The Imitation Game may not be the big screen biography Turing deserves, but if this is the one that introduces his work to wider audiences, we'll take it."
    },
    {
      "text": "Strong performances buoy teen-friendly historical drama."
    },
    {
      "text": "The Imitation Game is a fantastic piece of historical theater that never fully embraces its cinematic identity."
    },
    {
      "text": "While Cumberbatch will get all the accolades, his character's younger self is inhabited by actor Alex Lawther, whose performance matches and complements the lead marvelously."
    },
    {
      "text": "If you are interested, even slightly, in what distinguished Alan Turing, this is not the film for you. It has about as much to do with his contributions to automation as does a Judd Apatow movie."
    },
    {
      "text": "A powerful, complex drama and a long-overdue tribute to a true hero and visionary."
    },
    {
      "text": "The movie has a tiresome sense of old-fashioned propriety. Not only can you catch the whiff of mothballs, you can also smell the ersatz good taste."
    },
    {
      "text": "Cumberbatch deserved a stronger movie, but at least Tyldum had the good sense to let him loose. Few actors can portray intelligence in a way that honors the audience's own."
    },
    {
      "text": "There's truth to it. Turing's story is indeed hard to imagine. Thanks to Cumberbatch's committed performance, a lot more people will know it."
    },
    {
      "text": "Cumberbatch creates a memorable character who is at once fascinating and off-putting."
    },
    {
      "text": "Benedict Cumberbatch is thrilling to watch; you sense the joy he must get out of his acting especially when in such a juicy role."
    },
    {
      "text": "One of the year's finest films; I could happily watch 'The Imitation Game' again."
    },
    {
      "text": "Cumberbatch has the ability to spin Turing's absence of tact into comedy and pathos."
    },
    {
      "text": "Even when the conception of the movie begins to seem lifeless, Knightley bursts with a vitality that won't be contained. The same is true, to an even greater degree, of Cumberbatch."
    },
    {
      "text": "An entertaining thriller, but a miscalculated biopic."
    },
    {
      "text": "Benedict Cumberbatch is brilliant."
    },
    {
      "text": "It's frustrating but the movie works thanks to Cumberbatch's excellent performance and the eternally powerful image of the tortured hero."
    },
    {
      "text": "Hollywood biopics infantilizes its audiences. If someone's true story ended badly, it's a text epilogue that tells us what happened. When Hollywood does another biopic of Jesus's life they will leave out the crucifixion."
    },
    {
      "text": "The story of Alan Turing, and his immeasurable contribution to modern society, is superbly adapted for the screen in The Imitation Game."
    },
    {
      "text": "As middlebrow, medium-impact melodrama goes, you could do worse."
    },
    {
      "text": "\"The Imitation Game\" is a highly conventional movie about a profoundly unusual man. This is not entirely a bad thing."
    },
    {
      "text": "Most likely, it was the intent of screenwriter Graham Moore to make a puzzle out a film about puzzle solving. That is not necessarily a bad thing, however, once the pieces fall into in place."
    },
    {
      "text": "Beatifully capturing the era, the acting by Cumberbatch and Knightley is very good, but the well-directed story doesn't need the couple of trite plot devices that diminish the end product."
    },
    {
      "text": "It's a marvelous story about science and humanity, plus a great performance by Benedict Cumberbatch, plus first-rate filmmaking and cinematography, minus a script that muddles its source material to the point of betraying it."
    },
    {
      "text": "Good as he's been in the past ... the richness and complexity of Turing's character make this portrayal of an arrogant, difficult, sure-of-himself individual the role of Cumberbatch's career."
    },
    {
      "text": "\"As fine-tuned and moving a performance as Cumberbatch delivers - all the more impressive for being created from scratch, since no audio or video recordings of Turing exist - the film's Turing suffers an acute lack of an inner life.\""
    },
    {
      "text": "With a constantly shifting chronology, the filmmakers find and link the key moments in the life of a brilliant, complicated, fascinating man."
    },
    {
      "text": "Unlike self-consciously unconventional biopics, The Imitation Game melds fact and invention with lucidity and sweep."
    },
    {
      "text": "The film is anchored by yet another hypnotically complex Cumberbatch performance. He's turning greatness into a habit."
    },
    {
      "text": "The film's prime force is Cumberbatch, a great actor whose talent shines here on its highest beams. It's an explosive, emotionally complex performance."
    },
    {
      "text": "Based on the biography by Andrew Hodges, Imitation illuminates Turing's brilliance in an engrossing and moving film that features a standout, Oscar-worthy performance by Benedict Cumberbatch."
    },
    {
      "text": "It's a sad and heartbreaking story that keeps you nailed to the screen for its entire 114-minute running time."
    },
    {
      "text": "Turing is kept tweedy and neutered, as closeted in celluloid as he was in real life."
    },
    {
      "text": "Prestige biopics don't get much better than \"The Imitation Game.\" This is a special film."
    },
    {
      "text": "'The Imitation Game' doesn't embarrass itself by trying to explain convoluted mathematical issues; there's nothing on the order of 'A Beautiful Mind''s forehead-slapping breakdown of game theory."
    },
    {
      "text": "A riveting and emotional historical piece that bolsters one of the best performances of the year by Benedict Cumberbatch."
    },
    {
      "text": "Cumberbatch is the one freaky touch in an otherwise conventional movie, but the conventions in this case work handsomely."
    },
    {
      "text": "The Imitation Game is at its best when it focuses on the collision between cryptography and proto-programming. The film's efforts to function as a character study, on the other hand, are decidedly clumsy."
    },
    {
      "text": "Shot with a sense of how to make the intellectual seem dynamic...fulfilling and compelling..Intelligence is rarely this exciting."
    },
    {
      "text": "This true story is, in itself, so tragically fascinating and the performances so fine, you almost don't realize how safe this film actually is."
    },
    {
      "text": "There's an algorithm for making an Oscar-ready prestige picture - and \"The Imitation Game\" follows it obsessively."
    },
    {
      "text": "Handsomely made, respectably acted, and reveals an interesting and important piece of world history. In other words, it's a standard biopic."
    },
    {
      "text": "[VIDEO ESSAY]...the success of \"The Imitation Game\" comes down to Benedict Cumberbatch's sensitive portrayal of a complex personality."
    },
    {
      "text": "The Imitation Game is a rich production ... that amounts to an engaging, even mesmerizing rendering of one of history's most important events."
    },
    {
      "text": "Turing will survive this film with his enigma intact, but the movie itself is the opposite of enigmatic, and Cumberbatch merits more."
    },
    {
      "text": "A Beautiful Mind, this film thankfully isn't. Don't let anyone tell you otherwise."
    },
    {
      "text": "It's rock solid, but Turing's admirers will say the scope of his achievements demanded a little more."
    },
    {
      "text": "Cumberbatch is thrown into the middle of a thriller and given the leeway to show us how the brilliant and troubled Turing works. It's great watching him do just that."
    },
    {
      "text": "Turing deserves better than to be presented as a nutty professor, a tweed-jacketed Rain Man, his own code so easily cracked that any old hack film-makers can have a go."
    },
    {
      "text": "Besides being an offensive disservice to the sadly not singular tragedy of Alan Turing, how is The Imitation Game? Well, it has good performances."
    },
    {
      "text": "A biopic that plays out like a cerebral thriller, this film traces the life of Alan Turing, the British maths genius who essentially invented the computer and won World War II before being driven to suicide by a cruel legal system."
    },
    {
      "text": "It is a celebration of Turing's extraordinary achievements, a populist yarn that makes an admirably firm fist of establishing its spiky subject as a heroic outsider."
    },
    {
      "text": "Engrossing, if emotionally evasive - featuring Benedict Cumberbatch's exceptional performance..."
    },
    {
      "text": "It's Turing himself, of course, who is the story's biggest enigma, and Cumberbatch's performance unlocks his secrets with spellbinding brilliance."
    },
    {
      "text": "The Imitation Game does justice to a great British hero and a story of incredible triumph against impossible odds."
    },
    {
      "text": "Intriguing character study and exciting war drama rolled into one"
    },
    {
      "text": "The film-makers have set out to tell us a yarn and they have succeeded admirably. Celebrate a film that will enhance rainy bank-holiday weekends for decades to come."
    },
    {
      "text": "Simplified and conventionalised though it may be, this has to be accounted the most compelling dramatisation of Turing's story yet."
    },
    {
      "text": "Fascinating and thrilling, The Imitation Game keeps you gripped by always offering a reminder of what's at stake, as well as exploring the mind of a brilliant but unfairly treated war hero who should never be forgotten."
    },
    {
      "text": "Nothing can soften the tragedy that characterised Turing's later years, but this remains a testament to a singular, brilliant man and his extraordinary achievements."
    },
    {
      "text": "No guns-blazing thriller, this is an old-fashioned code-cracking drama."
    },
    {
      "text": "Such an astonishing, crucial life as Turing's deserves a more courageous, inventive film. Not this opportunistic, King's Speech -like Oscar grab."
    },
    {
      "text": "A great performance by Benedict Cumberbatch and an illuminating portrait of the large role secrets can play in our lives."
    },
    {
      "text": "It's a fascinating story, as well as one of those stories that needs to be told, over and over if necessary, but I just wish it had been told here with a little more guts and flair."
    },
    {
      "text": "Amounts to less than it should but still worth a jaunt."
    },
    {
      "text": "Despite its flaws, The Imitation Game watchably recreates one of Britain's finest hours, and one of its most shameful."
    },
    {
      "text": "Morten Tyldum ties it all together with such steadfast dedication to fine-ness that makes it very difficult to be cross with his film."
    },
    {
      "text": "A marvelous combination of thrilling intellectual adventure and sensitive portrait of a man ahead of his time both personally and professionally."
    },
    {
      "text": "It's not a bad film, but it's certainly a timid one ..."
    },
    {
      "text": "A superb thriller and a worthy biopic of a real hero."
    },
    {
      "text": "A finely etched character study, with Cumberbatch on towering form. Set coordinates for the Oscars."
    },
    {
      "text": "Norwegian director Morten Tyldum's solid English-language debut has been packaged as a tony period drama with an ardent straight-gay non-romance and a polemical edge."
    },
    {
      "text": "Do I think The Imitation Game is among the year's best films? Absolutely not, but that should not be held against the film that is, warts and all, an intelligent and mostly entertaining historical drama."
    },
    {
      "text": "Given the liberties the film takes, it's surprising that it refuses to penetrate Alan Turing's carnality and allow Benedict Cumberbatch to truly wrestle with the torment of the man's sexuality."
    },
    {
      "text": "Turing is a tougher role to play than it might once have been, but Cumberbatch burrows beneath the surface to reveal someone with machine-like logic locked in a soulful struggle against an inhuman society."
    },
    {
      "text": "With a large dose of Sherlock and a sprinkling of The Curious Incident of the Dog in the Night-Time, Benedict Cumberbatch is just brilliant in the role of Alan Turing."
    },
    {
      "text": "To feel gripped, on edge and moved in such a short period of time is of real commendation to Tyldum, who takes his audience through the motions in this unforgettable piece."
    },
    {
      "text": "While the ingredients are there for this game to be a memorable one, I'm afraid this latest film about Turing fails its own test, feeling robotic and wooden."
    },
    {
      "text": "This is a very clandestine way to make a liberal message movie, but it works. You could almost say that it serves up Oscar bait in code."
    },
    {
      "text": "Benedict Cumberbatch is odds-on to be nominated for an Oscar (at the very least) for his brilliant turn as Alan Turing."
    },
    {
      "text": "Morten Tydlum's The Imitation Game is a first-rate biopic, a thrilling espionage game that's beautifully crafted and acted."
    },
    {
      "text": "Cumberbatch bristles with brilliance in this handsome biopics the British do so well about the fascinating, tragic story of mathematician Alan Turing."
    },
    {
      "text": "The Imitation Game is a surprisingly brainy war picture about some of the more unexpected heroes behind the scenes."
    },
    {
      "text": "Streamlines a fascinating true story into functional prestige filmmaking, but it's still plenty engaging, thanks largely to its lead."
    },
    {
      "text": "Morten Tyldum's espionage thriller about Alan Turing is purely sensational with a performance for the ages by Benedict Cumberbatch. One of the year's very best."
    },
    {
      "text": "thoroughly engrossing"
    },
    {
      "text": "Utterly absorbing true-life spy thriller. Cumberbatch is wonderful."
    },
    {
      "text": "The Imitation Game makes a compelling case for futzing with the details of a biopic in order to get a more engaging message across."
    },
    {
      "text": "The Imitation Game isn't exactly scintillating, but its slow-burn suspense is plenty pleasurable."
    },
    {
      "text": "The Imitation Game is a film about a human calculator which feels... a little too calculated."
    },
    {
      "text": "The intrigue and intensity of the war and espionage plot are compelling, but Cumberbatch captivates as Turing."
    },
    {
      "text": "Headhunters director Morten Tyldum and Benedict Cumberbatch, at the top of his game, forge the definitive account of Turing's life."
    },
    {
      "text": "It's too formulaic, too efficient at simply whisking you through and making sure you've clocked the diversity message.: without square pegs - like those played by Cumberbatch and Knightley - the world would be by far the poorer."
    },
    {
      "text": "The Imitation Game puts Alan Turing's life on a conveyer belt. So we understand him less as a human. Other than his connection to his machine."
    },
    {
      "text": "Cumberbatch does a wonderful job bringing this characterization to life and it's often his performance that overcomes some of the film's melodramatic tendencies."
    },
    {
      "text": "Hidden codes, secret meanings and mixed messages pulse through the reliable, old-fashioned, buzzing copper wires of this true-life British period drama."
    },
    {
      "text": "Strong, stirring, triumphant and tragic, The Imitation Game may be about a man who changed the world, but it's also about the world that destroyed a man."
    },
    {
      "text": "Crowd-pleasing and rousing, the movie's winning third final act will definitely render the picture as solid contender in awards season."
    },
    {
      "text": "A glossy, conventionally entertaining account of Alan Turing's top-secret military work ... a rollicking wartime story first, an appreciation of Turing's life a distant second."
    },
    {
      "text": "...something I'd want my preteen children to see before they get too much more sophisticated."
    },
    {
      "text": "Engrossing, nicely textured and sadly tragic ..."
    },
    {
      "text": "The movie is undeniably strong in its sense of a bright light burned out too soon, and the often undignified fate of those who dare to chafe at society's established norms."
    },
    {
      "text": "As these pieces fall into place, Turing becomes ever more sympathetic while still feeling beyond anyone's ability to help or even understand."
    }
  ],
  "release_year": 2014,
  "duration": 113,
  "genres": [
    "History",
    "Drama",
    "Biography",
    "LGBTQ+"
  ],
  "age_rating": "PG-13",
  "synopsis": "In 1939, newly created British intelligence agency MI6 recruits Cambridge mathematics alumnus Alan Turing (Benedict Cumberbatch) to crack Nazi codes, including Enigma -- which cryptanalysts had thought unbreakable. Turing's team, including Joan Clarke (Keira Knightley), analyze Enigma messages while he builds a machine to decipher them. Turing and team finally succeed and become heroes, but in 1952, the quiet genius encounters disgrace when authorities reveal he is gay and send him to prison.",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/zSqJ1qFq8NXFfi7JeIYMlzyR0dx.jpg"
}