{
  "movie_name": "The Avengers",
  "movie_id": "marvels_the_avengers",
  "total_reviews": 363,
  "reviews": [
    {
      "text": "Seems like a miracle that something like this could be pulled off, fully amplifying and improving upon everything each solo MCU movie accomplished before it, while also standing on its own with the team dynamics."
    },
    {
      "text": "You wouldn’t accuse 'The Avengers' of being good drama, but the sprawling, splashy spectacle and its much-much-much-larger-than-life heroes makes for a genuine comic book epic for the big screen."
    },
    {
      "text": "After four years’ worth of building piece by piece against mounting expectations, Marvel and Whedon have managed to satisfy the majority of fan expectations, and in some ways, even exceeded them."
    },
    {
      "text": "Everyone is invested in their character and not one single performer phones it in."
    },
    {
      "text": "Go back a rewrite the definitions for \"unprecedented,\" \"groundbreaking,\" and those other buzz words."
    },
    {
      "text": "The Avengers, as a movie, can be best described as one of the most prominent examples of a crowd pleaser."
    },
    {
      "text": "The story works, the acting is superb, the humor is on key and the action sequences are breathtaking."
    },
    {
      "text": "The 2010s will undeniably go down as the decade of superheroes..."
    },
    {
      "text": "It is the textbook example of a comic book movie, the gold standard to strive for, and a validation of comic book storytelling as an art form."
    },
    {
      "text": "A mega-budget action extravaganza that succeeds on just about every level, and it's one you should certainly go and see as soon as possible."
    },
    {
      "text": "A perfect example of an ensemble cast and great example of well shot spectacle that also manages to actually develop a lot of the titular heroes as well. Great stuff."
    },
    {
      "text": "The posing, evil grimacing to denote villainy, and arsenal of one-liners are at an all-time high."
    },
    {
      "text": "The Avengers will undoubtedly please nearly all fanboys and most other moviegoers hoping for the quintessential popcorn flick experience."
    },
    {
      "text": "'The Avengers' is an amazing madness that guarantees entertainment, fun and awe with the most fantastic gathering of heroes that cinema has ever seen. [Full review in Spanish]"
    },
    {
      "text": "'The Avengers' May Be the Best Comic Book Film Ever Made"
    },
    {
      "text": "Clever, funny, emotional, and downright amazing; The Avengers is a spectacle which demands repeat viewings. Joss Whedon has delivered what is quite simply an epic comic book movie masterpiece."
    },
    {
      "text": "...not without its flaws, but Joss Whedon has put together an immensely enjoyable film, the best Marvel-based one to date, and one that is not in the least bit ashamed of its comic book roots."
    },
    {
      "text": "This star-studded, action packed film lives up to all the hype."
    },
    {
      "text": "The Avengers is as close as you can get to a quintessential blockbuster experience. One of the rare MCU films where the action beats feel entirely like extensions of story and character."
    },
    {
      "text": "Overall, Marvel's Avengers Assemble is fun, funny and downright entertaining. Joss Whedon did good."
    },
    {
      "text": "I think the problem is inherent in the format."
    },
    {
      "text": "It is no longer enough for one superhero to fight a single villain while dealing with his own personal problems, apocalypse must now enter into it."
    },
    {
      "text": "The movie is not utterly worthless in every way. I'll grant that. But does that mean it's good? Or even adequate? No."
    },
    {
      "text": "Tightly scripted and filled with enough moments of levity to balance the extended and spectacular battle sequences."
    },
    {
      "text": "Gets everything right. So entertaining when our characters gather to fight Loki who is the best."
    },
    {
      "text": "Marvel's The Avengers is the team-up movie that we've been waiting for and it's absolutely everything we wanted it to be."
    },
    {
      "text": "The film begins with a bang and builds from there, a thrill ride peppered with Whedon's trademark self-aware humor. It's fun to watch all these egos clash, especially Downey, who just owns the Tony Stark role."
    },
    {
      "text": "The Avengers will appeal to fans of comic books, fans of action and fans of characterization and dialogue. It's a pretty awesome assembly."
    },
    {
      "text": "This all-star superhero extravaganza is fun entertainment at a grand scale."
    },
    {
      "text": "If you're in the market for one of the most wondrous and entertaining cinematic experience you could ever hope to have, book your tickets, buy your popcorn and prepare to be amazed."
    },
    {
      "text": "The Avengers is an engaging-enough film. But with that kind of treasure, talent and time, you'd expect more -- a lot more than this completely conventional action flick delivers."
    },
    {
      "text": "It will forever stand as Exhibit A in the case for why the Marvel Cinematic Universe exists and why it continues to thrive."
    },
    {
      "text": "This is an incredible action movie. From special effects to fights to explosions, it hits every marker. But the movie is so much more. It's hysterically funny, charming and smart."
    },
    {
      "text": "Avengers Assemble does exactly what it says on the tin: the Avengers assemble and proceed to smash things up...a lot!"
    },
    {
      "text": "The Avengers shatters the last barrier separating the printed page and the celluloid image, fully wresting the superhero genre away from the medium that birthed it."
    },
    {
      "text": "Sounds kind of corny, you say? Oh, that's nothing. Massive corn-shucking in this film, corn piled everywhere, cornpone, corn fritters, corn syrup, corn as high as an elephant's eye, the Feast of Our Great God Corn!"
    },
    {
      "text": "This is what a comic book movie should be: thrilling, exciting and surprisingly, almost shockingly, human."
    },
    {
      "text": "Achieves something more than just a competent wrangling of diverse comic book stories: it manages to keep Hollywood egos in check"
    },
    {
      "text": "Black Widow has so much potential! We hope they seize on it within the next 6 years! *a tumbleweed blows by*"
    },
    {
      "text": "The final action scene, which runs for over half-an-hour, is awe-inspiring."
    },
    {
      "text": "For an action movie there are a lot of genuinely funny lines. There were parts of this movie that had my laughing out loud."
    },
    {
      "text": "Probably the best superhero/comics movie of all time. [Full review in Spanish]"
    },
    {
      "text": "It works on nearly every level and is a testament to a great director working with a great group of actors and a studio that knew when to get out of the way and let the creatives be creative."
    },
    {
      "text": "[The Avengers] is fast-paced, funny, thrilling and well-crafted."
    },
    {
      "text": "The comedic timing, coupled with his ability to maintain the authenticity of the characters, is worthy of praise. The Avengers delivers a popcorn feast that's the perfect summer kickoff."
    },
    {
      "text": "Just the right combination of affection and silliness."
    },
    {
      "text": "By crafting a winning combination of wonderful characters, brilliant comedy, and spectacular set pieces, Whedon hasn't simply created the biggest superhero movie; he's created one of the best."
    },
    {
      "text": "What Whedon and Marvel have created here is not just extraordinary, but one of the most entertaining and satisfying comic book movies yet."
    },
    {
      "text": "Robert Downey Jr's billionaire playboy inventor Tony Stark, aka Iron Man, gets the film's self-aware, tongue-in-cheek tone spot on, delivering Whedon's wisecracks with sardonic charm."
    },
    {
      "text": "[Marvel's The Avengers] is such a pure and unadulterated comic-book movie that it will bring you to tears."
    },
    {
      "text": "A lot of fun."
    },
    {
      "text": "Downey's Stark/Iron Man steals the show because the actor is capable of making the tritest dialogue sound wonderfully witty, but the CGI effects are amazing and, despite its length, the film is very enjoyable."
    },
    {
      "text": "Infusing plenty of laconic wit into his role, Robert Downey Jr is impressive as ever."
    },
    {
      "text": "As Tony Stark, RDJ infuses that much needed spark and life into the movie with his superb one-liners."
    },
    {
      "text": "To get an idea of the overall mood, you have to imagine something starring Buster Keaton, Spencer Tracy, Sylvester Stallone and Marlon Brando, and directed by Michael Bay and Sidney Lumet on a bank of giant green screens."
    },
    {
      "text": "The relentless action mixed with some potent 3D makes for some jaw dropping viewing."
    },
    {
      "text": "A big, splashy movie in which stuff blows up a lot, yet you go home talking about the actors."
    },
    {
      "text": "Shrug however you might at a story that has to pack so many characters and tangents into 140 minutes; it will still be difficult for me to see beyond the joyous awesomeness."
    },
    {
      "text": "It's little surprise this is largely a terrifically enjoyable experience -- one that'll please both fanboys and the public at large."
    },
    {
      "text": "This will be loved by genre fans, when all is said and done/ But at two hours forty, you may find it numbs your bum/ Seriously, more attention to character could have made it a lot more fun/ And now I have said all that, I believe my poem is done."
    },
    {
      "text": "Is Avengers Assemble the best comic book film ever? That's a tough call but it's certainly the most exciting, and a true epic moment in cinematic history."
    },
    {
      "text": "Joss Whedon knows exactly what comic-book geeks want to see. That's why \"Marvel's The Avengers\" is so immensely satisfying."
    },
    {
      "text": "If we must have these box-office behemoths, then at least the writer-director, Joss Whedon, creator of Buffy the Vampire Slayer, is a lively controlling influence."
    },
    {
      "text": "Of course it's about one hundred times brighter than Transformers and Michael Bay's imbecilic spinoffs, and should keep multiplexes everywhere in its competent grip. But I didn't love it."
    },
    {
      "text": "The special effects are impressive but not especially imaginative, and the film is unduly protracted."
    },
    {
      "text": "For all who have hotly fan-ticipated this all-star collection of Marvel's superheroes, you have reason to be excited. You can officially geek out now."
    },
    {
      "text": "The Avengers does have is a solid gold structure that doesn't buckle under the weight of its gargantuan expectations and overflowing cast."
    },
    {
      "text": "Smart, witty, funny, action-packed and surprisingly cathartic."
    },
    {
      "text": "The bigger and goofier it gets, the more fun it becomes."
    },
    {
      "text": "A fun light-hearted summer blockbuster that is weighed down by a forgettable villain."
    },
    {
      "text": "If you're not already a fanboy, it'll turn you into one. It is honestly the most fun I have had at the movies in a long, long time."
    },
    {
      "text": "After two-and-a-half hours of world-threatening chaos and world-saving derring-do, you leave the theater satisfied, but without so much as a single memorable image (or idea) lingering in your mind."
    },
    {
      "text": "Joss Whedon empties everything at his reported $225 million disposal to assault the eyes, ears and intelligence with one of the stupidest comic book tales ever put to film."
    },
    {
      "text": "Whedon must balance the competing storylines and screen time of the actors. He does it nicely, injecting humour and a touch of drama into the action -- and all without so much as a Tesseract to his name. Some assembly required, and delivered."
    },
    {
      "text": "One of the ten best films of 2012."
    },
    {
      "text": "But one of the most fascinating moments in the picture occurs when Captain America, referring to Thor, notes: \"There's only one God, ma'am. And I'm pretty sure he doesn't dress like that.\" Ah, monotheism versus paganism. Can they exist side by side?"
    },
    {
      "text": "Whedon has delivered that rare action-packed, special-effects spectacle that is relentless in its eagerness to please and successful beyond its goal."
    },
    {
      "text": "It's Summer's Mightiest Movie. Nuff said."
    },
    {
      "text": "When all is said and done, Avengers is all sound and Nick Fury, signifying nothing."
    },
    {
      "text": "Was Marvel's ambitious dream for a shared cinematic universe truly worth it? In my opinion: Most definitely."
    },
    {
      "text": "The Avengers is one of the best superheroes movies in a long time and is likely to become a classic of the genre. You would need to really hate comic book movies not to get a kick out of this."
    },
    {
      "text": "The Star Wars of a new generation."
    },
    {
      "text": "\"Marvel's The Avengers\" is a visual comic book and it doesn't aspire to be anything more than that. As a film version it succeeds-one is tempted to say-MIGHTILY."
    },
    {
      "text": "It really is quite something that [Whedon] was able to take so many characters and put them into a movie where nobody gets left behind."
    },
    {
      "text": "It really is an astounding achievement - a film that juggles an unenviable number of elements; combining what we've seen before, slotting them together and then adding enough depth, action and humour to make this a remarkable standalone film."
    },
    {
      "text": "Marvel's \"The Avengers\" is the super-hero movie to end all super-hero movies. Why? Joss Whedon."
    },
    {
      "text": "Without Robert Downey Jr. delivering his witty quips in patented rat-a-tat-tat fashion, The Avengers would largely be a soulless shell of a movie that could be mistaken for a Michael Bay production."
    },
    {
      "text": "After years of buildup and prequels, \"The Avengers\" is merely average."
    },
    {
      "text": "The first great superhero team movie, and a film that captures the essence of what makes the Marvel Universe great."
    },
    {
      "text": "The filmmakers play a conservative game, not setting out to make a great movie but simply making sure not to screw it up an entire franchise."
    },
    {
      "text": "Feels like actual Marvel Comics are being injected directly into your bloodstream. It's simply jaw-dropping."
    },
    {
      "text": "While it reflects a movie culture that has traded originality for scale - one wonders if there's a shred of originality anywhere in the film - The Avengers is grand, throwaway fun."
    },
    {
      "text": "It's as big, funny, shiny, explosive, expert, rip-roaringly entertaining an action movie as we've seen in a long time."
    },
    {
      "text": "Yeah, it's all that. A tent-pole cash cow for the studio, a dream come true for fans, and treat for action aficionados, 'The Avengers' comes at you as the first true \"summer movie spectacular\" of the 2012 season."
    },
    {
      "text": "Wonderful blink and you'll miss them comic beats in the middle of the finale's mayhem. And what glorious mayhem!"
    },
    {
      "text": "... The movie isn't so much a work of storytelling as it is a marathon of wish-fulfillment moments for comic book enthusiasts -- punches peppered with punchlines."
    },
    {
      "text": "The culmination of four distinct franchises is an exciting and entertaining product."
    },
    {
      "text": "It's the humor that's The Avengers' strength."
    },
    {
      "text": "One hundred and forty-three minutes of head-pounding bombast, The Avengers is an exhausting experience."
    },
    {
      "text": "Whedon's clear fanboy glee is irresistibly contagious to the audience, whether the heroes and villains go at it with fisticuffs or sharp, witty dialogue."
    },
    {
      "text": "Comic-book movie delivers the goods"
    },
    {
      "text": "By the time the utterly routine (and decidedly endless) finale rolls around, Marvel's The Avengers has unquestionably squandered the potential of its premise and its cast..."
    },
    {
      "text": "Delivers big time with everything longtime fans and newcomers alike could possibly want in a summer blockbuster that definitely surpasses the hype."
    },
    {
      "text": "This too-long adventure is a sensory overload --- complete with loud, protracted battle scenes and hunky super heroes who provide the necessary eye candy. It's also very funny, and highly entertaining."
    },
    {
      "text": "There is much humor laced throughout the film, giving it an air of not taking itself too seriously -- which is as it should be in a film of this genre."
    },
    {
      "text": "... tremendous fun ..."
    },
    {
      "text": "A creative team WOW"
    },
    {
      "text": "The Avengers lives up to every last ounce of hype."
    },
    {
      "text": "It's a blockbuster that manages to please with intelligence and fun. Whedon makes it look easy."
    },
    {
      "text": "Whedon manages all these disparate threads confidently, his script a model of self-control and restraint that's far from typical for the genre."
    },
    {
      "text": "It's all very smoothly done but comes without a hint of surprise or revelation."
    },
    {
      "text": "The Main Event is pretty much what you'd expect ‒ noisy, overlong, wall-to-wall CG effects and arcane superhero lore ... Yes, it's all fairly formulaic, but on a Wow! scale never before experienced."
    },
    {
      "text": "If you only see one movie this year over and over again, it'll probably be this one."
    },
    {
      "text": "I have a feeling that this will be a comfort film for myself and many other film geeks for years to come, just like the Indiana Jones or Star Wars movies."
    },
    {
      "text": "Whedon delivers a thoroughly entertaining compilation of the best of these heroes while never hiding either his giddy love for the characters or the wry wit that has formed the bedrock of his career."
    },
    {
      "text": "The Avengers will surely rank among the best superhero movies, if not summer blockbusters, of all time."
    },
    {
      "text": "The Avengers is a fun time at the movies. That's as important as anything."
    },
    {
      "text": "Whedon gives balance even to relative minnows Hawkeye and the Black Widow by giving each their moment to shine."
    },
    {
      "text": "The real hero of The Avengers is not Iron Man, Thor or even Nick Fury. It's Joss Whedon."
    },
    {
      "text": "There's also great chemistry between the principals, who all get their moment in the sun."
    },
    {
      "text": "The Avengers greatest accomplishment could be this: its ability to make an entire audience feel like children reading their favorite comic for the very first time."
    },
    {
      "text": "The movie engages the viewer from a very strong opening sequence through the two bonus scenes included in the closing credits. The nearly two and a half hour running time passes by swiftly and leaves you eagerly awaiting a follow-up sequel."
    },
    {
      "text": "It's a long ride before jaws drop and the eyeball caressing spectacle of The Avengers clicks into high gear"
    },
    {
      "text": "Solid entertainment and much better than I'd expected from the maestro of midcult, Joss Whedon."
    },
    {
      "text": "While the film certainly suffers from gigantism, it is a self-inflicted malady, and for fans of the series it is like manna from heaven."
    },
    {
      "text": "While Whedon smartly recognizes how key Downey Jr.'s Stark is to the story, he also allows most all of his cast, heroes and villain, ample opportunities to shine, both in dialogue and action."
    },
    {
      "text": "Never underestimate the entertainment value of the Hulk Smash."
    },
    {
      "text": "What could be more effective against interstellar battle than a bow and arrows? 'You never know when an alien invader is the Sheriff of Nottingham,' warned Samuel L. Jackson."
    },
    {
      "text": "If you are a Marvel fan, then The Avengers will feel like Christmas. Thanks to the merry doings of the director, Joss Whedon, all your favorite characters are here, as shiny and as tempting as presents under the tree."
    },
    {
      "text": "It's tough to live up to expectations when expectations are so high, but \"The Avengers\" pulls it off, thanks to the clever writing and directing of Joss Whedon and armies of actors and other artists who made this action extravaganza."
    },
    {
      "text": "While the film lacks the visual imagination of THOR or the period feel of CAPTAIN AMERICA, it has more of a sense of structures on a huge scale being blown up by even bigger explosions."
    },
    {
      "text": "You'd have to be either a real grouch or an inveterate hater of the form to deny that this is by and large some really fine explosion-mongering."
    },
    {
      "text": "Joss Whedon fashions an almost perfect combination of action and humor."
    },
    {
      "text": "If you dig Thor or Cap or Hulk, please check out the original sources. Support your local comic book shop. You wouldn't have any of these movies without them."
    },
    {
      "text": "The film flows with the momentum of a comic book composed of full-page bleed impact-moment illustrations."
    },
    {
      "text": "Our basic love of these characters in such an even distribution of involvement and grand context of good vs evil make for maximum enjoyment of a terrific script carried out with conceptual proficiency and, even, sensitivity."
    },
    {
      "text": "The trick with 'The Avengers' is to satisfy each superhero's fan base while simultaneously divvying out each hero's scenes in equal portions. Director-screenwriter Joss Whedon has pulled it off with muscle flexing aplomb."
    },
    {
      "text": "Nothing but 2:20 of special effects and ridiculous fights...it's like all the superheroes are trying out at the Improv to see who can give the best one-liner, and none of them do."
    },
    {
      "text": "A nearly complete success. It's the best action superhero movie since the first \"Iron Man,\" and the best Marvel Comics adaptation since \"Spider-man 2.\""
    },
    {
      "text": "Overall, this is as smooth and sprightly a franchise machine as we're likely to get this summer; even at two hours and twenty-three minutes it goes like lightning."
    },
    {
      "text": "Filled with fanboy-wank."
    },
    {
      "text": "Whedon's obvious love for The Avengers' characters, world and fandom makes for a superhero epic that's packed with exciting action, faithful details for comic fans and his signature off-hand wit. It's pure fun and entertainment."
    },
    {
      "text": "the perfect popcorn movie that respects its audience, fan boy or not, though the former will be more excited to see the Stan Lee cameo."
    },
    {
      "text": "The scene-stealer is Ruffalo, who provides Bruce Banner with a soulfulness missing in the portrayals by Bana and Norton. This is also the first film to nail the Hulk, who in 2003 looked like a video blip Gumby and in 2008 seemed shellacked in plastic."
    },
    {
      "text": "Whedon's The Avengers does what the best films of this genre do: create a fantasy world that you accept as totally real. And then provides a kick-ass good time as well."
    },
    {
      "text": "The action is great, but it's the interaction that really makes The Avengers something special."
    },
    {
      "text": "Superhero movies -- with their franchises, massive marketing budgets, cross-merchandising synergy and dedication to presenting the same experience every single time -- are nothing if not the Mickey D's of cinema, and I'm sure not lovin' it."
    },
    {
      "text": "There may be weightier, deeper or richer films this year - but there probably won't be any that are as much fun."
    },
    {
      "text": "I want to find Joss Whedon and give him a manly hug and buy him a beer."
    },
    {
      "text": "Whedon's biggest accomplishment may be making the superhero movie once again super entertainment."
    },
    {
      "text": "As a hardcore comic geek I could not have been happier with the results..."
    },
    {
      "text": "More than compensates for the story's averageness with consistently witty dialogue and a stream of terrific moments."
    },
    {
      "text": "a whole roast of awesome wrapped up in bacony awesomeness"
    },
    {
      "text": "A movie that yells at you and geeks out in equal measures."
    },
    {
      "text": "It doesn't have to be a great movie to provide a great experience."
    },
    {
      "text": "It's the equivalent of a superhero all-star game."
    },
    {
      "text": "Ultimately, it all comes back to Whedon: His clear vision for each character and how they might be profitably intermingled; his unexpected knack for action choreography; his funny, tender, immaculately constructed script."
    },
    {
      "text": "Hulk is the strongest there is."
    },
    {
      "text": "'The Avengers' registers in the red on the Nerdgasmatron. It's a witty, action-packed triumph -- entertaining and coherent for newcomers, yet true to the spirit of its source material."
    },
    {
      "text": "Since Best Picture Oscars are awarded to Producers then the Producers of Marvel's The Avengers deserve a best picture Oscar just for pulling this off. The fact that the movie is freaking amazing is just icing on the cake!"
    },
    {
      "text": "Joss Whedon has unleashed a ton of unadulterated popcorn movie fun with his marvelous multi-superhero extravaganza, The Avengers."
    },
    {
      "text": "Exactly the sum of its parts, a generous and stimulating way to waste an afternoon."
    },
    {
      "text": "The Avengers is fun, action packed and certainly an enjoyable outing's entertainment! Hardcore geeks and new fans will eat this adventure up and come back for more."
    },
    {
      "text": "This supermerger comes together into a thrilling action movie with heart and brains, masterfully melded by the superhero you can't see on the screen, director/screenwriter Joss Whedon."
    },
    {
      "text": "Big, loud, ridiculous and eye-popping, writer-director Joss Whedon's film is an empty-calorie summertime treat that delivers on all that it promises."
    },
    {
      "text": "Adjectives used in some of Marvel Comics' iconic titles from the early 1960s through today -- amazing, fantastic, incredible -- also describe director Joss Whedon's superhero epic The Avengers."
    },
    {
      "text": "As spectacle it's big, stupid fun. Visually it's impressive. For comic geeks it's a wet dream come true. But dramatically it's inert."
    },
    {
      "text": "In some ways, it feels like the kick-off to the afterparty for a post-Iraq War nation, with a sense of \"mission accomplished\" back-slapping buried beneath all the pyrotechnics."
    },
    {
      "text": "Sock, pow, zowie--plenty of firepower in the summer's first big lallapalooza."
    },
    {
      "text": "This movie has it all: gorgeously clear action, humor, suspense and even passion. It's not going too far to guess that no other summer movie will touch it."
    },
    {
      "text": "A spectacle in the grandest sense of the word ..."
    },
    {
      "text": "The Avengers is everything you would want it to be and is the ultimate summer blockbuster. The movie is thrilling and funny without requiring any intellectual heavy lifting."
    },
    {
      "text": "It's at its most lively late in the game, when Hulk finally makes an appearance and gets his simple orders: 'Smash.' Good old Hulk ... Yet the movie's a surprisingly perfunctory affair."
    },
    {
      "text": "There are also the fans who rage in the comments, as if men in spandex are as serious as war and the economy. Is there a defensive euphoria in seeing your childhood heroes come to life? Is 'The Avengers' a great film? No. Will people love it? Yes!"
    },
    {
      "text": "If you're looking to stretch your movie-superhero dollar, here's some serious blockbuster bang for your cinema buck."
    },
    {
      "text": "I honestly would enjoy watching the Avengers sit around a conference table for two hours trading putdowns and one-liners: \"My Dinner With Thor.\" And then the action really kicks in. Sweet mercy."
    },
    {
      "text": "The actors get the ensemble approach and - like their characters - put their egos aside, gel and enthusiastically embrace the fun."
    },
    {
      "text": "Veined with wit, even as it offers exactly the kind of action that fanboys and normal movie-goers alike want out of something like this."
    },
    {
      "text": "Herding all these characters together into one big super-pileup required a gifted traffic cop; and Whedon, as we now see, was the ideal man for the job."
    },
    {
      "text": "It's easy to turn NIck Fury's blind eye to the movie's flaws because at the end of the day The Avengers packs big explosions, bigger personalities and Hulk-sized punch lines."
    },
    {
      "text": "Lose Hawkeye, and the inevitable sequel will surely attain the orgasmic rush of funny book consistency missing to a certain degree here."
    },
    {
      "text": "It's too long and it lags a bit in spots, but overall there is still a lot of fun to be had here."
    },
    {
      "text": "As soon as I finished watching this movie, I wanted to see it again. That's the highest recommendation I can make."
    },
    {
      "text": "The job here is to make the Big Bad go away and to save the genre from boredom. The good news is that these heroes won't rest until they've accomplished both. They happily work overtime for you."
    },
    {
      "text": "Thrilling action, rounded characters, high personal and global stakes, brilliant camera work, a tight script, strong acting and a hell of an adventure."
    },
    {
      "text": "Marvel's grand plan turned out to be a good one. This is a hugely entertaining time at the movies."
    },
    {
      "text": "The movie that all of those iconic comic book characters deserve."
    },
    {
      "text": "A slam-bang comics-inspired blast where the superhero collective fuses seamlessly and works marvelously."
    },
    {
      "text": "Gets the summer movie season off to the kind of start that will make The Amazing Spider-Man and Battleship quake with insecurity."
    },
    {
      "text": "Writer/director Whedon understands the comic goofiness that must be injected into the ridiculous subject matter to balance blockbuster action set-pieces."
    },
    {
      "text": "...there aren't many writer-directors as talented as Joss Whedon. Indeed, it's the writing that sets this film apart from the crowd, in harmony with perfect casting, first-rate visual effects, and other key ingredients."
    },
    {
      "text": "A roller coaster ride of non-stop action, \"The Avengers\" manages to take the different tones set by the previous films and fashion them into one strong voice."
    },
    {
      "text": "Comic geeks can collectively sigh with deep relief: Joss Whedon has taken their beloved Avengers and given them back a well-directed, action-packed, brilliantly written film."
    },
    {
      "text": "The Avengers may be a more modest success than some of us may have hoped, but it's still very much a success."
    },
    {
      "text": "Yet another brainless, overbloated and mostly underwhelming blockbuster despite marvelous visual effects."
    },
    {
      "text": "Lives up to every promise Marvel Studios has made."
    },
    {
      "text": "A superpowered crowd-pleaser, Marvel's The Avengers wows its way into comics-to-film history as one of the greatest popcorn flicks of its era."
    },
    {
      "text": "Whedon, a pop-genre magician best known for Buffy the Vampire Slayer, is a master of viewer manipulation - because he never gives up his own seat in the crowd."
    },
    {
      "text": "The performances are so well-pitched in The Avengers, meshing with such vividness and ease, that it's tempting to overpraise the good but not great movie that surrounds them."
    },
    {
      "text": "The film is good enough to keep all the Marvel Comics crazed audiences out there deliriously happy while keeping the rest of us earthbound types in moderate thralldom."
    },
    {
      "text": "It's two-plus hours of visual brawn, unexpected heartbeats and welcome humor."
    },
    {
      "text": "It's all rather serious and ominous, yet outlandish and mostly entertaining. Sounds about right for summer, doesn't it?"
    },
    {
      "text": "Even with the flaws of the final half, \"The Avengers\" is grand, brisk fun."
    },
    {
      "text": "Its primary purpose is not to explore or subvert the superhero movie, but to lay the groundwork for more of them."
    },
    {
      "text": "A slow start, a single star performance surrounded by indifferent acting and an onslaught of computer effects that range from seen-it-all-in-\"Transformers\" to a whole sky full of spectacular stuff in the midtown Manhattan climax."
    },
    {
      "text": "What the Avengers really need is something to avenge, some compelling emotion or commitment; rallying the troops with blood-stained collectible trading cards doesn't cut it."
    },
    {
      "text": "The banter has zip, the effects are fun, the climactic battle is decently spectacular, and if the 3-D is mostly expendable, there are a few scenes where it adds a nice kick."
    },
    {
      "text": "What makes this anticipated film so absorbing is how the heroes' internal battles are often more pronounced than their external ones. And when these troubled people interact, it's electric."
    },
    {
      "text": "Joss Whedon is the real superhero."
    },
    {
      "text": "Whedon knows how to be self-aware without getting overly cute about it. He has fun highlighting each character's neurosis and knows which personalities clash to greatest effect."
    },
    {
      "text": "A movie that can communicate the excitement a lover of the comic book will experience watching it even to those who have never read a single issue."
    },
    {
      "text": "Joss Whedon scores by making all of these characters work together. Bonus: Never hurts to have quick-quipping Robert Downey Jr in your superhero film."
    },
    {
      "text": "I'd have been happy to watch these actors sit around eating pastries for two and a half hours -- especially Downey and Ruffalo, who have wonderful chemistry as a pair of brainiacs with very different control issues."
    },
    {
      "text": "The superheroes mashup teased for seven years through five blockbusters is absolutely worth the wait. The Avengers is as brawny and lamebrainy as any comic book movie deserves to be."
    },
    {
      "text": "The long-awaited superhero supergroup is finally assembled, and their film does not disappoint. It's a smashmouth extravaganza of outsized proportions."
    },
    {
      "text": "Between a sophisticated script and thrill-a-minute special effects, The Avengers easily adds up to the best Marvel Comics screen adaptation yet!"
    },
    {
      "text": "Sure to please even the most die-hard fans, and just about everyone else."
    },
    {
      "text": "Fans of all that has come before will weep tears of giddy joy at how crowd-pleasingly cohesive -- and ridiculously fun -- this film is."
    },
    {
      "text": "Fortunately, Whedon spends enough of his time on characterizations to keep us engaged."
    },
    {
      "text": "Every now and then, director Joss Whedon executes a quirky camera set-up to assert that the film was created by him and not a team of marketing executives."
    },
    {
      "text": "'Hulk, smash,' is the inner-child battle cry of the comic-book world, and this mash-'em-up mantra is finally getting its due on the big screen."
    },
    {
      "text": "Expectations delivered, promises fulfilled: The Avengers is everything you could want in a superhero movie, with larger-than-life feats believably and meaningfully executed, and beating human hearts filled with emotion, humor and pain."
    },
    {
      "text": "Pulling off the hat trick of finally answering to the embedded teases in five prior films -- all intersecting in this film's storyline -- is a superhero feat in and of itself."
    },
    {
      "text": "\"The Avengers\" is an entertaining showcase for the Marvel characters. Credit for that goes to Joss Whedon, whose script is witty and whose appreciation for these characters is evident."
    },
    {
      "text": "Biff! Bam! Boring!"
    },
    {
      "text": "By far, Whedon's funniest effect is The Hulk, whose fist here is the equivalent of that city bus which so often takes someone out in a nanosecond edit."
    },
    {
      "text": "As entertaining as this movie is, it could have been even better."
    },
    {
      "text": "Calling 'The Avengers' the Best Superhero Movie Ever Made is a little overblown, though it easily is Marvel's best outing since the original \"Iron Man\" and more than justifies the years of buildup."
    },
    {
      "text": "Mark Ruffalo was born to the play The Hulk. There is a ten second epic action sequence that is worth the entire price of admission and every one of your nerd tears! Hulk Smash!"
    },
    {
      "text": "A flawed first part is forgivable thanks to the exhilarating action sequences climaxing the movie."
    },
    {
      "text": "Audiences have been eagerly anticipating this first all-hero extravaganza for years. The wait was worth it."
    },
    {
      "text": "Mines the collective goodwill of the Marvel nation to impressive effect,"
    },
    {
      "text": "The light, amusing bits cannot overcome the grinding, hectic emptiness, the bloated cynicism that is less a shortcoming of this particular film than a feature of the genre."
    },
    {
      "text": "A slickly packaged, effects-driven smashup."
    },
    {
      "text": "There's great entertainment in \"The Avengers\" - big bold, action-filled silliness with just enough human spirit to sell itself. This is a comic book movie done right."
    },
    {
      "text": "It's a first-class production all around, from the acting to the 3-D special effects to the touches of wit throughout. It delivers, in grand style, the thing we demand most from a comic-book movie: fun."
    },
    {
      "text": "If The Avengers isn't necessarily the BEST superhero movie ever made, it is unquestionably the MOST superhero movie ever made."
    },
    {
      "text": "\"The Avengers\" is done well by Joss Whedon, with style and energy. It provides its fans with exactly what they desire."
    },
    {
      "text": "Rousing blockbuster entertainment that goes down easy."
    },
    {
      "text": "Creating a script that not only lives up to the hype, but fulfills and even exceeds the expectations of fans is no easy task, but Whedon and co-writer Zak Penn have done so - and in a manner that does not give short shrift to any of the major characters."
    },
    {
      "text": "Whedon is the key reason why this $220-million behemoth of a movie is smartly thought out and executed with verve and precision. It may be overly long at two hours, 23 minutes, but so much is going on you might not even notice."
    },
    {
      "text": "If you're a fan of these sorts of flicks or the original comic book series, you'll likely be in superhero heaven. (Full Content Review for Parents also available)"
    },
    {
      "text": "Could Joss Whedon be Stan Lee's love child?"
    },
    {
      "text": "You don't need to be a \"comic-book person\" to find the set pieces exhilarating. But if you are such a person, or a fan of the movies that comic books turn into, \"The Avengers\" feels like the moment you've been waiting for."
    },
    {
      "text": "This is the Avengers that fanboys have always felt in their bones, and Whedon's camera is constantly in motion and in command."
    },
    {
      "text": "...an amazing entertainment, an experience that rivals the original blockbusters that established the Summer season in the first place."
    },
    {
      "text": "A smart, exciting, and engaging superhero story that deftly balances larger-than-life characters, their personal and inter-personal struggles and interplanetary battles."
    },
    {
      "text": "Tasked with meeting the many requirements necessary for any Avengers movie to work, Whedon checks off all the boxes, then sets about creating new expectations for what a big superhero movie ought to be."
    },
    {
      "text": "Uber-hacks like Michael Bay and McG should hang their heads in shame at the sight of what Whedon has accomplished here"
    },
    {
      "text": "Joss Whedon's glossy, super-budgeted Marvel ensemble flick is the cinematic equivalent of comfort food."
    },
    {
      "text": "It's films like these that justify the superhero movie's direct connection to the franchise model."
    },
    {
      "text": "It's Transformers with better - much better - dialogue."
    },
    {
      "text": "Heroes work together in explosive comic book adventure."
    },
    {
      "text": "The Avengers are the Bad News Bears of superhero squads, and their epic adventure in responsibility is an absolute joy to watch."
    },
    {
      "text": "\"The Avengers\" is both a culminator and a set-up for more, more, more."
    },
    {
      "text": "The Avengers kicks ass."
    },
    {
      "text": "A somewhat subversive piece of work, one that finds hilarity in fake catastrophes and in our very need to imagine the noisiest worst-case scenarios."
    },
    {
      "text": "A saga guaranteed to pass muster with the Comic-Con cognoscenti, without forsaking regular popcorn munchers who just hope to see the planet get saved with maximum firepower and a few laughs."
    },
    {
      "text": "To watch another comic book transformed into another blockbuster is to \"marvel\" at much and to feel nothing - that's a safer bet than the converse, perhaps, which may explain the genre's popularity."
    },
    {
      "text": "With snappy writing and a full roster of fleshed-out characters, the whole thing is a smash, from start to finish."
    },
    {
      "text": "If you're not much of a Marvel Comics person but just want to get an early start on your mindless summer moviegoing, well, I guess this picture is no stupider than anything else."
    },
    {
      "text": "Thrilling, collaborative action-adventure that's amusing and entertaining."
    },
    {
      "text": "In a shrewd move by writer/director Joss Whedon (no stranger to a directing an ensemble), each superhero is given his or her moment of inner turmoil, a moment of doubt and serious danger, and a moment to shine that spotlights their own unique talent."
    },
    {
      "text": "Whedon treats the [action] sequences like he's a kid set free in a toy store."
    },
    {
      "text": "The Avengers lives up to all the hype, embracing the geek in all of us and taking the audience on an incredibly wild ride."
    },
    {
      "text": "Se sai melhor ao retratar a interação de seus personagens do que a ação por estes protagonizada, apresentando-se como uma brincadeira inofensiva e inconsequente. Não é uma decepção, é verdade, mas um pouco mais de ambição não lhe teria feito mal."
    },
    {
      "text": "Thrilling when it wants to be, it's got star power to spare, and the action and effects are top-notch."
    },
    {
      "text": "While The Avengers exhibits exemplary craftsmanship, Joss Whedon hasn't made a great film."
    },
    {
      "text": "It's quite possible that The Avengers has more action than any movie ever made...[but] for all its thrill-ride clutter, The Avengers is just about as simplistic as them fightin'-robot pictures..."
    },
    {
      "text": "If you go to Wikipedia and type in 'summer blockbuster', this is the movie that should come up. It is everything that you need in a summer film. It kicks the season off perfectly and you will feel like a little kid again."
    },
    {
      "text": "Puts the 'some' in 'awesome.'"
    },
    {
      "text": "Whedon, the pop savant responsible for TV's Buffy the Vampire Slayer, straddles the line between sarcastic gab and pulp solemnity like Eli Manning on a fourth-down, go-it-alone jag."
    },
    {
      "text": "Really, who cares about another battle? We know how this is going to end."
    },
    {
      "text": "The best thing about The Avengers, a multi-tentpole blockbuster that gathers half a dozen Marvel superheroes and unfurls them on a baddie from another planet, is that it also unleashes them on each other."
    },
    {
      "text": "... the filmmakers behind The Avengers attack their task of creating a comic book superhero epic with not just conviction, but something almost resembling panache."
    },
    {
      "text": "This is a movie that knows and deeply loves its audience, but it's funny, smart and good-natured enough to please the rest of us, too."
    },
    {
      "text": "Whedon gets the vibe and the delights of Marvel comic books in the same way that Spielberg and Lucas intuitively understood the appeal of serials in Raiders of the Lost Ark."
    },
    {
      "text": "...mewling quim..."
    },
    {
      "text": "The Avengers is simply marvelous!"
    },
    {
      "text": "This full throttle action extravaganza might have benefitted from an attached 'Superheroes for Dummies' cheat sheet, but, hell, who cares? If its 3-D thrills you want, you'll have a blast."
    },
    {
      "text": "Whedon's investment in building this world is so complete that it captures the audience, as well."
    },
    {
      "text": "The term \"geekgasm\" does not go amiss here."
    },
    {
      "text": "Joss Whedon has successfully fulfilled every Avengers fanboy's dream and that alone is a good enough reason to forgive some of the movie's earlier faults."
    },
    {
      "text": "The picture is broken down into narrative chunks that ultimately don't tell much of a story - what you get instead is a series of mini-climaxes held together by banter between characters."
    },
    {
      "text": "Even those who don't know a Marvel hero from a DC caped crusader will find themselves having a grand time. That's because Whedon manages to tap the inner fanboy and fangirl dormant in us all."
    },
    {
      "text": "A high quality, incredibly entertaining, joyous summer event. If I was 12, it would be my favorite movie ever made."
    },
    {
      "text": "The Avengers has a knockout final 30 minutes, all gee-whiz crash and bang and eye candy that makes grand use of 3D and IMAX and all the other toys. But the Transformers movies did that, too."
    },
    {
      "text": "The Avengers is popcorn cinema at its best."
    },
    {
      "text": "That director Joss Whedon has put them all in the same movie and made it work at all is no mean feat."
    },
    {
      "text": "Joss Whedon is a small-screen storyteller. And I mean that as a compliment."
    },
    {
      "text": "a winning piece of popcorn entertainment that does better with characters in an ensemble setting than many ever did when they starred in their own vehicles."
    },
    {
      "text": "I just wish it was actually a really good, memorable summer Movie Movie. And it's not. It doesn't suck, but it's not One Of Those."
    },
    {
      "text": "[VIDEO ESSAY] Sloppy in its construction, \"Marvel's The Avengers\" has one thing going for it - humor."
    },
    {
      "text": "It is easy to get swept away in what may very well be the most engaging and exhilarating summer blockbuster this year"
    },
    {
      "text": "The whole affair feels like more of the same, just a lot more of it."
    },
    {
      "text": "All hail Joss Whedon, the warrior king of this dizzying, dazzling 3D action epic. The Avengers is Transformers with a brain, a heart and a working sense of humor."
    },
    {
      "text": "This mega-entertaining \"Avengers\" film is something comic fans have dreamed of since Marvel debuted the title almost 50 years ago."
    },
    {
      "text": "Marvel's The Avengers isn't the Second Coming, though it feels like it's been in the works almost as long as, but as far as big summer entertainment goes you'll rarely get much better."
    },
    {
      "text": "Comic-Con nerds will have multiple orgasms. I had a blast."
    },
    {
      "text": "Honest and loyal enough for the hardcore fans; smooth and accessible for the newcomer. Stunning action, great character, really funny."
    },
    {
      "text": "The Avengers proves these guys truly are Earth's Mightiest Heroes."
    },
    {
      "text": "It's the elements that Hollywood usually neglects - the characters, the dialogue and the humour - that makes The Avengers such an unadulterated pleasure."
    },
    {
      "text": "Joss Whedon marshals matters effectively throughout, without losing sight of that other key demographic: those who dispensed with their comic books long ago."
    },
    {
      "text": "A high-octane, silver screen mash-up that finally gets going after the best part of its 143-minute running time."
    },
    {
      "text": "It's simply a well-executed, highly enjoyable summer popcorn movie, which is exactly what it should be."
    },
    {
      "text": "This super-charged blockbuster is a mammoth spectacle which takes the genre to dizzying, rarely-seen heights."
    },
    {
      "text": "It gets the job done, but there's more to good movies than joining the dots."
    },
    {
      "text": "Whedon's story not only reconnects us with each character but also finds the time to flesh out their strengths and weaknesses, with some wonderful paranoid moments of self-doubt."
    },
    {
      "text": "Joss Whedon, with his demonstrated ensemble cast-wrangling expertise, is the only director who could have pulled this off. And he has set a new benchmark in doing so."
    },
    {
      "text": "Whedon really does know how to handle 3D, combining it with a fluid camera style to lend scale, perspective and drama enough to keep disbelief at bay for astonishingly lengthy stretches of time."
    },
    {
      "text": "Whedon is on to a winning formula."
    },
    {
      "text": "Despite a flabby middle-section and an overlong, bang-heavy denouement, the picture keeps its many plates spinning dizzily for more than two hours."
    },
    {
      "text": "It takes a while to get going, but once writer-director Whedon hits his stride, the film rockets through a series of frantically entertaining set pieces."
    },
    {
      "text": "If you like superhero movies at all, you'll absolutely love Avengers Assemble. It's got everything."
    },
    {
      "text": "The frenetic romp deftly knits together plot strands from earlier films, threaded with tongue-in-cheek humour."
    },
    {
      "text": "'The Avengers\" is neither overwhelming nor underwhelming. What it expertly is, is whelming."
    },
    {
      "text": "the teams most important mission is to spit funny one-liners at the face of over-the-topness"
    },
    {
      "text": "Epic in every sense, this sets the bar for the rest of the year's blockbusters. An absolute triumph."
    },
    {
      "text": "The story is epic, but rooted in humanity. The direction is slick and large for the set pieces, but intimate to contextualise the heroes. \"We have a HULK\" of a film and we have Joss Whedon to thank."
    },
    {
      "text": "Each hero has ample time in their own spotlight (Ruffalo's Hulk shining brightest) yet Whedon constructs the enveloping sense of camaraderie seamlessly..."
    },
    {
      "text": "Whedon can deconstruct the myth of heroism in his sleep, and probably does, but on this occasion he's here to redeem the cliches, not to bury them."
    },
    {
      "text": "[S]upercool, superfun... [A] real geek's brew... of premises and possibilities. All of which somehow work together, don't feel underdone, and leave us feeling like, for all its absurdity, everything we see is happening in a real space to real people."
    },
    {
      "text": "Brings cinema's most profitable recent Marvel superheroes together and makes them play in a kind of lunatic studio sandbox."
    },
    {
      "text": "It's an enjoyably absurd and absurdly enjoyable extravaganza, both delirious and surrealist."
    },
    {
      "text": "It was right the Avengers shouldn't gel right at once, but how that get-to-know-you period is played out in the script gets massively out of hand."
    },
    {
      "text": "The movie guarantees fast-paced fun without forcing anyone to think about what it all means, which is nothing."
    },
    {
      "text": "Awesomeness Assembled."
    },
    {
      "text": "Whedon maintains just the right tone of affectionate spoofery - the bickering never too silly or annoying - and gives all the characters, including Jeremy Renner's newcomer Hawkeye, enough to do to feel integral to proceedings."
    },
    {
      "text": "Whedon keeps the whole thing aloft with pizzazz -- you expect it to crash to earth like Fury's flying aircraft carrier, but somehow it never does."
    },
    {
      "text": "Whedon delivers what is pretty much the perfect superhero movie, combining a brilliant script, pacey direction, thrilling action sequences and pitch-perfect performances from a terrific cast."
    },
    {
      "text": "Five-star comic book gold; a fanboy's dreams turned into reality."
    },
    {
      "text": "... tremendous entertainment, confident and complete in a way that none of the Marvel movies so far have been."
    },
    {
      "text": "It's one of the best superhero movies ever and excels in terms of three key genres - action, comedy and suspense."
    },
    {
      "text": "This is as close as cinema gets to a fairground ride: it's shiny, noisy and exhilarating."
    },
    {
      "text": "A shiny, caged beast of a film that delivers on its every promise."
    },
    {
      "text": "Motors on quips and star charm and the primal Top Trumps thrill of assembling its protagonists. But there's no compelling reason for it to exist, no burning tale it needs to tell."
    },
    {
      "text": "The dialogue sparkles as brightly as the special effects; these people may be wearing ridiculous costumes but they're well fleshed-out underneath. And so in every regard, this movie truly fulfills its hype."
    },
    {
      "text": "Josh Whedon has pulled together an action movie of real wit, fun and spectacle, with some remarkable setpieces for a director not previously noted for visual flair."
    },
    {
      "text": "The Avengers is a good Joss Whedon film and an excellent Marvel film."
    },
    {
      "text": "Wildly entertaining yet brilliantly cohesive, wonderfully characterised, deftly humorous and packed with heart, this is an absolute winner."
    },
    {
      "text": "The Avengers is one of the greatest superhero films ever made. It's smart, fast, unrelenting fun. An instant, nuanced classic."
    },
    {
      "text": "Something remarkable: a superhero movie that entertains, excites, explodes, and even takes time to examine itself, and the world in which we live in."
    },
    {
      "text": "It took nearly a half-century to make it happen onscreen, but The Avengers was worth the wait, pairing together the perfect cast and perfect writer/director."
    },
    {
      "text": "Like a superior, state-of-the-art model built from reconstituted parts, Joss Whedon's buoyant, witty and robustly entertaining superhero smash-up is escapism of a sophisticated order."
    },
    {
      "text": "Though overlong and inevitably burdened by the need to juggle so many protagonists, the film is robustly entertaining and manages to maintain a playful, crowd-pleasing spirit."
    },
    {
      "text": "Apparently, bootleg copies of Transformers 3 made it to Asgard."
    },
    {
      "text": "The Avengers delivers! Considering the challenges and pitfalls of assembling disparate heroes and subplots, the skillfully-helmed movie is an effective balancing act between individual stories and collective goals."
    },
    {
      "text": "It's phenomenally awesome. No review for the film really matters anyway because you'd be mental to miss the biggest superhero film event since we were pooped out from the big bang."
    },
    {
      "text": "Whedon doesn't patronise viewers. He strikes just the right tone and where there are rough edges, he uses Iron Man's wry humor to smooth them out. The effect is totally disarming."
    },
    {
      "text": "Whedon has delivered a highly commercial Hollywood product that's funny and builds to a stirring climax. Not only fanboys will love it."
    },
    {
      "text": "[It] carries the mark of a piece of expensively assembled fan fiction, albeit stitched together with a lightness and wit that will just about carry the casual viewer through two-and-a-half-hours of comic geek nirvana."
    },
    {
      "text": "Big, brash and very funny, Joss Whedon's Avengers is equal to the sum of its parts - and for once, that's no faint praise. Suit up."
    },
    {
      "text": "Whedon pulls off a stunning feat in bringing balance to this superhuman circus, engineered to charm the geek core and non-fans alike."
    },
    {
      "text": "Marvel's finest heroes finally come together to set a comic book franchise gold standard that will take some beating."
    },
    {
      "text": "Writer-director Joss Whedon has a magpie's eye for stealing other people's bright ideas, and an enviable knack for improving them."
    },
    {
      "text": "...doesn't have the emotional involvement of the best of sci-fi action films, but it's a thrashing good big dipper ride and the 3D actually works..."
    },
    {
      "text": "Lovers of the genre will be hard pressed to name their favourite superhero or moment: egos, powers & personalities let rip, as extravagant action, awe-inspiring stunts & extraordinary effects fill the screen in a blaze of spectacle. There's humour too"
    },
    {
      "text": "A witty, well-acted sci-fi adventure."
    },
    {
      "text": "A joyous blend of heroism and humour that raises the stakes even as it maintains a firm grip on what makes the individual heroes tick."
    },
    {
      "text": "This truly epic action picture positively pulses with panache, wit and excitement throughout."
    },
    {
      "text": "The Avengers is a statement of form: this is not only what all superhero movies should be, it is what all so-called blockbusters should be"
    },
    {
      "text": "Lives up to its immense potential."
    },
    {
      "text": "A continued run of quality can't be guaranteed, but all involved in The Avengers experiment should be proud they took on the challenge of redefining some significant pop culture icons, and, from 2008-2012, actually enhanced them."
    }
  ],
  "release_year": 2012,
  "duration": 143,
  "genres": [
    "Action",
    "Adventure",
    "Fantasy",
    "Sci-Fi"
  ],
  "synopsis": "When Thor's evil brother, Loki (Tom Hiddleston), gains access to the unlimited power of the energy cube called the Tesseract, Nick Fury (Samuel L. Jackson), director of S.H.I.E.L.D., initiates a superhero recruitment effort to defeat the unprecedented threat to Earth. Joining Fury's \"dream team\" are Iron Man (Robert Downey Jr.), Captain America (Chris Evans), the Hulk (Mark Ruffalo), Thor (Chris Hemsworth), the Black Widow (Scarlett Johansson) and Hawkeye (Jeremy Renner).",
  "popularity": 9.1,
  "poster_url": "https://image.tmdb.org/t/p/original/RYMX2wcKCBAr24UyPD7xwmjaTn.jpg"
}