{
  "movie_name": "Titanic",
  "movie_id": "titanic",
  "total_reviews": 254,
  "reviews": [
    {
      "text": "\"Thanks to its awe-inspiring set pieces and captivating romance, James Cameron’s Titanic remains just as powerful today as it was 25 years ago.\""
    },
    {
      "text": "Every time I watch the film it has a new piece or element that makes me fall in love with it even more. It is truly one of the greatest romances seen on film, largely thanks to the performers."
    },
    {
      "text": "'Titanic' isn’t shy about reaching for the heartstrings, but it’s so well made and acted that it’s impossible to look away from."
    },
    {
      "text": "Cameron is skilled at creating successful films that often perform exceptionally well at the box office, and Titanic was no exception."
    },
    {
      "text": "An awe-inspiring, life-changing love — the kind, perhaps, worth boarding the Titanic for."
    },
    {
      "text": "Still my second favourite film of all time. A masterpiece."
    },
    {
      "text": "The fact that we're still talking about Titanic over 25 years after its release speaks to the film and ship's staying power. Some issues with the fictional love story not withstanding, Titanic remains an epic achievement in filmmaking."
    },
    {
      "text": "As colossal as the ship itself."
    },
    {
      "text": "Technically very good and with great visual achievements, but, in the end, it's a cheesy, fluffy narration full of meringue that doesn't satisfy. [Full review in Spanish]"
    },
    {
      "text": "Revisiting the iconic film was a blissful experience, which holds up against the test of time."
    },
    {
      "text": "Intimate and personal in a manner belying its scale, James Cameron’s work on Titanic holds up as well as ever."
    },
    {
      "text": "Those shots of the boat sinking — the grand terror of it all — goodness gracious, man…the swooning, doomed romance…Garber by the clock…Leo the damn movie star…cinema! Cinema, I say! Cinema!"
    },
    {
      "text": "James Cameron knows what he's doing, and with “Titanic”, he made a modern classic; simple and archetypal, but powerful. I'm sure I'll end up seeing it again (in 6K, 8K or even as a hologram) in five, ten, or even thirty years. Full review in Spanish."
    },
    {
      "text": "It is a lighting-in-a-bottle moment in cinematic history where the stars aligned and came to represent what a perfect film could achieve when everything went exactly right."
    },
    {
      "text": "You can say what you want about James Cameron, he makes movies people want to go see -- Whether they're about a blue-skinned indigenous tribe on a faraway planet or a love story set aboard a doomed luxury liner in 1912."
    },
    {
      "text": "My favorite line in the movie comes from Kathy Bates’ Molly Brown, who instantly sizes up the tension between Billy Zane’s arrogant Cal and his betrothed Rose..."
    },
    {
      "text": "... a guilty-pleasure tear-jerker."
    },
    {
      "text": "Cameron’s greatest strength is his unrelenting drive to amass a spectacle fitting of his source material. Titanic is a testament to a time when film tried to step outside the confines of the screen and change the very world around its walls."
    },
    {
      "text": "One of the greatest disaster films ever and certainly the one truly genuine blockbuster movie of the '90s."
    },
    {
      "text": "Perfectly linked, in logistical and emotional terms, the distinct perspectives within Titanic adjust themselves perfectly.  [Full review in Spanish]"
    },
    {
      "text": "The biggest decision that guaranteed Titanic’s success was the casting of the two leads. Neither was a particularly huge star when the movie was being put together in 1996, but their chemistry was electric. (25th anniversary)"
    },
    {
      "text": "The film brought the old legend to life and stoked an emotional windfall that has never been seen in movies before or since."
    },
    {
      "text": "\"Titanic\" delivers and then some."
    },
    {
      "text": "Titanic is, in the end, and despite being prohibited to those under 12 years old, a film for children of all ages, for those ready to gasp at a parade of wonders and eager to be swept away."
    },
    {
      "text": "This is why movies were invented."
    },
    {
      "text": "As epic mainstream entertainment, the film is the best Hollywood has produced since the late David Lean sent Lawrence to Arabia or Zhivago to Russia. As experience, it will strike those who let it as profound."
    },
    {
      "text": "Cameron has filled this saga almost to the bursting point with stories and themes that stretch from romance to expose, from parables of hubris to celebrations of industry. This is a great, sprawling film because it urgently needs to be so."
    },
    {
      "text": "Titanic was expected to be impressive. It is, friends, much more than that. It attains a state of humbling majesty, evoking with a sense of unashamed grandeur a terribly out-of-style but vital emotion, awe."
    },
    {
      "text": "The young lovers, portrayed by the talented Leonardo Di Caprio and Kate Winslet, are beautiful and blessed in finding each other, and their story, as told by the old woman, humanizes an event daunting in its scope and impact."
    },
    {
      "text": "The movie, however, is a triumph of truly titantic proportions. Proof that directors and actors can work alongside computer-generated effects without being swamped by the technology."
    },
    {
      "text": "James Cameron's deeply disappointing Titanic is a sad thing when set against the modest, factual 1958 film, A Night to Remember."
    },
    {
      "text": "The marriage of simplistic plots and stylistic excesses is a hallmark of James Cameron’s movies, and this is his masterwork, for good and ill."
    },
    {
      "text": "Ultimately, it is Cameron's overweening ambition to overlay a grand journey of the human spirit atop all the thrills, spills and clinches that hobbles his epic, rendering it enjoyable but mediocre."
    },
    {
      "text": "Strap on your life vests and dive on in: It's wonderful hokum."
    },
    {
      "text": "Now, let me tell you what's really impressive about Cameron's film. In the midst of all of the hydraulic set spasms, dauntless stuntwork and computerized mirages, Titanic cultivates one of the best mainstream love stories Hollywood has produced in years."
    },
    {
      "text": "Visually, the movie is undeniably impressive; there's no question where all the money went. As love stories go, this one is solid, but it's a long way short of special."
    },
    {
      "text": "Like the magnificent ship at its center, \"Titanic\" exhibits a grandeur and panache reminiscent of a bygone era."
    },
    {
      "text": "James Cameron's Titanic looks grand, but proceeds rather absurdly as it tells a tear-jerking but preposterous story of a love affair, viciously fought by the most dastardly villain since the demise of gaslight melodrama."
    },
    {
      "text": "Cameron has amplified and elaborated, and it has to be said, in circumstances like these, bigness has its own fascination."
    },
    {
      "text": "Winslet is breathtakingly vivid in her emotional transparency. She easily masters the American accent as well as a young upper-class girl's petulant pride."
    },
    {
      "text": "There are moments of suspense which will have even the blase digging their nails into the armrest. And the scenes involving the ship's death throes are some of the most spectacular ever on screen."
    },
    {
      "text": "The verdict: As big and glorious as the ship itself, unwieldy, unstoppable, packed with all the corny histrionics of the grand old Hollywood blockbusters and culminating in the most breathtaking maritime disaster since Waterworld."
    },
    {
      "text": "Cameron succeeds because he combines amazing effects with a powerful love story. He takes us into the past, he provides perspective for the present, and he'll keep audiences rapt for three hours."
    },
    {
      "text": "It's s movie of big flourishes and tiny moments."
    },
    {
      "text": "At least we know there won't be a sequel."
    },
    {
      "text": "The result is a three-plus-hour marvel, an epic adventure that immerses the audience into a touching romance, then takes a sharp turn into action and thrills, when the famous ship meets its doom. Titanic, it turns out, was worth waiting for."
    },
    {
      "text": "What do you get for your $6? You get an impressive epic of a scope Hollywood doesn't handle anymore, on the massive scale of Lawrence of Arabia or Spartacus. You also get a spectacle so large that it frequently dwarfs the human element."
    },
    {
      "text": "Essentially, James Cameron's Titanic is four loosely-connected movies squeezed into one, none of them entirely satisfactory, none totally disastrous."
    },
    {
      "text": "Cameron's attention to detail in the smaller, human moments makes the eye-popping visual effects work, and the performances of DiCaprio and Kate Winslet are affecting even when the pair is just running though water."
    },
    {
      "text": "A decently charming and heart-wrenching love story, Titanic briefly transforms itself into the pulsing action-adventure movie we never got last summer, and, at the same time, is a panic-stricken moral lesson about class and gender strife."
    },
    {
      "text": "Woven into this authentic recreation is a tearjerking tale of young love which adds a new dimension to the unfolding human drama."
    },
    {
      "text": "Lavish, corny, and almost exhaustingly spectacular, Titanic is the kind of grand entertainment that only Hollywood can make."
    },
    {
      "text": "Titanic contains moments so astounding they deserve to be seen. And to DiCaprio and Winslet's credit, they outshine their material. But before Titanic delivers the goods, be prepared to tread a lot of water."
    },
    {
      "text": "James Cameron succeeds in bringing the story to life on screen like never before, employing state-of-the-art technology to create pure cinema that is, by turns, thrilling, heartbreaking, spellbinding and breathtaking."
    },
    {
      "text": "James Cameron's waterlogged epic is as vainglorious and over-inflated as the ship it's named for."
    },
    {
      "text": "Titanic is consistently engrossing as an old-fashioned disaster movie bound to blow its competitors out of the water."
    },
    {
      "text": "Is Titanic worth your $6 price of admission? Absolutely. It's a spectacular disaster film nested inside a superior drama about great love and great loss."
    },
    {
      "text": "The film opens its arms, then embraces its audience for the better part of three hours. The hug is genuine and heartfelt."
    },
    {
      "text": "Interpreting the tragedy as a tale of two people who find love a bit late in the day sounds fine in theory. But what about the many hundreds who simply found death? They remain computerised flotsam and jetsam."
    },
    {
      "text": "The ingenious Cameron and his effects team have creating indelible, realistic images... Where Titanic springs its leaks is in the creating of indelible or realistic people."
    },
    {
      "text": "Cameron excels at big scenes and muscular action; it's the little things, such as emotional nuance and complicated characters, that he can't manage well."
    },
    {
      "text": "For all the chatter about Cameron's tyrannical work ethic, his film's delayed release and its reported $220 million-plus budget, Titanic cruises majestically into America's multiplexes and delivers a whopping entertainment."
    },
    {
      "text": "Forget Celine Dion’s infernal heart. This movie just goes on and on."
    },
    {
      "text": "Push aside the phenomenon, which too often limits Titanic's place in film history, and what's left is an immersive and affecting experience that may have been lost amid the talk about its making, its superstar performers, and its box-office receipts."
    },
    {
      "text": "It might be best perhaps to describe Titanic as a sort of lowest common denominator. The film contains certain minimums necessary to draw an audience ... but its very blandness ... accounts for its great success."
    },
    {
      "text": "Stirring music and seamless special effects add to the thrills - it's just a shame it takes so long to get to that point."
    },
    {
      "text": "For all the sluggish script and the enormous weight of the special effects, this movie behemoth still has the power to shake us rigid and and touch the soul."
    },
    {
      "text": "[The ending] is a masterpiece of popcorn tragedy: not deep, not sophisticated, barely even credible, but gut-clutching for those of us who have already lost the sensible use of our stomachs, as we would in any worthwhile fairground ride."
    },
    {
      "text": "It's the kind of movie that just doesn't come along that often."
    },
    {
      "text": "In recent years I've come around to thinking that a more nuanced version of the tale with better-rounded characters wouldn't resonate as powerfully as Cameron's shamelessly bold, sometimes silly strokes."
    },
    {
      "text": "See Titanic, then, for its success as an outrageous visual stunt -- a marvel of cinematic (and computer) sleight-of-hand. But don't go with any illusions that this soap opera on water is anything but a cartoon melodrama with fairy-tale leads."
    },
    {
      "text": "The movie is a ride, and not without the odd moment of corniness. But it's also about freedom and flight, bondage and stagnation. And most fittingly, as a memorial itself, it's about memory and the act of remembering."
    },
    {
      "text": "No meager disaster movie, greased by generic formula and goosed by big-bucks technology... Titanic is one big, bruising movie that will appeal on different levels to different audiences."
    },
    {
      "text": "Titanic has deservedly cemented its place as one of the greatest movies of all time, as it manages to capture the wretchedness of historical tragedy while also skilfully enrapturing us with the dedication shown by one person to another..."
    },
    {
      "text": "The dialogue may be unspeakable, but the film remains unsinkable."
    },
    {
      "text": "Cameron's aim was to set the most intimate love story possible against one of the century's biggest tragedies, and he very nearly pulls it off. DiCaprio has a captivating presence in a role that might have been written for a young Clark Gable."
    },
    {
      "text": "What I can tell you, risking puns, is that it swept me off my feet almost from the get-go, a grand epic romance-disaster that reminded me, in the middle of my overstuffed-with-movies life, of what we mean when we talk about the power of cinema."
    },
    {
      "text": "Sure, 'Titanic' may be corny, clumsy, and obvious-but the sincerity of its emotions and the power of its spectacle endure."
    },
    {
      "text": "Cameron has devised a tender love story between Kate Winslet and Leonardo DiCaprio that serves as the main focus of Titanic's storyline, and it works beautifully."
    },
    {
      "text": "If computer-generated special effects have overpowered human-generated drama, Cameron seizes that dangerously cold technology and recasts it as dream and delirium, profoundly human in its sources and longings."
    },
    {
      "text": "The execution is state-of-the-art and breathtaking. Titanic offers the full compass of courage and cowardice, and it stands as an achievement that truly is a night to remember at the movies."
    },
    {
      "text": "Titanic provides an absorbing blend of historical fact and old-fashioned Hollywood tearjerking."
    },
    {
      "text": "Titanic is indeed a ship of dreams. Climb aboard and bon voyage."
    },
    {
      "text": "DiCaprio and Winslet both deliver star-making performances."
    },
    {
      "text": "Take one of history's most compelling tragedies, tell it through the lives of two engaging young lovers and show it with some of the best-ever special effects and you have a dazzling, exciting movie that is also poignant and personal."
    },
    {
      "text": "It's a technically magnificent and emotionally wrenching experience."
    },
    {
      "text": "Titanic is an awesome achievement, a traditional Hollywood epic that dazzles your eyes, breaks your heart and shivers your soul."
    },
    {
      "text": "DiCaprio manages a good mix of youthful bravado and nervous uncertainty... And Winslet shines as a willful rich girl who discovers her sensual side with this earthy urchin."
    },
    {
      "text": "With his beatific, sweet, open face, DiCaprio gives us a rooting interest in hoping that someone important to us survives the wreck."
    },
    {
      "text": "Titanic 3D lacks creative synergy that could have been explored had the film been shot with 3D in mind but its easily the best example of post-conversion to date."
    },
    {
      "text": "A staggering film, layered with melodramatic romance, tragedy, intensity and breathtaking production design."
    },
    {
      "text": "Jack and Rose actually cause the Titanic to hit the iceberg. Watch closely."
    },
    {
      "text": "Director James Cameron takes one of his most beloved historical incidents and transforms it in to a McDonald's product..."
    },
    {
      "text": "While I admit the film does not impress me as much as it does most other people, there is no questioning its passion and excitement."
    },
    {
      "text": "When the bolts start to pop and the water bursts the bulkheads and the ship's orchestra plays waltzes, writer-director Cameron achieves his vision grandly."
    },
    {
      "text": "The most breezy 194 minutes ever to grace the multiplex."
    },
    {
      "text": "The clunky dialogue, historical inaccuracy and overdose of Billy Zane in the opening stanza of the film is all but forgotten in one of the most emotionally affective, thrilling closing stanzas ever committed to celluloid."
    },
    {
      "text": "'Titanic' is an epic that's see-worthy indeed. Directed/written/produced by James Cameron, its $200 million budget shows in its glorious effects, dazzling camera work and lavish sets, now, with the addition of Cameron's carefully crafted 3-D."
    },
    {
      "text": "Yes, it is time to return to the chilly North Atlantic to appreciate again James Cameron's glorious epic, for its scope, underappreciated script and perfect casting."
    },
    {
      "text": "Two spitting scenes in 3D and Jack Dawson loses his virginity. A second look indicates a cruel streak in the modern epic."
    },
    {
      "text": "Spoiler alert! The ship still sinks."
    },
    {
      "text": "It is, simply, a great film, a throwback to classic filmmaking, and more than that, an experience with unusual resonance to the world of today."
    },
    {
      "text": "The kind of mass death spectacle Michael Bay is frequently accused (and often guilty) of partaking in is much better encapsulated in Titanic's final third."
    },
    {
      "text": "If you can get past the occasional Cameron clunker (Who can forget, \"I'm the king of the world!\") and Zane's almost amusingly over-the-top turn as Cal, Titanic still manages to make the tragedy seem more vivid than a statistic in a history book."
    },
    {
      "text": "Forget that we know how it all ends; it's the drama of dealing with eventuality that tells the real story here."
    },
    {
      "text": "15 years ago, I didn't let Titanic into my heart, now I get it. Movie is fantastic, but utterly fails as a 3D reissue."
    },
    {
      "text": "Simply one of 20th century cinema's greatest, old-fashioned love stories, full of still impressive effects (pre 3D) and decent, if theatrical acting ..."
    },
    {
      "text": "Titanic evidences the secret of his longtime success, a talent more impressive even than Cameron's technical prowess: his ability to find stories that tap into greater truths and deeper feelings."
    },
    {
      "text": "Forget women and children, what about truth and realism first?"
    },
    {
      "text": "We know the story ends badly but Cameron still sweeps us up in the romance between Kate Winslet's rebellious posh girl and DiCaprio's steerage kid."
    },
    {
      "text": "Titanic still works brilliantly; it's a grand-scale studio epic with the heart of a romance and the pulse of an action movie. It's the only American film that rivals Gone With The Wind for both swoonery and production value."
    },
    {
      "text": "Titanic is a movie that has to be seen on the big screen and will enchant a new generation of fans. A must-see 3D experience."
    },
    {
      "text": "It has itself become, like the shipwreck, a cultural monument, only accreting value, not losing significance, as time goes by."
    },
    {
      "text": "Cameron hasn't plugged any of the plot holes and some dialogue is still cheesy but now, just as in 1998, we forgive him a multitude of sins."
    },
    {
      "text": "Cameron's three-hour disaster epic is a triumph of popular art -- of folk art, really."
    },
    {
      "text": "\"Titanic\" still amazes as the kind of massive, build-and-destroy production that few filmmakers have the ambition or budget to make."
    },
    {
      "text": "[Cameron] stages the sinking with a flawless sense of detail, pacing, import and dread."
    },
    {
      "text": "For all of its flaws, this movie works in the way that classic Hollywood movies do. It delivers."
    },
    {
      "text": "Its emotional impact lies in the fact it makes even the most blas of us feel what it must have been like to be on the sinking ship. And the film's underlying themes still have potency."
    },
    {
      "text": "Only the snobbish or the obtuse could deny its ambition, verve and entertainment firepower."
    },
    {
      "text": "This version has deepened and enriched a film that was already rich in emotions and remarkable for its depth of detail."
    },
    {
      "text": "How is Titanic in 3D? The answer is pretty damn dazzling."
    },
    {
      "text": "Those who've only seen it on video don't think the film is that big a deal. Trust me, it is. Even with the dragged out love story, Cameron's film is still mind-blowing."
    },
    {
      "text": "Time has been kind to the effort, exposing a strikingly constructed, sporadically numbskulled, exhaustively sentimental feature that sails smoothly with an unobtrusive 3D addition."
    },
    {
      "text": "If you fancy indulging in pure, unadulterated silliness and spending a night in the '90s, this is a good bet. Otherwise..."
    },
    {
      "text": "Reissued to tie in with the 100th anniversary of the Titanic's ill-fated maiden voyage, it's astonishing how timeless the film looks. And as a true classic, it doesn't lose our attention for a moment."
    },
    {
      "text": "Titanic is a sumptuous assault on the emotions, with a final hour that fully captures the horror and the freezing, paralysing fear of the moment."
    },
    {
      "text": "Cameron is a genius at instilling narrative dread and designing a hokum-drenched fairy tale of a certain size."
    },
    {
      "text": "Like the film or don't like the film, there are very few filmmakers working now or ever who could have done what Cameron did here, no matter what resources they had."
    },
    {
      "text": "Near, far, wherever you are sitting in the theater, the newly revamped Titanic now has stuff coming out at you."
    },
    {
      "text": "If any film should be redone in 3-D, it's \"Titanic.\" And if any filmmaker should be the one doing the redoing, it's James Cameron."
    },
    {
      "text": "A timeless epic that gets me every time (yes, I needed my own life raft at the screening), the power of the storytelling and the performances by Kate Winslet and Leonardo DiCaprio grip throughout."
    },
    {
      "text": "It's so easy to see how this film that's still so enjoyable from start to end has become so iconic."
    },
    {
      "text": "Revisiting Titanic on the big screen, this time in impressive 3D, is a welcome reminder of solid blockbuster movie magic."
    },
    {
      "text": "The central love story involving steerage passenger Leonardo DiCaprio and rich girl Kate Winslet has lost none of its luster - metaphorically speaking."
    },
    {
      "text": "With a 3D conversion from the medium's pioneer-in-chief, Titanic is a big-screen romance that's every bit as epic as you remember."
    },
    {
      "text": "It's for old-fashioned romantics who want to see a classic love story on the grandest scale."
    },
    {
      "text": "It's certainly a jaw-dropping big screen experience, even though the outcome is never in doubt. Just make sure you bolt for the door once Celine Dion's caterwauling kicks in."
    },
    {
      "text": "A thoroughly gripping, emotionally powerful, genuinely thrilling and, yes, achingly romantic drama with jaw-dropping special effects and star-making performances from DiCaprio and Winslet."
    },
    {
      "text": "\"Titanic 3D\" works because it's still \"Titanic,\" a satisfying merger of newfangled effects and oldfangled melodrama. Judging by the wave of sniffles at the sneak preview screening I saw Tuesday night, it's a formula that endures 15 years later."
    },
    {
      "text": "The re-release is keenly timed with the 100th anniversary of the actual sinking of the RMS Titanic, yet another factor to validate the 3D film's existence."
    },
    {
      "text": "Sure, it's corny, but there's something endearing about the tale of young love and its earnest lack of irony."
    },
    {
      "text": "Leo and Kate give good doomed romance but it's the human horror of the collision, botched evacuation and final sinking that devastates most."
    },
    {
      "text": "Cameron's detractors grouse about his use of scale and spectacle to invest archetypal, even clichd stories with an extra, unearned emotional significance. They're absolutely right, with one crucial caveat: there's absolutely nothing unearned about it."
    },
    {
      "text": "Like Kathy Bates' \"unsinkable\" Molly Brown, \"Titanic\" is unabashedly American: It's big, brash and sometimes gauche, yet also unapologetically earnest, amazing to look at and devoted to its own cause. And it knows how to win us over."
    },
    {
      "text": "Overall, for a blockbuster movie about one great big thing hitting another great big thing, the new film shows distinctly upper-deck restraint."
    },
    {
      "text": "The letdown factor has been most keenly felt in conversions from 2D, but Titanic 3D shows how the ambition can be realized if the will and skill are there. We can only hope that other filmmakers follow Cameron's example."
    },
    {
      "text": "But the power of Titanic didn't come from originality; it came from punching cliches across with a seldom-seen directness and sincerity that seemed pure of heart, \"old-fashioned,\" or plain corny, depending on your perspective."
    },
    {
      "text": "James Cameron's spectacular new 3-D version of \"Titanic'' is everything I'd hoped for, and more."
    },
    {
      "text": "Here is a rare opportunity to return to something you once loved, and discover it still holds up, no apologies necessary."
    },
    {
      "text": "Still a spectacular cinematic experience that, if nothing else, will remind moviegoers why they fell in love with it in the first place."
    },
    {
      "text": "A modern-day take on the classic Hollywood romance, delivered with the kind of panache long thought lost to the sands of time, that proves essentially timeless."
    },
    {
      "text": "Turns out hubris and greed float, like sorrow."
    },
    {
      "text": "The unprecedented special effects...never overpower the fictional love story and historical human tragedy which are presented. It's not only awe-inspiring, it's surprisingly moving."
    },
    {
      "text": "As dreadful as another post conversion of a blockbuster may sound, this is as good as it gets"
    },
    {
      "text": "Great movie, but not appropriate for all kids."
    },
    {
      "text": "Exactly what it says on the label: a deliciously overwrought melodramatic love story, capped off with one of the greatest special effects achievements of the 1990s."
    },
    {
      "text": "Feeling dispassionate about Titanic is a bit like being stranded alone on the North Atlantic."
    },
    {
      "text": "Extravagant, exhilarating, devastating, poetic, romantic and totally unforgettable, Titanic is an extraordinary achievement in film making, where technology astounds, yet the human story shines even brighter"
    },
    {
      "text": "You will walk out of Titanic not talking about budget or running time, but of its enormous emotive power, big as the engines of the ship itself, determined as its giant propellers to gouge into your heart, and as lasting as the love story that propels it."
    },
    {
      "text": "Now it can be told: The Titanic went down because of two distracting smoochers on the poop deck."
    },
    {
      "text": "In the end, Cameron's monumental epic still prises open the tear ducts."
    },
    {
      "text": "A spectacular demonstration of what modern technology can contribute to dramatic storytelling."
    },
    {
      "text": "Titanic is a good, often stunning movie caught in a three-and-a-half hour drift."
    },
    {
      "text": "Cameron captures the majesty, the tragedy, the fury and the futility of the event in a way that supersedes his trivial attempts to melodramatize it."
    },
    {
      "text": "Titanic is big, bold, touchingly uncynical filmmaking."
    },
    {
      "text": "Cameron skillfully applies sophisticated special effects to classic American storytelling, resulting in a winning combination of a tale that's modern and old-fashioned, delivering the goods expected of the disaster genre."
    },
    {
      "text": "There is nothing to dislike about this film."
    },
    {
      "text": "Titanic runs well enough in the backstretch of intrigue and contrivance to cross the finish line well ahead of all but a few of the screen's superspectacles in this century."
    },
    {
      "text": "Perhaps the most melancholy thing about Titanic is its celebration of romantic ideals to the exclusion of such self-denying virtues as honor, duty, and heroism."
    },
    {
      "text": "Cost: well over $200m. Disregarding the ethics of such expenditure on a film, this unprecedented extravagance has not resulted in sophisticated or even very satisfying storytelling."
    },
    {
      "text": "A brilliantly designed, but emotionally shallow romance set during the infamous sinking of the luxury liner in 1912."
    },
    {
      "text": "It's something of an ingenuous revision of the standard disaster movie."
    },
    {
      "text": "An enormous technical achievement with a wonderfully big heart."
    },
    {
      "text": "Titanic is some big movie."
    },
    {
      "text": "The spectacle of the ship will enchant you, and the tragedy of the victims will haunt you for many days after you've seen it."
    },
    {
      "text": "Rose and Jack are burdened with simplistic characterisation and atrocious dialogue."
    },
    {
      "text": "This is Hollywood spectacle at its best, with a warm gooey heart."
    },
    {
      "text": "The plot before the collision is almost dispensable, but from that moment on, it is absolutely riveting."
    },
    {
      "text": "Yes, Jack Dawson and Rose DeWitt Bukater are flimsyish characters, but DiCaprio and Winslet still have the formidable challenge as actors to gauge the levels of their performances against the galvanizing visual and technotronic aspects of the film."
    },
    {
      "text": "The film is the best of the year."
    },
    {
      "text": "An old-fashioned epic, a brawny drama built on tragedy, adventure, romance, charismatic stars and jaw-dropping, high-tech special effects."
    },
    {
      "text": "Quando eu sa do cinema no era apenas um espectador fascinado. Era um sobrevivente do Titanic."
    },
    {
      "text": "Titanic is awesome even when it's awful -- you can't take your eyes off the extraordinary thing."
    },
    {
      "text": "The film's long final phase is a harrowing series of sublime images of death and those about to die."
    },
    {
      "text": "The finale is a special effects dazzler but those scenes pale in comparison to the dramatic and creative ways Cameron exalts the salvific power of love."
    },
    {
      "text": "If when you see this film, you believe it's credible, God bless you and your unfortunate offspring with their damaged gene pool."
    },
    {
      "text": "Despite its failings it's hard not to become swept up in the sheer grandeur of Titanic."
    },
    {
      "text": "The incredible finale more than makes up for its other crimes."
    },
    {
      "text": "In his brilliant, monumental film Titanic, one of the most popular and beloved Hollywood movies of the past 50 years, James Cameron revisited that night in all its horror and glory."
    },
    {
      "text": "A hackneyed, completely derivative copy of old Hollywood romances, a movie that reeks of phoniness and lacks even minimal originality."
    },
    {
      "text": "This is a fine example of Hollywood filmmaking. This is a studio film in the best sense of the word."
    },
    {
      "text": "It's clear that Titanic will be a technophile's delight."
    },
    {
      "text": "It is perhaps the best example in 1997 of a film which is pure, simple melodrama."
    },
    {
      "text": "A fascinating combination of newfangled technological innovation and old-fashioned cornball melodrama, Titanic is so close to being a truly terrific movie that contemplating its various missteps pains me."
    },
    {
      "text": "Whatever it's pigeon-holed as, you're going to love the movie."
    },
    {
      "text": "Who'd have thought that the most expensive film ever made could also be good cinema?"
    },
    {
      "text": "There's a lot to like here."
    },
    {
      "text": "May be the year's most effective and consistently entertaining love story."
    },
    {
      "text": "Titanic will give you your money's worth."
    },
    {
      "text": "Cameron succeeds magically in linking his film's young lovers, played enchantingly by Leonardo DiCaprio and Kate Winslet."
    },
    {
      "text": "The movie raises important questions about choices faced by the characters."
    },
    {
      "text": "James Cameron has made a miracle movie that delivers big-time."
    },
    {
      "text": "The genius of Titanic does not lie in the story itself. It lies in how the story is told."
    },
    {
      "text": "There's never been a film of more stunning visual splendor, starting with the magical way the underwater ruin of 1997 turns seamlessly into the floating luxury liner of 1912."
    },
    {
      "text": "The melodramatic love story is the perfect foreground for the sinking of the largest passenger ship in history."
    },
    {
      "text": "Forgive me if I gush too much, for I have just come back from seeing one of the five best films ever made."
    },
    {
      "text": "Titanic is one of his best, and raises the bar yet again."
    },
    {
      "text": "To take the space to try to convey to you all of the things that Cameron did right with this film would basically wipe out my alloted server storage."
    },
    {
      "text": "Glub glub glub."
    },
    {
      "text": "All things considered, Titanic is old-fashioned epic filmmaking that carries a wallop."
    },
    {
      "text": "James Cameron's 194-minute, $200 million film of the tragic voyage is in the tradition of the great Hollywood epics. It is flawlessly crafted, intelligently constructed, strongly acted and spellbinding."
    },
    {
      "text": "Awesome. Really. Not just expensive and jammed stem to stern with the technodazzle of disaster, but epic in narrative feeling."
    },
    {
      "text": "An unconscionable disaster..."
    },
    {
      "text": "Watching the film again, it suddenly struck me with the force of a pop-culture hurricane: Titanic is all about Rose. It is Rose's personal journey. This hardly ever happens in films..."
    },
    {
      "text": "The would-be emotional centerpiece of his three-hours-plus adventure flick is the most juvenile romantic tale of 1997."
    },
    {
      "text": "The movie's human elements are entirely stale, however appealingly packaged."
    },
    {
      "text": "This disaster-action-adventure-romance flick combines epic aspiration with cartoonish simplicity, with no qualms about going for the popular jugular, jerking tears and cheers with equal obviousness."
    },
    {
      "text": "As spectacle, Titanic sets a new standard; as romantic drama, it's substandard."
    },
    {
      "text": "Titanic is awash in truncated subplots."
    },
    {
      "text": "It is filmmaking at its best."
    },
    {
      "text": "But what's most impressive about Titanic is the evidence it shows of new maturity in Cameron's filmmaking priorities."
    },
    {
      "text": "Titanic is a film that sweeps us away into a world of spectacle, beauty and excitement."
    },
    {
      "text": "Jams Cameron impressively tells a love story and provides excitement, without ever losing sight of the staggering loss of lives."
    },
    {
      "text": "This man makes the bluest looking movies around"
    },
    {
      "text": "What Cameron does is essentially give us a history lesson in an empowering, emphatic, entertaining way. This extraordinary flick feels like a big event with a litany of emblematic scope and impressive visual vitality."
    },
    {
      "text": "The disaster is definitely worth the wait."
    },
    {
      "text": "The best film of its genre ever made."
    },
    {
      "text": "It is opulent, daring, detailed, vastly over-priced and incomparable."
    },
    {
      "text": "Titanic is one of those flawless, spellbinding epics that we all know and love."
    },
    {
      "text": "A wonderful masterpiece of a film."
    },
    {
      "text": "This absorbing, moving cinematic spectacle not only floats, it soars."
    },
    {
      "text": "James Cameron has gone and delivered a spectacular, moving, utterly engrossing three-and-a-bit hour epic."
    },
    {
      "text": "Titanic is a remarkable achievement."
    },
    {
      "text": "Time skips by quickly, and there are more than a few decent supporting performances to enjoy."
    },
    {
      "text": "This is a big film with a lot to like as well as a lot to not."
    },
    {
      "text": "Titanic is a terrific balance of realism and romanticism."
    },
    {
      "text": "No other film has made the horror of the ship's sinking so palpable, and none other has dared to dramatize the night of the living dead that followed after it sank beneath the North Atlantic."
    },
    {
      "text": "It's still by far and away a grand, gorgeous, breathtaking spectacle."
    },
    {
      "text": "Credit Cameron for locating that latitude-longitude spot where haunting loss intersects with sheer cinematic braggadocio. His movie may not be perfect, but visually and viscerally, it pretty well is."
    },
    {
      "text": "Kudos to stars Leonardo DiCaprio and Kate Winslet, who make an appealing onscreen couple."
    },
    {
      "text": "A lush and terrifying spectacle of romantic doom."
    },
    {
      "text": "You don't just watch Titanic, you experience it."
    },
    {
      "text": "An overwhelming cinematic experience which stuns, moves and entertains."
    },
    {
      "text": "Cameron has crafted an epic that triumphs."
    },
    {
      "text": "Titanic is big-budget spectacle and director Cameron brings it off with high-tech bravura, placing us aboard the ship in real time."
    },
    {
      "text": "The drama is cliched, if competently effective, but Cameron's dissolves from the Titanic's rusted hulk to her brand spanking new decks are breathtaking, even poetic."
    },
    {
      "text": "The regretful verdict here: dead in the water."
    },
    {
      "text": "The last hour of Titanic is huge and staggering, but there's no horror in it."
    },
    {
      "text": "Like it or hate it, Titanic lives and breathes as a piece of pure cinema."
    },
    {
      "text": "Bursting through gaps in the hull, rushing down corridors, licking at rooms, triumphing over great ballrooms and tiny closets, down stairways and into elevators, the sea, in the hands of Cameron and his technical associates, becomes hungry, vindictive."
    },
    {
      "text": "Like a David Lean film, it is an intimate epic with a moving and resonant love story at its core."
    },
    {
      "text": "Titanic is a great, soft-hearted traditional epic."
    },
    {
      "text": "The events of that cold April night and their detailed reconstruction are so dramatic and so well represented here, that you really do feel as if you are there with Jack and Rose."
    }
  ],
  "release_year": 1997,
  "duration": 195,
  "genres": [
    "History",
    "Drama",
    "Romance"
  ],
  "synopsis": "Two young lovers from completely different backgrounds meet and fall in love on the ill-fated maiden voyage of the unsinkable R.M.S. Titanic.",
  "popularity": 6.9,
  "poster_url": "https://image.tmdb.org/t/p/original/9xjZS2rlVxm8SFx8kPC3aIGCOYQ.jpg"
}