{
  "movie_name": "Top Gun",
  "movie_id": "top_gun_maverick",
  "total_reviews": 477,
  "reviews": [
    {
      "text": "The technology may be new but this is a very old-fashioned affair, building on the legacy of its 1986 predecessor with wit and grace."
    },
    {
      "text": "It is generally said that the second parts are not good, however,  Top Gun Maverick is fortunately an exception to this rule, it is even considered that in terms of the level of action and intrigue it may even be superior..."
    },
    {
      "text": "After 36 years, Tom Cruise returns as Pete “Maverick” Mitchell and proved to fans (and critics) of the first Top Gun that a long-awaited sequel can be entertaining, deserved, and of high quality."
    },
    {
      "text": "It’s a good thing it looks good ... because the plot is bare-thin."
    },
    {
      "text": "Top Gun: Maverick is the rare legacy sequel that eclipses the original in every way possible, thanks to mind-blowing action and great character growth."
    },
    {
      "text": "“Top Gun: Maverick,” if anything, proves that old-school big-budget blockbuster cinema that takes itself seriously isn’t just sorely missing from the yearly cinematic roster but still has the power to stand on its own."
    },
    {
      "text": "Ohh right this is what movies used to be like."
    },
    {
      "text": "Top Gun: Maverick is the reason why I go to the movies and why Tom Cruise is the biggest movie star in the world. WHAT. A RIDE."
    },
    {
      "text": "Maverick dished out generous amounts of bromance, action, and a truly-immersive narrative in swashbuckling style, and Cruise’s iconic grin was still the greatest thing to take away from it."
    },
    {
      "text": "It is all of the flying sequences that are shot in such a way that it makes the moviegoer feel like they are a passenger that gives the movie its energy and makes it so much fun."
    },
    {
      "text": "Top Gun: Maverick is a surprising stunner crafted with pure adrenaline and kerosene."
    },
    {
      "text": "Tom Cruise might save cinema."
    },
    {
      "text": "SPECTACULAR! One of the best cinematic experiences I have truly ever had in a theater. Heartfelt, exhilarating & down right emotional. Tom Cruise turns in one of his best performances & Top Gun 2 becomes one of his best films in his Career."
    },
    {
      "text": "The return of pure, nostalgic blockbusters. The best aerial action sequences ever amaze even the highest expectations, not only due to the absolutely insane real stunts but largely because of the flawless contribution of all filmmaking elements."
    },
    {
      "text": "The final scenes are truly nail biting, with intense flight sequences that result in Tom Cruise’s cast members going from nearly unknown performers, to A-list stars in a matter of minutes."
    },
    {
      "text": "Top Gun: Maverick is the rare sequel that elevates its source material and creates a new, worthwhile story. A high-octane thrill ride that celebrates where Maverick's been and where he’s going."
    },
    {
      "text": "The film is pure ideology, pure militarism, generic, and like the first Top Gun in 1986, undemanding."
    },
    {
      "text": "Women in Top Gun: Maverick don’t see much development, but written dialogue and camerawork treat them with respect."
    },
    {
      "text": "There’s no reason in the world it should have worked, but it does."
    },
    {
      "text": "A movie-movie with an old-school movie star, this actioner is best seen in theatres, where the dazzling fighter-jet sequences will make you dizzy."
    },
    {
      "text": "All of these elements come together to form one of the biggest third acts in recent cinema."
    },
    {
      "text": "While other actors disappear behind their roles, Tom Cruise wants you to know it's him. This movie uses all of its technical marvel to bring us back to an adrenaline-filled formula blockbuster full of emotion. Made for the movies. [Full review in Spanish]"
    },
    {
      "text": "Top Gun: Maverick is a little bloated at times and could have used a bit of trimming, especially in its third act, but there’s no denying the magnetic energy the film brings to the viewer."
    },
    {
      "text": "\"It’s a valid critical interpretation that Top Gun: Maverick is merely propaganda wrapped in a very pretty bow. But boy, that bow is really something.\""
    },
    {
      "text": "Its a sure-footed performance from an actor that never fails to hold the attention of its audience."
    },
    {
      "text": "A big jingoistic cartoon. But it’s a fun jingoistic cartoon..."
    },
    {
      "text": "After years of uncertainty with the pandemic, Tom Cruise's Top Gun: Maverick has saved movie theaters, revitalizing their business with a great film."
    },
    {
      "text": "We want the thrill of suspense, to root for characters, to be in awe of cinematography, and to share the collective experience of unity in watching a film with strangers.This movie gives you that and more!"
    },
    {
      "text": "Stunning aerial action sequences aren't just random dogfighting but serve as narrative test runs to prep viewers for the climax. Granted, the nostalgia wouldn’t exist without Tony Scott, so it’s hard to give Kosinski credit for copying the flight pattern."
    },
    {
      "text": "As the movie star system gives way to the IP era, don’t ever forget one thing: Tom Cruise is still a major movie star."
    },
    {
      "text": "Burnished 1980s blockbuster nostalgia as Tom Cruise and producer Jerry Bruckheimer prove they can still make ’em like they used to. Strap in for the thrillingly real aerial dog fights."
    },
    {
      "text": "The zenith of modern “legacy sequels,” Top Gun: Maverick is in many ways traditional—from its “rah rah” militarism, to its 1980s individualism—but it’s also a metatextual lament for the dying light of movie stars."
    },
    {
      "text": "Visually and emotionally satisfying in ways that you’d think would be the norm for big movies featuring families and explosions but very much aren’t."
    },
    {
      "text": "… an astonishing and glorious film that far surpassing its mediocre predecessor with a good story, amazing tech credits and some fab performances beginning with Cruise himself, who deserves to be in the Oscar conversation"
    },
    {
      "text": "Top Gun: Maverick will take your breath away!"
    },
    {
      "text": "So, why did Top Gun: Maverick strike such a cord with audiences? It’s a film about feeling relevant. About a changing world. Parenthood. Friendship. It resonates."
    },
    {
      "text": "It contains just as many formulaic narrative sops and expected character beats as the original, but the streamlining of the simple storyline provides a breeziness that befits and benefits the picture."
    },
    {
      "text": "\"Top Gun: Maverick\" delivers on just about every level imaginable and then exceeds it: plus ultra."
    },
    {
      "text": "...a decent-enough sequel that ultimately falls right in line with its watchable yet far-from-flawless predecessor..."
    },
    {
      "text": "If a more cheesy sensibility is what you are looking for, then you'll likely enjoy the hell out of this film."
    },
    {
      "text": "Like its predecessor, it thrives on military fetishism, a**hole energy, and the suspension of belief usually reserved for latter-day Liam Neeson fight scenes."
    },
    {
      "text": "One more piece of advice: See it in a theater. A big, loud, and crowded one. See it with the fans. That's the way these summer blockbuster blasts were designed to work."
    },
    {
      "text": "Cruise delivers a nuanced performance that gives Maverick multitudes. More than the character deserves. They find a way to make this guy likable and that is an achievement in itself..."
    },
    {
      "text": "Top Gun: Maverick represents the best of what blockbuster filmmaking can be, brilliantly blending spectacle with sentiment to exhilarating effect."
    },
    {
      "text": "A good story made for young and no so young. It will bring to the beloved franchise a whole new herd of followers. A splurge of technology and action without equal. [Full review in Spanish]"
    },
    {
      "text": "After Cruise and McQuarrie perfected the action thriller with Mission: Impossible—Fallout (2018), now they’re back (along with [director Joseph Kosinski and] some other screenwriters and story originators) to perfect the hero’s farewell."
    },
    {
      "text": "It flies higher than the original with a few aerial sequences that demonstrate Cruise's skill at piloting anything, but I don't find the sense of adrenaline in the flight routines and the predictable missions in the danger zone. [Full review in Spanish]"
    },
    {
      "text": "... A summer blockbuster of the old school, with rust-bucket F-14s duking it out with young pups in F-18s, all shot on celluloid rather than sketched in by computers, at the behest of a star who refuses to quit."
    },
    {
      "text": "Maverick may make you cry at points, but it is a feel-good, crowd-pleaser through and through."
    },
    {
      "text": "The screenplay impeccably balances the new with the nostalgic, drafting on the previous movie’s conflicts and amplifying its emotions."
    },
    {
      "text": "It shines brightest in the final 30 minutes which features some of the best aerial fighter footage ever put on screen. See it in the theater. You won’t regret it."
    },
    {
      "text": "Sights, sounds and speed act as a unifying force in an assault on our senses. When the engine roars, our knees tremble. When the jets dive, swoop and pirouette like they were in a musical number, the adrenaline rush trickles into the rest of the body."
    },
    {
      "text": "Brings Maverick’s story full circle in a satisfying manner that adds depth and dimension to its predecessor, but still tells a story that’s all its own."
    },
    {
      "text": "Forced ode to the original doesn't fully embrace the cheese"
    },
    {
      "text": "A sequel that manages to soar higher than it's predecessor."
    },
    {
      "text": "One of the rare films where every discussion leaving the theater is about how much fun you just had, instead of an analysis of its quotients."
    },
    {
      "text": "When Maverick is called back to tutor the most elite young Top Gun graduates for an impossible mission, one can imagine Cruise — by starring in a sequel 36 years after the cult original — schooling the next generation about true-blue action cinema."
    },
    {
      "text": "There's so much great action, incredible stunts, big laughs, and emotional moments that really send the viewer on a journey, which is exactly why we go to the movies."
    },
    {
      "text": "Kilmer’s inclusion in the blockbuster sequel shows that the franchise’s primary rivals are affected by something much stronger than g-forces these days: time."
    },
    {
      "text": "It helps that the filmmaking is pretty much impeccable, with director Joseph Kosinski providing the kind of clear, streamlined action sequences that make blockbuster spectacle feel fun instead of mandatory."
    },
    {
      "text": "Gorgeous cinematography, insane flying action sequences, thrilling, emotionally moving, and a sequel that absolutely surpasses its predecessor. Well-paced, executed & has that re-watchability factor."
    },
    {
      "text": "Along comes a film like Top Gun: Maverick (a film which the release was delayed a couple of times) and it reminds us of the good ole days in several ways. Thank you Joseph Kosinski (Oblivion, Spiderhead) and even bigger props to the ageless Tom Cruise."
    },
    {
      "text": "As much fun as it is when a familiar formula is well-executed, this movie is also an altar to America's obsession with youthfulness, its exaltation of white super-men, its worship of heavy artillery ... and (sigh) its objectification of women as trophies."
    },
    {
      "text": "Maverick’s fidelity to the past goes deeper than dollar signs. This is a film where generational commitments matter and institutional continuity is valued."
    },
    {
      "text": "The film is lovingly dedicated to the late Tony Scott, who directed “Top Gun.”  I’d like to think that he would give a thumbs up and a salute to “Top Gun: Maverick.”"
    },
    {
      "text": "Top Gun: Maverick is not bloated fan service, and it hits you with the right amount of nostalgia. A thrilling summer blockbuster!"
    },
    {
      "text": "\"A perfect popcorn movie and an improvement on the original.\""
    },
    {
      "text": "An action movie that's this visibly wondrous and entertaining, knows it's walking in familiar footsteps but puts in a bold effort to make this return trip mean something is electrifying and, yes, breathtaking."
    },
    {
      "text": "As someone who typically hates sequels, this is by far one of the best ones ever made. It pays homage to the original and elevates everything!"
    },
    {
      "text": "This was a very entertaining two hours that I might have enjoyed more than the original."
    },
    {
      "text": "\"Top Gun: Maverick\" pulls out all the stops to make this moviegoing experience an absolute spectacle."
    },
    {
      "text": "Armed with a squadron of F-18s, compact digital cameras, and a wild disregard for Tom Cruise’s personal safety, Maverick’s aerial sequences are the most spectacular ever filmed."
    },
    {
      "text": "bears some residual traces of its predecessor, but it also shines in its own right, bringing to its title character a surprisingly effective sense of gravitas and emotional endurance"
    },
    {
      "text": "Joe Kosinski matches his well-established architectural precision with suitably nostalgic but never pandering emotionality, while Cruise commands the screen in a performance that leverages his multimillion-dollar star wattage to brighten the entire film."
    },
    {
      "text": "It's wild what a plot can do. Where Top Gun succeeded on vibes alone, Maverick understands that the reason for getting all these characters together needs enough substance to sustain our interest in them as people."
    },
    {
      "text": "Top Gun Maverick is cinematic in every way. It’s a gift to traditional filmmaking and meant for the biggest screen possible. One of Tom Cruise's strongest films."
    },
    {
      "text": "An impressive action sequel that stays away from everything other than pure escapism. And that's great!"
    },
    {
      "text": "Joseph Kosinski and his team have umbraced the plot cliché thats put face to face past and present, turning it into a narrative engine that makes take off what we could describe as the perfect blockbuster."
    },
    {
      "text": "Top Gun: Maverick is a mature blockbuster and an improvement over its predecessor."
    },
    {
      "text": "For about two thirds of its runtime Top Gun Maverick feels like a rehash of the original film. But the action pieces in the final act along with Cruise's steady leadership turn it into a breed of blockbuster we don't crome across that often nowadays."
    },
    {
      "text": "The Top Gun sequel delivers action and emotions driven by a whole lot of nostalgia."
    },
    {
      "text": "Practically a beat-for-beat remake of the original with a non-existent screenplay that has so little interest in exploring the man of its title decades later that the film may as well be set in 1987."
    },
    {
      "text": "The effects - second to Cruise - are the star of the show, but \"Top Gun: Maverick\" surprises in its quieter moments."
    },
    {
      "text": "Somehow Cruise's foray back into the danger zone will be remembered more than the original, setting a new standard in the era of reboots."
    },
    {
      "text": "Don't be fooled — it's the same glorified military recruitment video that the original was."
    },
    {
      "text": "Despite my issues, Top Gun: Maverick accomplishes what it sets out to do: deliver an expertly crafted nostalgia machine that pays tribute to its predecessor while making some notable improvements."
    },
    {
      "text": "Cheesy at times and faulted, but absolutely exhilarating and emotionally moving. A marvelous \"in theatre\" movie experience."
    },
    {
      "text": "The aerial footage is indeed the best you have ever seen up to this point. Even on a standard 2D screen, it feels like you're up there, hanging on for dear life."
    },
    {
      "text": "Top Gun plays the phoenix game by rising from the ashes in glittery form."
    },
    {
      "text": "Tom Cruise is here to save cinema. He's here to save America. And I'm here for it."
    },
    {
      "text": "Mixing excellent visuals, a strong story, great performances with the right amount of nostalgia and spectacle, Top Gun: Maverick is one of the best cinematic experiences I’ve had in a long time."
    },
    {
      "text": "If this sounds like hokum, it is. But the storytelling too reminds you of the best version of old Hollywood, broad strokes rendered with watchmaker care."
    },
    {
      "text": "The storyline is passable, acting is good, dialogue is fine, and there are some humorous moments."
    },
    {
      "text": "Don't confuse this movie with wretched remakes like 'Firestarter' and 'Point Break,' because this one is as good as the original. It has the same strengths and the same weaknesses."
    },
    {
      "text": "This is stellar. Top Gun: Maverick feels like The Irishman for blockbusters, with the criticism going much more outward than inward. If you’d like to ask Tom Cruise about his opinion on the state of studio filmmaking, here’s your answer."
    },
    {
      "text": "If you love Top Gun, you'll love Maverick."
    },
    {
      "text": "Absolutely thrilling. You truly feel like you're in the plane with Tom Cruise pulling Gs."
    },
    {
      "text": "I'm almost embarrassed to admit how much I liked this... Everything I hated about [the original], I love about this one."
    },
    {
      "text": "The film is not without its problems, but it’s a near-perfect master class in giving the people what they want."
    },
    {
      "text": "Sure, the aerial action sequences are cool, but it’s the story, a star-studded cast, and that soundtrack...that makes Maverick the stuff movies should be."
    },
    {
      "text": "With some more to it than hard-driven action, with smart, crisp writing in the right irreverent tone, and with characters of more than a single dimension, this exhilarating legacy sequel sees off a much-vaunted 1980s original that doesn't even come close"
    },
    {
      "text": "Maverick is truly one for the ages in its deliverance of a distilled summer blockbuster whose thrills are strong enough to inspire highs totally indistinguishable from narcotics. Beware, and welcome to the Danger Zone."
    },
    {
      "text": "Compared to the original, this sequel is 70% less sweaty, 85% less sexy, and 90% more tween appropriate. Top Gun: Maverick is a tale of redemption both for Maverick and for the original film."
    },
    {
      "text": "Perhaps the most admirable quality of Top Gun: Maverick is that it never pretends to be anything other than what its core audience wants it to be: a thoughtful, finely-crafted action film that will wow audiences with its sounds and images."
    },
    {
      "text": "Top Gun’s appeal is built on US exceptionalism, on competitive machismo, on bread and butter heroics. The sequel offers it polished and unreconstructed."
    },
    {
      "text": "Impressive as the practical effects are, they don’t quite make up for the film's atmospherically thin writing and an ensemble fully on autopilot."
    },
    {
      "text": "Mission Accomplished"
    },
    {
      "text": "It’s a triumph of blockbuster filmmaking, a legacy sequel done right, and one of the most exciting things you’ll find at the movies this summer."
    },
    {
      "text": "The sequel is an adrenaline-charged ball of nostalgia that manages to be fan service while building off the original to create a superior film. It’s about as close to the perfect blockbuster as you can get."
    },
    {
      "text": "The real star of Top Gun: Maverick is the dizzying aerial acrobatics, which are more than worth the price of admission for those not overly concerned about simplistic dialogue, far-fetched reconnections, and a silly plot."
    },
    {
      "text": "Tom Cruise is going to save the movies, even if it kills him."
    },
    {
      "text": "“Top Gun: Maverick” is a better movie than its predecessor. The jet-propelled flying thrills and crisp special effects are infinitely superior. This is high-gloss “Hollywood” entertainment."
    },
    {
      "text": "I hope you have the high-heart-rate alerts on your smartwatch shut off while you’re in the theater for Maverick, because you’re probably going to get a notification every ten or fifteen minutes."
    },
    {
      "text": "It was corny. it was cheesy. It was emotional. It was exciting."
    },
    {
      "text": "A testosterone-heavy entertainment payload...the film succeeds by sticking closely to the formula of its 1986 predecessor, bringing viewers a product that is beautifully polished in its design and blissfully unsophisticated in its worldview."
    },
    {
      "text": "The only flaw is that it isn't 7 hours longer."
    },
    {
      "text": "Top Gun: Maverick is such a perfect piece of formula filmmaking it’s impossible to dislike."
    },
    {
      "text": "Top Gun: Maverick is the perfect American blockbuster. It plays like as much a legacy sequel to the 1986 film as to 40 years of Tom Cruise movies, with the best of what we’ve come to expect from Hollywood’s most consistent star accounted for."
    },
    {
      "text": "Cruise truly believes he can save movie theaters. If he keeps making movies like Top Gun: Maverick, that may not be absurd."
    },
    {
      "text": "The spectacular aerial maneuvers of the third act are breathtaking."
    },
    {
      "text": "A stand-alone classic-- the layered emotional elements added depth and texture to the familiar, beloved characters while paving the way for the next generation"
    },
    {
      "text": "With better acting, more emotion, and subtle humor that actually lands, Top Gun: Maverick is a huge improvement over the original film. But the constant need to fly the same flight pattern as the 1986 film is more of a restraint than a fond recollection."
    },
    {
      "text": "Under the wildly sincere dedication of star Tom Cruise, Maverick trails a vibrant path in blockbuster cinema."
    },
    {
      "text": "It is a movie movie in the best sense of those words. It has good acting, good storyline, good cinematography, etc. It may have been 36 years since the original; but a couple of generations have been waiting for this & they won't be disappointed."
    },
    {
      "text": "After the airless thrills of recent superhero films, Top Gun: Maverick is like a lungful of oxygen, but it has soul to go with its spectacle."
    },
    {
      "text": "All the visuals glisten, are well composed, perfectly lit and many are bigger than life due to cinematographer Claudio Miranda’s (Life of Pi) penchant for closeups."
    },
    {
      "text": "This flawed yet irresistible exercise in big-screen nostalgia works hard to keep us entertained."
    },
    {
      "text": "Top Gun: Maverick makes up for the near four-decade wait with stunning aerial performances and one-liners so cheesy you have to love them."
    },
    {
      "text": "With virtually every shot awash in nostalgia, the movie brings such a glut of adrenaline that most fans won't notice how terrible the script is."
    },
    {
      "text": "It has just the right amount of nostalgia, drama and nail biting action to make it worthy of theatrical viewing."
    },
    {
      "text": "To paraphrase Maverick: Don't think!\n\nJust watch."
    },
    {
      "text": "With the element of surprise and wonderment missing the second time round, Top Gun: Maverick settles for a greatest hits approach with a few new tracks thrown in."
    },
    {
      "text": "What director Joseph Kosinski has done here is no easy feat. He's managed to take the good of the original film and elevate the story and special effects to new heights. \"Top Gun: Maverick\" is one of the best films of the year!"
    },
    {
      "text": "Top Gun: Maverick proves the formula still works, if you have a bright enough star, one who refuses to accept new realities, and will die proving it."
    },
    {
      "text": "They played that nostalgia card really well...It still felt new and fresh, it felt like its own thing."
    },
    {
      "text": "Surpasses the original...it moved me in ways I was not anticipating."
    },
    {
      "text": "This sequel is a marvelous labor of love that doesn’t tread any new, unpredictable ground with its story."
    },
    {
      "text": "I wouldn’t have thought that we needed another trip into the danger zone, but this film definitely took my breath away."
    },
    {
      "text": "It's frankly better than we should have ever hoped for from any action movie summer tentpole in the misbegotten 2020s."
    },
    {
      "text": "A quintessential summer blockbuster from the days of yore, it does nothing to reinvent the genre, but does prove it's still alive. Tom Cruise is problematic but a dang movie star. Knowledge of the original not required, but definitely recommended."
    },
    {
      "text": "To fans that fall into the nostalgia trap (knowingly or otherwise) or others who are here just for some truly spectacular aerial stunts (they are genuinely awesome), the storytelling shortcomings of Top Gun: Maverick probably won’t matter."
    },
    {
      "text": "In matters of the soul, this [film] is Tom Cruise's Mad Max: Fury Road (2005). [Full review in Spanish]"
    },
    {
      "text": "Top Gun: Maverick absolutely lives up to its predecessor, Tony Scott’s streamlined blockbuster/machine from 1986."
    },
    {
      "text": "Cruise is lucky he’s still got pull as his supporting cast nearly outshines him in every scene they share."
    },
    {
      "text": "After the grand flying sequences and explosive finale, the only victory Maverick's won is the faith and love of the people in his life. And that's, all in all, enough."
    },
    {
      "text": "A definitive, and enthralling piece of cinema that transcends into an experience."
    },
    {
      "text": "It’s a fast-paced, heady bit of craziness, both on the ground and in the sky, and a worthy addition to the Top Gun name."
    },
    {
      "text": "A good two-thirds of Top Gun: Maverick is very solid, if unremarkable, but what really gets it off the ground are its top-drawer flight sequences, staged thrillingly by director Joseph Kosinski."
    },
    {
      "text": "Once again, Tom Cruise feels like a fish in the water – or like a bird in mid-flight, if the term fits. [Full review in Spanish]"
    },
    {
      "text": "A master class in tension and suspense; an exemplary action film that knows what people enjoyed from the first movie, and knows how to use the language of cinema to give audiences an experience that MUST be seen on the big screen. Full review in Spanish."
    },
    {
      "text": "It’s the action that sells the popcorn, and this film really delivers on that front, especially when it’s time to put the impossible bombing raid into play."
    },
    {
      "text": "The dialogue is sharper, the plot is more gripping, and the vastly improved aerial stunts really do take your breath away."
    },
    {
      "text": "Top Gun: Maverick is the total package of what a blockbuster movie should be."
    },
    {
      "text": "Spectacular spectacle, with chills and thrills running throughout the body whole. Crying on cue is just part of the ride."
    },
    {
      "text": "Unlike its forerunner, which was firmly focused on restless youth, “Top Gun: Maverick” reminds us that life goes on after the final credits."
    },
    {
      "text": "Old relics assemble! A superbly thrilling, witty and crowd-pleasing modern blockbuster, well worth the 36-year wait."
    },
    {
      "text": "A vast improvement over the vapid original."
    },
    {
      "text": "Top Gun: Maverick is better than the original, one of the best sequels I’ve ever seen and, quite simply, one of the best action movies ever."
    },
    {
      "text": "There will be enormous replay value in Top Gun: Maverick, a film one senses will rank among not just the best sequels or legacyquels, but perhaps one of the finest populist American pictures of the decade."
    },
    {
      "text": "...one of the rare sequels that improves upon every single flaw the original had, and more than exceeds expectations in the process."
    },
    {
      "text": "A meta monument to the myth of Tom Cruise, the best action blockbuster since Mission Impossible Fallout."
    },
    {
      "text": "Leaves behind any sticky realities of the modern era and attempts to capsulize the romanticism so characteristic of 80s blockbuster cinema ... The meat of Top Gun: Maverick is a juicy, adrenaline-pumping good time."
    },
    {
      "text": "Top Gun: Maverick is the kind of film that will make you cheer in theaters, but it should also withstand the test of time, just as Top Gun has."
    },
    {
      "text": "Under the thrill of genuine stuntwork and the pleasure of being able to relax into a story we already know, audiences won’t mind that the film’s sensations are only based on what used to get us off."
    },
    {
      "text": "The tag-teamed script — where, I’m guessing, Cruise’s go-to screenwriter Christopher McQuarrie had a big influence — deepens Maverick’s emotional stakes, and those of the other pilots, in ways the first movie never could."
    },
    {
      "text": "Top Gun: Maverick is exactly what audiences want when it comes to a theater movie"
    },
    {
      "text": "Following up a movie so iconic to audiences with a sequel that is, in many ways, better than the original is no small feat."
    },
    {
      "text": "There’s a sharper movie trapped somewhere inside the thrill of the spectacle; one that actually engages with the supporting cast and one that explores how Maverick's unchanging nature may be something to critique and evaluate rather than blindly yield to."
    },
    {
      "text": "An eye-popping blockbuster that, for all its daft macho contrivances, still manages to take your breath away, dammit."
    },
    {
      "text": "A somehow-superior sequel to a classic film without feeling indebted to calling back every moment, Top Gun: Maverick manages to be a profound addition to its predecessor while also being a tremendous film in its own right."
    },
    {
      "text": "Top Gun: Maverick is better than its predecessor. From the rumble of the jet engines, to the amazing cockpit and fighter aircraft scenes, if you don’t see this film in an IMAX theater, you are doing yourself and the film a huge disservice"
    },
    {
      "text": "These are simple pleasures, yes, but in the moment they also feel like rarities. There might be no movie star better equipped to revitalize them than Cruise."
    },
    {
      "text": "Credit Tom Cruise's convincing performance for evoking genuine emotional involvement and -at his insistence - there are no green screen or CGI aerial shots - resulting in a kinetic sequel that excels the original."
    },
    {
      "text": "Tom Cruise's return to the danger zone will take your breath away. Family and friendship. Bravado and bond. Heroism and sacrifice. Tremendously thrilling with nostalgic poignancy, it's the ultimate love note to aviation and unifying, soaring blockbuster."
    },
    {
      "text": "With its melancholy regret and bittersweet nostalgia, this is far superior to the 1986 blockbuster. But as the sun goes down on American imperialism here, the last-gasp celebration of it unsettles."
    },
    {
      "text": "Top Gun: Maverick is one of those rare breeds: a sequel that’s better than the original."
    },
    {
      "text": "Call this one: \"The Air Force Awakens\" ...and then apologize for not recognizing that 'Top Gun' is technically about NAVY Fighter Pilots."
    },
    {
      "text": "At times, exceptional. [Full Review in Spanish]"
    },
    {
      "text": "This [dogfight] is so good that, Stockholm Syndrome-like, we willingly suspend disbelief at the sheer audacity of it in favor of lapping it up and wanting more. Which we get. And then some."
    },
    {
      "text": "The first Academy Award winner of 2022 arrives with 'Top Gun: Maverick,' but it actually shows up after all is mostly said and done. That's when the inimitable Lady Gaga belts out 'Hold My Hand,' already a dead-mortal-lock Best Original Song ballad."
    },
    {
      "text": "Top-shelf popcorn entertainment buttered with genuine human drama and high-stakes action."
    },
    {
      "text": "It illustrates Cruise's showmanly sense that maybe Americans desperately want to believe in themselves again. While the latest James Bond movies fail at heroism, Cruise's action films present a credible sense of valor"
    },
    {
      "text": "\"Top Gun: Maverick\" is nostalgia for Reagan's America writ large across our collective imagination. The movie itself may not realize how much it speaks to a longing for more confident days."
    },
    {
      "text": "If you want to be treated to the aesthetic and the feel and the characterization they had in the first movie, you're absolutely getting this. Everything is there."
    },
    {
      "text": "While the new film is not as memorable, or of its moment, it’s a more coherent piece of character drawing, a more exhilarating spectacle, and, by virtue of not being made in the mid-1980s, altogether less daft."
    },
    {
      "text": "Top Gun: Maverick managing to exceed all expectations after the complicated journey it took to the big screen is a true testament to the power of simple, visceral movie magic."
    },
    {
      "text": "So while a lazy “Top Gun” sequel coasting on the fumes of nostalgia was ripe for the picking, everyone involved actually put forth the effort to deliver a spectacularly entertaining film."
    },
    {
      "text": "As a stand-alone blockbuster that’s just trying to suck viewers’ eyeballs out of their sockets with hellacious flight photography and thunderous sound, Maverick is just what every cineplex in the country has been crying out for."
    },
    {
      "text": "Goes with popcorn like butter... I liked it in spite of myself."
    },
    {
      "text": "Director Kosinski and company ratchet up genuine suspense in some sequences. We also get good acting, some decent banter, and plenty of speed."
    },
    {
      "text": "Tom Cruise returns to the air to do what he knows best: move us and make us vibrate in our seats.\n[Full review in Spanish]"
    },
    {
      "text": "Even as you see all the plot twists coming, Tom Cruise's charms and the spectacular aerial action still take your breath away."
    },
    {
      "text": "The jet-fueled sequel to the 1986 flyboy classic has charisma to burn, soaring airplane indulgences and a narrative that honors the past while breaking the sound barrier as it shifts to the future."
    },
    {
      "text": "Top Gun: Maverick is a perfectly tolerable time-killer, and I enjoy popcorn as much as anyone, but I just hope these won’t be the only kinds of movies that bring audiences back to the theaters."
    },
    {
      "text": "A big, brash and brawny movie jam packed full of the excitement and charisma fans have been waiting for."
    },
    {
      "text": "There was no doubt that the film made us swirly, giddy, tippy-toed..."
    },
    {
      "text": "Not that what it offers is in anyway stuck in an era gone by - the film flies confidently and sturdily to deliver a crackling good mainstream movie experience."
    },
    {
      "text": "The actor's daredevil persona is still intact, and he has just enough charm to keep the routine from getting old."
    },
    {
      "text": "I’m happy to report it was worth the wait. Maverick can be my movie wingman any time."
    },
    {
      "text": "Did I say the flight sequences are awesome? They are."
    },
    {
      "text": "... The fact that the script doesn't even cite the enemy country gives [you] an idea of how bland the story really is. So there are no problems with anyone for the release. [Full review in Spanish]"
    },
    {
      "text": "Tom Cruise continues to defy the odds, soaring above the laws of age and gravity. He feels the need for speed and delivers something to cheer about."
    },
    {
      "text": "Kosinski’s dogfights are pristine, incredible feats of filmmaking, economical and orbiting around recognizable space, but given to occasional, inexplicable shocks of pure chaos."
    },
    {
      "text": "Movie escapism at its most potent."
    },
    {
      "text": "I haven't been this entertained in years! This film is a Perfect 10/10"
    },
    {
      "text": "During the biggest, boldest moments - and there are plenty of them - Maverick “takes it right into the Danger Zone,” and yes, this film will “take your breath away.”"
    },
    {
      "text": "Earnest, emotional, and exhilarating, TOP GUN: MAVERICK is a master class in how to craft a legacy sequel."
    },
    {
      "text": "Cruise infuses the inevitable barrage of macho posturing and adrenaline-fueled set pieces with an underlying poignancy as he explores the emotional vulnerability of a title character coming to terms with his past."
    },
    {
      "text": "It's nothing if not formulaic, and at times the script is cheesier than a croque monsieur. But the action scenes are splendid, and Cruise, at almost 60 but as willing as ever to whip his shirt off, looks predictably great."
    },
    {
      "text": "\"...131 minutes of fan service where the fan isn’t truly served until the last 30.\""
    },
    {
      "text": "Top Gun: Maverick is everything you want out of a sequel and so much more and feels familiar yet fresh, like coming back home after a long vacation."
    },
    {
      "text": "This is basically just escapist authoritarian porn for white dads. If it were a sports movie, the 60-year-old coach of the football team would be called out of retirement to quarterback the Super Bowl."
    },
    {
      "text": "It's propulsive and spellbinding, even as you see every plot point coming at you as plainly as if it was on a radar screen."
    },
    {
      "text": "While it doesn’t skimp on the high-flying action sequences that made the first film a hit, it goes it one better by focusing on the obvious: Pete “Maverick” Mitchell is a lot older."
    },
    {
      "text": "Like the most recent Mission: Impossible sequels, this is another eye-popping action film that serves as subtext for Tom Cruise’s race against mortality to prove his superhuman excellence – all for our own amusement."
    },
    {
      "text": "It's a thrill ride like no other and zooms past the original with ease. I loved everything about this film and think you will too."
    },
    {
      "text": "I might be overstating this, but Top Gun: Maverick is about as perfect a sequel as you can get."
    },
    {
      "text": "What <i>Top Gun: Maverick</i> asks, then, is this: 'What would <i>Top Gun</i> look like if it were, y’know, a good movie?'"
    },
    {
      "text": "The sequel is still  rah-rah about American imperialism, but who cares? Thirty-six years after the original, Tom Cruise is having the time of his life, the in-flight thrills are off the charts and—hot damn!—you won’t find more blazing action anywhere."
    },
    {
      "text": "Top Gun: Maverick may not be the ideal sequel to Top Gun. However, given the events of the last few years, it may be the one we need."
    },
    {
      "text": "It's not even the weekend yet, and \"Top Gun: Maverick\" is already taking off."
    },
    {
      "text": "Tom Cruise was put on Earth to entertain by any means necessary, and he does so like no one else."
    },
    {
      "text": "'Top Gun Maverick' is a one hell of a ride that shouldn't be missed. So hop on and buckle up fast!"
    },
    {
      "text": "Some of this movie is fun, but too much of it is overly slick, and a lot of it feels dated, far too close to the aesthetics of the original. Still, its incredible aerial photography is breathtaking throughout and probably worth the price of admission."
    },
    {
      "text": "What the new Top Gun movie does well to depict though is the TOPGUN stuff. Not only do [Joseph] Kosinski and Co. have a grip on the action and how it's put together, there's an undercurrent of tension at the root of everything on Top Gun: Maverick."
    },
    {
      "text": "Tom Cruise soars while schooling a cocky squad in the action-packed, shamelessly sentimental \"Top Gun: Maverick.\""
    },
    {
      "text": "It delivers the spectacle and thrills it promises, deftly mixing unapologetic nostalgia & stimulating action that satisfies fans of the original and wins new ones. Those crazy flying sequences gave me such an adrenaline rush, what a cinematic thrill ride!"
    },
    {
      "text": "Top Gun: Maverick is Tom Cruise in auteur-mode, for better or worse. Mostly for the better. Only someone of his intensity could make an action movie this intense, seemingly through sheer willpower."
    },
    {
      "text": "Top Gun: Maverick isn’t a great film, but it does entertain greatly as old fashioned fun."
    },
    {
      "text": "If you are a fan of the original, break out your checklist and tick off all the “homage” to that ’86 flick. There are many and the whole package is entertainment in spades."
    },
    {
      "text": "I love Top Gun. Top Gun: Maverick is even better."
    },
    {
      "text": "Works like popped corn. The challenge was to create a whole new atmosphere, while evoking the feeling of the beloved first film … an assignment almost as impossible as the story's flight mission … but dang it, they pulled it off with excitement to spare."
    },
    {
      "text": "[It] joins that small list of recent sequels made many years removed from their predecessors that are as good—if not better—than the originals...an experience that completely surpassed expectations, and even surprised me on a few different levels."
    },
    {
      "text": "Top Gun: Maverick is a warm hug of a fighter jet, Tom Cruise action movie nostalgia. Familiar and new, fun and captivating."
    },
    {
      "text": "Top Gun and Tom Cruise are right on time with thrills, chills, nostalgia, a reunion that will make your heart melt and its just plain fantabulous!!  Tom Cruise is a mega movie star...period and the fighter jet sequences will leave you breathless"
    },
    {
      "text": "The long-gestating sequel “Top Gun: Maverick” has finally arrived and, happily, these Navy pilots nearly reach mach 10."
    },
    {
      "text": "Director Joseph Kosinski applies his mastery of practical and digital effects to craft aerial action sequences as beautiful as they are tense"
    },
    {
      "text": "Top Gun: Maverick is not a dislikable movie, by any means... But it's also a little depressing, because of where it says movies are going, what it says about the lack of creativity making its way on screen."
    },
    {
      "text": "Top Gun: Maverick hits the mark, maybe because neither the filmmakers nor the actors are flying on auto-pilot."
    },
    {
      "text": "At its heart, it's really a story about how jets are cool and fast."
    },
    {
      "text": "\"Maverick\" satisfies by delivering exactly what it promises."
    },
    {
      "text": "Arguably, the greatest achievement of the summer's biggest blockbuster is not the stunning action sequences, but the fact that Tom Cruise's star is brighter on landing than it was before take-off."
    },
    {
      "text": "In the end, Maverick succeeds more often than it fails, proving absorbing enough for most of its length."
    },
    {
      "text": "Top Gun: Maverick... is a revivified mummy with a jet thruster strapped to its bandages, taking great pains to repeat all of the 1986 version's beats at maximum velocity. A mummy with a jet pack is, however, a fantastic thing."
    },
    {
      "text": "Ultimately, it’s a good, old-fashioned blockbuster. Grab the popcorn. Sink down in your seat and immerse yourself."
    },
    {
      "text": "While there are soap opera elements, the screenplay is playful, laced with good humor, effectively builds tension and finds the emotional beats...Most memorable is a touching, affectionate nod to Val Kilmer as Admiral Thomas “Iceman” Kazansky."
    },
    {
      "text": "Thankfully, the story is just as engrossing on the ground as it is in the air, and Cruise gets the chance to do some vulnerable acting when he’s on land."
    },
    {
      "text": "The flight scenes are the major draw, I suppose, and the aerial encounters are dazzlingly choreographed even if the planes are so loud you can’t hear the pilots’ dialogue. That said, you don’t watch a film like this for the script."
    },
    {
      "text": "The triumphalism powering those bone-rattling engines still comes through loudly and clearly enough to send you cross-eyed and set your cinema seat vibrating."
    },
    {
      "text": "The movie we didn't know we needed. [Full review in Spanish]"
    },
    {
      "text": "This is old-fashioned summer popcorn movie fun in all its high-octane glory. And Cruise is just the leading man for the mission."
    },
    {
      "text": "Despite its suffocating adherence to nostalgia, there are many impressive elements to Top Gun: Maverick."
    },
    {
      "text": "Deals with the trauma of having lost \"Goose\", his training partner and co-pilot, in a more human and real way... this sequel doesn't register as a commercial foil dictated by a film industry that only bets on pre-sold properties. [Full review in Spanish]"
    },
    {
      "text": "Physical cinema, slightly vulgar, and very enjoyable…in theaters. \n[Full review in Spanish]"
    },
    {
      "text": "It is a thin, over-strenuous and sometimes very enjoyable movie. But it is also, and perhaps more significantly, an earnest statement of the thesis that movies can and should be great."
    },
    {
      "text": "One of the best legacy sequels we’ve ever gotten: a movie that knows how to move along and give you what you came for."
    },
    {
      "text": "Cruise’s star wattage remains undimmed, but while “Maverick” has been cannily manufactured...its familiar “Top Gun” mixture of jingoistic claptrap, macho posturing and formulaic excitement feels as mechanical as its military hardware."
    },
    {
      "text": "I enjoyed it, and you might, too — if you don’t think, just watch."
    },
    {
      "text": "The sheer will with which the movie strives to be a nostalgia machine for a world that never was, for the coke-dream of the 1980s that the original coughed up, is so relentless that hey, as long as you don't think about it it's fine"
    },
    {
      "text": "SFX are mostly practical (made in the sky, not in a garage) and the aerial stunts look more impressive than ever, but the biggest draw is seeing the determined star doing what he knows how to do best... [Full review in Spanish]"
    },
    {
      "text": "I’ll just say it — it’s better than the original “Top Gun.”"
    },
    {
      "text": "This is how you make a heroic movie."
    },
    {
      "text": "The film propels itself forward furiously, hitting Mach speeds higher than ever thought possible, but that doesn’t mean it doesn’t occasionally look over its shoulder at what it’s left behind."
    },
    {
      "text": "Easily out maneuvers its predecessor — which isn’t saying much."
    },
    {
      "text": "Like the original, even this one’s about fast bikes, dark aviators, supersonic planes and sweaty, muscular men with grease on their arms, a spanner in their palms, pushing the limits of male bravado."
    },
    {
      "text": "Top Gun: Maverick is a sequel that plays it safe with the story, but lets it rip in the blockbuster action sequences, giving the audience the expected need for speed."
    },
    {
      "text": "As a glossy, fast-moving fantasy this hits all the right notes, serving up cliches with a smile and fan service with a wink while still delivering plenty of thrills."
    },
    {
      "text": "Almost everything about Top Gun: Maverick is ridiculous – except Tom Cruise’s commitment to delivering a proper big screen action movie experience."
    },
    {
      "text": "No wheels are reinvented (though one pair does get sheared off a plane’s landing gear by a barely cleared mountain), but the dialogue charms, the aerial sequences soar, and the two hours and 17 minutes of runtime speed by at (forgive me) Mach 10."
    },
    {
      "text": "Name recognition and nostalgia may be what will initially draw audiences to Top Gun: Maverick, but they’ll leave loving it because of how it builds on the foundation and brings new ideas to the table."
    },
    {
      "text": "After a two-year delay, Top Gun: Maverick is well worth the wait. Entertaining and nostalgic as hell, the aerial fights are among the most exciting and exhilarating scenes experienced in the cinema this year. Strap in – it’s a hell of a ride."
    },
    {
      "text": "It’s hard to picture another entry in the summer movie sweepstakes that can equal or exceed this one for pure, adrenalin-fueled entertainment. I had a great time watching the film and recommend seeing it as I did, on a giant IMAX screen"
    },
    {
      "text": "“Top Gun: Maverick” soars above the original every step of the way!"
    },
    {
      "text": "There is no greater argument FOR the continued existence of movie theaters than \"Top Gun: Maverick,\" the sort of theatrical experience that simply will never - EVER - be matched at home."
    },
    {
      "text": "The action in TOP GUN: MAVERICK is so intense, at times I literally felt ill --- but in a good way. It’s a wild ride all the way through the film with just enough down time to prevent a serious case of hyperventilation."
    },
    {
      "text": "TOP GUN: MAVERICK is as exciting as any movie in recent \nmemory. Edge-of-your-seat excitement is an overused cliché, but it fits perfectly here."
    },
    {
      "text": "This is ruthlessly proficient entertainment filmmaking, and any human plunked into a theater will be powerless against it."
    },
    {
      "text": "Top Gun: Maverick is a triumph, designed to capitalise on the love audiences have for the iconic original, but also with plenty for non-fans or complete newcomers to also enjoy."
    },
    {
      "text": "You don't have to have dad energy to embrace this movie. It's awesomely old fashioned and impressively modern at the same time. Fists will pump, eyes will mist."
    },
    {
      "text": "I loved Top Gun: Maverick. This sequel hasn’t lost that loving feeling. It’s the best of the best, making this return flight to the danger zone a rapturous aerial extravaganza that frankly took my breath away."
    },
    {
      "text": "[T]he spectacle on display is genuinely, well, spectacular."
    },
    {
      "text": "A film you’ll be best served believing its near-impossible hype, Top Gun: Maverick is not only the type of sequel that surpasses its predecessor in every form imaginable, it’s the perfect encompassment of why cinema matters."
    },
    {
      "text": "... flies higher than the 1986 original. [Full review in Spanish]"
    },
    {
      "text": "Top Gun: Maverick is like a frat boy who finally grew up. This is how you make a sequel!"
    },
    {
      "text": "The film is about how a guy well past middle age can still kick ass, and this is a message that Cruise wants to deliver as loudly as Pete \"Maverick\" Mitchell. Message received. I just wish it had been in a better movie."
    },
    {
      "text": "The airborne sequences are a marvel of technical achievement. Top Gun: Maverick markets on your nostalgia, but doesn't rely on it."
    },
    {
      "text": "Maverick is more about soul finding than chest beating; while there’s some of the latter, it’s reserved mostly for the new young guns."
    },
    {
      "text": "Top Gun is a legacy act, still popular, still influential and still able to blow the roof off when needed, and Maverick is the late career stadium tour that some -- not all -- legacy acts deserve."
    },
    {
      "text": "This is the rare action movie that delivers visual kicks without leaning on cartoonish digital crutches."
    },
    {
      "text": "Frat boy swagger never soared as high or fast as it does in this attempt by Tom Cruise to outpace time itself."
    },
    {
      "text": "The planes, the pilots, and their need for real speed is what makes a Top Gun movie special, and the filmmakers deliver in almost every possible way."
    },
    {
      "text": "All in all, I have to hand it to Cruise, director Joseph Kosinksi, and all the folks behind Top Gun: Maverick. They channeled ’80s nostalgia into a clever, exciting, and fun package that reminds us why we loved those cheesy movies to begin with."
    },
    {
      "text": "The sequel to the iconic 1980s flyboy flick is, as they say, “go for takeoff.”"
    },
    {
      "text": "... If for Maverick: \"it's not the plane, it's the pilot\", in the case of Top Gun, it's not the movie, it's the actor. [Full review in Spanish]"
    },
    {
      "text": "This is a militaristic epic so disassociated from actual life that it somehow becomes even more fanciful than the average animated family film."
    },
    {
      "text": "Tom Cruise is the living manifestation of the Hollywood blockbuster — and he has made the ultimate legacy sequel his next mission."
    },
    {
      "text": "With military precision, Top Gun: Maverick is designed to please audiences and never challenge them."
    },
    {
      "text": "Cruise flourishes in exceedingly beautiful light. He’s Benjamin Button in a tailored motorcycle jacket. The light on everyone’s faces, especially in shots with multiple layers, is ravishing, particularly in lowest light."
    },
    {
      "text": "Top Gun: Maverick is an expertly paced testament to the power of practical effects. Cruise’s tireless devotion to blockbuster filmmaking bleeds through the screen in every scene, a modern cinematic marvel."
    },
    {
      "text": "Is there a lot of formula(s)? Yes, it is 80's cinema in all its glory. It's a movie without major audacity, conceived with sensitivity and nobility by people who know and love what they do. [Full review in Spanish]"
    },
    {
      "text": "A soaring movie if not a particularly self-aware one. But is that what you were expecting from a sequel to “Top Gun”?"
    },
    {
      "text": "The blockbuster you're going to want to see.\n[Full review in Spanish]"
    },
    {
      "text": "The original was a mood piece. This is an actual movie, emphasizing remorse and regret over cockiness and easily outdoing its predecessor with action set-pieces that render indistinguishable the line between real derring-do and digital embellishment."
    },
    {
      "text": "Top Gun: Maverick is a full-throttle, action-packed nostalgia machine that delivers the supersonic thrills we all have been clamoring for."
    },
    {
      "text": "The sophomoric dialogue and story will never win an Oscar, but they were never meant to. What’s important is how deep an impression your fingernails end up leaving on the theatre-seat armrest."
    },
    {
      "text": "It’s an action masterpiece led by a true master of his craft. Top Gun: Maverick takes cinema to new heights."
    },
    {
      "text": "Jettison any doubts about the yawning gap between films: the sequel is a complete triumph, a high-octane fist-pumper that introduces weighty notes of regret."
    },
    {
      "text": "More than a nostalgia sequel or legacyquel; it is almost more than a movie. It is a manifesto and a monument, a defiant time capsule and a swaggering IMAX spectacle without precedent or peer."
    },
    {
      "text": "Not only does Top Gun: Maverick execute that rare screen miracle of being a sequel superior to its predecessor in every way. It is also a blockbuster that will have the better of almost everything you see in 2022."
    },
    {
      "text": "Like the hyper-competent aces at the story’s core, this is a movie that defines its lane early and sticks to it, with finesse, unfussy style and more than a few sneak attacks of emotion."
    },
    {
      "text": "It definitely demands to be seen in the theater with the incredible sound design and immersive flight sequences. This is what you go to the movies for! You won't want to miss it!"
    },
    {
      "text": "Phenomenal! The perfect summer blockbuster. The action is intense & the aerial sequences are breathtaking. Tom Cruise again adds to his legend in this sequel that's superior to the original in every possible way. [Full review in Spanish]"
    },
    {
      "text": "Absolutely everything is better...though one big reason is how well the late director Tony Scott's spirit is represented throughout, with Joseph Kosinski creating a perfect combination of nostalgia and modernity. Full review in Spanish"
    },
    {
      "text": "Cruise displays a maturity as Maverick, not wanting to repeat the mistakes of his younger self. Cruise has not shed Maverick’s cockiness, but he has tempered it. (He) shows you moments in which you see the weight of Maverick’s past weigh him down. ..."
    },
    {
      "text": "The America of 'Top Gun' is the elusive greatness that we chase as a country. Perhaps it only ever existed on film. Whatever the case, it exists here."
    },
    {
      "text": "Top Gun: Maverick Cruises to the top with heart-stopping aerial acrobatics and a grounded storyline. It is off the charts adrenalin-charged and exhilarating."
    },
    {
      "text": "Not only does Maverick nail it, but it soars above and beyond its predecessor. The emotion is surprisingly impactful, as we still feel the weight of the original’s events. Cruise and Teller are in top form, and the third act is an action-packed knockout."
    },
    {
      "text": "This is a sensational film that surpasses its predecessor in almost every way."
    },
    {
      "text": "“Top Gun: Maverick” nails the landing as one of the best summer blockbusters you’ll ever see. Popcorn movies just don’t get much better or more thrilling than this."
    },
    {
      "text": "In true, rugged fashion as a legacy sequel aiming for the pinnacle of performance on and off camera, the movie exerts the very same pressure of gravity on us as we find ourselves glued to our seats with every flyby and bead of sweat."
    },
    {
      "text": "This is a Maverick movie through and through. Tom Cruise isn’t done with “Top Gun” yet, and he’s not letting go of big, emotional and deeply human blockbuster moviemaking without a fight. He’s indeed the hero that the movies need right now."
    },
    {
      "text": "An absolute crowd-pleaser. Nobody does blockbuster action better than Cruise and this raucous follow-up is presented with thought and extreme affection for the culturally iconic original."
    },
    {
      "text": "Here’s the rare big studio movie where actors and stunt people perform on location while using as little CGI as possible; a movie where Cruise puts his hand on an F18, relishing its very tactile quality in a way that is deeply felt."
    },
    {
      "text": "In a film jampacked with Hollywood’s rising stars, no one can match Cruise for charisma, magnetism, and depth of emotion. Quite simply, they don’t make them like him anymore."
    },
    {
      "text": "A big, strutting, soaring, roaring, proudly pop-corny entertainment that begs to be seen on the big screen, like the blockbuster it's gonna be."
    },
    {
      "text": "Believe the hype. Top Gun: Maverick is everything you could possibly want out of an epic summer blockbuster."
    },
    {
      "text": "Top Gun: Maverick proves to be a near-perfect legacyquel, with its adrenaline-laced dogfights grounded by a top-tier performance from Tom Cruise."
    },
    {
      "text": "Top Gun: Maverick is a sequel of a different breed."
    },
    {
      "text": "It may not take your breath away, but it comes close."
    },
    {
      "text": "“Top Gun: Maverick” is a movie-star movie with great action pieces best seen on the biggest screen available. It’s a modern take on old-fashioned fun."
    },
    {
      "text": "...Top Gun: Maverick is one of the best pictures of the year."
    },
    {
      "text": "One of the best, and loudest, blockbusters that I have ever had the pleasure of witnessing."
    },
    {
      "text": "Without wallowing in nostalgia, director Joseph Kosinski resurrects a 1980s-era relic, making the thirty-plus-year-old property relevant with thrilling aerobatic action and engaging drama. And Tom Cruise is terrific."
    },
    {
      "text": "A triumphant follow-up to one of the 1980s’ flashiest blockbusters."
    },
    {
      "text": "In the age where big-budget Hollywood tentpoles favour more superhero movies these days, Top Gun: Maverick is a testament that old-school action filmmaking still prevails and you have to hand it to Tom Cruise for making this happen."
    },
    {
      "text": "Watching Tom Cruise pick up his aviators and slip his patch-emblazoned jacket back on as Pete ‘Maverick’ Mitchell is as close as you can get to a transcendental experience at the cinema."
    },
    {
      "text": "…Top Gun: Maverick strikes a blow for the old-fashioned blockbuster, exceeding the range and grasp of the original, and giving a new generation a taste of the Boys Own heroism that made the first film a classic…"
    },
    {
      "text": "Offers something for everyone, without succumbing to the pitfalls of the genre. \n[Full review in Spanish]"
    },
    {
      "text": "In the sequel, nothing is left to chance. The camera orbits around him, his skills are unquestioned. Even Jennifer Connelly as the old flame Penny inevitably gives in with a love scene that has all the passion of a Christmas card."
    },
    {
      "text": "It may help to have hated the original, but I liked this one, even though it’s not so very different from the first."
    },
    {
      "text": "... again playing a guy who's the best at everything, drama oozes from the same character with the on-screen realization his plot armor doesn't extend around everyone else he's responsible for, and movie stardom doesn't get any more meta than that."
    },
    {
      "text": "Top Gun: Maverick soars higher than expected. It delivers thrills, fun and tender moments. A tremendous way to kick off summer blockbuster season."
    },
    {
      "text": "Prepare for more hyperbole because holy sh-t, I loved this film. It’s true, this is the best blockbuster action flick to come out of Hollywood in years."
    },
    {
      "text": "A welll-oiled cinematic machine that runs on spectacle and Tom Cruise’s charisma."
    },
    {
      "text": "A Hollywood sequel that improves upon its predecessor in every conceivable way."
    },
    {
      "text": "The summer blockbuster season is set to kick off with a (super sonic) boom with the arrival of Top Gun: Maverick, a film which builds on the legacy of Top Gun and surpasses it on every level."
    },
    {
      "text": "Top Gun: Maverick is set in a world where if you want something enough, it will happen. If you want to fly that plane at mach 10, you just have to be enough of a badass. Physics doesn’t come into it. The world is pliable, susceptible to your wishes."
    },
    {
      "text": "'Top Gun: Maverick' overachieves on every level, within a running time which flies by too quickly. Everything people are saying is true, everything others have written should be believed, because blockbusters are back."
    },
    {
      "text": "Cruise takes to the skies once again and pushes the limits of what a blockbuster can be, giving audiences a front seat in the cockpit to witness the adrenaline-pumping action first hand."
    },
    {
      "text": "Scene for scene, it’s a better time than Top Gun. More nimble, more exciting, more soulful."
    },
    {
      "text": "It’s impossible to overstate how dramatically inert Top Gun: Maverick is."
    },
    {
      "text": "From a ground-level perspective, Maverick, directed by Joseph Kosinski, is a game of two halves... It’s lucky that the flying is so plentiful and overwhelming, because the ground-based action is somewhat less dynamic."
    },
    {
      "text": "A huge triumph, one combines the right amount of reverence for the source material, homage, and fan service, with modernization, new ideas, and improvement on the original’s weaknesses."
    },
    {
      "text": "Top Gun: Maverick has all the ingredients of a perfect summer movie. A sequel full of nostalgia, emotion and adrenaline. [Full Review in Spanish]"
    },
    {
      "text": "Visceral action sequences ensue... but the absence of a challenging or interesting story, never mind a challenging or interesting performance on man of the hour Cruise’s part, are glaring omissions."
    },
    {
      "text": "Top Gun: Maverick is an event film that will remind many of why they love going to The Movies. It's as perfect a summer blockbuster as you can hope for."
    },
    {
      "text": "The plain fact is that “Top Gun: Maverick” works."
    },
    {
      "text": "A triumph in every sense of the word and a reminder of the stupendous joy blockbuster films should bring to our lives."
    },
    {
      "text": "A thrilling, catch-your-breath action blockbuster that dazzles with its weighty, daredevil aerial sequences, actual emotional stakes and a charm-laden performance from Cruise that reminds everyone why he is one of the remaining bona fide movie stars."
    },
    {
      "text": "'Maverick' is an absurdity masking several horrors, chief among them the continued indulgence of Cruise’s virile death wish, which for me nullifies any pleasure reaped from his present-day status as The Last Movie Star™."
    },
    {
      "text": "Maverick is essentially the epitome of the big screen blockbuster bringing with it all the fist-pumping adrenaline, death-defying in-camera dog-fighting and all the feels we all need and deserve from a 2022 Top Gun."
    },
    {
      "text": "While Top Gun: Maverick is an enjoyable flight of fancy, especially considering its predecessor plays like the crust of a story whose center somehow vanished, this is among the classier examples of nostalgia porn we’ve yet to see."
    },
    {
      "text": "In many ways, this is a stupidly entertaining movie. Intellectually, I suspect I really shouldn’t like this movie so much, but we all need a little more whoosh in our lives."
    },
    {
      "text": "a muscle-flexing statement of intent from Cruise's Hollywood military-industrial complex"
    },
    {
      "text": "Cruise's flight of fancy soars with blast of nostalgia, unapologetically resuscitating the past while reflecting on what's gone by. Aerial scenes are excellent, a throwback that still climbs with massive Gs. Big, fun, cinematic popcorn poetry."
    },
    {
      "text": "...pathetically pandering or deeply satisfying, depending on your relationship to the original movie."
    },
    {
      "text": "Speed is one thing. Clarity is another. “Top Gun: Maverick” has both."
    },
    {
      "text": "The film undoubtedly knows what its fans will embrace, and its successes in this regard outshine its accomplishments as art or mere blockbuster entertainment."
    },
    {
      "text": "Top Gun: Maverick is a sequel that capably manages to erase any longstanding skepticism. The film is not only a reverent love story of aviation but also represents a type of filmmaking that has nearly gone out of style."
    },
    {
      "text": "Entertaining, intense, and surprisingly rich with emotion, \"Top Gun: Maverick\" is the perfect summer movie."
    },
    {
      "text": "The protagonists discuss two miracles for a successful mission. Here’s a third; a 36-year later Top Gun sequel is a must-see, unbelievably thrilling stunner with absorbing character work. Maybe Joseph Kosinski will be Tom Cruise’s miracle worker anytime"
    },
    {
      "text": "\"Maverick\" doesn't have to do much to improve on the 1986 film, but Kosinksi makes a noticeable effort to give the brand name some sensitivity this time around, though he does much better when focused on offering viewers a thrill ride."
    },
    {
      "text": "High art? Never. Unrivaled action movie? You bet your ass."
    },
    {
      "text": "... Owes all its charm to Cruise's indelible charisma. He is the real special effect of the film. [Full review in Spanish]"
    },
    {
      "text": "When the film stops the nostalgic shenanigans, it takes flight. [Full review in Spanish]"
    },
    {
      "text": "…isn't only better than the original, it is the quintessential Tom Cruise movie,\nthe best we can expect from a movie preordained to be a summer blockbuster.  Is it perfect?  No."
    },
    {
      "text": "Overall, Top Gun: Maverick gives audiences more of what they loved in the first film without following its predecessor step by step. Top Gun: Maverick carves out a path all its own with exhilarating action and a marvelous cast."
    },
    {
      "text": "Those sequences up in the fighters are truly the kind of immersive, mind-blowing filmmaking that cinema was made for."
    },
    {
      "text": "“Top Gun: Maverick” is everything a fan could hope for. It is exciting, it is endearing, it just about blows kisses at the fans, and it is guaranteed to make many new ones."
    },
    {
      "text": "A rousing, exhilarating and crowd-pleasing spectacle."
    },
    {
      "text": "… a heart-racing and heart-breaking ride …"
    },
    {
      "text": "Excellent balance between nostalgia, the unspoken past of these last few decades, and a renewed future. \n[Full review in Spanish]"
    },
    {
      "text": "Top Gun: Maverick is an extremely enjoyable thrill ride, yet its focus on intense, immersive action doesn’t allow much room for lighter, steamier fun like its predecessor."
    },
    {
      "text": "Top Gun: Maverick feels like the first big-screen must-see film this side of the Marvel Cinematic Universe."
    },
    {
      "text": "If you’re comfortable seeing a movie theatrically, find the theater closest to you with the biggest screen, crispest sound, and prepare to have your face melted off. Top Gun: Maverick is a triumph."
    },
    {
      "text": "Tom Cruise knows exactly what his audience wants out of him as a movie star, actor, and the legacy of these characters. It sets the bar extremely high for the other big summer movies coming ahead."
    },
    {
      "text": "It's not quite as perfect as other critics have stated, but it is the decade's first summer blockbuster likely to leave you exhilarated by the end."
    },
    {
      "text": "It’s a nostalgia trip that understands that’s why you’re there but also utilizes that as its own ammunition to create something better. Not through subversion, but enhancement."
    },
    {
      "text": "Top Gun: Maverick has joined the elite — sequels that both surpass their predecessors yet pay tribute to them. Follow-ups are a regular part of our cinematic diet but now we have the game-changer we’ve been waiting for. This is how it’s done."
    },
    {
      "text": "Not only is it a sequel that marginally soars past its predecessor at Mach Speed, but is a thematically compelling and mature character study that naturally wrings a few tears out of you."
    },
    {
      "text": "Top Gun: Maverick hits its target with explosive force."
    },
    {
      "text": "It's loud, sometimes silly, often crazy. But in the end, the moral of the heart-stopping story is clear: Tom Cruise is a rootin'-tootin' hero."
    },
    {
      "text": "Tom Cruise’s tour de force offers a pulsating ride well worth the 36-year wait."
    },
    {
      "text": "Joseph Kosinski does a more-than-capable job of ensuring that Top Gun die-hards will laugh at the jokes, cry with the characters, and gasp at every skybound maneuver. But this is very much a Tom Cruise Picture, and don’t you forget it."
    },
    {
      "text": "Without Tom Cruise's say-so, this film wouldn't have got made. That's as it should be, because from start to finish he dominates this amiably silly, winningly nostalgic action romp, filling a huge canvas with his formidable star power."
    },
    {
      "text": "Essentially, this franchise has lost that loving feeling. And with it gone (gone, gone), so too is a bit of the thrill."
    },
    {
      "text": "\"Maverick\" is the perfect wingman to \"Top Gun\" and a more than worthy successor to a classic. It flies so high it soars."
    },
    {
      "text": "Top Gun: Maverick hits all the highlights and then some: Micky-mouse-eared deck-hands doing cat-shot dance moves; warplanes screaming off carrier decks; arrogant stick jockeys; beach volleyball; flat spins; and dogfight mayhem in the skies. Outstanding!"
    },
    {
      "text": "Plays it safe.\n[Full review in Spanish]"
    },
    {
      "text": "An implausible and forgettable retread of the original 1986 Top Gun."
    },
    {
      "text": "Maverick is both the perfect summer blockbuster and a masterclass in crowd-pleasing moviemaking. It’s the kind of edge-of-your-seat, fist-pumping, adrenaline rush of a spectacle that will gratify every one of your brain’s pleasure centres."
    },
    {
      "text": "A summer spectacular that proves that there’s still life left in the old ways, all while stoking, and satisfying, that familiar need for speed."
    },
    {
      "text": "You’ll laugh, you’ll cry, you’ll gasp and your heart will race."
    },
    {
      "text": "I felt like i was in a jet in the air. It feels so much more visceral, so much faster, so much more dangerous."
    },
    {
      "text": "Tom Cruise revisits his eighties glory in a spectacular sequel. Top Gun: Maverick tells a thrilling new story while capturing the jet-fueled spirit of the classic original. The film boldly embraces practical visual effects in an era defined by CGI."
    },
    {
      "text": "Top Gun: Maverick is an uninspired, outdated retread of 1986’s Top Gun, but with more implausible scenarios and with no women in military leadership positions ... Top Gun: Maverick, just like its main character, is stuck in a rut of reliving past glories."
    },
    {
      "text": "Top Gun: Maverick is a blistering piece of pop art, an all-timer Dad movie stealth masterpiece, and maybe the ultimate legacy sequel."
    },
    {
      "text": "I folded my arms and prepared for the worst. Two hours later, I was scribbling down words like “Whoa!”, “Exciting!” and “Bullseye!!”"
    },
    {
      "text": "A much better film than its predecessor was, and much better than it needs to be overall."
    },
    {
      "text": "Tom Cruise has given us all a proud, defiant Dad Movie for men in their 50s. It's a reasonably effective action movie with reasonably exciting dogfights that sends you home going, \"Well, that was exactly what I expected.\""
    },
    {
      "text": "With music by Lady Gaga and Hans Zimmer, action scenes tailor-made for hulking IMAX screens, and Cruise flaunting it in a white naval uniform, it’s Top Gun dialled up to Mach 10."
    },
    {
      "text": "The conflict between two pilots remains intact, and the veterans who teach Cruise secrets about life and responsibility return... [Full review in Spanish]"
    },
    {
      "text": "The best legacy sequel to a single movie. One still can debate Creed, Cobra Kai or The Force Awakens, but each had entire franchises upon which to draw."
    },
    {
      "text": "Maverick is not the type of movie you wait around for until it’s on cable: It’s an adrenaline-pumping event worth getting off the La-Z-Boy to experience."
    },
    {
      "text": "It makes the act of being a good movie look like the easiest thing in the world, with director Joseph Kosinski showing off everything he's got."
    },
    {
      "text": "See it on the biggest screen possible. Then see it again."
    },
    {
      "text": "This is a worthy, often exemplary follow-up to the 1986 classic. It’s everything a summer movie should be."
    },
    {
      "text": "Somehow, \"Maverick\" manages to recycle those latter beats -- with an exceptionally well cast class of new pilots -- and still feel contemporary, all while approximating the old-fashioned virtues of the kind of movies that flourished in the '80s ."
    },
    {
      "text": "Satisfying sequel hits nearly all the marks while outdoing the original."
    },
    {
      "text": "More grown-up, more generous, and more lighthearted."
    },
    {
      "text": "Top Gun 2 reboots the original film's heart-pounding aerial action, infectiously cheesy character drama and don't-think-too-hard-about-it military fetishism in a winning spectacle of cinematic escapism."
    },
    {
      "text": "Tom Cruise's 'Top Gun: Maverick' is an audio/visual treat and generally well-made summer blockbuster even as it becomes a 'Rise Of Skywalker'-style nostalgic ode to itself."
    },
    {
      "text": "Overall, a stunning piece of filmmaking and the perfect summer blockbuster for Memorial Day Weekend. Cruise, Kosinski & McQuarrie manage to recreate the feel of the original film while also updating it with a very modern - and thrilling - third act."
    },
    {
      "text": "A breathless, gravity and logic-defying sequel."
    },
    {
      "text": "From beginning to end, there was nothing that happened that I could not anticipate, either in the flow of storytelling or from the idea of the movie I had before I sat down in a movie theater."
    },
    {
      "text": "Like its eponymous ace, it’s a dying breed, but there’s no way it’s going out in gasps or sputters. Not while Tom Cruise still draws breath."
    },
    {
      "text": "“Top Gun: Maverick,” a film that, thanks to advances in modern technology, outstrips its predecessor in nearly every capacity. The dogfights are breathtaking, the action sequences ungodly, and the need for speed is more urgent than ever."
    },
    {
      "text": "The ultimate Gen X Dad fantasy, in which a 50-something gets to outsmart and outperform the younger generation’s best and brightest."
    },
    {
      "text": "Top Gun: Maverick is the definition of an exciting summer blockbuster."
    },
    {
      "text": "Is 'Top Gun: Maverick' the movie that will mark a generation? No. Its predecessor will always hold that title. Is it a fun Hollywood film? Absolutely. Does it have substance? Not really."
    },
    {
      "text": "Top Gun: Maverick is pure movie magic that accomplishes the rare feat of improving upon the original."
    },
    {
      "text": "A textbook example of how to make a sequel."
    },
    {
      "text": "If this doesn't bring people back to theaters, nothing will."
    },
    {
      "text": "Welcome back to the Military Industrial Oedipal Complex."
    },
    {
      "text": "This cinematic spectacle starts by paying homage to the original movie — with the notes of the “Top Gun Anthem” — and it never stops. If you liked Top Gun, you’ll enjoy Top Gun: Maverick thoroughly. All the ingredients of the original movie are there."
    },
    {
      "text": "What's not to love about a one of the greatest movie stars of all time refusing to be grounded and, instead, fully embracing the effects-driven era as his own? (Maybe the rotten script, but still)"
    },
    {
      "text": "Teller and Powell are breezily appealing, actors at the apex of their youth and beauty, though the movie still belongs in almost every scene to Cruise."
    },
    {
      "text": "Kosinski and co deliver all the Top Gun feels and then some: slick visuals, crew camaraderie, thrilling aerial action, a surprising emotional wallop and, in Tom Cruise, a magnetic movie-star performance as comforting as an old leather jacket."
    },
    {
      "text": "It’s a fresh-faced gloss on the original... powered, like the original, by a star who’ll simply never stop being a star."
    },
    {
      "text": "Now I want to see [Cruise] take on a sequel to Risky Business and do the underpants dance again."
    },
    {
      "text": "Ridiculous and often ridiculously entertaining..."
    },
    {
      "text": "Like Maverick implores his pilots, you think in this world, you're dead. 'Top Gun: Maverick' requires you to let go of good taste and instead enjoy the flight into fantasy. If that happens, it'll take your breath away."
    },
    {
      "text": "One of the greatest, oft-overlooked skills [Tom Cruise] has developed over his decade-spanning career is how to internalize the weight of time, a factor crucial to Top Gun: Maverick’s ethos."
    },
    {
      "text": "In short, Top Gun: Maverick is the most fun I’ve had watching a big dumb Hollywood blockbuster for a while."
    },
    {
      "text": "Top Gun: Maverick is good ol' cheesy as hell, silly-heroic entertainment with mile-high enthusiasm — a welcome throwback to simpler cinematic times."
    },
    {
      "text": "The sequel follows the original beat for beat, to a degree that’s almost comical. And yet, as formulaic as it is, there’s no denying that it delivers in terms of both nostalgia and reinvention."
    },
    {
      "text": "An expertly crafted, thunderously enjoyable and surprisingly emotional blockbuster."
    },
    {
      "text": "Top Gun: Maverick is as thrilling as blockbusters get."
    },
    {
      "text": "Tops the original in every way imaginable, from an all-knowing performance for the ages from Cruise to its highly emotional storyline, “take my breath away” aerial sequences and just about anything else you want from a studio blockbuster."
    },
    {
      "text": "Top Gun: Maverick isn’t just one of the best blockbusters of the year – it’s one of the best sequels of all time."
    },
    {
      "text": "In the vacuum of Maverick’s 130 minute run, a disarming wistfulness, and a friendliness, give interesting shape to what could have been mere pointless rehash."
    },
    {
      "text": "Top Gun Maverick has everything you want from a sequel and still works as a standalone film – a miraculous feat, achieved."
    },
    {
      "text": "It’s crammed with images you didn’t know you were desperate to see until the second you see them."
    },
    {
      "text": "Kosinski may not be able to match Tony Scott’s formalist bravado, but he makes up for it with speed, clarity, and a moral imperative to push the limits of what seems possible."
    },
    {
      "text": "Tom Cruise is back in the cockpit and we’re all the better for it; Top Gun: Maverick is the definitive blockbuster of our times."
    },
    {
      "text": "Whether you’re feeling the need for speed for the first time or haven’t lost that loving feeling since '86, the Danger Zone is still a pretty spectacular place to visit."
    },
    {
      "text": "Turns out we need Maverick now more than ever.  optional screen reader"
    },
    {
      "text": "Top Gun: Maverick is a rare sequel that is not only better than the original but retroactively makes Top Gun's story altogether deeper."
    },
    {
      "text": "If you haven’t been to the movies in a while, “Top Gun: Maverick” is a way to get back in. It’s pretty much what “going to the movies” is all about."
    },
    {
      "text": "Top Gun: Maverick is what you want out of big-budget summer blockbusters with insane cinematography and directing that you're going to feel like you're in the cockpit of a fighter plane."
    },
    {
      "text": "This lega-sequel builds on the groundwork laid by its predecessor, delivering riveting character drive as well as breathtaking, big screen Movie Moments. The new crew fuses the past with the present, making it a poignant, powerfully potent thrill ride."
    },
    {
      "text": "A thrilling big-screen experience that would do Tony Scott proud. Worth the very long wait."
    },
    {
      "text": "Sumptuous in its visual splendour and awe-inspiring in execution, it is unlike anything we have seen before, Top Gun: Maverick is the most exhilarating and spectacular blockbusters of its kind."
    },
    {
      "text": "The film is the rare sequel that outdoes the original in every way, delivering the ultimate theatrical experience that will have audiences convinced they've just hit crossed Mach 5 themselves."
    },
    {
      "text": "Top Gun: Maverick improves upon the original in every conceivable way, and does so in a way that might make this one of the greatest sequels ever made."
    },
    {
      "text": "It’s been a long time since I’ve seen a movie that made me think “How did they do that?”"
    },
    {
      "text": "Tom Cruise Takes Audiences On A Satisfying Trip Back To The Danger Zone."
    },
    {
      "text": "It’s rare when a sequel not only fully exceeds expectations but, at least to me, is just so much better than its predecessor, and that’s the case with Maverick."
    },
    {
      "text": "Top Gun: Maverick is so much better than it arguably has any right to be. One of the year’s best films so far, it’s a sequel that’s an improvement upon the original in nearly every manner."
    },
    {
      "text": "Top Gun Maverick is the definition of “they don’t make them like this anymore.\" A throwback to when summer blockbusters mattered; the perfect mix of heart, spectacle, and action."
    },
    {
      "text": "Top Gun: Maverick took my breath away. An adrenaline rush tailor-made for the summer blockbuster season. It gives cinephiles jaw-dropping aerial combat sequences, and packs an emotional punch that makes Top Gun: Maverick the event of the summer."
    },
    {
      "text": "You will want to high five someone on the way out."
    },
    {
      "text": "Much like Ethan Hunt in the Mission: Impossible movies, Cruise embodies the character of Maverick with all his bravado, insecurities and skeletons."
    },
    {
      "text": "It's a triumphant example of blockbuster filmmaking, proving that there are still boundaries to be pushed and elements from the past worth preserving."
    },
    {
      "text": "The movie has visceral thrills, massive peril, hard-fought and earned victories, but also captivating romance, searing drama, big emotional stakes, heart, soul, and poignant pathos."
    },
    {
      "text": "Top Gun: Maverick is the must-see cinematic experience of the year! Packed with jaw-dropping aerial sequences, genuine heart, and one of the best performances of Tom Cruise's career, this is the theatrical experience you've been waiting for."
    },
    {
      "text": "The film fully surrenders to the grandiose fun that’s marked the best of Tom Cruise’s recent star vehicles and reaffirms Joseph Kosinski as a blockbuster craftsman par excellence."
    }
  ],
  "release_year": 2022,
  "duration": 131,
  "genres": [
    "Action",
    "Adventure"
  ],
  "synopsis": "After more than thirty years of service as one of the Navy’s top aviators, Pete “Maverick” Mitchell (Tom Cruise) is where he belongs, pushing the envelope as a courageous test pilot and dodging the advancement in rank that would ground him. When he finds himself training a detachment of Top Gun graduates for a specialized mission the likes of which no living pilot has ever seen, Maverick encounters Lt. Bradley Bradshaw (Miles Teller), call sign: “Rooster,” the son of Maverick’s late friend and Radar Intercept Officer Lt. Nick Bradshaw, aka “Goose”.\n\nFacing an uncertain future and confronting the ghosts of his past, Maverick is drawn into a confrontation with his own deepest fears, culminating in a mission that demands the ultimate sacrifice from those who will be chosen to fly it.",
  "popularity": 9.9,
  "poster_url": "https://image.tmdb.org/t/p/original/62HCnUTziyWcpDaBO2i1DX17ljH.jpg"
}