{
  "movie_name": "Up",
  "movie_id": "the_day_the_earth_blew_up_a_looney_tunes_movie",
  "total_reviews": 93,
  "reviews": [
    {
      "text": "Leave it to Looney Tunes to reference classic sci-fi movies to comment on the \"corporate drones churning out unimaginative and generic products that turns its chewers into zombies\"."
    },
    {
      "text": "Whether or not you actually find yourself charmed [the film], viewers will be treated to an amusingly silly, characteristically non-sequitur-filled mashup of styles, genres, and stupidity."
    },
    {
      "text": "In bringing the animation icons to fresh life, director Peter Browngardt runs the artistic gamut with the assuredness of a true cartoon history fan."
    },
    {
      "text": "For a relatively low budget effort this looks great; there's plenty of life and movement in every scene. It may not be right up there with the classics, but what is?"
    },
    {
      "text": "It's an origins tale for Porky and Daffy, and a treat for any Looney Tunes fan, regardless of age."
    },
    {
      "text": "Those who don't grasp the science fiction references or aren't nostalgic for the [Looney Tunes] shorts won't be able to resist a film that literally explores every comedic possibility in a scene, even if many of them defy logic. [Full review in Spanish]"
    },
    {
      "text": "an absolute treat, full of eye-popping colors and laugh-out-loud moments. ... a love letter to this artistry and the humor that’s made these characters favorites for decades, and a zippy homage to sci-fi features of yore."
    },
    {
      "text": "There’s a rather hilarious gag about influencer culture early on that alone would be worth the price of admission. Blessedly, that golden jibe is but one joke in a relentless stream of verbal and visual gags in this fast, fun-filled animated lark."
    },
    {
      "text": "Best of all, the movie has been made by a creative team who fundamentally understand that, when done right, the ridiculous repartee shared by an exasperated duck and a nervous pig will never fail to entertain."
    },
    {
      "text": "In the end, this movie is far more enjoyable than you would think it should be."
    },
    {
      "text": "A delightful love letter to old school Looney Tunes."
    },
    {
      "text": "It successfully captures what makes the Looney Tunes so legendary for almost a century to form a fun-filled sci-fi adventure that will have you laughing from beginning to end."
    },
    {
      "text": "The Day the Earth Blew Up: A Looney Tunes Movie is an animator's movie. You can tell that the people who worked on this film are actual fans and understand the legacy of Looney Tunes."
    },
    {
      "text": "So no matter how entertaining the film is, audiences who grew up loving the WB's looney crew may experience some disappointment."
    },
    {
      "text": "As lofty a bar as it is for any version of this to clear, The Day the Earth Blew Up: A Looney Tunes Movie is the best Daffy/Porky adventure we've gotten since the Plucky Duck/Hamton J. Pig road trip in Tiny Toon Adventures: How I Spent My Vacation."
    },
    {
      "text": "This chaotic but charming experiment is a good reminder of the ingenuity that made these characters unforgettable. [Full review in Spanish]"
    },
    {
      "text": "The Day the Earth Blew Up made me so nostalgic for those cartoon films we’ve been missing and you can see the love put in every frame by the Looney Tunes team."
    },
    {
      "text": "There’s a special sense of history and sincerity to this one."
    },
    {
      "text": "...sporadically funny at best."
    },
    {
      "text": "It's very classic."
    },
    {
      "text": "It shows that what has worked for generations can still work today, given the right care, attention to detail and loony spirit."
    },
    {
      "text": "This style features a chaotic kind of action and explosive color palette made productions from Warner Bros. so much fun over the years."
    },
    {
      "text": "The gags — visual, verbal, and sometimes subliminal — flow in a torrent that could only have been pumped out by a tag team of cartoon veterans whose careers have crossed paths not just at Warner’s, but also at Disney and DreamWorks."
    },
    {
      "text": "The Day the Earth Blew Up: A Looney Tunes Movie struggles to juggle the rapid-fire cartoon humor emblematic of its predecessors with a singular narrative that ties the jokes together."
    },
    {
      "text": "The 2D animation style lends itself wonderfully to The Day the Earth Blew Up’s aesthetic, paying tribute to past animation styles and classic Hollywood movie genres."
    },
    {
      "text": "This movie knows how to deliver on the nostalgia for the parents, while still welcoming in and entertaining a younger generation."
    },
    {
      "text": "The Day the Earth Blew Up is far from a throwaway. The movie is actually quite entertaining. Genuinely funny. Why people played “Hot Potato” with this film makes little to no sense."
    },
    {
      "text": "Rarely does an opportunity to see the Looney Tunes characters disappoint and plunking down Daffy and Porky in the middle of a 1950s sci-fi plot is no exception."
    },
    {
      "text": "The near-dozen writers veer between ungainly slapstick, so-so meta-humor, trite cultural references, desperate puns, and occasional jarring vulgarity that can fairly be called deth-picable."
    },
    {
      "text": "Writer-director Peter Browngardt has enlisted 10 other writers to craft this blender-version of sci-fi kitsch, taking the pod paranoia of “Invasion of the Body Snatchers” with bits from such disaster movies... and then typical looney cartoon explosions."
    },
    {
      "text": "The Day The Earth Blew Up: A Looney Tunes Movie is what Looney Tunes fans have been waiting their whole lives for."
    },
    {
      "text": "Daffy as a complete beacon of chaos and Porky as his naive, stuttering straight-man of a sidekick is a dynamic that simply works."
    },
    {
      "text": "Overflowing with nostalgic appeal, this animated adventure captures the timeless spirit of its characters while infusing its throwback wholesomeness with a mischievous contemporary sensibility."
    },
    {
      "text": "No matter how many cartoonishly big mallets to the head the Looney Tunes might take, they’ll always come crawling back — and The Day the Earth Blew Up is perfect, wildly entertaining, proof of that."
    },
    {
      "text": "The Day the Earth Blew Up: A Looney Tunes Movie is a very entertaining and excellently made animated movie, and it’s a good return of these characters to the movie screens."
    },
    {
      "text": "The Day the Earth Blew Up proves that what was once old has become new again. Its 2D hand-drawn style manages to feel both refreshing and nostalgic at the same time."
    },
    {
      "text": "Feels like the movie [Looney Tunes] fans have been begging the studio for since at least the mid-90s. It's perfect. A must-see."
    },
    {
      "text": "...while this weird, zany sci-fi story is quite harmless, it also feels a bit uninspired."
    },
    {
      "text": "While the over-arching narrative design hews close to the threat inherent to [1950s sci-fi], however, this remains a Looney Tunes property and thus needs a joke premise behind it. Queue the introduction of the Goodie Gum bubblegum factory."
    },
    {
      "text": "It’s noisy, frenetic and plays like it was written by a 7-year-old who drank way too many Mountain Dews."
    },
    {
      "text": "A mostly forgettable outing for a few classic Looney Tunes characters that struggles to justify its existence as a feature film."
    },
    {
      "text": "“The Day the Earth Blew Up” isn’t arguing for the past at the expense of the future, it’s simply trying to put a modern spin on a classic formula in a way that makes you wonder why we ever left it behind."
    },
    {
      "text": "Its zany energy is a reminder of how much more these tireless characters have to offer."
    },
    {
      "text": "I feel confident calling The Day the Earth Blew Up not as good as Looney Tunes of yore while still being a fine successor in its own right."
    },
    {
      "text": "A consistent pleasure that should delight youngsters as well as nostalgic adults. It’s a shame that the folks at Warner Bros. didn’t honor their past but instead declined to release the film."
    },
    {
      "text": "The Day the Earth Blew Up is one of the most creative and fun offerings from The Looney Tunes in years, with genre-bending fun for the whole family."
    },
    {
      "text": "[This] new feature ably captures the Looney Tunes spirit, which is something our world can always use more of — and which is a far more formidable endeavor than might at first seem."
    },
    {
      "text": "The movie’s energy doesn’t pay off in dividends of real pleasure."
    },
    {
      "text": "It’s undeniably colorful and nostalgic, but I’m afraid, to quote Porky, “Tha, tha, tha, that’s all, folks!”"
    },
    {
      "text": "This film is a great time at the theater. These Tunes are definitely Looney. Much respect to the animators, voice performers, and director for staying true to these characters while also updating them for newer audiences."
    },
    {
      "text": "The laugh ratio is more hit-and-miss than in the tightly scripted shorts, but enough jokes land to satisfy most funny bones."
    },
    {
      "text": "It's old-school Warner Bros. cartoon fun -- don't you dare call it animation -- starring Porky Pig and Daffy Duck in an adventure involving intergalactic aliens and zombie-inducing bubble gum."
    },
    {
      "text": "“The Day the Earth Blew Up” puts three Looney Tunes characters at the center of the story. They’re the heroes, and their personalities are recognizable from all the old cartoon shorts they appeared in back in the day."
    },
    {
      "text": "\"The Day the Earth Blew Up: A Looney Tunes Movie\" is cute, funny, and sweet with excellent voice talent and high production values."
    },
    {
      "text": "Jam packed with jokes, sight gags and the well-worn friendship between Daffy Duck and Porky Pig, The Day the Earth Blew Up: A Looney Tunes Movie creates a world for the characters that should please old fans and get new viewers up to speed."
    },
    {
      "text": "It’s all daffy as that duck and more amusing than funny, but it’s amusing and animated in the style that will make you feel like a kid gleefully watching Saturday morning cartoons."
    },
    {
      "text": "Uninspired, repetitious, manically executed mayhem ensues, its overbearing nature more intent on creating headaches than laughs."
    },
    {
      "text": "Daffy Duck and Porky Pig thwart an insidious alien invader in a wacky original theatrical adventure. The Day the Earth Blew Up gives the beloved childhood icons a 2D, hand-drawn cinematic canvas for fun chaos and buffoonery."
    },
    {
      "text": "It demonstrates a knowledge and affection for its characters and their shared histories that Warner Brothers hasn’t bothered to muster for quite a long time."
    },
    {
      "text": "Old is truly gold with this legacy cartoon. It has screwball hilarity and deep love for the timeless characters."
    },
    {
      "text": "While this Looney Tunes feature overflows with loopy mayhem, it also feels very random. Humour is silly and broad, lacking the sharply focussed character-based gags that made the shorts such classics."
    },
    {
      "text": "This well-made and fun film will serve as a reminder to fans old and new that these characters are still here, and they’re still as looney as ever."
    },
    {
      "text": "Porky and Daffy offer up ninety minutes of madcap fun that are destined to delight fans both young and old."
    },
    {
      "text": "The Day the Earth Blew Up is an animated feature the likes of which rarely make it to the big screen, a loving throwback to the early Looney Tunes animations that can also stand on its own."
    },
    {
      "text": "While the ending loses a bit of its punch and moves almost too fast for its own good, it’s no matter––The Day the Earth Blew Up: A Looney Tunes Movie is an enjoyable exercise in updated nostalgia."
    },
    {
      "text": "A serviceable, familiar caper that isn’t the end of the world, and it might encourage those just getting to know the Tunes to dig into their tremendous back catalog."
    },
    {
      "text": "Unlike other recent animation films that strain to include pop culture references or sneering put-downs, the humor of “The Day the Earth Blew Up” captures the essence of what made those classic cartoons so funny."
    },
    {
      "text": "The Day the Earth Blew Up: A Looney Tunes Movie shows just how much life there still is in these characters and this world, and that they’re malleable enough to continue providing entertainment to every generation."
    },
    {
      "text": "There’s a glaringly exaggerated abandonment of personal safety, a shocking dependence on the employment of over-sized mallets and flagrant disregard for the forces of gravity and other laws of physics. In other words, pure fun."
    },
    {
      "text": "The Day the Earth Blew Up ends up being a great addition to the “Looney Tunes” pantheon with enough gags and craziness that it would appeal not just to the kids but also to grownups raised on these hilarious toons."
    },
    {
      "text": "'The Day the Earth Blew Up' doesn't intend to reinvent the 'Looney Tunes', but rather to restore all the good things about the franchise...to embark them on a new adventure that will make both children and adults laugh. [Full review in Spanish]"
    },
    {
      "text": "It’s a non-stop cavalcade of classic animated lunacy."
    },
    {
      "text": "The Day the Earth Blew Up: A Looney Tunes Movie is proof that legacy characters don’t have to rely on nostalgia, callbacks, or cameos to have successful modern movies."
    },
    {
      "text": "wows us from the onset with his cheeky, fast-paced, stunningly retro animation, one which embraces Looney Tunes origins yet exhibits more modern influences like John Kricfalusi's 'Ren & Stimpy' [but] the screenplay struggles in feature length format"
    },
    {
      "text": "I truly believe this could go down as one of the best Looney Tunes films of all time. Every single frame is beautifully animated with such care, while seamlessly blending visual, verbal, and slapstick gags that are guaranteed to put a smile on your face."
    },
    {
      "text": "The best part of The Day the Earth Blew Up is the film's meta self-awareness. Daffy literally winks at the camera, and director Peter Browngardt reminds the viewer they're watching a movie with fun tricks not to be spoiled in this review."
    },
    {
      "text": "Peter Browngardt maintains aesthetic continuity with his Looney Tunes Cartoons. [Full review in Spanish]"
    },
    {
      "text": "It’s not always original or well-executed, but the gags unfold at a quick clip, keeping up the entertainment value."
    },
    {
      "text": "The film’s open affection for the Looney Tunes franchise has a restorative quality."
    },
    {
      "text": "At 90 minutes with credits, director Pete Browngardt and his team do what’s needed to keep things moving without losing steam. Anyone who has fun with the Looney Tunes has a perfectly entertaining movie here to dive into."
    },
    {
      "text": "The worst thing about it is that it's crashingly unfunny."
    },
    {
      "text": "It’s the prettiest animated movie Warner Bros. has released since 'The Iron Giant,' which would make for a formidable double feature."
    },
    {
      "text": "[T]he film captures the manic, creative spirit of these characters."
    },
    {
      "text": "The antics are zany, the humor (mostly) inventive, and the outcome perhaps never in doubt but with nevertheless plenty of surprises in store."
    },
    {
      "text": "There is something for everyone in this perpetual classic comedy. Frankly, this is one of the year's funniest films."
    },
    {
      "text": "A periodically hilarious viewing experience, while Browngardt and his team offer striking, elastic visuals to support this goofy take on B-movie terror from the 1950s."
    },
    {
      "text": "... straight-up Atomic Age adventure comedy that will enchant Looney Tunes fans and young adults with a sci-fi story that delights in the daffy."
    },
    {
      "text": "The Day the Earth Blew Up is a crazy unique take on alien invasion and zombie films. The eye-popping animation is gorgeous and glorious. It captures the magic of the classics while delivering something entirely fresh and worthwhile."
    },
    {
      "text": "For new and old fans alike, The Day the Earth Blew Up: A Looney Tunes Movie is a pure labor of love that shows a deep respect for these timeless characters."
    },
    {
      "text": "I loved it. I can't wait for kids to get reintroduced to The Looney Tunes and everyone to have a wonderful time together."
    },
    {
      "text": "Daffy (whose greatest desire is to smash things with his wooden mallet) wears on the nerves after a while, but the entire project -- including a handful of fun fourth-wall-shattering asides -- is crafted with love and a genuine respect for the franchise."
    },
    {
      "text": "With crisp animation, some truly hilarious and bizarre gags, and a  plot that hearkens back to 1950s sci-fi, this is the Looney Tunes movie fans have been waiting for."
    },
    {
      "text": "There’s little doubt that for animation buffs at least, the film’s combination of reverence for the Looney legacy plus an up-to-the-moment knowing humour (Daffy’s stint as an influencer is a riot) should hit the target audience’s sweet spot."
    }
  ],
  "genres": [
    "Kids & Family",
    "Comedy",
    "Sci-Fi",
    "Adventure",
    "Animation"
  ],
  "synopsis": "That's not all folks!  Porky Pig and Daffy Duck, one of the greatest comedic duos in history, are making their hilarious return to the big screen in the sci-fi comedy adventure, THE DAY THE EARTH BLEW UP: A LOONEY TUNES MOVIE. This is the first-ever fully animated Looney Tunes feature-length movie created for a cinema audience. Porky and Daffy are our unlikely heroes and Earth's only hope when facing the threat of alien invasion. In this buddy-comedy of epic proportions, they race to save the world, delivering all the laugh-out-loud gags and vibrant visuals that have made the Looney Tunes so iconic, but on a scope and scale yet to be experienced. It's going to be out of this world!",
  "popularity": 8.8
}