{
  "movie_name": "When Harry Met Sally",
  "movie_id": "when_harry_met_sally",
  "total_reviews": 114,
  "reviews": [
    {
      "text": "It’s a perfect movie, the pinnacle of Meg Ryan’s career, and the only thing I think about when thinking about Billy Crystal."
    },
    {
      "text": "Enhanced by a dreamy mood and a quintessentially American score, When Harry Met Sally has some deft, witty observations about the nature of male-female relationships in our time."
    },
    {
      "text": "Rob Reiner's direction is feather-light, precisely paced and with fine appreciation of the sharp New Yorkisms of the dialogue."
    },
    {
      "text": "Reiner seems to share his characters’ narcissism. Or at least, like Harry, he tends to shy from troublesome emotions."
    },
    {
      "text": "Reiner and Ephron deftly thread Casablanca through Harry and Sally's on-again, off-again relationship."
    },
    {
      "text": "Anyone with even the vaguest knowledge of everything Reiner and Ephron have done thus far knows that When Harry Met Sally is their baby all the way -- wall-eyed sentimental ending and all."
    },
    {
      "text": "Despite a troubling superficiality, When Harry met Sally... delivers something rare for a summer movie -- a bright, intelligent, timely and funny comedy of adult manners."
    },
    {
      "text": "When Harry Met Sally... excels in its dead-on representation of gentle, intimate, everyday truths."
    },
    {
      "text": "Such culturally deft variations on familiar themes help make Harry Met Sally more substantial -- and enjoyable -- than the basic witty romance that it might have become."
    },
    {
      "text": "When Harry Met Sally... is pure movie magic."
    },
    {
      "text": "A well-written and well-directed movie with excellent performances from both Crystal and Ryan."
    },
    {
      "text": "A witty adult comedy whose dissection of sexual mores and relationships between the sexes manages to be delightfully old-fashioned and utterly contemporary in one stroke."
    },
    {
      "text": "Meg Ryan and Billy Crystal and a script laced with wit and occasional wisdom are not enough to make When Harry Met Sally more than a romantic comedy with a passable ability to raise a few chuckles."
    },
    {
      "text": "Despite its flaws, I like When Harry Met Sally... a great deal. It has charm and wit and style, three ingredients too often missing from movies and more important, it's mostly very funny."
    },
    {
      "text": "The things Nora Ephron's script has to say about '80s relationships are so insightful, so direct, they demand attention."
    },
    {
      "text": "It succeeds admirably -- not only making you laugh but also providing a sweet romantic refuge. It makes you want to believe in romance again, in spite of all the evidence to the contrary."
    },
    {
      "text": "The movie is a lengthy series of gags, most of which revolve around public embarrassment."
    },
    {
      "text": "Reiner and company have come up with a wonderful concoction, a humorous, perceptive and completely engaging movie about the possibilities of love and commitment in the '80s."
    },
    {
      "text": "Ephron's dialogue is nothing but platitudes, aphorisms and epigrams."
    },
    {
      "text": "it's a good movie, and literate in a way that's always welcome, but you come away simply entertained and not enlightened by any new perspective."
    },
    {
      "text": "A very polished romance indeed."
    },
    {
      "text": "Crystal and Ryan work beautifully together, and equally good are Carrie Fisher as Sally's closest friend Marie, and Bruno Kirby as Harry's prissy confidant, Jess."
    },
    {
      "text": "Cary Fisher and Bruno Kirby play the best friends of Sally and Harry, and they match the excellence of the two stars."
    },
    {
      "text": "What a pleasure it is to see a warm-hearted, intelligently written comedy in this silly season of pre-fabricated sequels."
    },
    {
      "text": "Rob Reiner gives When Harry Met Sally its own comic life, its own solid identity."
    },
    {
      "text": "When Harry Met Sally... is a terrific movie: smart, funny and wonderfully acted."
    },
    {
      "text": "There are so many nice touches here, every frame and line of dialogue is a treat for moviegoers fed up to the teeth with dazzle and trappings."
    },
    {
      "text": "This is a sophisticated romantic comedy about a pair of longtime friends who have trouble realizing they are in love."
    },
    {
      "text": "If you're a Crystal fan, and would enjoy discovering Ryan's talents, get to know harry and Sally yourself."
    },
    {
      "text": "A comedy about a relationship in which the people express feelings about themselves every minute they're together -- yet do nothing about it."
    },
    {
      "text": "Instead of sharpening an ax, Reiner sharpens Popsicle sticks to make into play knives."
    },
    {
      "text": "Nora Ephron's screenplay, consistently funny and charming, is her best work by far."
    },
    {
      "text": "Despite a few witty touches in Nora Ephron's screenplay and some touching and imaginative moments in Rob Reiner's direction, this is no fine romance."
    },
    {
      "text": "Nora Ephron has written one of the best and most influentially mock-cynical screenplays of the Hollywood year."
    },
    {
      "text": "When Harry Met Sally... is both a joyous and heart-wrenching celebration of the rocky road to love between two of the most delectably self-deluded characters you're likely to meet outside the pages of Jane Austen."
    },
    {
      "text": "We've all heard of having Christmas in July. With this lovely, funny film, Rob Reiner offers us a midsummer's Valentine's card."
    },
    {
      "text": "One heck of an entertaining movie, a heartbreaker/heartwarmer..."
    },
    {
      "text": "When Harry Met Sally... is a consistently, thoroughly funny movie."
    },
    {
      "text": "A richly satisfying and thoroughly delightful film."
    },
    {
      "text": "The deepest love, Ephron seems to say, is literally blind... If you can buy that concept, you'll smile through this film."
    },
    {
      "text": "Reiner's passions, although given imperfect shape, are the real thing, and are refreshing to encounter, as well as sympathetic."
    },
    {
      "text": "When Harry Met Sally... is this summer's date movie, well-made and entertaining but hardly brilliant."
    },
    {
      "text": "Nora Ephron... has written what might be called the ultimate relationship movie for the '80s."
    },
    {
      "text": "These people may be impossibly cute and glib at times, but of all the people on screen this summer, they may be the closest to anyone you know."
    },
    {
      "text": "An immensely winning film with some knowing things to say about friends and lovers and how the twain do meet... sometimes."
    },
    {
      "text": "Reiner and Ms. Ephron obviously are soulmates, or at least, Reiner knows how to channel his ego for the good of the project."
    },
    {
      "text": "The movie is a signal triumph for virtually all its participants."
    },
    {
      "text": "There are some films where, once you think of them, you’ll feel an urge for a rewatch. When Harry Met Sally is most definitely one of them."
    },
    {
      "text": "Possibly the greatest romantic comedy since Some Like It Hot..."
    },
    {
      "text": "It’s a story of two lost souls who put their faith in their own wrong views of love while a much easier answer may be right before them. That’s a story I can get into."
    },
    {
      "text": "Has the film contributed to a generation of romantic comedies where friendship is a consolation prize? Maybe. But its winning performances and Ephron's funny script still make the film a delight in any generation."
    },
    {
      "text": "There is nothing new here. But who said that novelty is required to spend an hour and a half graciously entertained at the theater? [Full review in Spanish]"
    },
    {
      "text": "Without a doubt, one of the best romantic comedies ever. A warm, funny and intelligent exploration regarding friendships between men and women. Full review in Spanish"
    },
    {
      "text": "\"As the archetypes for men and women onscreen for 30 years now, both the characters and the film hold up surprisingly well. The banter between the leads is believable, charming, fun, and frequently funny.\""
    },
    {
      "text": "One of the very best romantic comedies of its time."
    },
    {
      "text": "The title informs audiences they will hear about the circumstances surrounding the meeting of Harry (Billy Crystal) and Sally (Meg Ryan)... but the ellipsis suggests it is not the meeting itself that is the story. It is all about what happens after."
    },
    {
      "text": "The movie's brush strokes are bright, the finished canvas is pleasing but uninspired."
    },
    {
      "text": "It has aged perfectly. [Full Review in Spanish]"
    },
    {
      "text": "Very, very funny."
    },
    {
      "text": "Even if you don't agree with its leanings, the movie is witty enough to break down any and all resistance."
    },
    {
      "text": "When Harry Met Sally... remains the gold standard some thirty years later when it comes to the romantic comedy genre."
    },
    {
      "text": "When Harry Met Sally is a beautiful, brainy, touching and lilting romantic comedy that should touch the heartstrings of lovers and those yearning to be in love everywhere."
    },
    {
      "text": "An outright masterpiece of romance, comedy, and cinema itself."
    },
    {
      "text": "Just as fresh, witty and warm as it was in 1989."
    },
    {
      "text": "Cynically lovely and a whip smart archetype for the modern rom-com."
    },
    {
      "text": "Ephron's tart, grown-up script examines the inevitably of love finding a way despite the fight put up by this famous pair of snappy New Yorkers."
    },
    {
      "text": "Nora Ephron’s sharp script brought emotional literacy to relationship comedies."
    },
    {
      "text": "While it may be packed with whip-smart, endlessly quotable dialogue and laugh-out-loud moments, its enduring popularity undoubtedly stems from the fact that it has genuine heart."
    },
    {
      "text": "This film is your Christmas treat, and unless you die of a seasonal surfeit it will take you into the New Year laughing out loud."
    },
    {
      "text": "Quite possibly the greatest romantic comedy since Some Like It Hot."
    },
    {
      "text": "Reiner wants to maintain the sitcom sense of comfort and familiarity; he creates types that we somehow already know, slightly out-of-focus images in which we can see ourselves and our friends."
    },
    {
      "text": "When Harry Met Sally pleasantly affirms the institution of marriage while showing how difficult it is to achieve a lasting one."
    },
    {
      "text": "Reiner and his stars, Billy Crystal and Meg Ryan, are better at displaying the foibles of human natures than exploring them."
    },
    {
      "text": "The summer's uncorseted, unqualified delight."
    },
    {
      "text": "This film is a joyful respite from the kiddie fare available in most theaters this summer."
    },
    {
      "text": "What knocks it out of the park is the combination of Ephron's insights and Reiner's matchless comic chops."
    },
    {
      "text": "The fake-orgasm-in-a-deli set piece propelled Ryan into stratospheric stardom, but there are numerous other pleasures to be found in Nora Ephron's Oscar-nominated screenplay and Rob Reiner's astute direction."
    },
    {
      "text": "When Harry Met Sally... is Rob Reiner for the thirtysomething set."
    },
    {
      "text": "If you love vintage Woody Allen, you'll like the nouveau Rob Reiner."
    },
    {
      "text": "During the slow passages, I wondered to what extent the film's creators are aware of its Woodyisms, and to what degree they feel guilty about ripping Allen off."
    },
    {
      "text": "By the end, when everyone should be rooting for Crystal and Ryan to get together, the whole enterprise has long since soured."
    },
    {
      "text": "...a better-than-average romantic comedy that remains just as relevant now as it did in 1989..."
    },
    {
      "text": "Sally is special lightning-in-a-bottle stuff that every member of the production has spent precious years of their lives trying to recreate, but always failing miserably."
    },
    {
      "text": "Like Harry and Sally, the movie is hardworking, spot on; it winepresses its conversation into epigrams."
    },
    {
      "text": "This is Ephron at her best."
    },
    {
      "text": "Director Rob Reiner has a killer instinct for setting up jokes and punchlines, and is vastly aided by the performances and chemistry of Crystal and Ryan, as well as crisp supporting work from Carrie Fisher and Bruno Kirby."
    },
    {
      "text": "Fans of Billy Crystal's amphibian qualities may be amused, but the rest of us have to contend with a slavish Woody Allen imitation."
    },
    {
      "text": "Rob Reiner directs with deftness and sincerity, making the material seem more engaging than it is, at least until the plot machanics begin to unwind and the film starts to seem shapeless."
    },
    {
      "text": "Reiner's film breaks the romantic-comedy mold because it's not so much about Harry and Sally as it is about men and women."
    },
    {
      "text": "With a superb cast ... and a witty, insightful script by Nora Ephron, the film has become a universal shorthand for the way people talk about relationships."
    },
    {
      "text": "Reiner clearly likes his characters, and elicits sturdy performances from a proficient cast (Kirby and Fisher are especially fine as friends and confidants to the pair)."
    },
    {
      "text": "What keeps the momentum going, despite the story's predictability, is the dialogue and the chemistry, which makes for a high-wire act."
    },
    {
      "text": "Billy Crystal and Meg Ryan are terrific together in one of the best romantic comedies of the 1980s."
    },
    {
      "text": "A classic romantic comedy."
    },
    {
      "text": "Overrated nonsense about two people who would never date in real life."
    },
    {
      "text": "Much valued in some corners, but found downright painful in this one."
    },
    {
      "text": "What Harry and Sally do -- the true focus of this often funny but amazingly hollow film -- is saunter through the romanticized lives of intelligent, successful, neurotic New Yorkers."
    },
    {
      "text": "The best romantic comedy ever made."
    },
    {
      "text": "Meg Ryan-Billy Crystal romantic comedy is hard not to like."
    },
    {
      "text": "Provides plenty of material for a private seminar on the education of your sentiments about love, friendship, and sexuality."
    },
    {
      "text": "A ravishing, romantic lark brimming over with style, intelligence and flashing wit."
    },
    {
      "text": "The writing and direction plays with the [romantic comedy] form and your expectations alike throughout, and with such good performances the film makes for a deliciously prickly ride with laugh-out-loud moments and scenes that resonate through the story."
    },
    {
      "text": "Takes its time in exploring the long, sometimes bumpy, and often comical process by which two people might discover they are in love"
    },
    {
      "text": "We have to give When Harry Met Sally... credit for what it did: Make one of the few romance films that bears any kind of truth without also being a dark comedy."
    },
    {
      "text": "...consistently funny, with writing of the 'In a city of 8 million people, I have to run into my ex-wife!' calibre."
    },
    {
      "text": "When Harry Met Sally is alright as a piece of entertainment for a little while, but it is by far Reiner's worst film."
    },
    {
      "text": "The script is an excellent breakdown of timeless conversations between the sexes...witty repartee between the two leads, and a beautifully constructed love story that is carefully assembled over time, and gently eases you into the wonder of...love."
    },
    {
      "text": "A sweet, cheerfully vulgar, and often very funny old-fashioned romantic comedy."
    },
    {
      "text": "When Harry Met Sally . . . is an adult romantic comedy in a time when we don't get very many, and it has one thing going for it that gives it an enormous boost -- it's very funny."
    },
    {
      "text": "Although probably best known for its show-stopping deli scene where Sally demonstrates how a woman can convincingly fake orgasm, When Harry Met Sally has many other memorable moments that are funny and observant of the peculiarities of the sexes."
    },
    {
      "text": "The witty and likeable, lightweight, old-fashioned romantic comedy, When Harry Met Sally... (1989) was intended to answer the question..."
    },
    {
      "text": "What makes it special, apart from the Ephron screenplay, is the chemistry between Crystal and Ryan."
    },
    {
      "text": "When Harry Met Sally... is a sweet, embraceable comedy, a moonstruck Manhattan romance that, like a Gershwin tune, turns the sighs and glances, the spats and reconciliations, all the cliches of the heart into infectious melody."
    },
    {
      "text": "Offers an often humorous, occasionally poignant view of men, women, sex, love, and friendship."
    }
  ],
  "release_year": 1989,
  "duration": 95,
  "genres": [
    "Romance",
    "Comedy"
  ],
  "age_rating": "R",
  "synopsis": "In 1977, college graduates Harry Burns (Billy Crystal) and Sally Albright (Meg Ryan) share a contentious car ride from Chicago to New York, during which they argue about whether men and women can ever truly be strictly platonic friends. Ten years later, Harry and Sally meet again at a bookstore, and in the company of their respective best friends, Jess (Bruno Kirby) and Marie (Carrie Fisher), attempt to stay friends without sex becoming an issue between them.",
  "popularity": 8.9,
  "poster_url": "https://image.tmdb.org/t/p/original/rFOiFUhTMtDetqCGClC9PIgnC1P.jpg"
}